{
  "website_summaries": [
    {
      "verdict": "Video game enthusiasts will value the speed, smoothness, and overall quality of this model.",
      "pros": [
        "Its 1800R curve, factory-calibrated game genre display modes, black equalizer, Quantum Dot technology, swift 144Hz screen refresh rate, and HDR all come together to create an enhanced gaming experience"
      ],
      "cons": [
        "A 32” curved monitor is fine, but bigger is better"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Died withing a year, warranty charged 150 fee",
      "text": "Died within a year, pretty common problem with this panel. Warranty service charged 150 fee for physical panel damage. Monitor has been shipped back to them in perfect condition.",
      "rating": 1.0,
      "verified": true,
      "author": "Eugene",
      "helpful_votes": 21,
      "publication_date": 20181105
    },
    {
      "title": "Just like everyone in the reviews state the QC is terrible",
      "text": "Just like everyone in the reviews state the QC is terrible. It came in defective, not even plugging it to my PC yet and the monitor already keeps flickering on and off. Tried using a different power cord, cables, outlets, computers, installed latest drivers from Samsung direct site, etc.. the monitor just refuses to work for me. I cannot recommend this monitor until Samsung ups there QC on there monitors like they have their phones. I would go back to Asus monitors for they have yet to fail on me.",
      "rating": 1.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 13,
      "publication_date": 20180618
    },
    {
      "title": "Amazing Monitor",
      "text": "For $499.00 this monitor is a great option for 144hz gaming and video editing, Its a VA 10 bit panel with outstanding color reproduction and the brightness and HDR is awesome, especially great if you own a AMD Video Card with the Free Sync 2 technology. Best option is to ensure you turn off night light and turn on HDR on your display options and then enable Free Sync 2 Ultimate option with ultra fast response and 144hz, best settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Omar Zeciri",
      "helpful_votes": 4,
      "publication_date": 20190626
    },
    {
      "title": "Great monitor, stand is too large",
      "text": "The picture quality, response time, everything is great about the screen itself. The downside is that the stand is very large. It's about a foot deep. So, this monitor is not suitable if you have a small desk. I had a desk that was 24\" deep, and it was barely big enough to fit the monitor and my keyboard. The monitor ended up being too close to my face and unpleasant to use as a result. Now I have a 30\" deep desk, and that's a perfect size for this monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Holmer",
      "helpful_votes": 3,
      "publication_date": 20190825
    },
    {
      "title": "DOA",
      "text": "Model C32HG700QQN. SN: CW2WH4ZM900668. On Tuesday, unboxed and set up according to manual. Wouldn't turn on. Used troubleshooting suggestions in user manual and online. Still wouldn't turn on. Chatted with Samsung tech support agent. Ran through his troubleshooting script. Still wouldn't turn on. On Wednesday, reboxed and returned to Amazon for refund. I ordered a monitor from Dell. Very disappointed as I've had at least a half dozen other Samsung monitors and they were outstanding performers. Maybe the law of averages caught up with me.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Colgan",
      "helpful_votes": 2,
      "publication_date": 20191106
    },
    {
      "title": "Great monitor, TERRIBLE stand.  Seriously, you will need to replace it.",
      "text": "I actually love the monitor, it's big, bright and I don't have any dead pixels to worry about. I knocked off a star because the monitor stand that it comes with is an abomination and who ever designed it should be reassigned to the mail room at Samsung. It has a big goofy arm that prevents the monitor from resting flush against a back wall, so it was really cramping the real estate space on my desk. I replaced it with this VIVO stand ( and it's sooooooooo much better. It's a real shame that a $500+ monitor comes with such a garbage stand.",
      "rating": 4.0,
      "verified": true,
      "author": "The King of Nothing",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Excellent",
      "text": "I rarely give out 5 stars, but this is the best monitor I've ever had. Picture quality is awesome. Rich, bright, crisp colors, excellent response, viewing angles - hits all the marks in the many categories, though I haven't been able to test HDR. If I had to complain, there was a single dead pixel on arrival that would usually eat away at my brain, but I haven't noticed it at all. Connoiseurs will probably note some inconsistency in the backlight and pixel spacing, but again - For practical use, I'm the sort of person who would notice and I haven't.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily.L",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great overall monitor!",
      "text": "This monitor is great! The only thing I can think of that is a draw back is that you will have to choose between HDR or 1ms response time. A lot of games dont use HDR anyway, so for most games you can leave it off. It is super bright - eye searing in a dark room at close range. (good thing there is a built in eye saver mode if you like that kind of thing) The stand is great, but I used a desk mount to save some desktop space because this monitor is ginormous The FreeSync 2 on this monitor is supported by Nvidia if you want to use their Gsync. It works with my 2080ti",
      "rating": 5.0,
      "verified": true,
      "author": "Bloopity Schmooples",
      "helpful_votes": 2,
      "publication_date": 20191002
    },
    {
      "title": "Dead Pixels like the other's",
      "text": "Assembly was easy, HDR is great, okay price, great size. Gaming on it for hours then did a dead pixel test, to see a blotch of dead pixels near the upper end of my monitor. Will post picture later. I read all the other reviews after clicking buy, and dead pixels are very common on this model of monitor. Very disappointed was hoping I'd get lucky.",
      "rating": 3.0,
      "verified": true,
      "author": "Christian",
      "helpful_votes": 5,
      "publication_date": 20181105
    },
    {
      "title": "Perfect!",
      "text": "I tried the Asus VA326H 32 inch curved monitor, and I had serious issues with brightness, but that did not happen with the Samsung monitor as it has custom display settings for gaming, general surfing, and video watching. The stand (which I was very impressed with) helped me to get the monitor to fit into my computer desks height maximum (don't ask) of 20.75 inches with almost two inches to spare! Zero dead pixels, and I have nothing to complain about with the 144hz and 1ms response time. I honestly don't see how this monitor could be any better.",
      "rating": 5.0,
      "verified": true,
      "author": "Prosebeforeuno",
      "helpful_votes": 3,
      "publication_date": 20171215
    },
    {
      "title": "If it worked",
      "text": "this monitor would be great if it worked. after 30 days it started doing this stuttering problem where the screen keep shaking and it does it at the weirdest times. If it worked properly at all times as it should it would have been great however since it doesn't all it is a huge hassle and now they don't want to do a return because i'm just over 30 days. Worst experience ever.",
      "rating": 1.0,
      "verified": true,
      "author": "walter alvarado",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great for work and gaming!",
      "text": "I've had this monitor for a few weeks now and have been using every day for work and also some gaming and photo editing. Absolutely great for work - especially spreadsheets. The curve is perfect - feels very natural when you are sitting directly in front of the monitor. The monitor calibrated really nicely with my x-rite i1 - much better results than my old Samsung SyncMaster. Haven't had an opportunity to try out the Freesync as my video card is a little too old for that. Looking forward to upgrading that and getting to try out Freesync soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Hassle",
      "text": "Pretty good picture and features for the price, but this thing tends to need to be power cycled when changing between display modes, like closing a game and returning to desktop, minimizing a game, etc. It doesn't happen every time, but the display will regularly go static or black and white. When it works, it's great, but I feel like there should be zero issues like this at this price point. This shouldn't behave like an $80 bargain monitor.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua Hanner",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Backlight Bleed is so bad.",
      "text": "It was beautiful with colors. But the backlight bleed was terrible. Went back to using my old TN panel. I wish companies would take alittle time to check on the level of BLB before sending out their products. Shame on you Samsung.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim M",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "Great Monitor, great price, beautiful picture quality",
      "text": "This is a great monitor, when it was delivered, that is when I truly realized how big this 32\" monitor was. The set up was nice and easy. The packaging was clean, and well packed. After I fixed the color balance as this monitor is red heavy out of the box, I loaded up destiny in 2k 144hz 1ms response time... I said wow, the take was brilliant and beautiful, the game was sharp. I have hardly any light bleed, there is no dead pixels. The monitor does take a lot of Desk space as far as depth. Overall I am 110% pleased with this monitor",
      "rating": 5.0,
      "verified": true,
      "author": "Maria B.",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "2 Dead on arrival, don’t buy this product!",
      "text": "1st time purchasing this monitor it came out of the box with a weird “static” issue when the screen was dark, image was dark, or gaming and a dark scene came up. Spent 2 weeks troubleshooting, Samsung denies any issues. Bought 2 sets of new cables and used 2 different computers same issue. Returned for a replacement, 2nd identical item cane out of box, powered on, and no image. Backlight was on. Not even the on screen menu would come up. Samsung support tried to fix but eventually gave up and hung up. Don’t buy this model.",
      "rating": 1.0,
      "verified": true,
      "author": "JTate",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Amazing monitor, better seller!",
      "text": "Monitor is AMAZING, but be warned! Windows doesn’t support HDR yet AND it can cause your PC to crash!! This is not Samsung’s issue, it’s literally just windows. Great UI, extremely easy setup, BEAUTIFUL STAND!!! The monitor arm is quite deep but oh man is it worth it. Everything about this monitor is great. Also, the seller is great too! Bought an open-box of this, expected to see scratches or dead pixels but nothing! The monitor was in pristine condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 4,
      "publication_date": 20171228
    },
    {
      "title": "Meets all the specs",
      "text": "Just got it, but used it on full settings 1440 144 works as advertised. Faster response than the 4k 60hz I was using, maybe its the 1ms, less workload obviously too, dual cards for 4k 120hz no thanks. curved is nice freesync can make a flicker in starcraft II and loading screens. But never in gameplay for new games like BF V, but thats free sync not the monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Showed up broken.",
      "text": "Showed up broken, wet, and missing parts. After requesting a replacement I was informed it was only a short warranty. Took 3 weeks to get here. It's a MESS. 15+ calls to samsung and hours of my time. It does NOT do HDR like advertised so I suspect this is 3rd party with a samsung sticker. I wouldn't buy this again, no how no way. Way overpriced. Still doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "E J-C",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Dead Pixels, slow response for gaming",
      "text": "First one I bought had 3 dead pixels. The Second one had 2. Sent both of them back. Quality control on these is awful. Very slow pixel response with dark colors which is something that plagues most VA panels. The stand is huge and takes up way to much desk real estate. Local dimming is virtually useless in dark scenes with only 8 zones, lots of blooming.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad F",
      "helpful_votes": 2,
      "publication_date": 20191007
    },
    {
      "title": "I got a great panel with only one/two small disappointments...",
      "text": "The panel is great, its just disappointing that this display only supports DP 1.2a so if you try to use HDR/10-bit you will be limited to 1440p@120Hz. In SDR mode 1440p@144Hz works great and FreeSync has worked OOB for me. There are backlight issues that are present in most VA panels where an all black screen with very visibly show the locations of the backlights and present backlight bleed, during normal usage this is unnoticeable but might be an issue with very dark scenes. Be sure to have plenty of desk space for this display, its bigger than I was expecting (32\" version)!",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Claus",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "144hz Not terrible HDR and good reliability",
      "text": "I love this monitor. I love the curvature. I mainly use this to play rainbow six siege. It looks great simple to use and hasn't failed me yet, have had for close to a year now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Hogan",
      "helpful_votes": 2,
      "publication_date": 20190922
    },
    {
      "title": "Drooling",
      "text": "Honestly, this monitor is AMAZING. Gaming performance doesn't take too much of a hit since it's only 2k instead of 4k. So far my ONLY complaint is that the overall depth of the monitor + mount plus my keyboard, leaves little space on my IKEA desk for palm/wrist space. If anything, this monitor is a little too large. But perhaps it's just a matter of getting used to it. FYI: it comes with a vesa mount adapter so yes, it is arm mountable (contrary to the pictures).",
      "rating": 5.0,
      "verified": true,
      "author": "Cameron",
      "helpful_votes": 2,
      "publication_date": 20190822
    },
    {
      "title": "Great night time screen not so for day time.",
      "text": "It's pretty good, but keep in mind that the Freesync is going to lower your brightness to a really low level, which means you're best pleasing at night. As for the HDR it's fantastic, still the Freesync will make a lot of the HDR shadowy scenes barely visible. So for night time gaming, this is great, for movies, simple turn off the Freesync and enjoy your HDR movies up to 1440P.",
      "rating": 3.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Best monitor I've ever had",
      "text": "I have used ultra-wide and 4K monitors but this one is by far the best. My PC is more than capable enough to run games at 4k@60 but this 2560 x1440 monitor is much better at gaming than any of its higher-res counterparts. I haven't noticed any quality control issues at all. My only complaint is that after using this monitor at home it is an insult to my eyes to go to the office for work every day and have to look at a typical 1080p office display. ...",
      "rating": 5.0,
      "verified": true,
      "author": "Lord Rahl",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Update: I've had two arrive defective",
      "text": "Ok, so I went through two of these monitors. The first monitor had a weird overheating issue where the monitor would emit a high-pitched whining noise during extended play sessions. The monitor would literally get too hot to touch. I discovered this was due to a defective firmware installation from Samsung and I was unable to revert the monitor back to its original firmware. The second monitor had multiple dead pixels. Honestly, it's a fine monitor, but there are much better options out there. Additionally, the stand is designed in such a way that you require a ludicrously deep desk. It's fine when it works, but there seems to be a distinct lack of quality assurance coming from Samsung.",
      "rating": 2.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Perfect for what it is but takes up a lot of room",
      "text": "For those who are looking into this monitor, mine came perfectly fine with no dead pixels and no issue with light bleed. It looks amazing out of the box and the only issue I have with it, is the stand it comes with. It’s huge and take some up a lot of room but other than that it looks amazing. If you increase the response time, the colors will wash out a bit. Just adjust the color settings and it’ll be ok again.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachery",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Good Monitor, but be careful when you buy.",
      "text": "The monitor is amazing for gaming, yes, 144hz / 1ms. Solid monitor. However, for people with small desks to medium-sized desks, this monitor is not for you unless you use a mount. It takes up a good amount of space, especially with the arm that extends at the back of the monitor. Also, it's pretty heavy to other Samsung 32\" gaming monitors. I recommend looking at other Samsung monitors. Others are lighter and basically are the same specs as this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Abraham Choi",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Was good while it lasted",
      "text": "Have had this monitor for 6 months and today, all of a sudden a vertical line of dead pixels appeared on the right side as well as faint white, horizontal lines up and down the entire screen. Not sure what happened, hopefully i can get it repaired under warranty from samsung.",
      "rating": 2.0,
      "verified": true,
      "author": "Kam1Kiwi",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Is this a genuine Samsung monitor? Picture failed in just one year! Rip off!",
      "text": "I hope you find this useful. It is my honest feedback. This monitor is a complete POS! Here is why... It is broken after exactly ONE YEAR of use. Purchased Oct 2019, I was not impressed with the picture quality, but I kept it anyway because it was bigger and faster than my other monitors, 144Hz. The picture stayed unimpressive until yesterday when it just failed to what you see in the picture. I paid $520 for it, and I feel like i've been ripped off... Is it even a genuine Samsung product? I don't think so. AMAZON, what can you do about this? There is no warranty and it is past the return period.",
      "rating": 2.0,
      "verified": true,
      "author": "Kingsley B.",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Wall mount is 100mm VESA and the desk stand takes up a ton of room.",
      "text": "Fantastic display, got the 32” and it is a spectacle to have on a desk. I wall mounted mine because the stand is really wide and takes up a lot of space on the desk. No issues with mine so far. It comes with a VESA 100mm - 100mm attachment so you can wall mount it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Weeks",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Something is wrong with the monitors",
      "text": "About 1 year after buying these they have started to have lines all over the monitor. It is as if every other line on the monitor is not receiving a signal. On 2 monitors.",
      "rating": 1.0,
      "verified": true,
      "author": "robert drye",
      "helpful_votes": 2,
      "publication_date": 20200507
    },
    {
      "title": "The moniter itself is nice, it’s large",
      "text": "The moniter itself is nice, it’s large, curved and well built. I liked that it had a very heavy duty build but was disappointed that it arrived broken with a large crack down the center of the monitor. Definitely recommend the seller to package this better.",
      "rating": 2.0,
      "verified": true,
      "author": "Gsxrchris",
      "helpful_votes": 3,
      "publication_date": 20180305
    },
    {
      "title": "Not working out of the box",
      "text": "Did not work right out of the box brand new. Does power on but no onscreen display or anything showing on the screen. No way to reset it without the onscreen display and Samsung support wanted me to take my brand new monitor to a service provider. I dont have time for that. Heres hoping Amazon makes it right... Very very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Brewer",
      "helpful_votes": 2,
      "publication_date": 20200128
    },
    {
      "title": "Excellent monitor",
      "text": "I've had this for one year now. It has been fantastic for gaming. Love the clarity of it and the pass-through audio features. It even has a few USB ports. The stand is quite sturdy. I had this wall mounted but found I really liked it on its stand better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian Cubenz",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Great for the money. Wish panel was a bit brighter, HDR can be finicky.",
      "text": "Great Monitor for the Money, the HDR is a nice touch in certain games.. It can be tough getting the HDR to work correctly and the panel is fairly dim. the color accuracy is on par and for the money I can't complain but if I had paid more for this I would have sent it back. Its not a bad monitor and I t was priced just right, but I would have liked a bit of a brighter panel on this screen.",
      "rating": 4.0,
      "verified": true,
      "author": "pTsDaD Workshop",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Great monitor dont rely on hdr",
      "text": "So the monitor came with perfect picture no dead or stuck pixels easy setup with it set to max my gtx9704gb pulls 120 to 130 fps on wow classic maxed graphics so 1440p worked fine on that low of a card I would like to add the one conn \"I seen in other reviewers posts as well so I expected it\" the hdr is very finicky and your better off not using that feature, however the colors it displays are amazing . If you can get this kinotornon sale 500 or under it's well worth it I payed 449 on blackfriday",
      "rating": 5.0,
      "verified": true,
      "author": "dennis f otto jr",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Worked great for a little over a year..",
      "text": "Now my monitor has a dead pixel on the bottom left which I could ignore but now there is this verticle green line on the right side on the monitor. I have tried multiple and different cables (HDMI and DP) and different monitor settings and the line won't go away, I even hooked it up to another computer and the line is still there.",
      "rating": 2.0,
      "verified": true,
      "author": "Boxhead928",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Handles games well at 144hz",
      "text": "Update Amazon was quick to replace and looks great so far 😎 I give it a 5 on experience from a non cracked one which is what got me to order one.😔 Love the monitor just hope the replacement doesn’t arrive broke like this one. From what I’ve used on my brothers setup this monitor ticks all of the boxes pretty well, picture quality, refresh rate, and the HDR is not to bad not as bright as my 1,000 nit tv but still good. And still quite bright 😎",
      "rating": 5.0,
      "verified": true,
      "author": "James J. Lindsey",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Best 1440p, 144hz, HDR, GSync compatible, 1ms monitor",
      "text": "This monitor is the best option for 32”, 1440p, HDR, 1ms, Gsync, 144hz, compatible for gaming. I use a 2080Ti GPU with this monitor and the picture quality is beyond expected! Make sure if tweak the nvidia driver to use the full color spectrum for this monitor!",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Miranda",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Good picture quality, poor longevity",
      "text": "Have had this monitor for a little over a year now, and this week I noticed a little dark splotch forming at the upper left corner edge of the monitor. Various layers of the screen appear to be separating from each other, probably due to the very high heat that this monitor puts out. If I push on the black splotch, the image briefly returns to normal. My usage is probably higher than most, so be warned if you plan to use this daily for extended periods of time.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron M Gottschalk",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Think before buy.. read rewies..",
      "text": "You can see pic. Monitor has spots.. wires are uncomforbatle to use. Monitor holder is taking too much space .. Very disappointed. I am Samsung lover.. have a lot of samsung devices.. this I do not want to own",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181119
    },
    {
      "title": "A Happyish Choice",
      "text": "It is a gamers Monitor but I don't really play games that require it so I cannot address that aspect of it. But I am really digging the size and curve of it. It's big but strangely intimate. However, I cannot emphasize my displeasure at the placement and arrangement of the ports and connectors. Any change requires pulling out the monitor, leaning it over and viewing the very bottom of the monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Erg Summet",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "best monitor i ever had.",
      "text": "its a 32\" 2k 144hz hdr beast! my cat has taken to swatting at animals and small children as they appear on the screen; he never does that with any other monitor i owned; to the point where i'm worried he might scratch the screen. not good for cats but excellent monitor in the end!",
      "rating": 5.0,
      "verified": true,
      "author": "paul in alaska",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great gaming (Xbox) monitor.",
      "text": "Great monitor for gaming. I use it with my Xbox, the picture is is amazing and it keeps up with the games I play. Easy to put together, adjusts well for better viewing. Only draw back is the outlets on the back of the monitor face down, making it a little difficult to plug things in, if they faced the wall it would be more accessible. Otherwise great monitor for gamin, does everything I need it to for a decent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "I'm really loving this monitor",
      "text": "Upgrade to this from a 24 inch 144hz 1080p monitor. This monitor is HUGE and beautiful. My only gripe is that it does take a lot of desk space and the stand could have been designed a bit better. I would highly suggest not putting this directly in front of a wall(unless you have a wall mount duh) because the way the stand and arm are designed the monitor is going to need some sizable breathing room in the back. Samsung really knocked it out of the park with this otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Forrest",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "This thing looks great.",
      "text": "After i got this monitor calibrated in it looks fantastic.Looks better than my 4k samsung tv i had . I run my xboxone-x in 1440p at 60hz with variable refresh rate and hdr10 on.Only complaint i had was the cables plug in straight up the bottom,which made it harder than it should have been.But when thats done you are good to go .",
      "rating": 5.0,
      "verified": true,
      "author": "CnD",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Best monitor for pc and xbox you can get",
      "text": "Great picture. I use this as a 2nd monitor and main my xbox one on. It is hands down the best monitor for a xbox one. Freesync, 1440p, her, and 1ms get. Fast and the 144hz is great too on my pc. Only thing is it was missing some hardware due to a open box.",
      "rating": 4.0,
      "verified": true,
      "author": "FRANCIS HOANG",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Broken after 2 years",
      "text": "Having the same issue as many others after 2 years. Screen is no longer working well, the panel seems to be dying. Upset I paid this much and only got 2 years out of it.",
      "rating": 1.0,
      "verified": true,
      "author": "Toneman",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "its decent",
      "text": "great all around just disappointed with the brightness level of the monitor some games its very dark and hard to see no matter how much I messed with the settings now I just use for my laptop or ps4 I highly recommend the Alienware 34\" curved ultrawide 3440x1440p that I also have well worth the price and downright amazing",
      "rating": 3.0,
      "verified": true,
      "author": "beau roesler",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Poor poor quality and customer service for Samsung",
      "text": "We thought this monitor would be great for gaming. Have had it for less than 2 months and it completely went out. Contacted amazon and arranged to have Samsung repair it. Now Samsung is claiming a brand new monitor warranty is voided. This monitor has simple been taken out of the box and plugged in. Still has the plastic protection on the edges. We are highly dissatisfied with this product and will not be buying any more Samsung products. 600$ down the drain for a piece of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Carrie Dean",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Awesome tech, but being made in 2018 is starting to show.",
      "text": "Small features like free sync supported above with 120hz for Xbox would go a long way. The VA panel still looks beautiful and has high contrast. I wouldn’t use the HDR feature on this monitor as it doesn’t get that bright at all unfortunately.",
      "rating": 4.0,
      "verified": true,
      "author": "Trevgee",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Good monitor with terrible possition for control.",
      "text": "if you're looking for a 2560x1440 monitor this works and looks really good and overall I'm really happy, EXCEPT the control knob. Really inconvenient having to reach in the back to shut the monitor off, which I do 5 or 6 times a day. I need another monitor this size and would get the same one if it weren't for that control knob.",
      "rating": 4.0,
      "verified": true,
      "author": "Garehead",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Awesome picture and flickering easy fix.",
      "text": "Beautiful picture. Great refresh rate. There was a flickering issue, was easily fixed by changing the free sync Setting from ultimate to standard (ultimate was default). This option did not affect anything. So far best settings was RTS, free sync standard & blacklight 8.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Not 144hz",
      "text": "It never gave me 144hz refersh rate. Max I ca get was 120 on their recommendation resolution. I got Dell monitor for less than $200 and getting 140hz. Big disappointment.",
      "rating": 2.0,
      "verified": true,
      "author": "infiniteLoop21",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Nice looking gaming monitor at a fair price.",
      "text": "Works well and looks great.Has a pretty decent refresh rate,and not too expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "L.W.",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Killer screen!",
      "text": "Stoked to find out this in fact does have VESA compatibility! Great monitor! My only complaint is I have to unplug the HDMI cable and re-plug it back in almost every reboot...",
      "rating": 4.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Not HDR, terrible color, ghosts",
      "text": "Absolutely not HDR. You can see every pixel and the lines between them at normal distances. There is ghosting on any video or game, and if you turn up the response rate to 1ms the color gets EVEN WORSE. This is a terrible monitor. Save your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Bennetts Compound",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Perfect Xbox Monitor",
      "text": "This monitor was made for an Xbox one X. With the recent Xbox updates the monitors refresh rate and 1440 resolution is able to be fully capitalized on and the 1ms response time is spectacular. Arrived in perfect quality. No dead pixels and stupidly simple assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Dead and stuck Pixel issues.",
      "text": "This monitor really is awesome when it works. The picture quality of QLED tech is amazing. However, the first monitor I received had an obvious dead pixel in the center of the screen. The replacement monitor through Amazon worked fine until about 4 weeks in I noticed a group of dim/stuck pixels center right of screen. It was a small defect but would be obvious and annoying while playing games. I'm waiting on a second replacement so we will see how that goes but I'm getting tired of Samsung's lack of quality control. Maybe save your money until they have that figured out.",
      "rating": 3.0,
      "verified": true,
      "author": "Philip Dolenar",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "This is a good 144Hz FreeSync monitor.",
      "text": "This is a good 144Hz FreeSync monitor. Changing the monitor cable will help with some of the issues this monitor has out of the box. I bought this DisplayPort cable from Amazon.It's a good cable with latches/locks and it will do 144Hz and above at 2560x1440.",
      "rating": 4.0,
      "verified": true,
      "author": "d sand",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "PS4 Xbox",
      "text": "Bought for my PS4 and I do not regret at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Nuggethead",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "displayport broke within a year of buying it",
      "text": "one day out of nowhere the monitor just stooped accepting any form of display port signal i've tried multiple cables and still nothing it really sucks because over hdmi on an nivdia gpu this is pretty much just a $500 1440p 100hz monitor",
      "rating": 3.0,
      "verified": true,
      "author": "gc",
      "helpful_votes": 2,
      "publication_date": 20190719
    },
    {
      "title": "Best Monitor I have EVER owned!",
      "text": "This monitor sucks me into games! I dont even notice the edges, and I feel so immersed into my gaming! Beautiful colors! Cant go wrong with this monitor!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "it was great till a bright spot appeared on edge of screen",
      "text": "had it for a year and it was great till a big bright white spot appeared out of nowhere on the screen. seriously i know things can go bad, but after only a year and at this price? yeah no, its a 1 star for me. if you are looking to buy this monito just know it may happen to you",
      "rating": 1.0,
      "verified": true,
      "author": "axel",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "White streaks over black screen!",
      "text": "Love the picture for gaming a little trickky to get the picture just right on my xbox one, and the plain black is washed out with white streaks!",
      "rating": 4.0,
      "verified": true,
      "author": "trevor ridgway",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Failed after 3 days",
      "text": "The color reproduction looked fantastic while it was working and no dead pixels that I could see. Unfortunately mine completely stopped working after 3 days. After some research, it seems the power supply unit on this model has issues and others have had it fail shortly after purchase. I suspect that is what happened with mine, but I did not want to invest any more time or money in troubleshooting and simply returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Sean D. Gassner",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Wow!!",
      "text": "Amazing color, amazing detail. MS Flight Simulator is like looking through a window. Connected to Nvidia RTX 2080 via DisplayPort.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "I love this thing but its really heavy.",
      "text": "I have two of these and plan on getting a 3rd one day. I really love them but good luck finding a monitor mount for them. due to the weight and the width. I plan on welding together a custom mount to hang all 3 from soon.",
      "rating": 5.0,
      "verified": true,
      "author": "richard",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "A very nice monitor",
      "text": "I had been using a 34\" widescreen so this is very different. Gaming is great, basically I have been playing Final Fantasy XV, Fortnite and Apex Legends all at high settings no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Llenshaw",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Very happy with my purchase",
      "text": "144hz is excellent. Beautiful picture with lovely color, the OSD is easy to operate, one of the best i've ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Garneau",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "HDR don't mean a thing, and color accuracy is terrible",
      "text": "The color accuracy was terrible on this. I couldn't sit in a spot where i was looking dead on with all the pixels, and the viewing angles are so bad, that the outer edges are terribly discolored because of this. Terrible monitor. It also had some flicker in whiter scenes or windows. Wouldn't recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Runs Great with AMD Cards",
      "text": "This monitor meet every expectation for game play with freesync 2 and the ability to run two different monitors both freesync enabled one at 4k the other at 144Hz. just love what AMD has done with their video cards and software.",
      "rating": 5.0,
      "verified": true,
      "author": "PApsDad",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Great Monitor for my PC and my Gaming Consoles.",
      "text": "This monitor is fast and the graphics are outstanding whether I'm on my PC, or gaming consoles, or just watching a movie in my room. I'm very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "William G. Holbert",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "BEAUTIFUL COLORS. ROCKET LEAGUE, OVERWATCH, AC: ODYSSEY",
      "text": "Absolutely amazing monitor with fantastic picture quality and the best colors I've ever seen. My roommate has the MSI equivalent of this (32\" curved 1440p 144Hz freesync) and the colors in his picture were never anywhere near as vibrant as this monitor. We set them up side by side many times for co up gaming sessions. My only knock on this monitor is its how big it is. The screen is so thick, combine that with the big angled monitor stand, and you better have a big desk.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Great Monitor Rich Colors",
      "text": "Great Monitor Rich Color, Everything you want in a Gaming monitor price point performance quality, I'm not going on and on, Samsung did a great Job with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Sid",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great Monitor ***",
      "text": "Way better colors than a standard TN panel and especially after you change the graphics cards settings to 10 bit color output and output dynamic range to full. The monitor is already pre-calibrated for you and everything else works great. Local dimming is also a nice feature. 1440 is also better than 1080 resolution, but in my recommendation, have a good graphics card ahead of time to push it for games. I have a Nvidia GTX 1080 and it does just fine with it. 5 out of 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "seriuosthin245",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Dead on arrival.",
      "text": "I was really excited for this monitor and i was expected a higher quality for the price tag. And I was meet with disappointment when my unit arrived dead without being able to produce any image. I proceeded to troubleshoot and to my surprise my pc was detecting it but no image was being produced. Sadly I wont be buying any Samsung brand tv's or monitors.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "I told amazon and the shipped me a new one and I am real pleased with the monitor",
      "text": "The first one I ordered had a few dead pixel, I told amazon and the shipped me a new one and I am real pleased with the monitor. It has everything a very good gaming monitor should have, and when I am working the picture is crystal clear and text great. Love it. Thanks amazon",
      "rating": 5.0,
      "verified": true,
      "author": "rspen9",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Sound  Issue",
      "text": "Let me say this first, this product is amazing in every way possible. However, there is something I discovered today with the speakers. I tried plugging DP and HDMI ports, restarted the monitor a couple of time with no success of fixing the sound. I would really appreacite if someone can provide me with a solution to this, because it's a shame for such a beatiful monitor to have such a silly malfuntion ruining it and of course I'd like to have my money's worth work with this.",
      "rating": 4.0,
      "verified": true,
      "author": "Sal",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "DOA",
      "text": "Dead on arrival (turns on, detected, no picture) and tons of backlight bleed. Samsung support almost immediately said to return it, at least they were efficient.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Great Jack of All Trades Monitor",
      "text": "Great monitor. Coming from a 24 inch tn panel at 60hz, this monitor feels like an amazing piece of engineering. The image quality and the smoother motion are very nice. I love that the monitor can pulse its backlight at 100, 120, and 144hz. My monitor has no stuck pixels and no obvious imperfections in the contrast or brightness. Im not aware of a monitor with a better and more complete balance of features. I got mine for $500 and would highly recommend this monitor at that price.",
      "rating": 5.0,
      "verified": true,
      "author": "William Macey",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Longevity?",
      "text": "I have had this monitor for a year and been very happy with it. But when I turn it on it has started to have issues with the display for a good 10 mins or so. My second monitor is not producing artifacts so I know it's not the gpu.",
      "rating": 3.0,
      "verified": true,
      "author": "nam",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great quality",
      "text": "I love the feel has the good quality feel/ weight of ya catch my drift.love how you can rotate the entire screen. Menu is somewhat confusing but easy once you get the hang of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "It looks amazing but I had to return it because the power ...",
      "text": "It looks amazing but I had to return it because the power cord constantly came unplugged on its own.",
      "rating": 4.0,
      "verified": true,
      "author": "Liam Lipham",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "A superb monitor right out of the box",
      "text": "I screwed in four screws, plugged in two cables and this monitor was instantly incredible. I was borrowing Samsung’s 34” ultra wide 100hz and this blows it away. I get better performance due to fewer pixels and the color and blacks appear far better. It has a less plastic feel to the build as well. The stand makes the height and angle easily adjustable and it stays were you put it. In short, this is a great gaming monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "CultClassic",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "I am a risky guy",
      "text": "I like to roll the dice on refurbished products because of purchases like these. I got a great discount on this monitor and it has no dead pixels, the picture quality is amazing and I have absolutely no issues with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Works",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "GReat gaming monitor",
      "text": "Been using it for about 2 weeks now and its brilliant. The HDR feature is one of the best parts of the entire screen. i would recommend this monitor to anyone who wants to game at high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "connor mead",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Highly recommend this product",
      "text": "I love this monitor I was super worried about the curve for gaming but it’s the perfect amount. You deffently fall right into you game and the graphics and refresh rate are amazing",
      "rating": 5.0,
      "verified": true,
      "author": "AU$TIN",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "brightness and color is amazing. it made my old LED screen looks dim ...",
      "text": "brightness and color is amazing. it made my old LED screen looks dim and bluish. 144hz refresh rate is wonderful to look at, but you do need a VERY powerful PC to run modern games at that frame rate.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven J Hinterleitner",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Annoying sub line under text",
      "text": "Note there will be constant a subline under every text.",
      "rating": 1.0,
      "verified": true,
      "author": "S.L.",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Great monitor stand takes up a lot of room",
      "text": "Love the picture of this monitor. Wish I knew how deep the stand was needs a large desk",
      "rating": 5.0,
      "verified": true,
      "author": "Doris Johnson",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Soooo good I had to get TWO!!!",
      "text": "Its the best monitor for xbox one x 1440p 144hz. It took me a long time to find a good monitor for my xbox and I end up getting this with no REGRETS.",
      "rating": 5.0,
      "verified": true,
      "author": "Yahdawn keith",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "game time!",
      "text": "Working great so far, even got here like 5 days early",
      "rating": 5.0,
      "verified": true,
      "author": "De ATLien",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Stand could be smaller",
      "text": "I'm super happy with my purchase and I personally have nothing major to complain about. I do find that the stand provided with the monitor takes up more space than it probably should.",
      "rating": 5.0,
      "verified": true,
      "author": "Cris Cooper",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Excellent Image",
      "text": "Haven't had much time with it yet but very happy with this purchase. Just make sure that your desk is deep enough as it does take up a good amount of space. Only issue was UPS leaving this on my porch in plain view of the street. We have a row of bushes and if they just moved it to the side a few feet it would have been hidden. Either UPS needs to be better or Amazon needs to double box it to hide the product.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Great monitor. Stand too big. Power cable much too short. But other then that its amazing.",
      "text": "This thing is HUGE! I LOVE IT! Everything is great EXCEPT the stand is way too big and the power cable is ridiculously short I cant believe more people dont mention it in their reviews",
      "rating": 5.0,
      "verified": true,
      "author": "Thaddeus g.",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "It sucks",
      "text": "Do not buy it expensive and it start having problem after 2 week you can get a better monitor for cheaper go for a lg and hdr doesnt even work right, this is the worst monitor you can buy for gaming.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon duran",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "BIG!!!",
      "text": "Loved the screen and speed, also the curved part really pulls you into the action!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaley",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Kinda hard to find a good mount for it bc it's pretty heavy but the ...",
      "text": "Kinda hard to find a good mount for it bc it's pretty heavy but the picture is very good as to be expected with a brand like Samsung.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Joseph Shindelar",
      "helpful_votes": 0,
      "publication_date": 20180327
    }
  ],
  "product_meta": {
    "title": "Samsung C32HG70 32\" HDR QLED 144Hz 1ms Curved Gaming Monitor with Freesync (LC32HG70QQN), Dark Blue Black(Matt)",
    "description": "Size:32 Inch| Style:Single1800R curvature Samsung monitor. Hdr gaming monitor with QHD resolution. Quantum Dot technology and 1ms response time.",
    "rating": 4.2,
    "feature_bullets": [
      "Quantum dot and aspect ratio 16:9",
      "Response time 1M/s.Brightness:350cd/m2 (Typ.), 300cd/m2 (Min.)",
      "1 billion color support. Operation Conditions Temperature 50 104 degree Fahrenheit",
      "QHD resolution , Temperature 50~104 °F",
      "Refresh rate 144Hz. Product Dimensions With Stand 28.51 x 24.48 x 14.98 Inch. Product Dimensions Without Stand 28.51 x 16.71 x 4.55 Inch"
    ],
    "specifications": {
      "Standing screen display size": "31.5 Inches",
      "Max Screen Resolution": "2560 x 1440 Pixels",
      "Brand": "SAMSUNG",
      "Series": "C32HG70QQN",
      "Item model number": "C32HG70QQN",
      "Item Weight": "15 pounds",
      "Product Dimensions": "28.5 x 14.98 x 24.4 inches",
      "Item Dimensions  LxWxH": "28.5 x 14.98 x 24.4 inches",
      "Color": "Dark Blue Black",
      "Manufacturer": "Samsung Electronics DAV",
      "ASIN": "B06XT6WQCJ",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 14, 2017",
      "Customer Reviews": "4.2 out of 5 stars905 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#13,813 in Electronics"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": ""
  }
}