{
  "website_summaries": [
    {
      "verdict": "The swivel head of this powerful model offers unmatched maneuverability. Attachments include a Turbo Claw pet tool.",
      "pros": [
        "The swivel head allows the user to vacuum around furniture and corners without turning the entire frame",
        "The powerful four-brush roller provides great pick-up power",
        "The superior reach of the cleaning wand attachment and unique design of the Turbo Claw pet tool makes the Razor a great choice for cleaning stubborn pet hair from furniture and drapes"
      ],
      "cons": [
        "Because of its top-heavy design, this model tends to tip over when in its full upright position"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A great little vacuum made especially for pet owners.",
      "pros": [
        "The powerful suction and brush can take on tough pet hair",
        "Maintains suction even when using the extendable hose",
        "Canister is easy to remove and clean",
        "Swivel head works well to get around corners and under furniture"
      ],
      "cons": [
        "Top-heavy and doesn't work well on hard floors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The swivel steering and turbo claw pet tool make this vacuum a good option for users with shedding pets.",
      "pros": [
        "The 10-foot hose is one of the longest on any model we considered",
        "Turbo claw pet tool removes pet hair and other difficult debris from high and hard to reach areas, including crevices and upholstery",
        "Dust cup detaches and empties easily",
        "Swivel steering and light weight allow for maximum maneuverability"
      ],
      "cons": [
        "No carpet height controls, so may not be good option for hardwood or very thick carpet"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Most amazing vacuum ever!",
      "text": "Most amazing vacuum ever! If you have a dog that sheds profusely like mine, you need this! My dog doesn't shed little hairs, she sheds big black fuzz balls... the kind that are usually harder to vacuum up. Whats also great is thats its super light, and so convenient as far as emptying and using the wand, and just in general.",
      "rating": 5.0,
      "verified": true,
      "author": "G.C.",
      "helpful_votes": 91,
      "publication_date": 20170823
    },
    {
      "title": "As a pet owner with birds and a Great Pyrenees, I needed a powerful vacuum that could ...",
      "text": "As a pet owner with birds and a Great Pyrenees, I needed a powerful vacuum that could handle dropped nuts/pellets and a massive amount of never ending fur. And it's amazing. It's easy to use, pretty lightweight and turns well. Its suction is excellent. My last vacuum I had to set it up to use the hose: this just pull it up and it's ready. Few good sweeps and the area around the cages is clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 68,
      "publication_date": 20180128
    },
    {
      "title": "Real customer, not a promotional test",
      "text": "I just got this vacuum. I have a small apartment with a single cat. This thing is amazing. I vacuumed 2 days ago, now granted I know my old vacuum is failing but this got up so much stuff for such a short period of time between vacuuming. It's lightweight and very easily maneuvered. It has great suction, you can feel its resistance as you pull back. I also like the long neck and hose so I could reach dust and cobwebs high on the walls and on the ceiling. First go around for this thing but I am quite pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather MacInnes",
      "helpful_votes": 103,
      "publication_date": 20170706
    },
    {
      "title": "IT WORKS 100 % ON ANIMAL HAIR",
      "text": "At last a vacuum cleaner that does just what they say it will ! This little gem picked up so much animal hair it was shocking. With a furry dog and three cats I needed help. I had bought 2 other expensive vacuums that did not pick up animal hair. This vac is very easy to push around ...I love the swivel feature. The canister holds a good bit of dirt/hair and is easy to empty. There's not a single thing that I don't like about this product. The price was excellent. If you have animal hair on your carpet you NEED this Dirt Devil !",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 54,
      "publication_date": 20170805
    },
    {
      "title": "Let's see if they will stand by there product and replace it",
      "text": "I use this vacuum cleaner the first day I receive it to remove pet hair from my hard wood floors and carpet and it worked like a charm until today October 18, 2017, I empty out the vacuum and put it back in correctly as I always do after each use but this time it would not power on, I try all outlets in my house still no power. I decided to trust dirt devil instead of othe brands because of price and style but I was close to purchasing a bissell pet hair eraser and now I wish I would have because this dirt devil only last a month",
      "rating": 1.0,
      "verified": true,
      "author": "Shane Antonio Benitez",
      "helpful_votes": 46,
      "publication_date": 20171018
    },
    {
      "title": "Broken right out of the box, Dirt Devil support isn't helpful at all.",
      "text": "Broken right out of the box. The maneuverability was great, but the suction handle never worked. I think it's because the pipe connecting the suction motor to the pipe that the handle uses is such a cheap plastic that it jams and doesn't transition from Upright vacuum to suction handle. Therefore, I can only use this for carpet, and can't use the tool itself. Trying to call Dirt Devil support is useless and they rarely ever answers. When you do get someone the call magically \"disconnects\" when you start explaining your problems or they just suggest you spent 100$ shipping an 80$ vacuum back for service that can take up to 6 weeks to get back.",
      "rating": 1.0,
      "verified": true,
      "author": "Travis Cannata",
      "helpful_votes": 40,
      "publication_date": 20171213
    },
    {
      "title": "Cheap Brittle Plastic",
      "text": "This vacuum arrived in pieces. It was mailed in it's original store box without any other protection. It is 100% plastic. There were many small broken pieces of plastic and the head was snapped off from the body. We did not order an exchange. This is clearly a cheap brittle plastic vacuum cleaner.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 26,
      "publication_date": 20180716
    },
    {
      "title": "Can’t purchase broken belt!  Useless as a upright!",
      "text": "Do not buy! I feel in love with this vacuum only to be let down when the belt broke about 3 weeks after I purchased it. Should have not been a big deal, except there is not a replacement belt available. Even tried other brand of belts, nothing fit! Tried calling customer service only to wait, wait, wait.....got fed up and hung up. Will not purchase a dirt devil again!",
      "rating": 1.0,
      "verified": true,
      "author": "Shane F",
      "helpful_votes": 21,
      "publication_date": 20180113
    },
    {
      "title": "Good vacuum",
      "text": "So far so good. It has such powerful suction and brush movement it is practically self propelled on carpet, and works well on both my low carpets and hardwood. I have cats and a long haired dog, so it is getting a workout. Unlike my old (cheaper and with less tools) dirt devil, it isn't very loud. The only complaint is with how powerful the suction is--take care going on to area and throwrugs; it can suck the edge right up and then you have to turn it off and pull six inches of a rug (or bedspread, etc) out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20171202
    },
    {
      "title": "My #1 choice in a vacuum...",
      "text": "Update: Amazon has covered the cost of the repair - and this baby is alive and well... I actually bought a Bissel, but seeing how quickly this one was fixed and it’s working like new - I returned the Bissel - this baby is all I need!! Bought it Sept 2017, Feb 2018 its DEAD... :( it was absolutely great while it lasted though.... but I expected it to last longer for the price point....",
      "rating": 4.0,
      "verified": true,
      "author": "SonyaTop Contributor: Pets",
      "helpful_votes": 9,
      "publication_date": 20180223
    },
    {
      "title": "A+ Vac for the PRICE!!!",
      "text": "As soon as i took it out the box it was two clicks and it was ready to go! I even pre-vac'd the one room with my old Hoover and on my 2nd pass with this vac, I was not disappointed. Everything is made cheap today so do worry yourself with comments on this particular vac or any other, just the way of the world now... CHEAP. But as far as working quality this vac did the job better than expected, and for $89 it's worth every penny. UPDATE******* 8/24 Vac burnt up/over heated... not working anymore. When it was working it was a beast! Warranty was for 2 months? No wonder..",
      "rating": 1.0,
      "verified": true,
      "author": "Ricardo Villa",
      "helpful_votes": 4,
      "publication_date": 20190426
    },
    {
      "title": "Good value vacuum!",
      "text": "I bought this a month ago and so far it works really well. I like some of the aspects of the design like the wand and attachments. It swivels and moves very easily so that even my 7 and 9 year old can use it too. My least favorite aspect of this vacuum is that is is easy to tip over and the canister does need to be emptied pretty often, maybe 2-3 times while vacuuming my 2000 square feet house (I guess that could be considered a good or bad thing?) Overall, I would recommend this vacuum and would buy it again!",
      "rating": 4.0,
      "verified": true,
      "author": "A. S. Cox",
      "helpful_votes": 7,
      "publication_date": 20171008
    },
    {
      "title": "Horrible Vacuum",
      "text": "Purchased this vacuum to help keep a small area rug clean from pet hair and dust. The suction on this vac is horrible. When cleaning pet hair, the roller leaves a trail of hair when the vac stops and starts. You end up with lines all over your carpet that you ha e to go back and get up. After 3 months of use the suction power COMPLETELY stopped. This was a complete waist of my monery!!! Do t purchase this vacuum!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Terrie Lowery",
      "helpful_votes": 9,
      "publication_date": 20171020
    },
    {
      "title": "Small form-factor, great suction, incredible maneuverability",
      "text": "So small! Sucks so good and so hard! They aren't kidding with the name \"Razor.\" This dude turns on a dime with a slight twist of the wrist. It can easily turn over 180° without you needing to move much, and can almost turn face you if you needed it to. It also can be used on hard floors with 0 transition on your part. I don't know what voodoo-ry this is, but it is crazy versatile with no effort needed.",
      "rating": 5.0,
      "verified": true,
      "author": "The Captain",
      "helpful_votes": 3,
      "publication_date": 20190423
    },
    {
      "title": "Amazed at how much it picks up EVERY TIME",
      "text": "I don’t write reviews. My boyfriend had heard me talk about this vacuum more than I’d like to admit. I just honestly am amazed each time I empty it out. It’s incredible! Walking around barefoot because that thing makes my floors spotless and dog hair free. It has really nice swivel and can get under the couch and chairs easily because it almost goes flat. The attachments for fabrics and baseboards are awesome too. For that price too it’s honestly the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190212
    },
    {
      "title": "Love it",
      "text": "3 cats = hair and litter tracking. I was amazed at the amount of hair it picked up even though I had been vacuuming regularly with another vacuum. I have a mix of carpet and hard floor surfaces. Easy to use, attachments are cleverly designed. The only reason I didn't give it a 5 for stairs because all vacuums are awkward on stairs unless it is a built in. It wasn't expensive so I wasn't expecting to like it as much as I do. Very good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Good",
      "helpful_votes": 2,
      "publication_date": 20190415
    },
    {
      "title": "Thumbs up!",
      "text": "I never realized the pitfalls of buying a vacuum cleaner. I can not remember the brand of the upright I had for many years and was quite satisfied with. Then I bought an inexpensive one from amazon and quickly regretted it. Years ago, I had a Dirt Devil which I really liked, so I decided to go for another one. The upright purchased is perfect for my needs. The wand attachment is connected and easily accessible. It cleans like expected. The only gripe is the on/off control and brush switch are in an odd place and took a while to find. It is a very good, priced right on Amazon vacuum. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Jellybean",
      "helpful_votes": 2,
      "publication_date": 20181130
    },
    {
      "title": "Tough on pet fur. Durable. Would recommend.",
      "text": "This vacuum has lasted against my dog’s hair where other pet vacuums have choked. We have a VERY hairy shepherd/husky mix. So far, no clogs and no messes this thing can’t handle. Emptying the canister is super easy and quick. The attachment arm is handy and easy to use. The entire unit is light enough to be easily carried around the house. It steers well on carpets of varying heights. Taking it apart to clean is also pretty simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Arianna",
      "helpful_votes": 3,
      "publication_date": 20181130
    },
    {
      "title": "Stop looking. You've found the vacuum of your dreams.",
      "text": "I never write reviews on anything. I just vacuumed yesterday and got this bad boy today. I figured I'd test it out. I was in complete shock and disgust how filthy my carpets had been. I only vacuumed my living room which is super small and my short hall way....I couldn't believe my eyes. For anyone with pets and kids. Hell anyone who wants a super clean floor. Stop looking this is the vacuum to go with.",
      "rating": 5.0,
      "verified": true,
      "author": "Cmoya",
      "helpful_votes": 4,
      "publication_date": 20190801
    },
    {
      "title": "*Only lasts a year",
      "text": "I had this vaccume for 1 year. The suction was great... Actually had trouble vaccuming rugs because the suction was so strong. But upon arrival the very first day the connection from switching to the floor or the handheld didnt work. I took the cover off and the spring wasnt properly put in. No problem I fixed it myself. But after only a year the vaccume burnt out. I cleaned all the parts by hand every week. We have multiple pets..I have to vacuum every 2 days. The vaccume simply just stopped working while vaccuming one day. I got it on sale from Amazon for $80. Don't buy if you are looking for a long term appliance.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20171121
    },
    {
      "title": "Worth every penny!",
      "text": "I love this product!!!! I just vacuumed the night before with a different vacuum and let me tell you.... I didn’t think there would be much to pick up because I was super excited about using it I gave it a try!!!! I was shocked to see what came up out of the carpet!!!!!! It was quite a bit of hair and dust looking particles. I love the ease of this vacuum the only down fall is that it’s top heavy but really not an issue though it just has to be leaned up against the all when parked. I have bought multiple vacuums and by far this had been the best to get the job done!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerrie Brashier",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "I had no idea our floors were that dirty.",
      "text": "We thought our floors were clean, but when we ran this vacuum over our floors just to see how it worked, how easy it'd be to use, and how loud it would be, we discovered just how wrong we were. The canister was over a quarter full with just the kitchen and dining room. By the time we'd gone over the whole house, including the large area rug in the living room, we'd emptied the canister 3 times. Guess our broom was totally inadequate. This, on the other hand, sucked up lots of dirt, and was super easy to use. Now when we need to sweep the floor, we just grab this thing, plug it in and vacuum instead.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Gwynn",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "OBSESSED.",
      "text": "OBSESSED. My husband and I are just amazed. Prior to this vacuum we thought we had decently clean carpets. We do have 2 dogs but we sweep once a week to sometimes twice. After opening the vacuum last night, I swept just the downstairs carpets in the living room and literally filled the sweeper to its max line with dog hair. SERIOUSLY.. This is such a great product. TOTALLY recommend for people with pets. And you really can't beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Sealscott",
      "helpful_votes": 12,
      "publication_date": 20170914
    },
    {
      "title": "Disappointing",
      "text": "The vacuum does not have the best suction and now has stopped working properly, only sucking from the hose and not through the main vacuum. The hose attachments dont allow for peoper suction - while the ‘claw’ is a good idea in theory to pick up dog hair, it doesnt really work effectively as does not allow for strong suction. The other attachment os lame too. All in all, I wish I had got it from Best Buy with the. Insurance and Inwould be returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Dripping In Paint",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Amazing but will get overheated",
      "text": "Great vacuum for pet hair. I had both a shark and a bissel previously and they both died around the same time, so I needed a good but cheap replacement. I was very surprised by how well this dirt devil works! it definitely gets up all that dog hair. I really want to give five stars, but after a while, the vacuum will become overheated and the bristles will stop spinning. it happens almost every time I vacuum. I let it sit for a few minutes and it’s fine when I come back but it’s not perfect. Either way, I still recommend this vacuum to anyone who wants a good deal on a decent vacuum",
      "rating": 4.0,
      "verified": true,
      "author": "marlee",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "You get what you pay for!",
      "text": "This vacuum has all kind of problems, the bearings on the beater bar heat up and put a smell off like burning rubber. The cord is way too short and is a pain to vacuum a house. The beater bar gets hair wrapped around it and is very hard to get off, bad design. The collector is hard to clean well. I really wish I had not bought it!",
      "rating": 1.0,
      "verified": true,
      "author": "Randy L. McArthur /Trimcraft L.L.C.",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Highly recommend for pets",
      "text": "Love this vacuum! Read the reviews before purchasing because I have a border collie that sheds a lot. I also deep clean my carpets with a steam heat vac and I swear this vacuum picked up SO MUCH dog hair you’d think I never cleaned in my life lol. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Worth every penny",
      "text": "This is amazing for pet hair. I have a shiba and shepherd. I’ve never used a vac in20 years that picks up hair and dander like this. See video which doesn’t do it enough justice. Empty is easy and it does require 2 hands at time if you don’t frequently empty it or go over the max to take the top off but it really is worth every penny and no loss of suction in over a year of heavy use and over filling as you see in my video",
      "rating": 5.0,
      "verified": true,
      "author": "ktconsumer",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "... up over time but so far this thing is great. I bought it because my dyson stopped working(brush ...",
      "text": "We'll see how the vacuum holds up over time but so far this thing is great. I bought it because my dyson stopped working(brush stopped spinning). This thing gets pet fur off of carpet 10x easier than the dyson did when it was working. The suction seems like it might be slightly less than the dyson but overall it works better. It's also very easy to maneuver and use. I really like this vacuum",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 3,
      "publication_date": 20170907
    },
    {
      "title": "Impressive vacuum",
      "text": "I have to tell you, this little, light weight, bagless vacuum is everything I wanted. Replaced another brand bagless vac for my cats room, yes my two cats have their own room. Easy to put together, truly light weight, super easy to empty. Picks up the cat litter without throwing it and maneuvers with ease. I was apprehensive to order a Dirt Devil, but this little vacuum is a dynamo. Thanks for a great vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Great suction, quality sucks too.",
      "text": "At first, I thought this was an amazing vacuum. I have two large, long haired dogs and a small apartment, so a good vacuum is necessary. It did such an amazing job getting the dog hair out of my carpet. Again though, at first. After a month and a half of use, maybe twice a week, the bearing in the brushroll burned out and the vacuum stopped working. Now, after two months of emails with dirt devil, I finally called today and they are sending a new brushroll. Oh, and the 6 month warranty doesnt cover the brushroll. That's only good for 60 days. Will not be buying another dirt devil product. Ever",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremiah Howard-Crowley",
      "helpful_votes": 2,
      "publication_date": 20190225
    },
    {
      "title": "Works great! Now",
      "text": "I was looking to buy another shark vacuum as i already have one and noticed this one.I thought it was a shark but didn't realize it till i had bought it. I thought,what the heck,i'll give it a shot. Got it today.Unlike some amazon buyers,i did not have any issues with it.Works great! Now,i vacuumed a couple days ago and couldn't believe how much stuff was coming up.The canister was filling up pretty fast. I swear to god the rug in my kitchen got brighter! Newer.Yeah, i'm glad i didn't get the other brand. Paid around $90 and some change.",
      "rating": 5.0,
      "verified": true,
      "author": "Lise",
      "helpful_votes": 2,
      "publication_date": 20170831
    },
    {
      "title": "LOVE IT",
      "text": "I just received this the other day but so far I LOVE IT. In just the first use it picked up SO much that my other vacuum had been missing & it did it sooo fast. My carpet has never felt cleaner, it definetly gets pet hair up, & it works well on my laminate floors too. It's super easy to maneuver. Of course it makes noise because it's a vacuum but it's not overly loud & just does such a good job. So far I am super happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Perfect lower-cost vacuum for pet owners",
      "text": "I've only used it once but I'm already in love. I can't speak to use over time, but this vacuum picked up so much more pet hair than our last one. Literally half the canister was hair by the time I was done. It was also super easy to empty, and the long suction attachment was very helpful in vacuuming under the bed. Updated after some time: still a great vacuum despite us not using it a ton anymore. We ended up being gifted a robot vacuum so we use that. I do occasionally still use this for deep cleans and areas that the robot can't get to. Honestly no problems to report.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca B",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Pet Vacuum",
      "text": "For the price, it is a good vacuum. It picks up hair well but wraps it around the roller brush which you then have to remove to clean. I would think a vacuum made especially for pets would have a self-cleaning function for hair. I do like that fact that the parts are washable, though.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Moore",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Super performance, especially if you have pets.",
      "text": "This little thing is amazing! As a test, I vacuumed our carpet with our $800 Riccar Brilliance vacuum, a heavy duty, prime quality machine. Then I immediately followed up by vacuuming with the Dirt Devil. It picked up so much dirt and pet hair, I had to empty the collector twice! The Dirt Devil was bought as a supplemental unit, with its light weight being easier for my wife to handle. But, because of its performance, it has become our daily go-to vacuum. The Riccar is going on Craigslist!",
      "rating": 5.0,
      "verified": true,
      "author": "John H",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Seems to pick up OK, but durability isn't great",
      "text": "The vacuum works pretty good, however the swivel part of the handle seems like it will be extremely easy to break, when finishing vacuuming, and standing the vacuum bk up, it has already fallen over several times.. Also, and this is my over site but it has a replaceable filter, meaning another will eventually need to be purchased instead of simply rinsing it out.. I have reached out to seller and started a return.. The vacuum did come on time, and does seem to work well for the most part, but with 2 pets and 4 children, it just doesn't seem durable enough for our family..",
      "rating": 3.0,
      "verified": true,
      "author": "tiff",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Buy it",
      "text": "I was hesitant to get this vacuum but after going through my whole house with it, hardwood, area rugs and all... it holds up well and gets all the pet hair and dust out of my floors. I run an inhome daycare and the kids constantly have crumbs and stuff on the floor and this cleans it up very well. Worth the price",
      "rating": 5.0,
      "verified": true,
      "author": "Jj",
      "helpful_votes": 2,
      "publication_date": 20181225
    },
    {
      "title": "Sucks in the best way",
      "text": "Disgusting what this picked up off my area rugs (3) AFTER vacuuming with my old dyson dc41 that was on last legs...and it is now in the \"to trash\" pile. I have never had a DD upright but pretty happy so far. 1500 sq ft home, 2 cats, 1 sometimes shepard mix dog. My critiques...the wand portion is way too short....it could do a better job of pulling dirt from the edge of the wall/baseboard...it is so lightweight that its almost too light. falls over easy. on the flip side of that its easy to handle and carry up and down the stairs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Too lightweight",
      "text": "First of all, I like the swivel design, and the smaller vacuum roller is actually nice. It's easy to get into smaller spots. Suction and cleaning seemed ok. I actually disliked how lightweight it was. When you try to use the short, slightly stiff attachment hose, the vacuum falls over. It seems like a little more weight would solve this problem. It's an ok vacuum, but I'm returning.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "No pets, but a lot of hair Works great!",
      "text": "-Ok, so I got this bevause I was shedding a lot and old vacuum was not picking up hair out of my weird carpet. -It sucks up ppl hair, crumbs, dust, and really ground in dirt like a pro! Unforrumetly I never tried it with animal hair. -The suctiom is amazing and still awesome on hard floors. 10x better than just sweeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Reb. L.",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "I use it for my entire apartment and love how clean it gets my floor",
      "text": "I have two cats that shed a ton. This vacuum is very convenient to use in that it is light but very powerful. It gets all of the cat hair and it also picks up the stray litter on the floor. I use it for my entire apartment and love how clean it gets my floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Dayna",
      "helpful_votes": 5,
      "publication_date": 20170916
    },
    {
      "title": "Lasts even though people say it doesn't",
      "text": "I was super worried at first because of the reviews but I got it anyways. Let me tell you, I love my dirt devil!!!!! Ive had this dirt devil for a year and four months with no issues at all. It's still going strong even with the work load ( 2 big dogs a husky and golden retriever along with a 3000 sq ft house) I have never had any clogs or loss of suction. I would recommend this vaccum to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Munoz",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "impressive quality for a fair price",
      "text": "So far I love it. It truly pick up the pets hair (I have a Labrador and a Maine Coon). Perfect size for small room,easy to manuver and not heavy. The answer for those that live in apartment or have lots of furniture. Easy to clean and quiet. Hopefully it will retain suction and last the test of time. I will update as the vacuum get older.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Great Power, Functionality, and Style",
      "text": "This is a really good vaccume. We have two cats and two rabbits and they make a huge mess of fur, hay, and little round bunny poops. We need to vaccume our carpets pretty regularly. It picks up all the hair and debris really well we just clean off the brush every so often. The swivel feature is so useful for getting under and around furniture. The part that comes out of the top with the handle to reach with the tube is also very useful. Its easy to empty out the contents. It is also really powerful and stylish for a vaccume. We are happy we invested in getting it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great Vacuum For The Price",
      "text": "Really great value. I was especially pleased that this vacuum did not require any assembly... not even a screwdriver. I just pulled it out of the box, removed some plastic and was ready to vacuum. The swivel head works great, as do the attachments. The cord could be a little longer, but that's really my only gripe. It's such a great value for the price that I ordered a second one for downstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel ",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "I love it! Great suction power and light weight.",
      "text": "The only issue I have had is some of the more important parts are made of plastic and *will* break after the warranty ends and the parts are not available for repair. Nothing a little epoxy couldn't fix though. Overall great product at a really good price!",
      "rating": 4.0,
      "verified": true,
      "author": "J. K.",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Wheels Locked within First 3 Uses - Multiple Units had same problem",
      "text": "Ordered two of these units and both failed within the first hour of use. The wheels are cheap plastic on plastic - not a bearing or well built hub-roller type. The wheels locked up and there is no way to open the hub and repair or replace the part. I don't care how well the motor works - if you can't push or pull it it's worthless. It's priced cheap for a reason - cheap parts. You'll buy 3 of these to last the time of a better built unit. Keep Looking.",
      "rating": 1.0,
      "verified": true,
      "author": "Rubicon",
      "helpful_votes": 3,
      "publication_date": 20180108
    },
    {
      "title": "Great power",
      "text": "What an amazing vaccum!!! The suction and cleaning it does it strong and super. I read reviews before buying and they were good but most said you had to put It together well I didn't have to put anything together it worked amazingly right away. It's so strong I accidentally vaccums up a table top and all my decor went tumbling down and the co er was sicker up in 2 seconds. All I could do was laugh and tell my kids now that is how a powerful vaccums works!!",
      "rating": 4.0,
      "verified": true,
      "author": "Sara G.",
      "helpful_votes": 2,
      "publication_date": 20171018
    },
    {
      "title": "Saved My Marriage",
      "text": "This beautiful, dirt-sucking, hair-picking-up machine saved my marriage. My wife couldn't stand my lazy, sloppy self. But I just couldn't stand our old vacuum. It was heavy and cumbersome. Upon flipping the switch on this lightweight and flexible bad boy, I became addicted. I've never experienced a rush like the feeling I get from operating this powerful piece of machinery. I find myself cleaning, just because it's fun. I send my wife Snapchats of me sucking every last dog hair from the rug and let me tell you, that's quite the aphrodisiac. I would recommend this amazing vacuum cleaner to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Grabill",
      "helpful_votes": 2,
      "publication_date": 20180912
    },
    {
      "title": "Great vaccume for the price!!!",
      "text": "This is lightweight, yet has great power! First time I used it I was super happy with how much it picked up. Love how easy it is to quickly use the hose as I use it every time I vaccume to get against the baseboards. My only qualm is because it's so light if you just sit it alone sometimes it wants to fall over. It could be due to where I have the attachment sitting 🤷.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber-Realtor",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Awesome vacuum",
      "text": "Awesome vacuum for the price!! There is no need to switch buttons between carpet and hardwood suction is awesome and the swivel head gets around tight corners and under small areas. The hose is conveniently placed on the top of the vacuum so it’s easy to use. There was no set up I just pulled it out of the box connected the attachments and it was ready to use👍",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Whitlock",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Makes Vacuuming not as awful",
      "text": "This vacuum does it all. Carpet? No problem. Wood floors? This has got it! An old yellow lab that sheds buckets full of hair? Oh man can this thing keep up It's easy to empty out, easy to use, and for a great price. Vacuuming is my absolute least favorite chore of all time, but this makes it bearable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydbey",
      "helpful_votes": 2,
      "publication_date": 20180202
    },
    {
      "title": "Disappointed NOT as Good with hair/ dust as it claims to be",
      "text": "Loved this vacuum for the very brief time that it worked. Today I was vacuuming up the tile in the kitchen and the engine just stopped working. Do to the thin tubing my best guess is that pet hair burned it up. I didn’t have it but for a short time and now I have to replace it which is not in the budget. I’m so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "JessicaCrea",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Super great vacuum !!!",
      "text": "I had the job to find a decent affordable vacuum for our carpets at work, well this thing sure works great and i have told many people where to find it , it just works great and the swivel is really nice for getting along edges and in weird spaces, highly recommend this to anyone wanting a great vacuum !!!",
      "rating": 5.0,
      "verified": true,
      "author": "A regular working man.",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Yes",
      "text": "I waited awhile before reviewing. Now I have been using it for a month and I love it. The narrower, flatter head fits between chair legs and under furniture better than my last one. I have washed the filters now and love that feature. My carpet is OLD and this vac still makes it look nice. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "L Ward",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Not a good pet vacuum!!!",
      "text": "I have a medium sized living room and we have a dog and 4 cats. I vacuum everyday because I babysit during the day. This vacuum worked great when I first got it, I cleaned to dust cup and filter after every use. Went to use it the other day and in mid vacuum it just shuts off. Cleaned out cup and hoses and still nothing. I am extremely disappointed, this is not a good pet vacuum at all. I will probably never buy a dirt devil again, nothing but problems. I'm hoping to get the item returned tomorrow, just have to find a box to send it back in.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie Conley",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "ease of manuverability",
      "text": "Great suction, I was surprised at the power which is great for large wall to wall areas and hard flooring, however ,pretty much impossible to use on small carpets as it is just too powerful and no way to adjust the amount of suction. On smaller area rugs I have just had to shake outside and wash. Amazing at getting fur out of carpet, but wish the suction power was adjustable like my last vac.",
      "rating": 4.0,
      "verified": true,
      "author": "kurious kitty",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "So good.",
      "text": "My dudes, this vacuum, for the price, is incredible. INCREDIBLE. I have a husky akita mix and, as you can imagine, he leave a lot of fur. This gets so much of the hair out so easily. Its obviously not going to go as deep or last as long as a 400 dollar vacuum, but for the price itll do more than you could ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great price, great suction power.",
      "text": "Love this vacume! Have purchased one for my mom, one for my son, and one for his college room mate. They work as well as my expensive vacuum and I love the swivel feature, wand, and claw! It's easy to empty the dirt cup and easy to rinse the filter. This vacuum is user friendly, works like a dream and is the best value on the market. When I finally toss my vacuum I will be getting myself a Dirt Devil!",
      "rating": 5.0,
      "verified": true,
      "author": "Francis J. Porto Jr.",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Amazing little powerhouse!",
      "text": "This vacuum changed our lives after adopting a rescue. It’s very easy to go from carpets to hardwoods with a tiny switch at the top. It pulls up pet hair that isn’t even visible The attachments are so easy to use that you will do the baseboards every time you vacuum. This is very comparable to a much more expensive brand! I wouldn’t change a single thing about this vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180831
    },
    {
      "title": "Best for pet hair !",
      "text": "Absolutely the best vacuum at the price point we’ve ever had. We have 2 wolf hybrids 1 shepherd and a cat in the home. We’ve tried several bare floor/pet hair vacs and all seem to either blow with exhaust out the front wtf ? the lighter material and hair all over the place or the roller throw it out the rear smh. Not this one. It has a rubber sweeper behind the roller. The roller/sweeper can be turned off and automatically turns off when vac is vertical. This thing glides across the floor with minimal effort. Great vac at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Joj",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Good suction",
      "text": "Takes a little bit to get used to swivel action but once down is a real plus. Cleans hair best it can, have not found one to clean up hair Great. Does have really good suction for regular cleanups.",
      "rating": 4.0,
      "verified": true,
      "author": "Sue Rudy",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great Value for money!",
      "text": "Great value for money! Its all about meeting your vacuum needs, if you have a pet this product is a perfect answer to your needs. A combination of well designed device with great versatility on the option side, great suction, long cord and great swivel action along with a reasonable price makes it a winner!!",
      "rating": 5.0,
      "verified": true,
      "author": "Yatzek",
      "helpful_votes": 2,
      "publication_date": 20171110
    },
    {
      "title": "Beater barr",
      "text": "I was super pleased with the suction power and manueverabllity but after a couple of uses, I had to cut away the pet hair and carpet fibers before I could use it again. I thought perhaps new carpets shed a bit so I gave it a few more gos. Very dissapointed with the fact that the brushes needed frequent cleaning. I only have two cats that do not shed alot and the few carpets I have on my wood floors are broken in. Would not buy again",
      "rating": 2.0,
      "verified": true,
      "author": "BKM62",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Died too soon",
      "text": "I have had this since September 2017. It lasted only 7 months and died. It was great while it lasted but not worth the price for 7 months of use only.",
      "rating": 1.0,
      "verified": true,
      "author": "Bert",
      "helpful_votes": 3,
      "publication_date": 20180405
    },
    {
      "title": "LOVE the Dirt Devil Razor Pet!",
      "text": "to say that I like this vaccum would be an understatement! I LOVE IT! It's lightweight, easy to maneuver and cleans great! Especially my furry babies hair! Definitely recommend and great $$$$!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystina Wyler",
      "helpful_votes": 4,
      "publication_date": 20170820
    },
    {
      "title": "Goodbye cat fur!",
      "text": "I finally got round to having time off work to actually clean. And wow I’m shocked how good this vaccum cleaner is. I have a carpeted apartment, and balinese cat (very long fur and lots of it). Her fur blends into the carpet so usually tricky to get out but this vaccum does the job! Really easy to open to empty the bin, and to get to the filter. Also light weight compared to most pet vaccums which is great as I have a bad shoulder. Money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Great vacuum but the hose is kind of bad.",
      "text": "Ok this vacuum cleaner is awesome. It just not very good to use on stairs. The attachment to the hose that is supposed to help get up dog from furniture and the stairs stopped working after I used it one time. So this is a great vacuum cleaner if you don't have alot of furniture or stairs. If you do then I recommend getting something different then. Other than that it's a great vacuum cleaner.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Can NOT get a belt!!!!",
      "text": "Product worked great for first three months, then belt broke...guess what? Called dirt devil and you can NOT get a belt for this vacuum! They don't make them! So brush will not turn and they want me to drive FORTY miles to a repair shop so THEY can verify that it is broke and THEN dirt devil will then consider if it warrants a replacement vacuum...good product otherwise but call and verify before you consider this one!",
      "rating": 2.0,
      "verified": true,
      "author": "Sodone98",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Great little vacuum.",
      "text": "This vacuum is super lightweight and gets the job done pretty dang well! For the price it’s hard to beat. I have a husky and it gets up pretty much all his hair from the carpet in the first glide. The only thing I notice is I do have to empty it quite often, it fills up fast, but that’s not something that bothers me.",
      "rating": 4.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Excellent pet hair removal. Extremely easy on arthritic hands.",
      "text": "This really is a great light weight pet hair vacuum. I have been very thorough cleaning after each use which I feel will help its life span. A little difficult to pop the rolling brush off to clean. Must be a trick to it I haven't figured out.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth altmayer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Don’t waste your money.",
      "text": "First one broke. Immediately. The engine went out. Had a replacement sent and it only lasted a few months before the engine went out. Too. & I’m unable to return. I have three rooms with carpet in my home and the vacuum was well taken care of. These vacuums are just garbage. The only good thing about them is their maneuverability.",
      "rating": 1.0,
      "verified": true,
      "author": "Daysha",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Very Happy Cat Mom",
      "text": "I am in love with this vacuum. The wand is is super easy to use and return and the vacuum is much lighter than my last. It is compact but powerful. I have always thought Dirt Devil made the best vacuums, as I had my first one for 7 years and it worked great right up until it broke. My previous vacuum purchase I made the mistake of buying another brand of vacuum that was bulky and only lasted 4 months. If you have the money to spend, I would highly suggest this model!",
      "rating": 5.0,
      "verified": true,
      "author": "June",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Garbage",
      "text": "Don't waste your money. I've vacuumed twice since purchasing this. The first time it was great! The second time the motor stopped working. And there is 0 suction. Since it has 2 motors the brush still spins so I can effectively push dirt around the floor. Might as well sweep my carpet. To bad I proactively purchased this prior to moving so I'm just stuck with the piece of garbage because I can't return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Stacy L. Ukwu",
      "helpful_votes": 4,
      "publication_date": 20170930
    },
    {
      "title": "Not a \"pet hair\" vacuum",
      "text": "Cloggs easy with fur. Only have 2 DSH cats. We vacuum every other day and unclog once a week.",
      "rating": 3.0,
      "verified": true,
      "author": "Suzanne P.",
      "helpful_votes": 2,
      "publication_date": 20190506
    },
    {
      "title": "This is the most amazing vacuum I have ever owned",
      "text": "This is the most amazing vacuum I have ever owned......I had an area rug I bought from Kolhs about a year ago and it always had hair stuff to it. This vacuum remove all of it and I filled 3 canisters in the 3 rooms that have carpones...this dirt devil is amazing...love the way my house looks....sooooooooo clean....et.....My house has never been so clean....highly recommend!!!!!...For $100 vs paying for these high priced",
      "rating": 5.0,
      "verified": true,
      "author": "Berni",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "Best purchase I've made this month!!",
      "text": "Came in 1 day earlier than expected. Got to say, I never thought I would be excited over a vacuum, but hot-diggity-damn!! I'm very satisfied with this Dirt Devil. Compared to my brother's Bissel(also for pets), this one is much lighter in weight, maneuvers much more easier, the suction is amazing, and looks sooo much more cooler. I have a 4 yr old who can tend to be a bit messy at times. I vacuumed my whole apartment and I was surprised on how much dust, hair, and crumbs it picked up. Carper looks damn near new. All this for a great price. Definitely a must buy item.",
      "rating": 5.0,
      "verified": true,
      "author": "DiegoG02",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Best little vacuum",
      "text": "This vacuum worked better than my Dyson did. I vacuumed my hole house. I vacuumed my living room where the dog stays twice and got 4 canisters full of dog hair and dirt. Stuff that wasn't coming up before. 10 out of ten recommend",
      "rating": 5.0,
      "verified": true,
      "author": "kendra Herman",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great vacuum, good price.",
      "text": "I had one before but wrecked the beater bar after it sucked up yarn. I love the ease of use, great suction, lightweight. Wish cord was a couple feet longer, and it can be a bit tippy, but overall I really like this vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Gross",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Yes! This one for pet hair!!",
      "text": "My Shark Duo Clean was having a lot of trouble with the dog hair. So much trouble that it required me to take it apart and unclogged it 2-3 times every time I vacuumed! I figured for $85 this was worth a try. Wow... I am so amazed at how great this vacuum is! I highly recommend this one, at this price I am so pleasantly surprised!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise M",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Great Suction on Vacuum, but Only 8 Months",
      "text": "I bought 11 months ago. It worked great for about 8 months and then very little suction on floor cleaning and the furniture suction completely stopped working. I cleared a small clog on floor cleaning area, but still very little suction. I don't like to leave bad reviews, but 8 month life seems short. I was hoping it would last 2-3 years. I really liked the vacuum during the months it worked well.",
      "rating": 2.0,
      "verified": true,
      "author": "MichaelA",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Totally worth the money",
      "text": "Best vacuum ever made. Great for hardwood floors and carpet. Vacuums cat hair and hay:) love love, very light easy to carry. Worth the money and very powerfull",
      "rating": 5.0,
      "verified": true,
      "author": "Alex M. Wymore",
      "helpful_votes": 3,
      "publication_date": 20171115
    },
    {
      "title": "Unusable. Falls apart due to bad plastic latch design.",
      "text": "It's the second day with this vacuum and we have to send it back. The handle of the vacuum doubles as the wand if you pull it out via a release button. Unfortunately the plastic \"latch\" for it is so thin and poorly designed, that the handle pulls out on its own with even the most gentle movement when attempting to push/pull the vacuum. Exceptionally frustrating and basically unusable.",
      "rating": 1.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Perfect for my needs",
      "text": "I have two bunnies and this vacuum cleans up my carpet perfectly! I've only been using for two months, and it has been great. Also, it's very easy to dispose the contents and clean the filter.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Badamain",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "this is a really good vacuum! It’s really light weight and does a ...",
      "text": "For this being a dirt devil, this is a really good vacuum! It’s really light weight and does a great job sucking up dog hair and everything else. The pet claw attachment works super well on couches and chairs to get the dog hair up. The swivel takes some getting used to but it’s great once you get the hang of it - and makes it SO much easier to vacuum under furniture and around the legs/feet of furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Spence",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "MET ALL EXPECTATIONS!",
      "text": "AFTER REVIEWING MANY VACUUMS FOR MONTHS, CHOSE THIS ONE. GREAT PRODUCT. IT REALLY SUCKS. I PURPOSELY TRIED TO RUN OVER AND PICK UP OBJECTS THAT I JUST KNEW IT COULD NOT. (HEY IT'S A TEST) YET IT PICKED UP EVERYTHING I RAN OVER (I AM STILL MISSING A CAT) VERY HAPPY WITH THIS PURCHASE.",
      "rating": 5.0,
      "verified": true,
      "author": "ROLAND JACKSON",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Strong suction; attachments work very well.",
      "text": "MUST HAVE FOR PETS. I have an elderly cat who sheds a ton, and I was able to clean my entire apartment in less than 20 minutes. The attachments are super easy to use, and the vacuum got so much hair and dirt up, I was honestly shocked. Everything was super easy to clean and wipe down afterwards. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendall Allen",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Motor burned out after 10 months...",
      "text": "At first, this vacuum seems like an amazing deal, with decent suction and cleaning capabilities for the price. If you have multiples \"pets,\" might want to go with a different model as this one's motor burned out after 10 months, using three times a week. Disappointed, Dirt Devil!",
      "rating": 2.0,
      "verified": true,
      "author": "Jen F.",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Almost perfect light vacc",
      "text": "Bought this because I have wood floors with rugs scattered throughout house and a german shepherd. Can turn brush off for use on floors and back on for carpet. The auction is super strong. Only thing I don't like is that the brush will just stop working sometimes and I'll have to turn the vacuum off and back on again for it to start spinning.",
      "rating": 4.0,
      "verified": true,
      "author": "Francisco J. Colon",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Best vacuum ever! Don’t change anything !",
      "text": "Best Vacuum Ever! This dirt came out an area rug! A 5x7 that I just vacuumed 1 o’clock this morning . You can really feel it grabbing carpets and rugs and the front is thin enough to slide under cabinets and beds without damaging. Strongest Suction i’ve ever felt and I’ve spent plenty on vacuums in my life. I used the pet claw on my sofa and was shocked at the crap coming off",
      "rating": 5.0,
      "verified": true,
      "author": "Kaytlin guzman",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Only vacuum I've found to not have a belt...",
      "text": "Worked great but only had a year and the brissel bar quit rotating. Figured no bid deal I'll change the belt. Come to find out it doesnt have a belt. Of course they dont tell you that, not to mention in my experience I've never found a vacuum without a belt. So now instead of simply replacing the belt I've got to bring it in the a licenced repair place. I just find thats kind of ridiculous. Wouldn't buy again simply for that fact.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Eh....",
      "text": "I spend more time unclogging the hoses than I do vacuuming. When it works, it works great. The hoses easily clog, leading to gradual loss of suction. I am vacuuming hardwood floors and rugs with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "My very first vacuum... its amazing!",
      "text": "I looked at quite a few different vacuums before purchasing, comparing the reviews and the products themselves online. I am SO happy I picked this one! I have a wolf/shepherd/malamute mix. When she sheds, she sheds like CRAZY! So far this vacuum has worked like a dream on hardwood and carpet. Great for cleaning out the car too. The swivel allows for excellent control of steering. The suction is awesome, even through the hose. Light and easy to carry and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "katie rau",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Works really well, kinda top heavy",
      "text": "Really like this vacuum, it's strong and light. It easy to maneuver and reaches under furniture pretty well. Drawbacks for me are that it doesn't offer multiple levels of carpet height vs bare floor. Also if you leave it standing on thick carpet it's likely to fall over, though it stands well on low carpet and bare floor. The attachments do a real good job on pet hair. Overall I would recommend this and do not regret my purchase! Good stuff.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly Baird",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Awesome",
      "text": "Comes fully assembled Easy to unclog High suction I only gave 5 stars because that’s all it offers It cleans all surfaces without throwing debris",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Great value",
      "text": "So glad I bought this vacuum! Live with 4 female roommates- so there can definitely be some hair! This vacuum does a great job and has managed to help our carpets look newer. I'm very pleased. Light enough to use on the stairs, attachments are good, dirt canister is easy to empty. Pleased with this inexpensive vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria O'Donnell",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great suction",
      "text": "LOVE THIS VAC. Only dislike is it shuts off if it gets to hot. Only happened once to me but it did happen. Great on pet hair. It’s my favorite vaccuum for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamra",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Works GREAT",
      "text": "I LOVE this vacuum! We recently adopted a husky/Australian cattle dog mix and our old vacuum worked great but was no match for the amount of hair that was being shed on our floors and carpets. The first time I used this I had NO IDEA how much there had been left behind by my old vac! The rugs LOOK vacuumed. It was incredibly satisfying (if not slightly alarming) to being able to see what was being picked up. Absolutely recommend for any owner of a pet that sheds regularly.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Tuttle",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Worth the money.",
      "text": "Highly recommend. I have a Shark Navigator been using. Granted it's 3 years old but this one put it to shame. Vacuumed my carpet in front room with my Shark then followed up with the Dirt Devil. It nearly filled canister with what the Shark missed. Only con is that it has the same issue as half of women in porn. It's top heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200419
    }
  ],
  "product_meta": {
    "title": "Dirt Devil Razor Pet Bagless Multi Floor Corded Upright Vacuum Cleaner with Swivel Steering, UD70355B, Red",
    "description": "Size:Razor Pet| Style Name:VacuumThe Dirt Devil Razor Vac Pet upright swivel vacuum cleaner is powerful, lightweight and easy-to-use. The low profile design steers around and under furniture with minimal effort. Our SPIN4PRO premium pet brush roll is designed and optimized to effectively clean and remove pet hair on both carpet and hard floors. Simply detach the 10ft. cleaning wand and attach the Pet Tool to clean hard-to-reach places like ceilings and stairs. No loss of suction means a powerful clean anywhere in your home. Plus, the advanced three stage filtration system keeps your vacuum running better, longer with a whole lot less maintenance.",
    "rating": 4.3,
    "feature_bullets": [
      "Powerful No Loss of Suction*",
      "10ft. Extended Reach Hose - with removable cleaning wand",
      "Spin4Pro Premium Pet Brushroll - for powerful carpet and hard floor cleaning"
    ],
    "specifications": {
      "Product Dimensions": "13 x 11.75 x 31.5 inches",
      "Item Weight": "13 pounds",
      "Manufacturer": "Dirt Devil",
      "ASIN": "B06X978P7W",
      "Item model number": "UD70355B",
      "Customer Reviews": "4.3 out of 5 stars1,395 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#33,998 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Hard floor, Carpet, Dual action",
      "Is Assembly Required?": "Yes",
      "Warranty Description": "1 year.",
      "Batteries Required": "No",
      "Included Components": "Vacuum^2-in-1 Dusting and Crevice Tool^Extended Length Crevice Tool^Pet Turbo Tool"
    },
    "categories": [
      "Home & Kitchen",
      "Upright Vacuums",
      "Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": 91.26
  }
}