{
  "website_summaries": [
    {
      "verdict": "If you're looking for a quick and simple smart plug for HomeKit, PureSwitch is just that.",
      "pros": [
        "PureSwitch is simple to set up and includes a USB 2.0 charging port"
      ],
      "cons": [
        "PureSwitch only works with Apple HomeKit and doesn't offer higher-end features like dimming options or energy tracking"
      ],
      "aspects": {
        "Features": 7.0,
        "Usability": 7.0,
        "Design": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20171115,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "EXACTLY What I Wanted!",
      "text": "This could not have been easier to set up and operate. It works great with Apple’s HomeKit. Now I have a bedroom lamp I can turn on and off without getting out of bed but also I can automate it to come on when I arrive home or at sunset. I’ll never have to walk into a dark house again. I’m so excited! Update: I added a second one to the living room lamp that’s always hard to reach. Adding it in was a breeze. It’s set up for the same automation - turn on when I arrive home between 4 and 11 pm. I can’t say enough good things about these!",
      "rating": 5.0,
      "verified": true,
      "author": "KP",
      "helpful_votes": 4,
      "publication_date": 20171203
    },
    {
      "title": "Happy wife, happy life",
      "text": "Dream come true. My wife loves getting into a warm bed. But she needed a way to remotely turn on her electric blanket 1 hour before she got home. With a variable schedule, a simple timer would not suffice. Of course, the PureSwitch also has a simple timer to turn a light on/off the same time everyday. Now with the PureSwitch, my wife can remotely turn on her electric blanket on her way home and have a toasty warm bed waiting for her when she arrives. Happy wife, happy life!",
      "rating": 5.0,
      "verified": true,
      "author": "Lily Siao",
      "helpful_votes": 3,
      "publication_date": 20180124
    },
    {
      "title": "Save Your Money",
      "text": "Unnecessarily complex to set up as a simple daily timer. Also, it’s highly unreliable. Set it up on my 2.4 GHz network but it only works if my iPad is also on the 2.4 GHz network. If I switch my iPad to the 5 GHz network, Pureswitch stops working. Overpriced and useless. UPDATE: Bought an Amazon Smart Plug which works flawlessly, integrates with Alexa, and is half the price. Don’t waste your money on Pureswitch.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray V.",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Exceeds My Expectations!!!",
      "text": "!Love this product! I can control virtually anything at home,lights, fans, tv's etc. with the app, from literally anywhere! It's a plug and play switch that's inexpensive and easy to use. I almost forgot, it also has a USB port for charging cell phones, iPads, laptops...multiple rooms can be added if you have other devices in other rooms. PureSwitch is the real deal!!👍🏾",
      "rating": 5.0,
      "verified": true,
      "author": "Allister Buchanan",
      "helpful_votes": 2,
      "publication_date": 20170911
    },
    {
      "title": "Easy to install with clear instructions",
      "text": "*The product arrived on time and is exactly as pictured. *Easy to install with clear instructions. *Customizable to meet personal demands like turning on the light at night or when you arrive home. *Syncs not only to App but also to Apple Home (yay iPhone users!) I am using several around the house for a couple of months and have no complaints! I also used the smart switches for the Christmas tree and Christmas lights and they definitely make the holidays a little easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Chose another brand",
      "text": "Bought several different brands as I integrated light automation....three of these stopped staying logged on to my mesh WiFi after a year...despite many reboots they fall off the network and say not responding in a few hours...they went to the trash",
      "rating": 1.0,
      "verified": true,
      "author": "CDM G",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Impressed",
      "text": "Great product at good price. Setup was super easy and integrates with Apple HHome kit with ease. Love this smart product and has lots of advance features, I will definitely buy a few more for the house.",
      "rating": 5.0,
      "verified": true,
      "author": "RoRo",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "Works Good",
      "text": "The switch works as advertised, I’ve had no issues. I give it 3 stars because it’s HomeKit only, it would be nice if it worked with other services.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Super Convenient",
      "text": "This thing works great, never had a single problem with it. Pairs great with HomeKit with zero issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Nope",
      "text": "Won’t sync with my Home Pod. The only reason I bought it ! I’ve read and followed all directions and no luck Way overpriced",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick J.",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Five Stars",
      "text": "Easy set up, works good and as advertised with Apple HomeKit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Good",
      "text": "I believe it’s a bit overpriced but a good product",
      "rating": 5.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "It was not very reliable",
      "text": "It worked. Sometimes. It would often require restarting, plugging it back in, and resetting. We ended up returning after a few days because it stopped responding at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Couldn't sync",
      "text": "Could be my house, but this socket wouldn't stay synced (sp?) to my Apple Home. Returned it no problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy A. Behrbaum",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Very good quality and functional product!",
      "text": "This is my second one, really impressed with it. Works perfectly as described, easy set up, feels like a great quality product, many useful functions, going to get a few more. Fast shipping, good service.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Hwang",
      "helpful_votes": 2,
      "publication_date": 20170831
    },
    {
      "title": "Great product",
      "text": "This is very easy to setup. Extremely reliable. It works so good, I bought a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "joe barela",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Another Smart Idea",
      "text": "Compatible with Smart Home app .. I set it and forget it...turns my lamps on and off just when I need them to. Excellent for the absent minded.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary J",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Workable but the app is not updated for a long time and the support is unacceptable.",
      "text": "It works fine but sometimes it lost connection to home app. Don’t expect to get any support as I sent an email to ask how to get the firmware update to the customer support but no response.",
      "rating": 3.0,
      "verified": true,
      "author": "Morey Chang",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Great Product for those looking for HomeKit devices",
      "text": "I love this product. Slowly transitioning lights fans lamps and switches through the house to Apple HomeKit - this has a very stable connection. Always works, responds quickly through Siri voice commands and was easy to set up. I have two so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C. Murphy",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "The PureSwitch is very easy to set it up and running",
      "text": "The PureSwitch is very easy to set up and running! It' not only has the regular power plug but also has an USB plug for you to pylug in USB devices! Absolutely love it, going to buy few more for my home! It works with Apple HomeKit flawlessly!",
      "rating": 5.0,
      "verified": true,
      "author": "Chinping Chang",
      "helpful_votes": 4,
      "publication_date": 20170906
    },
    {
      "title": "Disappointing: It can't do simple sunset/sunrise schedules",
      "text": "I'm very disappointed. It can't do sunset timing, so it's not useful for light timing to make a home look lived in; you'd have to adjust the timing at least monthly all year long. Strange, as sunset/sunrise timing is always available on the web for any location in the world (Google, for example). Light timing is the only use I have for this thing, so . . . now what? Back to simple photocell timers without wifi, I guess.",
      "rating": 2.0,
      "verified": true,
      "author": "Jan Twardowski",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "NEEDS DESIGN WORK - FRUSTRATING",
      "text": "Connected this via my Xfinity Wifi using their app and Homekit. All went well at first as it was easy to configure and worked as expected. However, Xfinity service does a restart to update a few times per week. Every time this happened, the plug would not reconnect when the wifi connection restarted. I would have to unplug the smart plug, plug it back in and wait for it to cycle on. then a day or two later, same thing. NOT READY FOR PRIME TIME!",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Cardoza",
      "helpful_votes": 7,
      "publication_date": 20171130
    },
    {
      "title": "Becomes unresponsive after 7 mins!",
      "text": "I actually won a Pure Switch on-line early Jan 2018. I had no real use for it until recently, so I decided to finally put it to use. After the wi-fi setup and adding the switch to my Home app, I discovered that the switch would become unresponsive after a time. I moved the unit closer thinking that I had originally was too far from my router. Even 10 ft away (unobstructed and with a strong wi-if signal) I have timed the drop in connection to 7 mins or so - rendering this device completely useless to me. Going with a Hue device as I already have a number of lights and a hub.",
      "rating": 1.0,
      "verified": false,
      "author": "Ed_D",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Product is unreliable and pricey, warranty is poorly executed.",
      "text": "Worked fine for 2 months than lost conection to home network At first siri said i don’t see that item in your network. Then after reloading in home kit and the pure gear app and restarting the router, ipad, apple tv and switch the complaint was that item is not responding. Called pure gear and they’re sending a new unit with a fee of $6.95...(what kind of warranty requires a fee??) After this experience, i’ll be avoiding PureGear products.",
      "rating": 2.0,
      "verified": false,
      "author": "Nicholas",
      "helpful_votes": 0,
      "publication_date": 20180816
    }
  ],
  "product_meta": {
    "title": "PureGear PureSwitch Wireless Wi-Fi Smart Plug Electrical Outlet Switch, 2-in-1 Plug, and USB Charging Port, Timer, No Hub Required, Remote Access with Apple HomeKit, HomePod, Siri for iOS 8.1 or later",
    "rating": 3.6,
    "feature_bullets": [
      "Remotely switch household appliances ON/OFF anywhere using your iPhone., iPad., or iPod touch.. Features Apple HomeKit technology which provides an easy and secure way to control your accessories.",
      "Free PureSwitch. app lets you create custom scenes to control one or multiple appliances from different zones with one single tap. Create Zones for the basement, downstairs, upstairs, etc. and Rules to turn scenes ON/OFF according to your schedule",
      "You can also control your PureSwitch by using Siri from your iPhone., iPad., or iPod touch.",
      "2-in-1 plug with built-in USB charging port. Output USB: 5VDC/2.1A. For indoor use only.",
      "Input voltage: 100VAC - 120VAC ~ 15A 60Hz Output voltage: 100VAC - 120VAC ~ 15A 60Hz"
    ],
    "categories": [
      "Outlets & Accessories",
      "Tools & Home Improvement",
      "Electrical",
      "Outlet Switches"
    ],
    "price": 42.95,
    "specifications": {}
  }
}