{
  "website_summaries": [
    {
      "verdict": "Just a dab of this cream creates a lathery barrier that gives you a smooth shave, moisturized skin, and a clean, earthy scent.",
      "pros": [
        "Creates a barrier using soothing coconut oil and shea butter so you can get a closer shave",
        "Clean, pleasant woody scent mixed with aloe and citrus",
        "Paraben, phthalate and cruelty-free",
        "Leaves skin smooth and moist",
        "Doesn't irritate sensitive skin"
      ],
      "cons": [
        "Formula is thinner than some prefer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I’m impressed",
      "text": "As an older gent who has been shaving for over45 years I generally am not easily impressed by shave products but this is the exception. With some skepticism I ordered this and assumed I would not be greatly amazed. HOWEVER I was wrong. With the same razor I always use and without changing the blade and I didn’t change the fact that I shave in the shower this shave cream gave me the closest shave EVER without any rash, or burn to my delicate baby face. I am impressed and will now make this a part of my regime. Congratulations MARLOWE",
      "rating": 5.0,
      "verified": true,
      "author": "Harry Blank",
      "helpful_votes": 32,
      "publication_date": 20181011
    },
    {
      "title": "Really satisfied with my cream",
      "text": "This stuff is great. It goes on smooth and white. That's important to me, because I shave in the shower and usually have less-than-ideal lighting. I don't mind the scent. It rinses off easily and completely. My face doesn't feel tight or dry after I shave. Provides ample lubrication for my various choices of razors. The price was reasonable, though I'm concerned that the tube won't last quite as long as other brands. Only time will tell though :)",
      "rating": 5.0,
      "verified": true,
      "author": "Roughin' It",
      "helpful_votes": 12,
      "publication_date": 20190129
    },
    {
      "title": "Gives a smooth shave, but. . . .",
      "text": "Certainly a smooth shave, no question. But it could much use a greater viscosity; it's quite thin and watery.",
      "rating": 4.0,
      "verified": true,
      "author": "J.W.",
      "helpful_votes": 19,
      "publication_date": 20180329
    },
    {
      "title": "Best shaving product",
      "text": "Awesome best shave creme I've ever used. Used to have to use shave oil and shave butter. This works 100 times beyter. It also softena your skin and smells great.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles S.",
      "helpful_votes": 11,
      "publication_date": 20181113
    },
    {
      "title": "Had no idea something like this would make that much of a difference",
      "text": "Had no idea something like this would make that much of a difference, but my face feels so smooth after a shave. No razor burn or any agitation. This stuff works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabe",
      "helpful_votes": 13,
      "publication_date": 20180604
    },
    {
      "title": "Great lather for sesitive skin!",
      "text": "Excellent shaving cream, lathers wonderfully and smells great. For the time being I do not see myself using a different product. I have VERY sensitive skin (I cant use a lot of shampoos, soaps, even sunscreens due to the irritation it causes) and so far all of Marlowe products I have tried have left me very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 14,
      "publication_date": 20180401
    },
    {
      "title": "Christmas Present",
      "text": "Based on the great reviews I bought this shaving cream for my husband for Christmas. He is not easily impressed and he loves this cream and wants me to order more when he runs out.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M. Trull",
      "helpful_votes": 11,
      "publication_date": 20190216
    },
    {
      "title": "Great for a gift",
      "text": "Bought 2 1 for my friend and 1 for my BOYFRIEND they both loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Aymee H",
      "helpful_votes": 7,
      "publication_date": 20190214
    },
    {
      "title": "Five Stars",
      "text": "Best shave cream on the market. A little squirt creates enough foam to shave my face and head!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Germani",
      "helpful_votes": 12,
      "publication_date": 20171231
    },
    {
      "title": "Amazing product! Just a little dot of it will ...",
      "text": "Amazing product! Just a little dot of it will lather to cover a large area. It works great for a very smooth shave even on sensitive areas.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac Horman",
      "helpful_votes": 8,
      "publication_date": 20180425
    },
    {
      "title": "No more scraped up face",
      "text": "I've got a heavy beard but sensitive skin, go figure. I like to shave right after I shower and this keeps my face smooth and nick free. I use an old double edged safety razor and a light touch. Marlowes is all I will use from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190314
    },
    {
      "title": "Superior shave cream.",
      "text": "A great shave cream, that provides great protection. It takes a very small amount to get the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "AA",
      "helpful_votes": 6,
      "publication_date": 20190321
    },
    {
      "title": "Five Stars",
      "text": "I love this product. A tiny little dab is all you need. I use it on every client.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Barbee",
      "helpful_votes": 11,
      "publication_date": 20180410
    },
    {
      "title": "Bye bye Edge",
      "text": "I like the feel that the cream leaves behind, and it has a nice scent to go with it as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Damelodian",
      "helpful_votes": 7,
      "publication_date": 20181028
    },
    {
      "title": "First Use",
      "text": "I just received Saturday and the first shave on Sunday, with this product, was good. I would recommend",
      "rating": 4.0,
      "verified": true,
      "author": "nick woz",
      "helpful_votes": 6,
      "publication_date": 20181016
    },
    {
      "title": "Buy it, it’s good",
      "text": "I don’t know if it’s the best because I have not used a lot of the other shave cream‘s. But I read the reviews and it works good for me.",
      "rating": 4.0,
      "verified": true,
      "author": "D.Lee",
      "helpful_votes": 5,
      "publication_date": 20190304
    },
    {
      "title": "Best Shaving Cream",
      "text": "This is the best shaving cream I have used that is made specifically for use as shaving cream. I actually prefer using conditioners for shaving. This stuff is pretty good though. A little goes a long way. I love that this has coconut oil and shea butter in it. It does a good job with neck shaving which I have the most trouble with.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "No scent and a bit gooey for my preferences...",
      "text": "No scent and a bit gooey for my preferences... I recently started using the exfoliating soap MARLOWE. No. 102 \"B06X95YPCW\". I love the scent so much I purchased this shaving cream hoping I could extend the pleasure that the soap gave me during my shower to shave time. The sad reality is that this shave cream has almost no scent. It is okay to use but I will go back to my standard \"Noxzema Shave Cream Aloe\" after I am through with this tube because I love the way how simply the foam is applied.",
      "rating": 2.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great!!",
      "text": "My husband loves this just wished there was more scents.",
      "rating": 5.0,
      "verified": true,
      "author": "DarkandTw1s1t3d",
      "helpful_votes": 5,
      "publication_date": 20190113
    },
    {
      "title": "Best or second best shave, and easy too",
      "text": "This stuff really makes for a great shave. Not much of a scent, and I don't have sensitive skin so cannot comment on whether it is good for that, but boy it is easy to shave with this soap. It is probably the best shave I have had, or the second best. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "LonghandTop Contributor: Harmonicas",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Excellent addition to my shaving routine",
      "text": "I have been using the same shaving cream for probably 10 years now and I recently wanted to switch to something more natural. This shaving cream makes a fantastic lather that feels rich. It's not foamy like something that comes out of an aerosol can. But, a little seems to go a long way on the face. It even leaves my face smooth after shaving. Really great product. Sometimes you lose a little functionality with natural naturals but not this.",
      "rating": 5.0,
      "verified": true,
      "author": "Melvin",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Nice for my sensitive skin",
      "text": "I was getting irritated skin on neck. I have to shave everyday for work so finding a shaving cream that didn't cause more harm is a blessing. It is much more than I usually spend but the results and comfort are worth it to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Calixtro A Martinez",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Never had such a close shave...great product!",
      "text": "Shaving is now a breeze. You need to put only a small layer on your face once before you shave to get the job done. Never had such a close shave!",
      "rating": 5.0,
      "verified": true,
      "author": "AWK",
      "helpful_votes": 2,
      "publication_date": 20191123
    },
    {
      "title": "Not what I hoped",
      "text": "I was looking for an alternative to Dr. Carver's Easy Shave Butter from Dollar Shave Club. Based on the reviews I read I was excited to think that perhaps I finally found it. Sadly it just doesn't hold a candle to it. I'd say this stuff is decent but it just can't compete.",
      "rating": 4.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Better than I thought",
      "text": "Great shave cream! A little goes along way, smells good but isn’t loud, slickness is decent but not great. But over all my favorite so far 💯👌",
      "rating": 5.0,
      "verified": true,
      "author": "michael felix",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great product",
      "text": "I was using Harry's shave gel, but I would still get some razor bumps. Decided to buy this based on the reviews, and do not regret it. It's one of the slickest shaving creams that I've ever used, and have not had a any razor bumps since. I'd buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Erbin Outfitters",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "So great!",
      "text": "This is my favorite shaving cream! Way better than the stuff for women.",
      "rating": 5.0,
      "verified": true,
      "author": "Trisha Wesolowski",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "Silky and clean feeling",
      "text": "Goes on smooth, it's thick not airy and you don't need a lot. Little to no scent as far as I can tell so it won't interfere with any fragrance you wear.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad Beer",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Provides a good shaving surface yet dries too quickly",
      "text": "The surface that this Marlowe shave cream provides is initially very good but will dry out fairly quickly requiring more water, shaving cream or both. I don't spend a lot of time shaving so it's not drying out due to taking too long to shave. The scent is good, the price is reasonable - the overall shaving experience with this is a 3.",
      "rating": 3.0,
      "verified": true,
      "author": "Rich McElaney",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "I FOUND MY NEW SHAVE CREAM!!!!",
      "text": "I have sensitive skin and after using Marlowe shave cream my skin felt smooth and refreshed! I’ve been working on updating my skin regimen and will now be adding Marlowe shave cream to my routine!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick G. Damico",
      "helpful_votes": 2,
      "publication_date": 20190810
    },
    {
      "title": "My husband loves this product.",
      "text": "My husband never likes anything I buy but he LOVES this. He asked me to huy some more.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Camper",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Not the best but defn worth a try",
      "text": "I tried this after using DSC and Billy Jealousy. I would rank it #3 on the list. The feel after the shave ain't that great. I don't hate it but will not be re-ordering. Love the packaging/tube design.",
      "rating": 3.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "It's a little thin.",
      "text": "It's a little thin, it works fine if applied to dry skin but if the skin is wet it does not provide much.",
      "rating": 3.0,
      "verified": true,
      "author": "Festus Necrogums",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Great for men",
      "text": "Great product for men's specially with beards soften and moisturize.",
      "rating": 5.0,
      "verified": true,
      "author": "Dominique",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "best shaving cream ive used",
      "text": "i have sensitive skin i also have to shave everyday for work, sometimes as much as 14 days in a row. if you have to shave a lot this is the product for you",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Brown",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Great for sensitive skin",
      "text": "I have very sensitive skin and typically get bad razor burn but I find Marlowe’s shave cream to very soothing and leaves the skin still feeling soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Patton",
      "helpful_votes": 2,
      "publication_date": 20190111
    },
    {
      "title": "Love this product!",
      "text": "My Partner’s and my favorite shaving cream! No irritation, so smooth, smells so CLEAN!",
      "rating": 5.0,
      "verified": true,
      "author": "RoberNick93",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Very good",
      "text": "The stuff is like shaving with some magic cream there's no way to explain that you have to try I shaved my head and I'll never use anything else",
      "rating": 5.0,
      "verified": true,
      "author": "LandR Guy",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Disappointed",
      "text": "Not impressed, use too much to lather face. Did well for sensitive face, ok.",
      "rating": 2.0,
      "verified": true,
      "author": "Rob Mac",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great shave cream for legs",
      "text": "I have very, very sensitive skin. But this cream gives me a close shave with no irritation.",
      "rating": 5.0,
      "verified": true,
      "author": "meowdancer",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Love it!",
      "text": "I've only used it twice so far but it feels great going on and is not as heavy a shave cream as others I've tried. I shave every other day and my beard grows in thick. I'm excited to continue using this product. A bit pricier then some other brands, but so far it seems worth it. Mild scent.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig W.",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Not effective at all",
      "text": "This product does nothing it states. My face/neck was completely irritated after use. I tried the product 3 times; still bad results...I just threw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Smells good shaves good",
      "text": "Just another shaving cream to me. I won’t buy it again. I can drive down the street to my store and buy a shaving cream.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Great shave",
      "text": "Great product a little on spendy side but a little goes a long way.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan K",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Good product",
      "text": "I have very sensitive skin and there's not a strong scent to it but it's very soft and works very well for shaving",
      "rating": 5.0,
      "verified": true,
      "author": "Francine",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Works great but not very chemical free",
      "text": "Works great but way more chemicals in the formula then I realised. Won't buy again for that reason.",
      "rating": 3.0,
      "verified": true,
      "author": "sara",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "It's a great cream for shaving",
      "text": "Sometimes I just wipe away the excess with a dry paper towel, so as to enjoy smelling it on my face for the remainder of the morning.",
      "rating": 4.0,
      "verified": true,
      "author": "Kerry Palmisano",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Great for shaving your head!!",
      "text": "Works great for shaving your head. Doesn’t clog the razor like shave gel. Doesn’t dry out my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Wheels with one leg",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great shaving cream",
      "text": "It has a nice, mellow/neutral scent, not over powering at all. It lathers nicely, stays on my face well, and need only one application to get a good shave. Easy to use when in the shower and holds up nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Seandad110",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "... me try this for my husband and he really liked",
      "text": "The reviews made me try this for my husband and he really liked it",
      "rating": 5.0,
      "verified": true,
      "author": "Windy City Gal",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "This is not a foam or gel, more of shave lotion",
      "text": "It's more of a lotion type but skin was noticeably softer and smoother. Great product for sensitive skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlo Buckingham",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "The best shaving cream on the market.",
      "text": "Surprisingly delightful. I have sensitive skin. This product worked great and I had the closest shave I've had in years. I'll repurchase Marlowe.",
      "rating": 5.0,
      "verified": true,
      "author": "Tangy Terry",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great quality and price!",
      "text": "Good quality and great price! Purchased this for my husband and he liked it enough to purchase again. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen H.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Smooth and doesn't clog my razor or my skin",
      "text": "I've tried numerous gels and creams to prevent razor irritation and razor bumps. A small amount of Marlowe's allows me to shave my face, head, and neck with no irritation. It rinses clean from my skin and razor and is the only cream I look for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob M",
      "helpful_votes": 6,
      "publication_date": 20171202
    },
    {
      "title": "After shave burn is no more!",
      "text": "This shaving cream is great! My skin doesn’t burn after shaving anymore. It’s a really good shaving product. Highly recommended it.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac Potter",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Good Stuff",
      "text": "For guys. It’s simple. Smells great. Results in a smooth close shave.",
      "rating": 5.0,
      "verified": true,
      "author": "David E. Wexler",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "Good Shaving cream for sensitive skin !",
      "text": "I have ordered it for the second time . I like it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Priju Padiyath",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Excellent product.",
      "text": "Excellent product...I find that wetting my face with hot water and then drying my hands before applying shave cream works better than keeping my hands wet",
      "rating": 4.0,
      "verified": true,
      "author": "Jim B.",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Good clean shave",
      "text": "I really enjoyed this product. It applies more like a lotion rather than a traditional shaving cream, which I liked. I got a good clean shave and my skin was left nice and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "EP",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Best shave product under $20",
      "text": "This is the best non-clear shaving product I have used. Quality ingredients and a mild pleasant scent for a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason C Bremer ",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Tube was dirty.",
      "text": "The product looked like it had sat on a shelf for ages. The tube was dirty and dusty.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Did not work for me",
      "text": "For me personally my face got torn up using this. It offered me no protection between the blade and my skin or any relief from razor burn.",
      "rating": 1.0,
      "verified": true,
      "author": "F. Tavros",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "I found what I was looking for !",
      "text": "I tried it, it is very good for shaving with steam machine. it made the skin very easy and smooth while shaving. but unfortunately no scent.",
      "rating": 5.0,
      "verified": true,
      "author": "ibrahim",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "I do indeed recommend it for a great shave",
      "text": "Got it fast. Used it today and got a really smooooothe close shave. I do indeed recommend it for a great shave.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee W.",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Works well with coarse hair.",
      "text": "Shaved twice since receiving the product on 4/16/18, and so far, I’m extremely satisfied with it.",
      "rating": 5.0,
      "verified": true,
      "author": "I B",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Not good for my sensitive skin",
      "text": "I have sensitive skin and this Gives me razor burn whereas if I just use pure Shea butter, I get a perfect shave.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael D McCarthy",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Anyone who wants a clean shave with no worries about stubble...",
      "text": "This shaving cream is the best I’ve tried yet. Not only is it much better for your skin but the results are amazing. 🙌🏽 A MUST HAVE",
      "rating": 5.0,
      "verified": true,
      "author": "Jerome Parker",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Marlowe Shaving Cream",
      "text": "Used it last night for shaving.When I pulled razor across my face it did not feel like I had shaving cream on.Maybe the razor was poor quality but it was a brand new dorco 4blade razor.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Lathers better, smoother shave",
      "text": "Marlowe is much thicker and creamer than most competitors. I've tried several that were touted on various 'shaving' websites, and have to say, this product works best for me. It seems to lather up with less product and I can tell the difference in blade pull as I shave. It used to be a few bucks cheaper when Target carried it, but unless they increase the price much more, I'll stick with it. Cremo cost less but took almost twice the amount to get a good lather. Highly recommend trying this.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Great product",
      "text": "This product has worked great for me! A little amount goes a long way and it has a great scent",
      "rating": 5.0,
      "verified": true,
      "author": "Wendall yoder",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "I like the shaving cream it does not dry out my ...",
      "text": "I like the shaving cream it does not dry out my skin and allows the razor to glide smoothly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ansar",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "BEST EVER!",
      "text": "After many years of trying so many shaving creams, gels, etc. in my adult life- so happy to finally find one that delivers as promised. The razor glides so easily and there is no burn - a five star rating Many thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 7,
      "publication_date": 20190114
    },
    {
      "title": "Smoth and fresh",
      "text": "Just started using this product, had been using an oil for a long time. Got tired of the razor clogging up all the time, went to a gel type lotion not very impressed and had to wash my face to get the crap off, left me feeling dirty! I was browsing and read reviews and gave this product a try and have enjoyed the shave again.",
      "rating": 5.0,
      "verified": true,
      "author": "pesttech",
      "helpful_votes": 4,
      "publication_date": 20181020
    },
    {
      "title": "Best Shave Cream I Have Used",
      "text": "While I pretty much have changed from shave cream to shave butter as the consistency of the shave butter works well for me, I decided to try Marlowe Shave Cream due to the excellent reviews of the product. While the just is still out for me on whether or not I will switch from shave butter to Marlowe shave cream, I can say that Marlowe shave cream is the best shave cream I have used. A little goes a long way and is a product I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lcdrjjk",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Expensive but worth every penny!",
      "text": "For decades, like many men, I have used Edge shaving cream. I liked it. It seemed like a decent product. Edge. Shave. Repeat. On and on. Little did I know I was living in mediocrity. Fast forward to a month ago when I read reviews (just like you’re doing now) on Marlowe Shave Cream and decided to give it a try. Wow! Not only a super close shave, but it leaves your face smooth as, well...I’ll let you fill in the blank. This product is better than you could ever imagine. If you are looking for the best shave cream ever invented, look no further! Goodbye Edge, Hello Marlowe!",
      "rating": 5.0,
      "verified": true,
      "author": "ConsumerMan",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Smooth shave, excellent scent",
      "text": "Similar in texture to a thick hand lotion. After cleaning face thoroughly, applied small amount of cream, and had an excellent shave! The scent is subtle and refreshing. Closest nick free shave I’ve had in years. Will certainly reorder!",
      "rating": 5.0,
      "verified": true,
      "author": "MIKED",
      "helpful_votes": 2,
      "publication_date": 20190313
    },
    {
      "title": "The Best Shave I've ever Experienced 🌟🌟🌟🌟🌟",
      "text": "I liked the Quality, soothing and the moisture effect nothing to dislike Thank You for such a Great Shaving Cream I will definitely be Purchasing more.",
      "rating": 5.0,
      "verified": true,
      "author": "DUKE",
      "helpful_votes": 2,
      "publication_date": 20190125
    },
    {
      "title": "THE shaving cream",
      "text": "honestly the best shaving cream I've ever used that isn't a shaving soap. it's got good lather, but it feels more like a moisturizer cream. compared to most shaving creams, it takes a little extra effort to wash away from hands after done shaving.",
      "rating": 5.0,
      "verified": true,
      "author": "John D.",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Awesome!",
      "text": "I love this shaving cream. I am used to a bigger lather from other shaving creams so this took some getting used to, but the slickness was unbelievably great and I quickly adapted to how it works. I had no razor burn or irritation, I also used jack black beard lube as my preshave. Great routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Schuler",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Marlowe rocks!",
      "text": "Marlowe men’s grooming items have gone from off my radar screen, to top of the heap. I’m still bowled over by the exfoliating #102 soap, which is mind blowingly effective.",
      "rating": 5.0,
      "verified": true,
      "author": "ecrutle",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Absolutely the best shave gel I’ve used.",
      "text": "Best shave gel I’ve used. Neutrogena is second. Expensive but you can use it sparingly and still get a great shave. If there’s a downside it’s that the foam is so slippery it can be hard to hold the razor.",
      "rating": 5.0,
      "verified": true,
      "author": "Barinr",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "I hate to say it...",
      "text": "... but this is a major disappointment. I love Marlowe's bar soap and body wash. Incredible products. The shave cream, however, is blahhh. I've gotten better shaves from generic 99 cent cans from the cheapo buck stores. I hated writing this review.",
      "rating": 1.0,
      "verified": true,
      "author": "Nojokes",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Excellent! Needs very small amount to be effective",
      "text": "Great soap, very gentle on skin and easy to apply. You only need a very small amount so even a small bottle will last a while. Great neutral smell and quite faint, which is a big plus. Tried a lot of products recently and this is by far a favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Boruta Di Lira",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Not very good..many others are much better!",
      "text": "I have used mostly quality shave creams for many years. Usually the more costly ones with little scents have been the best. This is NOT one of them..watery, little scent and hard to keep on your face without making a mess. Viscosity is average and the final feel is tight and uncomfortable at best",
      "rating": 1.0,
      "verified": true,
      "author": "dma",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great shaving product.",
      "text": "I have used gel for shaving for years and was a little nervous about using something lighter as I deal with skin irritation if not careful. I wanted to try something more natural and I’ve used Marlowes moisturizer so I have this a shot. So far it’s a great product. Good lather, moisturizer, and scent. And the price is very good for the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig R.",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Five Stars",
      "text": "the absolute best shaving cream I've ever used on my face and head....",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Ammiano",
      "helpful_votes": 3,
      "publication_date": 20180322
    },
    {
      "title": "Husband loves it",
      "text": "It smells good and he has such sensitive skin and this didn’t make him break out or have razor burn!",
      "rating": 5.0,
      "verified": true,
      "author": "Tucker S.",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Good value for a great shave cream",
      "text": "As good as any of the top brands and less costly",
      "rating": 5.0,
      "verified": true,
      "author": "Steven B",
      "helpful_votes": 2,
      "publication_date": 20180522
    },
    {
      "title": "Works very well",
      "text": "You barely have to use any of this to get a good shave, and it feels nice on the skin, very solid purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Diaz",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "at last...",
      "text": "finally a product that does what it states, a clean, refreshing smooth shave at a very good price...",
      "rating": 5.0,
      "verified": true,
      "author": "danny purtill",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "The best facial moisturizer for men.",
      "text": "I love the natural ingredients in this product. It works great, my wife loves the smell. I won't use anything else on my face, ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian P",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Very smooth shave; HAPPY CAMPER 👍👍",
      "text": "Smooth shave. Very little cream needed for a rich application.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb Mino",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Best cream ever",
      "text": "The best ever cream I came across!!a nail size qty. will be adequate to cover your face; great shave ; no cream I ever used comes even second. Prevents irritation and feels absolutely great. This is indeed a miracle cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 5,
      "publication_date": 20171108
    },
    {
      "title": "Great All-Around",
      "text": "There are several great things about this shave cream. First, it only takes a small bit for a single shave, so it's gonna last me for while, which is great for the budget. Second, it works really well. My razor had just started to go dull when I got this. Now my shaves are smoother than when my razor was new. I had actually not used shave cream for a while, because all the other products clogged up my razor. But that hasn't been a problem with this (I've used it for about a week now). Finally, while I'm not a fan of the scent, it might as well be unscented because I never notice it.",
      "rating": 5.0,
      "verified": true,
      "author": "Headphone Bookworm",
      "helpful_votes": 0,
      "publication_date": 20180310
    }
  ],
  "product_meta": {
    "title": "MARLOWE. Shave Cream with Shea Butter & Coconut Oil No. 141 6 oz | Natural Shaving Better than Gel | Men and Women | Light Citrus Scent | Best for a Close Shave | Sensitive Skin Approved",
    "rating": 4.6,
    "feature_bullets": [
      "SOOTHE & PROTECT FOR A CLOSER SHAVE: A conditioning men’s shaving cream with Shea Butter and Coconut Oil to soothe skin while forming a barrier on skin to prep face for a close shave.",
      "SMELL FRESH: Our shaving cream is lightly scented with a clean balance of aloe and citrus followed by a woody base.",
      "EXPERIENCE THE MARLOWE DIFFERENCE: This shaving lotion is made with our trademarked M. Blend, made with Willowbark extract, Green Tea, and Deep Sea Algae conditions & tames inflammation on your face.",
      "NO BAD STUFF & MADE RIGHT HERE: Paraben and phthalate-free, not tested on animals, and made in the USA",
      "DO MORE GOOD: For every Marlowe. item purchased, soap is distributed to people at risk for hygiene-related illnesses in partnership with Clean the World"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6.6 x 2.2 x 2 inches; 6 Ounces",
      "UPC": "853646006666",
      "Manufacturer": "MARLOWE. Holdings, LLC",
      "ASIN": "B06X6MBCJV",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Men's",
      "Shave & Hair Removal",
      "Beauty & Personal Care",
      "Shaving Creams",
      "Shaving Creams, Lotions & Gels"
    ],
    "price": 12.99
  }
}