{
  "website_summaries": [
    {
      "verdict": "If you live in a relatively large home with plenty of available wall plugs, the Orbi RBK30 makes a great Wi-Fi system, though not necessarily the best.",
      "pros": [
        "The Orbi RBK30 is easy to use, can deliver reliable Wi-Fi for a relatively large home and has all the features and settings of a standalone Netgear router"
      ],
      "cons": [
        "The satellite unit is bulky and has no network ports",
        "The system's web interface is sluggish and doesn't include built-in protection feature against online threats"
      ],
      "aspects": {
        "Setup": 7.0,
        "Features": 7.0,
        "Performance": 7.0
      },
      "publication_date": 20170424,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Junk. Look at Netgears Orbi community page.",
      "text": "Garbage. Worked great for a month or two. Now the system is fully operational maybe 20% of the time. It drops the internet, (netgear DSL modem), drops one Satellite, then the other. Sometimes both. The main unit works most of the time, or I would just write off the nearly 500 bucks this thing cost. I am hoping they address this issue with a software update, but if it still won't work in 2 months, time to junk it. If you have any doubts, look on netgears own site. They host a forum. This is a common issue, and they cant/won't fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "martin watts",
      "helpful_votes": 19,
      "publication_date": 20180128
    },
    {
      "title": "Good idea, but needs a LOT more development",
      "text": "Great idea, and the concept of a mesh network is solid and proven, but good lord Netgear needs to do some major overhauls to the firmware. I had to set up a timer to reboot the main router every night, and I think I'm going to have to do the same for each satellite. Regular dropped connections, disconnects from the mesh, poor performance, ridiculously complex setup for subscription-based parental controls via a third party app that I can no longer turn off. The list goes on. If I weren't past the return period I'd ship this thing back in a heartbeat.",
      "rating": 1.0,
      "verified": true,
      "author": "John Wikman",
      "helpful_votes": 10,
      "publication_date": 20180501
    },
    {
      "title": "satellites are very problematic",
      "text": "I had high hopes for these. The main router is good, but the satellites are very problematic. I have moved them 5 times... closer, different areas, etc. They start at 5G connect and then drop to 2.5 and slow in speed over time. I had really hoped that mesh would work well, but have gone back to multiple hard wired access points. I have friends who also have the same issues. I would recommend using hard wire extenders if you have a large house.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Cholnoky",
      "helpful_votes": 15,
      "publication_date": 20171201
    },
    {
      "title": "Losing Wifi and never works with directv well.",
      "text": "Wifi drops on devices constantly. DirecTV receiver has to be rebooted every day because it loses connection and will not rejoin without a full reboot. For the high price and good reviews, I assumed this was a great buy. Worst WiFi I've ever owned. We have the main unit and two satellites covering 4600 sqft.",
      "rating": 1.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 9,
      "publication_date": 20171128
    },
    {
      "title": "Better WiFi & better looking but not so easy to install.",
      "text": "We decided to buy this router with one satellite to replace the one from our cable company. Wow! Huge improvement in signal strength and coverage. That alone was worth it! I would not describe the set up as simply as described. The iOS app totally failed and contacted the written instructions. Ended up doing the online setup on a desktop and that worked. One thing we didn’t realize was we had to update all our WiFi connected devices to the new network. That was a pain but worth it now that we have substantially better coverage.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg Stephen",
      "helpful_votes": 5,
      "publication_date": 20180107
    },
    {
      "title": "Great product, poor customer service",
      "text": "I love the orbi, but be warned their customer service is the worst I've ever dealt with. Terrible accents (India) tht I had to ask to have everything repeated 3 times, and not knowledgeable about the product at all. One man wasted an hour of my time because he wouldn't listen to me when I told HIM that the way he was instructing me to set up this router wouldn't work because I had ATT uverse. There's even a video on the netgear website saying so! Uggh, was so angry. The product is good though, I don't understand why they insist on having piss poor customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20180101
    },
    {
      "title": "The concept was great and technical support from netgear was top notch but ...",
      "text": "The concept was great and technical support from netgear was top notch but after a month of working with them I had to admit their product was simply 'not ready for prime time'. Many of my devices were constantly being dropped by the router. Tech support was able to reduce that from several times an hour to several times a day but even that is simply not good enough.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew J. Ludlow",
      "helpful_votes": 21,
      "publication_date": 20170521
    },
    {
      "title": "Great unit, easy to configure, but plagued with problems.",
      "text": "I bought this initially to upgrade my home network to 1 flat SSID network (instead of having multiple AP's and separate SSID's). Setup was easy and everything worked initially. I like that the main router and satellite has extra ethernet ports. Why I gave it 2 stars? Firmware update instabilities. Router reboots and wifi disconnects. Lack of QOS to prioritize streaming. Poor tech support (sorry but a factory reset shouldn't be needed to upgrade a firmware, and starting a config from scratch isn't fun). I had enough, and returned the unit.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Altamirano",
      "helpful_votes": 2,
      "publication_date": 20190106
    },
    {
      "title": "Keep dropping signal!!",
      "text": "We keep dropping signals multiple times during a show. Tonight we were watching something on our AppleTV via iTunes (not streaming) and the movie stopped 3X and kicked us out. Frustrating. When streaming video we will get a warning so many times we can’t count. I have anothe week to return so if it’s still acting up I will try something else. Update: Returned and got a new one- still the same problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Mandi",
      "helpful_votes": 6,
      "publication_date": 20171023
    },
    {
      "title": "Glad I bought Orbi!",
      "text": "I have a new generation Orbi system (router + 1 satellite) and needed a remote ethernet connection for a TiVo, so decided to just add another satellite and extend my wifi power even more. Some of the nooks and crannies that were not super-reliable became full-strength and the extra ethernet ports allowed my TiVo to stream stronger than the WiFi signal was working. This is why I bought this one over the wall-plug stripped down satellite. Setup was easy (I used the sync method) and the app does a good job of allowing basic maintenance while the website allows much deeper customization and NAT adjustment.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Lee",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Really, Really Bad",
      "text": "Hardware backhaul of this device into the orbi network crashes entire network. Wireless backhaul 3 ft from router, signal Poor. IT Pro, 35 years this is some real junk product. If you have a house with paper walls, you are probably good with a wireless backhaul anything else this product is really, really bad. It took 5 hours just to get any of it to work and figure out that this device would crash the network and obviously does not support wired backhaul. Do yourself a favor and look for Orbi problems on the net, this thing is a total waste of time for anything but the most simple config, two devices max.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert V. Brodbeck",
      "helpful_votes": 2,
      "publication_date": 20181004
    },
    {
      "title": "Inconsistent Wi-Fi",
      "text": "Do not purchase this item for the time being - the firmware updates do more harm than good and ive spent the past 3 days just trying to get it stable. Cell phones and tvs consistently suddenly drop internet for 3-5 seconds every few minutes or so. The satellite that came with it will at times suddenly just stop providing internet while still broadcasting wifi coverage. The forums are full of people complaining about the same thing to the point i feel the people who posted praise for this system did not use it longer than an hour or so for initial inspection.",
      "rating": 2.0,
      "verified": true,
      "author": "Randle Reviews",
      "helpful_votes": 4,
      "publication_date": 20180309
    },
    {
      "title": "Easy Network Setup",
      "text": "Easy setup out of the box. I had a Netgear AX8 and returned as its mesh capability was lacking (however it was fast). I have Orbi with A wired satellite, a wireless satellite and an outdoor satellite. Great coverage. The only curious is my incoming speed (based on netgear Orbi app) caps out at 572MB/s (upload is fine at 995MB/s). For note, the AX8 showed 995MB/s download and upload of 998MB/s. I hope this is simply a firmware fiX",
      "rating": 5.0,
      "verified": true,
      "author": "R. E. Twigg",
      "helpful_votes": 2,
      "publication_date": 20181207
    },
    {
      "title": "Orbi had a problem and had to be returned",
      "text": "I would give the 3rd party seller 5 stars regarding description, packing and shipping. However the Netgear Orbi could not establish contact with the satellite unit (would not sync). Calling Netgear's premium support line resulted in a hard to understand Indian person that was no help in fixing the problem. The problem was one of two things:1. No transmission signal to satellite from base or 2. satellite receiver was defective. I replaced Netgear system with a LinkSys system that is working great and easy to set up via smart phone app.",
      "rating": 1.0,
      "verified": true,
      "author": "Python22",
      "helpful_votes": 2,
      "publication_date": 20180810
    },
    {
      "title": "Solved all my wifi problems",
      "text": "This thing really works. Solved all my wifi problems. Previously has a range extender that wasn't doing the job and often wouldn't connect or lost connection. Highly recommended. The only glitch is that my Belkin WeMo Mini no longer works and I haven't been able to fix this but still trying. Everything else connected to Wifi works flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "LHC",
      "helpful_votes": 4,
      "publication_date": 20170720
    },
    {
      "title": "Works as advertised and then some! The best mesh WiFi solution there is.",
      "text": "Honestly if you need good WiFi coverage with a lot of speed and reliability, you’re only option is a mesh network, the Orbi product line works perfectly and setup was extremely easy. Love not having to worry about my WiFi signal or speeds and the option to have Orbi automatically update its firmware when Netgear publishes a new version is great for those concerned about security. I highly recommend this product for anyone who has a medium to large sized house, best part is if you need more coverage, you can endlessly expand your mesh network by adding an additional Orbi station.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge L. Ortega II",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Works great initially but Satellite stops working / netgear support confusing",
      "text": "Having lots of problems with this product. when its working, it works great, i get full speed internet that i would only get 10ft from my modem before orbi. but after a couple of days my satellite would start flashing white, would not reset or sync. i have returned this product 3 times, the 3rd unit i updated the firmware right away so hoping this fixes the problem. i found Netgear's support system confusing and complicated, no phone number, trouble finding my issue and registering the product etc... so it was easier just to return through Amazon. crossing my fingers!!",
      "rating": 2.0,
      "verified": true,
      "author": "Boiler53",
      "helpful_votes": 2,
      "publication_date": 20180607
    },
    {
      "title": "TERRIBLE",
      "text": "Well, shame on me! I bought this back in August 2018, and due to crazy schedules and holidays I just inboxed it and set it up last week! It was super easy, albeit slow, to set up and initially it worked well in our large home with 3 levels. After ONLY 4 DAYS, it began to reboot itself and change its settings at random!! Sometimes having access to WiFi, or internet, sometimes not, turning on features that were turned off, disconnecting the satellites and reconnecting them...very strange!! However because I waited to open and install it, there is no help for this system! AVOID THIS PRODUCT AT ALL COST!",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin D. Mccall",
      "helpful_votes": 2,
      "publication_date": 20190218
    },
    {
      "title": "great at first, then fizzles out",
      "text": "For the first few months it worked beautifully. Then a month ago (5mos old) it started to disconnect or slow way down, regardless of modem internet speed. The chat and support warranty is only 90 days, even thought the device is warrantied for a year. Be sure to look for a device that comes with support and will stay connected as needed.",
      "rating": 1.0,
      "verified": true,
      "author": "Melanie Lamere",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "So Far SO GooD",
      "text": "Wow! I’m impressed. This thing is working better than expected VM in our b 10k sq ft shop. We do have walls and separate areas CB but it is b much more b open than a CB large scale home. We CB had three repeaters before and the signal was weak at the extremities. Actually it was weak in areas in between too. And the switching from one address to the next was irritating. This mesh system seems pretty seamless and even.",
      "rating": 4.0,
      "verified": true,
      "author": "Isthata",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "This deserves 6 stars!",
      "text": "This far exceeded my expectations! Bought this for my in-laws that live in an apartment with very thick early twentieth century walls. We had a cheap extender that created another network and the speed was abysmal. This set of 3 is incredible. We took literally a few minutes picking spots to place them and get fantastic speed everywhere in the apartment. Simple to setup. Highly recommended. Would buy again without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Kiefer",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "I am extremely disappointed with the user interface and options",
      "text": "I have an IT background and have been struggling with the Orbi system for the last 24 hours. It continues to bounce up and down. The satellites keep disappearing. I am extremely disappointed with the user interface and options, some of the worst I have ever seen. Go buy the competitors options, they have to be better than this.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Empson",
      "helpful_votes": 7,
      "publication_date": 20180323
    },
    {
      "title": "Devce installed easily enough. Had the satellite and the router working ...",
      "text": "Devce installed easily enough. Had the satellite and the router working together but the system indicated a firmware update was required seeing all the issues with firmware updates I was nervous to do it but decided it was worth the risk and sure enough the firmware update killed the satellite. Netgear technical support suggests replacing the device so I have asked for a replacement from Amazon I will update this review once I get the new device working. It is definitely faster and the satellite with Ethernet jacks is a big plus. Hope it works out.",
      "rating": 1.0,
      "verified": true,
      "author": "JwG",
      "helpful_votes": 3,
      "publication_date": 20180210
    },
    {
      "title": "High speed wifi throughout the house!",
      "text": "THis works exceptionally well in our 80yr-old house which seems to have walls of lead! Great speeds throughout the house. Set up was easy with the Orbi app, but after a day or so when everything had been working great, I couldn’t connect to the internet. Nothing I did seemed to work. I finally called the support number in the app and had a very helpful and knowledgeable support person walk me through the solution to the problem - conflicting default IP addresses for the Orbi and my Xfinity router. Not sure why the app didn’t catch this on initial set-up but it did after resetting the base station to factory state. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Blimey",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Strong signals, even trough concrete walls.",
      "text": "My home is constructed with 12\" concrete blocks and all other WIFI equipment I had couldn't even reach the next room. This router has bunker buster strength. I used to have a bunch of WIFI repeaters but the problem with that was that the connection would cut every time I walked with my cellphone or laptop trough my home, since it was disconnecting and connecting from one repeater to the other. Since the Orbi uses MESH technology the connection is passed along seamlessly from one satellite to the other when I move from one room to another with spectacular data speeds.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Alkema",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "bad product !!!!! never ever purchase any netgear product !!!!",
      "text": "I purchased your ORBI AC3000 in October 19, 2018, twice it malfunctioned, reset it and it was fine, on 6/18/2020 it stopped functioning, had my IT guy try to get it going, it is defective, wrote the supplier, the responce was that it is out of warranty, I will NEVER, EVER purchase any netgear product and make sure everyone I know will not, it cost me $439, is this a way to treat a customer? shame on them",
      "rating": 1.0,
      "verified": true,
      "author": "jona kardish",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Great WiFi Extender",
      "text": "When I started looking for a new WiFi Extender I did not know anything about the Orbi. My research was narrowed down to 2. After reading the reviews from satisfied customers I decided to go with the Orbi, because of its easy setup and dynamic range! I have an office on one end of the house and a tenant that lives in my basement. The Orbi provides a good strong signal to everywhere in the house. Interestingly my internet service provider started offering the same extender after I bought mine! I highly recommend this WiFi Extender to everyone trying to extend their signal throughout the house. Did I mention it has a app for your phone!",
      "rating": 5.0,
      "verified": true,
      "author": "Dale S",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "WiFi throughout property when none for years before.",
      "text": "After Struggling with routers, extenders, wiring and dead spots, this was recommended. It is expensive but it was easy to launch right out of the box and the set up was a breeze. Our 4,500 sq ft, 2 story house is now covered with full strength WiFi which even extends into yard and with enough power for all devices, TV, streaming and speed. Could have called a pro and paid less for equipment but more for labor. Great value if you want almost perfect - Includes guest access.",
      "rating": 5.0,
      "verified": true,
      "author": "Blind_Identity",
      "helpful_votes": 2,
      "publication_date": 20171005
    },
    {
      "title": "Netgear Technical Support SUCKS",
      "text": "Major problem with updating firmware for brand new unit. Called technical support. First person on case number 40800421 said \"you reached the wrong division, I'll transfer you.\" Next tech support person (case #40800845) said, \"I need to call you back in no more than 3 minutes.\" Three hours later, no word from them. Years ago I quit using Netgear because their support SUCKS. After many year I gave them another chance. Netgear's management is incompetent. Their tech support SUCKS and: THEY. DO.NOT.CARE.",
      "rating": 1.0,
      "verified": true,
      "author": "J. F Joyner",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "When it worked, worked well, then, it didn’t work at all. Now, available at almost half the price.",
      "text": "Died after 19 months. Bricked completely when the “new and improved” mobile app told me I needed an upgrade to the firmware. I followed all directions and it stopped. I got it to reset once, reestablished communication with all devices, then quit again, this time for good. It was good when it worked, but any upgrade was always hours of work.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher V",
      "helpful_votes": 2,
      "publication_date": 20190728
    },
    {
      "title": "No Dead Spots - So Happy!!!",
      "text": "I am so happy with my Orbi RBK53 system. I have a 2300 sq ft house but with additions, old lead paint, concrete walls, and it overall configuration, getting wifi to remote areas was near impossible. I can now walk around the whole house on a video conference call while my kids are streaming Youtube and my wife is watching Netflix and I have absolutely no degradation in call quality. Amazing product Netgear!! Thanks for making my life better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "Very happy with this purchase",
      "text": "I am very happy with this system. Had an issue getting it set up through the app but when Inised the website it was super fast and east. The system itself qorks like a charm. I have internet to every corner of my 2,300 sq ft home, even the dead zones are covered. We run up to 7 devices at one time (sometimes 10) with no issues. Very happy with our purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 3,
      "publication_date": 20180128
    },
    {
      "title": "Not delivered as promised",
      "text": "The product works well. It is very easy to set up and works well after 4 weeks of usage. I am rating it 2* secondary to being delivered 3 business days after its \"guaranteed delivery\" date. The problem is not the product, but rather the vendor.",
      "rating": 2.0,
      "verified": true,
      "author": "paul height",
      "helpful_votes": 2,
      "publication_date": 20190510
    },
    {
      "title": "Make sure you buy from an authorized reseller - netgear will not honor warranty otherwise",
      "text": "The device was effective but when I needed some technical support from Netgear, I uploaded my proof of purchase from Amazon but because the seller was not an authorized seller of Netgear products, it was rejected. On closer examination of the box, the unauthorized seller bought this at Costco at a promotional price and tried to dump it on Amazon without the warranty disclosure.",
      "rating": 1.0,
      "verified": true,
      "author": "hal katzen",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Dissapointing",
      "text": "I bought this when my Asus died. This is an ok router. We have 100 Mbps cable internet and 90% of our devices are hooked up by Ethernet cable. Unfortunately this router gets bogged down easily. I can have my youngest son watching Netflix on Ethernet connection, my older son playing Xbox on WiFi, and I'll be watching Hulu on Ethernet and our connections will buffer, a lot. It's disheartening that I paid more for this system than I did for my Asus and it doesn't work as well. The WiFi range is fantastic, don't get me wrong but the product is lacking when it comes to using multiple devices at the same time.",
      "rating": 3.0,
      "verified": true,
      "author": "CherryAngel",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Pretty incredible",
      "text": "Purchased the RBK44, have a large multi-level home on the water and wanted coverage on my dock as well. VERY pleased with the results! Signal strength is consistent, very strong and super easy to set up. Advanced configurations if needed are pretty simple, though I find using online help searches to be better for me than phone support. (Unfortunately the phone staff can sometimes be difficult to understand in my experience) I would definitely rate ORBI as a super system and wi-fi network provider, strongly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Been there, tried that",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Good coverage and speed; but no MAC filtering in AP mode",
      "text": "Compared to previous Wi-Fi router, improved coverage and speed in 2-story 2000 sq.ft. house with router at one end of the house where the cable modem is located. However, I'm disappointed that when the Orbi is operated as an Access Point wireless MAC address filtering is not supported. I like to have that as an extra layer of security to restrict access to my network (in addition to WPA2 of course). All Wi-Fi routers I've owned (Linksys, ASUS) have supported that even in AP mode but not the Netgear Orbi.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 3,
      "publication_date": 20170904
    },
    {
      "title": "Great coverage",
      "text": "I had problems with my old wifi with weak signal in many areas of my house. Orbi has great coverage and very happy. App is pretty good. I have 30 devices or more with all my home automation. Ionly con is it doesn't switch between satellites when you move devices around the house, so I just toggle wifi on and off on the device",
      "rating": 4.0,
      "verified": true,
      "author": "Sol K.",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Disappointed",
      "text": "I’ve had the system for over a year now. It started off well but I have over 20 different devices connected and it seems that even with two satellites it can’t handle them all. When it works I get great speed, but often I get dropped WiFi or super slow speeds for about a good 5 minutes before it connects/speeds back up. I paid a lot for this and very disappointed that it hasn’t lived up to doing what it’s supposed to do. Looking at other systems, hopefully I won’t lose another $600",
      "rating": 3.0,
      "verified": true,
      "author": "Terrell",
      "helpful_votes": 2,
      "publication_date": 20181114
    },
    {
      "title": "Great Mesh Router!",
      "text": "With so many smart devices today, a conventional router couldn't reach all the rooms in our home, but this mesh system works great. It was actually quite easy to activate, but make sure to load the app prior to setting it up if you need wifi to do that. It's also helpful to watch one of the YouTube instruction videos prior to set up as well. But i have to say what a difference it makes to be able to get wifi and watch Netflix anywhere in the house!",
      "rating": 5.0,
      "verified": true,
      "author": "pantysue",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Best Router System Available.",
      "text": "This is the best router system I have ever had. Over the last 10+ years I have owned at least 5 routers and associated repeaters for my house. This is the first router system that actually works throughout my entire house. I always had issues with lost or weak signals with the other systems, not so with this one. The Orbi system puts out a very strong signal with little to no speed dropoff when you are going through on of the satellites. There is not a better, easier, more effective router system on the market today.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles E. Carey",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Great wifi system for large homes",
      "text": "We installed an ORBI mesh wifi system in our vacation home which is quite large and spread out. It worked beautifully and greatly improved the speed and strength of the wi fi signal even in far corners of the property. So we ordered another one for our primary home which is large but more compact, spread over three floors. It was quick and easy to install (an hour) and is working great. I do not have any experience yet with technical support as we have not needed any. The ORBI app is a neat tool to monitor the system.",
      "rating": 5.0,
      "verified": true,
      "author": "R. West",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Finally, a Product that works!",
      "text": "The Orbi was my third router system trying to establish a reliable streaming situation throughout my house...it's the only one that delivers an \"excellent\" or \"very good\" wifi signal strength in every room...I utilize wifi with (3) Roku's and one Amazon Firestick 4K for tv, and (2) laptops, and (2) cell phones...all work, all the time with the Orbi! It really is that much better than my two previous Linksys systems! Buy with confidence...it's worth the expense!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Fantastic speed! Dump your Spectrum router!!",
      "text": "I did a ton of research on choosing the best Wi-Fi mesh network. I was between this, google end Eero. I have to say this was very easy to set up and I went from downloading at 6 MB per second in my basement to downloading at 117 MB per second throughout my entire house no matter where I am. I love the ability to shut off any device, including my kids or guests At any time 😬",
      "rating": 5.0,
      "verified": true,
      "author": "Dominick",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "WOW!!! Fabulous Distance and Speed!",
      "text": "This is my 3rd try at finding a system to cover a large area. Simple repeaters didn't work reliably, and a competing brand mesh system was a total dud. Not only does the Orbi system meet our needs, it far exceeds them. We now have reliable coverage with strong signal and speeds over 100mbps (limited only by our 100mbps internet service) in every corner of our house, pool area and yard, way beyond the advertised 8000 sqft. and it's very easy to set up. WOW!!! Thank you NetGear!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Huie",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "So far so good.",
      "text": "I have had the Orbi (main unit and two satellites) set up in my house for almost one week. Not a long time by any standard, but so far so good. I live in a home with foot thick concrete walls and the wifi signal must travel past three of these walls to reach from one side of the house to the other. Past systems with extenders were not able to keep the same strength and speed. This system has good coverage in all the rooms with little or no degradation. It also has been working well with Alexa!",
      "rating": 5.0,
      "verified": true,
      "author": "Glen R. Graham",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Works as advertised",
      "text": "This is a great product. It has both increased my internet speed and increased my range. I live in a flat with concrete walls so the signal is easily \"absorbed\" by the building. I previously had a similar setup with a different brand with the extenders in the exact same location and was unable to receive signal in my kids room. Now I can easily surf the internet anywhere in the flat. As mentioned by other reviews (although these seem to be the minority) there has been dropped signal issues, I had issues with the previous band dropping internet signal. I have had no such issues with the Orbi. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas G.",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Still Failing.",
      "text": "An update to my prior one star review. I still have major issues with this system. It finally worked with all satellites showing as green. One by one they converted to yellow in the network map and one satellite frequently disappears. Every evening this week the system has reset, and works through the magenta and blue cycles before finally working again. And that is not a quick process. I paid a lot of money for this system and would definitely not buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Gareth A. Roberts",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "price of additional satellites is too high",
      "text": "The wifi speed is great. Getting my modem to pass the public IP to the router was a pain but that's AT&Ts fault. I got this on sale and I have realized I need 1 more satellite AP, however the price for one is more than I paid for the set. This feels like inkjet printers cost $20 but the replacement ink is $50. Until the price drops on the satellites I'm moving the one I have to where I need it. Netgear, please lower the price on the satellites, they are ridiculously expensive.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Reliability and Ease of Operation",
      "text": "I purchased the Orbi because of the quality and reliability of my previous Netgear product. Although the previous Netgear WiFi performed well I needed a more robust and powerful WiFi system to feed into my household, including streaming TV in 3 different rooms. It works better than advertised and I am extremely pleased. I only wish my internet provider could provide more speed, as I am averaging under 300 Mbps. Setting up the Orbi was easy and I have had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "James J. Demetrio",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "No way to temporarily disable 5ghz to connect 2.4ghz devices.",
      "text": "No way to temporarily disable 5ghz so some devices are very difficult if not imposable to connect. Sadly it was a recent firmware update that disabled the ability to temporarily (or permanently) disable 5ghz. Why would that do that and make their product unusable for some devices that work just fine with 2.4ghz?",
      "rating": 4.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Don’t Waste Your Money",
      "text": "Did not work very well in my house My internet kept cutting in and out. I returned it, and bought a more traditional router. Also, very pricey for what it is.",
      "rating": 2.0,
      "verified": true,
      "author": "Del_752",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "IT WORKS!",
      "text": "This product is doing everything it says it would do. I have a 6500 sq ft lot with a 2300 sq ft house (2 story). Complete coverage from the sidewalk all the way to the back wall in the backyard. It even covers behind the garage. The APP is bad ass. I love that I can see who is connected and be able to independently kill internet access to what ever device I want. This comes in handy with kids. Set up pretty straight forward. I freakin love this thing. Been using NETGEAR for a long time. Happy I didn’t go elsewhere. Recommend this to everyone and anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "It is, as advertised, quite fast.",
      "text": "It is, as advertised, quite fast. Set up, however, wasn't quite as simple as it's made out to be. I had a great deal of difficulty getting the router to recognize the satellites. YouTube proved pretty helpful in filling in the little gaps in information from the Netgear instructions. The USB slot on the router seems kind of worthless. I assumed, that I would be able to plug in an external HD to use as a back up, but that, apparently isn't enabled.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "HUGE improvement!!",
      "text": "We live on average and had issues with Wi-Fi reaching out to the shop and barn, in addition to dead spots in the house. Picked up the 4 pack (8,000 sqft) on Prime Day and immediately installed upon arrival. Set up was a breeze, the app gives step by step directions. The difference was immediate!! Zero dead spots, no buffering, and full Wi-Fi coverage out in the shop (we placed a satellite out there). Very impressed that we now have full bars everywhere!! We will be purchasing an outdoor satellite for the barn. I wish we would’ve purchase the system sooner!!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Huey",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Total pain to set up and keep going.",
      "text": "It keeps losing the satellite orbi units and tech support is impossible to reach. Hope that Apple or someone else that understands customer service makes a competing product. Don't waste your money with this.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Ferber",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Not worth the price good idea poorly executed",
      "text": "Don't really care for them it extends great but doesn't let u choose what gadgets go on what signal or what satellite its tri-band but the system decides what goes on what band i don't like that I want to put my stuff on specific bands like my ring doorbells on my 2.4 band and the satellite in closest to it but it puts it on the big router in my bedroom a mile away",
      "rating": 3.0,
      "verified": true,
      "author": "Wai-kean",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Does not work properly with some Mac products / systems",
      "text": "Orbi systems have serious compatibility issues with Max OS. Search online for \"Orbi / Mac connectivity problems” and you will see that I'm not the only one to experience these crippling issues. My Imac only connects intermittently to the Internet (something that worked fine before I \"upgraded\" to Orbi. I spent a lot of \"quality\" time with NetGear's customer support but the company was not able to provide me with a solution. I will not be keeping this (expensive) product.",
      "rating": 1.0,
      "verified": true,
      "author": "eric",
      "helpful_votes": 4,
      "publication_date": 20180217
    },
    {
      "title": "Works well once up and running",
      "text": "Now that it's setup, the system seems to work well, but setup was a bit of a hassle. It was designed to configure itself automatically, but something went wrong and I had to reset everything and do much of it manually. I love the idea of multiple access points in the house on the same wireless network, and that seems to have solved our connectivity issues - good throughput throughout the house with the main unit on the 2nd floor and the satellite on the 1st floor. It's good enough that I'm considering going all wifi and shutting down the LAN for my main desktop computer.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Ruggeri",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Smooth signal, great area coverage.",
      "text": "The Orbi is incredible. I have the router and three satellites throughout my 3 level 4600 sq ft home. I have 1 GHz internet coming into my home on the 3rd floor. The signal on the second and third floor from satellites are running at 600+ GHz. This is a great system for a large area to cover. Install was very smooth with one call to the manufacturer. I have some consumers that only work on 2.4 GHz. Orbi has 2.4 and 5.0 GHz. When connecting things I had to choose the correct ban for that product. I would highly recommend the Orbi system.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Horrible wifi calling. Will not connect with Nest cameras. Tech support even worse",
      "text": "The wifi coverage seems good, but with wifi calling, there is always a delay in hearing each other. Getting updates on instagram, etc always lagged, or would not happen at all. I wasted at least 7 hours of my life trying to get the Nest cameras to connect using their tech support. THEY ARE HORRIBLE. wait times of at least 45 minutes, then they transfer you to a \"level 2\" tech, who after another 45 minute wait states they will call back within 2 hours. Never happened. I bought the Linksys velop. Not perfect, but much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Works well",
      "text": "A bit of a chore to setup and configure using my laptop. The App is even more cumbersome. Once all done, it works well. My only real beef with it is mine did not allow me to create a separate SSID for a 5G network. I have to rely on band steering as the SSID for 2.4 and 5.0 is the same. Im just not a fan of doing it this way. Seemed to work fine with iOS wifi calling as well",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Kelly",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "We are having a hard time getting the Orbi connect ...",
      "text": "We are having a hard time getting the Orbi connect to Mac OS and the speed and range have issues because of a software update. We are planning to return the unit after 4 weeks of trying to work with the tech support.",
      "rating": 1.0,
      "verified": true,
      "author": "Srinath Rajen",
      "helpful_votes": 5,
      "publication_date": 20170611
    },
    {
      "title": "Slower than expected",
      "text": "Definitely covered my larger two story home but constantly hanging up and slower than the router it's connected to. Even the hardwired Orbi has a slower connection speed than the wifi on the TPLink it's connected to. Very finicky about staying connected to devices as well. It's not bad to the point of being upsetting but for the price I was expecting something better. May replace with different wifi extension in the future.",
      "rating": 2.0,
      "verified": true,
      "author": "Serious Sam",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Orbi in a big house with YouTube.tv.",
      "text": "We just moved into a big home with brick exterior. I had a nighthawk previously. Comcast modem router was terrible. The orbi give us seamless WiFi from the 1st floor to the basement to the second floor to the porch yo the garage This is the way to go for a big home who has cut the cable. Make sure you jet your internet provider know when you switch. The modem needs s new sugnsl.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey D. Mogg",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Total Garbage",
      "text": "I bought this router to deal with weak signal in my relatively small apartment (there's basically a Faraday Cage in my wall), but the cure ended up being worse than the disease. After the 2.0 firmware upgrade, this router became total garbage. After months of trying to figure out what was wrong, I finally downloaded software that scanned for spectrum congestion near me – only to realize that the Orbi network was simply not broadcasting a 5 GHz signal. Netgear routers are simply not worth anything these days; I'd seek another manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Bradley Portnoy",
      "helpful_votes": 3,
      "publication_date": 20190516
    },
    {
      "title": "Great",
      "text": "I’m using the orbi as an access point with my Verizon Fios router I have 1000mb internet and with orbi it’s 225mbs on average wirelessly",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 2,
      "publication_date": 20200301
    },
    {
      "title": "Orbi connection issues to Xfinity",
      "text": "Installation sucked for me. I have Xfinity X1 WiFi. Do NOT put your X1 modem in Bridge mode!!! Only disable the WiFi on X1. When your Orbi finally gets assigned an IP adress you will have to do a one time Xfinity logon when you first connect to the Orbi WiFi. Great network speeds on all three floors!!!! Little to no loss of max modem speeds. 250 + Mbps through home :-). One SSID! ER scan to connect all other users with smart phones! Super happy now :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Allen",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Avoid Orbi as the firmware is hit or miss.",
      "text": "The Netgear Orbia is mediocre at best. It works great most of the time, but Netgear keeps releasing firmware to fix one thing that breaks another. Considering the high price of this unit and the company, I really expected a higher quality router. Right now, my Orbi is working OK, but its satellite drops off for no reason. (Blue \"good\" status and it just konks out from time to time. This didn't happen with previous firmware, so it's not the hardware. It's Netgear's poor programming that broke it. Unless they drastically improve their firmware, stay away from the Orbi.",
      "rating": 3.0,
      "verified": true,
      "author": "Christine Howard",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Fantastic for large buildings with dead spots in the wifi signal. Simple 5 minute installation.",
      "text": "I have a long house with a basement. I have four TV's strung out the length of the main floor and two in the basement. We stream all video on all 6 TV's. We have high speed wifi (275mbs) but the TV's were buffering with the wheel spinning. I put the Orbi router in the middle of the main floor and a satellite at the far end of the main floor. I put another satellite in the basement. Now everyone has high speed WiFi anywhere in the house. The main floor is just over 3000 sq ft. No more buffering. Installation was quick and simple. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill S.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Works great, just be aware of a setup glitch",
      "text": "This product works great, has eliminated dead spots on my house. Only issue I had was in setting things up with the app, it wouldn't recognize my satellites. When I went to the next step and updated the firmware, then it recognized them. So, when you get yours, don't worry if the satellites aren't found, just keep going with the install process.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Tee",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Good Bit of Networking Gear",
      "text": "There are a ton of reviews on the net, including Youtube, and I don't have a lot to add to those. I hooked mine up in my two story adobe house and now I finally get my full internet bandwidth (65mbps) everywhere on my property.Yes, my house is made from adobe, with essentially 2 foot thick mud walls everywhere. So signal strength has always been a challenge. But not anymore. Right now, with home automation and a ton of gadgets I have close to 30 devices on the wireless. All is well.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric L.",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Update --  Easy and works great --sometimes",
      "text": "I don’t know a huge amount about home networking but was able to set my Orbi up in about 30 minutes and on the first try. The speed is amazing and we no longer have dead spots. Update after 2 months -- We are having problems with slowdowns on the satellite units. Speeds slow and become nearly unusable until the units are restarted. They work great again for a few weeks. Not nearly as happy as I was.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Bangert",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Thought I was buying new, got used",
      "text": "The setup of this device should be easy. It was not. I thought it was me and tried multiple times to get it working. No luck. Finally I gave up and hired a tech smart young man to see if he could get it working. He quickly identified the problem. The unit had been configured by someone before I got it. That's why my attempts ran into a stone wall. He was able to reset the device to factory settings and from there the set up went just as it should have. Now I'm wondering if I should return the unit. What could be next?",
      "rating": 1.0,
      "verified": true,
      "author": "William J. McDermott",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "As expected!!!",
      "text": "Difficult to install. It worked well till I accidentally unplugged a Satellite. Now I have no Wifi! I have tried to robot the system nothing. I looked for a number to call for tech support but I cannot find one. I keep getting push into a online community that is useless. I hate this system with a passion. Buy the google version if you are looking for a easy to use mesh system.",
      "rating": 2.0,
      "verified": true,
      "author": "Omar",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Nothing Special",
      "text": "I didn't think much of it. Wasn't a miracle worker for me like many have claimed. I found Google Wi-Fi to be more beneficial. The app is horrendous in my opinion, extremely basic. Most of all, there's no way to tell what unit any device in your network is connecting to. I had two satellites/router in 3000sq.ft. and 5ghz still didn't work reliably. I wouldn't recommend this to anyone that wants any basic information whatsoever about what is going on with their network.",
      "rating": 2.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 2,
      "publication_date": 20170509
    },
    {
      "title": "Major Improvement over my old router",
      "text": "The Orbi was quickly set up and installed, in a matter of minutes. This included upgrading the firmware to the latest version. Since installation I have seen improvement in wireless coverage, improved wifi stability and excellent download speeds which take full advantage of my provider's service speed. I like the ability to manage my network via a web based interface, as well as a smart phone app. I also like the ability to view usage, logs and other information. If there was one feature, I was looking for, is to allow monitoring via SNMP.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas J. Metrowsky",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Far exceeded my expectations",
      "text": "I bought my Orbi kit (RBR50 router and 2 RBS50 satellites) for a large, old 6000sq. ft farmhouse, where my network box was at the far end of my house. Just the router and one satellite were able to completely cover the house, where my old range extender couldn't penetrate the walls. The second satellite now covers the detached garage, since I ended up not needing it in the house. The setup was easier than I expected, it was more difficult to change my modem to bridge mode than set up the router and both satellites.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Kutch",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Started off wonderfully, great speeds",
      "text": "Started off wonderfully, great speeds, 100% up time, and then about 2 months ago it went south. Devices started disconnecting randomly, sometimes all at once, sometimes individually. Wifi would drop out completely or slow down. Tried everything suggested on the netgear forums to fix it, but now after a lot more research it seems like the issue is with the firmware and how it manages connections to the satellite unit, which is the entire selling point of the system. Currently running this with the satellite unplugged as that's the only way to keep a stable connection. Unfortunately it's too late to return it now, I feel like I've been burned. Would not suggest buying.",
      "rating": 1.0,
      "verified": true,
      "author": "Gremlinthegreat",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Setup is miserable. Its best to ignore the instructions and setup from your desktop. IGNORE ORBI MOBILE APP AT ALL COSTS.",
      "text": "Love the speed, hated the setup. 2 stars because the mobile app for setup doesn't work and I spent over 2 hours trying to get app to recognize the devices, Otherwise 5 STARS FOR PERFORMANCE, I finally abandoned the setup instructions completely and set the devices up from my desktop and it took me 3 minutes. HAVE NO IDEA WHY THE MOBILE APP EXISTS, IT'S COMPLETELY WORTHLESS. USE YOUR DESKTOP TO SETUP. I had 5 LUMA's all over the house and connection was poor and download speed was around 20mbs. Now I'm consistently over 120 MPS download speed in every area of the house with these.",
      "rating": 2.0,
      "verified": true,
      "author": "RV",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Life Changing!",
      "text": "I love my Orbi! I live in a rural area and we only get local company internet and it has made everything in my home so much easier! I went from barely being able to stream Netflix and use two phones to being able to put a Xbox, fire stick, two or more phones, tablets and Alexa dots. It has been a breath of fresh air. I was nervous at first because I did see a few bad reviews but I have had absolutely no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Easy, and fast set-up.",
      "text": "Very easy to set-up. I have tried other range extenders and never got them to work properly. Since the Orbi satellite comes with the Orbi wireless router, I thought I had a better chance at getting it to work. I used the free Orbi app on my tablet and it was smooth sailing. I now have 100% signal strength in an area where Wi-Fi previously dropped. I also bought a Netgear cable modem. The whole set-up took less than 1 hr.",
      "rating": 5.0,
      "verified": true,
      "author": "A. L. Holtz",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "much easier to set up than expected",
      "text": "we have 22 wireless connections in the house with smart plugs, ring, ecobe, Sonos, etc. The system went in easily, although I did expect more than a single cat5e cable (I used cat 7). Most of the peripherals hooked up easily except for the Ring. The doorbell and camera fought it for a while. Most things like the plugs needed to be either turned off and back on or had to be dropped and reinstalled. Overall, once the first one was done the rest came easy. Apple tv still a bit of a dilemma. Works faster wirelessly than connected to one of the hubs. Harmony remote also had to be rebooted. Prior to that it was slower.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Knapps",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Router loses connection nightly with latest firmware no fix in sight",
      "text": "Worst router I have ever owned. Product is great when it works which Is rarely. The main router and satellite are constantly losing connection for periods of up to twenty minutes or more almost every night. Customer support is useless and since this is running on the latest firmware which has not been updated in weeks I would extremely caution anyone from wasting their money on this useless router.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "My son was really impressed because he got great wireless reception outside by the pool",
      "text": "This is most definetly worth the cost. my son could not get wireless reception downstairs even though I had an extender at the top of the stairs. Turned the wireless from my cable modem off, plugged the router into the modem, put the extender downstairs and now everywhere in the house we all get full bars. My son was really impressed because he got great wireless reception outside by the pool, this thing covers the entire yard also. Simple to install and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "bsee4u",
      "helpful_votes": 2,
      "publication_date": 20170514
    }
  ],
  "product_meta": {
    "title": "NETGEAR (RBK30-100NAS) Orbi Whole Home Mesh WiFi System – Simple setup, Wireless router replacement, no WiFi dead zones, Works w",
    "description": "Size:2 Pack, < 3500 sqftFAST WHOLE HOME SYSTEM \nBring fast, secure, and reliable internet to your entire family with the NETGEAR Orbi Home WiFi System. No more WiFi boosters or extenders necessary. The Orbi WiFi Router and Satellite extend high performance WiFi to your property from the basement to the backyard. The system smartly manages your WiFi so that each device's access is optimized and never interrupted. \n\nUp to 5,000 SQUARE FEET OF COVERAGE \nFrom the home office to the basement to the pool, this wireless internet system covers every inch of your home with a strong WiFi signal. Unlike router and repeater combinations, Orbi covers the whole home with a single WiFi network and name, enabling seamless indoor/outdoor and room-to-room connectivity. \n\nTRI-BAND TECHNOLOGY \nAward winning and patented Tri-Band Technology provides Orbi with a dedicated backhaul connection between the router and the satellite, so the system can manage multiple network connections without compromising speed. Watch movies and TV, play video games, download music, books, and more. \n\nQUICK & EASY SETUP \nSelected as Editors’ Choice by PC Magazine, Orbi works with your current internet service provider and sets up in minutes right out of the box. Use the Orbi app or any web browser to create your entire home’s secure WiFi network in minutes. No personal info, account creation, or hands required with the new Amazon Echo Alexa skill and our intuitive and preconfigured system. \n\nGUEST CAPABILITY \nAllow guests the opportunity to access WiFi while protecting your network and password. Easily create a network to service visitors, and Orbi handles everything else. You'll rest easy knowing that your information is safe from security breaches, viruses, malware, and network worms. \n\n- NETGEAR Orbi AC3000 Home WiFi System \n- WiFi Router and Satellite Extender - High-Performance Tri-Band Technology \n- 5,000 Square Foot Range \n- RBK30",
    "rating": 4.1,
    "feature_bullets": [
      "FAST WHOLE HOME WIFI SYSTEM - Covers up to 3500 square feet with high performance WiFi, kit includes WiFi router and Wall Plug Satellite",
      "Wall Plug form factor for easy placement. Just plug the Satellite into any electrical socket to extend WiFi coverage",
      "TRI-BAND TECHNOLOGY - Orbi routers maintain data flow for your connected devices using a dedicated backhaul connection",
      "Quick & Easy Setup - Just download the Orbi app, plug in your system, and follow the instructions to get your house on the net",
      "GUEST NETWORK - Easily set up a separate and secure WiFi network for visitors and guests to use. Works with Amazon Alexa & the Google Assistant. Works with Orbi OS. WPA/PSK2 support"
    ],
    "specifications": {
      "Wireless Type": "802.11bgn, 802.11a/g/n/ac, 2.4 GHz Radio Frequency",
      "Brand": "NETGEAR",
      "Series": "RBK30",
      "Item model number": "RBK30-100NAS",
      "Operating System": "Unknown",
      "Item Weight": "2.32 pounds",
      "Product Dimensions": "6.7 x 3.1 x 8 inches",
      "Item Dimensions  LxWxH": "6.7 x 3.1 x 8 inches",
      "Manufacturer": "Netgear Inc",
      "ASIN": "B06XJMFDRP",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 28, 2017",
      "Customer Reviews": "4.1 out of 5 stars1,747 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#5,256 in Computers & Accessories"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Whole Home & Mesh Wi-Fi Systems",
      "Networking Products"
    ],
    "price": 189.95
  }
}