{
  "website_summaries": [
    {
      "verdict": "Choose this one if saving a bit of money on a spacious griddle is important to you; but the results you get may not be worth the savings.",
      "pros": [
        "A large, spacious iron griddle that's pre-seasoned and reversible",
        "Has ample-sized edges to catch grease",
        "Comes at slightly lower price point than others in its class"
      ],
      "cons": [
        "Several owners gripe that it doesn't cook evenly - gets hotter in the middle than around the edges",
        "Food occasionally sticks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Don't waste your money: buy LODGE",
      "text": "I tried to save a few bucks by buying this off-brand Vremi griddle instead of Lodge. I already own a Lodge and wanted a second griddle as a back up for when I'm serving a crowd. This Vremi version is not well seasoned: it arrives black, but the surface has a very rough texture (unlike Lodge, which comes smooth and pre-seasoned like a centuries old well seasoned iron skillet) When seasoned properly, a good iron pan is naturally non-stick. Even when oiled, absolutely EVERYTHING sticks to this Vremi pan. Also, it has a slightly smaller cooking surface than the LODGE. I wish I would have just spent the extra ~$10 and bought the Lodge.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 6,
      "publication_date": 20190616
    },
    {
      "title": "Awesome little griddle!",
      "text": "This is a great little griddle! As an avid cast iron collector, its pretty much what i cook with exclusively. I was desperately trying to find a good sized dual sided griddle and this ine fit the bill. After seasoning both sides, i was able to make pancakes and they came out awesome. I cant wait for the seasoning to get thicker the more i use it so itll be smooth as glass. Super happy with it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gigifiggi",
      "helpful_votes": 2,
      "publication_date": 20170712
    },
    {
      "title": "Nice and heavy, but not nonstick.",
      "text": "From the discription that clearly says \"nonstick,\" I expected a nonstick coating would be applied to the cooking surface on the cast iron. There's not. It's just a plain, old cast iron griddle. It's heavy AF. It's so heavy, it could be a murder weapon.",
      "rating": 3.0,
      "verified": true,
      "author": "Ben Harman",
      "helpful_votes": 2,
      "publication_date": 20190221
    },
    {
      "title": "DOES NOT FIT MY STOVETOP - double check sizing before purchasing",
      "text": "So this review is spefically because is does not fit over my two burners. I don't know if it's because my stove is older, but if I want to use the flat side (griddle down) for say, making pancakes... it does not sit flat over the burners. One of the curved lips near the handles catches and the whole thing sits slightly at an angle. It wouldn't be such an issue, BUT then all the oil runs off instead of being useful ON the griddle",
      "rating": 2.0,
      "verified": true,
      "author": "stella e.",
      "helpful_votes": 3,
      "publication_date": 20170812
    },
    {
      "title": "This is the best grill! Love it",
      "text": "This is the best grill! Love it! Made tasty chicken and I like that the groves still allow for moisture to collect so meats stay moist! The grill marks make it look and taste professional. Still learning how to make pancakes on the flip side as you have to get the temperature right or they burn or get overdone. Otherwise, if properly greased, you can make a nice brown pancake. Very heavy, nice quality and will be a \"go to\" item for many many years! I love the basics and goodbye junkie cookware!",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "I'm not happy the toxic smoke ran my family out of our ...",
      "text": "I'm not happy the toxic smoke ran my family out of our house. Sending it back I have never been this unhappy with an Amazon product.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephano S.",
      "helpful_votes": 6,
      "publication_date": 20180109
    },
    {
      "title": "Check Your Burner Cover",
      "text": "Before purchasing, because the grease gutter fits over the burner cover very snugly to keep the griddle flat. My husband had to hacksaw off parts of 2 burner covers to get the griddle to fit the stove. Also, because of the 1\" all around the griddle grease gutter, the USABLE GRIDDLE AREA is only 15\" x 8\". Can barely fit 2 pancakes on it. Finally the grease gutter it very shallow (less than 1/2 inch), it can easily overflow -- and it's a bit tricky to empty in the middle of cooking a meal when the grease & the griddle are piping hot. My husband likes this griddle because it's cast iron, but I definitely would not recommend buying it.",
      "rating": 3.0,
      "verified": true,
      "author": "Hates to Shop",
      "helpful_votes": 10,
      "publication_date": 20170901
    },
    {
      "title": "I am pleased that I came across this one",
      "text": "I've been looking for a griddle so I can grill indoors when it's HOT outside. I am pleased that I came across this one! It is the right size for use on my gas range. It heats up evenly and has a nice rim so there aren't any run offs onto the stove (nice feature when you're oven isn't flat, lol). It cooks pancakes and eggs perfectly, I don't have to use more then one pan. I can't wait to cook hamburgers and even to try steaks. It's a really nice griddle!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie W.",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Doesn't fit so well on my Hotpoint Burners",
      "text": "I have to play with it to get it just right so it doesn't move when the flat griddle side (the side I use most) is up. First time using it my eggs went all over the place. Also you must be sure to pre-heat it thoroughly before putting any food that may run on it. Otherwise it's a quality item once you get used to it.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Dai",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Don’t buy",
      "text": "Became rusty after one wash. I had to throw it out",
      "rating": 1.0,
      "verified": true,
      "author": "khadine dalhouse",
      "helpful_votes": 3,
      "publication_date": 20190614
    },
    {
      "title": "It get rusted  in the first use not worth the price",
      "text": "This is not a non stick one, I use it the first time and the meat stick to the pan and it’s hard to clean. After cleaning I left it to dry , and guess what comes out? It rusted all over that I have to wash again and dry it and put lots of grease to prevent from rusting!! It’s a bad quality. Not worth the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Beautiful melody",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Not seasoned and rusted like crazy",
      "text": "I used this once. Cleaned it and oiled it and put it away in the kitchen. Pulled it out a few months later and it was rusty as hell. It's the same place I store all my cast iron skillets and they're fine. The food stuck to it as well the one time I used it. Not seasoned and now I have to clean and season it all over again. Would not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth C",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "I would not recommend for someone who can't lift heavier objects",
      "text": "This griddle pan is versatile for using either side depending upon what you are cooking. The griddle is large enough to cover two burners. It is heavy cast iron. I would not recommend for someone who can't lift heavier objects. Personally I prefer the cast iron as it provides an even cooking surface. Both sides of this pan are designed to provide healthy meals as the fat drains off to the sides as cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Gittemeier",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "Misleading measurements",
      "text": "Dimensions are not accurate. This listing said the griddle is 20 inches (or 19.75) but the griddle is actually significantly shorter in the middle due to the handles. Because of this, it does not fit properly on our stove. Measurements should be if the shortest point to ensure proper fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Roofus",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Wish it’s something easy to return but it’s so heavy",
      "text": "RUSTED AFTER 1 USE!!!!!!!!! Even made sure it was completely dry after I washed it. Wish it’s something easy to return but it’s so heavy. Such a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Cris",
      "helpful_votes": 2,
      "publication_date": 20180323
    },
    {
      "title": "I am very pleased.",
      "text": "I have used this on top of the stove and love it. I want to try using it in the oven under the broiler and will update if there is an issue. After I clean this item I put it across the burners and turn the heat on to make sure it is dry. In doing that I do not have an issue with rusting.",
      "rating": 5.0,
      "verified": true,
      "author": "MASmith",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Awful cheap",
      "text": "Looks cheap returning it. Awful just like the rest of the reviews. The whole grilled started to smoke. Awful product returning the product terriable customer service too",
      "rating": 1.0,
      "verified": true,
      "author": "Pc Customer",
      "helpful_votes": 3,
      "publication_date": 20180710
    },
    {
      "title": "JUNK!!!!",
      "text": "I would not buy this. After two uses I it cracked. I didn't know that cast iron would crack but this griddle did. Do not buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Jan Pierce",
      "helpful_votes": 2,
      "publication_date": 20181109
    },
    {
      "title": "Quality - Heavy Cast Iron",
      "text": "Quality is real heavy Cast Iron, weight is twice the other brands I looked at, which is what I wanted, had to be careful setting on our cook top stove. Disappointed with heat distribution - our electric cook top has 1 large & 1 smaller burner on each side - the grill did not heat evenly, maybe with time we can get adjusted to two different settings? The cooking area is much less than measurements, must have measured handles & grease catch edge. Did clean up nicely, make sure you dry thoroughly to prevent rusting.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Great product works well for cooking",
      "text": "I have been wanting one of these for a while and finally started cooking on it. Great product works well for cooking. Not that good with bacon, grease pops everywhere, but everything else is cooks awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "michael joseph bonin jr",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Easy to clean",
      "text": "Heavier then I expected. Great price and easy to clean",
      "rating": 4.0,
      "verified": true,
      "author": "Lau",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "These are AMAZING! We've been using a smaller cast iron grill ...",
      "text": "These are AMAZING! We've been using a smaller cast iron grill pan to cook steaks and burgers on the stove, but never had enough room in just one batch. The size of these allows you to cook 6 good size burgers, or 4 good size steaks. Handles on both sides also make it so easy to grab and transfer to the oven to finish cooking meats through. That isn't the case for the extremely heavy on one side cast irons with just a single handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Hector",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "I would recommend it to cook on our induction cooktop",
      "text": "Purchased the Vremi cast iron reversable griddle for my induction cooktop, I was hesitant because I purchased one in the past and did not work in my induction cooktop, I tried it out last night and it worked perfectly. I purposely cook two big T-bone steaks and a pass the test, not sure about the other side but I wanted it to grill steaks. So far I am very pleased with the griddle side of it, I would recommend it to cook on induction cooktop",
      "rating": 4.0,
      "verified": true,
      "author": "Vianca Larice",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Griddle/Grill",
      "text": "The grill side of this works great on an Induction Cook Top...The Griddle side does not",
      "rating": 3.0,
      "verified": true,
      "author": "Clyde W. Cooper",
      "helpful_votes": 2,
      "publication_date": 20180401
    },
    {
      "title": "Best griddle I have ever owned",
      "text": "Great stovetop griddle pan. I have everything on it from eggs and bacon to grill cheese and grill steaks, chicken and it cooks even and nothing sticks. The best part is you can wipe it clean with a cloth.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis deleon",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Works great",
      "text": "Got this for my wife to use 2 burners on her 6 burner gas stove she love it cooked 6 grilled cheese on it at once. No pictures because she's always using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dracenknights",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "I would not recommend this griddle for electric stove with glass top due to potential scratching.",
      "text": "Good, even heat dispersion. Grill face cooks efficiently. Foods cooked on the griddle face tend to stick, especially pancakes etc. . I have an electric stove top with glass top. I would not recommend this griddle due to excessive scratches to the glass surface. Otherwise, for gas stoves, or older electric stove tops with standard heating elements, I think it's a good buy.",
      "rating": 3.0,
      "verified": true,
      "author": "William D. Harry",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Too heavy",
      "text": "This is so heavy and thick it takes a long time to heat up. Hard to store.",
      "rating": 1.0,
      "verified": true,
      "author": "Alma D.",
      "helpful_votes": 2,
      "publication_date": 20180316
    },
    {
      "title": "Not Nonstick - Not easy to clean",
      "text": "I was so excited for this purchase but I do not use the griddle at all. It is not even close to being non-stick and it is a chore to clean. When I have used it, it will take more than 20 minutes to clean. It does heat pretty evenly but that is really the only positive I have about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra C.",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Rusts really quick",
      "text": "I just started using this item about 1 month ago, and I wash it as soon as I am done, and I dry it but it still has allot of rust. I am afraid to keep using it as it transfer to the food. Def. not worth the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "NOPE. Don’t do it. Save your money",
      "text": "First use it jacked everything I tried putting on it. So much for “grill marks”. Just set off the smoke detector with a kid on your hip, a domino effect loud noise crying kid all trying to use this to make a what ended up being a garbage waste of money food and my time",
      "rating": 1.0,
      "verified": true,
      "author": "Katie P.",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Game Changer",
      "text": "I wish I had gotten this long ago. It fits perfectly over 2 burners and is so easy to cook on. I made the best pancakes of my life on it; cant wait to start grilling steaks in my kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "JohnsWayne",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Item is ok",
      "text": "Well I bought this and washed it , 1st day I used it, let it cool down then washed it. I guess I had it at an angle, so a corner of it got rusted due to sitting water. Also, it doesn’t lay flat on my stove It tilts to either side when I’ve made pancakes so it is not balanced. Extremely heavy & u have to use a lot of butter or oil so things don’t stick.",
      "rating": 3.0,
      "verified": true,
      "author": "Marisela",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Rusts with any drop of water. Right away",
      "text": "Very sturdy but it rusted right away. Didn’t not even want to cook anything on it. Let me know how I can return this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Alma",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Nice!",
      "text": "So far I've only used it once, but I'm very happy with it. I have an electric stove top and was a little worried it wouldn't work, but it does! I'm happy I now have an easier way to make pancakes for a large family. I love cast iron cooking in general and this doesn't disappoint. Nice weight to it and just what I would expect.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Murray",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "It doesn't hurt that the company's packaging is super cute too",
      "text": "I seasoned this griddle as soon as I got it and turned out my first mega-batch of pancakes this morning. Having a textured and smooth side on one griddle means this thing is going to see some use, especially because cast iron last forever. It doesn't hurt that the company's packaging is super cute too. I will have to get another to give as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa B",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Makes good pancakes",
      "text": "Nice and heavy and works well with our burners. The ridged side is a little harder to clean but not bad. We use it at least once a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Han D.",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Excellent large griddle",
      "text": "Heavy, too, as cast iron should be. Non-stick makes cast iron easier to use as well.",
      "rating": 5.0,
      "verified": true,
      "author": "RBY",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Not satisfied with product",
      "text": "We've used the grill 2 times 1 for grilling meat & once to make pancakes. We've washed it now it's has rust on it. If you swipe your finger across it you finger has the rust on it. Was there something that needed to he done b4 use or the way it was washed. We used dawn soap & a handiwipe to clean it. I'd appreciate a response. Thank you",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela A. Calderon",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "I'm happy",
      "text": "Use this on my grill if I want a flat top. Works well.",
      "rating": 5.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Use it all the time",
      "text": "Love this griddle, works well, READ up on how to Clean and care for it and it will work well for you. It could heat more evenly but that could be an issue with my burner/stove. I’d buy again",
      "rating": 5.0,
      "verified": true,
      "author": "D McVay",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great quality for the price!",
      "text": "Very versatile great for grilling on one side and pancakes in the other",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Top quality",
      "text": "Wow, this griddle is amazing. I have never owned a cast iron griddle before. Top quality and very heavy/strong. I love how I can make pancakes on one side and grill chicken on the other. It's definitely going to be a staple in my kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie C.",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "great quality.",
      "text": "This was a lot nicer than I expected. Heavy duty, great quality... easy to clean and simple to use. It fits perfectly on my stove over top of 2 burners just like I have always wanted :-)",
      "rating": 5.0,
      "verified": true,
      "author": "RandK",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Hard to clean and RUST cannot be removed.",
      "text": "I purchased this item back in April of 2020. In my opinion, I thought it was very heavy but my major disappointment was with this end result. It is disgustingly rusty. I have tried cleaning it multiple times but the rust cannot be removed. I wish I could get a refund, perhaps it was a bad batch.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "This is perfect for camping",
      "text": "This is perfect for camping, I put it on my camp stove and it heats evenly cooking everything together. I think it would be good for home too, but I have only used it camping. It is great quality and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Ty",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "EXACTLY AS DESCRIBED",
      "text": "Great product, cast iron will never be Teflon non-stick. but this is easy release and easy clean. Large size will accommodate parties. Works great on the grill as well. I have 2 and love them both.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Awesome griddle",
      "text": "I love this griddle! We can use it on the grill outside or on our gas stove in the house or even in the oven!! I haven't had any problem with food sticking. It has plenty of room for cooking for multiple servings. It is good quality and I see myself using this frequently.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Gilbert",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Must have!",
      "text": "I use this daily in my house from heating up tortillas to making pancakes and of course to grilling chicken and steak! Everything cooks very well and it's very easy to clean which is a plus. Very heavy and sturdy. I really love using this for breakfast since I can cook pancakes and bacon all at the same time :)",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Hernandez",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "ANAZING",
      "text": "A must have for your kitchen! Super easy clean and great cooking with this griddle.",
      "rating": 5.0,
      "verified": true,
      "author": "Ignacio Ramirezlazos",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Heavy and difficult to clean",
      "text": "Too small in width. Bought it for pancakes and can only do three at one time at best.",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas R Cochran",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Handy for kitchen use",
      "text": "Can make multiple pancakes at one time. Can get grill marks on meat products.",
      "rating": 5.0,
      "verified": true,
      "author": "NANCY VALENTINE",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "I LOVE this griddle",
      "text": "I LOVE this griddle!! it's important to remember it is cast iron so it's a little more work to keep nice but it is literally perfect fr our camp stove. It is quite heavy, but that comes with all cast iron - super happy with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Russell",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "TERRIBLE PRODUCT DON'T BUY",
      "text": "Item is very unsafe. After one use it was already brown and can not be clean. Supplier doesn't answer. This is not a way to do business, you shouldn't be allowed to sell crap cheap stuff on Amazon. DON'T BUY THIS!!",
      "rating": 1.0,
      "verified": true,
      "author": "Gila Hara",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "A must have for pancakes",
      "text": "Great value, makes large batches of pancakes a breeze. Nice even heat. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Werhanowicz",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Extremely worth it if you know how to use it!",
      "text": "I love everything about only wish there was a oil dip on both sides but it's cool if you clean and oil properly after each use cast iron lasts a life time All the reviews are probably cooks who don't properly care for the product after each use",
      "rating": 5.0,
      "verified": true,
      "author": "vachonne Smith",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Excellent addition to my cookware collection",
      "text": "What a great product! This cast Iron griddle fits perfect across 2 burners. Making cooking for a family of five quick and simple. These griddle is heavy!!! Easy to clean up and a great addition to my cookware. Very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Kasch",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "It works",
      "text": "Really like using it. Haven’t used it yet on the stove.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy McQuarrie",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Excellent product.",
      "text": "The product for the amount of money is right on. If you do what it says you should have no problems. Thank you I will be buying more as gifts!!",
      "rating": 5.0,
      "verified": true,
      "author": "deanna e vitale",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Works great on my gas stove top",
      "text": "Works great on my gas stove top. I'm having issues seasoning it properly, but I think I'm the issue, not the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy K",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Perfect for grilling indoors.",
      "text": "This grill does an excellent job of grilling steak on a gas-burner stove with minimal splatter. Easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew LaB.",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "One Star",
      "text": "I just bought this usd it once washed it and now it rusted it so upset",
      "rating": 1.0,
      "verified": true,
      "author": "robin",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Five Stars",
      "text": "Very heavy this is wonderful on electric stove. Covers two burners.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "looks nice",
      "text": "looks ok have not had a chance to use it",
      "rating": 5.0,
      "verified": true,
      "author": "LLOYD W. BUSH",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Tried this product this weekend and LOVE it! We will be using this regularly",
      "text": "Tried this product this weekend and LOVE it! We will be using this regularly. Loved that I could have my steak, potatoes and veggies all grilled together!",
      "rating": 5.0,
      "verified": true,
      "author": "stacey",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Pre-seasoned?",
      "text": "Is this truly pre-seasoned? The first time we used it, we cooked a steak on the grill side. It completely stuck to the grill. It took me an hour to scrape the food off with a scraper we purchased at the same time. Before using it again, I checked the product information and it clearly states pre-seasoned. The second time using it, we cooked pancakes on the griddle side. Same results! I spent time cleaning it thoroughly with soap and a scrubber this time, then followed the directions for re-seasoning. Nope, no better. We've used cast iron pans for years, but have never had this issue. Now I'll just buy a non-stick, electric grill.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa G",
      "helpful_votes": 2,
      "publication_date": 20180425
    },
    {
      "title": "It's awesome",
      "text": "I won't use a skillet ever again!!! I love this thing!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "ashley",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Season it several times before use.",
      "text": "I love this grill but its heavy. You definitely have to season it several times. Very very important but very easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Barone",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Great griddle!",
      "text": "Seasoned this before use, and make sure to season it lightly after each use. Love this—eggs don’t stick, pancakes don’t stick and cook so much more evenly and loftier than in my pans. I am becoming a cast iron convert!",
      "rating": 5.0,
      "verified": true,
      "author": "ABW",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Rust easily even when dried",
      "text": "Hard to clean, heavy, and even when I dry it completely it still rusts ☹️",
      "rating": 3.0,
      "verified": true,
      "author": "S-DMa",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "easy to clean",
      "text": "I really like this product. now I can bbQ in the house♥️",
      "rating": 5.0,
      "verified": true,
      "author": "Know ID",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great grill pan",
      "text": "The pan is great for indoor grilling. I had trouble cleaning the pan after grilling chicken....even though I sprayed the pan first.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecil  ",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "I use it on my grill",
      "text": "Heat the griddle up to at least 400 degrees, then put your steaks, burgers, chops, etc on it! Sears in the juices so that yiur meat comes out juicy and tender!",
      "rating": 5.0,
      "verified": true,
      "author": "John Lipich",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "I wouldn’t buy it again",
      "text": "Was not non stick, and started turning orange on the corners.",
      "rating": 1.0,
      "verified": true,
      "author": "Carmen Figueroa",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "High quality skillet but heavy",
      "text": "High quality skillet but not so easy to move around. Its very heavy. Will most likely last forever!",
      "rating": 5.0,
      "verified": true,
      "author": "Rae ",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "I absolutely live this grill. Down side is rigid ...",
      "text": "I absolutely live this grill. Down side is rigid surface is really hard to clean. I also use coconut oil to keep it from rusting",
      "rating": 5.0,
      "verified": true,
      "author": "ejay",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Great product.",
      "text": "Hubby loves fried eggs.... works great. Probably going to get another for the Toy Hauler.",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen Findley",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Don't buy it",
      "text": "First use and late to clean look like that. Don't buy it you can die if you eat something oxide",
      "rating": 1.0,
      "verified": true,
      "author": "Airam",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Not pleased",
      "text": "I didn’t receive instruction in how to clean this product. I washed it after my first use and it started to show spots.",
      "rating": 1.0,
      "verified": true,
      "author": "miriam smith",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "What's the Grill?!",
      "text": "I love griddles and indoor grills. I love cast iron too! So these join the best of both worlds. The griddle is a great size for a classic 4 eye stove and is amazing with a gas burner. I find it cooks the foods well and if cleaned properly (and seasoned as cast iron products should be) it is the best thing ever!",
      "rating": 4.0,
      "verified": true,
      "author": "Jharrayne McKnight",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Great My loves it and that's just about all she",
      "text": "Great My Wife loves it and that's just about all she use",
      "rating": 5.0,
      "verified": true,
      "author": "Harold Forbes",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Good quality",
      "text": "Being able to use both sides is what makes it handy. Space saver, but heavy duty, durable, and really easy to clean. Without being too heavy",
      "rating": 5.0,
      "verified": true,
      "author": "Scott P Biekert",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Needs time but works great",
      "text": "Took a few uses to get to nonstick but now it's perfect! I use the flat side more than the grill side. Great for pancakes, fried eggs, quesadillas, grilled cheese, and more!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Five Stars",
      "text": "This is an awesome grill. Works perfect with our Wolf gas range!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Murphy",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Bad product",
      "text": "Says nonstick but it’s taken me 3 days to clean off. Also is too thick for the heat to penetrate. I had the burners on high and it was barely heating up",
      "rating": 1.0,
      "verified": true,
      "author": "DANIEL T FAIS",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "You won't be disappointed.",
      "text": "High quality grill. Using it on our gas grill for grilling vegetables, burgers and steaks. Season before first use. You won't be disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Landsberg",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "The griddle needs to be cleaned and seasoned the way you would any cast iron pan.",
      "text": "Have been using the griddle for some time now and love it. Fits over two burners on my stove perfectly and once I got the temperature figured out it’s been great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary ",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Good Quality Griddle",
      "text": "Very satisfied with this griddle! It fit perfect on our stovetop when we used it to make hamburgers. The hamburger patties were juicy and the fat draind away all by its self. I would recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "bryan",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "fits nicely on our bbq",
      "text": "fits nicely on our bbq. works great to have the griddle. very heavy. really nice quality. made for really utilizing the bbq for more then just meat.",
      "rating": 5.0,
      "verified": true,
      "author": "SR",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Good sears",
      "text": "I like this griddle a lot. I suis vide my steak then sear it on this griddle.",
      "rating": 5.0,
      "verified": true,
      "author": "PettyFool",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Sticky and hard to clean",
      "text": "Read a ton of reviews that said this was non-stick but even though I seasoned it and used cooking spray, my pancakes were an absolute stuck on mess and very hard to clean. Guess I’ll stick with my countertop cuisinart griddler.",
      "rating": 2.0,
      "verified": true,
      "author": "BlueGummyShark",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Great multipurpose griddle!!",
      "text": "This griddle is fantastic! It can be used not only as a griddle, but also as a grill pan. It provides very even heat, and is quality cast iron. I love the fact that it can be used both indoors and out. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lprib22",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "RUST",
      "text": "After 1 month its created large rust spots, i wasn't able to remove rust so i wound up throwing it away",
      "rating": 2.0,
      "verified": true,
      "author": "Victor P.",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great value for the price.  FREE shipping put it over the top.",
      "text": "Product is substantial...well made. Arrived in two days with FREE shipping!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Cast Iron Griddle",
      "text": "Fits stovetop perfectly. Easy to use and clean. Seller delivered in 1 day as promised",
      "rating": 5.0,
      "verified": true,
      "author": "Michigan",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Rusts very easily",
      "text": "Pan rusted after one use. We followed instructions for care but were upset to see this happen.",
      "rating": 3.0,
      "verified": true,
      "author": "Elisa G.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Worth the price!",
      "text": "I liked the versatility of griddle and the quality workmanship.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn C.",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "It is heavy but very useable",
      "text": "I received it quickly and it was exactly as it was described.",
      "rating": 5.0,
      "verified": true,
      "author": "Norm",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "One Star",
      "text": "Used it once cleaned it and the entire thing started rusting.",
      "rating": 1.0,
      "verified": true,
      "author": "SeanB",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Pancakes, potatos and so much more to cook!",
      "text": "We took this camping. It was really nice because we basically were able to use just this almost the entire time. We could cook anything on it and it fit right on top of our coleman camp stove. Cooked sausage links and rolled them into the edges while we cooked the pancakes. You could put it over the fire too, but this was easier. We will use it at home on our BBQ and on our gas stove. Love that it has 2 different styles in one! Nice addition and doesn't take up too much space! It is quite heavy, but thats what you get with cast iron.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Sarah",
      "helpful_votes": 0,
      "publication_date": 20170728
    }
  ],
  "product_meta": {
    "title": "Vremi 20 inch Large Nonstick Cast Iron Griddle for Kitchen Stove Top - Two Burner Flat Pancake Grill Griddle Pan - Pre-seasoned and Reversible - Portable for Indoor Oven Gas Stovetop or Outdoor BBQ",
    "description": "For award-winning pancakes, gold star quesadillas and more, the Vremi Heavyweight Champ Cast Iron Griddle is the ultimate kitchen warrior. Featuring 20 inches of a pre-seasoned cooking area, it gives you plenty of room to cook more of a meal without using 2-3 pans. Designed with built-in side grip handles for secure transport, and a grease slope for capturing excess fat, it also slowly cooks foods evenly without scorching to deliver healthy, chef-quality, cast iron deliciousness. Use the smooth flat griddle side for everything from eggs to grilled cheese panini. Flip it over to the grill side, and sear your way to a juicy steak, BBQ ribs or veggie kabobs. Our universal and portable 2 sided griddle grill is built for dual burner gas stovetops.\n\nProduct Details & Care \n\n * Made from premium cast iron\n * Reversible with smooth griddle side and ridged grill side\n * Pre-seasoned for convenience out of the box\n * Measures 19.75 x 10 inches\n * Suited for double burner gas stovetops\n * Built-in handles for easier lifting\n * Grease slope on each side for healthier cooking\n * To clean, hand wash with gentle soap and dry thoroughly\n * Never use abrasive cleaners or clean in dishwasher\n * To reseason, heat in oven, brush with cooking oil, cover with tin foil, reheat in oven, and wipe dry when cool\n * For full care instructions and safety warnings, always refer to Vremi product box and manual",
    "rating": 4.2,
    "feature_bullets": [
      "VERSATILE TWO-SIDED GRIDDLE GRILL - This large, flat, reversible grilling pan features a smooth griddle side for pancakes and a ridged grill side creating classic grill marks for steak and sausages. Great for knocking out grilled treats day or night",
      "PRE-SEASONED with EVEN HEATING -This universal grill plate pan is pre-seasoned for flavor so you can enjoy seared meats or grilled vegetables right away. Its cast iron surface slowly cooks to distribute heat evenly for chef quality meals anytime",
      "DESIGNED with GREASE SLOPES to TRAP FAT - Both sides of this large rectangular cast iron grill skillet feature a naturally non-stick surface and grease slopes to drain off fat in food to deliver healthy meals that are both nutritious and delicious",
      "PORTABLE with a BUILT IN HANDLE - This camp griddle pan's versatility for various recipes makes it a winner! It includes sturdy built-in side handles for a secure and convenient transfer from a stovetop to oven to even a small outdoor campfire",
      "FOR DOUBLE BURNER GAS COOKTOPS - This 19.75 x 10\" griddle is large and sturdy enough to cover two burners on an indoor gas range for stovetop BBQ cooking. To clean, hand wash and dry thoroughly to prevent rusting (allow to cool fully before cleaning)"
    ],
    "specifications": {
      "Product Dimensions": "18 x 12 x 1.97 inches",
      "Item Weight": "6.75 pounds",
      "Manufacturer": "Vremi",
      "ASIN": "B06Y5MN41H",
      "Item model number": "VRM020292N",
      "Customer Reviews": "4.2 out of 5 stars599 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#97,193 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 10, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Griddles",
      "Cookware",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}