{
  "website_summaries": [
    {
      "verdict": "A feature-packed 10-in-1 model that can handle everything you need and more.",
      "pros": [
        "Programs allow you to make cakes, cook eggs, or sterilize",
        "Dial makes program selection easy",
        "Pressure valve closes automatically",
        "Comes with handy accessories, such as a steam rack, serving spoon, and measuring cup"
      ],
      "cons": [
        "Some users wished the instructions were more helpful"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great IP but please read my comments",
      "text": "Caution--if you purchase the Ultra Instant Pot, please be aware that you must learn how to use the buttons because all the recipes for Instant Pots are geared toward the standard-not the Ultra-and the buttons on the Ultra are all different from the standard. It took me awhile to figure this out and I am still learning. I love my Ultra IP but the company did not do a good job of explaining the differences in the buttons--I had to search by googling and reading lots of blogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Turicik",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "The pot does not seal. As per feedback from ...",
      "text": "The pot does not seal. As per feedback from Instant Pot company a number of pots have issues with the pressure sensor in the base of the pot that prevents it from sealing on it's own. It requires a manual intervention to seal the pot.",
      "rating": 1.0,
      "verified": true,
      "author": "Garth & Marina",
      "helpful_votes": 151,
      "publication_date": 20180402
    },
    {
      "title": "Very disappointed. Although the packing is fine",
      "text": "Very disappointed. Although the packing is fine, there is a huge concave on the surface. I guess this may be used by someone else.The instruction book prints 2 pages on 1 pages. It is very hard to read it.(As attached) So I decided it to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 142,
      "publication_date": 20180506
    },
    {
      "title": "Horrible customer service",
      "text": "I was so excited to get this. I bought one for my son and one for me. My son's worked fine. Mine turned out to be defective and their customer service was a nightmare. Not sure why they couldn't just replace it, but they refused. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Babsmc",
      "helpful_votes": 89,
      "publication_date": 20180327
    },
    {
      "title": "We have cooked five different recipes. four with pressure ...",
      "text": "We have cooked five different recipes. four with pressure and one non-pressurized. The meats are not done (chewy, don't fall apart). The cook times in the recipe book are not accurate. We either have a faulty machine or the manual are not written correctly. very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle  M. Ehlers",
      "helpful_votes": 87,
      "publication_date": 20180218
    },
    {
      "title": "Pot overheated and burned out",
      "text": "During 3rd use which was cooking rice, half way through cycle there was a loud pop. The interior and exterior of the pot were extremely hot, so hot it took almost an hour before the pot was cool enough to touch. The display turned off. There were no problems with other appliances in the kitchen. I checked to make sure plug was securely inserted in pot and wall receptacle and also made sure the circuit breaker had not tripped. Tried plugging it in other receptacles. The pot is dead.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim in Winterville NC",
      "helpful_votes": 81,
      "publication_date": 20180226
    },
    {
      "title": "Manufacturing Defect - Contacted Support - No Reply for weeks and to date",
      "text": "I think this is a great product. It makes cooking so much more convenient, especially for busy folks. However, I am giving a 1 star review because of the complete lack of support given in respect of this product. At the 3rd use of this product, the C6L screen flashed and beeped repeatedly, after which the instant pot did not work at all. I understand that this is a product defect. When I reached out 3 weeks ago to get help via Amazon, I have not received any response whatsoever. Not even an acknowledgement that my enquiry had been received. Totally disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna ",
      "helpful_votes": 46,
      "publication_date": 20181101
    },
    {
      "title": "Overrated",
      "text": "All the features on this model are completely useless as there are no instructions on how to use them, and I don’t think it’s a great product if I have to rely on bloggers and other random people on the internet to tell me how to use it!! I get the BURN notice every single time I use the pressure cook mode, following the limited instructions laid out in the manual for cook times. A lot of money laid out for zero return - don’t buy this if you aren’t a master of pressure cooking methods or don’t have hours to spend researching how to safely use the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 46,
      "publication_date": 20180407
    },
    {
      "title": "Returned after Instant Pot burned water",
      "text": "The pot displays \"burnt\" error at end of preheat cycle, cannot transition to timed cook, even for just boiling water. That's the diagnostic test from the manual, so assumed it's a faulty unit and returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr404",
      "helpful_votes": 40,
      "publication_date": 20180722
    },
    {
      "title": "I loved this till about the 4th time I used it ...",
      "text": "I loved this till about the 4th time I used it then nothing happened, no lights no nothing, I sent a request for help, whether I should return it or what. I heard nothing back after a little while I just sent another request and noticed that my issue is not described in the troubleshooting section of the owners manuel. I hope with this review I will hear something back to resolve this because I really do what to use this and think it is probably a good product but the service I sought to resolve this issue was non existent.",
      "rating": 2.0,
      "verified": true,
      "author": "Camilla S.",
      "helpful_votes": 35,
      "publication_date": 20180412
    },
    {
      "title": "DON\"T GET RID OF YOUR OLD WORKERS!!!",
      "text": "Wow. What a terrible disappointment!!! I am just printing out the return label to send in my SECOND one of these!! They both worked less than a month and when I plug it back in it just doesn't turn back on!! NOTHING. NOT A HINT OF LIFE!! Thank goodness I never discarded my two 20 year old Black and Decker rice/veg steamers, my trusty and beautiful Crock Pot, or my yogurt maker. Maybe it is the new electronics on this model. Who knows, I don't care anymore. I still have my other cabinet full of well loved, trusted little workers.",
      "rating": 1.0,
      "verified": true,
      "author": "CBLY",
      "helpful_votes": 97,
      "publication_date": 20171226
    },
    {
      "title": "OVERRATED JUNK!!  BURNS at bottom every time.",
      "text": "This worked fine for a couple of months. Now all it does is show BURN and shut off. I can no longer cook rice in it without this happening!! I even Tried coating the bottom with olive oil. It is now completely useless as a pressure cooker. I want my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "Just Jimmy",
      "helpful_votes": 25,
      "publication_date": 20180927
    },
    {
      "title": "Defective",
      "text": "I used it for a month. It died while I was cooked and refused to turn back on.",
      "rating": 1.0,
      "verified": true,
      "author": "Avid Reader in N. NJ",
      "helpful_votes": 29,
      "publication_date": 20180507
    },
    {
      "title": "Pot 10, Instructions 1",
      "text": "Having used a pressure cooker and canner for years as a young bride and mother, I love my new 3 qt. ultra Instant Pot. That is why I rated it a 10. The instructions/manual are poor, poor, poor and I rated them a 1. Heaven help the person who doesn't have the internet or has a hard time using the internet, they will be like me. I took an hour and a half trying to start the cooking of a pot of chili. Chili was great...so was the 3 glasses of wine I drank to calm my frustration level.",
      "rating": 4.0,
      "verified": true,
      "author": "JEM",
      "helpful_votes": 13,
      "publication_date": 20191125
    },
    {
      "title": "Don't buy refurbished!",
      "text": "I ordered a refurbished one from Amazon Warehouse and it came without the recipe book, manual, or safety instructions! Very disappointing... I'm new to pressure cooking so I planned on thoroughly reading all the instruction material to make sure I use it correctly. Now I don't know if I'll end up using it at all, and I was planning on using it for dinner tonight! I'll probably have to return it and hope a new one comes with all the manuals. So disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "zoegirl117",
      "helpful_votes": 25,
      "publication_date": 20180309
    },
    {
      "title": "excellent",
      "text": "I already have the IP Duo but took the plunge with this new Duo Evo! It is amazing. The improvements are stellar. The flat bottom of the inner pot helps in sauteing. Also having handles to ease with getting the liner out is great! I love the new steam release switch. Plus the fact you don't have to remember to place the switch to seal/vent. It automatically goes right to seal! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Joojie",
      "helpful_votes": 13,
      "publication_date": 20191026
    },
    {
      "title": "WHERE  HAVE I BEEN",
      "text": "I am NOT a cook, but after reading the instructions and downloading the app for the thousands of free recipes, I am HOOKED. Made chicken alfredo and mac n cheese in less than 2 hours that'll last us leftovers for a couple of days. It's intimidating at first to someone that uses the microwave 99% of the time, but this thing makes me actually want to cook and try new recipes! Best purchase for a new apt owner and who doesn't have time to cook for hours on end.",
      "rating": 5.0,
      "verified": true,
      "author": "Mellomarimba",
      "helpful_votes": 9,
      "publication_date": 20201011
    },
    {
      "title": "Great except for slow cook and lack of instructions!",
      "text": "All those settings and almost no info about what and how, slow cook not good, online I noticed that low means warm and turned it to medium or we would have had raw meat, t was very tough anyway. Rice setting sounds good but the instructi N booklet and recipe booklet don't explain anything about using it. If you buy a Pressure cooking cookboook, it's great. Really should come with basics about each setting at the very least!",
      "rating": 3.0,
      "verified": true,
      "author": "Scribe42",
      "helpful_votes": 53,
      "publication_date": 20170908
    },
    {
      "title": "Big change from my mom's pressure cooker",
      "text": "While I have only used it on three items I have found it to live up to its reputation! Simple to use once I got over the intimidating thought of pressure. Watched many YouTube recipe preparation and now I have collected close to a hundred recipes to try. Not sorry I purchased only that I waited so long. I am 70 and the technology does not overwhelm me.",
      "rating": 5.0,
      "verified": true,
      "author": "BuckarooDave",
      "helpful_votes": 13,
      "publication_date": 20181122
    },
    {
      "title": "Instant Pot Derangement Syndrome",
      "text": "Ok....I admit it. I “suffer” from instant pot derangement syndrome. I suspect there are quite a few of us. It changes the way you cook. The food cooks quickly but more important the food tastes better. I believe my fellow deranged instant potters (instant potters?) enjoy exploring all the new ways to good their favs. So if you suffer .....simply pressure your “high pressure” button then let it release naturally.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 12,
      "publication_date": 20180810
    },
    {
      "title": "Advertised \"new Quick Cool technology\" is not available",
      "text": "With respect to the claimed \"Quickcool technology\" that is an advertised feature: As soon as I received the Duo Evo Plus I sought the separate Quickcool tray that is required to use the feature. Not being able to find it for sale, I emailed Instant Pot support to inquire. Two weeks later I got this reply: \"We understand you are seeking the Quickcool tray for you Duo Evo Plus. Unfortunately, this part is not available individually at this time.\"",
      "rating": 3.0,
      "verified": true,
      "author": "Octalpus",
      "helpful_votes": 8,
      "publication_date": 20191129
    },
    {
      "title": "Received a defective unit. Returned it to Amazon. ...",
      "text": "Received a defective unit. Returned it to Amazon. Controls did not work properly. Timer would count down very slowly. It took 5 minutes for the timer to go from 5 minutes remaining to 4 minutes remaining.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom. Lydon",
      "helpful_votes": 26,
      "publication_date": 20180130
    },
    {
      "title": "Defective quick release",
      "text": "Quick release seems to be defective! I have to push down hard to release the steam if I push it down to the lock position no steam will comes out. This was happening from the begining, testing with water only. There are lots of menus but I count 7 of them that do the same thing according to the manual so what is the purpose of this? I am considering sending it back for a Duo.",
      "rating": 2.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 13,
      "publication_date": 20180219
    },
    {
      "title": "Life-changing",
      "text": "We have been sceptical to add another counter space killer we never use as much as so many other small appliances we bought like fryer, bread baker, Yogurt maker....Boy was I wrong. This pot is awesome, a time saver. Good quality and fun to usa. So happy we bought this one...Will add a smaller on on Prime day for rice...😎",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver Kuffel ",
      "helpful_votes": 6,
      "publication_date": 20201011
    },
    {
      "title": "Wowsers!",
      "text": "I was hesitant to purchase, thinking it was all \"fluff.\" Well, I am very glad I did. It hasn't paid for itself yet, but it will shortly. The recipe book was handy, the first thing I made was brown rice. Wowsers! Absolutely perfect, next time I substituted the water for broth, heavenly. Next I made a half chicken (I was nervous) 8min (recipe said 10-15), then I took it out and BBQ'ed it in the oven. I think I'm going to try hard boiled eggs next, I think it's called steamed though. This was a fabulous investment. There's also an APP for more cooking ideas.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela D.",
      "helpful_votes": 12,
      "publication_date": 20180609
    },
    {
      "title": "WHERE HAVE YOU BEEN ALL MY LIFE?",
      "text": "LITERALLY this thing is my long lost love. If you are thinking of buying it - just do it and google skinnytaste recipes. You will NEVER look back. Being in a cold climate and as a mother who tries to feed healthy food to her family- this thing rocks! The saute option, delay and easy close valve have made this a staple on my counter. Have already got rid of my crockpot and semi-clinging on to my zojirushi. The best part is- one pot clean up. No extra skillet to brown the meat, garlic, onions, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "MR EH",
      "helpful_votes": 12,
      "publication_date": 20171207
    },
    {
      "title": "LOVE",
      "text": "It took me a while to figure this thing out. The book and some recipe books were NOT helpful. The product itself is WONDERFUL! I hardly use my stove top or oven anymore. I cook everything in this. I found the best way to use it is to google video and watch recipes. I've made the best steamed artichokes ever, lasagna, split pea soups, meat loaf and mash potatoes (together), slow cooker recipes, soft boiled eggs in only a minute, frozen chicken and fish...I couldn't imagine my kitchen without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather S.",
      "helpful_votes": 5,
      "publication_date": 20200802
    },
    {
      "title": "Two lemons in a row?!",
      "text": "Is it possible to get two lemons in a row of this product? I purchased the Ultra in November 2018. It died in December 2018. After a bit of back and forth with Instapot, they sent me a replacement base with the controls. I used it a couple of times. Last night it STOPPED WORKING AGAIN in the middle of making risotto. I have requested that Instapot send me another model and reimburse me any difference in cost. Frankly, they should send me one free for this aggravation. If you purchase this model, I highly recommend that you buy an extended warranty (I did, but can’t even get through the one year base warranty with Instapot).",
      "rating": 1.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 9,
      "publication_date": 20190121
    },
    {
      "title": "Life changing at 73.",
      "text": "I love to cook but when the surface of my induction stove died and I was faced with a couple weeks wait, I decided to try the Instant. With the Sear feature we could make eggs and I made some great casseroles and vegetable dishes. My husband liked the easy one-pot cleanup. But what really sold me was the Sous Vide button. I had no idea what that was and with quarantine time to kill, I studied up. We live in a senior community with one undependable grill at quite a distance. Suddenly I could make steaks and chops to perfection. It's truly life changing.",
      "rating": 5.0,
      "verified": true,
      "author": "Karolyne Lucero",
      "helpful_votes": 5,
      "publication_date": 20200923
    },
    {
      "title": "Good features bad product (update)",
      "text": "Well after using the pot for exactly 30 days, it stopped working. I was so careful with cleaning and care of the pot. Did not matter. I called instant pot customer service and after 3 days, no response. I am so lucky that I purchased thru Amazon. Got a refund and free shipping. The pot did a good job, but 30 days is not good. Maybe I will try a different brand. UPDATE: After the first pot failed, I decided to try again. That was Feb 15. On May 1 the replacement pot failed for the same reason, heat sensor failure. I am sure I can get a replacement, but the quality of the Duo Evo is not good.",
      "rating": 1.0,
      "verified": true,
      "author": "A. E. McDowell",
      "helpful_votes": 5,
      "publication_date": 20200212
    },
    {
      "title": "Real time saver!",
      "text": "The Instant Pot is awesome but be warned it takes time to heat up and for the pressure to release after cooking. Even if you are only pressure cooking for 2 minutes, it can still take at least 30 minutes or more to cook. You can sometimes speedup the preheat time by putting the cooker on saute before changing to the pressure cook setting. This cooker is very versatile and has lots of great settings. I have used it to cook food as if it were a stock pot on the stove and I have also used it to heat and serve chili that was frozen solid in under 40 minutes.",
      "rating": 4.0,
      "verified": true,
      "author": "CPeters",
      "helpful_votes": 9,
      "publication_date": 20181118
    },
    {
      "title": "Not happy.",
      "text": "8/28/17 Disappointed Don't know if I am being too picky, but there are many minor cracks on it; however, the packing is fine. This may be used by someone else, I guess. So for my safety, I will return it and get a new one. Hope it worth all these works. 9/4/17 Just got my order and open it right away. Huge Disappointment. If the first one only has some minor cracks, the second one has a HUGE CONCAVE on the surface.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 234,
      "publication_date": 20170904
    },
    {
      "title": "Did not contain or instantly create any pot, very disappointed",
      "text": "I was expecting to avoid travelling to Colorado, California or my nearest weed house when I purchased this. Unfortunately, this device did not contain or create any pot. Do not buy if that is what you're looking for. However, I eventually did find some pot, and then I got hungry. Little did I know when I bought it, this thing will cook food- fast! I dropped a big slab of meat in it and a few minutes later I was greeted by a steamy and tender slab of meat that almost tasted as good as really slow cooking it.",
      "rating": 5.0,
      "verified": true,
      "author": "The Worlds Foremost Expert Authority On Everything",
      "helpful_votes": 5,
      "publication_date": 20190917
    },
    {
      "title": "Where has this been all my life!?",
      "text": "I am so glad I bought this thing! I didn't know it did sous vide until AFTER I bought it. I cooked flank steak, chicken thighs, and orzo pasta the first couple days! This weekend I'm gonna make a CAKE IN IT! Just remember that it's a pressure cooker at its core. So you won't get crispy skin on poultry or fish. But it cooks so fast! I cooked the thighs for 6 minutes. Seriously 6 minutes not a typo. Granted you have to include the time for it to get up to pressure, and the pressure release time. Still that was maybe 20 minutes total. And they were excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "CT Swearingen",
      "helpful_votes": 7,
      "publication_date": 20180627
    },
    {
      "title": "In love with it",
      "text": "I’ve only had this for a short time. I’ve made rice and it made a perfect brown rice. I have to make rice ever couple days for my rescue yorkies. I can’t wait to make my chili and veg soup. Been wanting one for a very long time. Ty for dropping the price where I could at last afford to buy one. Im disabled and not really able to cook much this opens the door for me to be able to eat more balanced meals etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Zinks",
      "helpful_votes": 7,
      "publication_date": 20181207
    },
    {
      "title": "I think mine was a dud",
      "text": "I had my Ultra for two weeks and sent it back. I could not get it to cook without getting the burn notice. I since purchased the IP Max and LOVE it! I've heard others say this is a great pot, but not my experience. It may have been a bad unit, but I did the water test and it checked out. So, who knows. All I can say, is, according to my experience, buy the Max, not the Ultra.",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia E. Downes",
      "helpful_votes": 7,
      "publication_date": 20190117
    },
    {
      "title": "Great when it works",
      "text": "After about 10 uses, it’s a roll of the dice if this thing will successfully pressurize. I’ve checked the rubber seal, the steam valve, replaced the rubber seal with the extra one it comes with, still will not pressurize 9 out of 10 times. Meanwhile, my chili is burning and i get “food burn” error message.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20201009
    },
    {
      "title": "Bought May 3rd, 2020 - Broke August 29, 2020!!",
      "text": "Just got this barely 3-4 months ago and it’s completely broken won’t start, keeps beeping and giving the following error on the display “C 6L” - according to google search this means an issue with the low pressure sensor, so it refuses to turn on, I cleaned it completely and error still does not go away.... will contact manufacturer to see if it’s covered under warranty to fix this!! BUYER BEWARE!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200829
    },
    {
      "title": "Bad design with the knob on the front.",
      "text": "I have had this since June. I would return it if I could. The knob on the front is eventually going to get whacked and broken because it sticks out too far. I gave my IP-DUO60 to my daughter and bought this because it's smaller. That was a mistake. I'll try to sell it online and buy another like my old one. Otherwise I LOVE Instant Pots!",
      "rating": 4.0,
      "verified": true,
      "author": "K. Beshears",
      "helpful_votes": 8,
      "publication_date": 20180924
    },
    {
      "title": "The dreaded C8 Code for the Instant Pot",
      "text": "We bought the latest Instant Pot Duo Evo Plus and while we were Sautéing on our first try with the unit we encountered the C8 error, which stops the Sauté process (not good). The Error indicates that the User is using the incorrect Inner Pot, which was not the case, since it was the only inner pot that was shipped with the unit. Not sure how the electronics passed Quality Control, but you're taking a big gamble on this product if you proceed with a purchase. Sending back Now!",
      "rating": 1.0,
      "verified": true,
      "author": "Jbgoldfinger",
      "helpful_votes": 6,
      "publication_date": 20200118
    },
    {
      "title": "HIGHLY RECOMMEND!!",
      "text": "Received my first Duo Evo plus and it was defective, no display, a burning electrical smell...Amazon quickly replaced (in ONE DAY) with a beautiful new pot! This is my second IP (other is an Ultra) and am extremely satisfied with the functions on my new Evo Plus. Easy to learn functions, perfect silicone feel handles on inner pot, angled lid storage slots afford easier innerpot access. A tad quicker getting to pressure than my older Ultra, due to 1200 watt rating. The steam diffuser for quick release is such a wonderful addition too! HIGHLY RECOMMEND!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa ",
      "helpful_votes": 4,
      "publication_date": 20191208
    },
    {
      "title": "Love my 8QT 10-in-1 Instant Pot but...",
      "text": "This Instant Pot pressure cooker/slow cooker is amazing! I am glad I got the larger one because we like to have leftovers to either freeze or make lunches for the coming week. Works great! My only concern is our stainless steel pot is acid etching quite a bit and it is not like we have used it with tomato sauce which I know is acidic. Mostly Stews and roasts so far. Photos are attached. Can anyone advise if this is normal or did we get a pot made of low grade material?",
      "rating": 5.0,
      "verified": true,
      "author": "Roland Schama",
      "helpful_votes": 6,
      "publication_date": 20181119
    },
    {
      "title": "Save your money",
      "text": "This is the worst appliance I have ever purchased. Great concept to save time but in reality it takes just as long to cook something in this as it does in the oven. No matter if you follow the directions or find hints online food still burns, sticks to the bottom. If you like cardboard chicken this is the way to go. Returning this because it is not worth the money spent.",
      "rating": 1.0,
      "verified": true,
      "author": "Bridget Crusan",
      "helpful_votes": 6,
      "publication_date": 20190221
    },
    {
      "title": "This is my 3rd instant pot  I HATE this one",
      "text": "I own 3 instant pots, an older 8 qt, a 6 qt and this one. I am constantly getting a “burn” notice in this pot. Somehow it burns soup ... It is so frustrating, I am not a newbie to pressure cooking in these I’ve done it for about 5 years... This one is not worth the cash... I have contacted instant pot customer set to no avail I would not buy the 8 qt ultra !!!",
      "rating": 2.0,
      "verified": true,
      "author": "raly",
      "helpful_votes": 8,
      "publication_date": 20181219
    },
    {
      "title": "Melted! bad customer service",
      "text": "We had it just a bit over a year, used it 10-15 times. Decided to melt! luckily we bought the Square Trade protection. Good luck trying to get a hold on Instant Pot customer service, tried twice on different days waiting about half an hour each time before giving up.",
      "rating": 2.0,
      "verified": true,
      "author": "Yossi A",
      "helpful_votes": 5,
      "publication_date": 20191125
    },
    {
      "title": "Beware of the smelly ring.",
      "text": "This thing is a little difficult to program. But, my biggest complaint is the silicone sealing ring on the lid. It absorbs the odors of whatever food you cook. And it's impossible to get rid of the odors. I've tried washing the ring in soap and water then soaking it in vinegar. I can get rid of most of the smell, but not entirely. It's a shame because otherwise I do like the features such as using it as a pressure cooker and slow cooker. You will have to decide for yourself on this issue. And if you find a solution to the smelly ring and how to clean it, please let me know.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Dell",
      "helpful_votes": 3,
      "publication_date": 20191114
    },
    {
      "title": "C6H error message",
      "text": "Purchased May 16, worked great until July 8 when I got the C6H error message. Sent service request email waiting to hear back now.",
      "rating": 2.0,
      "verified": true,
      "author": "Honus Shain",
      "helpful_votes": 10,
      "publication_date": 20180709
    },
    {
      "title": "Works great!",
      "text": "Been using my Instant Pot Ultra several times a week and am more than happy with it. I've done vegetables and meats and they've turned out great if I know what i'm doing. Bought a cheap rack of ribs at the store and they came out amazing after just a short stint in the instant pot. I've tried chicken a few times and it's turned out a bit tough, but i'm pretty sure that's my fault for cooking it too long. If you steam/cook vegetables this thing works amazing, and it makes hard boiled eggs with ease. It's nice to be able to cook things without boiling water or wasting electricity with the oven. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Rev",
      "helpful_votes": 5,
      "publication_date": 20180704
    },
    {
      "title": "Wonderful product!!!!",
      "text": "Love! Love! Love it! I’ve used it everyday since I got it. Have used it for everything from chicken bone broth to egg bites and cake bites. Makes a wonderful cheesecake too. The safety features of this Duo Evo Plus are wonderful. I’m 76 years old and tend to forget things so the automatic seal and vent release is wonderful. Also the silicone handles are a great addition to this IP. Got an error message once (operator error) called customer service. It was a very satisfactory experience and they were super nice. I would and have recommended this IP to all my family and friends. I am a very happy old lady!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200603
    },
    {
      "title": "LIFE NOW SIMPLIFIED SINCE INSTANT POT ULTRA PURCHASE!!!",
      "text": "AWESOME! User friendly INSTANT POT ULTRA is my all time favorite kitchen appliance! From morning soft boiled eggs to lunchtime chili to evening yogurt making, this pot DOES IT ALL! Strongly suggest extra gaskets for yogurt and sweets as meat aromas infiltrate the gasket very quickly. Tried baking soda, vinegar....dedicated color coded gaskets for sealing ring is a MUST. Pot in pot insert pans that stack are also very much recommended. I wished this had been available 41 years ago when I was newly married! This would make an fantastic wedding or birthday gift!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa ",
      "helpful_votes": 7,
      "publication_date": 20171113
    },
    {
      "title": "WARNING!  Internal short circuit/ possible fire hazard",
      "text": "WARNING! The Instant Pot Duo Evo Plus 8qt. shorted out internally while using for 1st time. No problem doing the water test as instructed, but when using for 1st time sauteing the unit tripped the kitchen circuit breaker. I unplugged unit reset circuit breaker and attempted to plug instant pot into the outlet and sparks flew and tripped breaker again. The Instant Pot has a short circuit internally. I have never thought a appliance so popular would actually have a severe problem as this. This is a possible fire/ electrocution hazard. Not sure how a design that could fail like this would ever be UL approved.",
      "rating": 1.0,
      "verified": true,
      "author": "wrknman",
      "helpful_votes": 3,
      "publication_date": 20200511
    },
    {
      "title": "Did not keep the actual temp as shown on the display",
      "text": "I bought this unit to simplify my yogurt making process. The stainless steel inner pot was the main motivation. I found that the unit was functioning below it's displayed temp anywhere from 7 deg to 18 deg. The higher the temp the larger the variance. Temp is very crucial for yogurt making process and the results were disastrous. Amazon was great in sending me a replacement unit, but the new unit is consistently off by 3 deg., that is 3 deg below. I am still going to try this out because I am going without a pressure cooker waiting on replacements! I was going to buy the 2 QT Ultra, but I am not sure now.",
      "rating": 3.0,
      "verified": true,
      "author": "Jess A",
      "helpful_votes": 6,
      "publication_date": 20180825
    },
    {
      "title": "Would be very nice IF it functioned as it should",
      "text": "I ordered & returned two defective instant pot ultras. The cook timers did not work in pressure cook mode on either & the pots never registered that they were cooking, nor did they ever shut off. I addressed this with customer service by phone with the first pot and they agreed it was defective but could offer no solutions. I returned it and got the second instant pot. It had the same problem. I tried emailing customer service about the second defective instant pot and they didn’t seem to understand English, only received “canned” responses, which had nothing to do with my clear description of the problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181013
    },
    {
      "title": "I absolutely love this. It's a little tricky to figure out ...",
      "text": "I absolutely love this. It's a little tricky to figure out at first but it's wonderful. As long as you use 1/4-1/2 cup water with whatever you're cooking (on top of what would be required to normally cook it---so extra for rice), it cooks the food well. Experiment a bit with it if you're not buying a cookbook---sometimes a few minutes turns the food from solid to fall apart. Spices and/or sauces are key when cooking in this for flavor. But overall, great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amny",
      "helpful_votes": 10,
      "publication_date": 20180127
    },
    {
      "title": "Still Learning (3qt Ultra)",
      "text": "Still learning the ins & outs of this little puppy. Looks to be the perfect size for this crusty old bachelor type. As for reliability, only time will tell & I'll update that rating as required. So far a Cornish hen & pork tenderloin turned out well. The blue LCD screen & interface of the Ultra version makes programming your meal much easier IMHO. I think I'll go ahead & invest in the ceramic non-stick liner, glass lid & 3 compartment steamer basket (I already have the single steamer basket). Every potential for a 5 star rating here, stay tuned.",
      "rating": 4.0,
      "verified": true,
      "author": "thatman55",
      "helpful_votes": 4,
      "publication_date": 20190114
    },
    {
      "title": "So glad I splurged and got the Ultra",
      "text": "So glad I splurged and got the Ultra. I like that it seals automatically and shows you the progress as it's warming up to cook. I'm having fun finding great recipes on Pinterest. I made turkey sausage and navy bean soup the other night and it was delicious. The best part is, I put dry beans in and they were cooked in less than 30 minutes! Normally I stand over a hot stove for hours when cooking beans. So cool! Rice takes 12 minutes. So functional. Wish I would have bought one sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Norma Jean",
      "helpful_votes": 6,
      "publication_date": 20180309
    },
    {
      "title": "“What’s the best advice anyone’s ever given you",
      "text": "From now on, when someone asks you, “What’s the best advice anyone’s ever given you?” your answer is going to be, “Some insomniac stranger writing reviews at 4AM on Amazon told me to make beans from scratch in the Instant Pot, and my life got exponentially better”",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob A. Stevens",
      "helpful_votes": 8,
      "publication_date": 20180518
    },
    {
      "title": "This really let me down. Duo Evo Plus issues.",
      "text": "I am a lover of the Instant Pot. Have converted many friends over. I just had to have the Duo Evo Plus when it was announced. On the second cook I got a C8 error. Supposedly a pot error. I only have the pot that comes with it so I let it cool and start over. Same problem. Support still hasn’t responded so I’ll just send it back. Disappointed but still within return time so that’s all I can do.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 4,
      "publication_date": 20200106
    },
    {
      "title": "Nothing Cooks as advertised",
      "text": "I wanted to use this for a lot of fresh cooked vegetables. I've yet to cook something in the time frame that is given in the book. I am always waiting on the food to be done, sometimes cooking it for double the time to get it done. E.G. fresh cauliflower was supposed to cook in 2-3 minutes. Using the pressure feature, it took 18 minutes to cook this properly. Maybe I'm doing something wrong but I feel like I was following the instructions. I need to write my own cookbook for this as the cook times are all wrong! Overall, it is hard to estimate how long it will take to warm up and to cook the food.",
      "rating": 1.0,
      "verified": true,
      "author": "R B.",
      "helpful_votes": 6,
      "publication_date": 20181031
    },
    {
      "title": "Does not have ALL functions like bigger Ultra",
      "text": "Missing - Medium setting, Multigrain,...something else but can't remember as it was not important to me. I bought this partly to make yogurt. Have to use CUSTOM heat as there is no medium. Instruction book does not include information about ways to get around this. I'm experimenting and will have to experiment to make brown rice as it does not have the multigrain which I've used with other models for brown rice and wild rice mixes.",
      "rating": 4.0,
      "verified": true,
      "author": "Marmie",
      "helpful_votes": 5,
      "publication_date": 20181212
    },
    {
      "title": "Lots of new quality of life features",
      "text": "Moved up from a DUO, lots of improvements most noticeable is the seal being recessed in the rail more and having a lip around it. This seems to prevent the seal from coming loose on insertion and removal and since the seal is more fit on the rail the seal does not get as dirty as with the DUO. Pressure release system is much more convenient and does not spread the smell as much as the DUO due to the cover on the steam release valve along with the float valve not spraying before it lifts completely. Inner pot is also much more accessible now with the grip handles.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Reyes",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "Fast delivery, however, it has a dent on ...",
      "text": "Fast delivery, however, it has a dent on it. :( I did read the reviews and learned that some customers received dent ones. I was hoping it won't happen to me, but I was dissapointed. I ordered for a replacement... I'll update this review until then.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 11,
      "publication_date": 20180402
    },
    {
      "title": "Great product if you have patience to figure it out.",
      "text": "Great product but disappointed with the lack of overview in cooking with various settings featured. Lots of trial and error which is not good as it wastes time and money (with good) until you figure it out. App truly does not have instructions to provide an understanding of how settings should be used.",
      "rating": 5.0,
      "verified": true,
      "author": "VoneGA",
      "helpful_votes": 3,
      "publication_date": 20200818
    },
    {
      "title": "Received defective item and don't get full refund",
      "text": "The Instant Pot I received seemed to have a defective heat sensor. It switched itself off randomly and especially with the function saute, it heated up way too hot (oil evaporated and food just burned instantly) before switching itself off. Am very unhappy!",
      "rating": 1.0,
      "verified": true,
      "author": "Jerome",
      "helpful_votes": 9,
      "publication_date": 20181005
    },
    {
      "title": "Great product, What's up with the price change?",
      "text": "So this unit works as advertised producing great results with chili, soup, short ribs and beef stew. Nicely made with quality accessories, but what's with the price hike? I bought mine about a month ago for $82.00. It is now $149.00. That's almost double what it was a few weeks ago. The 8 Quart Ultra (which I now want to buy) was $119.00 at that time and now is $179.00. How can this be? Sounds like some price gouging going on here?",
      "rating": 5.0,
      "verified": true,
      "author": "Ed in NH",
      "helpful_votes": 4,
      "publication_date": 20181228
    },
    {
      "title": "honest review",
      "text": "Doesn't lock easily, difficult to use would suggest trying a different brand. Not paid for this review or have any reason to write this, but after reading about how life changing this machine is was very disappointed for sure.",
      "rating": 1.0,
      "verified": true,
      "author": "edmocon",
      "helpful_votes": 4,
      "publication_date": 20191126
    },
    {
      "title": "How to use?....",
      "text": "I have this very expensive contraption and they shipped a different model book that doesn't have the same dials, buttons so the instructions don't match the unit. Have been struggling using it and something promoted to take 10 minutes has both times taken me a total of 3+ hours to try to get it made and then having meat be rubbery! Not thrilled or impressed so far with this expensive machine!",
      "rating": 1.0,
      "verified": true,
      "author": "Jo L",
      "helpful_votes": 7,
      "publication_date": 20190203
    },
    {
      "title": "Great upgrade from the Duo 60!",
      "text": "Just received this today, and did the water test and cooked up some potatoes. I had 2 Duo 60s, until one died a month ago, 5 yrs into it's use, and had been worked hard. I love the higher wattage, so it heats up faster and actually cooks faster too, I like the fact that the lid closes the pressure valve, and it's not manual anymore. I have not used any of the presets yet, but always cooked on manual anyway. This is definitely a nice upgrade!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Eiss",
      "helpful_votes": 2,
      "publication_date": 20200723
    },
    {
      "title": "Check condensation cup that attaches in the back..",
      "text": "I really like this! I made an amazing pot roast and I have never been great at cooking meat. The ONLY negative and this is why I only left it 4 stars was the condensation cup falls off because a piece on the machine is broken. I waited about 2 months before I used my machine so I wish I had known sooner so I could send it back.. seems kinds of lame when I got the upgraded/more expensive model. Meeeeeh. Still .. I recommend this wonder machine to everyone.",
      "rating": 4.0,
      "verified": true,
      "author": "yotes",
      "helpful_votes": 8,
      "publication_date": 20171122
    },
    {
      "title": "C6L Error Straight from the Box",
      "text": "I was super excited to use this new gadget and when I finally got around to plugging it in, it gave me a \"C6L\" error right out of the box. No big deal, sent it back and Amazon sent me a replacement ... SAME EXACT ERROR. I even double checked the serial number to make sure I didn't accidentally just try the same one again. Super frustrated and hoping third time's the charm.",
      "rating": 1.0,
      "verified": true,
      "author": "littleben",
      "helpful_votes": 5,
      "publication_date": 20190325
    },
    {
      "title": "Just introduced to the I. P. world this ...",
      "text": "Just introduced to the I.P. world this past week. I am a single father of two young children and I have struggled to put healthy food on the table when we get home from work/school. After making chili in 10 minutes, I couldn’t be more excited and confident from here on out to provide those meals I never imagined I could cook. For busy families, this is a MUST!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mgilles44",
      "helpful_votes": 10,
      "publication_date": 20180113
    },
    {
      "title": "just buy it you wont regret it.",
      "text": "been sitting on the fence I finally bought one and love all the things I have cooked , from chicken to cheese cake and cooking the potatoes with the eggs for potato salad was very slick. Baked potatoes were so moist. I would recommend if you have been unsure, just go for it many recipes on the internet and an App. to go with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180531
    },
    {
      "title": "Pays for itself, must have if you work long hours",
      "text": "I grabbed this with the hope that I might start to cook with a little more frequency and it worked like a charm. It's so easy to use and the internet has endless recipes for beginners and experts. I've primarily used it for stews, chicken, and yogurt though if you are in a particular rush (or want to cook while you're out and about) it will work for pasta and similar.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Knapp",
      "helpful_votes": 2,
      "publication_date": 20201004
    },
    {
      "title": "Can't remember life before this",
      "text": "I absolutely love this thing. I make chili in it almost weekly. The only thing that's annoying is basically any tomato dish will burn. I don't know why it does this. Usually I just unplug and let it sit for a bit and then restart to not lose the pressure built up inside and it eventually works. I tried to use the chili setting on it, but it made it too watery. It really needs to be on the manual high pressure setting to get a good consistency or else you'll have to reduce it, which boils off all the flavors. But, when it works, it makes the best chili I've ever had in my life.",
      "rating": 3.0,
      "verified": true,
      "author": "Al V.",
      "helpful_votes": 3,
      "publication_date": 20190111
    },
    {
      "title": "Oh wow. Wish I bought this years ago.",
      "text": "I use it everyday for all different kinds of food. I love the 3-quart size. It's plenty for big for two, yet doesn't hog storage space. I've used three of the features so far. You may think the cooker time is not shortened because the cooker needs to heat, then pressurize, and then depressurize... but the beauty is that you load the ingredients, push a button, and walk away. Cleanup is easy and quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth S",
      "helpful_votes": 2,
      "publication_date": 20200721
    },
    {
      "title": "Love this model",
      "text": "Didn't think I would like this Ultra modal as much as my older DUO's. There's only 2 of us so I like to make big pots of stew. soups and beans and freeze for those days that I am to busy (lazy) or just not in the mood to cook. My 1st recipe I tried in my 8 QT Ultra was 3 lbs of pintos with Honey Baked Ham bone. It was delicious. My 6 qt would only do 2 lbs of beans. Love the upgraded features on the Ultra now that I have learned how to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "M. W.",
      "helpful_votes": 4,
      "publication_date": 20181028
    },
    {
      "title": "Less than 2 months old and the won't power up ~ Product Support Non-Existent!",
      "text": "We purchased this until back in April as an early Mother's Day present. Initially, it worked great even if cleaning the pot requires more effort than it should. About two weeks ago, it just wouldn't turn on! Tested the outlet and power cord as expected and those were fine. Just no power to the unit. I have submitted not 1 but 2 Support Tickets over the last week and still haven't received any feedback! If this is a fuse issue, its internal and not easily replaced! Strongly recommend against purchasing unless you don't care about Customer Service and are fine with doing your own repairs! Very disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20200603
    },
    {
      "title": "Amazing",
      "text": "I love this Instant Pot. I use it as often as I can. I barely use my oven any more. Great for cooking almost anything, but almost worth it if just to cook hard boiled eggs... they almost jump out of their shells. If you don't have one of these... what are you waiting for!! I did have to replace the sealing ring as the original would not stay in place, but they are very inexpensive if you look hard enough and I was getting more anyway to use a different one for different dishes. Small pittance for what good I get out of this.",
      "rating": 5.0,
      "verified": true,
      "author": "ffudddtoo",
      "helpful_votes": 4,
      "publication_date": 20180517
    },
    {
      "title": "Waste of money. Not reliable/ easily defective",
      "text": "This was a complete waste of my money. I used this 3 times within the time span of 2 months then it stopped working. It monitor would shut off and it wouldn’t turn on. I contacted amazon and they happily sent me a replacement. When the replacement arrived it too did not work. The monitor came on and the buttons worked but the pot does not come to temp past “preheating”. This was definitely a waste of my time and money. This would be an Excellent product if it wasn’t so unreliable and defective. 2 separate pots both broken can’t be a coincidence, there’s something wrong with the manufacture.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190104
    },
    {
      "title": "Died",
      "text": "Return window closed 5 days ago. Today, put food in, plugged it in and it was working. Pressed start, walked away. It was dead when I came back 5 minutes later. No power, nothing. Outlets are all working fine. It's just the pot.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazingReviewer",
      "helpful_votes": 5,
      "publication_date": 20190206
    },
    {
      "title": "Highly recommended. Be aware of sauté error though.",
      "text": "This was my first instant pot and I love it! Highly recommend it! I’ve only had 2 issues. First was more of an issue of what I was making, it was chili and I kept getting a burn warning before it would build pressure. Needed to add more liquid than the recipe calls for. Second issue was the machine. When using the Sauté function I constantly got the C8 error code. Resolved by using a lower heat setting but it is a known widespread issue that you likely will run into with this model.",
      "rating": 4.0,
      "verified": true,
      "author": "-Owen",
      "helpful_votes": 3,
      "publication_date": 20200215
    },
    {
      "title": "The InstantPot Ultra is my new love.",
      "text": "This is my new love! I add a few degrees when doing sous vide in Ultra mode, as it comes out closer to what you expect that way. Even so, I keep this sitting out at all times and use it nearly every day for something, sometimes more than once a day. If new to instanpot, I recommend joining the many InstantPot Facebook groups for tried and true recipes, hints, and tips.",
      "rating": 5.0,
      "verified": true,
      "author": "K-USA",
      "helpful_votes": 5,
      "publication_date": 20180606
    },
    {
      "title": "Nice cooker, lousy programmed controls",
      "text": "I probably should have bought a less fancy model. The pressure cooker works fine and I like the sauté feature, but all those food program buttons are not what the copy or manual lead you to believe. I've tried a couple and they were less than useless. I recommend you save a few bucks and buy one without all the so-called programmability.",
      "rating": 3.0,
      "verified": true,
      "author": "Bosque Bill",
      "helpful_votes": 7,
      "publication_date": 20180709
    },
    {
      "title": "C6L error out of the box",
      "text": "Ordered the 6qt ultra before Christmas when it went on sale for $87 and was pretty excited to use it with all the great things we've heard. Opened it today out of the box, plugged it in and immediately got the C6L error indicating a pressure sensor problem with the only solution to reach out to customer support to get a replacement. Talk about disappointment...not a great sign when your newly purchased product doesn't work at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181223
    },
    {
      "title": "We love it!",
      "text": "I got min duo Evo plus today. I love it! It so easy to use! Me and my daughter made some pinto beans with pork and garlic as our first dish! My daughter is 11 and it's simple enough for her to understand. (She loves cooking!) I've been using it everyday. Reheating food, making new dishes. And have had zero problems. I do have a tip. Vinegar is your friend. It will help remove the stains in the stainless steel as well as remove the good smell from the sealing ring. So far the Evo gets a 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Deejay",
      "helpful_votes": 2,
      "publication_date": 20200508
    },
    {
      "title": "Exceeded expectations",
      "text": "I've only had this for a week, but each recipe has come out perfectly. Generally I can screw up any recipe, but the IP takes control and the meal comes out great. Note: the recipes in the instant pot app are often incorrect. The app gives you a link to review the web version of the recipe. Always double check the ingredients and quantities from the app to the web version.",
      "rating": 5.0,
      "verified": true,
      "author": "steves",
      "helpful_votes": 2,
      "publication_date": 20200325
    },
    {
      "title": "13 months - and DEAD",
      "text": "it just died. I was in the middle of making some soup. and i spent 50min on hold with support - no one ever answered. The yogurt function never worked, it worked for the long warm but not for the quick boil. its dead. no support. too many meaningless buttons. I want one with high, low, hold and delay --- i can figure out the rest. i'm sad and dissapointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessi C.A.",
      "helpful_votes": 3,
      "publication_date": 20200127
    },
    {
      "title": "It's really good, not sure about the cult-like following, but it's actually good",
      "text": "So my pressure cooker, crockpot, and rice cooker all died about at the same time. I wanted one thing to replace it and I good a pretty good discount on the Instapot, so why not? It does rice well, it slow cooks better than old crockpots, and acts as an additional burner when I'm doing meal prep. The best part, because I live in a warmer part of the world now, is that I can put it on my back patio and not heat up my house when making food. Serious win there. I wouldn't ever pay full price for it, but if you can get it 60% off, go for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Cranston Snord",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Perfect for Small Kitchens and RVs",
      "text": "I'm an avid cook and inveterate gadget freak, so I had to try one of these Instant Pots. Must say it's a real space and time saver. I've cooked everything from hard-boiled eggs to beef stews and tomato sauces, and they all came out well. My dishwasher is glad for the reduced number of items to clean up after dinner. This model lets me do sous vide as well, a favorite technique of mine for steaks. I live in an RV full-time, and this appliance is perfect for the cramped kitchens and small stoves we have to endure. Versatile and effective. Get one.",
      "rating": 5.0,
      "verified": true,
      "author": "William F. Mcgrath",
      "helpful_votes": 4,
      "publication_date": 20171229
    },
    {
      "title": "Amazeballs!",
      "text": "This instant pot Ultra is the bomb. It is easy to set and cook with. The saute feature is fantastic because I can cook everything in one pot and then set it to pressure cook right after. Also, meals taste much better in this thing then actually cooking on the stove. Our family is all about flavor and the flavor this released after cooking was phenomenal. I would recommend this instant pot to anyone. My favorite part about the ultra is that it comes in 8 quarts, which is fantastic for a family of 6. Even with that many people, guests can come over and enjoy what you have made. Fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Chacon",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Good features but C8 error from the first time I used it. Disappointing.",
      "text": "I purchased this as a gift for a friend but, unfortunately, it has been a problem for him since he opened the box. The unit consistently won't seal well and shows a C8 error. Because i purchased well ahead of giving it to him, I can no longer return the unit to Amazon so have to try to get a response from the manufacturer. After looking up the error on the internet, I've found that this is a consistent problem with this unit yet the manufacturer has not recalled or corrected the problem in this model. I have another Instant Pot model that works great, but I would not recommend the Duo Evo Plus to anyone.",
      "rating": 2.0,
      "verified": true,
      "author": "FatherOf6",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "This thing is great",
      "text": "I've been waiting to get one of these and finally pulled the trigger when Amazon had a sale on the 8qt. I've never used a pressure cooker so I was a little intimidated, but it's pretty easy to use. I bought a steamer basket to go with it and will probably be getting a few other accessories, and maybe a 3qt for cooking smaller dishes. I'd heard reports of the sealing ring retaining food odors and figured it would take a little while, but within a week mine smelled like beef stew. So if you're planning on doing both sweet and savory dishes, consider an extra ring so you can swap them around as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah C.",
      "helpful_votes": 2,
      "publication_date": 20181106
    },
    {
      "title": "Great time saver, especially on those evenings when your're rushed!",
      "text": "Feature packed product that can really save the day when running late. Being able to cook a 5 pound roast to perfection in just around an hour, fantastic! Steel cut oats can be set the night before so they are hot and ready when you get up in the morning. Look forward to trying a suggestion I recently read on an Instant Pot blog - \"Once you finish cooking dinner in the Instant Pot have another meal ready to go in. By the time you're finished with dinner you have another meal ready for the week and only have to clean the Instant Pot once.\"",
      "rating": 5.0,
      "verified": true,
      "author": "ADS",
      "helpful_votes": 6,
      "publication_date": 20171124
    },
    {
      "title": "Has changed the way we cook!",
      "text": "This has changed the way that our household cooks meals. We have switched to cooking one large meal a week in the instant pot that we eat throughout the week. We are amazed at the amount of things that can be cooked in this thing. We have made curry, stew, ramen, and even cinnamon buns that all turned out amazing. This model includes a great pressure release system as well. The button makes it so easy to release pressure with no worries. I love all the options that come with this model. So excited to continue to cook with the instant pot!",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten Smythe",
      "helpful_votes": 4,
      "publication_date": 20181017
    },
    {
      "title": "Not what you think - SCAM!",
      "text": "A total hype product with great marketing. Read the directions! Set up stinks and It takes forever to release steam that could seriously burn you once you are actually done cooking. I thought this is supposed to be faster than conventional cooking! It is not if you include the preheat time and the steam release time. If you read the directions it's a longer cook time when factoring in set up and steam release. This takes longer to cook when you add that time than it does traditional cooking methods. Total scam of a product.",
      "rating": 1.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "I love my Instant Pot Ultra.",
      "text": "I really wanted an 8 quart Instant Pot Ultra Smart, but I found none in this size. So, I had to settle for the Ultra. The fact is that I love this one. In the beginning I was intimidated because the controls are different from my IP Duo Mini and the 6 quart IP Lux. Just followed the water heating test to get acquainted and the rest is history. Immediately after that I made delicious yogurt. Then arroz con pollo. There is a Facebook group dedicated specifically for the Ultra, and the YouTube videos are a God send.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia, MOE USA",
      "helpful_votes": 2,
      "publication_date": 20190321
    },
    {
      "title": "Is it really instant?",
      "text": "I bought this as a gift for someone who, turns out already had exact same item. She hates it. Basically all these recipes really call for multiple steps. There are few throw in the food and walk away situations. In researching recipes (cuz she didn’t want it so I was considering keep it for myself) I discovered she was correct. I don’t have time to expect an appliance to be one thing and discover I have to check on it, stir, rotate, add, flip things during cooking. Sure it reduces cooking TIME but from my research it does not reduce EFFORT. So I returned item.",
      "rating": 1.0,
      "verified": true,
      "author": "ChiefLaughALot",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Instadisappointment",
      "text": "I have read only great things about the Instapot and could hardly wait to receive it. The ability to steam veggies quickly excited me. However, I received the box in not sufficient packaging and it looked like it had been used before. The front screen was scratched. I returned it and received a gift card balance instead of a credit card balance which was not satisfactory to me. Very disappointed with this purchase. I will probably have to buy one at a big box store.",
      "rating": 1.0,
      "verified": true,
      "author": "Slater",
      "helpful_votes": 2,
      "publication_date": 20200213
    },
    {
      "title": "Did not last long",
      "text": "I love my instant pot. Great appliance and easy to use but only lasted 8 months of light use... I got another one of course, but still i think they are far too cheaply made... Im on #3 averaging one a year... Keep in mind light usage of 3 or 4 times a week... So sad... I'd give it 5 stars if it was just made to last longer...",
      "rating": 2.0,
      "verified": true,
      "author": "DMAN",
      "helpful_votes": 2,
      "publication_date": 20200219
    },
    {
      "title": "It’s a learning curve",
      "text": "It’s going to take me a bit to learn how to use it especially the steam valve which is totally different from the last pressure I had. It cooked a chicken soup in this and it did a great job. However, when I real send the steam it sprayed chicken fat all over the screens and windows behind the kitchen table; the InstaPot was sitting on the table. I didn’t go passed the fill line but maybe there is a maximum limit for liquid. I’ll admit I haven’t read thru the manual yet...I was too excited to use it and was hankering for soup!",
      "rating": 4.0,
      "verified": true,
      "author": "Georgie",
      "helpful_votes": 0,
      "publication_date": 20200102
    }
  ],
  "product_meta": {
    "title": "Instant Pot Ultra 10-in-1 Electric Pressure Cooker, Sterilizer, Slow Cooker, Rice Cooker, Steamer, Sauté, Yogurt Maker, Cake Maker, Egg Cooker, and Warmer, 6 Quart, 16 One-Touch Programs",
    "description": "Size:6 Quart| Style:Ultra| Pattern Name:Pressure CookerInstant Pot Ultra 10 In 1 Multi-Use Programmable Cooker is the next generation in kitchen appliances. Designed for the home chef looking for a greater degree of customization and control for even greater precision cooking. The Ultra combines the functions of a Pressure Cooker, Slow Cooker, Rice/Porridge Cooker, Cake Maker, Yogurt Maker, Saute/Searing, Steamer, Warmer, Sterilizer, and, a truly new and unique feature, the Ultra program. The 'Ultra' provides complete custom programming for pressure and non-pressure cooking. Now, one can set the exact parameters desired to achieve perfect results each and every time. With the 'Altitude' adjustment, the guesswork is eliminated from a recipe conversion providing a more precise cooking time. Designed with a large, blue LCD display with a 'Cooking Indicator' to provide one a clear visual on the progress of your dish from preheating, cooking, and Keep Warm. A central dial with a simple turn and press provides added precision in program selection and adjustments. And, the new - 'Steam Release Reset Button' ensures the safer handling of the steam release after cooking is completed. Built with 16 smart programs: Soup/Broth, Meat/Stew, Bean/Chili, Cake, Egg, Slow Cook, Saute/Searing, Rice, Multigrain, Porridge, Steam, Sterilize, Yogurt, Warm, Pressure Cook, and Ultra. Now, your favorite dishes are as simple as selecting your preferences and having them ready up to 70% faster. With the 'Sterilize' program one can pasteurize dairy products, sterilize baby bottles, jars, and utensils; as well as, perform certain types of canning much more conveniently than ever before! The 'Cake Maker' is designed to prepare soft and moist cakes and the 'Egg' prepares perfect eggs in just a few minutes. America's most trusted brand has moved into a category of its own with the Instant Pot Ultra! Delay Start time - Up to 24 hours. \n\nHow It Works:\nThe microprocessor carefully runs lab-tested algorithms to control the time, cooking pressure and temperature to ensure consistent cooking results. Users can customize these settings to control pressure level, adjust cooking time and a cancel button, allowing one to achieve their preferred cooking results. For instance, the “meat/stew” key is programmed to prepare perfectly tender, thoroughly heated meat dishes; however, users can attain fall-off-the-bone results by adjusting the cooking time. \n\nThe fully sealed environment traps the flavors, nutrients, and aromas of the food instead of releasing them throughout the home. During pressure-cooking, heat is distributed evenly, deeply and quickly once pressure is built. In addition, minimal water is required for steaming so vitamins and minerals are not leached or dissolved. As a result, greens retain their bright colors and phytonutrients, meats and bones are thoroughly cooked yet tender, and whole grains and beans are soft and delicious, all with remarkable consistency. \n\nDesigned to cater to varying tastes and food conditions, Ultra has adjustable settings to achieve one’s desired cooking results; 3 temperatures in ‘Sauté’ for searing, simmering or thickening for a maximum time of 30 minutes, and 3 temperatures in ‘Slow Cook’ to complete the tasks of a common slow cooker, ‘Keep Warm’, and 3 temperatures in ‘Warm’ to preheat food. \n\nThe 24-hour delay start allows users to postpone the cooking start to have dinner ready when you are. Automatic ‘Keep Warm’ holds the temperature of the meal until you are ready to serve. With the Ultra, one can easily turn the ‘Keep Warm’ function ON/OFF.Power supply: 120V – 60Hz",
    "rating": 4.7,
    "feature_bullets": [
      "Instant Pot Ultra electric pressure cooker is the next generation in kitchen appliances. A central dial with a simple turn and press provides added precision in program selection and adjustment",
      "New features: altitude adjustment, cooking indicator, and a steam release reset button. The Ultra button for custom programming. The new features include sterilize, cake and egg programs",
      "Developed with the latest 3rd generation technology with an embedded microprocessor. The microprocessor monitors the pressure and temperature, keeps time, and adjusts heating intensity and duration",
      "Ul certified with 11 safety features to provide peace of mind. New steam release reset button for safer handling. All components in contact with food are food grade 304 (18/8) Stainless Steel",
      "Accessories included: steam rack (with handles), recipe booklet, serving Spoon, Soup Spoon, measuring cup",
      "Power supply: 120V – 60Hz",
      "Replaces 10 common kitchen Appliances pressure cooker, slow cooker, rice/porridge cooker, yogurt maker, cake maker, egg cooker, sauté/searing, steamer, warmer, and sterilizer"
    ],
    "specifications": {
      "Product Dimensions": "13 x 12.5 x 12.5 inches",
      "Item Weight": "11.83 pounds",
      "Manufacturer": "Instant Pot",
      "ASIN": "B06Y1MP2PY",
      "Item model number": "Ultra 60",
      "Customer Reviews": "4.7 out of 5 stars15,023 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#217 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 4, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Slow Cookers",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": 149.95
  }
}