{
  "website_summaries": [
    {
      "verdict": "A lightweight generator that’s easy to hook up to Suaoki’s separately-sold solar panels.",
      "pros": [
        "Unit is compact and lightweight, making it easy to move",
        "Good battery life depending on use – about 7 hours under high load such as a CPAP machine with humidifier",
        "Charges smartphones and laptops almost as quickly as a standard outlet"
      ],
      "cons": [
        "Solar charging output is DC only",
        "AC inverter and USB outlets won’t work",
        "Solar panels must be purchased separately",
        "LED status lights are a little glitchy",
        "Charging takes awhile – 8+ hours"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "THIS IS A LIFE SAVER!!!!!!",
      "text": "THIS IS A LIFE SAVER!!!!!! It was a real hassle getting it to Puerto Rico (lithium battery and such) where it's needed the most. I had to send it to Jacksonville and there my sister sent it to PR via boat. Notwithstanding, it works like a charm. I bought it for my dad who uses a CPAP machine and with the battery it can run all night. Thank you so much for the product, it really has helped a lot during these times of crisis and calamity after Hurricane Maria.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 45,
      "publication_date": 20171107
    },
    {
      "title": "Avoid",
      "text": "Despite the product description, this is not suitable for a CPAP. This lasted about 4 hours before it started beeping when I used a CPAP without a humidifier. It's also not silent. It features a whirring fan that goes in and out. It's junk",
      "rating": 1.0,
      "verified": true,
      "author": "L. M.",
      "helpful_votes": 17,
      "publication_date": 20180702
    },
    {
      "title": "Tried the IMuto with AC inverter before I ordered this ...",
      "text": "Tried the IMuto with AC inverter before I ordered this thing. This thing rules. I do some night fishing off of the pier in Washington state and needed something to power a 100w 10,000lumen LED light, this got the job done. Was able to run the light for a little over two hours as expected. Also excited to be able to take this all over with me and provide power for my friends and I for whatever we get into next. 10/10 would buy again---will update this review if I run in to any serious issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 7,
      "publication_date": 20171102
    },
    {
      "title": "Generator’s Battery doesnt last long",
      "text": "Batterry doesnt last long with just a 20 watt device it only last two hours definitely it wont last on a cpap machine; I tried it three times from a fully charge battery",
      "rating": 1.0,
      "verified": true,
      "author": "Venom",
      "helpful_votes": 8,
      "publication_date": 20180710
    },
    {
      "title": "I tested it out last night and it worked like a charm",
      "text": "**Update** I just got back from a 2 week camping trip, and this battery along with a SUAOKI 60W Solar panel kept my CPAP running the whole time, along with the occasional phone, or power bank charge. I highly recommend both products. I bought this primarily to power my CPAP while camping. I tested it out last night and it worked like a charm, using less than 20% of the charge, (the humidifier, modem, and Bluetooth on the CPAP were all turned off) over 8 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael L. La Sala",
      "helpful_votes": 4,
      "publication_date": 20180427
    },
    {
      "title": "Wast of money.",
      "text": "Product delivered January 10th I charged and tried to use it on the road but it didn’t work. I tried to recharged in my car but Battery didn’t hold power. It doesn’t work. When I returned home I tried to charge from 110v. All 5 led was on but when I unpluged it is empty. I was in hospital for a surgery and I missed the return window. I wasted almost $200. Do not aast your money.",
      "rating": 1.0,
      "verified": true,
      "author": "E. B. Gokas",
      "helpful_votes": 2,
      "publication_date": 20190216
    },
    {
      "title": "I like it very much 😅",
      "text": "I really like my small generator. It's smaller then I thought. First time used it I plugged in my Brookstone air fan / cleaner and I was impressed how long it lasted. It ran probably 12 hours, so that was pretty cool I think! Charging didn't even take a full night, I only left it connected only because I fell asleep. I even liked the way it charges, the fan for the pure sine wave starts up and off like waves crashing on the beach at night. It wave quite relaxing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent",
      "helpful_votes": 3,
      "publication_date": 20170906
    },
    {
      "title": "4 nights+ on cpap",
      "text": "While some reviewers show a night or less, I got 4 nights with juice left over on a campout. plan on a 4 night river trip, hope it does not break down on me. Based on the reviews here, I will be bringing some backup solutions. Maybe poor quality control? or some had cpap with greater electrical requirements? For me, it worked far greater than expected, with my system one without humidifier, the best solution I have seen, and the best price I have seen. I will revise this if it fails me while I am on the river...",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "This is chinese rubbish!",
      "text": "I'm kicking myself - i should have known better buying chinese. This is another piece of trash designed to steal your money. I only was able to \"top off\" the charge 2 times and by the third time the pack was completely dead. No amount of days recharging this moved the needle. I'm planning on building an American module power pack and if anything works inside (good luck on that!) like the inverter, I'll cannibalize the guts and use it on a real deal device. Please don't throw any money at these people, a waste of your time and money. Should be a warning for anything chinese.",
      "rating": 1.0,
      "verified": true,
      "author": "ellene meece",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Well, was really cool",
      "text": "Used it primarily for my Cpap while camping. 6hrs with the humidifier on before needing a recharge. 12hrs without needing a recharge. Bought their solar panel in the Hope's to recharge during the day and get 3 full nights. Well made it to two 8 hour nights and about 1 hour the next night. Next camping season went to make sure it was ready to go. Will not hold a charge for 5 min. Verified charger is supplying voltage. Cool but not worth the $. 12v car battery and a $30 150watt power inverter lasts 3 nights.my .02",
      "rating": 2.0,
      "verified": true,
      "author": "Adam S.",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "It's ok",
      "text": "I purchased this for a two-month camping trip last winter and needed something to charge my computer and phone while I was one the road. I was able to get about two full charges for a Chromebook from it. However, one thing that was surprising is I plugged in a set of LED Christmas lights, and after only about three or four hours, the pack was halfway discharged. I was expecting it'd last much longer.",
      "rating": 3.0,
      "verified": true,
      "author": "Adrian L.",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Great customer service!!!",
      "text": "Was lead to believe this would power a item's such as a TV for a couple of hours, but couldn't power a small projector however I brought this to the attention of customer service and they helped fixed the situation and even offered advice for other products I could use. Their tenacity in contacting me to make sure I wad satisfied was awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher R. Mills",
      "helpful_votes": 2,
      "publication_date": 20180928
    },
    {
      "title": "Great for CPAP backup!",
      "text": "I had problems with this generator, but the vendor worked with me and replaced it. Works great and does exactly what it’s supposed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Burke",
      "helpful_votes": 3,
      "publication_date": 20180822
    },
    {
      "title": "Read the pros and cons to decide if this is a good fit for you",
      "text": "Pros: Lightweight Clear battery/Charging display Fan to prevent battery overheating Works on small solar panels without the need of a separate controller Cons: Won't charge and power at the same time Won't USB charge without engaging the inverter also No indicator light to show if power is being delivered, load missmatched, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Cousins",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Good for camping",
      "text": "Took this camping to a location without power for my Airsense 10 CPAP. On a full charge it lasted a good night. I doubt it would have lasted 2 nights. Recharged a little slow through the cigarette lighter. Started the car a couple times just to make sure it wasn't killing my battery, but it worked.",
      "rating": 4.0,
      "verified": true,
      "author": "David Svoboda",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "very good produc",
      "text": "It works correctly until now and maintains good time range with connected devices for several hours, I have tried it with fan, small tv, led light and others. efficiently load phones, tables and laptop. for now I have no way to compare with other brands but met my expectations, I recommend it as support for emergencies or for outdoor camps.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos T.",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Not really a strong as stated",
      "text": "I bought this as a back up for my sump pump when the power goes out. But today I finally had the chance to test it and it's not strong enough but it should be. But it at least was able to power a fan and charge up phones and my iPad to keep the kids from going nuts. So it's good for that. I doubt it would power a TV or mini fridge as stated.",
      "rating": 3.0,
      "verified": true,
      "author": "Rosemary",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Reset not practical",
      "text": "When this works, it's great. However, it tends to shut down for no reason and requires a reset, which requires being connected to a charging source. This is a problem when wilderness camping. In addition, it will shut down while I'm sleeping with my CPAP - an experience in suffocation. Should have simple reset button. I would definitely not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "RickyDoo",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "GREAT MACHINE",
      "text": "We really needed this for my husband's CPAP machine. Our electricity was going to be shut down for major repairs on the old lines and he needs his machine to sleep. Well it worked like a charm and he was so happy with it! Great little generator and perfect for the job!!",
      "rating": 5.0,
      "verified": true,
      "author": "CharleneR",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Works well with CPAP - HAPPY CAMPER",
      "text": "Got this for camping and was nervous it would not make it through the night, it did in fact 7 hrs of sleep not 1 night but 2 nights. By the end of the 2nd night the juice was gone. Lucky where we were camping we were able to charge things. It did take a full 6-7 hrs to get a full charge. BUT I was good to go another 2 nights. Not big at all, as big as the cPAP! HAPPY CAMPER",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Junk, used it 1 time and have been charging for 22 hours.",
      "text": "Don't know if it's a bad charger or this power pack needs to go to the dump. 22 hrs charging up to 60%, OH the instructions say 5 hrs for a full charge. I'm sure it will cost me at least a 100 bucks to send this pile back. Read the reviews and would say some people got pay BS money",
      "rating": 1.0,
      "verified": true,
      "author": "Dan M.",
      "helpful_votes": 3,
      "publication_date": 20180908
    },
    {
      "title": "Perfect for power backup for live broadcasts",
      "text": "Bought two for use for critical broadcast power backup in remote locations. So far they work very well and power plenty of equipment for many hours. Especially like that the 12V adapters (both for power use and charging) come with the unit. Quality construction. Very pleased to-date.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Pratt",
      "helpful_votes": 2,
      "publication_date": 20170726
    },
    {
      "title": "but did charge it with screen off or through the AC inverter just fine. Super handy",
      "text": "Surprisingly lightweight. Seems to want to put out about 110 V AC, expected a little higher. Ran Dad's CPAP all night without being drained more than half way. Could not charge an iPad fast enough while the screen was on through the USB ports (tried both 1A and 2A ports), but did charge it with screen off or through the AC inverter just fine. Super handy, good budget alternative to GoalZero.",
      "rating": 5.0,
      "verified": true,
      "author": "Roland Glenn McIntosh",
      "helpful_votes": 2,
      "publication_date": 20180417
    },
    {
      "title": "Size is perfect and weight is ok",
      "text": "Just tried it out for a 30 minutes with my CPAP and already impressed. Size is perfect and weight is ok. This will be going on a lot of camping trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180213
    },
    {
      "title": "Faulty product!",
      "text": "Product did not work. Both AC Ports were only decor. Do not buy Suaoki!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180828
    },
    {
      "title": "Works as promised",
      "text": "Bought this for airplane camping at Oshkosh, it charged our phones and camera batteries. I used a solar panel to charge it every day but you will need a 100w panel to fully charge it by solar.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "I see other testimonials saying good things I wont cut down the product but for ...",
      "text": "i am completely unempressed with this product with a house current charge of 120 volts it lasted 2 nights with cpap no heat unit but when trying to use a 12 volt accessorie plug in producing 14 volts according to volt meter in vehicle for 8 hours driving time it only held cpap for 6 hours at most this did this three nights in a row so i was without cpap power for about 2 hours per charge.I see other testimonials saying good things I wont cut down the product but for me it was a waste of time and money I returned it to amazon good luck mtgrizzler.",
      "rating": 1.0,
      "verified": true,
      "author": "Laron Hall",
      "helpful_votes": 6,
      "publication_date": 20180410
    },
    {
      "title": "No more extension cord for our patio fan.",
      "text": "Using this to power a misting fan out on the patio. First time we used it for an hour and only used a quarter of the battery capacity. Seems like a little bit of overkill if you are only charging phones and tablets but works great for our fan on the patio.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Long lasting charge",
      "text": "Use this to charge my phone and pad while I'm at my off grid cabin. Can charge my s8+ for 3 days. I own three of these batteries the first one I bought over a year ago and it's still going strong. The quality of these batteries is just amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl B.",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Exactly what I needed!",
      "text": "I have a remote ranch with no power, except a generator. To keep from using the generator when I don't need the A.C., I bought this to power a small TV, and charge my phone. Works perfectly!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe H.",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Useful for power outages",
      "text": "I got to use during power outage for almost the whole day. I was able to charged all my family’s phones and tablets. Charged the smaller size batteries. Plugged the LEd lights so I didn’t have to use candle.",
      "rating": 5.0,
      "verified": true,
      "author": "Nou",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Good Buy",
      "text": "Great right out of the box! Arrived charged. No problems with solo charging (bought the solar panels too). Took camping for c pap use, worked great several nights",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Did not live up to advertising..",
      "text": "This product did not operate my CPAP a full 8 hours will a full charge.",
      "rating": 3.0,
      "verified": true,
      "author": "Hal",
      "helpful_votes": 2,
      "publication_date": 20180711
    },
    {
      "title": "I like it, but I wish it had a 3.5 amp USB ports",
      "text": "It is a great machine. However, I wish one of the USB ports was 3.5 A. As it is the one port is 1A the other is 2.1A (iPad charger Amperage). Also, why only two USB ports? This thing could easily charge 4 phones/pads....",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Company stood by their product and replaced",
      "text": "Updated review! Owned it one year just for backup during camping for charging laptops or running small fan in emergency and it suddenly quit taking a charge . Company stood by warranty and replaced. !",
      "rating": 5.0,
      "verified": true,
      "author": "W2W",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Handy portable tough cookie",
      "text": "It rocks. Even survived water submersion (was not on or hooked up to anything, only for a few seconds but omg). Super small and portable, decent weight. Is great for camping and road trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Tristan Barkley",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "It small and holds it's charge for longer than overnight.",
      "text": "I have a cpap machine and need to have it run overnight. I was surprised to see how little of the Suaoki power was used to power my cpap when we went camping overnight. Sometimes our power at home goes out when we have a bad storm and now I have back up so I can sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Mammy",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "My two are very reliable 😁",
      "text": "I have 2 of these and they are very good. I use them every day and recharge them regularly with no complaints through fall, winter and now spring.",
      "rating": 5.0,
      "verified": true,
      "author": "j.vincent",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Good emergensy Generator ( Suaoki 220wh )",
      "text": "This is my updated review for the suaoki generator. Turns out I was leaving the solar panel connected overnight and I wasn’t supposed to cause it drains overnight. Just make sure you disconnect the panel at night or when not in used for charging. Suaoki support team contacted me with this information. I took out a star because of the no power pass through while being charge. This is normal in this unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Wilkin",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "So far so good. Using minimal (no humidifier) DC I was able ...",
      "text": "So far so good. Using minimal (no humidifier) DC I was able to run my BiPap for 2 consecutive nights without a recharge. The second night was weak but I could sleep. With this and the Suaoki 60W Solar Charger I am planning to do some backwoods camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy C Leon",
      "helpful_votes": 2,
      "publication_date": 20180328
    },
    {
      "title": "Won't accept charge anymore.",
      "text": "I've owned this for about 6 months or so. All of the sudden, it will not accept a charge. At first I thought it was weak solar power, but I took it to my office and it has been charging this for a week now. It is still at 3 of out 5 dots. I can look at the power load on my controller and see that it is pulling between 6.1 and 6.8W (I disconnected everything else). Not sure where that power is going exactly, but it is not into this battery. Bummer because it was not cheap!",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Hibbard",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Lasts very long. It’s a beast, so it’s a bit bulky.",
      "text": "This is the best and longest portable charger for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie M.",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Freedom from worrying about losing power",
      "text": "This is so small and convenient. my dad loves it. You lost power twice this year and this is why we bought it. I bought one for me too.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Good for camping or whatever",
      "text": "Sweet portable power with lots of charging ports and stuff",
      "rating": 5.0,
      "verified": true,
      "author": "John Hunter",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Great",
      "text": "These was exactly what my husband wanted as liking for - workes great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "great for",
      "text": "Used this to run my cpap when power went out...still had plenty of power next morning..great for emergency",
      "rating": 4.0,
      "verified": true,
      "author": "norman dice",
      "helpful_votes": 3,
      "publication_date": 20180321
    },
    {
      "title": "How much power do you need?",
      "text": "It is a very good unit for the small items to be powered . It does run a small TV for around 4 & 1/2 hours. So plan accordingly.",
      "rating": 4.0,
      "verified": true,
      "author": "Leo Clymer",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Battery with many uses.",
      "text": "This made my sleeping with a CPAP machine easier when we had electrical outages. Camping also possible.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "WORKS.",
      "text": "3rd Time finally got a working one. Company is very great and friendly if yours doesn't work just have them help.",
      "rating": 5.0,
      "verified": true,
      "author": "BigMom",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Just unboxed haven't used yet but....",
      "text": "I clearly payed for what on the description is a 60,000 mah battery capacity generator The item I received is the same model number but only a 20,000. What the hell suaoki?",
      "rating": 1.0,
      "verified": true,
      "author": "Sol Hol",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Disappointing",
      "text": "Really didn’t power any small devices we tried except our cell phones. It was disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Pleasantly surprised with Suaoki",
      "text": "Very happy with this purchase so far. It's small and lightweight compared to other portables I have. I made this purchase for my senior mom who has a problem with the weight of the leading competitor, Yeti. Although the competitor is a proven product I am pleasantly surprised with Suaoki. I have tested it a few times for longevity and it performs admirably. I think I will by one for myself too.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio S.",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "So far so good.",
      "text": "Very small and compact works about 6-7 hours with my CPAP Dreamstation unit with humidifier on. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald P.",
      "helpful_votes": 3,
      "publication_date": 20170802
    },
    {
      "title": "The wall outlet not on the wall 222wh",
      "text": "This is exactly what I was looking for, this little box pack power. From tvs, to fans, can openers I plug it to several electronic devices and it worked great. My main reason for purchase, when you cant run extension cords across a room this will get it done.. using to spin our wedding came on a display stand in the center of a room with no outlets",
      "rating": 5.0,
      "verified": true,
      "author": "Marcell H.",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Compact and lite 😀",
      "text": "Works great gives me plenty of power aslo can keep solar panel plugged in.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Should have bought a gas generator",
      "text": "This could not run a simple light and a cpap all night. For a solar product probably pretty good. For hunting camp in Oregon. Marginal.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin J. Schmidt",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Very satisfied so far",
      "text": "Runs a cooled CCD/CMOS camera plus small telescope mount(iOptron iEQ30Pro) for hours....dependent on cooler settings. Very satisfied so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Stargazerneil",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "For light duty",
      "text": "Helps a lot with my lightings & phone charging , ( no noise ) .",
      "rating": 4.0,
      "verified": true,
      "author": "Gregg",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Excellent for CPAP it use!",
      "text": "I bought this for annual fishing trips to remote locations in Canada to power my Philips Respironics CPAP. I don’t use the humidifier during these trips. I get 5 solid 8 hour nights of use before having to recharge the unit. Couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy57",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "So far so good",
      "text": "Easily ran a CPAP 1 night in the camper, next test is to run 2 nights. I think it will do it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sherri Price",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Came fully charged.",
      "text": "So far works great. The lights indicating the remaining power could be a bit brighter, but overall has been dependable.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi the Amazons",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Powerful, great material used (aluminum) and strong!",
      "text": "Extremely well made, will last a long time! Very durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Robinsage",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Excellent quality,  portablity and easy to use.",
      "text": "I was so impressed with the Suaoki 22Wh Portable Generator Source that I shortly thereafter bought a second one. High quality control for this product is obvious by its solid construction and good quality materials used. S. Patterson",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Patterson",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Great portable power",
      "text": "Works great so far! It's much lighter and more compact than what I expected, def a good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "DaGoat",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "USB's don't work",
      "text": "Been using this for laptops and what not. Just noticed none of the USB's work. So only the us and the international outlets work. Which is rather disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Paper",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Five Stars",
      "text": "I haven't really used it yet, but seems to work well when I've tested it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Four Stars",
      "text": "Great portability with enough power for our needs during weekend camping trips.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Blodgett",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "My best buy",
      "text": "In my country the energy usually goes away and the truth this generator allows me to charge equipment and also connect the raouter to keep the house with internet for many hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Rubmy Mesa",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "My first review",
      "text": "I bought this to run my cpap while camping, tried it out and got almost 7 hours on 1 charge. We have since used it for some other remote power needs. It is compact and light weight. Does the job",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Four Stars",
      "text": "Wish you could charge and use at the same time.",
      "rating": 4.0,
      "verified": true,
      "author": "Daryl Massey",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Daily use over a year!",
      "text": "Worked everyday. malfunctioned a twice and just needed to be reset and replugged in. 2 times in 15 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Belphegor",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Charger issue",
      "text": "I don’t know if the cord suppose to get hot using it for less then 20 mins. I’ve charged it only twice and it gets extremely hot.",
      "rating": 3.0,
      "verified": true,
      "author": "Zema",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Not a huge investment for some peace of mind.",
      "text": "I have no idea how often I will actually need or use it, but after all the hurricanes, it seemed like a good time to stock up on some supplies. Works as advertised right out of the box. It will certainly be used on those days where there is a temporary power outage and road trips. I bought this as well as a 50 w solar panel. Not a huge investment for some peace of mind. Update: I’ve had this for a couple of years and had to use it a total of 3 times. Worked without fail. Charged phones, provided a fan on hot days. Totally worth the small investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin L.",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Not holding Charge.  1 yr. Warranty.  No Response from support@suaoki.",
      "text": "Not holding charge. 1 yr warranty. Emailed support@suaoki 3 days ago and have not received a response back.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret M. McKenna",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Four Stars",
      "text": "Excellent; should come with small battery cable to start auto, which it says is capable.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward M. Kirchgessner",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Awseome",
      "text": "Use it with the 60wt solar panel and it will run my cpap all night!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Rogers",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Provides AC or DC power when not hooked up to shore power.",
      "text": "It works well for powering AC or DC appliances. I'd love it to give more power, but it is what it is.",
      "rating": 5.0,
      "verified": true,
      "author": "G Whee",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "For now there is not much out there for this use so im glad to have it but it is haevy in myv ...",
      "text": "Well i have a cpap so i needed this for my 9 day hiking trip i tried it out it worked well 1 night on full chsrge and 2nd night quit after about 2hrs . Not sure its worth the price for 1 night if use. I did buy the solar pannel to rechsrge it , but this means every day i have to recharge. For now there is not much out there for this use so im glad to have it but it is haevy in myv backpack with this the salolar pannel and my cpap. I guess it beats the altrrnative of not waking up!!",
      "rating": 3.0,
      "verified": true,
      "author": "terri nelson",
      "helpful_votes": 2,
      "publication_date": 20180603
    },
    {
      "title": "We will return this as we are not happy.",
      "text": "We used it on a 3 days roadtrip fully charged. Just charged our phones 2 times and the 2nd day, this is totally empty. We will return this as we are not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Ralph",
      "helpful_votes": 4,
      "publication_date": 20180528
    },
    {
      "title": "One Star",
      "text": "poorly finished, had to return it, the plug was falling off",
      "rating": 1.0,
      "verified": true,
      "author": "Paul K.",
      "helpful_votes": 4,
      "publication_date": 20180419
    },
    {
      "title": "Does not work with 12v solar panels",
      "text": "I have the 222WH portable. Works well but cannot be charged by the 80w 12v solar panel I already had as it requires 15v + solar panels. I did not notice this until after I had bought it as it is not in the specifications but it is embedded somewhere in the advertising.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180422
    },
    {
      "title": "Disappointed with the fact that when charging on Solar Panel",
      "text": "Disappointed with the fact that when charging on Solar Panel, it cuts off the AC inverter function. You can use it in one mode at a time only : either Charging or Inverting.",
      "rating": 3.0,
      "verified": true,
      "author": "Jean H.",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "So so",
      "text": "Great product but does very fast and does not charge well with my. Solar. Setup",
      "rating": 4.0,
      "verified": true,
      "author": "Adventurer",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "suaoki 220wh works as expected",
      "text": "I am a veried purchaser. I purchased two suaoki 220wh generators. One lasted 18 hours and 2nd one lasted 11 hours. Replacement for 11 hour unit was sent in one day. The 18 hour unit and the replacement worked as I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "richard",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Very Compact, Light, and Efficient",
      "text": "Awesome generator...very compact and light for what it does. I tried charging a laptop and an iPad Pro with it, and they seemed to charge as quickly as they would using a regular outlet. Compared to most other portable power solutions I have tried, this seems to be powerful and efficient for an electric generator. The solar charging capability is also a big plus. It is a bit pricey, but you are getting what you pay for. Solid construction too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20170708
    },
    {
      "title": "Not happy with this product at all!",
      "text": "I wasted $200 on this battery back up! I took it camping to recharge my electronics and after the second recharge it was fried! It would not take a charge and was as useful as a paper weight. I can find a way to return is as I bought it a few weeks before my three week trip and now there is no option to retune it. Truly frustrated! I have contacted the company and will see if they will replace the product. Up date pending.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 21,
      "publication_date": 20170709
    },
    {
      "title": "It’s was not what was advertised. It claimed 60 ...",
      "text": "It’s was not what was advertised. It claimed 60,000mah battery. When I received it, it was only 20,000. Do not buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Claude Pultz",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "Four Stars",
      "text": "Dont think its properly describe the product well. 20000 mah kinda a joke.",
      "rating": 4.0,
      "verified": true,
      "author": "shaun",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Misleading information, this is NOT 60000mAh, it is ...",
      "text": "Misleading information, this is NOT 60000mAh, it is actually only 20000mAh. I also proved that when used it, the battery didn't last much. It actually says 20000mAh all over, NOT 60000 check my pictures",
      "rating": 2.0,
      "verified": true,
      "author": "FPH",
      "helpful_votes": 2,
      "publication_date": 20180406
    }
  ],
  "product_meta": {
    "title": "Portable Generator, SUAOKI 222Wh Power Station Power Supply Rechargeable Lithium Battery Pack with 110V/200W AC Inverter Outlet, Dual DC 12V & USB Ports for Camping Travel Emergency Backup Outdoors",
    "rating": 3.8,
    "feature_bullets": [
      "VERSATILE & PORTABLE POWER SOURCE: comes with 2*100V/110V AC outlets (200W Pure Sine Power Inverter), 2*DC outlets (an extra cigarette socket cable), 2*USB ports, 5 LED lights indicator. It can charge USB/5V, DC/12V and AC appliance anywhere",
      "HIGH CAPACITY: 11.1V, 20,000mAh/ /3.7V 60,000mAh high capacity, powerful enough to charge smartphones 20+ times, tablet, power bank, laptops, TVs, mini-refrigerator, camping CPAP, drone, holiday lights or other household electronics",
      "PURE SINE WAVE: better than modified sine wave, cleaner current in your hands; it prevents crashes in computers, reduces noises in fans, TV and other devices and it is compatible with more gears",
      "SAFETY GUARANTEED: we use the Battery Management System (BMS) to improve battery utilization, prevent over-current, over-voltage and over-temperature, prolong battery life; a convenient handle and aluminum alloy shell make it safer and take it along for the ride during your day-to-day needs",
      "RECHARGING OPTIONS: quickly refuel from home wall outlet or sun with any compatible solar panel (Especially the Suaoki's 40W, 60W, 50W, 100W Portable Solar Panel); a high-density lithium-ion battery allows a more compact build than the lead-acid power ones"
    ],
    "specifications": {
      "Manufacturer": "SUAOKI",
      "Brand": "SUAOKI",
      "Item Weight": "5.5 pounds",
      "Product Dimensions": "9.84 x 6.3 x 3.39 inches",
      "Item model number": "5824077677",
      "Batteries": "1 Lithium ion batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "211828001-01",
      "Voltage": "110 Volts",
      "Wattage": "200 watts",
      "ASIN": "B06ZXYVG4G",
      "Customer Reviews": "3.8 out of 5 stars171 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#183,397 in Patio, Lawn & Garden",
      "Date First Available": "April 19, 2016"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Generators",
      "Generators & Portable Power",
      "Automotive Parts & Accessories"
    ],
    "price": ""
  }
}