{
  "website_summaries": [
    {
      "verdict": "Minor concerns aside, this 6-pack of large, organic wool dryer balls that includes a bag is a sound choice for the budget-conscious shopper or anyone who wants to give this fabric softener alternative a try.",
      "pros": [
        "Value-priced pack of 6 all-natural dryer balls",
        "Made from New Zealand wool",
        "Large size",
        "Wool is densely packed",
        "Comes with a storage bag"
      ],
      "cons": [
        "Some users didn't experience noticeable results such as a reduction in static cling",
        "Balls tend to develop \"pills\" after several times in the dryer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Clothes covered in pills",
      "text": "These are awful. My clothes are covered in pills. They were great for about 10-12 drying cycles and now they’re terrible. I’m so upset. I have to wash all of my kids clothes again and hope that the pills come off of their clothes - especially all the black pants they appear to have ruined.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina M. Reinhardt",
      "helpful_votes": 62,
      "publication_date": 20190131
    },
    {
      "title": "Dries he softest... without chemical softeners!",
      "text": "We've used wool balls for the past couple years, purchased at a much greater cost at another specialty website. The other website price was 3 balls for $16.99... when we saw these wool balls, and the quantity was 6 for a much more affordable price, we thought we'd give them a try. We couldn't be happier, we just use 3 per load and our clothes are so soft, we don't find it necessary to use 6 balls on even large loads, just 3. Wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sophie's Mom",
      "helpful_votes": 89,
      "publication_date": 20180810
    },
    {
      "title": "Great to fluff up down!",
      "text": "This dryer balls work amazing to fluff up my husband's down jacket, and I believe they help with drying time. My only complaint would be that they do leave some wool fuzz that looks like dog hair on your clothes. I have noticed this when using on a black Columbia style jacket. Other than having to use a lint remover after drying this jacket, I would definitely recommend these dryer balls.",
      "rating": 5.0,
      "verified": true,
      "author": "Design_ymn",
      "helpful_votes": 70,
      "publication_date": 20190103
    },
    {
      "title": "Great Dryer Aid...",
      "text": "I purchased the Budieggs Wool Dryer Balls Organic XL 6-pac for my wife. She normally uses either the liquid fabric softeners or the sheets, and that can be costly. Once the wool dryer balls arrived, she tried them out with great surprise. She is sold on them...highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Ross",
      "helpful_votes": 63,
      "publication_date": 20190331
    },
    {
      "title": "Reusable, Economical Substitute For Dryer Sheets",
      "text": "I like the size of these wool balls. I've been using for one week now (about 7 loads of laundry). The claims are true: using the dryer balls certainly does decrease dryer time. There is no oder on the clothes from using the wool balls. The wool balls have no scent.",
      "rating": 5.0,
      "verified": true,
      "author": "Betsy",
      "helpful_votes": 62,
      "publication_date": 20180825
    },
    {
      "title": "Best Dryer Balls Ever",
      "text": "These dryer balls are the best. I have used other dryer balls in the past and I recently used the Budieggs Wool Dryer Balls while drying a large comforter and this comforter has never been fluffier. Along with making items fluffier, these dryer balls have reduced drying time. I highly recommend these dryer balls.",
      "rating": 5.0,
      "verified": true,
      "author": "Bean",
      "helpful_votes": 60,
      "publication_date": 20180516
    },
    {
      "title": "I love my dryer balls!",
      "text": "I love using these with my baby's clothes and with my sheets and towels! I think my towels are definitely softer and fluffier, and I love that they are safe for my baby's clothes. Everything does dry faster, which makes doing laundry a little easier. The only thing I can complain about is that sometimes my hair will wrap around the balls and it's a little tricky to get it all off since my hair sticks to everything.",
      "rating": 5.0,
      "verified": true,
      "author": "KaitlynTop Contributor: Baby",
      "helpful_votes": 67,
      "publication_date": 20170606
    },
    {
      "title": "They work great! Sprinkle a few drops of lavender essential oils ...",
      "text": "Bought them to replace dryer sheets & be a more natural and wholesome replacement in my household. They work great! Sprinkle a few drops of lavender essential oils on them to add some scent. They do cut down on drying time, and I already try to use my dryer minimally for only certain items. I read beforehand they’re supposed to cut out on static, I think it’s somewhat worse with them, but that’s not of bother to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Andrwes",
      "helpful_votes": 54,
      "publication_date": 20180315
    },
    {
      "title": "Good dryer ball with awesome packing",
      "text": "Good dryer ball with awesome packing. A few days back I received this order and now I can say that its worth of money. It's 100% natural fabric softener, eco-friendly and safe though. First, try it and then review it and finally like it or thumb it! You can use essential oils with this balls and yeah they are not annoying like plastic balls.",
      "rating": 5.0,
      "verified": true,
      "author": "VINIT RAJGURU",
      "helpful_votes": 52,
      "publication_date": 20180208
    },
    {
      "title": "I LOVE these!",
      "text": "I LOVE these....we began creating a more clean home of chemicals and came across these dryer balls. They are the best. I do use all 6 each time we use the dryer. But they work as described. I just ordered my second only because it's been over a year since I bought my last set. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Trina O",
      "helpful_votes": 23,
      "publication_date": 20190329
    },
    {
      "title": "90% wool 10% skin in 1 ball",
      "text": "I like these for the function, but today I noticed something odd about one of the balls. Their is a chunk of skin in it, I am not sure if these are cruelty free. They even show a cut out of “100%” wool. Well mine had about 10% skin in one of mine.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20190613
    },
    {
      "title": "I love them!",
      "text": "These dryer balls are great, I wish I knew about these years ago! They are great quality and durable, they work very well to help soften and dry the clothes, they are super easy, and I love how economical and earth friendly they are. Also to add a nice fresh scent to our clothing, I just put some drops of all natural lavender oil on each dryer ball and let them air dry for a day and then pop some them in the dryer with my next load that needs drying. It works great to dry, soften, and freshen up the clothes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 52,
      "publication_date": 20170725
    },
    {
      "title": "Leaves wool lint strands on all clothes",
      "text": "Leaves wool lint strands on all my clothes. I do not recommend these",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20190119
    },
    {
      "title": "Very prone to lint",
      "text": "This broke out lots of little white lint onto my clothing. At first I thought there was something wrong with my dryer but I removed these dryer balls & I stopped having problems with lint. I used it for a week then stopped. I feel like I wasted money on this to not even use it because it ruined my clothes. I don’t recommend at all unless you want to keep using a lint roller every time. It shouldn’t give me problems after the first few washes.",
      "rating": 1.0,
      "verified": true,
      "author": "Hunter Micheletti",
      "helpful_votes": 3,
      "publication_date": 20200818
    },
    {
      "title": "MOLD!",
      "text": "I am so mad with this product! I don’t even want to give one star but apparently I have to🙄 First off, they didn’t cut down drying time at all! Isn’t that the whole purpose? These have been used probably about 4 times (if that) and now they have mold growing on them!! I’ll definitely be sending these back ASAP!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200406
    },
    {
      "title": "Don't waste your money!",
      "text": "Don't waste your money. Very dissatisfied especially after reading great reviews. Worked fine the 1st 5 loads then went to garbage. Terrible for static cling and certainly doesn't take away wrinkles. Going back to dryer sheets.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy W",
      "helpful_votes": 3,
      "publication_date": 20200605
    },
    {
      "title": "Fabric softening accomplished",
      "text": "First I’ll say that I’ve used wool dryer balls before and these seem to perform as others do. The fabric is softened and you can add scents to them if desired. They don’t help with static, but I’ve not found a wool ball to help with that. However, unlike some other brands, these are not as dense. I imagine this might mean they won’t last as long, but I don’t foresee them giving out any time soon! I’ll mysteriously lose them before they’ll ever give out, I’m sure. :D",
      "rating": 4.0,
      "verified": true,
      "author": "Erica K",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "Not quite as good as advertised",
      "text": "I'm a bit on the fence regarding this product. It helps, but it certainly isn't the magical cure-all it's advertised to be. Without at least one dryer sheet to assist, there is the noticeable crackling of static when the clothes come out of the dryer. However, the improved softness is very noticeable. There is also a rather noticeable racket as the balls bounce around the inside of the dryer drum. Overall, I think the product is worthwhile, but take some of the claims in the reviews with a grain of salt.",
      "rating": 4.0,
      "verified": true,
      "author": "Donna M. Lewis",
      "helpful_votes": 2,
      "publication_date": 20190808
    },
    {
      "title": "Should have bought these sooner",
      "text": "I have an older dryer that takes forever to dry a normal sized load, plus my clothes usually come out wrinkled. Not being in the market for a new dryer right now, my mom told me about these dryer balls. I didn't go in with super high hopes but I wanted to see if they would even help a little. Guess what? They actually helped a lot. I throw two in with every load and now my clothes don't come out wrinkled and stuck together. The drying time has been cut some, but I can't say for sure how much. Either way, this was a cheap investment to improve how much clothes look and the efficiency of my old dryer!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie H.",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "These Clothes Dryer Balls Work Great...",
      "text": "I have used several different brands of 100% wool dryer balls. They are not all created equal either. These are good and work well especially for the price. I don't use essential oils on my dryer balls because they get stained. My clothing dries quicker and bath towels are fluffier with the dryer balls. Previously I was drying two bath rugs (the kind with rubber backing) in my clothes dryer. I tossed in a couple of dryer balls and the bath rugs ruined the dryer balls. I won't do that again as I had to throw the balls away. As long as I just dry clothing, bath towels or sheets the dryer balls last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tessye",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Great Dryer Balls",
      "text": "I have always made my own dryer balls out of wool yarn scraps. When we recently replaced our dryer, my dryer balls lift with the old dryer. Thinking it would be quicker and cheaper to buy dryer balls from Amazon, I purchased these because they were in a cute bag, a great price, unscented and 100% organic wool and Prime. Definitely pleased! They are a great size, light, well felted, odorless and shorten the dry time by at least 30%. I am still having issues with wrinkled clothes, but I think that’s related to dryer temp.",
      "rating": 5.0,
      "verified": true,
      "author": "Debi Boutell",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "They really work,for sure.",
      "text": "No more having to buy dryer sheets for my cloths when drying. These wool dryer balls do the trick,my cloths is nice and soft,I only put 4 balls in when drying,and leave them in there when the drying is done. Only use 4 of the 6 that I bought. You won't be sorry,and they are better for the dryer also. A repair person told me to stay away from dryer sheets,so I found this was great. There isn't that much scent though, not like with dryer sheets,but I don't care,as long as my cloths is soft and wrinkle free.",
      "rating": 5.0,
      "verified": true,
      "author": "Handee",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Awesome Product!",
      "text": "Been using these for over 6 months, amazing results. We had an older dryer and found if my husband forgot to clean the lint trap the clothes would get little white balls. But I never had that problem when I cleaned the lint trap after every use. New dryer has eliminated that problem, even when he forgets to empty the trap. We leave them in the dryer permanently. Great green option",
      "rating": 5.0,
      "verified": true,
      "author": "Virtuality96",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "After Purchase Still On The Fence",
      "text": "These definitely have no scent BUT they do work as far as shortening dryer time. I’m on the fence because I like the smell that fabric sheets leave on my clothing. I may try using the essential oils to see if I can find a scent that I like. As far as leaving white lint balls on our clothing as some of the past reviews have said, I have not had that experience .",
      "rating": 4.0,
      "verified": true,
      "author": "R. Brooks",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Clothes come out very soft and evenly dried",
      "text": "First time not using fabric sheets. I don’t think I will ever need to buy them after using these. Clothes come out super soft and wrinkle free with NO additional scent. There still is a bit of static electricity but knowing I’m not adding harmful chemicals to my clothes makes it worthwhile",
      "rating": 4.0,
      "verified": true,
      "author": "Lori Reed",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Not eco friendly if you have to use a whole lint roller",
      "text": "I ignored the reviews. Look at all the great ones! RIGHT? NOOOOOOO. I even ran the balls in the dryer on a test run before I did laundry. The amount of fine lint allll over my dark clothes is ridiculous. Not to mention the static cling. I've never had so much static. Sure, I could not dry my clothes completely to avoid this - or just find new dryer balls. I had another set and loved them. This is NOT THOSE. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Giles",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Great product for the money without the need for toxic chemicals.",
      "text": "These sheep wool dryer balls work great. They're not perfect with keeping all static cling away but they do take care of 90% and my bath towels and cotton clothes are feel fine to the touch. Definitely a lot better than using toxic & expensive fabric softeners. I've been using these for quite a while now and waited to give my review as I wanted to give them a good trial. They're still holding up great and do what they're supposed to. Definitely glad I switched and got away from the chemicals.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Saving me money eventually",
      "text": "I bought these balls so I would no longer need dryer sheets. They seem to work about the same as dryer sheets. I’m not seeing a major difference in softness or wrinkles. For me is the long-term savings since I won’t be buying dryer sheets.",
      "rating": 4.0,
      "verified": true,
      "author": "Helen",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "These balls do not help with static cling.",
      "text": "My friend recommended Budiegg's, saying they reduced total drying time and allowed her to avoid fabric softener so I bought them. I primarily use fabric softener to reduce static cling in synthetic fabrics. The balls made some difference, perhaps the clothes were a bit less wrinkled and softer than they would have been. However, the balls did NOT help with static cling AT ALL -- things were all stuck together -- and this is humid May -- not even mid-winter! Most likely I will only use them rarely.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Christian",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "safe and no chemicals",
      "text": "I have only used my new budieggs one week but I feel so much better just knowing that I am using an allergy free, toxic free and chemically free product. I haven't gotten to dry any sheets or towels yet but am looking forward to having them not be a huge wadded ball when I take them out of the dryer. I can't speak to the drying time being less because I honestly didn't notice that with my laundry. Overall I am very pleased with my purchase and I would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great product",
      "text": "I purchased these about a month ago and I really like them. I have to use hypoallergenic detergent and softener, so I was a bit worried about these. They work very well. I got 5 in my bag and I use them every wash day. No more Downy for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Bernica",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "May decrease your drying time.",
      "text": "I do think these are cutting my drying time due to the fluffing. Unlike tennis balls, they are odorless. I don’t think my lint has changed, and I definitely get static electricity now that the air outside is cold and dry. Regardless, I do like this product. Cutting drying time is a priority, and static can easily be managed.",
      "rating": 4.0,
      "verified": true,
      "author": "Prairie94",
      "helpful_votes": 2,
      "publication_date": 20181117
    },
    {
      "title": "No Static Cling!",
      "text": "I am very sensitive to most all softeners out there, so I thought I would try these dryer balls. WOW! I will never use anything else from now on. My clothes were wrinkle-free without static cling. I used three balls and put 10 drops of essential lavender oil on each....the scent on my clothes was great!! Highly recommended!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Do their job well",
      "text": "I like these Wool Dryer Balls, and they seem to do their job well. The balls themselves don't have any peculiar scent, they look sturdy and well made. I haven't noticed any significant difference in terms of softness, but using the balls definitely saves me some drying time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tatyana",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Best purchase I've made in a long time!",
      "text": "I had heard about this product in general and happened upon these while searching Amazon! I was so pleasantly surprised with the outcome! Clothes are wrinkle free and super soft without using any softener of any kind. I have been recommending these to everyone. I can't say much about the drying time, because I always set it for a certain time - but again, I'm really glad I purchased these. My sisters and mother have already purchased their own set!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Waste of money",
      "text": "It was hard to give them even a one star! I used three In a small load and my clothes came out wrinkled and not soft like advertised or even a shorter drying time! What normally wouldn’t have to be ironed, I had to iron. Will probably send them to ARC.",
      "rating": 1.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 3,
      "publication_date": 20190826
    },
    {
      "title": "Just what our dryer needed....",
      "text": "The wool dryer balls came in a material bag and were perfect...just what we needed. Over time dryer balls become less effective....so these fit our need perfectly. I liked the packaging....the bag is reusable. The wool dryer balls are a good size...sometimes I have received very small ones...these are \"just right.\" Look forward to using them.....",
      "rating": 5.0,
      "verified": true,
      "author": "Envirojoe55",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Won't buy again...",
      "text": "I prefer wool balls over dryer sheets for environmental reasons. However, after buying these I was so disappointed. These did nothing for the static on my clothes and I threw these away.",
      "rating": 2.0,
      "verified": true,
      "author": "Bratlie",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Never buying dryer sheets again",
      "text": "Love these so much. My clothes and towels were noticeably softer. I decided to try them out after hearing of the chemicals that can be left on clothes from dryer sheets (even more natural ones) and I am never going back. These are just as good if not better! Plus, you can add essential oils for a scent if you ever wanted to. Going to save me money in the long run as well. Amazing, smart product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Love these!",
      "text": "I have purchased Budieggs wool dryer balls before, and they are well made and have lasted a few years. Just out of the package, there IS a chemically odor, which disappears after the first use. I always put a few drops of essential oils on each ball at start of the dryer cycle. The laundry was not adversely affected. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Traveler",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "They’re ok...",
      "text": "I don’t notice an outrageous amount of softening- or elimination of static- they do keep the clothes bouncing around in the dryer. Maybe I am missing something? I I use them every load and things are soft-ish. But this winter we had a lot of static and these didn’t make any difference. I agree when I put essential oil on them things smell nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Annabelle Koglin",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Great product",
      "text": "Recommended by a family member. I've had dryer sheets ruin my dryers and maintenance tell me if runs the life of a dryer a lot faster so I wanted to try these out and they did work great. It takes a couple loads for the towels to catch up to the absorbent state that it's meant to be in but worked great for other loads the first time. Used essential oils on them too and again, product wonderful. I would recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "A believer! These wool balls are amazing!",
      "text": "So I waited to review the Budieggs Wool Dryer Balls after doing at least a dozen loads of laundry. First they come in a cute storage bag. I found from my experience that these wool balls are do exactly as advertised and they are amazing! Our clothes come out wrinkle-free and most off all soft, and free of pet hair. We have two cats and a dog. I have even added a few drops of essential oils to them to give the clothes a hint of lavender or lemon!",
      "rating": 5.0,
      "verified": true,
      "author": "Milin",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "I think they are rough on things like sheets. Granted",
      "text": "I will say these dryer balls do help with shortening the necessary drying time for my laundry loads. So, stars for that. However, they do not help with static at all. Also, I think they are rough on things like sheets. Granted, my sheets aren't brand new. But after two uses with these, my sheets now have holes in them. So, just be careful with large, thin material items in the dryer, where the balls might get caught up and really rub against certain spots.",
      "rating": 3.0,
      "verified": true,
      "author": "LuMcC",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Human hairs?",
      "text": "They work so we ordered a second set.Unfortunately the second set contained dark hairs ??? As seen in the picture. They look like human hairs and it looks unpleasant. Disappointed because I thought i found a good product for keeps.",
      "rating": 1.0,
      "verified": true,
      "author": "Reni",
      "helpful_votes": 4,
      "publication_date": 20190324
    },
    {
      "title": "I expected more.",
      "text": "My first time using dryer balls and I was expecting more. I used 2 balls in a load of towels and my towels weren't soft nor had a nice scent. I can't say if they cut down drying time since my apartment complex installed new machines, but after 45 minutes drying time my towels could've used 10 or 15 minutes more. I did not have a large load. Would not purchase again.",
      "rating": 3.0,
      "verified": true,
      "author": "Anita J.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "not bad",
      "text": "I am not sure what results I was hoping for. They do seem to help reduce dryer time. I don't notice any change in softness of clothes. The balls are covered in little lint balls now after using them for 3 weeks. I don't think that alters their effectiveness. I did notice a decrease in static cling though which is nice. And I like that they are scent free. I feel like I could probably add some essential oils to them though if I wanted them to smell.",
      "rating": 4.0,
      "verified": true,
      "author": "creasye",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Love these wool balls",
      "text": "I greatly prefer these to dryer sheets and like being able to use them with towels to help fluffiness since you are not supposed to use dryer sheets with towels. They appear to be nearly indestructible and I expect them to last a very long time. Can't beat these, and for the price, they are a no-brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Sayer",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great for fluffing up towels",
      "text": "The bag these come in is nice and I like that they are the larger size. These are fine although I wanted to love them more. They work great for fluffing up my towels, however, not so well with static cling with my shirts. My drying time with and without the dryer balls was still about the same.",
      "rating": 3.0,
      "verified": true,
      "author": "CRaymond",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Durable, large, works!",
      "text": "I find it amusing I am so in love with these but they are great! I feel SO much better throwing those chemical-laced dryer sheets in the garbage. I have no issue drying or with static. They are large and I throw 2 in with a big load. Dog wants to eat them but otherwise I think they'll last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "ACPT1980",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great Alternative to fabric softeners",
      "text": "Budieggs are awesome!!! I bought a set last summer and am still using the first 3 balls. My laundry comes out very soft, wrinkle free. On some fabrics there is a little static, but it goes away quickly. Environmentally, Buddieggs are a must. No more buying bottles of fabric softener, or using dryer sheets that are not biodegradable. I love these so much, that I bought some for my kids and their spouses to use. They like Buddieggs too!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda M. Robyn",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Dryer Sheet Replacement",
      "text": "I have been using this product for the last 6 weeks and am very happy with the way my wash comes out of the dryer. These particular wool dryer balls are not scented, but you could add a few drop of your favorite sent to 1 or 2 of the balls before you toss them in the dryer.",
      "rating": 5.0,
      "verified": true,
      "author": "BJJ",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Not wrinkle-free",
      "text": "I used the balls on my bath towels on two different loads. They came out more wrinkled than if I had used a dryer sheet. I can hear the pounding of the balls in the dryer 2 floors up. The balls did not help the towels dry faster either. I plan to use them with some clothing next. Am interested to see if there is a problem with static cling. At this point the only positive thing I can say is that I like the packaging they came in.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Impressed",
      "text": "Very impressed. I was extremely skeptical. But a load of jeans that I normally dry in 3 cycles only took 2. Everything came out softer. Seems to do better with fuller loads. But when drying just a few small items those do come out softer. Full large load of towels dried faster. Large load of blankets dried faster too.",
      "rating": 5.0,
      "verified": true,
      "author": "M & T Lara",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Mold on bag and product seemed damp",
      "text": "Like product but arrived moldy product was in a cloth bag then in plastic bag and mold was on cloth bag wool balls seemed ok washed and dried seem ok but mold on bag did not wash off which was concerning but will keep as too hard to return things due to corona virus",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Abbott",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Drying clothes without Fabric Softener Sheet",
      "text": "They work very well on large items, but t-shirts still tend to roll up and take awhile drying. However, I did notice that using all 6 balls tended to get the t-shirts spread out as well",
      "rating": 4.0,
      "verified": true,
      "author": "Edward D. Clark",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "It's a good thing!",
      "text": "Scentless but EO can be added. I use all the tim e in the dryer. No static unless I accidentally over dry. Great value, long lasting. Six balls were sent. I use two. I have used YL in the past. Balls shrink in size when they needed to be replaced. Still good for multiple loads, at least 200 loads before replacing.",
      "rating": 5.0,
      "verified": true,
      "author": "wheatfreeVda",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Highly recommended",
      "text": "I don't understand why this works, but clothes dry soft even with Houston's very hard water. And I can infuse them with pure, quality scents (lavender or rose organic oils) and the clothes have a lovely, subtle perfume. They significantly reduce drying time.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Palla",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "which were fabulous and I thought these would be just as good. They're being promoted to cat toys and I'll ...",
      "text": "They've been using in the dryer 6 times and they are already full of big pills and shedding. I replaced my Woolzies, which were fabulous and I thought these would be just as good. They're being promoted to cat toys and I'll have to order more Woolzies. Sorry Budieggs!",
      "rating": 2.0,
      "verified": true,
      "author": "Nadine",
      "helpful_votes": 6,
      "publication_date": 20171121
    },
    {
      "title": "Way better than dryer sheets and more environmentally friendly too",
      "text": "These are absolutely wonderful. They are loud but they do a great job with wrinkles, static and I add a few drops essential oils to them to make my clothes smell wonderful :) I got some for my daughter, mother and sister in law since they are so great :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jo-ann Albano",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Finally sheets don't cigar roll!!",
      "text": "Got these to help with a faster drying time especially for towels and such (which I found has been the case.) But just washed bedding today and am so pleased as the sheets did not ball up and require additional trips to the dryer to unroll them! Also works on blankets. I often like to refresh my clothes before wearing. If i threw just one piece in the dryer to quick steam and dry they sometimes would wad up but no more of that with the dryer balls. I have a large front load dryer so I throw three balls in at a time. I wish I would of bought these sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "annalw",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Not effective",
      "text": "It didnt seem to make as much sound as using tennis balls but did not seem to be working. The used wool balls can only be used once because it got flurry and black after the first use and didnt get rid of the linens on black clothings.",
      "rating": 1.0,
      "verified": true,
      "author": "joy",
      "helpful_votes": 2,
      "publication_date": 20190303
    },
    {
      "title": "Gorgeous!",
      "text": "I am having so much fun doing laundry doing COVID. These dryer balls are a huge upgrade and make me so happy. They do not lint, they are huge, and my clothes and towels are so fluffy. LOVE! And the gray color is unusual, too. Just love!!",
      "rating": 5.0,
      "verified": true,
      "author": "InfoFish",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Great price!",
      "text": "I have ordered wool balls in the past that lasted many years. Because I don't use dryer sheets, these are wonderful for helping dry clothes quicker and do help reduce wrinkles to a degree. I highly recommend them! ....and these are a GREAT price!",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Mccarthy",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Really helps drying",
      "text": "I used this for sheets and towels mainly since the dryer does not seem to separate them well enough and there are dam spots. These little guys help move everything around and get dry and soft. I still use fabric softener and I do not think it helps much with wrinkles. Maybe with clothes it will. I bought these twice already. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ABK",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Worth the cost...",
      "text": "I’m happy I bought these. I leave all 6 in the dryer for every load. The laundry dries faster and has little to no static (which is pretty amazing in Southern CA). I tried the plastic dryer balls before and they didn’t do any good. But these wool balls absolutely work.",
      "rating": 5.0,
      "verified": true,
      "author": "Cleaningoutmyclosets",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "well worth the money!",
      "text": "I love these wool dryer balls! It did cut my drying towels in half. I used 2 balls and they worked well. They also fluffed my towels..Im happy I won't be spending a fortune on fabric softener and dryer sheets plus carrying them from car to house.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne ",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "i'm very impressed",
      "text": "i have wanted to switch from sheets to dryer balls for some time and finally bought these. i used two in a small load of towels and was very impressed with the results. i forgot i wanted to try the lavender EO so i can't wait to use them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Unsure about them",
      "text": "These are very durable but my clothes are way more linty than before. I also notice they soak up essential oils rather than diffuse them.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily Clarke",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Great way to reduce drying time!",
      "text": "I just received these and tried out 4 of them on a large load of sheets and light blankets. I was impressed that I did not need to restart my dryer to finish drying the load. I even put a few drops of essential oils on one of the balls. Everything came out dry and fluffy and fresh smelling! Can't wait to try them out on my clothes!",
      "rating": 5.0,
      "verified": true,
      "author": "VG",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Worth it for toxin free!",
      "text": "We are on a big push in our house to get rid of as many toxin filled things as we can, and dryer sheets were at the top of our list. These little guys have worked great for us so far! We have been using them for about a month now and have had just a few pieces of laundry come out staticky But honestly that happened with dryer sheets too so I’m not too concerned about it. It feels great knowing that I’m not putting harmful chemicals onto our clothing that will later get into our skin! Definitely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Definitely shortens drying time!",
      "text": "I have been using these for 1 week and I can definitely say it shortens drying time on our clothes, linens, and even delicate fabrics. I have been very impressed by the softness of the clothes, but unsure if this will hold up with time. I miss the \"fresh scent\" of my previous fabric softner, but haven't played around with different detergents or essential oils for these yet. Overall I am very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "JLL",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "They really work!",
      "text": "I don't write reviews but this was so surprising that I felt I had to. The balls in my dryer really soften and leave my laundry less wrinkled! I will never use dryer sheets again! These make nice gifts for those who are concerned about the environment.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Very pleased",
      "text": "We recently moved and our old washer and dryer conveyed with the house. Guess who forgot to take the dryer balls with us? Easy to order new ones thru Amazon! These really reduce static without chemicals.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue Fedora",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Wonderful product",
      "text": "I have used this type of drying tool for several years and bought from a retail store. I decided to buy a more quality product and so happy I did. My laundry is happier because of it, thanks for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon J Everett",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "they could do something",
      "text": "It's a little hard to tell the exact benefit...the dryer balls do give me a good chance to add essential oils to the mix though. I never really had wrinkly clothes so it's hard to tell if they are now less wrinkly. They are soft though. So for the price, why not.",
      "rating": 4.0,
      "verified": true,
      "author": "zach holly",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "First try with dryer balls",
      "text": "Didn't like that lint from towels, etc. stick to balls. Don't know how that will affect future use.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica S.",
      "helpful_votes": 3,
      "publication_date": 20181102
    },
    {
      "title": "Great alternative to dryer sheets!",
      "text": "I have enjoyed using these as a safe and environmentally friendly alternative to dryer sheets. I will say, I have used essential oils in them and while it helps with the smell, the scent is never as overwhelming as a dryer sheet (which is probably a good thing since its nothing but chemicals). I have noticed the dryer time shortened as well. I feel better knowing I'm not exposing my family to unknown chemicals that are present in dryer sheets and helping the environment at the same time. I would absolutely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel J Waters",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "No chemical smell!",
      "text": "Although these don't totally rid static cling like the smelly chemical sheets, the trade off not to have that smell is worth it. Also, as others have stated, my drying time has been reduced. Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Q",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Excellent product",
      "text": "So pleased with these wool dryer balls! We were hesitant to use dryer sheets in our new dryer, and these dryer balls are the perfect solution. We no longer have to worry about chemicals and residue from the dryer sheets. We love the fact that they are organic. We will also save money by not having to buy the dryer sheets--the dryer balls are well made and should last us a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "WJC",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "No scent",
      "text": "Doesn't prevent, or eliminate static.. have been using for a few months now. Collects little fuzz balls really badly.. Definitely not soft.",
      "rating": 1.0,
      "verified": true,
      "author": "Deanna G",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Wool Dryer Balls",
      "text": "The wood dryer balls are terrific. You can put them in the dryer with any kind of items and they come out just like you had used fabric softener. Great Saving because you no long have to us fabric softener.",
      "rating": 5.0,
      "verified": true,
      "author": "Elana Thompson",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "WHY DID NO ONE EVER TELL ME ABOUT THESE!",
      "text": "Is there some global conspiracy by Big Laundry to keep these things out of the public awareness? Moms, grandmas, nonas, omis ... not a damn peep. Ever. From any of them. Stop wasting money on fabric softner and playing the old \"Let's try and find which piece of clothing the dryer sheets has snuck into\" game. 6 balls! 1000s of loads of laundry. $9 fricken bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Weemz",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Long lasting, TRUE New Zealand Wool. BUY ‘EM!",
      "text": "Packaged nicely. If youre making the switch from dryer sheets to dryer balls, New Zealand wool is the best! These come in a cute reusable bag also, fun little perk. Price point is great and they will last a long time! This js my second order, my first set I am still using, but needed more due to my dogs finding them and chewing them up. 4+ years on the first set and still going strong! Worth your investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Jolley",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Works wonders!",
      "text": "I was very skeptical about this product at first but after the first load, I'm sold. They made my towels and linen fluffier and no static! I can't speak to its longevity but I'm hoping it will last awhile since that's what's advertised. I'll update later.",
      "rating": 5.0,
      "verified": true,
      "author": "JMadison",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Like them but should have gotten some grey ones for the dark clothes",
      "text": "I used them ( white ones) for the first time this weekend and got a lot of lint on my dark clothes. I have just ordered some dark grey ones for my dark clothes. No wrinkles at all love that. I used lavender oil on them and let them sit for a day before use. Oh and the pet hairs went straight to the filter love that too. So they are great in a nutshell but I would advise getting the different colors for use with dark and white loads. Maybe a combo for mixed?",
      "rating": 5.0,
      "verified": true,
      "author": "devans4432",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Do not work. Make mess",
      "text": "Incredibly disappointed. Didn’t notice a difference in dry time, clothes were incredibly staticky and on top of that they left little lent balls all over my black clothes. Had never happened any of the other 100 times i washed them until these. Wish i could return",
      "rating": 1.0,
      "verified": true,
      "author": "Julianne",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Drying time is wonderful!",
      "text": "They work, drying time is way better! And that's what I wanted, when it comes to wrinkles and softness didn't notice a huge difference but DRIYING TIME IS WONDERFUL! I love this product and I'll recommend this product also",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "ok product, but you really don't know where they are made",
      "text": "They work fine, cutting down drying time but did not do nothing about preventing/stopping static cling and wrinkle. The bag said made in New Zealand, but nothing on the ball nor any indication that balls are made in new zealand. My guess is the bag is the only thing made in New Zealand. They have no scent which is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda S",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Great product!",
      "text": "These are just what I was looking for! I add a few drops of essential oils to the dryer balls, let them dry and then start my load. My clothes come out of the dryer static free and soft!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Goss",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Shortens drying time!",
      "text": "These are great, they noticeably shortened the time it takes to dry the clothes in a full dryer load. They also came out wrinkle free. There is no scent, which I think is a good idea, but you can always add drops of oil to the balls to customize your own fav smells.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Will be buying more",
      "text": "So far, so good. All though they don't get rid of all the static in loads of towels and the like, I will definitely keep using them instead of dryer sheets, and will be buying more.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Great dryer balls",
      "text": "These are great for keeping any chemicals out of your laundry. Throw them in the dryer and forget about getting dryer sheets. Whenever I want a little scent I just add drops of essential oils -sweet orange is my favorite. My clothes come out with a hint of the aroma, nothing overpowering. Order another set to have on hand whenever it's time to replace these which I don't think will be for a very long time. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Cuts down drying time!",
      "text": "These really do cut down on dry time and keep your clothes from wrinkling. I like that they save me money since I don't have to purchase dryer sheets and my dryer isn't running as long.",
      "rating": 5.0,
      "verified": true,
      "author": "Proctor5",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Doesn’t work for static cling",
      "text": "Really wanted to love these. I bought for help with static cling and just pulled out a load that is has tons of static. I used all 6 balls too....bummed bc I was really hopeful to find a solution so my husband will stop using dryer sheets. Back to the drawing board.",
      "rating": 3.0,
      "verified": true,
      "author": "HF3",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "works great",
      "text": "I started using these a year ago and will not go back to dry sheets! They work good I might get a small amount of static cling but not enough to worry about.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Wood",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "They work!",
      "text": "I love that I can put my own essential oils on these dryer balls. I am super sensitive to smells and regular fabric softener and dryer sheets give me migraines so I put a few drops of lemon grass oil on each one and let them air out a couple of days in the garage before use.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "All's good, just doesn't speed up drying, from what I can tell",
      "text": "Fewer wrinkles, less static, and softer clothes... Drying time is about the same, but there is improvement (but not full elimination) of the other stuff.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Holds the oil smell for 1-2 uses but does not make the clothes smell like the oil",
      "text": "these do not decrease my drying time. In fact, I usually have to run it a second time when using these but not with traditional sheets. Holds the oil smell for 1-2 uses but does not make the clothes smell like the oil. Not a fan.",
      "rating": 2.0,
      "verified": true,
      "author": "Keto in Pearls",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "SO, SO, DISAPPOINTED!!!",
      "text": "Wow, just received these dryer balls today. Was anxious to use them for the first time. So disappointed! I just checked my dryer, & the lint tray was full of “fluff”. Can you say fire hazard!!! How can I return them? Again, so disappointed! First time I have EVER had to write a negative review for anything I have purchased from Amazon. 😢",
      "rating": 1.0,
      "verified": true,
      "author": "Bobbie Burns",
      "helpful_votes": 0,
      "publication_date": 20190822
    }
  ],
  "product_meta": {
    "title": "Budieggs Wool Dryer Balls Organic XL 6-Pack, 100% New Zealand Chemical Free Fabric Softener for 1000+ Loads, Baby Safe & Hypoallergenic, Reduce Wrinkles & Shorten Drying Time Naturally",
    "description": "Color:White-xlSay bye to chemicals&Allergy!\nSay bye to wrinkles,twisting,tangling,lint&pet hair naturally!\nSay bye to repeated cost on liquid softener and dryer sheets!\n\nNOW!!! SAY HELLO TO A NEW,GREEN,SAFT,EFFICIENT&ECO-FRIENDLY WAY FOR FAMILY!\n\nNo Chemicals,No Allergy!\nOur Premium New Zealand wool dry balls are perfect natural alternative for dryer sheets,liquid fabric softener and plastic dryer balls.Care your family especially for new babies,the aged and whom with senstive skin!\n\nFabrics More Soft&Fluffy!\nOur organic dryer balls work gentlely by bouncing among folds of fabrics, circulating hot air to cut drying time,soften your fabrics,protect your clothes by reducing wrinkles, twisting, tangling, static cling lint& pet hair!\n\nHousehold Must with Easy Bill!\nNO repeated cost on liquid chemical softener,NO repeated cost on dryer sheets,SHORTEN drying time by 10%-30%,LONG last for 1000+ loads in 2-3 years,Our 100% organic wool dryer balls are household must and perfect considerate gift to your love!\n\nNotice: \n√ Put 3-4 pcs fabric dryer balls for small or medium load,and 6 pcs are good for large.\n√ Hypoallergenic wool dryer balls are all handmade with 100% natural New Zealand wool, therefore you may notice variations in size, shape, color and texture.\n√ Over-drying may increase static cling, try moisture-sensitive mode or take fabrics out sooner than usual to prevent static issue.\n√ You can try drops of essential oil (lemon, lavender etc) with Budieggs balls to enjoy your favorite fragrance when fabircs are out.\n\nPackage Contents: \n-6 * Organic Wool Dryer Balls\n-1 * Gift Cotton Bag\n\nAdd to cart and enjoy the Fluffy Fragrant & Luxurious laundry before they out of stock!",
    "rating": 4.6,
    "feature_bullets": [
      "★ CARE YOUR SKIN-No Chemials,No Allergy!100% Premium New Zealand Wool,NO FILLERS, NO CHEMICALS, NO SYNTHETICS! Our organic dryer balls care your family in a green,safe&eco-friendly way with love!",
      "★ CARE YOUR FABRICS-Fluffy,fragrant and luxurious experience for softening fabrics,reducing wrinkles,twisting,tangling,lint&pet hair!",
      "★ CARE YOUR BILL-No repeated cost on liquid softener&dryer sheets,gentlely lower bouncing noise than plastic balls,cutting drying time in a creative way!",
      "★ CARE YOUR TASTE-Enjoy your favorite smell with essential oil (lavender, lemon ect).",
      "★ CARE YOUR LOVE-A considerate gift with love:baby showers, mother's day, father's day, bridal showers, weddings, christmas, college graduation, housewarming, teacher appreciation,and more!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9 x 6.1 x 3 inches; 4.8 Ounces",
      "Item model number": "BML001",
      "Date First Available": "April 13, 2017",
      "Manufacturer": "Budieggs",
      "ASIN": "B06ZYN7LLK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Laundry",
      "Fabric Softener",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 8.95
  }
}