{
  "website_summaries": [
    {
      "verdict": "The Asics Gel Quantum 360 Shift MX is a neutral road running shoe that’s highly breathable, light, and comfortable. There were those that did not feel like the shoe delivered quality and support, but it’s still a stylish shoe that many appreciated used for different activities.",
      "pros": [
        "A good number of runners said that the shoe felt comfortable",
        "Plenty of testers complimented its lightness",
        "Many appreciated the upper’s design as well as the colorways it came in",
        "A lot of runners commended the breathability the shoe delivered",
        "Numerous female users mentioned that the fit was adequate",
        "Some people used the Asics Gel Quantum 360 Shift MX for their long work hours, and they stated that it remained efficient and agreeable throughout",
        "The Gel® cushioning units adequately cushioned the impact generated by the foot-strike, several consumers reported"
      ],
      "cons": [
        "Some users were skeptical about the quality",
        "A few of them experienced the heel or sole coming off only after using the shoe a few times",
        "Another said that one eyelet ripped after tightening the laces",
        "A few felt that the Gel Quantum 360 Shift MX did not deliver enough support as a running shoe",
        "Some users thought it was not ideal for running or walking long distances",
        "The majority of reviewers did not like that the shoe was so expensive yet it had poor quality"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Asics quality is really getting worse...",
      "text": "These don't last long at all. After about two months, the gel has deteriorated on the outside and the rubber bottom is peeling on all sides. Asics quality is getting worse and worse and it's really sad. Definitely not worth the money in my opinion. I'm not sure I'll ever buy Asics shoes again after this.",
      "rating": 1.0,
      "verified": true,
      "author": "Smerf",
      "helpful_votes": 6,
      "publication_date": 20180621
    },
    {
      "title": "After a couple of months back of shoe by heal deteriorates",
      "text": "Bought this shoe a couple of months ago for my husband. He walked it in inside the house, then used it for our 1 hour walks 5 days per week. We walk very fast, but do not even run. First, all was great and shoe felt good. Since the last week the back of the shoe seems to deteriorate and has given him blisters. He has not changed the socks he wears nor have he had any change in the way we walk. Very disappointed for a shoe of this price. We have bought Asics before and were happy with their shoes. I wished there was a way to contact the seller directly, but I don't see it.",
      "rating": 2.0,
      "verified": true,
      "author": "P.",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Almost perfect.",
      "text": "Shoes felt amazing when I first put them on, but when I walked around I noticed the back of the shoe kept rubbing against my achilles tendon. If you wear long socks it might not bother you, but I usually wear no shows and it's bound to irritate me. Asics are my go-to running shoes and I was really hoping to love these especially considering how much I love this style, but I'm not going to drop $160 on less-than perfect shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "Jorge V.",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Poor Design, weak, unsupportive.",
      "text": "Bad design. Only one picture so you can’t tell how wide. THIS shoe had wear. It had a fat piece of dark matter in the tread. The box was crushed and ripped. It’s outrageous I was sent me this as “NEW”. There’s no support up front, not good for running. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Red",
      "helpful_votes": 2,
      "publication_date": 20180613
    },
    {
      "title": "Better than the latest Quantum 360",
      "text": "I prefer this release of the the Quantum 360 over the latest because when I tried the latest model I found the upper too stiff that it actually bites on your foot when you walk or kneel. It's too bad that ASICS ditched the nice knit upper for some sort of a synthetic plasticky few, but at the same time it's a great opportunity for the consumer to get the older, and in this case better, releases with their now lower prices.",
      "rating": 5.0,
      "verified": true,
      "author": "Eloquent",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Dynamite looking ASICS Gel-Quantum 360 Shift MX for men!",
      "text": "Little bit of a tight fit compared to the loose fit of the regular Asics gel-quantum 360's I got from champs. Same souls which are perfect for walking or running. Great traction and the souls contour to whatever surface you're walking or running on. These souls give you a more natural feel. These sneakers are designed for comfort and durability! The price could always be better though",
      "rating": 4.0,
      "verified": true,
      "author": "CyberCache",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "So far so good",
      "text": "So far so good. They were noisy for the first couple days but they have loosened up now. They are my primary shoe so I put insoles in them, but the ones they come with are pretty solid so I put them in an old pair of boots I wear from time to time. They look pretty cool, I’ve gotten comments on them",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny W",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "like the feel how it wear",
      "text": "order the black one, the size 7.5 seems as size 8 360 Knit 2, but it is good for me, and this shoes are very conformable to wear, and looking good. and it delivery is faster than i expected.",
      "rating": 5.0,
      "verified": true,
      "author": "webon100",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Very comfortable",
      "text": "I am a basketball official and needed a new shoe for running up and down the court. I love the gel support! So far I have been very happy with this purchase. They are comfortable and fit perfect! I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "ladyhoops",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Good but not as I expected .",
      "text": "Good shoes but toe box is small than standard .",
      "rating": 4.0,
      "verified": true,
      "author": "AMM",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Great shoes!",
      "text": "These are light and comfortable. Fit is spot on. They wear well under continuous use. I'm pretty hard on my shoes, so these impressed me. I will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Great for running out doors",
      "text": "I had a lot of issues with my knees and shins using other running shoes. These are light and comfortable and are very good for running outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel Montgomery",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Great comfort",
      "text": "I walk 4-12 miles per day these shoes are great my feet do not hurt",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Stewart",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Extremely comfortable everyday use sneaker",
      "text": "One of the most comfortable sneakers I’ve ever worn! Definitely recommend them as an all day sneaker to wear or run !",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Great shoes",
      "text": "Love Asics anyway and these shows are great! Very comfortable, breathable and light weight. I haven’t ran in the shoes but walking long distances and periods of time have been very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180327
    }
  ],
  "product_meta": {
    "title": "Asics Mens Gel-Quantum 360 Shift MX Shoes",
    "description": "Fly through your run while feeling comfort and support from every direction with the ASICS® GEL-Quantum 360 Shift MX running shoe! Predecessor: None. Support Type: Neutral to underpronation (supination). Cushioning: Maximum cushioning. Surface: Road. Differential: 10 mm. Breathable mesh and synthetic upper materials. FluidFit® combines multi-directional stretch mesh with stretch reinforcements that adapt to the foot for an enhanced, glove-like fit. Seamless construction in the forefoot helps eliminate the likelihood of irritation. Lace-up closure. Padded tongue and collar. Features 360 degrees of ASICS GEL® technology for total underfoot cushioning. Exoskeletal Heel Clutching System™ promotes a better fit and more secure feel. Breathable fabric lining offers a great in-shoe feel. Removable Ortholite® X-40 premium sockliner features higher rebound properties while providing excellent moisture management and a high-level of breathability. Solyte® midsole delivers featherweight cushioning and long-lasting durability. Rearfoot and forefoot GEL® cushioning breaks up impacting shock during the impact and toe-off phases, while allowing movement in multiple planes through the gait cycle. AHAR® rubber outsole delivers cushioning, long-lasting durability, and reliable traction. Ortholite® lasting features plush underfoot comfort while providing excellent moisture management and a high level of breathability Imported. Measurements: Weight: 14 oz Product measurements were taken using size 11, width D - Medium. Please note that measurements may vary by size. Weight of footwear is based on a single item, not a pair.",
    "rating": 4.5,
    "feature_bullets": [
      "Rearfoot and Forefoot GEL Technology Cushioning System",
      "Heel Clutching System Technology",
      "Outer Material: Synthetic",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "FluidFit Upper",
      "Seamless Construction",
      "Ortholite Lasting; Ortholite X-40 Sockliner; Solyte Midsole Material"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "27.94 x 10.16 x 17.78 cm; 399.73 Grams",
      "Date First Available": "17 Oct. 2014",
      "Manufacturer": "ASICS",
      "ASIN": "B079M2SR94",
      "Item model number": "T839N",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 278.9
  }
}