{
  "website_summaries": [
    {
      "verdict": "This option is highly recommended for its sturdiness, easy tool-less assembly, and feature set.",
      "pros": [
        "Easy assembly, with no tools required",
        "Cutting board has two sides — flat and grooved —which is great for slicing meat",
        "Leveling feet are easy to use and help stabilize the unit"
      ],
      "cons": [
        "Some owners report missing parts and damaged cutting boards"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Much better than other bakers racks out there!",
      "text": "This bakers rack was exactly what I was looking for to expand storage and counter space in my small kitchen. I am 6' 4\" so it was a little too short for me out of the box, but I purchased 2 of the the 2-pack Seville 72\" shelving poles (each pole is 2 x 36\" poles). This made the cutting board counter top height (36\") and put the top shelf right at 72\", which was a perfect height for me. I also added a magnetic knife strip to the left side of the hanging bar to keep my knives close but out of the way. I attached the knife strip using two small screws, lock nuts, and 30 mm washers.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 71,
      "publication_date": 20170102
    },
    {
      "title": "Luuuuuuuuuv It!",
      "text": "This is a restaurant quality bakers rack for the price of pocket change. As you can see the height is pretty good (I'm 5'5\") sturdy steel and it's a breeze to put together.....so stop comparing racks and get this one now!lol (I'm a super picky customer and I love it)",
      "rating": 5.0,
      "verified": true,
      "author": "N. Gilliam",
      "helpful_votes": 27,
      "publication_date": 20160821
    },
    {
      "title": "Absolutely love it. Arrived nicely packaged and the pieces were ...",
      "text": "Absolutely love it. Arrived nicely packaged and the pieces were easy peasy to put together. Even though the descriptions says the block is made of rubber wood, it is of good quality and the thickness is just perfect. Couldn't be happier with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lola Sannella",
      "helpful_votes": 19,
      "publication_date": 20160918
    },
    {
      "title": "Easy to assemble, good size, great for small kitchens.",
      "text": "Super easy to assemble, took us 15 minutes. Feels very sturdy, handles a lot of my extra kitchen crap lol. Love the wood surface, definitely not a cutting board itself, but a good surface to work on. Very versatile so far, will post a pic once it's more organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 14,
      "publication_date": 20161004
    },
    {
      "title": "Better for storage or as a microwave stand due to ...",
      "text": "Extends one's kitchen counters, especially if one lives in an apartment with even less-than-typical counter space. Better for storage or as a microwave stand due to the max height of the board. Very attractive, easy to assemble (takes a little time and a choice word or two if you're alone, but it's still easy), and the board is nice quality. Leveling feet are awesome! Definitely gonna get more hooks, and just might consider sacrificing actual counter space for the microwave because a decently-sized unit (1.6 cu ft) will take up the majority of a shelf, and I'd prefer not to stoop to use it on a lower shelf. Versatile and attractive, big fan!",
      "rating": 5.0,
      "verified": true,
      "author": "Zero",
      "helpful_votes": 4,
      "publication_date": 20170205
    },
    {
      "title": "Impossible to put together and wobbly once you do!",
      "text": "The instructions are garbled (the same piece is sometimes labeled piece A or sometimes piece E, etc) and the slip sleeves all fall off during assembly unless you slide them on in a particular way that is, of course, not mentioned in the instructions. They will ESPECIALLY fall off if you use a mallet like they suggest in the instructions. And customer service for Seville sucked so I had to wait days with this half built thing in my kitchen. Then, when I got their advice, it still fell apart while being built and was super rickety and wobbly. I absolutely would not buy from them again and I’m returning this garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Great addition to my kitchen!",
      "text": "I'm so glad i purchased this bakers rack. I have limited cabinet space in my kitchen and this was exactly what I needed. I now have a place for all my cast iron skillets and somewhere to put all my kitchen gadgets that I don't use on a daily basis. Once you read the instructions a few times it was not that bad to put together. It is very sturdy and looks great. Shipped fast and received it with no damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Royc",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Useful storage and display of kitchen items",
      "text": "Completely great to display and store kitchen utensils and keeps countertop appliances' accessible but stored away. My only critique is that one of the poles in the back had the screw portion bent and damaged which left the top shelf and hanging portion a little precarious. The good part is that I didn't need to put very heavy items on it. Maybe someone could do a better job of quality control.",
      "rating": 4.0,
      "verified": true,
      "author": "rez doll",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great product, easy to assemble",
      "text": "I struggle with assembling items but thankfully this was pretty easy to build. Some of the instructions are wonky but once you figure it out, it's smooth sailing. It holds A LOT and it is fairly sturdy. My only complaint is that I wish the board on top would sit more snugly in place. It does move a bit if you were to use it as a cutting board but overall I am pleased with this baker's rack. I'd recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Solid purchase",
      "text": "Recently moved into a smaller apartment, this was a great purchase. I was really weary about purchasing such a large item online but it’s been great. Haven’t had any issues with it’s durability or stability. Very content with the purchase. I did not assemble, I made my boyfriend do it. But he didn’t seem to have any difficulties with putting it together. There is decent space and effective for a small space.",
      "rating": 5.0,
      "verified": true,
      "author": "Alliemarie",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Organization for the kitchen",
      "text": "Baker rack went right to work once my husband put it together. It is strong enough to hold my kitchen countertop appliances, small cast iron pots and lids, and fruit bowls. Just wanted to give a caution to buyers, once we opened the package my husband found broken black inserts between the shelves. When I contacted the company they stated that these pieces were for shipping/packaging purposes only and not needed for the assembly of the rack. There is no negative that I have encountered yet. I am very happy with the organization that this gives my kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "karebear",
      "helpful_votes": 3,
      "publication_date": 20151204
    },
    {
      "title": "DO NOT BUY",
      "text": "DO NOT ORDER THIS. I received this product 3 weeks after the projected delivery date. I am missing half of the pieces necessary to install and one of the shelves arrived broken. Do yourself a favor and buy from another company / pay a little bit more for something better.",
      "rating": 1.0,
      "verified": true,
      "author": "Orly Cohen",
      "helpful_votes": 3,
      "publication_date": 20180305
    },
    {
      "title": "Perfect Kitchen Work Space is your Short",
      "text": "Awesome, exactly what my kitchen needed. Perfect hight if you’re about 5ft plus or minus a few inches. I thought it wasnt going to be deep enough but i was wrong it is the perfect depth everything is well within reach when your working at it. If you have gotten the amazon basic metal racks this is a little sturdier than those and the clamps for resting the shelves on are different. You get enough plastic clamps to have one left over at the end of building. Just wish there were more hooks for cooking utensils.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Sturdy, stable",
      "text": "This rack is a perfect size, very sturdy and stable, holds a lot of weight, is attractive, and the perfect height for a 5' person. I have the rubber wood cutting board and it's beautiful, convenient, and heavy-duty. Plenty of hanging space for pots and pans and the shelves hold crock pots, air fryer, Insta-pot, large stock pot. I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Diane Smith",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Sad face :(",
      "text": "Came with broken wood on the counter. I returned and never re bought. Very upsetting.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Robson",
      "helpful_votes": 3,
      "publication_date": 20171030
    },
    {
      "title": "Wonderful unit, arrived with real, not rubber, wood for the top shelf.",
      "text": "Just assembled my Seville bakers rack, and it went together like a dream. I compared it to other models before purchase and noticed it was heavier, than others, and it is sturdy. The cutting board top I received is real wood, not synthetic rubber wood. I wonder if they've just recently made a change in this and haven't changed the description. It's a nice board, and I'm happy with that, too. I have my Breville oven, microwave, plus several other things, and it's like having a new kitchen. One reviewer posted a tip for assembly that helped, about how to make sure the clips are right side up.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Magoo",
      "helpful_votes": 2,
      "publication_date": 20150619
    },
    {
      "title": "Good buy",
      "text": "Put it together myself. Wasn’t to hard which is awesome and it’s been a few months now and it’s holding up pretty well. There’s a lot more things on it now but I don’t feel like taking a new picture. This was when I first put it up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamilah Williams",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Easy assembly, perfect bakers table",
      "text": "This is an amazingly sturdy and beautiful bakers table. It takes up so little space but allows for so much storage. It uses its length to its advantage. This multipurpose as either pure storage or a cooking space. The value for money is incredible as well. Assembly was very straightforward and quite easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Violetta",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great piece!",
      "text": "This is great if you are in an apartment, or any smaller living space, and you need more storage area. It was super easy and quick to put together, clear instructions and is actually very nice to look at. The two sided wood piece that goes on top can serve as either a cutting board or just a nice hardwood piece to place a microwave or coffee station! The hooks that are included are nice and sturdy and this doesn't seem like it will tip over without someone actively trying to. I would definitely recommend this Bakers rack for anyone needing a bit more storage and shelving in their kitchens!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Perfect and so worth it!",
      "text": "Received quickly, easily put together, shelves adjustable, sturdy, well built, just what was needed. Had considered purchasing the cheaper bakers rack that was the same size, but SO happy I spent $30. more and got this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Delaney",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great purchase",
      "text": "So glad I made this purchase. It’s just what I’ve been looking for to add a little bit more storage to my kitchen area and get my big appliances like the toaster oven off the counter. It also is good quality and looks nice in person. The real wood board is very nice and it’s pretty heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa B",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Nice looking",
      "text": "Good looking sturdy bakers rack. Do NOT cut on the \"cutting\" board portion of this however you will ruin it",
      "rating": 3.0,
      "verified": true,
      "author": "Teresa S",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Love it!",
      "text": "This is perfect! I got a new apartment two months ago and there wasn't enough counter space. This added more storage and an additional \"counter top\" sort of space. PLUS it's got the little hooks which I can hang my spatulas and stuff on and they're honestly fantastic. Love them so much. It's also really easy to assemble. There were a couple of faulty-shaped snap-on piece but they provided me with enough extra pieces that it ended up not being an issue. Thanks Seville!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "perfect",
      "text": "I am a treat maker and was looking for the perfect shelf to store all of my bags, sprinkles, cake and muffin pans etc. I absolutely love these baker racks. fit perfect in the area that I placed them and all of my containers fit them perfectly as well. it took us 20 minutes to set up. worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "xavier",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Does the job",
      "text": "Great rack - a bit shallow (front to back) for big prep jobs but for prepping or serving just a few plates it works well. If you need some extra work space and storage for items you regularly use and a place to hang your pots and pans this will be good for you. Great for a smaller kitchen where work space and storage are a premium.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Couldn't live without it",
      "text": "I put so much stuff on it. Microwave, all my pots and pans, intact pot, nesspresso coffee station, toaster, crock pot, blenders, waffle maker. and tea station. There is still room. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Classt for the price",
      "text": "I was nervous to buy this product because i have had lots of things come broken from Amazon before (always fixed readily though) and some of the reviews said it was broken and that the wooden piece was wobbly. I have not had any of those issues! Mines pefect. Looks classy for a cheap product. My kitchen is SMALL and my goal was to free uppantry and counter space. And boy did it ever! Its exactly what i was looking for. 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron James Smith",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Damaged upon arrival",
      "text": "One of the shelves was damaged in shipping and i had to bend back into shape to put together didn't want to hassle with return and wait for replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Andre spalding",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Perfect, cute, sturdy bakers rack.",
      "text": "I am so happy I bought this little bakers rack! Excellent quality, far surpasses the price. Shelves themselves are restaurant quality. Wouldn’t hesitate to buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah A. Ramsey",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Awesome!!!",
      "text": "OMG I love this! Been doing some upgrades and have bought a lot of new stuff but this is by far my favorite purchase. Stylish, functional and looks great in my kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "KimK",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great for home baking!",
      "text": "Perfect for my home baking set up! I love that I can fit most of my dry ingredients and equipment on the rack, and still have room to decorate or cool cupcakes. The rack is great quality, and honestly the best $85 I've spent! Originally I was searching for a small kitchen cart, but I'd recommend this 1000000x over!",
      "rating": 5.0,
      "verified": true,
      "author": "lindsey",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Looks nice, very sturdy.",
      "text": "If you like minimalist, industrial, but still looks awesome in your home.. this is it. Great price, easy to assemble, sturdy, and the shelf height is totally adjustable. We put lighter items on the over shelf, a microwave and coffee pot on the wood insert, a wicker basket for potatoes on the bottom, yada yada yada... Our microwave fits perfectly with no overhang in the front or back. We expect to have this bakers track for many years. No regrets and would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S. Miller",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "Nice product with construction tip",
      "text": "Really pleased with this rack. It really needs two people to put together easily. The plastic anchors are easy to fit once you realize the top marked on each had really does go on the tip side before scrunching together and sliding down to click",
      "rating": 5.0,
      "verified": true,
      "author": "Frequent buyer",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Does the job",
      "text": "Was a little confused with how to put the shelves on but very easy once I figured it out. They slide over the black piece.....which do not snap and stay...not supposed to",
      "rating": 5.0,
      "verified": true,
      "author": "Loveshopping",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "very easy to put together",
      "text": "I've assembled a few wire racks for my basement so I knew how to do this but I think it's pretty simple. You can assemble these wire racks by yourself but it's always easier with two. This rack is sturdy and holds an amazing amount of (large) items. Came quickly as well. I really like it and would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Michaels",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Great addition to small or limited counter space kitchen",
      "text": "Great addition to our kitchen! We are renting and have a large kitchen with no counter space . this really changed the game for us. I love it it is such a good addition for additional storage and space. While assembling one of the holes was not a true circle but we just banged on the rod and it got to the desired location. It doesn't wobble it's great I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "It doesn’t take up to much space and is efficient.",
      "text": "This transformed my kitchen from a nightmare to a day dream. Gave me extra counter space. A cutting bored and more efficient storage. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Martin",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Get this one. Durable and cute! So happy w purchase",
      "text": "Love this bakers rack. Very well made and great product at very reasonable price. Get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Hammer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Damaged parts and cheap quality",
      "text": "Very cheap quality. The clips came damaged and the shelf’s do not hold. This feels like a scam. A whole hundred dollars for junk. I was looking for commercial grade and amazon is scamazon today. The only thing good Is the board which serves no use now. I hope they send me a working one or refund me",
      "rating": 1.0,
      "verified": true,
      "author": "Mia X. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great for small kitchens with little storage.",
      "text": "I have very little storage space in my apartment and this rack makes it possible to store larger items that wouldn't fit inside drawers. The only issue i had assembling this product was a little confusion about how the shelves actually go on. I thought the plastic shelf holders were supposed to snap together. But they are actually supposed to \"snap\" into the grooves on the poles.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great product. heavy duty wire shelf",
      "text": "Great product .heavy duty wire shelf ,easy to assemble (took me 20 minutes) Contemporary industrial design and super fast shipping from Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Eco Appliance Atlanta",
      "helpful_votes": 6,
      "publication_date": 20160210
    },
    {
      "title": "Easy to assemble, sturdy.",
      "text": "I am happy with this purchase! The rack itself is sturdy and holds a good amount of storage. It was easy to put together- took about 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Jenna",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Five Stars",
      "text": "Fantastic bakers rack assembly without a hitch, welcome addition to my painting studio. I put wheels on it and use it for oil paints and the surface board as a palette covered with freezer paper.",
      "rating": 5.0,
      "verified": true,
      "author": "SolitaryStar",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Nice rack and helped to add a lot of storage ...",
      "text": "Nice rack and helped to add a lot of storage to my small kitchen. Very easy and quick to assemble. My main issues are that the top rack was bent straight out of the box, and the wooden cutting board has a bit of a wobble when used for cutting, I'm assuming from the metal rack it sits on. Overall it's a good not great product.",
      "rating": 3.0,
      "verified": true,
      "author": "Mikol Fleming",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Love this unit",
      "text": "Love this unit. Easy to put it together, great quality wooden shelf board. Provides lots of extra storage in my kitchen while looking good., The top half-shelf holds glass/plastic bins well. I bought a second unit to put in my office for extra workspace and to store sewing and craft supplies. Works great in both places. Wished I had one of these when I lived in my first small one-bedroom apartment.",
      "rating": 5.0,
      "verified": true,
      "author": "Taïs van Vlaend'ren",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "I really am happy with my purchase",
      "text": "I really am happy with my purchase. With such a small apartment (1br 600sqft) and the smallest kitchen I've ever had - this really helped me organize my space the best way possible. I had hope it would be taller, but at a little over 5', it holds a lot for storage as well as provides me with a cutting board and extra counter space. I love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaycie",
      "helpful_votes": 2,
      "publication_date": 20151207
    },
    {
      "title": "Great bakers rack!  Wonderful quality for the price.",
      "text": "We loved the first one we bought so much that we bought another! They are sturdy and strong, and they look good in my kitchen. I like that the wooden chopping board is removable for washing (though I don't chop anything on it), and I like that the lower shelves are adjustable. The assembly instructions could be a bit clearer and more helpful, but it does become pretty obvious once you get started. You won't regret this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "hybroanglid",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Just like it looks",
      "text": "Just like it looks. Easy to put together. Would be nice if it came with castors/wheels to move it around. Cutting board easily removes for cleaning.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Assembles easier than you think",
      "text": "Assembled in 23 minutes. Just bought another one. My kitchen is gonna rock.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Excellent product!",
      "text": "Easy, quick, no-tool assembly. Very rigid and durable. A perfect fit and just what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Cheap Materials/Packaging but works well enough",
      "text": "A lot of the plastic pieces were broken and the metal was bent due to lack of padding in the packaging. My roommate and i were able to hammer some pieces to make it work, but it took a lot more effort than it was worth. We were able to make it useful enough, so it’s not totally a 1-star product, but def would not buy from this company again. And it’s not a forever piece.",
      "rating": 3.0,
      "verified": true,
      "author": "Lupita Uribe Hernandez",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Solid easy to assemble kitchen storage!",
      "text": "My 21 yr old daughter bought this for her small San Francisco apartment! She assembled it herself. It’s plenty big for the microwave the mixmaster and a lot more. She loves it and that’s good enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Jordan",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Love, love, love my new Baker's rack!",
      "text": "Super easy to put together! Very heavy duty and looks great....would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Palmer",
      "helpful_votes": 5,
      "publication_date": 20160724
    },
    {
      "title": "Love it!",
      "text": "I love it! It took about 35 minutes to put together. I’m not the best at that so that was good for me. It’s sturdy and gave me more room on my counter.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Purchase some wheels, makes it very convenient. Also purchase the shelf liners. I'm very glad I did.",
      "text": "Step by step instructions made it a breeze to put together. Using it for small cooking appliances.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Love My Rack!!!",
      "text": "I needed a place to store my pans and kitchen utensils. This rack is so pretty and sturdy and compact. Took awhile to unpack but assembly was easy especially if you have two extra helping hands. HIGHLY RECOMMENDED!!!",
      "rating": 5.0,
      "verified": true,
      "author": "QueenAmazon",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Perfect for my small kitchen",
      "text": "I love this rack so much! It was pretty easy to assemble despite the instructions that labeled the parts wrong. It’s very sturdy and holds a lot of weight. I have very limited kitchen counter space and cabinet space and this was perfect for my kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Ketchup Kid",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Super pleased with this purchase!",
      "text": "Love this rack, after searching in stores and online this is the best deal especially for the price, lots of storage very easy to put together and very sturdy! Super pleased with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "amy aubry",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Good buy",
      "text": "Great quality. Was able to build it with help from my 8yr old as I'm 9mo pregnant. Looks Great!",
      "rating": 5.0,
      "verified": true,
      "author": "Yen",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Sturdy Quality",
      "text": "Excellent quality! Very sturdy! Hard to believe it was less than $90! There was one tricky part of the assembly and the directions given left some room for error (easily fixable but time consuming) but it was mostly easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "sturdy construction",
      "text": "This shelf is super sturdy and the adjustable feet are helpful for uneven floor. The only con was that it came with a bent shelf twice, but customer service was very helpful in sending a replacement. I use it to hold extra appliances including a kitchen aid stand mixer.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Very sturdy!!!",
      "text": "Exactly what they advertised.... perfect addition to my kitchen. My Cuisinart air fry toaster oven fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Roy",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Way better than expected!",
      "text": "Product came on I'm and was of much greater quality than I expected. The wire that it is constructed with is very thick and strong and the adjustable feet made it a perfect and level fit. Only drawback was that the wood cuttin board was slightly warped, but it was easily addressed with a small piece of cardboard underneath it. Would definitely recommend to anyone in need of more surface and storage space in a small kitchen or work room.",
      "rating": 5.0,
      "verified": true,
      "author": "dorian love",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Just as I expected!!!",
      "text": "I love it!!!! Fits in my corner just perfect for me to do my baking needs. Very cute and sturdy. It's the perfect height I can grab anything comfortably. I can reposition the shelves if I decide I want them higher or lower. My husband did assemble it but he said it was super easy to do. I still have some room in between my fridge and rack so it's not touching. I also purchased more hooks to hangs some extra items",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine I.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "I love it",
      "text": "I was cooking and ready to assist, but my 20 year old daughter assembled by herself in less than an hour. No tools needed. It looks sturdy and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Shalanda",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "I love this.",
      "text": "I love this. I have always wanted a bakers rack. Great quality and size for the the price.",
      "rating": 5.0,
      "verified": true,
      "author": "MAB",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Love it!",
      "text": "Easy to assemble, beautiful in my kitchen, big plus is it's functional. Holds my air fryer, bread machine, conventional oven plus much more. Did I say I love it 😃",
      "rating": 5.0,
      "verified": true,
      "author": "J.HOLIDAY",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "This rack went together easily, although I am familiar with putting this type ...",
      "text": "This rack went together easily, although I am familiar with putting this type of metal shelving together. It is the perfect size for my small flat. I do wish it came with more hooks though, I can see those being very handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Stitch5004",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "SEVILLE CLASSIC BAKER RACK",
      "text": "This was a gift for my grandson. He's just moved into his 1st apartment and needed extra storage/workspace in the kitchen plus he wanted something a little more utilitarian and this fit the bill perfectly...",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Jacobs",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Very happy customer!",
      "text": "Love it! It was exactly what I needed for our small kitchen! Easy to assemble! The small unit to the left was purchased separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Fehlman",
      "helpful_votes": 2,
      "publication_date": 20170131
    },
    {
      "title": "Everything went together easily, and it definitely holds a lot of weight ...",
      "text": "I was surprised at how solidly constructed this bakers rack is, especially for the price. Everything went together easily, and it definitely holds a lot of weight with no bending or flexing. Even the hooks can hold heavy cast iron cookware easily.",
      "rating": 5.0,
      "verified": true,
      "author": "yup pete",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "The best Bakers Rack out there!!!",
      "text": "Oh my goodness! I absolutely love this rack. It was super easy to put together and fills several of my kitchen needs. I now even look for items make by Seville because I am so impressed with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Renee",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "May want to see a rack in person before buying",
      "text": "Some of the metal had scratches and blotches. Cheap ad and made I. China but surprised at how crappy this thing looked",
      "rating": 3.0,
      "verified": true,
      "author": "Addicuss",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Sturdy and attractive!",
      "text": "Seems to be very good quality. Super useful. I'm really glad that I didn't cheap out and get the Amazon Basics one.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie_dva",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Sturdy and well priced",
      "text": "The product was better than I expected my girlfriend idd ss very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Heavy and Sturdy",
      "text": "Was super easy to put together. I did it by myself. No tools needed. I'm using it as a coffee bar.",
      "rating": 5.0,
      "verified": true,
      "author": "C.J.Hohl",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Love",
      "text": "I love this gratitude gratitude!! Great for storage and nice to look at too!!",
      "rating": 5.0,
      "verified": true,
      "author": "Charisse",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "So easy to put together and dismantle by yourself with no ...",
      "text": "So easy to put together and dismantle by yourself with no tools. Looks fantastic as well and gets many comments. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "nini838",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "A bargain for the price.",
      "text": "Nice construction. Went together easily. Not as tall as I thought it would be, but that's my fault. Shelves are easily adjustable. The cutting board is a nice added feature. Solid stainless steel construction. May not be commercial quality, but then it is less expensive. Nice purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "p33v3d",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Awesome Quality!",
      "text": "My wife and I absolutely love this baker's rack. Easy to assemble. Adjust easily. Very sturdy. Great quality material. Looks and feels like something you'd find a professional kitchen. Great value as well. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamal",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "It was easy to put together as I had just put a ...",
      "text": "This is exactly what I needed and wanted. It was easy to put together as I had just put a similar one together in the garage. Instructions were easy to follow",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Well worth the money!!",
      "text": "Was going to purchase a much more expensive piece but decided last minute on this and I’m so glad we did!! Very sturdy and made a great addition to our tiny kitchen that was in desperate need of extra storage",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Otto Perryman",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Very impressed!",
      "text": "This baker's rack is beautiful, versatile and very strong. I was able to fit my large toaster oven and other appliances and loved the fact that it took up less space than the rack I had before. I highly recommend this rack!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Very sturdy!",
      "text": "This bakers rack adds the perfect touch to my kitchen. It's spacious enough for me to store extra food, pots and pans, my crockpot and other appliances. Heavy duty too, not flimsy. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "J Erickson",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Love it",
      "text": "I love my new baker’s rack. It was easy to put together and is the perfect height for someone 5’0-5’4. It feels solid and looks great! So happy I bought it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Abledaughter",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Love this thing!",
      "text": "I love it more in person! It took about 20 minutes to put together & seems very sturdy. Great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Mommyto4boys",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Very nice sturdy grade of metal very nice looking",
      "text": "I store my big appliances and waters in a container great for extra room on top to one side i have a small microwave its great it has more than enough room. Holds more than i thought and is very sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Easy to assemble and it's very durable.",
      "text": "This bakers rack fits perfectly in my kitchen and holds my microwave and smaller appliances wonderfully. I was able to put it together so easily. I got it within 2 days and had it put together within 20 minutes. It's very sturdy. I'm so glad I ordered it!! I'm actually thinking of ordering another one for my canning kitchen as well!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheri",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Bakers dream",
      "text": "Was surprised at how easy this was to put together and how much better it made my tiny kitchen look and function.",
      "rating": 5.0,
      "verified": true,
      "author": "stacey",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Awesome product",
      "text": "Super simple assembly instructions aren't necessary and its very strudy. It also came with more hooks than the comparative brands and it costs the same or less.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 3,
      "publication_date": 20170331
    },
    {
      "title": "Easy to assemble, very sturdy and looks really nice in my kitchen.",
      "text": "I love it! It was easy for me to assemble and it was just what I needed for some extra storage for my kitchen. The nice butcher block top matches my cabinets perfectly and the hooks are perfect for coffee cups.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Coffee cart",
      "text": "Bought this as a coffee cart and it gets the job done! Not super aesthetically pleasing but it’s functional. Easy to assemble as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Maya Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Super easy",
      "text": "I freaking loveee it. I dont have a lot of space im my kitchen and this was amazing!! I love it .",
      "rating": 5.0,
      "verified": true,
      "author": "Almedina",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Easy to assemble for someone who is not handy",
      "text": "I bought this and put together in a short amount of time. Very easy. Looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Exactly as described. You can adjust the height of ...",
      "text": "Exactly as described. You can adjust the height of each shelf around a bit when you assemble, so it works for me to have a little more height in the bottom shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Great buy!",
      "text": "Absolutely love this! Beautifully displays all of my pots and pans and my large kitchen appliances with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Candace L West",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Great addition to my apartment",
      "text": "Very easy to put together and super sturdy! I like the fact that the wood board is removable. Quite heavy duty metal construction should be able to hold a variety of kitchen appliances",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca K",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "It’s adequate",
      "text": "The quality of the material wasn’t quite as I had expected from all the rave reviews. It has plenty of space for my cast iron pots and pans. You get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathleen ",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Five Stars",
      "text": "Great quality! Perfect for freeing up space in a small kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "jessica",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Makes a great microwave stand!",
      "text": "I love this! I needed a microwave stand, i got much much more out of this! I have a large microwave on it and a toaster oven. Its very sturdy and just wonderful for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "angela",
      "helpful_votes": 0,
      "publication_date": 20160328
    }
  ],
  "product_meta": {
    "title": "Seville Classics Baker's Rack for Kitchens, Solid Wood Top, 14\" x 36\" x 63\" H",
    "description": "Style Name:Wood TopEnhance your home with the Seville Classics Baker's Rack for Kitchens. Our bakers rack is constructed with industrial-strength steel wire and Ultra Zinc plating for strength and longevity. Prepare meals on solid rubber wood removable table top. Top measures . 75 inches thick and can be used as a cutting board as well as a place to store commonly used kitchen appliances. Rack features three height-adjustable shelves on the bottom that can be adjusted at 1-inch increments. Each shelf can hold up to 350 lbs. evenly distributed, making them perfect for storing heavy and bulky items. A cantilevered top shelf (36\" x 8\") provides even more room for storage or decoration. Six S-hook hangers provide a convenient way to store towels, bags, pots, and pans. Keep fresh herbs and kitchen plants in arms reach when cooking. Assembly is easy for one person. No tools required. Dimensions measure 14\" D x 36\" W x 63\" H. • Drop-in removable solid hardwood top• 6 stainless-steel S-hook hangers• High weight capacity storage shelves• Cantilevered overhead shelf• Industrial-strength steel wire construction• Screw-in leveling feet • Easy assembly with no tools required Specifications Dimensions: 14\" D x 36\" W x 63\" Height capacity: 350 lbs. per shelf, 50 lbs. per cantilevered shelf Weight: 43 lbs. Model #: WEB491What's in the Box?2 front poles2 back poles4 leveling feet3 shelves (14\" x 36\")1 cantilevered shelf (36\" x 8\")1 hanger bar (36\" x 1\")6 hooks1 hardwood top16 slip sleeves Limited 10-Year Manufacturer's Warranty Seville Classics products are backed by a 10-year limited warranty unless otherwise specified. The warranty protects against original defects in material or workmanship under normal home or office use for the duration of the warranty period. Seville Classics products are backed by a 10-year limited warranty unless otherwise specified. The warranty protects against original defects in material or workmanship under normal home or office use for the duration of the warranty period.",
    "rating": 4.7,
    "feature_bullets": [
      "6 S-HOOK HANGERS INCLUDED - Easily store pots, pans, dish towels, whisks, ladles and other kitchen tools on 6 chrome-plated S-hook hangers.",
      "REVERSIBLE CUTTING BOARD SHELF - Cut with confidence on the solid . 75\" thick solid wood top with juice groove for safely chopping vegetables, fruit and meat. Flip the top over to use as a microwave shelf for kitchen appliances, toasters, ovens, blenders and more!",
      "ADJUSTABLE KITCHEN STORAGE - Bottom shelves (14\" x 36\"), top shelf (36\" x 8\"), and hanger bars can be adjusted at 1-inch increments for a shelving unit that fits your style.",
      "HEAVY-DUTY CONSTRUCTION - Store up to 350 lbs. evenly distributed per tier. Our shelves are constructed from commercial-grade steel and are plated in chrome for extreme durability and easy cleaning.",
      "EASY NO-TOOL ASSEMBLY - Simply fit the unit together with the included parts. Assembly takes minutes and can be completed alone."
    ],
    "specifications": {
      "Product Dimensions": "14 x 63 x 36 inches",
      "Item Weight": "40 pounds",
      "Manufacturer": "Seville Classics",
      "ASIN": "B0719MK3J1",
      "Item model number": "WEB491",
      "Customer Reviews": "4.7 out of 5 stars682 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#321,335 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "Yes",
      "Number of Shelves": "4",
      "Batteries Required": "No",
      "Included Components": "Rack^wood top"
    },
    "categories": [
      "Home & Kitchen",
      "Kitchen & Dining Room Furniture",
      "Baker's Racks",
      "Furniture"
    ],
    "price": ""
  }
}