{
  "website_summaries": [
    {
      "verdict": "Part wakeboard, part kneeboard, and part wakesurf board, this model is a little different from standard offerings, but it's still great fun.",
      "pros": [
        "The buoyant and stable design makes this great for inexperienced riders, although it's still fun for more experienced wakeboarders",
        "Soft rubber top side provides exceptional grip"
      ],
      "cons": [
        "Not the right choice for anyone who wants a traditional kids' wakeboard"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy, fun and accessible for all",
      "text": "Works great. Pulling this from an inflatable boat with a 20hp engine. People of all weights (50-250 pounds) can successfully use it. Beginners can just lay on it easily, intermediate on their knees (very confortable) and more advanced can use it standing up (kind of like skis/board). Easier than waterskis for beginner... And a good alternative to tubing only...",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Rajotte",
      "helpful_votes": 5,
      "publication_date": 20180702
    },
    {
      "title": "I have been a wake boarder/knee boarder all my life and it is good to see a product that helps kids ride without ...",
      "text": "Wow, This thing is the bomb. My son at six years old rode it the other day and he had a blast. I have been a wake boarder/knee boarder all my life and it is good to see a product that helps kids ride without fear of falling off the board. Great job ZUP. R.Cox",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 8,
      "publication_date": 20170828
    },
    {
      "title": "Great Fun and Easy to Use",
      "text": "Bought for 3 teenagers to use on the lake. We can easily attach to and pull behind our pontoon boat. They all found it easy to use and were standing on the board within 20 minutes of use. Its lightweight, tough and very well made. We bought the version with the rope and handles which i think you really need to have rather than use a third party setup.",
      "rating": 5.0,
      "verified": true,
      "author": "GFDS",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "IT’S ZUP TIME",
      "text": "Bought this for our grandchildren. Needless to say at 70 years of age I haven’t used it but am rating on the basis of grandchildren’s enthusiasm. The minute they arrive at the lake the first thing I hear is “It’s ZUP time”. Grandkids are 6 and 9. Our boat hasn’t had as much use until we got our Zup Board...kids just don’t want to stop. I definitely recommend if you are looking at this item to stop looking and just buy it. You won’t regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "marycmeathe",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Eh...okay but some design flaws",
      "text": "Firstly, it's sturdy and my kids like it. But, I find it's awkward. The foot straps interfere with their knees when they're trying to kneel, and it's a little uncomfortable if they're riding on their tummies. The foot straps don't completely flatten with pressure. I'd pass on it if I had to do it all over again.",
      "rating": 3.0,
      "verified": true,
      "author": "N. Stout",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "fun!",
      "text": "We tried this out last weekend. My 10 year old was able to stand up on it after 3 tries... lots of fun for everyone including adults. Seems to be made well, looking forward to getting a lot of use out of it. I recommend buying the rope it comes with - it's easy to take the rope on and off for the children.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Daniels",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Builds Confidence",
      "text": "This is a great board to build confidence for first-timers. My 8-year-old stood up on his 3rd try and my 4-year-old was on his knees holding the rope his 4th try. Neither of them fell off the board, just be careful they start off on the back of the board so it doesn't get front heavy and submarine.",
      "rating": 5.0,
      "verified": true,
      "author": "Htur05",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Made our Family lake trip",
      "text": "Easy to use. All the kids got up and experienced a tow. Most were 7-11 years old. Fun for adults as well... Really great for beginner success!",
      "rating": 5.0,
      "verified": true,
      "author": "D. BOWENS",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "PERFECT and will not disappoint!!",
      "text": "This is the most ingenious water sports invention we have ever seen! Perfect for those skiers (young and old) who are apprehensive. It takes no skill to ride behind the board. When the skier gets comfortable, they can ride on their knees. When the skier is even more comfortable, they can release the rope and stand up.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann G. Kiefer",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Amazing learning tool, as well as a really fun toy!",
      "text": "My 8 year old grandson, who has only tubed before, was on his knees, and then feet on the very first pull. It was amazing to see how easy it was for him. Next we put my 4 yr old grand daughter out there. She had only started tubing about 3 weeks ago, and while she never stood, she was quickly on her knees and loves it. I have wanted to purchase this board ever since seeing it on shark tank, now I'm disappointed I waited so late in the summer. I would definitely recommend this to any boating family!",
      "rating": 5.0,
      "verified": true,
      "author": "John Enright",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Fun all around",
      "text": "I used this for the first time today, I wasn’t able to stand on it mostly due to my boat driver not understanding that it’s not skis or wakeboarding and you don’t need to go 20 mph right at the start, however it was fun to use it to kneel on and even just lay on it. I just read that the cut the bouncing down on the board to kneel next to the foot straps so I’ll try that. Only thing not giving it a 5 is the learning curve for drivers honestly and when falling off it’s a shock. I found that if you try and do a barrel roll it helps a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "steve Genova",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Great addition to boating fun for all ages!",
      "text": "Love it! All ages can easily use! Our 3 year old grandson rode it with a few simple instructions and had a blast and also it entertained our older grandsons(15 and 11) as well! Easy to pull and offers such a variety of ways to ride depending what you enjoy! Adults love it too!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra B.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great all around product",
      "text": "Great product if you don’t want to purchase each item separately. My kids were able to decide what they liked to do best. Made it easy for all ages to get up on board! I love you can do everything with one board! It is great one size fits all. Negative it is big an cumbersome in boat. Wish it fit on rack.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Wasn’t impressed..",
      "text": "Not as impressed as other reviews.. have to have great balance to stand.. knee is fun but sore later.. Board is bulky and very heavy. Too much for price. Sold mine",
      "rating": 3.0,
      "verified": true,
      "author": "Momma",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Hands down our favorite piece of equipment for water sports!!!",
      "text": "I can’t say enough about how much we love our ZUP board. We love that ANYONE on our boat can get up on the l board (toddlers-grandparents). Riders can do anything from lay on the board to standing up and skiing. Everyone is always begging for their turn! We recommend the ZUP board to everyone on the lake!",
      "rating": 5.0,
      "verified": true,
      "author": "Cara B.",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "This thing is zuping amazing..",
      "text": "This thing is zuping amazing..... great time for everyone age 10 thru 42....",
      "rating": 5.0,
      "verified": true,
      "author": "Tom M.",
      "helpful_votes": 6,
      "publication_date": 20170730
    },
    {
      "title": "Best lake toy ever !!",
      "text": "This product is really great! My 8 yr old twins can knee board, wake board abs surf on this Zup board. Totally worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "GREAT BUY",
      "text": "This board is heavy, but makes it so easy for my 5 year old to surf and knee board on .It is my best buy ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Steviemc89",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Amazing!",
      "text": "We got this for the kids to have something easy to use. It's great. Both 11 year old and 8 year old were able to stand on it first day. The rope is great as well, makes it much easier. Neither child was able to stand on water skis, but could on this Zup board.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Downing",
      "helpful_votes": 9,
      "publication_date": 20170707
    },
    {
      "title": "great!",
      "text": "great! Really easy to use! No problem for anyone to get up.",
      "rating": 5.0,
      "verified": true,
      "author": "PaulInNy",
      "helpful_votes": 2,
      "publication_date": 20170807
    },
    {
      "title": "Five Stars",
      "text": "We love this board. My 7 and 10 year were up standing I. The first ten mins...",
      "rating": 5.0,
      "verified": true,
      "author": "charles longley",
      "helpful_votes": 3,
      "publication_date": 20170808
    },
    {
      "title": "customer service and fun",
      "text": "Ezxellant customer service. Board is alot of fun. Grandkids love it!! Would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "robin wederski",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great product. Very easy to use.",
      "text": "Within 15 minutes on the lake my 7 year old was standing on this board getting towed by the jetski! Very easy to ride. So much fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Very versatile and durable",
      "text": "What a great board! Very easy to keep balance on. Very versatile: can ride it on belly, knees, while sitting, and standing. Very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex B",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great for beginners",
      "text": "It was very easy for my 10 and 11 year old to get out of the water.. they had a great time last summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "So fun and easy to use",
      "text": "We were looking for something kids and adults could use. This a perfect size since we don’t have a lot of storage and it’s easy to maneuver on the boat. We’ve used it for kids as young as 4 up to 45. This video is my son on his third attempt. Love the Zup Board!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Lots of fun",
      "text": "This thing is awesome. Easy to use by basically anyone of any age. If you are on the fence about it, just get it. Well made, and tons of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "joshua h",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Fun/Easy!",
      "text": "Grandkids were thrilled! 13 YO up & going immediately, 12 YO competing, & 7 YO gave it his all, but really loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle Boutte",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Tons Of Fun!",
      "text": "Purchased Zup board and handle combo. My kids are having a blast with it! Had a small issue with the handle, contacted Zup customer service and received a new handle the next day!! Great product! Great customer service! A++++",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Hendren",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "FUN",
      "text": "Board came faster than expected and has been so much fun. My two year old loves sitting in Front of an adult and cruising around.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Szymanski",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Awesome!!!",
      "text": "Everyone had a blast the first time out! Easy to use and tons of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kassinger",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "The Sharks were wrong",
      "text": "The Sharks were wrong. More fun than the Magic Kingdom and a whole lot cooler.",
      "rating": 5.0,
      "verified": true,
      "author": "i like things that work",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Super Fun for all ages!",
      "text": "The Zup board has been great for all ages and is super fun on the water!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Five Stars",
      "text": "Best thing we have ever purchased. Definitely recommend it for 4-8+ yr olds.",
      "rating": 5.0,
      "verified": true,
      "author": "Nechole Brown",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Five Stars",
      "text": "works great my 7 year old loves it as well",
      "rating": 5.0,
      "verified": true,
      "author": "Jdc82",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Great idea for kids learning to use watersports!",
      "text": "can't wait to try this board on the water! looks to be a great board for beginners! will update post once we get it in tow!",
      "rating": 5.0,
      "verified": true,
      "author": "shalfon",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Amazing but pricey",
      "text": "My 9 year olds loved it. One transitioned to a full wakeboard the next week. Freaking expensive though.",
      "rating": 5.0,
      "verified": true,
      "author": "Seefood",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Five Stars",
      "text": "Grandkids love the board and the Zup Customer Service was exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170720
    },
    {
      "title": "Face plant at the end!",
      "text": "Still not as easy to get up as they say, but worse, you get a face plant in the water when you let go, unlike a smooth entry into the water with skis.",
      "rating": 2.0,
      "verified": true,
      "author": "Ron C",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Four Stars",
      "text": "Fun, easy to knee board and ski on, very difficult to wake board.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Bonham",
      "helpful_votes": 0,
      "publication_date": 20171209
    }
  ],
  "product_meta": {
    "title": "ZUP You Got This 2.0 Board and 1.5 Handle Combo, All-in-One Kneeboard, Wakeboard, Wakeskate, and Wakesurf Board for All Ages",
    "description": "Get ready for fun in the sun with ZUP's You Got This 2.0 Board and Handle Combo! This bright lime green and orange board acts as a tube, wakeboard, wakesurf, boogie board, kneeboard, and even water skis - all on one board! The included Double ZUP Handle allows for easy starts and control over your board as you ride over waves. It features slip-in foot straps that also work as elbow pads and kneepads as needed. This board includes built-in front handles with rubber grips and an integrated tow hook, allowing it to be controlled from side to side or like a kneeboard. Stand with your feet facing forward to wakeboard or have your feet pointed sideways to surf across the waves. The buoyant design is perfect for young or inexperienced riders getting out on the water for the first time while still providing excellent control. Everyone of all ages will enjoy the summer on ZUP's You Got This 2.0 Board and Handle Combo!",
    "rating": 4.6,
    "feature_bullets": [
      "BOARD AND HANDLE COMBO: You Got This 2.0 Board and Handle Combo acts as a wakeboard, wakesurf board, kneeboard, boogie board, water skis, and tube to provide fun for everyone on the water",
      "EASY TO USE: Integrated side handles are covered with a soft rubber that provides excellent grip that allows riders to take control of the direction the board moves in",
      "FUN FOR EVERYONE: All riders, regardless of skill level or age, will be able to choose an activity and have a blast on the water! Riders with greater abilities will be able to carve, spin, surf and perform tricks while less ambitious riders can calmly cruise along",
      "DURABLE: ABS Molded construction will keep the board working great after getting beat up over time. EVA foam padding will hold up and provide a comfortable ride for years to come",
      "INTEGRATED TOW HOOK: Built-in handle hook allows riders to start, move to a kneeling position or move to a standing position without worrying about holding onto the handle"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "57 x 5 x 25 inches; 18 Pounds",
      "Date First Available": "May 15, 2017",
      "Manufacturer": "ZUP",
      "ASIN": "B071F86F4V",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors"
    ],
    "price": ""
  }
}