{
  "website_summaries": [
    {
      "verdict": "Sturdy, feature-laden hobby drone offers top of the line flight stability for the serious drone user.",
      "pros": [
        "Shoots photos and HD video from built-in camera",
        "Sensors keep the drone stable in flight, and longer battery life provides 16 minutes of flight time",
        "Very small and lightweight"
      ],
      "cons": [
        "Software glitches and GPS issues recur",
        "Batteries also can malfunction, even when fully charged, creating crashes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "DJI does not warranty their product, buyer beware.",
      "text": "Everyone be warned that low battery \"return to home mode\" is 30meters in the air. My drone flew straight up into a tree and is stuck 50ft up. I purchased the refresh warranty and on the phone the rep said that return to home mode is normal operation. He then said the warranty covers normal operation. Then I gave him my case number and he told me the drone is not covered and I am SOL. Buy beware, DJI does not cover their products and their programming will fly away like money in the wind",
      "rating": 1.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 36,
      "publication_date": 20180723
    },
    {
      "title": "Exceptional starter drone",
      "text": "I have been doing photography for sometime. Was interested to try the drone experience. After some research i realized i cant give spark a try. It has surpassed my expectations. Video is quite decent. But for me most interesting part was hdr mode for photography. Got decent images which combined gave a nice overall image with a very nice dynamic range. Flying was lot easier then i had imagined.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarfraz Abbasi",
      "helpful_votes": 44,
      "publication_date": 20171104
    },
    {
      "title": "Error code 1112",
      "text": "I bought this for weekend in the Bahamas. Could use it because the firmware wont update. Keeps giving me an erro code 1112. It in perfect condition and I wanted a refund but now I'm stuck with this POS because lord knows when DJI is going to fix the problem. I'm really disappointed at Amazon for not letting return this product especially when its not physically damaged. They sold it to me this way. When I check to see what that code mean on the internet, it means that the product was stolen or reported lost. Thanks amazon for allowing this.",
      "rating": 1.0,
      "verified": true,
      "author": "Serg",
      "helpful_votes": 4,
      "publication_date": 20190717
    },
    {
      "title": "Absolute P.O.S.",
      "text": "I already have a DJI Phantom and a DJI Mavic Pro. I got this for my son for Christmas. First off... getting it set up just simply doesn't work. I had to \"connect\" it about 10 times before it \"took\". It kept going in circles: get connected to the drone, then \"enter device\", where it would say it was not connected, and I needed to go through the process again. Then, when I finally got connected, it wouldn't allow me to use it without updating the firmware. But of course, that takes 15 minutes, and FAILS every time. What a POS! I am going to return this and get another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Go Cubbies",
      "helpful_votes": 6,
      "publication_date": 20181227
    },
    {
      "title": "DO NOT BUY TO THIS SELLER. STOLEN ITEMS, DRONE WONT FLY",
      "text": "I was happy at the moment getting this drone, but these drones are stolen items during transportation. You won't be able to activate and fly your drone eve. IT will appear code 1112 at the last process of activation. This is unacceptable and I will inform this to everyone I can, so they won't waste their time, and returning process !!!",
      "rating": 1.0,
      "verified": true,
      "author": "Khathawut Yaiying",
      "helpful_votes": 7,
      "publication_date": 20190711
    },
    {
      "title": "DJI SPARK!!",
      "text": "I have a few DJI drones, I believe this one is the best for the price, lots of technology packed into this lil drone, great camera and flight operation, may want a few extra batteries though, also lights on spark are cool too, Happy flying!",
      "rating": 5.0,
      "verified": true,
      "author": "David Sammons",
      "helpful_votes": 9,
      "publication_date": 20170617
    },
    {
      "title": "pure junk",
      "text": "pure junk drone was DOA and remote was DOA DJI is a joke it was broke right out of the box, no 16 GB card, the remote would not even work, there were about 5 things wrong with this piece of junk, for my iphone it was 3 feet away and it was to far from what the drone said, this is pure scam from DJI",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 4,
      "publication_date": 20190405
    },
    {
      "title": "Super easy to fly. Great for the novice or homeowner",
      "text": "This is my first real drone. The word I would use to describe this is...awesome! I bought the \"fly more\" package that came with the remote. Without a doubt, the remote is an absolute necessity. It shouldn't even be an option to fly without it. However, it was a bit difficult to get the drone connected. It really came down to me not performing the steps in the proper order, which are: 1) turn on drone. 2) turn on remote. 3) connect remote to device (i used a micro usb-lightning cable). 4) turn on app. So much fun to fly. I'd say the flight time of 16 minutes per battery is quite a stretch. It's more like 10, at best.",
      "rating": 5.0,
      "verified": true,
      "author": "Aly F",
      "helpful_votes": 2,
      "publication_date": 20180824
    },
    {
      "title": "It's like having a flying tripod!",
      "text": "The Fly More Combo is the way to go! The latest DJI Go app now lets you activate your Spark with the QR code scanner! Before this latest app release, you had to bind everything manually, disconnect from Wifi, reconnect to Wifi etc and it was a pain. Now, you just scan the code and your Spark, batteries and RC remote are all updated at one time with a push of a button. The DJI Spark is an amazing piece of equipment and technology all bundled into a lightweight package that you can take with you backpacking. It's like having a flying tripod!",
      "rating": 5.0,
      "verified": true,
      "author": "The Southwest Backpacker",
      "helpful_votes": 4,
      "publication_date": 20180113
    },
    {
      "title": "Love It.",
      "text": "I've never had a drone before, but always wanted one. I love this drone, it is so easy to fly and it takes great quality photos/video. I'm still learning how to use everything, but I'm very impressed with it so far. I bought a hard case that holds everything, so I'm hoping to take it on some trips and get some nice aerial images when we travel. I bought this case for it on Amazon, and everything fits like a glove in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 5,
      "publication_date": 20170719
    },
    {
      "title": "Works great for me!",
      "text": "My 2nd Drone, fist was a Parrot or something like that. This one really maintains height etc. and has cool features like\"follow me\" or hand gestures. I don't use those and can't comment on that really.As a home inspector I sometimes use this drone to fly over and inspect roofs that are hard to access. The camera seems up to the job and it hold height, position etc. very well. The return to home function strangely doesn't work unless you are at least 60 feet away, the manual covers this but it seems strange to me. Otherwise it's quite capable and has served me well. I'm looking into getting licensed to take drone shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Super Impressive Drone",
      "text": "This little drone does way more, way better then I thought it would. For the price the spark is an excellent starter drone. It has excellent stabilization and features. It takes remarkable pictures and video. The drone is rock solid even in light to moderate wind. And sport mode is just plain fun! The four stars is due to the short comings of the APP. I have to connect to the drone, take off, loose signal, land, reboot everything (drone and controller), and then reconnect. If it wasn't for this issue it would be a 5 star!",
      "rating": 4.0,
      "verified": true,
      "author": "Marcus C Baker",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Well worth it if you are looking for a drone for videos and pictures...",
      "text": "Spend enough on drones less than $100 and should have held back and just bought this one from the beginning. Totally worth it and watched countless YouTube reviews in it and check them out if needed. Totally worth it now especially since price dropped so much from it's original MSRP price. So much tech packed into this small drone and you will be surprised how small this is and very well built. Having so much fun with it and recommend to buy it with the remote controller. Tried with just the phone and not worth risking losing connection. Get it with the controller!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Glitching at start",
      "text": "Lost signal often But the most important problem was taking off. He started jumping everytime after starting. It tooks about 2-3 minutes for it to stop glitching (jumping) and take off. We did not understand what the problem was, suffered for six months while we were on a trip to Asia. And lost some awesome captures because of slow start. Now using mavic zoom 2, and it’s much better ( more professional) in every way It is not worth saving when it comes not to a cheap gadget, it is better to pay extra and buy a more professional drone.",
      "rating": 2.0,
      "verified": true,
      "author": "Sofia",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Fun to fly",
      "text": "This is my second Spark because I crashed my first on into a tree and it broke into a million pieces on impact to the ground. They are super fun and easy to use. I would suggest getting the RC remote and the DJI care package in case you it crashes. I didn't get that for my first Spark so I had to suck it up and just buy another one. Something to mention, my neighbor threatened to beat me up for flying it around the neighborhood so if I could make any flight suggestions, it would be to respect others and try not to piss too many people off or seem like some kind of creepy stalker.",
      "rating": 4.0,
      "verified": true,
      "author": "Phu Pham",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "stolen product",
      "text": "do not buy from this seller! The drone does not activate. According to the manufacturer, DJI, he belongs to a stolen lot. At the time of activation, error 1112 appears and does not activate at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Thiago ",
      "helpful_votes": 4,
      "publication_date": 20190723
    },
    {
      "title": "Great Travel Drone!",
      "text": "Best travel drone available. The photos are fantastic and the video is high quality. I took this with me on a 4 month trip through Asia and it worked well! I wanted the Mavic Air, but due to size and weight for long term travel, I chose this model. The only issue I had was a failed battary while in Indonesia. It took me a month to find a replacement, but luckily I was able to. I carry 3 batteries at all times and recommend that as a minimum. All around, I am very happy with this purchase and will be using it on a 4 month trip through South America very soon!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Chapman",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Very good other than endless firmware upgrades",
      "text": "Every time I have turned it on, there is a new firmware to download and install. There are seemingly endless firmware upgrades for the battery, for the drone, for the controller, etc etc. It will not let you take off without upgrading which is very annoying. If you don't have enough space on your phone, it will be a problem. Other than that, this drone is the iPhone of drones. Super easy to control, very reliable, interface is fantastic, performance is top-notch. I have owned and operated many drones and feeling before spark was \"I may crash any second\" This drone feels solid, reliable, and it works. All the glitches have been worked out.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20171020
    },
    {
      "title": "Crashed due to Christmas package",
      "text": "I bought this and the Christmas package, with the Santa and the reindeer horns. The horns came loose and got stuck in the propellers, and the drone crashed in the lake. DJI has yet to respond about selling a faulty add-on. Please contact me if you've had a similar issue. My attorney thinks there is a major product defect that makes this drone dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "Brett Jensen",
      "helpful_votes": 2,
      "publication_date": 20181217
    },
    {
      "title": "Small but mighty.",
      "text": "Picked this little drone up \"used/like new\" and let me tell you, it was brand new! What a deal! Have only flown it a little, but so far everything is seamless. The camera resolution is great! Looking forward to capturing our vacations in a much cooler way. People say the app isnt good but we've found it to be quite responsive with steering controls. Then again, we are noobs. I sprung for the controller, assuming at some point I wont be such a novice. Time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Amazing",
      "text": "The first DJI spark I received had been obviously used and broken. It was not a new product. I informed amazon, returned it for a replacement, and received a new DJI spark. Since then, I have been having lots of fun with it. It is an amazing drone. I even bought an additional 2 batteries and a DJI spark accessories kit. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "CARDIOVERSION",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "A lot of fun.",
      "text": "Great. It takes a lot of practice to get good. I’m not sure how far it will go out. I’m at 600 ft above sea level. It will go up a bit over 300 ft. straight up. Video and pictures look good. But to get a Professional look, you’ll need to understand the internal setting and practice a lot. Know what the FAA rule are. If you’re 5 miles from and airport or near a no-fly zone, it will not lift off the ground.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte, NC",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "So Happy with my Purchase!!",
      "text": "Great little drone. Basic technical abilities required. Watch YouTube videos and read up as much as you can before you operate this drone. If you make yourself knowledgeable about how this hardware and how it operates it will serve you well, great piece of equipment. Start in beginner mode, and do not start flying in your house out of the box. Test outside first. I am now able to to take unbelievable photos with my family on vacay! This really is amazing if you have never owned a drone get ready to feel like a kid again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ricklebee",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "The perfect drone to get your feet wet, and still capture amazing photos/videos",
      "text": "SUCH a great drone, and a great company. I bought this to learn how to fly a drone. The Spark has a lot of great easy-to-use features, and pre-set moves. I ended up really getting the hang of it, and honestly, this drone paid for itself in one shoot. I had a firmware issue with the drone which caused it to crash, and DJI replaced it, at no charge, with no hassles. The replacement has worked perfectly. A must-buy for a drone newbie or pro.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Good Drone but then became defective",
      "text": "This drone worked for a while and its easy to fly but we had two instances where it suddenly went out of control wildly. Seems like a flaw. I did hit my wife and cut her leg and arm. So be careful with this thing. We had to run and try to get out of the way. I assume its a flaw in the avoidance system, it seems to get very confused. And it does not seem right that I only get 50% refund on a flawed product. I'm still working on that with Amazon. ... Stay Tuned.",
      "rating": 2.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "sub standard photo and video quality, bad battery life",
      "text": "please do not waste money on this drone as it is of very substandard quality, there are better far cheaper. DJi does not stand behind its product. You are forced to activate to even do a test flight and they charge you restocking fee calling it used. battery is only about 10mins at best, you will be too scared to fly it in any further than 100ft.",
      "rating": 2.0,
      "verified": true,
      "author": "prashy21",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "No need for any connection cables to fly combo!",
      "text": "Had some initial difficulties with the connectivity. At first I flew the Spark Drone using my IPhone 6-S as the controller, with no issues. After watching u-tube videos, I purchased a connector cable, later to find out you don’t need any cables to fly. Next, my Bluetooth hearing aids were interfering with the signal, so after turning off the Bluetooth, everything worked great, Great fun, but battery life is short, overall..A(-).",
      "rating": 5.0,
      "verified": true,
      "author": "Karen A. Garner",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Great entry level REAL drone with all the feature you need to create professional looking movie and photos",
      "text": "Love it! Lots of features in a small package. The only downside is the battery life. In most cases, your pre-flight checks (Wifi connection, GPS, Home Points, will already take ~8% out of it which will leave you with ~12 min of fun. Not a lot of time, but lots of fun. Definitely​ take the Fly More Combo, worth the money - just the remove covers the price difference, the second battery is a must (some will say a 3rd is as well), prop guards are good for indoors and your first flights, the bag is useful as well as the 3-way battery charger.",
      "rating": 5.0,
      "verified": true,
      "author": "G. R.",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "AWESOME playful drone",
      "text": "Been a drone user since DJI came up with the Phantom 1. Love to flight my drones and take them everywhere I can, but sometimes is just impossible to because of the space limitation. The DJI Spark is an incredible drone for fun videos and photography. An awesome device to captures your memories from a different angle!",
      "rating": 5.0,
      "verified": true,
      "author": "FERARAYAC",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Awesome buy",
      "text": "I had my reservations about buying this product. However, I can say with confidence that it was worth all my money. I have used it to create videos. Although it's a beginner drone, it sill packs a punch. I wouldn't buy it again however. Save your money and buy the DJI Mavic Air. But if this is all you can spend it's a quality buy. You won't be let down.",
      "rating": 5.0,
      "verified": true,
      "author": "Enrique J.",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Amazingly Engineered Device",
      "text": "Exceeded my expectations as I've been interested in the potential for photography from these drones. The DJI Spark is only 1080p but this is the first step to becoming familiar. It takes practice along with watching a lot of youtube videos from other owners and there is still plenty to learn but I feel I've mastered the first part of learning to fly it well. Definitely purchasing the full package with the controller for farther more stable flights. I did find I need more batteries so expect to purchase those. They charge quickly and I've found last about 10-14 minutes. An amazingly engineered device and worth the 600 bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Smith",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Couldn't be any happier with this purchase.",
      "text": "I'd give a longer review, but there are plenty more pilots on here a lot more qualified than I am to do so. As a new drone pilot this thing is Amazing. Even though it's DJI \"hobbyist\" model, I can't believe how well this performs and how well it flies. It's incredibly easy and I've had a great time piloting it. Heck, I crashed it into a tree this past weekend, it fell probably 75 feet and all it needed was some new propellers. A quick $15 fix and it's back flying like nothing even happened. Attached is a picture I took of Louisville Slugger Stadium in Downtown Louisville.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Fischer",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "This is a great little drone",
      "text": "This is a great little drone. It is responsive, takes great videos and pictures and I didn;t crash it on my first flight today. For someone new into drones it's a pretty steep learning curve but I'm picking it up. Knocked one star off because I spent $700 and it does not include a memory card :( What's up with that?? Plan on ordering one along with the drone along with all the needed accessories. Gimble cover, joystick guard etc. Also the bag that comes with it is useless. Can't even fit all the stuff in it. Used an old camera bag instead.",
      "rating": 4.0,
      "verified": true,
      "author": "John Nelson",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Awesome device!  I love this Drone it being my 1st.",
      "text": "It's a small learning curve when you first get it. Take your time to properly set up and learn the controls. Having only previously used the Tello drone this is a huge upgrade. I had gotten so much fantastic footage and fly it several times a week at least. I also picked up a third battery which is highly needed. The flight time does suck being only 10-12 minutes. For the price, its amazing tech and you can't go wrong getting this drone.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Gebhard",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Stolen Item",
      "text": "When I attempted to activate item it gave error code. I contacted DJI product support and code was because item had been reported stolen and could not be activated. Item was sold by third party, NOT Amazon. Returned to Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "S. Roberts",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "DJI Spark Is A Tiny But Mighty Quadcopter!",
      "text": "This Quadcopter is pretty small but it packs a lot of features like Active track and Quickshots which are capable of some amazing photos and video sequences. I've recently purchased a DJI Mavic Air and DJI Mavic 2 Zoom and this drone still has surprised me in both video quality (even though its only 1080p). I have yet had a chance to fly it outside due to the current weather but will update this review if I experience any negative or concerning issues. I am curious as to the range and video quality at a far distance. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Errin LTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Would love to say how great this drone is but mine ...",
      "text": "Would love to say how great this drone is but mine doesn’t work. I saved up to buy this for 2 outdoors trips but alas ....shipping didn’t arrive in time for my first trip, even though I have Prime. When it finally arrived, it was missing the batteries and the charger so I couldn’t even use it as expected. Replacement parts are going to have to be delivered from Asia and won’t come in time for my 2nd trip. Hopefully others have a better experience.",
      "rating": 2.0,
      "verified": true,
      "author": "Lydia Ledford",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "like DJI. Im an occasional user",
      "text": "like DJI. Im an occasional user, not pro at all. like to make home videos with my family for vacations. beach, ski etc. First I had the Mavic Pro. The best drone I ever seen, however, too big and too pro for my use, I sold it. Then bought this, also like, but feel little poor on reach and battery life and sensors. I sold it too. Finally I bought Mavic Air. Haven't tried yet, but it seems what I was looking for...",
      "rating": 4.0,
      "verified": true,
      "author": "Sebastian",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "An absolute outstanding small drone with many amazing features normally found on much larger drones!",
      "text": "An absolute outstanding small drone with many amazing features normally found in much larger drones! And some of its features are not even found on larger drones! I sold my more expensive DJI Mavic and Phantom drones since the Spark can do it all for less money (especially to repair if things go wrong – and they will!) It's also easier to find places to fly it as it \"looks\" like a \"toy\" drone and is quieter and less noticeable. You will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wallace",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Love this thing!",
      "text": "Got this as a beginner and was very easy to learn and the safety features are a life saver. The collision avoidance has saved it from a few tree limbs and smacking me in the face one time. Not a proud moment. I do recommend you get the controller as it will allow you to get the full range and speed out of the drone.",
      "rating": 5.0,
      "verified": true,
      "author": "nathan",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Buy it!",
      "text": "My husband has wanted a good drone for a very long time. He never dared spend the money. So I decided he needed one, he works his butt off. I happened to meet a college professor flying her drone and she had done all the research! I just pulled the trigger and bought it. Let me tell you what- my husband absolutely loves this thing! I’m so happy!!!! Buy it- you won’t be disappointed. He was terrified to fly it at first. But now he’s getting really good! I’ll ask him if he has a review and update this later!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha 🛒🛍",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "don't waste $500",
      "text": "followed directions 14 times. app will not change unless you execute closure. never flown. still needs work. not worth wasting $500*** look elsewhere for better...",
      "rating": 1.0,
      "verified": true,
      "author": "W.  Ward",
      "helpful_votes": 4,
      "publication_date": 20180721
    },
    {
      "title": "Very good but not for pros",
      "text": "I love my Mavic pro platinum . So I thought I would try the spark and I really wanted to like it and it works great for what it was but with the unreliability with the video dropout issues approaching 300 feet in any direction it was on consistent for my needs. The spark would be ideal for the person who is starting out with drones and want something a little bit better than the basic.",
      "rating": 3.0,
      "verified": true,
      "author": "DustinJenk",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Be careful if you need to return for any reason",
      "text": "This was a nice drone but since I purchased it as a gift, and the person a) didnt want it for certain reasons and b) was having signal issues likely b/c of my surroundings, I had to return it. The kicker? They charged a 20% return fee which is a hard hit (I do understand that they can't sell as new anymore and don't want to lose money either, so it may be an issue with DJI's policy rather than the vendor)",
      "rating": 3.0,
      "verified": true,
      "author": "Goldie",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Love my Dparky",
      "text": "Love my Sparky, its a top quality drone backed by the biggest name in the industry. Its well built, well design, works like charm, its compact, its pretty its very easy to flight. Its perfect for thecweekend warrior aerial photography aficionado. Indeed, battery life is short and you could do better with a couple extra batteries. Remote control (sells separately) is a must. You will have better control and a lot more range.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Endara Crespo",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "A fantastic drone for the next step beyond beginners.",
      "text": "This is a great combination pack with all y’all need to fly for a while. This is a solid drown. Study. Illuminates much of the worry of drones by having failsafes that bring it home to you safely if you lose sight or control. The gesture controls are truly my miraculous. It is a little inconsistent in recognizing your commands. But it really allows you to quickly get some good shots without a ton of set up.",
      "rating": 5.0,
      "verified": true,
      "author": "JimJenn",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Do not buy",
      "text": "Drone is a brick. Will not activate. Error code states drone was stolen. Do not buy from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Byers Family",
      "helpful_votes": 4,
      "publication_date": 20190713
    },
    {
      "title": "This seller is a swindler",
      "text": "I bought a DJI Spark, Fly More Combo, Alpine White about a year ago. when I opened the box I got the controller barcode is scratched and unreadable. So couldn't connect it to Spark and unusable. Tried so much to contact user to return and replace it, but always has excuse to don't return the replace the controllers. Just don't trust this seller",
      "rating": 1.0,
      "verified": true,
      "author": "Parsa SD",
      "helpful_votes": 3,
      "publication_date": 20190723
    },
    {
      "title": "This thing is cool! Very easy to fly",
      "text": "This thing is cool! Very easy to fly. Durable too. I have crashed it twice and it still looks and functions fine. Both crashes were user error so nothing on the Spark. But very clear video and very easy to fly. Only downside is on a windy day, even slightly, can make it move a lot because it is so small. Like tiny. Which is a benefit sometimes though. Easy to take around. I love it though!",
      "rating": 5.0,
      "verified": true,
      "author": "Kurtis",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Beware Fly Aways",
      "text": "Had this drone for a year and a half. Took it out one day over a pond. Flew it a few feet away from me above the pond then lost all video transmission and signal. Waited 15 minutes for it to come back with the return-to-home feature (it didn’t) so I walked around the pond to see if it landed somewhere in it or around it. I couldn’t find it. I have a feeling it flew away like so many others have reported that theirs did. Loved it while it lasted.",
      "rating": 2.0,
      "verified": true,
      "author": "Airek ",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Be aware this does not come with the free Micor Sd card you will have to supply your own",
      "text": "If this came with the Micro SD Card and reader I would have given it 5 stars. Other than that I love this drone. The carry case that DJI provides will not fit everything that comes in the box. YOu can only fiot the drone Batteries and the controller nothing else. Buy yourself a better case. Here is what I mortified it with. Along with a Gopro tripod mount.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick92",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "And after years of debating on buying a DJI drone just for fun would be such a huge waste of money for ...",
      "text": "I’ve been flying RC helicopters and drones for a long time. And after years of debating on buying a DJI drone just for fun, i figured that would be such a waste of money and I wouldn’t be using it for how it was intended. I just love to fly, not creating movies. But after seeing the Spark and it’s price tag, it didn’t hurt that much to make that purchase. My thoughts on the Spark... Super easy to fly, great for beginners, lots of how-to’s on YouTube, inexpensive, great for beginner cinematographers. Definitely a great buy for me. Next will be the Mavic Air.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny D.",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "it's going to be in every trip",
      "text": "brand new product, original packaging, perfect conditions, i have flyed this on one vacation trip and exceded my expectations. You really better need the OCT cable to connect it to the cellphone to have a good signal, otherwise the video feedback its getting interrupted often but that doesn't affect your flying. really confortable to fly (i have also a phantom 3)",
      "rating": 5.0,
      "verified": true,
      "author": "carlos",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "My husband loved it",
      "text": "My husband started getting interested in drones and purchased this pack. He totally loved it. Every time we had company, he’d show them his new toys. The size is perfect and the quality of photos is great!",
      "rating": 5.0,
      "verified": true,
      "author": "TRACEY",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Buyers Beware",
      "text": "After the software update, the drone lost connection from the remote control which was 20 feet away and dropped into the water. This is not what you would expect from a $700 drone. I contacted DJI and they simply said its out of warranty so we dont care. I refuse to purchase any other DJI product going forward. They want to charge me $75 on top of that to analyze the log. I told them i am happy to provide for free if this is going to prevent other users to loose their drones in a similar situation. I never wrote a bad review in my life for any company/product.",
      "rating": 1.0,
      "verified": true,
      "author": "sarper",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Perfect for YouTubers and Vloggers. VERY Fun to fly!",
      "text": "I love this little drone, it was easy to setup and easy to fly. You will need some patience when flying and learning the drone, so many features and modes to choose from. I made a video review/unboxing of this drone, check it out. Here a sneak peak of my YouTube video.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 2,
      "publication_date": 20180109
    },
    {
      "title": "Excellent drone",
      "text": "Two days after having played with it, my initial impressions are: excellent build quality, the drone is powerful and stable in the air. However, the iPhone app setup was a mission, my teenage son took a while to get it working. Also the drone is quite noisy. Be careful with the blades, treat them with great care, while in operation the blades can cut your finger like a knife! Overall very happy with the purchase, sure it will provide hours of fun!",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Yeh",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Easy to maneuver",
      "text": "My first drone. Easy to maneuver, great video quality (connect the remote control to your phone directly with usb instead of wifi to get better quality streaming and long distance live camera view",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Fantastic drone, for intermediate pilots.",
      "text": "Better than expected, but it helps to go to YouTube. Flys great. Calibrating the guidance and compass is tricky, and non intuitive. Don’t assume you got a bad drone. Fantastic pictures and video. Beginners should buy a 50$ drone first, I’m glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "David Arneson",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "An amazing drone. Don’t hesitate to buy it!",
      "text": "I am 74 years old and my Spark makes me feel like a teenager. It is so easy to fly, and so reliable, with fantastic video quality. I have over 12 hours in the air with over 150 flights, with zero problems. My videos are admired by all who see them. I also have a different brand drone which cost lots more than the Spark, and it isn’t half as good as my Spark.",
      "rating": 5.0,
      "verified": true,
      "author": "Samual Spade",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Not cheap, you get what you pay for!",
      "text": "This drone is packed full of technology and worth every penny!! Awesome, user friendly and fun!! The accessories to make it more functional start to add up so plan to spend a few more hundred bucks if you plan to really take it to the next level but if you’re keeping it basic and not looking to have it up more than 10-15 min it’s perfect. Flying is so much fun and since I’ve invested in multiple batteries, I can keep it flying for a good hour. I’ve enjoyed it and the video quality is impressive!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lakeshorechicago",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Consider the Mavic Air",
      "text": "The Spark is very short battery life, actual flight time is about eight minutes, but total flight time is about 16 minutes. The Mavic Air model has about 16 Minutes of actual flight time. This may not seem big - but it is big, very big. Get the Mavic Air, pay the extra money, and get the Mavic Air. Happy Flying",
      "rating": 4.0,
      "verified": true,
      "author": "April Webber",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Battery charger almost caught on fire.",
      "text": "Love the spark but be careful when charging your batteries. After a year of using the charger it started to smoke at one of the charging ports. May have ruined the battery. Other than that great drone just be careful when charging don’t leave it when charging.",
      "rating": 4.0,
      "verified": true,
      "author": "MHC",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Best small drone for a beginner",
      "text": "Love it! I've been wanting a drone for a long time and this drone is amazing to fly for a beginner right out of the box. Is amazing to fly just by using your hand or even better by using your smartphone, tablet, or the controller. The size it's perfect for me, so compact, I take it everywhere I go without any issues. The only (2) negatives about this drone is... 1) Battery life is WAY TOO short and 2) the Gimbal sucks when you tilt the camera either up or down. Aside from this negatives, I totally recommended it to any beginner looking to explore this hobby of drones. Happy flying and be responsible.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "DJI Spark... WOW!  A fascinatingly amazing piece of craftsmanship.",
      "text": "This drone is a super great buy at its price point. Videographers and photographers alike will be amazed at the quality this drone offers. Although it only shoots in 1080p at 30FPS, its an astounding 1080p... I highly recommend this to anyone wanting to capture and keep video of family and fun outings. I guy¥grantee you wont be dissatisfied with your choice. I like it so much, I bought two.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Dont buy with out remote in bundle",
      "text": "Doesnt come with remote ended up spending a lot more money! The range on this with out remote is low!",
      "rating": 3.0,
      "verified": true,
      "author": "noam",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Disconnects randomly while flying",
      "text": "The spark constantly was dissconnecting randomly, even when it was right in front of me. I lost control many times even with the RC Remote. The remote connects to your phone wifi WIFI not usb so the stream is laggy. Having close to 40 hours of recorded flight time with previous drones, I would not recommend getting the spark AT ALL. You *will* lose it with all of the constant connection issues. I've owned the spark for 2 hours and am already putting it back in the box to get a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "David Hunter",
      "helpful_votes": 7,
      "publication_date": 20170717
    },
    {
      "title": "DJI's smallest and most affordable camera drone.",
      "text": "Dislike: Was hard to get set up. DJI person at their online forum got it squared away for me. Smooth flying drone. Nice camera. Good shooting. It's not a toy. Spend some time studying how to use it and learn the right way to do things. Lots of helpful youtubes. Their online forum at forum.dji.com is useful as is sparkpilots.com",
      "rating": 5.0,
      "verified": true,
      "author": "Tentoes",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "PERFECT!",
      "text": "LOVE IT! My wife bought this for me and I couldnt be any happier. The fly more combo is a must. I get about 12mins time in the air from each battery. Roughly 45mins and both batteries are fully charged again. The bag it comes with for the drone is just okay in my opinion. I dont use it as I like to keep the bird in the hard shell too. I found the Maxpedition Jumbo Versipack is perfect. The hard shell with drone fits in the main pocket fine and enought outer pockets for everything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Jammin",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Great little drone",
      "text": "Great little drone, real flight time is about 12 min, but its a great deal considering the cost of the next level on DJI. with some research, you can get a lot of juice of this baby.",
      "rating": 5.0,
      "verified": true,
      "author": "angel",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Great product.",
      "text": "Previously owned another Spark and didn't want to discard all the accessories I purchased, so wanted another Spark vice upgrading to the newer product. Very happy with my decision, and the product arrived as promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Ebonyninja",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "One Star",
      "text": "Very light weight. Difficulty to put together, then would not work even with tech support!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180914
    },
    {
      "title": "Lots of fun",
      "text": "I have really enjoyed mine. It takes some practice to use and there are no written instructions with it but there is alot on line. I am still learning more of the features. The auto exposure works very well. I strongly recommend getting the special \" usb cable for dji mavic pro / spark \" to connect the controller to your phone for $10.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Wow",
      "text": "Blown away, I purchased an original phantom a few years ago and had been flying and upgrading it but lately it’s been siting on the shelf because this thing is just so far beyond what that original phantom can do. It’s less the half the size and weight, includes a gimbal mounted camera and offers flight telemetry. It’s also much quieter and even a bit faster along with twice the flight time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "1st time with a drone, very easy to FLY, getting there not as easy",
      "text": "The multiple manual \"books\" are so tiny I had trouble reading them with glasses on. Getting it linked/synced and updated was confusing. I watched a youtube video because the books are hard to read. Even the video I watched scoffed at the \"books\". I have only flown in beginner mode so far, but it works great, with better than expected smooth, 1080 video. Nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott R",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Awesome drone, bad experience",
      "text": "I bought this drone after using one for work. Don't get me wrong the spark is amazing but the drone I received refused to register and was this useless. Turns out it had been reported stolen. The vendor contacted me shortly after and I returned it easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Pointer",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Great Starter Drone",
      "text": "My wife became envious of the various prospectives I could capture with my drone. I wanted to get her something similar without breaking the bank. The DJI Spark Fly More combo made it possible for her to learn how to fly a DJI drone and capture amazing photos. Battery life is poor, but you get two and additional batteries are affordable. WiFi disconnects often, so you have to make sure you fly in an interference free area.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Cooper",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Amazingly clever and easy to get up drone.",
      "text": "Absolutely love this drone. Only used my PJI P3S once since I received this. Wish it had 5 more minutes flight time, but maybe later. I have 5 batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Great Buy for Begginers",
      "text": "Terrific Drone to get started, very easy to fly and takes amazing video, more than enough for most people starting in the drone hobby. 1080 Videos and color resolution are great for most novice. Be sure to get the Fly More Combo, because your going to want to keep flying long after the first battery is depleted. Very sturdy also, wich is great for novices, I accidentally hit mine more than 4 times against walls and other hard surfaces, and it still worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Pina",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Great Pack but Bag Too Small",
      "text": "This drone is awesome. I was able to get amazing video/pictures with it the first day it arrived. However, my one complaint is that the bag included with the fly more pack is not nearly large enough to hold everything it comes with unless you meticulously place things in it. Nine times out of ten it's impossible for me to fit the propellor guards in the bag. The bag is too small. Other than that, this drone is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Shane M.",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Go with the Fly More option...",
      "text": "Fast Shipping... Another Cool DJI to add to my collection... After all the software/firmware updates, flying is a breeze... I am noticing some video latency when using my iPhone. It takes a second for the screen to refresh with turning. Gesture controls are a crowd favorite...",
      "rating": 5.0,
      "verified": true,
      "author": "Cool Ray",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Great quality drone",
      "text": "Great quality drone, user friendly to operate for someone who has never driven a drone before. Photos and videos are high quality. The set up an directions are a little confusing, but once you get past that awesome product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Fun. Easy to control. Easy to learn.",
      "text": "Overall, a great little machine. Con: The user manuals included are not legible without a magnifying glass but I found what I needed online. That doesn't take away from the machine itself though and I'm happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Don’t fly if there is any chance of a breeze",
      "text": "This was lots of fun for the 2 times we used it. But on the second flight, a light breeze knocked it off course & it lost its connection. We have spent several hours over several days looking for it with no luck. It was a very expensive toy to lose on the second go. Very disappointed that it was so easy to lose connection. No connection means no gps.",
      "rating": 3.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Great First Drone",
      "text": "This thing is amazing. Flies great, and the video quality is fantastic. If I had a single gripe, it would be the initial setup and lack of instructions when connecting a phone to the drone, the remote, and remote to the drone. Totally recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebar",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "This is a crappy product produced by a careless company",
      "text": "This is a crappy product produced by a careless company. This overpriced piece of plastic is delicate like an egg shell. And the company's customer service is run by incompetent fools. Avoid ALL DJI products.",
      "rating": 1.0,
      "verified": true,
      "author": "RickinCBAD",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Epic drone for beginners. GET FLYMORE!",
      "text": "Really Epic drone, its 1080p camera is really good and you can easily upscale the footage to 4k in post edit. Definitely get the Flymore combo else you will end up buying the kit separately. Fly more combo is cheaper and more efficient as you get a case and all the accessories",
      "rating": 5.0,
      "verified": true,
      "author": "Shubham Khichi",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "This thing is such a great little drone",
      "text": "This thing is such a great little drone. The video quality isn't 4k and that hurts a little bit, but the 1080 is beautiful and if you're not zooming in in your editing, it's great quality. The range is a little shorter than I would like it to be, but I can't complain too much.",
      "rating": 5.0,
      "verified": true,
      "author": "gschmitt",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "This thing is awesome! I love everything about it",
      "text": "This thing is awesome! I love everything about it. Granted, it's my first drone, but I've flow other DJIs. Aside from the size and portability (amazing!), You can launch this puppy quickly. So, for example, when an amazing rainbow appears and you don't want to miss it... you can be flying in under 3 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas R Lindsay Jr",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Excellent for beginners",
      "text": "Taking me some time and practice to fly efficiently but it’s so much fun. I’m glad I bought it used, it drastically brought down the price but still has the same value.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Cortez",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "DOesn't work",
      "text": "Ordered this with great anticipation. Was really disappointed that it didn't work, but ordered another right away. Again, no joy! Stay away. Very poor instructions, and terrible customer service, although Amazon responded right away with return, replacement, and subsequent return.",
      "rating": 1.0,
      "verified": true,
      "author": "Skoob",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Love the product",
      "text": "Love the product.. learning curve.. watch the you tube videos. NOT the manufactures!! Fairly difficult to get up and running. Be sure to update the firmware first!!! Before anything!!! Extremely stable and easy to fly indoors and out. Not for kids!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Spark is the best portable drone you could ever ask for.",
      "text": "Dont get me wrong, I like the features of the spark but like some other people after flying it for few times I noticed that its not the drone for me. The flight time is a huge downfall for me. I had to return it so I can just add a lil bit more to get the mavic pro.",
      "rating": 4.0,
      "verified": true,
      "author": "DiAkoPlayboy",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Powerfull little machine!",
      "text": "This the is AMAZING. what an incredible machine. I cannot believe how much this little thing can do and with very good power. Its obstacle obstruction isn't grade and the 2 axix gimbal kinda stinks, but there really isn't much bad to say about it. Get the fly now pack!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Good Drone",
      "text": "This drone is a little monster It's size doesnt imply its performances. I highly recommend this drone to anyone whose have never flown one before as also as those who need to take smooth photography knowing that there is no reason to worry about anything that might go wrong. The only cons are the battery life and the 2 axis .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Almost Perfect... and everything I wanted my Tello to be",
      "text": "The only slight downside is the camera frame rate, causes the screen to get blurry if you pan (spin) fast. Otherwise I'm very impressed... Ps. I went with the Ultimaxx aluminum travel case for the Spark and it's great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Nemo",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Fantastic, fun, easy, love it.",
      "text": "First time drone owner and I love this thing. Have had it about a month now and am getting better every flight. Have 35 plus flights at this point with just one crash into a Palo Verde (AZ Tree). The crash came around flight 31 and was totally my fault, flying sideways and I pretty much knew it was going to happen. No real damage, just scratched up the props (replaced them) been flying it easily out to a mile, just a great, fun easy to use drone.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas O Haeberer",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Love how small it is and USB rechargeable.",
      "text": "Cute little done. Love how small it is and USB rechargeable. I regret not buying a combo with remote control and extra battery. Too slow with a mobile app, harder to control and can't fly too far. Feels like it's well built and good image qualty but not 4k, not even 60 frames in 1080p. But still happy with it. Love portability! Literally​ can take it anywhere!",
      "rating": 4.0,
      "verified": true,
      "author": "Dima",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Lots of fun with precise handling and decent images.",
      "text": "Cannot praise this little bird enough. I fly professionally with phantoms - I have this one with me all the time. Love it. If you are thinking about getting this one - get the flymore package for sure. Don't use your phone use the remote.",
      "rating": 5.0,
      "verified": true,
      "author": "PunaPhantom",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Fly in an open area best experience",
      "text": "This drone dose everything as advertised. I was able to fly right out the box. It’s winter now bad weather is the only thing that stops this drone. The kids love it I like it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Fullload9",
      "helpful_votes": 0,
      "publication_date": 20190208
    }
  ],
  "product_meta": {
    "title": "DJI Spark, Portable Mini Drone, Alpine White",
    "description": "Color:Alpine White| Style:BaseSpark is a mini drone that features all of DJI's signature technologies, allowing you to seize the moment whenever you feel inspired. With intelligent flight control options, a mechanical gimbal, and a camera with incredible image quality, Spark empowers you to push your creative boundaries. Quick Launch With Face Aware, Spark lifts off from your hand by recognizing your face.[1] It takes off and hovers in place within seconds of powering on. Simple Control Take amazing aerial photos using just hand gestures, without a remote controller or mobile device.[1]Create with Ease Intelligent Flight Modes and intuitive controls help you create cinematic aerial videos with just a few taps. Edit and Share The DJI GO 4 app features automatic editing templates and an array of filters. Quickly edit videos and share them straight to social media.",
    "rating": 4.2,
    "feature_bullets": [
      "Intelligent Flight Modes Smart, reliable, and incredibly intuitive Quick Shot Videos with a Tap.",
      "Operating environment: Detects clearly patterned surfaces with adequate lighting (lux>15) and diffuse reflectivity (>20%).High-Performance Camera Amazing images and stabilized video Mechanical Gimbal Stabilization Shake-Free Shots",
      "Flight Performance Awesome potential, immersive experiences Powerful Propulsion Speed and Precision Control",
      "Flight Safety Worry-free flight in the palm of your hand ; Propeller guards are recommended when using these functions.",
      "2-Axis Stabilized Gimbal Camera"
    ],
    "specifications": {
      "Product Dimensions": "9.8 x 3 x 8.2 inches",
      "Item Weight": "1.1 pounds",
      "ASIN": "B07173X82D",
      "Item model number": "CP.PT.000731",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.2 out of 5 stars1,338 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#56,931 in Toys & Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 24, 2017",
      "Manufacturer": "DJI Europe B.V."
    },
    "categories": [
      "Hobbies",
      "Toys & Games",
      "Remote & App Controlled Vehicles",
      "Remote & App Controlled Vehicles & Parts",
      "Electronics",
      "Quadcopters & Multirotors"
    ],
    "price": 349.0
  }
}