{
  "website_summaries": [
    {
      "verdict": "A top notch travel tray with a sturdy base, extra high walls, and raised front lip to keep snacks, drinks, toys, and drawing supplies from rolling off.",
      "pros": [
        "Firm surface doesn't sag or bend under pressure",
        "Side walls are taller and sturdier than most others",
        "Mesh pockets hold snacks, knick knacks, or coloring supplies",
        "Tablet strap can also be used to hold bottles or sippy cups in place",
        "Spill-proof and easy to wipe down",
        "Cushioned base for comfort"
      ],
      "cons": [
        "A few extra storage compartments wouldn't hurt"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very pleased",
      "text": "My three-year-old love this! I am buying another for my younger two-year-old. It is very sturdy, and The edges keep things contained.",
      "rating": 5.0,
      "verified": true,
      "author": "Mutchler Family",
      "helpful_votes": 92,
      "publication_date": 20170208
    },
    {
      "title": "Loved these!",
      "text": "Loved these!! I bought two with overnight delivery for a long road trip, praying they'd work out. They did! I saw questions about rear-facing car seats and let me tell you they worked great. My two year old twins enjoyed coloring and playing on them and we enjoyed them having something to do!! They snapped on and off so easily and store perfectly!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lara Copello",
      "helpful_votes": 40,
      "publication_date": 20170802
    },
    {
      "title": "Great for road Trip!!!",
      "text": "Took a 3500 mile road trip with our 19month old and this came in really handy. Granted, me and my mother in law were in the back seat with her, but she liked it for about 30m-1hr increments. Then she got bored and wanted to kick it off. I think as she gets a little older she'll appreciate it more. Note, you have to have a car seat that is not very reclined or it will not be level and crayons / whatnot will slide down next to your child, causing frustration. Especially if not back there with them. Overall great quality and adorable print!!! Love all the pockets.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 41,
      "publication_date": 20170624
    },
    {
      "title": "Product pictures are misleading",
      "text": "I hated this, it shows a child playing, eating and watching an iPad. It is not sturdy enough to hold anything up. It tilts and everything falls no matter how tight it is.",
      "rating": 1.0,
      "verified": true,
      "author": "Garrett Lyons",
      "helpful_votes": 17,
      "publication_date": 20180313
    },
    {
      "title": "Zipper broke immediately",
      "text": "Zipped up the tray, which was honestly not easy. set the tray in front of my son to test it out and the zipper immediately broke, unwound all the way around the item due to the deep fold in the siding. Very bummed as we have 7 hours on a plane tomorrow.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 8,
      "publication_date": 20180627
    },
    {
      "title": "Very harsh chemical smell !!!!",
      "text": "This item has a very strong chemical smell ,contacted support and explained the situation I was told Please Click few pictures of the defective item from different perspectives and send them to us. No wonder why there procducts suck .",
      "rating": 1.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 8,
      "publication_date": 20180523
    },
    {
      "title": "Junk!",
      "text": "These trays are junk... they didn’t make it 4 days into our two week road trip before one ripped (as shown in the picture) and the other one’s buckles stopped clipping. My husband had to pull and tweak them to make them stay clipped in. They are also not as rigid as I expected. I’d give them 0 stars if I could! So disappointed and it’s not like they are a $5 dollar item!",
      "rating": 1.0,
      "verified": true,
      "author": "trueblue311",
      "helpful_votes": 6,
      "publication_date": 20180712
    },
    {
      "title": "Awful Chemical Smell, Do not wash!",
      "text": "I wanted to love this, it is the perfect size for snacking/coloring inside or in the car seat. The only problem was the strong chemical smell. It was almost like a smoker smell but worse, gave me an awful headache-no way my toddler could handle it closed up in car. I thought I could just clean it so i tried wiping down-no go. Tried it in wash on delicate cycle-the vinyl on front tore everywhere. So if you get one with the smell please dont try to clean it, now I cant even return. Everything else about product was perfect, now im looking for a similar one that will hopefully not have the smell.",
      "rating": 1.0,
      "verified": true,
      "author": "Christy S",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "We love DMoose! Update- great service",
      "text": "Two autistic boys and a baby We LOVE this. It has everything we need is washable, durable and the kids just said they love it, including by signing! So, take it from a mom of 5 it is the coolest thing. We also bought the backseat organizer Dmoose makes as well. In my Sonata this just made life so much easier and less spills. Thank you DMOOSE. WE LOVE YOU! UPDATE: I have 3 of these and 1 had an issue with the zipper, I contacted D Moose and they are sending a NEW one. They stand behind their products, so glad!",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda H.",
      "helpful_votes": 8,
      "publication_date": 20170227
    },
    {
      "title": "Zipper fell apart after an hour of use",
      "text": "I really wanted to love this product, and did for the first hour of use. I bought this before a road trip with my two year old. It was sturdy, fit well on my son's car seat, and he didn't mind it being there. Unfortunately, there is no stopper at the end of the zipper, so the zipper pull fell straight off. The entire zipper then unraveled, and we can't find the zipper in the car. So there goes that.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20171012
    },
    {
      "title": "don't waste your money",
      "text": "The zipper kept unhooking, it's fabric and not washable, don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 10,
      "publication_date": 20180103
    },
    {
      "title": "Smelly product, but amazing customer service",
      "text": "*** edit*** while this product may have missed the mark, customer service definitely didn't. It sounds like my product was a fluke and customer service has done everything to make it right. I will definitely order products from this seller in the future. This product came and it literally reeked of stale cigarette smoke. It smells like it's been sitting in a 10 packs a day smokers home. The tray itself seems like a great product, but I just don't feel comfortable letting my son use this with how horrible it smells. I've tried multiple cleaning products and nothing has gotten the smell out. So I ended up tossing it.",
      "rating": 4.0,
      "verified": true,
      "author": "AMFKentucky",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "The worst part, though",
      "text": "I saw another user had the same issue - this came in two pieces, the piece that zips to the bottom was cheap and flimsy so even after I zipped it, it started to come undone from the beginning of the zipper. The worst part, though, is that it was too big/bulky to fit in my son's lap in his car seat. It wouldn't fit over the arms of his car seat and it wouldn't fit under them unless you tried to shove it and then it was almost sideways. I will definitely be returning this for something more worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexander W.",
      "helpful_votes": 8,
      "publication_date": 20170713
    },
    {
      "title": "Horrible Smell",
      "text": "I was trying to find a travel tray for my son when we go on an airplane next month. I read the reviews of this product and felt pretty mixed on if I should get it or not. I decided to try it and the second I opened it I noticed a horrible chemical smell. I aired it out for about a week with zero change in the smell. It was awful, and there was no way I would have my 19 month old sit with that on his lap during an entire flight. Luckily I could send it back for a refund, but now I'm back to square one trying to find a lap tray.",
      "rating": 1.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "Poor Quality",
      "text": "So disappointed! Tried to put this together and the zipper broke immediately. Very poorly made. We leave in 2 days and I was looking forward to using this on the plane ride! ARGH! Very frustrating! Update - the company was great at getting back to me and offering a one day shipment since we needed it quickly. Unfortunately, it's just too late in the game, and I'm weary that another zipper will break. Fact of the matter is, I shouldn't have to worry about a zipper breaking on the first try - so I went with another product.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 7,
      "publication_date": 20170622
    },
    {
      "title": "Not so useful",
      "text": "I bought these as a present for a friend of mine that has triplets. After a week of use, she told me that she had trouble with it slanting downward and everything ended up on her kids stomach. The kids couldn't eat or snack on it without getting food all over their clothes and the kids are 4 years old. Not happy with the product for the price I paid.",
      "rating": 2.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 5,
      "publication_date": 20170727
    },
    {
      "title": "Updated review: AWESOME customer service and product",
      "text": "I initially reviewed this product with three stars because the tray I received was torn but I couldn't return it because I needed it for a long drive the day after I received it. After my review, the business contacted me pretty immediately and was so nice. They sent me a new tray which I have had no problems with. The product itself works perfect for my two year old. I'll be purchasing another one for my other son.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180915
    },
    {
      "title": "A Road-trip Must Have!",
      "text": "We just took a 10 state in 14 day road trip with a 5 year old and 3 year old that included 67 hours of drive time! I bought two of these travel trays and they were a life saver! The kids were able to do puzzles, color, play topys, do workbooks, watch iPad, eat and more on these trays with no problems. They are very easy to put around the kids and to remove. Perfect size and very sturdy. The elastic bands and small pockets are a nice touch. I would recommend these to a friend or anyone who will be spending a lot of time in the car with kiddos.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Ivey",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Came in Handy.",
      "text": "We used this for my toddler on a recent roadtrip and I have to say, it really came in handy. She used it to color, play games, and eat her snacks/meals. My only complaint would be that I wish it was made just a bit sturdier. It's basically a thick cardboard that's wrapped in fabric, or that's what it feels like to me, and sometimes when we put it across her carseat it would bend/slant funny so her stuff would roll either off or to one side. Overall though, it really helped us out in keeping our toddler entertained.",
      "rating": 4.0,
      "verified": true,
      "author": "mommyO4",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Not sturdy enough",
      "text": "I love the concept but it's just not sturdy enough. The zipper comes apart from the tray while in use . The bottom tray area is too flimsy to hold mich. I put a kids camelback water bottle where the image above shows the ipad and it's too heavy to hold. I returned",
      "rating": 3.0,
      "verified": true,
      "author": "JenRanz",
      "helpful_votes": 4,
      "publication_date": 20171218
    },
    {
      "title": "Little big for our carseat, but good product",
      "text": "Super easy to use! In general this product was perfect for what I was using it for and will continue to be useful! It was a bit big for my childs carseat which made it bow a little when she was using it. And because it was big it didnt keep her small toys contained very well! But still worked! My daughter loved playing with the little mesh pockets! Easily cleaned also.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica follin",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Smells like Chemical Smoke",
      "text": "Like some other 1 star reviews, I agree that this product smells like smoke or chemicals. The table base is what smells the most and it's rather heavy, I thought it would be made of just cardboard inside but it's something else. I aired it out, but the smell didn't go away. I am very bummed that this product didn't work out for us, I really wanted to love it. We never used it because of the bad smell, so I'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicky",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Don’t buy.",
      "text": "This thing was so flimsy and unusable that I threw it away after one trip. It relies in your kid’s legs to prop up, and if your kid is short like mine it tilts to the point where everything goes sliding to the floor.",
      "rating": 1.0,
      "verified": true,
      "author": "marymin",
      "helpful_votes": 3,
      "publication_date": 20180902
    },
    {
      "title": "Not perfect but still convenient to have",
      "text": "I like this thing a lot, but it does flop around a little, especially with a squirmy toddler underneath. I can prop it up on my kid seat and tighten it well but inevitably it CAN be pushed over or toppled with the right motivation/tantrum. The elastic straps aren’t super tight so don’t expect it to securely hold anything on a tight turn or rough terrain, but it is fun for my kid to sort things while traveling.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "2 years old and going strong",
      "text": "I got this tray almost 2 years ago and it's still in great condition. It's been fabulous for my daughter, even on short trips around town. Installation is easy, just wrap the strap around their back while in the car seat. Fasten them into the car seat first. I had no issues with the item right out of the packaging. I don't recall a strong chemical odor with mine but it has been a while. I will be getting my daughter a new one with the standing sides eventually. This has been a great product for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Talia",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Happy traveler!",
      "text": "This wonderful car seat tray is so great I ordered a 2nd one for another family member. My grandson loves his tray, puts little toys snug in elastic straps on edge. Puts his drink in another strap and plenty of space for a car or 2 and a book. It provides a large space for his enjoyment and clean area for his snacks. He likes all those little “compartments” to hold his “stuff!” Every toddler should have this tray. Another plus it enables toddler to be preoccupied with things to do making their car experience more enjoyable. I first bought it for our first long 400 mi trip. It was a blessing. Now it’s used daily.",
      "rating": 5.0,
      "verified": true,
      "author": "R Yull",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "So much for the excitement",
      "text": "I am seriously livid and disappointed in this product. I got just the bottom part of the tray. I did not come with any additional attachments though instructions state to zip two pieces together. I was excited about this product; however, after receiving part of product and requesting one day shipping this makes me very hesitant to order again. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Emmaily Reynolds",
      "helpful_votes": 2,
      "publication_date": 20190120
    },
    {
      "title": "Better for front facing upright seats, needs a way to keep it from flipping up",
      "text": "Really liked this overall. Easy to clean and attach to the car seat, significantly reduced the number of stops we had. Our daughter was 11 months and already feeding herself, however she was rear facing so it didn't work quite as well as it would with a front facing seat where the child is more upright. My biggest recommendation would be to add some sort of strap/loop etc that can connect to the bottom of the car seat to keep them from being able to flip it up. At one point my daughter gave it a swift kick and the tray came flying up, food went everywhere.",
      "rating": 4.0,
      "verified": true,
      "author": "Jared H.",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Great Service and great product!",
      "text": "Excellent customer service and a quality product. I received a only a partial product on my initial delivery, but the seller was very responsive and sent me a replacement at no cost and with no hassle of returning the partial. I received the full product quickly and it has worked wonderfully on a road trip with our 5 year old. It was easy to hook up to her booster seat and it was very easy to clean. I will be buying a second one for our toddler.",
      "rating": 5.0,
      "verified": true,
      "author": "leaf dance",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Definitely Not Flimsy and Perfect For Car Ride",
      "text": "I purchased another similar product from a different maker and returned it bc the sides were flimsy. This one was 100% better and contained all of my daughters toys and her snacks. My daughter is 3 and we don't bother strapping this around her car seat. She does just fine holding it in place or rather it just stay in place based on the angle of the car seat. It's perfect for playing on as well as snacking. Definitely recommend this for long trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine Irvin",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Loved this product",
      "text": "I used this for my two year old but I don’t recommend connecting it while driving or you May have to stop to take it off. The bottom would be better if it was a little bit more sturdy for a younger age group. He freaked out when he could t get it off until I could finally pull over. I just sit it on him and he throws it off when he is done. The zipper came apart at the end but we just redid it and it went back.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Really bad smell",
      "text": "I wish I read the reviews better. It had a horrible smell like it'd been in a smoker's house/car and covered with perfume. I decided to search the reviews after the fact and apparently it's just the product. I had it sitting next to me for about 20 minutes on my desk and it was giving me a headache and making me lightheaded. No way I'm using it for my child.",
      "rating": 1.0,
      "verified": true,
      "author": "britta arnold",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "I really dislike the cup holders",
      "text": "It's ok.... I really dislike the cup holders.. the \"pockets\" on the side i are pretty much useless. The actual tray part is good, nice and sturdy. I bought this for our first long road trip with our son he loves to play with his cars / tractors on our rides and the flat surface worked well for that. I think if they changed the pockets and the cup holders i would love this tray.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 4,
      "publication_date": 20170925
    },
    {
      "title": "I definitely recommend this tray!!!!",
      "text": "We used this for traveling in the car seat. He played with toys on it, he colored on his aquadoodle, and we even provided meals/snacks on it! I'd definitely recommend this tray! This is my 18 month old in the picture and it worked great. It's very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory Lynn",
      "helpful_votes": 4,
      "publication_date": 20170805
    },
    {
      "title": "Not stable & doesn't fit with carseat.",
      "text": "I really wanted to like this for my son, however, I can only give it 3 stars. This tray blocks his cup holder for his Graco carseat. That wouldn't be a problem normally, but the tray doesn't sit flat in order to place his sip cup in it securely. Also, when putting his tablet in the tray like the pictures from the company show, it weighs the tray down and bends it away from my son. We securely attach it to him, but this still happens. We bought this to use on our 10 hour drive for the holidays and unfortunately, he only used it for the first hour or two on the first day. :-(",
      "rating": 2.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Life saver for long trips!",
      "text": "This was a life saver! We went on a long trip out of state and this tray kept my almost 2 year old entertained the whole ride. He loved it! We have a 10inch tablet with the kids cover and it fit great. We also have the Chicco Next fit zip car seat, it very wide and I was worried the strap that goes around the car seat wouldn't be long enough, but it was just the right size. I did make a big mistake and it ended up in the washer by accident. Destroyed the tray in the process. I will be ordering a new one asap, this tray is definitely a must have!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhi",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "So useful! Kid loves it!",
      "text": "My daughter was hesitant at first, but now she tries to pull it onto herself as soon as we get in the car. I like how now I don't have to pile toys, her snack cup, and worry about her sippy all falling while I'm driving. I also like the little bit of \"give\" it has in case of an accident. Easy to clean, too. Over all, out of all the products like this I definitely believe this was the best choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "you NEED this",
      "text": "If you have kids in a car seat, you need this! I don't plan on using it everyday but it really helps for the long trips! Let me paint a picture for you. My husband recently had to drive 9 hours with our 2 year old ALONE. He set her up with toys, her iPad, snacks, etc. She loved this thing! He didn't have to try and reach back to find something because of all the pockets. It's truly great and I'm so glad we have it for future trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Not universal product",
      "text": "I tried this product on two different types of car seats and at the highest setting it did not fit around my car seat. My daughter hated it because it pretty much suffocated her when you stretch it to fit. Hate this product, advertised to fit all and it doesn’t fit almost.",
      "rating": 1.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "I have a Chicco Nextfit carseat which is pretty wide. I've had a different tray in the ...",
      "text": "I have a Chicco Nextfit carseat which is pretty wide. I've had a different tray in the past which essentially sat on my daughter's lap because it was not wide enough. This is the perfect size as it can sit on either side of the carseat for support. I only wish they had bags for goodies on the sides that I've seen on other travel trays.",
      "rating": 4.0,
      "verified": true,
      "author": "SCLD123MD",
      "helpful_votes": 2,
      "publication_date": 20180409
    },
    {
      "title": "Good",
      "text": "I bought 2 of these. 1 for my 2.5year old and 1 for my 4 year old for a 19 year trip. Both kids like using them. We have Graco car seats with cup holders on right side. The trays get in the way of the cup holder. The pockets on the tray do not hold sippy cups. They do fit small toys, crayons and 1 ounce paper cups well. The base is very flexible. I bought 2 plastic trays from the dollar store to make meal times easier. I would recommend this to anyone traveling with toddlers.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Brooks",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Wouldn’t recommend this product",
      "text": "This was the second one i bought. The first one came missing a piece and this one has a broken zipper. Wouldn’t recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "NMC ",
      "helpful_votes": 5,
      "publication_date": 20171121
    },
    {
      "title": "Not great for rear facing",
      "text": "Bought this to use on a road trip with my 2 year old, who is currently still rear facing. Even at the least incline in the car seat (Graco 4ever), the tray was at such an angle everything on it ended up in his lap. Otherwise it seems sturdy and well made, so I will hold onto it until we're forward facing and try again.",
      "rating": 3.0,
      "verified": true,
      "author": "Alli D.",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Would recommend",
      "text": "This came in very handy for our 16 hour road trip. What I liked- easy clean. mini wall by our daughters belly kept most snacks at bay. Held her iPad mini up with the elastic strap and the strap seems like it had more give. Ultimately really like almost all of this tray. What I did not like. The elastic mesh pockets didn’t do much of anything, which was fine that’s why we had the car activity basket. The biggest frustration was the zipper part. It has a removable wall which is great for cleaning, but it would pull apart a lot, when not in use. Otherwise it was perfect for us!",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany Bentivegna",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Nice, sturdy tray!",
      "text": "This is my second toddler tray purchase, although it was for an 8 year old. I bought one for my 3 year old granddaughter and it was so great for her to play with toys on, color and eat a snack. I decided to get another for her brother because it makes long car rides so much easier. It was very simple to put together and it is quite sturdy without worrying about it being too hard in case of an accident. The sides are sturdy enough to keep the iPad up enough to see. Definitely a great purchase. I would highly recommend this tray.",
      "rating": 5.0,
      "verified": true,
      "author": "bella",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Other than that I think the kids are going to love them.",
      "text": "Very excited to try these with our 3 and 1 yo for our 17 hour car ride. Ordered at the exact same time and got two different models. One is a 2017 and one is 2018. The newer one has a little cushion and the 2017 doesn't. I would have given a 5 star but i ordered them from the same page at the same time and basically got two different ones. Other than that I think the kids are going to love them.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "My kiddo is obsessed",
      "text": "We love this product! Our little is obsessed with it, actually. He loves the pockets where he can organize his toys. I love that you really don’t have to buckle it on to get it to stay; it is sturdy enough to sit on his lap and hold his tablet, toys, and snacks. With that said, it’s still a flexible surface. The reason for the four stars is that it covers the cup holders which is a little inconvenient, but we can work around it.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Awesome product. Great for keeping kids engaged during long drives",
      "text": "I recently came across this type of product and ordered this. This keeps my toddler engaged for a 1-2 hour drive. He would constantly cry or demand nursery rhymes on the phone. This helps me keep him occupied and avoid screen time as well. Great product and good value for money. We bought the animal print version and my toddler loves looking at it and pointing at the animals.",
      "rating": 5.0,
      "verified": true,
      "author": "kindle reader",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Good for Travel",
      "text": "Worked well for our super long car ride with our two and a half and our one-year-old. Great for snacks or propping up the tablet for a movie. Easy to wipe clean afterwards, but a bit large for storing in the car between trips. It is worth mentioning that we ordered two different patterns and they were made differently and had different material. Both still worked well, but worth mentioning.",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsea Gross",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Great for road trips",
      "text": "Great tray overall and a huge help on road trips. I have a Graco convertible car seat and it's a little wider than the inside f the car seat, so in order to rest on my daughters lap to color or anything it bends in the middle. When she is older and her legs are bigger and reach up higher it should be ok, or I put a pillow on her lap, but overall it's a life saver on road trips!",
      "rating": 4.0,
      "verified": true,
      "author": "MamaG",
      "helpful_votes": 2,
      "publication_date": 20170414
    },
    {
      "title": "Really nice product.",
      "text": "Went on a 12 hour road trip. They were really helpful keeping my two boys occupied with their coloring, eating and playing with toys during the trip. Great product. I liked it so much I bought two. I was nervous at first so I had bought one first then was pleased. They also sent a 10% off next purchase which helped too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Updated...",
      "text": "1/2019 I bought 2 of these and one zipper broke on the first use on a 14 hr road trip with my 2 and 4 yr old. 2/2019 company saw my initial review and offered a refund or replacement. I chose replacement since the other one I ordered is in great condition. I received the replacement in 2 days and so far it looks good.",
      "rating": 4.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Zipper broke first use",
      "text": "The zipper broke on my first use. I bought it a few months ago though, so I'm sure I can't return it anymore. I bought it to go on a trip we cancelled, so I got it out a few months later for a day we'd be spending a lot of time in the car, and straight out of the plastic bag, I tried zipping it and the zipper broke. :( Seems nice if it worked",
      "rating": 1.0,
      "verified": true,
      "author": "Kayla Patterson",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Awesome product with one downfall",
      "text": "The cup holder is too far from the front, so my 3 yo can't reach her cup when it's in place. The slots around the sides are basically useless. If the slots closest to the child were larger, it would be perfect, but I can't fit her cups in those. Otherwise, it's great for road trips or allowing your child to eat a meal in the car. Easy enough to buckle into place. My daughter loves using it, too.",
      "rating": 4.0,
      "verified": true,
      "author": "brookelshay",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "AMAZING Travel tray",
      "text": "This is the best travel tray ever! We travel A LOT. We’ve had other trays that were flimsy or washable or say they are sturdy, but nothing compares to this. My kids (4 & 3 years old) are obsessed with them. I intended them for trips but they use them everyday for everything from reading to snacks to coloring to magnetic blocks, etc. I love how the side zips on because it makes it very portable. We fly and rent cars frequently both domestically and internationally and I can put it flat in my suitcase and use in the rental car. I HIGHLY recommend this travel tray.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Not 100% satisfied",
      "text": "The base is not as sturdy as I was expecting based off of other reviews. I'm hoping it can withstand my 2 year old playing on it. Just a minor complaint, the wall is kinda of bent after putting it together. The top of it kind of puckers out from being folded. Hoping that will correct itself after it settles some. Lastly, we have a Britax carseat. I'm not 100% convinced that it is going to work well with the carseat but I think we will be able to manipulate it enough to serve its purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "David Diesel",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Awesome!",
      "text": "These are great! I have twin 5 year olds & a 7 year old. These are perfect for trips. Gives them a place to play or even just resting the tablet instead of holding it while playing. I have 3 booster carseats (with high backs & arms rests) side by side & the trays have plenty of room.",
      "rating": 5.0,
      "verified": true,
      "author": "angellynn",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "how to buckle in?",
      "text": "My husband and I cannot figure out how you are supposed to buckle this and there were no directions. Is this supposed to go around the entire car seat? We have had several car trips and hoped to use this but cannot figure how how to hook it or make it stable. Plus, none of our cups fit in the holders, unfortunately. It is definitely made well, but could use more directions--please help!",
      "rating": 3.0,
      "verified": true,
      "author": "Lacey B.",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Sturdy",
      "text": "I've bought from this company/brand before, and got the 1.0 again this time. It seems to have been modified and is a sturdier base and sides than the first two I bought. We've not used it in the car yet, but the others that I have work wonderfully and I have high hopes for this as well, especially as it seems even more well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Good tray :)",
      "text": "The travel tray is awesome, but unfortunately I didn't get the one I ordered. We really wanted the 2.0 grey for the extra pockets and storage, but we received the smaller black happy birthday tray. They did give me a small refund, but I really would have loved to have the one ordered",
      "rating": 4.0,
      "verified": true,
      "author": "Raven",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Road trip life saver !!",
      "text": "We bought this ahead of a 12 hour trip with our 1.5 year old. And it was the best thing I could've done. It's very easy to snap around the car seat. And easy to unsnap to get the kid out. It's adjustable. It did wonders keeping her occupied playing in the back seat, with coloring books, books, and toys. And then when we stopped for snacks or a quick drive thru meal, it was very nifty as a food tray for her to eat on. I would recommend to anyone with a kid in a car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "MommaBearLenson",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Makes car rides a quieter, happier experience",
      "text": "My daughter is one and gets bored in her car seat. She has never been a fall asleep in the car kind of a kid. More of a, what in the name of all that is evil, is this death trap contraption you have put me in?!? So this tray has been very helpful to keep her occupied. I put a few toys on it and even after she has thrown most of them over the side, she still finds the pictures on the tray interesting. All in all a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara E Hughes",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "The pockets and bands around the tray are perfect for holding small items",
      "text": "\"\"This is exactly what I needed for my grandchild's car seat when we take our family vacation. It is a 6 hour drive- tray gives her plenty of room to open a book or a coloring book, put together a small puzzle. The pockets and bands around the tray are perfect for holding small items. I received the tray quickly and highly recommend it and the seller! Thanks. I would not hesitate to buy DMoose products.",
      "rating": 5.0,
      "verified": true,
      "author": "J. S. Watts",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Pleased!",
      "text": "Very pleased! Fits our Britax and 3yo well! He's a wild thing but this helped keep him entertained for a while on our 7+ hour car ride. Seems very well made and looks easy to clean!",
      "rating": 5.0,
      "verified": true,
      "author": "kathryn",
      "helpful_votes": 6,
      "publication_date": 20170429
    },
    {
      "title": "It was okay.",
      "text": "It wasn't as sturdy as I thought, even after reading some of the reviews. It was a good size and was usable for the purpose, but I thought it would be more sturdy. Not sure if worth the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa C.",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Base not as sturdy and supportive",
      "text": "The base was not sturdy and supportive for the kids to color on and work on anything which applies pressure. They also need to be secured around the carseat which makes it difficult for the child to remove and secure by themselves.",
      "rating": 2.0,
      "verified": true,
      "author": "MelElizabeth",
      "helpful_votes": 2,
      "publication_date": 20180321
    },
    {
      "title": "Best travel tray I've found",
      "text": "By far the best car seat travel tray I've tried. Easy for older kids to put on/ take off/ adjust on their own, plenty of ways to keep their supplies and toys organized and within reach. Substantial flat area works well with 9\"x13\"cookie sheets (to use with magnetic blocks, letters, etc.) and sturdy enough to withstand them pressing crayon to paper for coloring.",
      "rating": 5.0,
      "verified": true,
      "author": "silver lining",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Perfect for Toddler travel",
      "text": "Purchased this for not just-turned 2 year old for a 7 hour flight. Complete life saver. I brought his car seat on board and because the airline tray will not reach him this allowed him to play, color, snack, and watch his iPad without me chasing falling objects every 2 seconds. He likes to place items in the pockets and take them out. Over and over. This should be perfect for road trips as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Samson",
      "helpful_votes": 2,
      "publication_date": 20171219
    },
    {
      "title": "Great pattern - excellent quality!",
      "text": "I am so impressed with this item! It is very sturdy and constructed very well - nothing cheap about it. I got the color labeled “blue” which has zoo animals and dark blue piping. The stock photo does not do it justice - it is such a cute pattern! This will make long distance and even normal travel so much easier, cleaner, and fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree N Pozzi",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Great product functional and adorable!",
      "text": "I purchased an inferior version of this product from a discount online site. Wasted my money it sagged and fell apart after a couple uses. My 3 and 5 year old will be going on their 1st road trip soon so I bought these. Tested them out recently and I'm very satisfied. They are sturdy enough for light activities like drawing and held up well during lunch in the car. Design is simple but enough of a variation to please a boy and a girl. Don't look further buy this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Meshelle",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "This is a very good tray. We have a son and daughter side ...",
      "text": "This is a very good tray. We have a son and daughter side by side in the car with this trays on. It's big enough for kids to eat, play, and yet small enough to fit within the size of car seat. The only problem we faced was that clips on the strap are NOT interchangeable; we purchased one pink and one beige version, and clip for pink does not work on beige, vice versa. In the middle of Kids Chaos, I accidentally mixed up those straps and took a while to understand why it's not working...",
      "rating": 4.0,
      "verified": true,
      "author": "RIC",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Roadtrip must have!",
      "text": "This tray has allowed my son to play with play-doh, trains, cars, puzzles, coloring books, you name it on 4 road trips of 8 hrs so far. It's also great for snacks. The tablet holder part doesn't work so well mainly because of how his knees sit in his carseat, but that isnt a concern for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack's  Mom",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Good product, great customer service",
      "text": "I bought this for a road trip for my son. It came with a missing clip. When I emailed the seller they immediately sent me a new product, which is why I am giving it 5 stars. My son loved it. My only complaint is that it would be nice if it had a lip of some sort nearest the child so that snacks and small toys did not slide off and disappear in the carseat/under my son's legs. I think this may be less of a problem as he gets older.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Happy Kid, much happier ride.",
      "text": "After 9 hour long car ride our 2 year old loved the travel tray, more so for keeping her items at bay and within reach than anything else. As with all toddlers for whatever reason we love playing the \"drop it\" game and you cannot keep picking things up in the back seat, this keeps those much loved small pencils, crayons, puzzle pieces right within reach and no more travel meltdowns. Happy Kid much happier ride.",
      "rating": 5.0,
      "verified": true,
      "author": "DemButlers",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Two incorrect orders",
      "text": "Not real happy with this company. I ordered 2 different trays for my two kids and the first one came with JUST the tray, no sides or strap to hang it on the carseat. Second tray came and was made incorrectly. They put the same side velcro on all 4 spots so nothing sticks to each other. Tired of receiving wrong orders...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "... around my daughter's Safety First car seat and was easy to install",
      "text": "It fits well around my daughter's Safety First car seat and was easy to install. The only change I would make is instead of having the four small pockets on the sides, I would make them into two larger pockets. The way it's made now you can't really fit a lot into the side pockets. I was able to put a couple crayons in one and her sunglasses in another. Anything wider than a raisin box is a struggle to get in and out.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer D.Top Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "It came dirty and smelling bad",
      "text": "It came stained and smelling horrible. You can see as I wiped it down how dirty it was \"new\". The white characters were tinted yellow from who knows what. Super disappointed we can't use this on our trip tomorrow.",
      "rating": 2.0,
      "verified": true,
      "author": "ewade",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Versatile Travel Tray",
      "text": "We bought this to use in the car and also when we were camping. It has worked wonderfully! We can use it in the carseat, as well as on camp chairs, or just about anywhere. It is easily cleanable and holds up well. The design is cute and my daughter loves to use it. I love that I can take the sides off for ease of packing if I need to. All around great product!",
      "rating": 5.0,
      "verified": true,
      "author": "HEIDI Y",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Perfect for Travel with Kids",
      "text": "I bought this for my 7 yo daughter when we traveled to Florida by car for 14 hours. At first, she complained that it was for babies when she saw it. After using it in the car, she was very impressed and loved it! She can color in the car without her crayons scattering. She can eat without having to precariously balance her food on her lap. It comes on all our car trips now. I can't recommend this product enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "DMoose travel tray - success.",
      "text": "I bought this for my 4 year old granddaughter. We have not had a chance to try it in the car but she loves using it at my house to color. I assume she will like it just as much in the car. The zip on border was easy to install and the lap piece seems sturdy. There have been comments about the size of the side pockets. They are a bit short but everything (crayons, markers, etc,) stay put. I got the pink one which is not obsessively pink but pleasant and cute. The strap that goes around the child is adjustable. This would make a good toddler gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluesky5553",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "I like the quality",
      "text": "I'm actually a little shocked at how much my son (2.5 years old) loves this tray. I bought it for a recent road trip, but he wants me to put it on every time he rides now. He drives his trucks on it, eats snacks on it, and likes to point out the little pictures printed on the tray. I like the quality, it seems really nicely made and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "E.",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Returned",
      "text": "I purchased two of these; unfortunately, I had to return both of them. They smelled like smoke and a heavy perfume. :(",
      "rating": 1.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 4,
      "publication_date": 20190401
    },
    {
      "title": "This is a great item. Have really enjoyed it",
      "text": "This is a great item. Have really enjoyed it. Used it with my two children for a few days of driving. They were able to use it to work on, color on and to put their food and drinks on. It was very versatile and my children absolutely love it. Will be investing in another one or two in the near future and would definitely recommend for anyone who is looking for a tray for travelling.......",
      "rating": 5.0,
      "verified": true,
      "author": "Tam P",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Just what we needed",
      "text": "When searching for something my daughters could use to support a portable DVD player, food, coloring books etc. for a long multi state road trip. I came across this and decided to purchase it. We are very happy with these (we purchased 2). They filled our needs and we highly recommend one to any parent with a young child. We will continue to use these for quite a while. They are easy to install, clean and comfortable. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "M S.",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Easy to install and clean good buy.",
      "text": "This little portable light weight desk is awesome not only in the car but also at home. My kid loves to set up a play area on the desk and moves around the house with it. The quality and durability are well worth the price. Also, easy to install and remove. Glad I found this on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Lupe Ramirez",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "So glad I bought this",
      "text": "I’m soooooo glad I bought two of these for my boys before a road trip. They were easy to attach, and held their iPads and small toys and loose cereal. The tray bends somewhat, so I am deducting one star. However, for the price, they were perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Mary",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "This is great for all kids",
      "text": "My daughter is 7. She doesn't use the straps and loves these. It gives her a table in the car and her toys, crayons and other things don't run away from her. They don't fall on the floor. She can reach everything and feel independent in the back seat. This stays in the car for her at all times..",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Would pass on this one...",
      "text": "Quality was not what I expected. Also not very easy to clean off considering it’s for small children.",
      "rating": 2.0,
      "verified": true,
      "author": "BMurph",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Great for car rides!",
      "text": "Love this! My daughter is constantly tossing toys off of her car seat and then gets all upset when she can’t reach them anymore. This helps contain some of the toys. The only bummer is that it’s so big, it blocks the cup holders on her car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "The size is perfect and it's light and flexible",
      "text": "This is exactly the tray I needed for long road trips. The size is perfect and it's light and flexible. When my kiddo is done with It, removing it is as easy as unbuckling the strap. Glad I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "ladymeli",
      "helpful_votes": 3,
      "publication_date": 20170529
    },
    {
      "title": "Great for travel",
      "text": "We've used this multiple times for long car trips. It's great. It fits comfortably on my daughters lap, she can keep crayons and colored pencils nearby and she can use the \"table\" for coloring, reading, etc. She loves it. I highly recommend it for anyone going on a lengthy car trip.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Jacobs",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Wonderful item for the car - keeps our toddler organized and entertained!",
      "text": "This is a great item! I purchased when we were planning a long car trip with my granddaughter. We ended up not taking the trip, but we keep in the car for running errands etc. My granddaughter loves it so much, she even carries it around the house and sets it in her lap! Love that this brand has the strap for and ipad - this has come in very handy!",
      "rating": 5.0,
      "verified": true,
      "author": "PamelaH",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Major Design Flaw - lasted a week",
      "text": "Worst design, ever. The entire \"lip\" that goes around the table is zippered together & not even by a heavy duty type zipper. I've used 4 times and it has separated twice. So you have to unzip the wrong way aaaall the way around to get it off. Which is near impossible bc it's not meant to move that way especially after the two sides disconnect. This time it refused to budge causing teeth to break off and jam. Completely useless. It's now trash. Thanks for the 2 hours of $22 table usage.🙄👎",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Easy to use, inside and outside of the car!",
      "text": "I just received this yesterday. My plan was to use it while I was driving the little one, who is just over two, around town and on longer travels as well to keep all his stuff from falling all over. I took it out of the packaging and my son couldn’t wait to use it. He’s using it inside the house too. It was easy to assemble, one zip and it looks great. I cannot wait to use this while we are out and about. Also, the DMoose customer service was great!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay M.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great lap tray- wish it fit all car seats",
      "text": "I loved this travel tray for our 6-hour road trip! It fit my son's Diono Radian RXT perfectly, and he used it a majority of the time for coloring, eating, etc. It did not, however, fit my daughter's Graco MySize 65 very well. But I realize some seats are going to fit the tray better (the graco sides come up higher, which causes it to come up too high on her body). This is an ideal tray for a narrow seat or booster seat. Very sturdy and functional!",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly Adams",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Great addon for a car seat!",
      "text": "This is perfect for our toddler in the car. Can put food or activities in his tray and keeps him busy. Also when he does get messy cleans out very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Kewing75",
      "helpful_votes": 4,
      "publication_date": 20170311
    },
    {
      "title": "Car seat tray allows whole family to have a better drive.",
      "text": "This travel tray was simple to set up and made a six hour drive with a 3 year old immeasurably better. It is very sturdy and well designed to handle all the trucks and markers and dinosaurs and food and drink a toddler could throw at it. Also stopped the problem of pieces dropping on the floor of car. The little pockets that run around the edge were great fun as my toddler put things in and out and in and out as toddlers will do. Very well thought out. Very handy.",
      "rating": 5.0,
      "verified": true,
      "author": "minnesota",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "LIFE SAVER- BUY IT!!!",
      "text": "This product is awesome!!! We bought it for my 2 year old for a 10 hr road trip, it was very easy to install and fit around his Graco 4-Ever car seat perfectly! It’s sturdy and very easy to clean. He loved it too!! I Would highly recommend for your next traveling trip!",
      "rating": 5.0,
      "verified": true,
      "author": "Agelow",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Great Quality",
      "text": "This was a great tool to have for our long journey. Quality of product was really good and sturdy. Look forward to using it again and again. I like that the sides zip on and off for storage. Daughter really liked it and it wasn't bulky. Only thing I didn't like about it was that since my daughter is still rear facing in the car and slightly inclined, things tended to roll into her lap instead of staying on the tray. Once she turns to forward facing though, I doubt this would be a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Celestial",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "A must!",
      "text": "I was so excited when I came upon these. They are wonderful especially for long car rides. My girls can draw, play, and eat plus they hold their drinks, snacks, and iPads. Super easy to clean! One draw back is they are a bit large if your child is still rear facing, however they do still fit. It’s just very snug.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfredo",
      "helpful_votes": 0,
      "publication_date": 20180525
    }
  ],
  "product_meta": {
    "title": "Old Travel Tray 1.0 (Pink)",
    "rating": 4.2,
    "specifications": {
      "Product Dimensions": "16.53 x 13.77 x 2 inches",
      "Item model number": "1",
      "Is Discontinued By Manufacturer": "No",
      "Batteries required": "No",
      "Dishwasher safe": "No",
      "Is portable": "No",
      "Item Weight": "1.17 pounds",
      "ASIN": "B071RNLFRC",
      "Customer Reviews": "4.2 out of 5 stars1,187 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#26,757 in Baby"
    },
    "categories": [
      "Accessories",
      "Car Seats & Accessories",
      "Storage & Organizers",
      "Baby Products",
      "Baby"
    ],
    "price": ""
  }
}