{
  "website_summaries": [
    {
      "verdict": "An affordable option with a host of hard-to-beat features.",
      "pros": [
        "Ionic technology reduces frizz while adding shine",
        "Boasts a generous 12 heat settings",
        "suitable for all hair types",
        "Features user-friendly temperature controls with an easy to read LCD display",
        "Heats up within 40 seconds and automatically shuts down after 30 minutes without use",
        "Additional safety feature detects temperature abnormalities and switches off accordingly",
        "Universal voltage makes this a great travel option"
      ],
      "cons": [
        "Some reports of product malfunctioning after a few uses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Game Changer!!",
      "text": "This straightener does the trick on my messy frizzy curls in about 3 minutes. I would recommend it to anyone!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather M.",
      "helpful_votes": 132,
      "publication_date": 20180104
    },
    {
      "title": "Give natural straight hair look.  Fit my laziness.",
      "text": "Tried 3 times after received. Tested this product under my hair's most frizzy condition --> shampooed at night, leave dry without any combing. I have long hair. The result is satisfied. This comb straigtened my hair just like after I used my ionic hair dryer with roller. It gives natural straight hair, unlike hair straigthener. If you look for a product which gives you real straight hair, this may not fit you. Sometimes I am lazy to comb and dry my hair after shower then go to bed right away. My hair frizz like hell next day morning, I need to wet my hair again for styling. Too much work. This product fits my laziness.",
      "rating": 5.0,
      "verified": true,
      "author": "HappyTwoThousand",
      "helpful_votes": 65,
      "publication_date": 20180822
    },
    {
      "title": "Perfect for long coarse hair.",
      "text": "I love it! It has lots of settings for differents type of hair. My hair is long, coarse and thick so I used a higher heat setting. It is easy to handle but I did find myself pushing the temperature control buttons on accident a few times. It usually takes me about 1 hour to blow dry my hair, but with this brush it took me 20 minutes. The only thing I used was the smoothing cream. I didn't feel like my hair was damaged or burnt during the process. It was left really shiny and with volume, compared to using a flat iron which leaves hair flat. Overall very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "yestfl",
      "helpful_votes": 70,
      "publication_date": 20171018
    },
    {
      "title": "Love it! My hair is long and curly",
      "text": "Love it! My hair is long and curly. It takes my 20 mins to straighten my hair compared to 1.5 hours with a straighter. I would recommend this product...",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Schneider",
      "helpful_votes": 59,
      "publication_date": 20171225
    },
    {
      "title": "The reason I select brush instead of iron is that my hair is easily damaged. If you have thin hair or your ...",
      "text": "I bought this hair straightener brush to replace my old flat iron. The reason I select brush instead of iron is that my hair is easily damaged. If you have thin hair or your hair is easily damages, you need to choose brush instead of iron. (I learned my lesson.) This brush has a nice looking. It is easy to use and heats up in just few seconds. I was surprised that there is a pair of gloves in the box. I didn't know what it is used for until I burned myself. LOL I strongly recommend people to read the instructions before using it.",
      "rating": 5.0,
      "verified": true,
      "author": "J.Y.",
      "helpful_votes": 39,
      "publication_date": 20170825
    },
    {
      "title": "Very disappointed with this product as it literally started to catch ...",
      "text": "Very disappointed with this product as it literally started to catch fire. I bought this for my daughter for Christmas. I WANT MY MONEY BACK NO ONE PURCHASE THIS ITEM",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180304
    },
    {
      "title": "Does not straighten hair completely but is a quick fix",
      "text": "Cant use this product on its own to get a perfect straight look. Best if used with a straightener for a good straight look. It does helps save time. I have long thick wavy/curly hair and it can take up to an hour and a half to straighten my hair on my own. With this its at least cut down to 30 minutes. I'll use to straighten my hair as much as possible and then go over it with an iron and it comes out perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Sammii",
      "helpful_votes": 6,
      "publication_date": 20181120
    },
    {
      "title": "Received a dirty, used brush!",
      "text": "I was very excited for this brush but instead had a very unpleasant surprise when I opened the box. There were some long hair on the brush! Gross. I paid for new, but received a used one. They didn’t even bother to clean it before they re-sold the product. Disgusting and unacceptable.",
      "rating": 1.0,
      "verified": true,
      "author": "Sule Guney",
      "helpful_votes": 8,
      "publication_date": 20190130
    },
    {
      "title": "Just a straightener",
      "text": "I really wanted to believe in ion technology but honestly think it’s too good to be true. My hair became much more staticky after I used this product. As a straightener it was pretty decent and I like that it didnt flatten the hair completely, it keeps its volume. But the ionized metals that supposed to help your hair from frizz is just not true. The quality of the brush seemed pretty well made and it heated up fast. Also, I accidentally purchased two of these; one was evidently opened before and used by someone. The second one was new and seemed untouched. So not great quality control.",
      "rating": 2.0,
      "verified": true,
      "author": "Kseniya",
      "helpful_votes": 5,
      "publication_date": 20181128
    },
    {
      "title": "LOVE THIS BRUSH!",
      "text": "To be honest AT FIRST I was disappointed with this brush but the only issue was that I needed to get the hang of it. It is very easy to use. You just have to play around until you find the temperature and brushing motion that works best for your hair. For me, once I set a higher temp and brushed from under neath the hair as opposed to over the top, the results were BETTER than my flat iron. I am able to straighten my hair and get volume at the same time. I really love this brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Amethyst Angel Light",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "I liked the brush itself",
      "text": "I would say it straightens after a long period of trying. I have medium thickness of hair, and medium length, wavey. I was hoping so highly for this product. I liked the brush itself, was a good size. But it did not really straighten my hair. The best it got was wavy, and I didn't want to be gliding this through my hair more than needed. Maybe I will try another brand at another time, but my straightener is my friend for now.",
      "rating": 2.0,
      "verified": true,
      "author": "Kaylee",
      "helpful_votes": 4,
      "publication_date": 20180530
    },
    {
      "title": "Works Well",
      "text": "My hair is a natural curly.It is so convenient to have a hair straightener brush.This product cut the time in half ,made life so much easier.I plugged the brush in,wait 30-40 seconds for brush to warm up ,Then started brushing in fairly small part.The whole process took only about 10 minutes.the effect is really good,the temperament of the whole person has improved.I’m really happy.So I recommend it for girls with thick curly hair ,It is very good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane ye",
      "helpful_votes": 5,
      "publication_date": 20180705
    },
    {
      "title": "Beard out of control?",
      "text": "So My beard is curly and if I don't blow-dry it after the shower or just get up in the morning it is usually very \"puffy\" the solution is usually lots of product and or blow drying after wet. This has saved alot of time and cost of product... You can see in the picture that I did just one side. I always wanted to try a Hari straighter but it's hard not to burn yourself this on the other hand is fantastic I run it a 410 and have had no problems. My wife used it for her hair today and she was super excited about it. The ease of use is by far the part!",
      "rating": 5.0,
      "verified": true,
      "author": "Tccurtis",
      "helpful_votes": 2,
      "publication_date": 20190418
    },
    {
      "title": "Heats to 450 degrees",
      "text": "I love this brush. I was skeptical bc I didn’t see many reviews from African American people but this is awesome! It typically takes an hour and a half to do my hair with the flat iron. I was able to do my entire head in 20min. My absolute ONLY complaint is that it doesn’t get my roots very well but with the time I saved using this brush, I could easily go in with the flat iron and get my curly roots.",
      "rating": 4.0,
      "verified": true,
      "author": "Ivy",
      "helpful_votes": 4,
      "publication_date": 20190329
    },
    {
      "title": "Perfect for Beards",
      "text": "I bought this comb because of all the YouTube videos showing heated Combs for straightening beards. This one works amazing. Make sure you don't go past 390 degrees I think that is plenty. Also quick tip comb towards your ear first so your jaw and chin don't curve your hair under, and then comb down. I don't even try to straighten my hair with a hair dryer after getting out of the shower any more. Now I just let it completely dry and then use this comb. Also I don't see any reason to put oil in your beard first. Just comb the dry beard and then put your oil in it after it's straight.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurth",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Worked once. Received error message every time since.",
      "text": "I loved the result of this brush when I used it the first time. It straightened my hair just as promised. However, when I went to use it a couple days later the display read \"Err\" and had not heated up. I tried to remedy the problem, including the troubleshooting directions in the pamphlet. After three days of trying to revive this brush to working order. I had to return it. It's a great brush, if it works. Unfortunately mine decided to work just once.",
      "rating": 2.0,
      "verified": true,
      "author": "Paige",
      "helpful_votes": 6,
      "publication_date": 20171228
    },
    {
      "title": "Works Very Well",
      "text": "I got a dud product round 1 (the one button was stuck in and I couldn't turn the temperature up), but was able to return for a refund and I reordered it again. So glad I did! Definitely does its job. I have naturally thick, very beach wavy hair and it straightened it very, very well. Easy to use, too. I think it takes a bit less time to straighten with this than with my traditional straightener.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Ramer",
      "helpful_votes": 3,
      "publication_date": 20180115
    },
    {
      "title": "Great hair straightening tool for stubborn coarse hair + funny instruction booklet",
      "text": "This straightener brush works really well on my thick, coarse hair and it easy to use. I love how it not only has different heat settings but how it came with a glove to help ensure that I don't burn my hand, a cleaning brush and a pretty velvet pouch for storage. The instruction booklet is helpful and the disclaimers/warnings are hilarious - not sure who their target audience is that made it necessary for them to say, \"do not use on sleeping persons\" or \"do not use on pets,\" but it gave me a good laugh.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Breitenstein",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "If you wanna loos your hair use this!!",
      "text": "I'm sorry to say that I had a very horrible experience with thisIonic Hair Straightener Brush. I have been waiting to make sure that this brush makes me lose my hair or there is something wrong with my own hair. and after using it several times I saw that its really take out my hair or making them burned! but after using other hair straightener or hair dryer I hadn't had the hair loss or burned look hair!",
      "rating": 2.0,
      "verified": true,
      "author": "SaraMatie",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Perfect! Shipper/Seller, Packaging and Product",
      "text": "Fast shipping! One of the classiest package presentations I have ever seen! The expectation was quality and I was not disappointed! Price is beyond reasonable for the product quality. The brush/straightener does an excellent job. It is light and easy to use. Looks like I can retire my heat straightener-which was my intention when I purchased. I am happy:) I got an email after the sale from the seller explaining warranty information and offering help in whatever I should need. I am impressed! All sellers take notice! This company knows how to do business!!!",
      "rating": 5.0,
      "verified": true,
      "author": "debra n.",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "NOT EVEN FOR WAVY HAIR",
      "text": "I have searched and read almost every single comment about straightener brushes before buying (comparisons, reviews etc. of different brands) Unfortunately I am not satisfied with this Glamfields brush and still using my old seramic straightener, it is just not working for naturally wavy hair type forget about curly ones. Besides control button is funky, you cannot turn the device off by on/off button; you always have to unplug it.",
      "rating": 1.0,
      "verified": true,
      "author": "Edakar",
      "helpful_votes": 4,
      "publication_date": 20181002
    },
    {
      "title": "Very Happy with my Purchase",
      "text": "So happy I bought this straightening brush! It came in yesterday, I used it got the first time this morning. So easy and quick. I have no idea how it will hold up, since I just got it, but I like everything about it so far. The feel of it, the heat setting variations, and the presentation was very nice. I came close to purchasing one that as blowing up my newsfeed and was twice the price. After making three different attempts, over two weeks, to get a question answered, with no response, I decided I would never do business with them. I tried messaging, email and their “contact us” and they never responded.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Useful Tool for Straightening Bed Head!",
      "text": "I purchased this product to tame my bed head between washes. It straightens my hair very well. I have had a couple of instances where I had the heat set a little too high and my hair got a little frizzy. However, when I set the temperature at the right level, it does a beautiful job of making my hair presentable for business in just a few minutes. It's been a lifesaver. It's very easy to use and the instructions are clear. I'm even learning to put a bit of a soft curl (under) while brushing with the heated brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Soup1958",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Great Product",
      "text": "I'm an older guy who has been blessed with lots of hair. I also like to wear it long, but it drives me crazy when it flips up in the back. I've tried all kinds of solutions, and this is the first one that REALLY works well. Every time. Thanks to this brush I can have longer hair, and it looks great and managed. I use after my hair is dry. I also like that it's ready to go within one minute of plugging it in....",
      "rating": 5.0,
      "verified": true,
      "author": "Gary L. Conder",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "This is a far superior product. First",
      "text": "I travel extensively and try to have everything I need packed at all times. This was to be my \"travel\" brush as I'd paid more for my first. This is a far superior product. First, the packaging was thoughtful to minimize any transport issues. The brush came with a heat protector, a glove to keep your fingertips safe and more features--like a temperature lock. This was a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexia S.",
      "helpful_votes": 2,
      "publication_date": 20171225
    },
    {
      "title": "Did not Disappoint",
      "text": "I have very fine curly hair and flat irons work okay but can leave my hair frizzy. I have been looking at straightening brushes for a while. I read a review of this brush on Refinery29 and gave it a shot. The brush is good quality, and easy to use. My hair straightened well with little effort and stayed longer than my experience at home with a flat iron. The price was great. I would highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "NiniJ",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "... NEVER had any hair straightening device that works this GREAT! My hair is super curly and frizzy and ...",
      "text": "I have NEVER had any hair straightening device that works this GREAT! My hair is super curly and frizzy and this brush makes my hair straight and silky with little time and effort! Definitely AMAZING!!!! I highly recommend this product. You will absolutely love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20171126
    },
    {
      "title": "Best straightener I’ve used!!",
      "text": "I swear by this for straightening my hair!! In fact, I had to buy another one so I could take it on vacation and have one at home for my teenager to use, too. I only gave it 3 stars for drying my hair because I don’t use it for that. You will need to heat-protection glove if you go over the same section of hair — if you grab a section of hair in your hand right after you’ve straightened it, it’s HOT. I do somehow accidentally shut this off while using, but I’m pretty sure there’s a “lock” feature to avoid this. I should read the directions...",
      "rating": 5.0,
      "verified": true,
      "author": "Karen M. Crum",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Yes, yes, yes. Buy it now!",
      "text": "I just got this tonight. I let my naturally wavy hair dry naturally after a bath and used it to see if it would easily straighten the curls. IT DID!!! Whatever online review website of hair straightening brushes I read last night that said this was #1, was freaking right. I \"brushed\" my hair with this thing for a few minutes tonight and BOOM, straight, non frizzy hair!!! I'm impressed and that's not easy. What is this witchcraft?! This is the perfect lazy person's hair tool!",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Erickson",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Great Product & Outstanding Customer Service",
      "text": "Great Product to have in your stash of hair appliance/styling tools. Everything turned out just the way it was supposed to-thanks to Glamfields Chunno Direct Excellent Customer Service--they do take great care to ensure you are satisfied with your purchase and that the product works accordingly. I'm a very satisfied customer and highly recommend that you give this product a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Liza",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Love this brush",
      "text": "...and so does my daughter and niece. Seems like I'm constantly chasing around the house to locate it in another bathroom. My daughter has long (down her lower back) thin hair and this works well. I have long (lower back) thicker hair and this works well. Niece has shoulder length normal hair and this works well. Definitely a satisfied group of women in this house with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "MME",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Pretty pleased",
      "text": "Overall this works. I couldn't get it as straight as I can with a straightener, but it's great and quick for touch ups. It heats up in no time and they weren't kidding when they say no moisture in your hair. Make sure your hair protectant spray is completely dry or else you'll smell like burnt hair all day. You can see the difference from left to right in the pic.",
      "rating": 4.0,
      "verified": true,
      "author": "CoraGo",
      "helpful_votes": 2,
      "publication_date": 20180317
    },
    {
      "title": "I hate the controls",
      "text": "it is impossible to turn the device off. I hate the controls,",
      "rating": 1.0,
      "verified": true,
      "author": "doug",
      "helpful_votes": 7,
      "publication_date": 20180801
    },
    {
      "title": "Can’t live without!!!!!",
      "text": "This straightener brush has changed my life! It straightened my hair better then my $200 hair straightener! It didn’t miss a spot and it has helped keep the frizz away too! All my friends and family asked me why my hair looks so different! You’d be doing yourself a disservice by not buying this brush!",
      "rating": 5.0,
      "verified": true,
      "author": "JessicaBB",
      "helpful_votes": 3,
      "publication_date": 20190224
    },
    {
      "title": "Works on thick frizzy hair",
      "text": "I gave it a try after reading the reviews and it worked! I usually spend about an hour with a flatiron on my very thick, course, and frizzy hair. I think it took me around 10-15 minutes total to do my whole head and my hair was really shiny. One of my biggest problems is that irons don't get hot enough for my hair texture but this one goes to 450. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Doerr",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "This works with 220volts",
      "text": "I had given one to my mom and now bought a new one for myself. Truly love how versatile it is and how I can take it with me to my international trips. It will leave your hair soft and straight but don’t expect to have the same finish that you would have at a Salon",
      "rating": 5.0,
      "verified": true,
      "author": "Luis UD",
      "helpful_votes": 2,
      "publication_date": 20180812
    },
    {
      "title": "Works great and super easy to use",
      "text": "Works great and super easy to use! It is really nice tool for straightening hair and it is really same as describe, make sure to comb your hair well first so you got no tangle before using the hairbrush and make sure adjust the temperature accordingly to you preference. This brush heats up fast and leaves my hair looking smooth and shiny. Over all very happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "xyyang43",
      "helpful_votes": 2,
      "publication_date": 20171123
    },
    {
      "title": "Did not last a year!",
      "text": "I purchased this item and it didn’t last much. In the year I probably used it about twice a month so I didn’t use it much. It was easy to use, the temperature control was great and it did work well when I wanted straight hair. But I was deeply disappointed that now I have to be looking for another option because I don’t want to buy a yearly straightener brush.",
      "rating": 2.0,
      "verified": true,
      "author": "Lorena1197",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "DO NOT BUY Stopped working after 1 single day, ERROR",
      "text": "i bought this because i had confidence in the 600+ positive reviews and 4 star overall rating. id give it zero if i could. it worked perfectly for my girlfriends un-tameable hair, it was the straightest id ever seen it. it had 5 uses total, 2 of them on my own short and thin hair, and then it stopped working completely. Now, every time i try to start heating it up it flashes, then shows \"ERR\" and all you can do is unplug it. im returning this item and you should too, before your return window closes.",
      "rating": 1.0,
      "verified": true,
      "author": "Brendan",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Converted skeptic",
      "text": "I've been disappointed by every hair straightening tool I've ever purchased, and have even fallen victim to expensive mall kiosk \"guarantees\" because I've been so desperate to find something to make it easier to straight my long, wavy, thick hair. I was pleasantly surprised at how easily this brush worked, without making my hair frizzy! Even my teenage daughter walked into the room when I was trying it for the first time and said \"your hair got that straight in that short amount of time?!\" I used at the highest heat setting on dry hair, and followed the provided instructions - moving the brush slowly through my hair with a firm pulling motion from roots to ends.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandi Campbell",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Love this!",
      "text": "I'm really happy with this purchase. It might work just as a good as my flat iron. Maybe not quite. But! It is so fast. I have a lot of hair and it just was really difficult to take the time to straighten my hair with a flat iron every morning. A random bonus for me - the cord is not big and bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Babs C.",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Would not turn on",
      "text": "I got this brush was super excited to use it because I have curly hair and it would cut my straightening time in half!! I waited about a week to get my package. When I got the brush it came in a amazing box super luxurious looking. I plugged in the brush and it would not turn on!! So I tried a new outlet thinking it needed more power nothing. The brush came broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Don't buy the $99 hair brush straightener this one works great!",
      "text": "My hair is smooth and straight! The ionic hair straightener brush did what it was supposed to but more than that I was able to straighten and smooth my hair in less than 10 minutes! That has never happened! The product came beautifully packaged feels sturdy I am very happy! The only thing I wish that I could style more with it like with a flat iron. However since it was the first time I used the product possibly I can figure it out in subsequent uses :-)",
      "rating": 5.0,
      "verified": true,
      "author": "ReneGleason",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Works great!",
      "text": "Super easy and works great. I am honestly terrible at doing hair. I have a really nice straightener and rarely used it because it took so long and never turned out that great when I did it myself. I bought this one and it literally takes me 5 minutes to straighten my hair. It's amazing! Highly recommend this. I have a lot of hair and I don't have to section it or anything. Just makes sure there are no tangles and go!",
      "rating": 5.0,
      "verified": true,
      "author": "horseyfun",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "very nice hair straightener brush",
      "text": "It's birthday gift for my sister. She love it. In her opinion it's a lot nicer looking than the other brushes her tried. It has some setting on the handle, on/off and temperature set. You can always turn the temperature up or down (from 250 to 450 degrees). As it heats up the numbers move so you know hen it's to your desired heat. Overall, it did about the same job as the other brushes but this will work on wavy hair. HIGHLY RECOMMENDED",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Great product!",
      "text": "LOVE, LOVE, LOVE this product. In the past I’ve used a flat iron straightener, I liked the results but it was time consuming and I frequently burnt myself. With this product I am quickly able to straighten my hair and not burn myself. My hair is not as pin straight as the flat iron, it is a more casual, natural feel. The hair can get hot if you brush the same section several times but that is why the glove is important. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie l Deuel",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Poor Handle Design",
      "text": "The power button and temperature control buttons are on the handle; therefore, it is very difficult to get a good grip when straightening very thick hair without pushing one of these buttons over and over. They should have put the buttons on the side of the handle or designed them to not be so sensitive. I should have researched that in retrospect. I like the glove and the straightener works pretty well for very thick hair, but I would not give it the rave reviews it received on the internet. I will find a better brush straightener that is more functional and easier to use even if it means spending more money. It is not easy to clean either.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn ",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Defective! Melted and burned out hair!!!",
      "text": "Bought this as a Christmas gift for my daughter. It was a great price with plenty of great reviews. Figured the couple of negative reviews were flukes- they aren’t!!! After several successful uses and loving this product it overheated and burned out a brush full of her hair!!!! It got so hot the brush itself melted. Returning item for refund- too bad it won’t fix the chunk of hair my daughter is now missing 😔.",
      "rating": 1.0,
      "verified": true,
      "author": "Miss Mash",
      "helpful_votes": 2,
      "publication_date": 20190120
    },
    {
      "title": "Indispensable!!",
      "text": "I have very fine, curly hair. Even though I had read great reviews on this brush, I really didn't think it would give me great results. I was wrong. I use it at a lower setting and run it through only a couple of times. My hair is instantly straight and shiny! It even gets rid of the weird cowlick I've been fighting all of my life! Finally!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lotus",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Dual voltage for worldwide use! :)",
      "text": "I quickly searched for a straightener that was dual voltage for an upcoming international trip - I was thinking more along the lines of just grabbing another typical straightener with plates but when this one came up as a dual voltage option I couldn’t pass it up! So happy I chose it as it not only works worldwide, it leaves your hair luxuriously straight with tons of volume :) the velvet carrying case included is also of great quality and makes traveling with it so much easier",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa K",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Save your money and time",
      "text": "Returning first chance I get. Does nothing to smooth my slight frizz. Worse, it took an hour to partially smooth half my sister's hair. Round basket gimmick.",
      "rating": 2.0,
      "verified": true,
      "author": "93422",
      "helpful_votes": 3,
      "publication_date": 20180224
    },
    {
      "title": "My husband says it’s excellent",
      "text": "I purchased this for my husband’s wiry hair. Type 4a hair. It is wiry, and delicate by nature. My husband prefers to have straight hair. He often tries to straighten his hair. I talked him out of using chemical relaxers. Then I started using a straight iron and get tired of doing his hair on a daily basis. I purchased the brush for easy of use so that he can straighten his own hair without my help. He says it’s excellent. It reached from root to tip. He likes the end results.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Kunnuk",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Does what I need it to do",
      "text": "I use a cpap at night so this is perfect for when I wake in the morning and my hair is messed up from wearing the mask all night. This is so easy to use. Sometimes I just use it as a regular brush without heat. **ps. This asked me to rate its drying power- I gave it 3 stars because I didnt know you could dry hair with this? So I havent tried that.",
      "rating": 5.0,
      "verified": true,
      "author": "Wowzer",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "IT WAS USED!",
      "text": "When I purchased this product, I expected a brand new, unopened brush. What I received was a seemingly gently used, already open product that was possibly a return. There was no seal on the box, the brush was haphazardly placed in the box, the cord was roughly wrapped AROUND the handle and brush bristles and the twist tie that is supposed to secure the NEATLY packaged cord was undone and dangling from the cord. The back of the brush is marred from use. Needless to say, I am extremely unhappy with my \"new\" brush. Caveat emptor.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Good and bad. Mostly good 😂😂",
      "text": "I totally love the product, it work great no problem whatsoever, but what makes me gave 4 stars is because of the packaging. they send the product only using the envelope, it's fine if you send it to the next city or the same country but it's not, it sends overseas. With above average glue from the envelope (even it still sticky but still). the good thing are the package arrived safely without damage and not LOST (because of poor packaging). So overall I LOVE IT and another good thing is the package arrived two week before schedule which makes me happy.",
      "rating": 4.0,
      "verified": true,
      "author": "stania alvionisa resmana",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "I love it.",
      "text": "I love the product. It heats up fast and straightens very well without making it flat. Hair keeps some body. The packaging was nice and I love that it comes with the carrying pouch, cleaning brush and glove. I’ll only need my flat iron now to do my curls.",
      "rating": 5.0,
      "verified": true,
      "author": "TaLia",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great brus Love it.",
      "text": "Love it smoothed my hair and made it shine use on dry hair only....perfect for me as i air dry then style with brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne Morgan",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Good Brush",
      "text": "This brush is my new favorite for my \"getting ready\" routine. The brush works great when I want to \"flat\" iron my hair. I've notice less damage in my hair from when I used the flat iron. It can heat up to 425 and its very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "JPLS",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Okay",
      "text": "I’ve not used other brush straighteners so I don’t have anything to compare this one to. I like that I can straighten my hair much quicker than using a flat iron. Note this brush does not smooth hair like a flat iron especially ends. However, I can use my flat iron to touch up the ends after using the brush. I like it for a quick fix.",
      "rating": 4.0,
      "verified": true,
      "author": "LGR",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Amazing Results, Surpassed My Expectations",
      "text": "It straightens my hair beautifully, I am in love! The results I got were exactly what I was hoping for, it did not damage my bleached, color-treated coarse hair, actually it gave it a shiny healthy finish. I find this method so much easier to use than conventional flat-ironing. Amazing straightener, for me it worked wonders, and the packaging is really cute. Also, thank you for delivering my order about 2 weeks ahead of schedule. I would recommend it to anyone who wants to style their hair straight on a day-to-day basis without time-consuming sectioning off of many layers of hair, since the bristles detangle and straighten strands at the same time. Excellent product, I'm so happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "moonflower",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Amazing!",
      "text": "One of the best purchases I’ve ever made. I never thought I would be able to straighten my own hair but with this brush I was able to do it and it came out fantastic! I have already recommended this brush to others and they have bought it and will love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Briana R.",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Not worth it",
      "text": "I had to return this TWICE the first time got the \"Err\" message the second time it just refused to stay on. It would cut off after about 1 min. Truly sucks because while it was working it worked amazing but I refuse to have to keep sending these defective brushes back. Save yourself the headache and find a different brush",
      "rating": 1.0,
      "verified": true,
      "author": "Liquid Lady",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Shocking",
      "text": "I like this but to test if automatic shutoff worked I let it sit for a little bit but when I came back and touched it it shocked me suuuuuper hard and hurt my hand so I returned it. Bummer because I thought I’d like it.",
      "rating": 3.0,
      "verified": true,
      "author": "ieatkaleforbreakfast",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Close enough to bone straight!!",
      "text": "It got my natural hair straight enough for me to cut my own ends which was sorely needed. It was easy to use and though it wasn’t bone straight I was pleased with the freedom it will give me to style my hair myself without a trip to the beauty salon which I hate because they take up too much of my time!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Cannot live without",
      "text": "Don't know how I've lived without this, I have naturally curly course hair, after blow drying my hair straight or my frizz as I call it, I ran this thru my hair and got silky, soft, straight hair. It used to take me an hr to do my hair with a straightener, but now it takes 5 min tops. Best invention ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Sbufly",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "AMAZING",
      "text": "WOW! I have been thinking about buying a hair straightener brush for months and decided to go for it today when I came across this one. This one is half the price of the brush I had been looking at. I have extremely thick hair and straightening it with a regular straightener takes at least 45 minutes. After receiving this brush today I decided to give it a shot. It took me 7 minutes to do my entire head and my hair looks shiny, straight, and healthy! I am SO happy I purchased this!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Marie",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Only buy if you have long hair.",
      "text": "While this straightening brush does get hot and straighten, it’s only useful if you have really long hair. I have thick hair in a bob cut. It only worked on longer pieces of hair and you can’t turn brush in to give bottom of hair a tuck (bend under). I find a flat iron to be way easier to use and get a better result. I returned item. Burned my hand (they give you one glove- although you use two hands).",
      "rating": 2.0,
      "verified": true,
      "author": "RachelOk",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great product at reasonable price.",
      "text": "Bought as a gift for my 12 yr old daughter for xmas. Instructions are clear enough she's been able to figure it all out on her own. Very easy to use. She has a thick hair with lots of body ( but not curly) and is able to straighten it to her satisfaction. Straightening doesn't last as long as with a flat iron but that is clear in the instructions as well. She's very happy with the product. Comes with a 1 yr warranty that we hopefully won't need.",
      "rating": 5.0,
      "verified": true,
      "author": "GB",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Best for long hair, not short, curly hair",
      "text": "This brush worked as advertised. I ended up returning it, but only because it doesn’t work with my hair type. There’s a reason you mostly see women with long hair demonstrating these items. I have short, thick, curly hair and this item just didn’t handle my hair type well.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "So so good",
      "text": "I LOVE this product! It cut my styling time in half and was easy to use right out of the box. I am biracial (black/ white) with combo 3b/3c/4a hair type so it usually takes me a couple of hours to dry and straighten my hair, start to finish. After blow drying it literally took 10 minutes to straighten all my hair with this brush. I did have to go back and actually style my hair after and get into my roots, but with the time I saved to just get it all straight... who cares! Love love love my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "April D.",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Stopped working after little use",
      "text": "Easy to use but very drying and damaging to my hair, even at low temperatures. -- never above 375 degrees. Consequently, I used very rarely, sometimes not at all for months at a time. It stopped working -- doesn't turn on -- after 18 months of minimal use. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "bruno sota",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "It works!",
      "text": "Works very well on my south east asian thick hair. Quick to heat up and easy to use. Dual voltage so works fine in Australia. Should have bought more as presents before Amazon US stopped shipping to Australia. Hope Amazon Australia sells them at a similar price too soon.",
      "rating": 5.0,
      "verified": true,
      "author": "aussie",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "This product is amazing! Got this straightening brush yesterday decided to try ...",
      "text": "This product is amazing! Got this straightening brush yesterday decided to try it out. Straightened my hair in less then 10 minutes. I Love how it leaves my hair looking shiny not brittle and dry as the blower and other straightening hair products do.And the brush come with a carry bag and glove,they look is good quality too............",
      "rating": 5.0,
      "verified": true,
      "author": "Jack sun",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "I love it,  makes my morning easy",
      "text": "I love this, I've had regular flat irons where you've had to section your hair and it was just time consuming. I have short hair so every morning it's crazy. This makes my morning so easy I don't even section my hair anymore I just brush",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Jordan",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Magic Brush",
      "text": "I bought this for my 7yrs old daughter who has long and moderately thick hair. After washing and blow drying,brushing with the brush straightens and lightens the hair making it more manageable. She likes it and shes happy, once shes happy I am happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Chang",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Awsome!",
      "text": "I've used this product a few times now and I absolutely love it! It works exactly as it should and I haven't had any issues as of yet. I have a LOT of hair and it is quite long ( past my butt ) and this brush works BEAUTIFULLY!! I don't even need to use super high heat ( I use 340 degrees ) and the results are great, I will never use a straightener again. It only takes me about 40min. to straighten all my hair compared to two hours with a clamp straightener because I don't have to separate pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi McDonald",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great and fast on wavy and coarse hair.",
      "text": "This is a great tool if you have coarse, wavy hair. It cuts down the time from a straightening iron, which is a HUGE plus. As long as you go relatively slowly, take your time still, you'll end up with beautiful soft straight hair. Make sure you brush out any knots first.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Great product for black hair,make sure you use it with heat Protectant.",
      "text": "I never buy a hair straightener before, until i saw a review about this one.I use it and it works great on my 4A hair. I use it with Aussie heat Protectant,no burn,no sizzling. Just great Product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Stopped working after 5 or 6 uses.",
      "text": "Bought this for my beard. Only used it once or twice a week when I was going out. Worked great for like 5 or 6 uses, then barely got warm on the next use, and just sayss \"err\" every time Ive plugged it in after that.",
      "rating": 1.0,
      "verified": true,
      "author": "david east",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Not a bad deal",
      "text": "I have used this straightener a few times now, and overall I am satisfied with the results. I have extremely thick hair and it works well as long as I do my hair in layers. I will say that it still gives my hair body without the wave.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle S. Marshall",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "\"ERR\"",
      "text": "Loved this brush for the first 5 times I used it. Heated quickly, gentle and effective. But then... just stopped working with a frustrating ERR message and no problem solving to be found. Just dead.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Was hoping I’d have sleek shiny hair. I didn’t.",
      "text": "My hair feels very dry after use. Could just be my hair. This might work fine for others.",
      "rating": 3.0,
      "verified": true,
      "author": "alsatian5",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "This was an excellent purchase I got this at a reduced cost and ...",
      "text": "This was an excellent purchase I got this at a reduced cost and I read the reviews before I bought it. It works with my daughter's hair which is fine but which never seems to end. helps with the frizz and easy to use. I would purchase this again anytime.",
      "rating": 5.0,
      "verified": true,
      "author": "Lalita",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Very straight hair!",
      "text": "If you want straight hair, that's exactly what you'll get. I use a flat iron and can get some curl on the ends, but not with this brush. My husband didn't like my hair that straight, and either did I. If you do, then this is for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Patty Dombovy",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "The best! So easy and it works!",
      "text": "I can’t say enough about this! It’s so easy to use, my 10 year old straightens her hair with ease. Just brush your hair and it’s straight, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Works with 220 volts",
      "text": "I used it in my recent trip to Peru without any issues. Loved that it has his versatility! Overall, good product but in my opinion is not the replacement to a regular straightener if what you want is completely straight hair. It is useful to make your hair look less frizzy for sure",
      "rating": 4.0,
      "verified": true,
      "author": "Luis UD",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Works well",
      "text": "I am really happy with this brush. It does not do the salon straight look but my thick curly hair is smooth that lasts for days. It does it quickly too, 5-10 for my short thick hair.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Anderson",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Disappointed",
      "text": "Didn’t hit up even after turning it on for more than 15min.",
      "rating": 1.0,
      "verified": true,
      "author": "Stella Park",
      "helpful_votes": 5,
      "publication_date": 20180716
    },
    {
      "title": "Works wonderfully!",
      "text": "I have extremely thick hair and have trouble finding a product that can straighten it. This one works wonderfully! My hair is shiny and smooth and it only took one pass thru for each section of hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayle Donnelly",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Awesome",
      "text": "I was looking up online for the top 10 hair straightener brush but this is one that stands out. This is my first hair straightener brush. It works magically. I’m impressed. Sturdy box, heat resistant glove..",
      "rating": 5.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "🤗🤗🤗🤗",
      "text": "I love this product it really works on my daughters natural hair and all my hair extensions and wigs..",
      "rating": 5.0,
      "verified": true,
      "author": "Nenelouis09",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "It Actually Works",
      "text": "A Must have, the product actually works. I have thick curly long hair. You will still have to use a flat iron on the finishing touches but other than it's a great product. Satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura R Vinson",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Works Beautifully & It's So Easy To Use",
      "text": "I never write product reviews. But I felt I had to write this one. I was a little suspicious -- perhaps it cost too little to be really effective. Or perhaps it would be poorly made and fall apart immediately. But it's a wonderful tool. I use it after I wash and dry my hair (it's fine but thick, shoulder length). In 3 to 5 minutes my hair is shiny smooth. It lasts for days, until my next shampoo. I use it on the highest heat setting, and my hair is not at all damaged -- no breaking, no burning. People keep telling me how great my hair looks. I am one very satisfied consumer!",
      "rating": 5.0,
      "verified": true,
      "author": "judith",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Great product!!!",
      "text": "Love this! I have short hair and this straightening brush give me straight hair in minutes! This is easier for me to use than a flat iron because of my short hair. The design and make of this brush is solid and well made. I love how my hair looks after using it. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Bo Duan",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "😔",
      "text": "Well I was disappointed after the second use. Loved it the first go around. Next time I plugged it up it didnt get nearly as hot as previous time. I would have to say I would have sent it back but it came the day after the return window expired? Very odd. Unless like I said I was hacked threw firestick by a guest that stole my identity and maxed my cards out.",
      "rating": 2.0,
      "verified": true,
      "author": "J Coker",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "would purchase again!!",
      "text": "i have naturally curly frizzy hair.. it takes forever to use a flat iron and i wanted something easier so using a brush seems like a great idea so i jumped and bought this.... BEST PURCHASE EVER... works great. fast .. easy...",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia K.",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great product",
      "text": "I've used several brands of straighteners & this hair brush straightener is one of the BEST I've ever used. I'm a mom so I need something that doesn't take as long. My hair is a pain in the ass, frizz wavy overload if I dont straighten it. It does very little hair damage compared to a flat iron. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "RastaGanjaQueen",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Does what it says",
      "text": "I was skeptical but hey it works man. It does what it says it's going to do. It's better for like if you are trying to freshen your hair up real quick then for like a full on head of curls. But if u have wavy hair are u run it thru a couple times it will look great and work just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelmosa74",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "This is just great!!",
      "text": "This is just great!!!! This brush is amazing!! And I love it!! I have 3 reviews in my youtube channel bibitipstv about this brush and people just love the results! It's great for every kind of hair!! I didn't believe so a try it and I'm more than happy! ! If you want visit my channel for seeing the reviews bibitipstv",
      "rating": 5.0,
      "verified": true,
      "author": "BibiTipsTv",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "BROKE IN TWO MONTHS",
      "text": "I loved this product, but it only has a 60 day warranty. I didn't even use it every day. Maybe used it 20Xs and it stopped heating up. STAY AWAY!",
      "rating": 1.0,
      "verified": true,
      "author": "Shari",
      "helpful_votes": 0,
      "publication_date": 20200301
    }
  ],
  "product_meta": {
    "title": "Ionic Hair Straightener Brush Upgrade 2.0,GLAMFIELDS Electrical Heated Hair Straightening with Faster Heating, MCH Ceramic Technology, Auto Temperature Lock, Anti Scald, Heat Resistant Glove(Black-01)",
    "rating": 4.1,
    "feature_bullets": [
      "【Hair Protection】: The hair straightener brush releases rich negative ions which helps in eliminating frizz, knotting and split ends. This helps in improving the overall quality of the hair, resulting in a much smoother and healthier hair which is easy to manage anytime, anywhere.",
      "【30-40 Seconds Heat up】: Most straight hair brush take a long time to heat up thus wasting the time of the user all the while increasing the electricity bill cost. GLAMFIELDS Hair straightening brush heats up within 30-40 seconds thus saving time and energy. This is possible because of its MCH technology which improves the overall user experience. Its wider structure and denser comb teeth help reduce the time for straightening considerably.",
      "【Safety Controls】: The GLAMFIELDS ceramic straightening brush is equipped with the auto shutdown and temperature lock features to ensure maximum security and optimum performance at all times. Temperature lock ensures that there is no abrupt rise in temperature that can harm the hair. The device auto shuts off if it is not used for continuously 30 minutes thereby preventing any energy wastage and prolonging the life of the machine as well.",
      "【Easy To Use And Clean】: The GLAMFIELDS hair straightening brush should not be washed with water under any circumstances and should only be cleaned with a brush stained with alcohol. As alcohol is highly volatile, it disappears quickly and does not cause damage to the instrument in any manner. However, one to keep in mind is that there is residual heat after using the device, so it is best to keep the GLAMFIELDS electric hair brush in the open for some time before storing it safely.",
      "【High Density Nano Comb Brush for Curly Hair】: easily turn curly hair into straight hair in just minutes! Not only This, but this hair straightener brush provides a massaging effect that benefits the scalp and stimulates hair follicles."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "10 x 2.59 x 1.5 inches; 1.9 Pounds",
      "Manufacturer": "GLAMFIELDS",
      "ASIN": "B071HFQGJX",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Styling Tools & Appliances",
      "Hair Care",
      "Beauty & Personal Care",
      "Hot-Air Brushes"
    ],
    "price": 39.99
  }
}