{
  "website_summaries": [
    {
      "verdict": "The Merrell All Out Crush 2 received quite a positive response from trail running enthusiasts who wanted dependable surface traction and agreeable in-shoe coverage. Most of those who have tested this neutral shoe liked its lightweight build, as well. Conversely, several people griped about its sizing scheme and its unstable interior fit.",
      "pros": [
        "Many people felt that the Merrell All Out Crush 2 was comfortable",
        "The upper was lauded for preventing trail debris and soil from infiltrating the interior foot-chamber",
        "Many consumers appreciated the grip of the outsole on soft surfaces and rocks",
        "Most runners liked the lightweight nature of this running shoe",
        "The spacious toe box allowed natural toe-splay, based on several reviews",
        "The durability of the materials used for the All Out Crush 2 was deemed reliable"
      ],
      "cons": [
        "According to a tester, the lightness of this product was a catalyst for in-shoe wobbling and foot instability"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "More than happy!",
      "text": "There super light and feel well made. I've done a few 5/6 milers with them and they have held up. They have good grip but in the really soft sticky mudd they kind of glog up... But I think this will happen with any trainer. just remember not to walk around a showroom after doing a muddy run!!! The carpet was in a bit of a mess 😳. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan P.",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Worth a go",
      "text": "They fit quite narrow at the front but due to limited cushioning on the uppers which I was specifically looking for they have a slightly loose fit around the ankles. The heel is quite high as well which can feel like it is digging in a little when you are running on an uneven surface. However completed a solid half marathon in them and no real complaints.",
      "rating": 3.0,
      "verified": true,
      "author": "George Pettingell",
      "helpful_votes": 2,
      "publication_date": 20180828
    },
    {
      "title": "They are better than you might think.",
      "text": "I bought these for a muddy assault run - I did not expect much. It was the worse weather I have ever been out in! They held up great. Good grip and as comfortable as they could be without holding water. Very pleased with em!",
      "rating": 5.0,
      "verified": true,
      "author": "J.E.MURPHY",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Shoe is lovely but not durable",
      "text": "Very breathable shoe and I loved it. Very good grip and did what they needed to do. The problem is a hole appearing at the front of the shoe and getting larger with less than one weeks use.",
      "rating": 2.0,
      "verified": true,
      "author": "Rory",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Tip top",
      "text": "Bought these to go running on bridle ways etc and have turned out to be really good given the very recent weather. They dry quickly, are light and fit well as you’d expect from merrel.",
      "rating": 5.0,
      "verified": true,
      "author": "rob mills",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Fantastic",
      "text": "Great pair of trainers. I completed a tough mudder in these and they were ideal",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. D. T. Radford",
      "helpful_votes": 2,
      "publication_date": 20180706
    },
    {
      "title": "Bees knees",
      "text": "This shoe is one of the best...its very light,grippy and vented...which basically let's water or sand rush out . Fit is spot on. Been long time since trusted pair of off road shoes",
      "rating": 5.0,
      "verified": true,
      "author": "robbie p",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Great fit and grip.",
      "text": "Exactly what I wanted for my rat race adventure races. Water drains out nicely after you have to swim in them too :-) These are my second pair so that I can use them for boot camps too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lordi",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Best for cross country",
      "text": "Used these for tough mudder and they were brilliant for cross country, grip was amazing",
      "rating": 5.0,
      "verified": true,
      "author": "matthew coulson",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Fit as expected",
      "text": "Saw these at a great price. Was worried as some people said they were too narrow but I’m a 10 and these fit nicely. Not submerged them in water yet but so far so good",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Frankland",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Tough Mudder Recommended",
      "text": "Excellent quality. Used these for a classic 10 mile tough mudder, perfect for the event. Great grip and comfort- a must have for any mud related event! Ran past so many people slipping and sliding about on normal trainers, these shoes saved me!",
      "rating": 5.0,
      "verified": true,
      "author": "John Harrod",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Solid yet lightweight",
      "text": "Very comfortable and light. Great fit and the tread provides excellent grip on the muddy trails I use. Nice quality feel to them.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Devine",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "not sure till l go out in them",
      "text": "light shoe not worn yet will use for trail running",
      "rating": 5.0,
      "verified": true,
      "author": "anthony bain",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Slippery when wet",
      "text": "Comfortable and ok in the dry, very slippery on wet stone and paved surfaces",
      "rating": 2.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "No arch support whatsoever.",
      "text": "The left shoe feels as if the inside of the sole is very soft and makes u feel you are walking in the inside of your foot.",
      "rating": 1.0,
      "verified": true,
      "author": "S & L Lubwama",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Good fit but not too durable",
      "text": "Having only wore these twice, they are already starting to show signs of wear.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex C",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Great for obstacle races.",
      "text": "Bought these for Tough Mudder. Previously, I had used trainers but was advised to use these. These are awesome and make obstacles like the mud mile a breeze. Avoids that slipping around you get with trainers. If you do obstacle races you needs these.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr A K Chauhan",
      "helpful_votes": 2,
      "publication_date": 20190730
    },
    {
      "title": "Great value for money",
      "text": "Best trail shoes that I have ever bought.. light and comfy great in the wet as well. Well worth the money..",
      "rating": 5.0,
      "verified": true,
      "author": "Richard millns",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Ideal OCR shoe",
      "text": "Great pair of trail shoes, bought at a brilliant price. Bought my son these for OCR running, plenty of mud and water made his other shoes too heavy. The lugs are brilliant for grip in the mud and also ideal for climbing up walls, keeping grip on obstacles. These are light, let water, sand, mud etc out instead of keeping them in the shoes. I am so impressed I have bought myself a pair too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jedi maw",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Lighweight flexible running shoe",
      "text": "The all out crush range is how merrell used to be. The shoe is a good fit, although i marked it slightly larger than expected this is because in recent years i have found many merrell ranges a bit tight, so it is larger in comparison to these, so i regard as comfortable especially if you are running in them giving space for your feet to swell. Nice and lightweight and a good design",
      "rating": 5.0,
      "verified": true,
      "author": "chris c",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Very food for people with wide feet",
      "text": "For some one with very wide feet these are a breath of fresh air. Just did tough mudder in them, by the end of it my feet were the only bits of me that weren't sore! Can be wide at the back, recomend wearing with late locks to pull in snug.",
      "rating": 5.0,
      "verified": true,
      "author": "Liam Mancey",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Lightweight trail shoe.",
      "text": "Very lightweight for a trail shoe. Not remotely waterproof. Tread is capable of support on most surfaces though feels a little skatey on wet road/pavement.",
      "rating": 4.0,
      "verified": true,
      "author": "K Ridley",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Great trail shoe for larger sizes",
      "text": "Review 150 miles in: Great trail running shoes that have performed well for me in a lot of conditions and terrains. In 12+ sizes, Merrell are by far the best choice and the only one that seem to get the width right (ie, there’s enough of it). These are holding up really well in my second summer of running trails in them and I hope Merrell continue to make them in the future. It would be great if they could branch out into road shoes too.",
      "rating": 5.0,
      "verified": false,
      "author": "A. Chapman",
      "helpful_votes": 0,
      "publication_date": 20190803
    }
  ],
  "product_meta": {
    "title": "Merrell Men's All Out Crush 2 Shoes",
    "description": "These All Out Crush 2 shoes from Merrell feature synthetic upper and manmade inner material. The outsole is made out of synthetic. These fast and versatile shoes grip, drain, and protects during the toughest of training challenges.",
    "rating": 4.2,
    "feature_bullets": [
      "Breathable Mesh - Provides exceptional breathability.",
      "TPU Overlays - Offer durability and help provide a snug fit.",
      "Outer Material: Synthetic",
      "Inner Material: Manmade",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Material Composition: Synthetic",
      "Shoe Width: Medium",
      "Lycra Neoprene Heel Lining - Offers extreme comfort.",
      "Trail Protect - Offers additional support off road.",
      "EVA Midsole - Absorbs shock and impact forces."
    ],
    "specifications": {
      "Product Dimensions": "33.02 x 20.32 x 10.16 cm; 453.59 Grams",
      "Date First Available": "2 Feb. 2018",
      "Manufacturer": "Merrell",
      "ASIN": "B071WMXHCV",
      "Item model number": "J12561",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}