{
  "website_summaries": [
    {
      "verdict": "This barn-inspired dog house is the ideal choice for customers wanting a model that fares well both indoors and out.",
      "pros": [
        "House includes a door flap for dogs used to kennel-style shelters",
        "Roof made of asphalt, ensuring rain stay out of house",
        "Floor is removable for easy cleaning"
      ],
      "cons": [
        "Wood could be higher quality",
        "Some larger dogs had trouble fitting in the house"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Eroding wood caused my dog to get sick!",
      "text": "Changing my review -- The wood on this thing is eroding. My dog has chewed it and got sick. I had to spend close to $300 in vet fees to get him medication. This thing has been kept out of the sun and rain underneath a huge patio cover. I am so disappointed. Never again!",
      "rating": 1.0,
      "verified": true,
      "author": "Bear",
      "helpful_votes": 13,
      "publication_date": 20180427
    },
    {
      "title": "My Grandpug loves it!",
      "text": "I bought this dog house for my Grandpug so she could get out of an impromptu rain on those occasions when she's doing her outside business. After what seem liked several hours comparing, and reading reviews, I decided on this product, and couldn't be happier! Very easy to put together! Amazon delivers promptly once again!",
      "rating": 5.0,
      "verified": true,
      "author": "Starraven",
      "helpful_votes": 3,
      "publication_date": 20161127
    },
    {
      "title": "This doghouse is amazing. It is much nicer than the ones we ...",
      "text": "This doghouse is amazing. It is much nicer than the ones we looked at in the store. Plus, it cost half as much. We put a cushion in that covers the entire floor. In the winter we put a greenhouse cover over it for added insulation. She's an outside only dog and she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "HDDC",
      "helpful_votes": 5,
      "publication_date": 20151009
    },
    {
      "title": "Not worth for the price",
      "text": "The assembly was easy but it’s not made from strong materials and woods. The woods will easy cracking by over tight the screws. The other problem was the size! The sizes aren’t the room size and they are wide and long of roof. The room is smaller it was expected.",
      "rating": 1.0,
      "verified": true,
      "author": "Omid",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Works for our dog in CA",
      "text": "This took about two hours to build. It looks very nice and so far is holding up to ca weather. Not sure if this would work at my parents back east. Not the highest quality material.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah walter",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Very easy to put together",
      "text": "Very easy to put together, my pup loves it. I actually have it inside as she is a rescue and loves to hide when scared and was going behind the furniture so now she runs in her house and feels safe. She sleeps in it all night. If you also put it inside you will have to put it outside for a few days to get rid of the paint smell first. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "moonglow67",
      "helpful_votes": 4,
      "publication_date": 20160501
    },
    {
      "title": "Well made house",
      "text": "I bought the smaller one for an outdoor cat. Rain & cold are the biggest problems. This is perfect. The rain rolls off the roof & with it up off the ground, my kitty stays dry. Very well constructed, looks more expensive than the price. A nice addition to any yard. Kitty is happy. Even Lily, my mostly indoor cat likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Received this dog house and was extremely happy with the quality compared to others except two pieces ...",
      "text": "Received this dog house and was extremely happy with the quality compared to others except two pieces of wood were cracked. After emailing Petsfit they are going to send replacements right away. So happy with their service and my little Jack Russell Terrier loves his new red house. Thank you",
      "rating": 4.0,
      "verified": true,
      "author": "Amy G.",
      "helpful_votes": 2,
      "publication_date": 20161011
    },
    {
      "title": "Um, not exactly used as a dog house ...",
      "text": "We bought this dog house to cover a water well head ... our dog is too big for this house! Anyway, the house is extremely easy to put together and arrived with clear instructions and in good condition. We had it put together in a few minutes and now it graces our yard, hides the well head, and is just darling. We're self-installing a doggy name plaque above the door. All-in-all, a great house - and I'm sure dogs will love it, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Margot Beattie",
      "helpful_votes": 0,
      "publication_date": 20150703
    },
    {
      "title": "Without a doubt the BEST product I have ever had to partially assemble",
      "text": "Without a doubt the BEST product I have ever had to partially assemble. Outstanding workmanship. Everything fit together perfectly. Looks amazing. Love this product. Wish their engineers worked for IKEA.",
      "rating": 5.0,
      "verified": true,
      "author": "iLOVEcats",
      "helpful_votes": 2,
      "publication_date": 20151022
    },
    {
      "title": "Happy customer",
      "text": "Very happy with the quality of this dog house. Easy to put together and seems to be sturdy enough for my 70 lb. Labrador. I've only had it a month, so I don't know how it will do after a snowy NY winter, but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Ribeiro",
      "helpful_votes": 3,
      "publication_date": 20150922
    },
    {
      "title": "Love this dog house!!",
      "text": "This was the second dog house we purchased for our new puppy. This one was BY FAR a better quality house than the first (Precision brand). It is also heavier duty.....and it wasn't broke when we received it! I originally wasn't too excited about ordering this one as I wasn't sold on the color. The red doesn't seem as bright to me as depicted by my monitor though. :) Yay!! The only 'con' is that our puppy (a Welsh Corgi) likes to chew. She has chewed on the inside of the white wooden door frame. Definitely not a deal breaker for me though...this is so much better than a plastic house!",
      "rating": 5.0,
      "verified": true,
      "author": "shanna",
      "helpful_votes": 4,
      "publication_date": 20150824
    },
    {
      "title": "It looks like both split when the brad was nailed Into place ...",
      "text": "Product was a little light weight, hopefully it will hold up to my lab/Rott mix. Two boards were split, one not a big deal but the other was the top piece that covers the roof connection. It looks like both split when the brad was nailed Into place but was shipped anyway.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth J. Beyer",
      "helpful_votes": 2,
      "publication_date": 20150613
    },
    {
      "title": "All pieces came damage free and easy to assemble.",
      "text": "Perfect pet house! Easy to assemble. We have a coonhound and the large is the best size for her. Very happy. I was concerned the pieces may come damaged or it would be hard to assemble. Not at all. Great price for a great product. Very cute too!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Baker",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Nice.",
      "text": "Nice little dog house. Well made compared to others. Went together easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Master Kaz",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Five Stars",
      "text": "This product arrived on time as described and has exceeded all expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "NR551",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Excellent",
      "text": "Surprisingly good quality, easy to put together, all parts and pieces arrived in good shape. Perfect size for our 45 lb dog.",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "Fast and Easy",
      "text": "Assembly was a breeze, super fast and easy. Perfect for English Bulldog.",
      "rating": 5.0,
      "verified": true,
      "author": "Knarley",
      "helpful_votes": 2,
      "publication_date": 20160626
    },
    {
      "title": "Good house",
      "text": "The item was damage a little, but works great with nice quality.",
      "rating": 5.0,
      "verified": true,
      "author": "RKJ",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "This was very easy to put together",
      "text": "This was very easy to put together. Everything was pre drilled. I like the smell of the cedar and the fact that its up off the ground a bit. it even came with a rain guard for the door. I was very impressed with this house. The instructions are pictures of simple diagrams . But , don't let that deture you. Its very easy to put together. I did this in 20 minutes. Its heavy when its together , had to have my husband help carry it. I suggest you look at the inside dimensions of the floor plans.That helped my to decide on the size bigger than recommended. I'm glad I did. Its perfect for my 40 lb. sweetie.",
      "rating": 5.0,
      "verified": true,
      "author": "lakergirl",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "Easy to put together",
      "text": "Nice little dog house super easy to put together. I needed easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "AbbyAmelia",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Really nice and easy to build my dogs love it i ...",
      "text": "Really nice and easy to build my dogs love it i have a big dog and a small one and they both fit in there specially when its a little cold they love it.",
      "rating": 5.0,
      "verified": true,
      "author": "jose pineda",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Perfect",
      "text": "This is the cutest dog house ever! I wanted it mainly for decoration, but it is sturdy and very well constructed. GREAT value for the price. More than I expected",
      "rating": 5.0,
      "verified": true,
      "author": "Diana S.",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Great Product",
      "text": "Very sturdy and easy to put together. Fit a large german shepherd well.",
      "rating": 5.0,
      "verified": true,
      "author": "Colleene McMurphy",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "Loved it",
      "text": "I love the dog house it came as described although my dog is still trying to get use to it but it is really nice no broken pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Yetti",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Good quality. Easy to assemble",
      "text": "Good quality. Easy to assemble. Our dogs don't like to use it but that's not a reflection of the product quality. We have two - one a 14 lb long-bodied terrier and the other a 27 lb cocker spaniel. It's a good size for either of them, though neither spends time in it. It looks cute on our deck, though.",
      "rating": 5.0,
      "verified": true,
      "author": "AMEH",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "Love it. Sturdy and plenty of room for a ...",
      "text": "Love it. Sturdy and plenty of room for a large breed dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Leu",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "thank you petsfit!",
      "text": "My sister bought this dog house for my anties dog and I gotta say she loves it the next day it raind so hard and she was sleeping so good on the and protected the dog house is made very touf and like real roofing loved it and great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "hiilani no ka oi",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "I have a 9 month old English Mastiff that don’t ...",
      "text": "I have a 9 month old English Mastiff that don’t fit in this dog house, the dimensions in the description are not even close, the add says 37 X 44 X 41, the actual inside measurements of floor space is 28” X 36. If you have a large dog don’t be fooled.",
      "rating": 1.0,
      "verified": true,
      "author": "Allen E Mackall",
      "helpful_votes": 5,
      "publication_date": 20150504
    },
    {
      "title": "It's not what it looks like plus it's expensive for what your getting",
      "text": "It's not what it looks like plus it's expensive for what your getting. My recommendation is to build your own dog house!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160302
    }
  ],
  "product_meta": {
    "title": "Petsfit Outdoor Wooden Dog/Pet House, Painted with Water Based Paint",
    "description": "Size:39.8\"x33.1\"x34.1\"| Color:Grey\n\nBasic information:\n\n \n\nWood: natural cedar\n\n \n\nPaint: water-based paint\n\n \n\nColor:Grey.\n\n \n\nOuter dimension:39.8\"L x 33.1\"W x 34.1\"H.\n\n \n\nNOTE: All materials are no harm to pets.\n\n \n\nDesigns and Functions:\n\n \n\n1. Treated with WATER-BASED paint which is safe for your pet.\n\n \n\n2.Grey and white trim.\n\n \n\n3.Including door flap.\n\n \n\n4.Ideal house for pets.\n\n \n\nWarranty:\n\n \n\n1. Petsfit adhere to Amazon Return Policy.\n\n \n\n2. Within 30 days, any quality problems, we will take full responsibility.\n\n \n\n3. Any damages happened during shipping period: contact Amazon customer service(FBA order) ;contact Petsfit(FBM order).\n\n \n\nAttention: Please measure your pet and check the DIMENSION.",
    "rating": 4.2,
    "feature_bullets": [
      "Including door flap gives pet a private and safe environment.",
      "Door dimension: 13” x 16.5”. Please refer to the second picture for more size details.",
      "Asphalt roof keeps rain from getting in the house.",
      "Slanted roof and groove design to ensure good drainage, the eave shield the weather",
      "Plastic adjustable feet to keep the moisture out,removable floor for easier cleaning"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "42.99 x 29.29 x 7.4 inches; 60.7 Pounds",
      "Date First Available": "May 16, 2017",
      "Manufacturer": "Xiamen JXD Electronic Commerce Co., Ltd",
      "ASIN": "B0714C23F7",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Crates, Houses & Pens",
      "Dogs",
      "Dog Houses",
      "Pet Supplies"
    ],
    "price": 167.99
  }
}