{
  "website_summaries": [
    {
      "verdict": "It costs a little more than some other casting rods, but it has a very comfortable handle and a high level of construction.",
      "pros": [
        "Carbon fiber construction ensures you can use this rod successfully, even when placing a lot of stress on it",
        "Ships with 2 rod tips, so you can adjust the performance level of this casting rod, depending on your needs during a particular fishing trip",
        "Available in several different action settings, rod lengths, and power levels"
      ],
      "cons": [
        "Occasional problems with the tip of the casting rod being too brittle and breaking"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "One-piece rod performance with two-piece rod flexibility",
      "text": "Have been a fan of one-piece rod but this one changed my idea. The connection between two pieces is very stable and smooth. I used it several hours and always felt it as one piece. Cast light lures (1/8oz jig + tube) and heavy lures (buzzbait, squarebill cranks) and all worked well. Also sensitive enough to feel the light bite. Let my buddy (in the picture) tried a while and he immediately decided to get one too!",
      "rating": 5.0,
      "verified": true,
      "author": "Susanna",
      "helpful_votes": 74,
      "publication_date": 20170812
    },
    {
      "title": "Great Lightweight casting rod!",
      "text": "I really like the handle and the sensitivity the rod provides, it works great as a second rod. When I got this it was in great condition with good packaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Jackson",
      "helpful_votes": 30,
      "publication_date": 20200911
    },
    {
      "title": "Amazing",
      "text": "I am absolutely blown away by these rods. Probably the best $60 rod you will ever find. I can't wait to get more.",
      "rating": 5.0,
      "verified": true,
      "author": "kbrewha40",
      "helpful_votes": 85,
      "publication_date": 20170804
    },
    {
      "title": "Extremely comfortable and light (2018)",
      "text": "I'm extremely happy with this purchase. The rod is very comfortable in hand. The trigger underneath the rod forms well to my hand. The rod is very light with a good backbone to tip ratio. I purchased the 7'1\" MH and I'll be using it for weightless stick baits. It has enough backbone for hooksets, yet enough tip for long casts. KastKing did a great job balancing affordability and expensive feel. I'd honestly guess this was a $100 rod. Can't go wrong with this rod at this price!",
      "rating": 5.0,
      "verified": true,
      "author": "Devon Christian",
      "helpful_votes": 63,
      "publication_date": 20180121
    },
    {
      "title": "Amazing value",
      "text": "The days of the $200 and up rigs are over for me. KastKing is now my go to brand in fishing. I have purchased this rod set, three pole racks and the Royals Legend baitcaster. Everything KastKing screams high quality. I am extremely pleased with all of their products. I love the option of two poles in one. Keep the new products coming KastKing!",
      "rating": 5.0,
      "verified": true,
      "author": "Shane Cook",
      "helpful_votes": 58,
      "publication_date": 20170810
    },
    {
      "title": "Solid rod!  my goto flipping stick! 7'4\"",
      "text": "This thing is a broom stick! I got the 7' 4\" Heavy for flipping and it is an absolute beast. It's lightweight and can still rip some monsters out of the thick grass! I have it paired with the Speed Demon.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabe Feltman",
      "helpful_votes": 39,
      "publication_date": 20180121
    },
    {
      "title": "Don't buy.",
      "text": "I have never once owned a rod that has been as fragile as this rod. I used it twice and on the third trip the tip snapped off while setting the hook. I'm am truly upset with my experience. Now kastking wants me to ship it back to them, make me pay for shipping and to put insurance on it. After I do that I could have just bought a better rod initially. I'm assuming all of the reviews are bogus and paid for. Never again kastking.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen H.",
      "helpful_votes": 13,
      "publication_date": 20180811
    },
    {
      "title": "Two piece buyers beware. Replacements were even riddled with quality issues.",
      "text": "I purchased a casting 2 piece m/ml that came with the guides way off center with the reel seat. After I returned the rod I purchased another a couple weeks later and I was sent the EXACT SAME ROD I HAD RETURNED WEEKS PREVIOUSLY. Brilliant me. I then figured there was no way I’d get a third bad product, so I ordered the 2 piece m/ml spinning rod. As you can guess, problems galore. The alignment arrows were laughable, the l tip was much stiffer than the ml and guide eyes on both tips were bent. A lot of my time was wasted with these rods. Look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Curt Boroff",
      "helpful_votes": 14,
      "publication_date": 20180710
    },
    {
      "title": "Snapped before its time.",
      "text": "Hi, I bought this rod in September of 2018I used it maybe 2 times before winter set in. I cleaned up my poles this weekend and went fishing today was out just a few hours. Went to bring my pole in to move it to a different spot as I got a hit on a small cat and set the hook and my pole snapped. Just above where the 2nd piece slides in. I am saddened and surprised. This was my first time buying a kastking king rod. I don't believe I will purchase another one. Live and learn.",
      "rating": 1.0,
      "verified": true,
      "author": "stepdad4life",
      "helpful_votes": 8,
      "publication_date": 20190406
    },
    {
      "title": "Heck of a deal!!",
      "text": "I own a bit of $200+ rods.I have to say if you did not know any better you could pass it off as such. Great feel and balance. The transition of power is awesome. For what you get for the price this is a great rod. On a side note I have bought many rods online and I have to admit the packaging was above and beyond for protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Seth L",
      "helpful_votes": 48,
      "publication_date": 20170730
    },
    {
      "title": "Depressing. Not strong.",
      "text": "Broke straight away. Excited about new rod and going out fishing with an old friend with my new gear, it snapped at the top while spooling. C'Mon!",
      "rating": 1.0,
      "verified": true,
      "author": "Buck Nichols ",
      "helpful_votes": 8,
      "publication_date": 20190606
    },
    {
      "title": "Super light great action but very easy to break",
      "text": "The first one was broke and I got the 2nd one right after and I fished with it one time. It was a great feeling rod and very light. Could feel the action of the lures very well. But I noticed that there was a crack started on the rod between the last 2 eyes after I got home. If the rod would stay together and not have these defects it would be a really great rod and I would buy more. But if it’s so bridle it’s not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190626
    },
    {
      "title": "Poor quality two piece rod but excellent customer service!",
      "text": "It was great while it lasted. Purchased about two months ago and probably use it every other weekend and the top piece broke during recent fishing trip. What was disappointing was that it didn’t broke at the tip but about 6” from the joint. Update: Feb. 5, 2019.. Contacted Kastking and sent them a pic of the broken tip and replacement was promptly sent for the broken tip. Excellent customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "Jp",
      "helpful_votes": 4,
      "publication_date": 20190129
    },
    {
      "title": "BEWARE! You don't get two rod tips with every rod.",
      "text": "The description of the rod leads one to believe you are getting two rod tips, but this only applies to certain rods on the pull down list. It's real close to a bait and switch deal. I called Kastking and they said it only applied to the first four or so listed rods on the pull down menu. They were not helpful at all. I am boycotting Kastking products in the future. Throughout the description it pushes the great deal it is to get two rod tips. \"TWO FISHING RODS for the price of one!\" is a direct quote from their Product features description on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Mya Maria",
      "helpful_votes": 2,
      "publication_date": 20200219
    },
    {
      "title": "Intentionally packed damage rod WTH",
      "text": "Rod came damaged and late. I also purchased the Kodiak 5000 as well as couple spools of braided line. Overall, I’m disappointed the damaged rod was inserted into a non damaged box. Maybe because it was deal of the day ? Who knows, I would like a NEW M/H Spinning rod to pair with everything else I purchased. Not a return. Which is also anything con to returning items. Thanks...",
      "rating": 1.0,
      "verified": true,
      "author": "Deven Morejon",
      "helpful_votes": 8,
      "publication_date": 20180709
    },
    {
      "title": "Last 2 sections of the rod tip broke off while ...",
      "text": "Last 2 sections of the rod tip broke off while the wife was baiting the hook. It was only the second time using it out on the water. Shouldn’t have broke with almost no tension on the rod.",
      "rating": 1.0,
      "verified": true,
      "author": "Richelle Futrell",
      "helpful_votes": 10,
      "publication_date": 20180514
    },
    {
      "title": "Felt like a good rod however when I hooked into a ...",
      "text": "Felt like a good rod however when I hooked into a large striper it snapped 1' above the reel seat. Will not purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20180510
    },
    {
      "title": "It feels amazing and it looks even better than it does on ...",
      "text": "I just received the Perigee II two piece ML/M Spinning Rod... The photos on the internet doesn't capture the true beauty of this rod.. It feels amazing and it looks even better than it does on the photo... I just ordered a 1 piece Spinning.. Maybe it will be wise to get a bait caster while they are still available. One thing I have learned about KastKing products, they go very fast. Love the rod and I'm excited to get out on the water and brake it in..",
      "rating": 5.0,
      "verified": true,
      "author": "swampseeker",
      "helpful_votes": 4,
      "publication_date": 20170804
    },
    {
      "title": "3 months in, 2 eyes are coming loose",
      "text": "Really like this rod, 6,6” ML&MH. Have been using only the ML for 3 months.. 2 of the eyes on the top piece are breaking off where they attach to the rod so now there is some play in them. Plan on fixing them for the time being and contacting company. Seems to be a really high quality product overall, hoping I just got a defect, I’m a big fan of KastKing and have many of their products and never had any issues.",
      "rating": 3.0,
      "verified": true,
      "author": "bill",
      "helpful_votes": 3,
      "publication_date": 20180721
    },
    {
      "title": "VFM and Good Finish",
      "text": "Just received the Rod. It seems well made and without having actually used it, I feel it provides decent quality and value for money. Haven't tried it beyond the look feel part. Update: when I wrote honestly that my review was to get the free stuff the seller promises in exchange for reviews, my review was not accepted. So I left out that part and now that my review has been accepted, I am now including it.",
      "rating": 4.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Quality !!!",
      "text": "I bought the KastKing Perigee II Fishing Rod after doing a bunch of research on a new rod for my KastKing Spartacus Bait Casting reel. The Quality and attention to fit and finish on this rod is like no other. Fuji guides and the exposed blank on the reel seat are just two of the many things I love about this rod. It casts beautifully - and you can feel every movement of the lure in the water. The rod is so very light, but not delicate. Now I can see why this rod is a true winner- and why KastKing is winning over so many fishing fans...it's the real Quality of their products.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr T.",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "My first KastKing Rod",
      "text": "This is my first KastKing rod and I paired it with my new KastKing Speed Demon biatcaster and I must say you can't beat the quality and price. I would compare it to rods costing twice as much. I highly recommend KastKing products and just ordered a KastKing Emerald Eagle spinning reel along with a KastKing Resolute spinning rod. Do yourself a favor and check out these KastKing products.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Oneppo",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "I was hoping for a heavier duty fishing rod,this seem like a very light weight rod",
      "text": "I was wanting a much heavier duty fishing rod,this rod isn't what I was expecting,its much lighter duty,than what I wanted I don't know if it will standup to the fish I expect to be catching without breaking,I'm going to be using 40# test line looking for big heavy fish with a big heavy gage reel to match hope this rod will stand up to my needs,may want to return it in favor of a more robust rod,before I use it,I'll have to think about it some first.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul Cottenier",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Every bit as good as my much more expensive rods",
      "text": "Taking a new fisherman out on 6/28/19 and I needed an additional rod. Purchased this one (KKR-PG2-S76MH) as an extra rod that the new guy can use. Took Friday off to pre-fish and test out the rod. I have a nearly identical rod that I paid about two and half times as much and have been using for a while. The KastKing spec are nearly identical and it performed every bit a good as the much more expensive rod. Great purchase. Will buy more gear from these guys as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "BP1122",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Extremely light weight, flexible, and strong",
      "text": "This fishing rod completely surprised me. I chose this specific pole based on price and the new carbon fiber technology. However, I was amazed at how light it is, especially when compared to my older and heavier pole. It's remarkably flexible, yet very sturdy. While researching new poles, I went to our local sporting goods store and checked out their carbon fiber rods, but found them to be rather expensive. This gives me everything I was seeing at the local store, but at a fraction of the cost. It's also a great match for my new KastKing baitcaster reel.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Not quality products",
      "text": "Bought a rod and reel from kastking and definitely not happy about the quality of the products. Rod broke fighting a 2 pound bass 1 month after purchase",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180915
    },
    {
      "title": "Broke on third test Cast",
      "text": "I liked it as I set it up till it broke off in front of the reel. One slip bobber and three 1/8 oz weights and a #6 hook. Packaging was not damaged inside or out, what a shock. I sawed it off and slipped the extension inside for a four foot in boat rig. I'm very unhappy with this brand and I'd like to have part of that $70.00 back. I certainly don't want it replaced nor will I purchase this brand again. After seventy years this is the first rod I've ever had break and I've had more than my share. Hope to hear from someone..........",
      "rating": 1.0,
      "verified": true,
      "author": "GP",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great quality at an even better price!",
      "text": "This fishing rod was an easy choice when I searched for a rod to match my new KastKing valiant eagle bold eagle series 4000 reel. The fact that the colors matched was just a bonus. The rod was shipped in a thick cardboard tube and suspended in the middle for added protection. The tube was then placed in a long cardboard box for even more protection during shipping. When I removed the rod it was in perfect condition in a plastic sleeve. The quality is right up there and equal to rods that I have spent more money on. I'll be fishing at the beach this weekend and will be able to give the rod its first real test.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph M Martino",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Great rod at a great price :)",
      "text": "I purchased the Perigee II 2-piece rod at 7 feet, Medium Heavy with Fast Action for my new bait casting reel - Quantum PT S3 Accurist. The rod arrived securely packaged and in great condition. When I took it out of the box, I could see and feel the quality in this rod. I’ve not fished with it yet, but I hope to once this whole Coronavirus thing blows over. I also own a KastKing Blackhawk rod at 6’10” Medium with fast action paired with their Lancelot spinning reel. That’s a great setup and easy to transport. Great as a multi species build. Keep it up, Kastking :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Snapped near the tip - right out of the package!",
      "text": "Oh! The excellent reviews! Bull. Removed it from it's sturdy packaging tube, put a good reel on it, threaded line through the guides - then I pulled on the line to give me an idea of the rod's flex and power. This was no abusive treatment - simply pulled down on the line with the reel set at very light drag. It snapped - like a dry twig. I never sent anything back so fast - I'm still steamed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey DK",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "H: 6'7\" Spin-MH Power-Fast-1pc",
      "text": "I purchased this along with the Sharky 3 the other day, however, when I went fishing today I noticed the tip of this rod is broken and I don't have money to send it back. It's a good rod it feels good on my hand, but I don't think I will buy a kastking rod again. The Sharky 3 Spinning reel is good though.",
      "rating": 1.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 2,
      "publication_date": 20190615
    },
    {
      "title": "Quality product for a fraction of the price",
      "text": "KastKing has continued churning out quality products that don't break the bank. I've been using this item for a while now, and it still holds up despite the abuse I put it through. Looking forward to seeing their newer products on the market. If you're looking for something that lasts long, for the fraction of the price (comparing to Berkeley, Shimano, etc.), look no further. Update: Tip of rod broke, and CS is completely ignoring my warranty request.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "All spinning reels don’t fit....beware",
      "text": "Ordered four of the MH rods for Penn Fierce II 5000/6000 reels. Great looking rods, extremely lightweight....but the reel seats on my spinning reels don’t here rods. The threaded area isn’t long enough. Emailed Kast King about the issue....will update this review if and when they reply with a solution. It would’ve been nice to see some type of disclaimer about reel sizes and fit with their rods.",
      "rating": 1.0,
      "verified": true,
      "author": "Tweena",
      "helpful_votes": 2,
      "publication_date": 20190605
    },
    {
      "title": "Snapped on the second time out",
      "text": "I don't get the opportunity to fish much so this rod hasn't got a lot of use. The first time out it was a secondary rod walleye fishing in Canada, where it performed great. This year I took it out on lake erie and it snapped on the second fish. It was only a white perch, I hadn't even got the pole out of the rod holder, and it was too small to take out any drag. Definitely seems like a defect, and it happened right after I was talking up how good kastking was for the money.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "I appreciate the quality of the KastKing fishing line",
      "text": "I have been using KastKing fishing gear for a while now. I enjoy all their reels, rod and drained line I have. But the KastKing Perigee II fishing rod was stolen from my doorstep. So I cannot comment on that rod. I will still give four stars on all the fishing gear I have from them",
      "rating": 1.0,
      "verified": true,
      "author": "Marrero Pedro, Jr",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Great rod at a great price",
      "text": "Bought this rod for inshore fishing and am very happy with the rod’s performance so far. Hard to beat this rod for the price! Edit: I like the rod but the but after only 6 months of light use my tip guide has come loose and spins around. Not sure if I just got unlucky or if it’s just quality control issue.",
      "rating": 4.0,
      "verified": true,
      "author": "W Rhine",
      "helpful_votes": 2,
      "publication_date": 20180913
    },
    {
      "title": "Essentially 2 Rods!",
      "text": "First off: The eye at the end slipped off as I was putting it together the first time. I did store it in my camper for a few weeks before using it. Heat? Or not enough glue in the first place? Anyway, some super-glue and it was new again. The performance of this rod is very good! When setting the hook, I tend to snatch quite hard and swift. Caught many fish so far and the rod is holding up fine. It is not stiff at all, yet not too limber. No issues. 5 star easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy C. Smith",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Quality",
      "text": "I received my first KastKing rod. I’ve never bought a fishing rod online so receiving it today was funny. It comes shipped in a gigantic cardboard tube. The quality of this thing will be understood once you pull it out. The eyelets, reel seat, grip and balanced weight is amazing. I paired it was a KastKing assassin reel. I’m not kidding i went out fishing today and hooked my personal best for bass. Two thumbs way up!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonMacDaddy",
      "helpful_votes": 2,
      "publication_date": 20180908
    },
    {
      "title": "The balance and quality make this a great choice.  Plus the 2 tips with the 2-piece rod.",
      "text": "The Bait Casting KastKinng 2-piece rod has been great so far. Have used it several times. The balance, the feel and the sensitivity are very good. Is of quality construction and the rod eyes are of excellent materials. I appreciate the fact that with the 2-piece rod you get 2 tips. This make the casting of difference lure weights a bonus. It works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Poindexter",
      "helpful_votes": 2,
      "publication_date": 20180603
    },
    {
      "title": "Stiffer than expected",
      "text": "Seems decent so far. Much stiffer than other brands with the same ratings. I would peg the medium power fast action rod as more of a medium-heavy power extra fast action. It seems the fuji guides arent as smooth as the ones I put on my own rods. Starting to wonder if I was sent a returned item sold as new. I will be using this for flipping and pitching rather than the finesse fishing I bought it for.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Outstanding casting rod",
      "text": "Packaging blew my mind, I have bought many poles online and they would always be tossed in a long box with a little paper. Pole arrived in a sturdy tube with foam to keep the pole from moving. Opening the tube and inspecting the pole, quality is spot on my first but not my last pole from kastking. I have not used the pole in the water yet however I feel like it will perform just as good as it looks, and at the price point it feels better than some other high end brands. I have other products from them that have also been outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cast",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Light and confortable",
      "text": "I've owned dozens of fish rods, this is the first one I actually bought. The rest were either hand me downs or gifts. I did some research and thought this rod would be a step up from what I've been used to. I was not disappointed. Came so heavily packaged I thought I'd mistakenly ordered a cannon barrel. After mounting up my favorite reel, I tried a few practice casts... The ergonomics are great, the tip action crisp, and the construction look solid.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Matushenko",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Rod of Beauty.",
      "text": "Let’s start by saying KastKing takes their packaging very seriously. I couldn’t be happier with how secure it was package. Took it out of the package and it is just a thing of beauty. Perfectly accented by carbon fiber and very basic color scheme to help match and casting reel. The two pieces slide together seamlessly and make a nice fit. Feels very sturdy and is light enough I can hold this and boy all day without an issue. I can’t wait to reel in some big mouth bass on this rod. I highly recommend. It looks and feels great with my KastKing elite caster.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Stephens",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Excellent quality",
      "text": "This product was shipped quickly and inside of a very heavy duty cardboard tube for protection. The Perigee II is an excellent quality lightweight pole that has already landed me some good fish after just owning it for three weeks. The pole is laser straight, unlike some of the cheaper offerings on the market, and the handles are very comfortable. I paired the Perigee II with a Sharky III spinning reel and love the combo. It's very smooth and you can fish all day with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Breanna",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "A nice replacement rod.",
      "text": "I bought this rod as a replacement for my fenwick HMG 7ML that had to be sent in for warranty work. So upon receiving the rod, I noticed that one of the guides was bent and the coating on another looked like it was hastily put on. Not a huge issue, but it's something. The action I wouldn't consider quite ML, more of something in between a ML & M. Overall it's a great rod, no real issues and I would recommend it. If kastking reads this, please make a 7' Light action! *wink wink*",
      "rating": 4.0,
      "verified": true,
      "author": "Tou Xiong",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Very Disapppinted",
      "text": "I had to change my review after using it for the first time. It felt great and I loved the sensitivity. But when bass fishing a 6\" worm, I got a tap-tap-tap pick-up bite, and when I set the hook, the rod literally snapped in two. I had to hand retrieve the fish. It was only a 13\" largemouth. There is no way the rod should have snapped on the hookset. It snapped clean and square. I probably couldn't cut it as ny cleaner using cutting tool. I was so disappointed, because I really loved the action and feel of the rod. No rod should snap on a hookset.",
      "rating": 2.0,
      "verified": true,
      "author": "krga94a",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Great rod!",
      "text": "I've been a fan of the Resolute and after reading reviews for the Perigee, I decided to give this a try. I purchased the 7' 2pc heavy rod and have been very happy with it. It's paired with the red Megajaws with Kastking braid. It's perfect for my soft body topwater baits. I do not work for Kastking, I'm just becoming a really big fan of their gear and continue adding to my collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Orawhaty",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "The top of the rod near the eyes is very small",
      "text": "Seems like a decent rod I haven’t used it yet because I’m scared the top of the rod will snap if I’m fishing for bass I’m probably going to get a small reel for it and only fish for trout with it",
      "rating": 3.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 4,
      "publication_date": 20180614
    },
    {
      "title": "Strong, balanced, quality craftsmanship",
      "text": "The Perigee II rod is an excellent quality rod at an affordable price point. It’s my only bait casting rod in my arsenal. I chose the H fast action for flipping and vertical jigging. I paired this rod with the all metal Spartacus Maximus SW bait casting Reel. I fish saltwater inshore and freshwater. This versatile setup has great feel and the carbon blanks are super strong. This rod is half the price of my Shimano Trevala S spinning rods and has stood up to my expectations. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "John A Flores",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Rod Snapped after 1 month use",
      "text": "The rod snapped in half after a lure getting snagged on an underwater structure. I was only using 12lb line which I would have expected to break long before the rod. Warranty is not very good. You have to pay for shipping of the rod to them and then they determine if it's eligible. Even if it is, they will charge you $20 shipping and handling. Not a good deal for a $60 rod. Last time I buy this product",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Solid inshore boat and shore rod! Dock and bridge fishing!",
      "text": "I was extremely skeptical about buying thus, but it does better than the saltwater brands that I've owned! Very powerful and I can cast a mile with a 1/4, 1/2, and 3/4 oz jigheads witj a gulp for flukes, scup, and stocky schoolies! Pair this up with a Quantum Accurist and you're bloody GOLDEN! I've been using it for three weeks and I love it. However, I'd like the handle area to be a bit longer since I do a lot of saltwater fishing. Don't use it in the surf though! Lol",
      "rating": 4.0,
      "verified": true,
      "author": "JTien",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "spinning reel holder keeps coming loose",
      "text": "Spinning rod ML. Feels great. easy to cast. i pushed the rod close to its limits fishing 10 lb carps. flexes very nicely with a good arc. works very good fishing pan fishes also. the only problem i have is the spinning reel holder keeps coming loose. if they added a ring nut to lock the reel holder in place. it would be perfect. for now i just have to lock tight it in place.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Thao",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "feels great, looks great and brings the fish in",
      "text": "I took it out for the first time yesterday. brought in 3 fish, biggest was 2lbs. felt great, I could pitch and skip the wacky rig with no Issues. This is my 3rd kastking rod, The best looking one i have bought so far and probably the lightest. Tempted to pick up a 2nd. The only thing that I didn't like is how the listing is all over the place. despite my checking 2-3 times I still ordered the wrong rod casting vs. spinning..so just be careful to make sure you get what you want the first time around.",
      "rating": 5.0,
      "verified": true,
      "author": "christopher wilson",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "It broke quickly",
      "text": "It was working great until it broke on my 3rd fish of the day, the first time I took it out. Unfortunately I'm beyond the return date.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 3,
      "publication_date": 20190620
    },
    {
      "title": "Heavy Duty at a reasonable price",
      "text": "Wandered through the local big name outdoor store, looking for appropriately sized gear for an upcoming Canadian fishing trip. Need something capable of throwing 1+ oz hardware. Everything I found in that range was well in excess of $100. Did a little searching online and came across KastKing. Bought two rods, both in heavy. Also picked up one of their reels. Haven't had a chance to use them yet, but I have no doubt they will be up to the task of 20+ lb fish. It won't be the equipment's fault if I don't land em. Looking forward to it.",
      "rating": 5.0,
      "verified": true,
      "author": "schilcur",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Very impressed with KastKing Perigee II 7'Med 2-piece FA rod.",
      "text": "So far, I am VERY impressed with my new KastKing Perigee II 7'Med 2-piece FA rod while also using my new Centron 3000 reel. On just my second cast with the new setup, I caught a nice 2lb bass using 20lb Spiderwire Moss Green braid and a 10lb Berkley Vanish Flurocarbon leader. Lure used was a Owner Ultrahead shaky type 3/32oz shakyhead with a Googan Baits drag-n-drop 4\" Brown Gill. Can't wait to see what else I can catch with it!",
      "rating": 5.0,
      "verified": true,
      "author": "D. J. Montemayor",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "So far - great",
      "text": "The rod feels very light but solid. The handle and the components feel like high quality - and the action seems right on for what I purchased - MH. Shipping was excellent and packaged well - came in a sturdy cardboard tube inside another box. Will be testing this in Saltwater Channels and a couple of lakes nearby and will expand on the review with fish pics.",
      "rating": 5.0,
      "verified": true,
      "author": "Amir NC",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Light weight but very strong",
      "text": "I love this rod! This is the first bait casting that I've bought in over 10 years, along with a KastKIng Stealth reel. Didn't know what I was missing! I've thrown away my old clunky Abu Garcia bombs. It's very light weight but both rod extensions are VERY strong. They make hauling bigger fish out of the water a breeze. I got the 7 footer which helps casting long distances. I'm adding another one to my wish list for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Bama Biker",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Product arrived damaged",
      "text": "Product arrived broken, both tip and bottom sections damaged. I ordered this rod for my brother as a gift because he love kastking rods and reels and he waited for 18 days for product to arrived but now he have to returned it. Update: after returned and exchanged for new rod, shipment was a little late again but fishing rod was good and not damage.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "It's okay, need work on the fitting.",
      "text": "Rod is light, and finish is good but fit was not good. The two top tips were of different size hole diameter. Both were undersized and would not completely seat in. Had to carefully sand down the diameter so that it would fit the rod with the larger diameter. After that was done, at one was seated completely and the other was close enough but strong enough to hold.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Nice Rod!",
      "text": "We have a few of these and love the action of these rods. They've always come extremely well packaged, but this one was not so fortunate, looking like the shipping gorillas got the best of it. The rod seemed to be undamaged, but after a few times out on the lake it snapped right at the spot where the tube had broken in half, so it was obviously stressed. The replacement rod was on the way before we even shipped the damaged one back, so all is good!",
      "rating": 5.0,
      "verified": true,
      "author": "NB",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "20% off sealed the deal . AND WHAT A DEAL!",
      "text": "Bought the 7'4\" and Just got this rod today. I really like the power of it. As a bank fisherman who covers a lot of shoreline, I need rods like this that are versatile. It can go from worming to flipping pretty well . Would work good for jigs too. I would say best fit is heavier spinner baits, buzz baits and frogs....but like I said , you will notice the versatility right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "As good as the best.",
      "text": "I fish a lot . Probably 200 days out of the year. I buy a lot of gear and most is on the high end. I wanted more quantity and have had so many issues with higher end poles/ reels . It's just too expensive to have multiple poles and reels on hand . I gave kastking a shot and as of now im changing all my gear over . Its less expensive , shows well, and i nicer than my most expensive gear. As of now i have not had to replace a single reel, pole , or there string. I have used my gear in saltwater as well . Not a single problem yet .",
      "rating": 5.0,
      "verified": true,
      "author": "Sdont care",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "AMAZING STRENGHT! Went out to jones beach and hooked ...",
      "text": "AMAZING STRENGHT! Went out to jones beach and hooked into a 4.5 foot Bluefish weighing 14lbs. I did not think this rod would hold up BUT it did back to back to back!!! I even caught a 4 foot shark as well. This rod bought in 5 Huge Keepers, I am impressed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20180515
    },
    {
      "title": "Technially two rods for the price of one",
      "text": "Great rods. A little on the stiff side, but I was surprised on my first hook set that the tip responded very well. I like to switch between bass and crappie fishing to catfish fishing, so the M to MH tip switch is awesome! I paired it up with a KastKing Sharky III 3000 baitfeeder reel. Hope to see a H or XH version soon in 6'6\" or 7'. Would be great for the kayak.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin-scott \"Catterman\" van Vlijmen",
      "helpful_votes": 2,
      "publication_date": 20180210
    },
    {
      "title": "Great Fishing Rod",
      "text": "The rod came extremely well pack. Some of the older reviews complain about the round tube being damage. Well Amazon listen and now they put the tube inside a box for extra protection. The rod looks very nice and has a nice flex. My son really likes it. The lifetime warranty on the top section was an unexpected extra. The finish and materials look really good.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob C",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Unbeatable for the price",
      "text": "Comfortable Eva handles and lightweight construction make this rod easy to use all day. The rod performs true to power and action specifications and I have not had any issue with it whatsoever. For the price point I have never had another rod from any brand perform as well as this one has so far. Between their reels and other fishing accessories I have quickly become a believer in KastKing and their \"affordable innovation\" business model.",
      "rating": 5.0,
      "verified": true,
      "author": "Zack ",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Awesome Rods for the price of 1!!",
      "text": "I purchased the Perigee II to pair with my Kastking Spartacus Baitcasting reel. I love that it came with medium and medium heavy tips! I can fish different applications now. The rod itself is super light and of great quality. Just in time for Fall bass fishing. Can't go wrong with Kastking. I also have their Megatron reel paired with the Kastking Resolute rod which I have been using for fresh and saltwater fishing. KASTKING ALL THE WAY!",
      "rating": 5.0,
      "verified": true,
      "author": "I am NY",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "5 stars worth every penny",
      "text": "I highly recommend all Kastking items I've used thier reels for awhile and I'm highly impressed with them so I needed some new casting rods and wanted one a little more sensitive for my Texas rigs and crankbaits and this is the rod I chose! Super sensitive and the casting ability are amazing! You can really load these rods up for those long cast!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Good lightweight rod",
      "text": "Great rod. I got the ultra light version. It is light weight and a sensitive rod as expected for an untra light. You can easily detect the bite from trout and pan fish. Had a good and comfortable grip and reel seat. This is the second rod I have used as the first one the tip broke the first time out. Kastking fixed the issue in a timely manner and got a new rod out to me with little issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Vpomp",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "AWESOME!!",
      "text": "This is the 7th KastKing product I’ve purchased, and just like everything else; I cannot brag enough about how good of products these are. The rod was packaged nicely, is WAY lighter than I expected, and is made of very good parts. This rod will give my G-Loomis rods a run for their money, hands down. Great Job once again KastKing!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda W.",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Very light rod and likes very heavy fish. (Big Bass)",
      "text": "The only 7'6\" two piece rod I could find for a decent price,so I bought one to try it out. I used it for a full season approx. 2 to 3 times a week thru the summer. Best rod I've ever fished with, so I just bought 2 more because they were hard to get always sold out. If you find one in stock buy it. You won't be disappointed. Just to show this is for real I also bought a kastking assassin reel. It never made it thru the season. Very dissapointed. Don't know if I want to risk buying another reel.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell Thomas",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Incredible Value for Money",
      "text": "I love this fishing rod. It is lightweight, allows for great accuracy, and 7'1'' long at the same time for nice power and capability. I have fished with a variety of lures and baits to test it and it is a high quality overall exceptional rod. You can't be the pricing and value of these. I love the way it feels too. I'm sold!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay C.",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Love this rod! Best deal for the money",
      "text": "KastKing is my favorite for rods reels and spools of line. They're quality is great but not as pricey as other brands. Rod was shipped in a plastic sleeve inside a very sturdy tube. Last year I had ordered another brand which was shipped & rattling loose in a cardboard box. Several eyes were bent. Im well pleased with KastKing products.",
      "rating": 5.0,
      "verified": true,
      "author": "sherri",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Never going back, Kastking for life",
      "text": "This rod is awesome, I’m about to order a couple more as it’s one of the most versatile rods I’ve ever owned. I do tons of inshore saltwater fishing and it’s held it’s own on a number of larger species. It’s lite so I don’t get cramps in the hands and wrist, and crazy sensitive. I have the 7 ft M/H for this application but from what I’m told they are great for freshwater as well. Absolutely recommend it , 5 stars indeed!!!",
      "rating": 5.0,
      "verified": true,
      "author": "It's a great day",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Redemption.",
      "text": "So this is my second perigee 2 rod as the first one broke on the first cast for some reason. So far it's been really great. I think they updated the fuji o-rings because there's a little tag that said so (which I didn't get on my first rod). All in all, it works really well and it's super smooth. The first rod that I got was a baitcasting rod, but decided to go for perigee for my spinning setup. Real fun to use and the box that came with it is top notch. Really protects the rod with the included packaging foam and all. Really pleased",
      "rating": 3.0,
      "verified": true,
      "author": "Adam Hamsani",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Wow! What a buy. High quality, low price.",
      "text": "I must say that i am impressed with the quality of KastKing products and this rod is impressive. It has features and qualities of rods that cost twice as much if they had other brand names on them. My only concern was that the rod is a two-piece rod, but I watched the KastKing Youtube video where they caught several big smallies with this exact rod and that put my mind at ease. If you want a good quality rod that won't bust your budget or have your wife mad at you for spending too much on fishing, this is a good rod to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllip Davis",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "2020 Graduation Combo",
      "text": "Haley putting together her first baitcaster combo, and she was thrilled... I knew what she wanted, but I let her pick the color of which Crixus reel. Then I helped her select the Perigee II in a Medium/Fast action for a good all around rod. Thank you Kastking for great quality & affordable fishing gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane j McNair",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "From hero to snapped.",
      "text": "I really love this rod, it has been my favorite set up for the past few months. For the price it has incredible feel and sensitivity. However, I hooked into a medium sized trout the other day and the rod snapped. I got the fish in but the rod is useless now. I'm left wondering whether it was a defect or something I did. Perhaps we'll never know. That is the only reason I don't put five stars all the way across. I liked the rod so much I'll most likely reorder anyway.",
      "rating": 3.0,
      "verified": true,
      "author": "Teresa M. Ratliff",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Kastking Products Rock!!",
      "text": "Kastking products never disappoint and the Perigee II rod that I bought is no different! Its quality is absolutely 2nd to none!! It's EVERY bit, if not higher quality as big name mfgs rods at half the price!! I'm impressed!! I have a couple spinning reels from Kastking and I like them very much and have caught many largemouth bass with them. Now since I've received this AWESOME 2 piece casting rod, I had to order a baitcasting reel to go with it. I will write a review on it later. Can't go wrong with anything Kastking offers!! Price/quality and performance!! What more could the serious angler ask for!?! ~Greg~",
      "rating": 5.0,
      "verified": true,
      "author": "Green L.",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "great 2 pc rod",
      "text": "Our new travel trailer has a spot prefect for a two pc rod. Typically I like 1 pc. But thought I would try this. Casts well, I use it mostly for inshore saltwater. I hose it down after I use it and no signs of corrosion I have more expensive rods that I can't say that about. I will purchase another later.",
      "rating": 5.0,
      "verified": true,
      "author": "Stoner51",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "A really nice rod at a really great price!",
      "text": "I am impressed with this rod. I bought a 7 foot spinning rod in medium heavy action. It feels stiffer than my older medium heavy rods, probably because it's a faster taper, which is good since I plan on using this rod for northern pike during the colder months, and in windy conditions using heavy lures. The only thing that I can complain about is the split grip. I wish Kastking gave me the option to get this rod in a full grip. There is nothing wrong with the split grip, I am sure plenty of folks love it, but I prefer a full grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony S.",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "The grip is too small",
      "text": "Thus pole is very flexible, responsive and light. It hooks fish well. However the grip for your left hand to hold the pole while you are reeling in a fish is too small. It makes the process difficult, especially for a +1 pound fish. OK for people with very small hands. OK for my grandchildren",
      "rating": 2.0,
      "verified": true,
      "author": "oldsifiguy",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Surprisingly impressed after 25 year absence.",
      "text": "Being recently retired I decided to get back into fishing. I always enjoyed the sport in my younger years and after an absence of 25 years I decided to purchase this rod being a little nervous about the value. I just had purchased a, expensive for me, DC reel and the budget didn’t leave much left. I have to admit I’m very impressed with the rod. The appearance is top notch and I have had a great experience fishing again. The quality for the cost is great and the two piece design works best for my needs. Enjoying fishing again thanks to Kastking.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca H",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Very Good Rod",
      "text": "This rod performs well, very good sensitivity, strong, and I do like that it comes as a 2 piece. Lots of people really liked the handle but for me it's just OK. I just can't seem to get comfortable with it but that's just me. It's great in every other aspect and the price is very good for the high quality you get.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Broke after 2 uses",
      "text": "I live in rural Alaska, where fish are bountiful. I have several rods, and I planned on having this one be my trout rod. The first time out, it seemed to work extremely well. Next time out (about a week later), snapped in two from a very small trout. Same line, same reel, same creek as the week prior. It is a cheap rod, but I expected to get at least a season out of it. Disappointed with the results, I'll stick with Ugly Stik from now on.",
      "rating": 2.0,
      "verified": true,
      "author": "Isaac T",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "great value goid quality",
      "text": "actually the quality of the the rod is very good light weight and sensitive . I paired it with the speed demon perfect match. easy to transport and the option to go medium or medium heavy. landed a 16 lbs king salmon on the .ca Delta the rod performed flawlessly. price point is a great value period . if I have one take away it would be the hook keeper on the rod is a little flimsy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170928
    },
    {
      "title": "Well built rod!",
      "text": "Didn’t know what to expect for the money but it seems like a really nice rod. Well built with good components. I especially liked the eyes. They were all lined up with no bent ones. Maybe that’s because it was shipped in a beast of a cardboard tube. Would I buy it again... absolutely!",
      "rating": 5.0,
      "verified": true,
      "author": "Norman Blair",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Most reliable Rod",
      "text": "I love this KastKing Perigee II Fishing Rod. I have other rods and most of them don't compare to this one. This is one of the most reliable rods I own. From now on I will be ordering my Fishing rods from KastKing. Thank you KastKing for the fantastic Rods and Reels.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Durability",
      "text": "I was very close on purchasing the St. Croix bait casting rod Mojo Bass until I stumble upon the Kastking rod on google and took the leap of faith on ordering one through amazon. I am so happy for the purchase, I love the balance on this rod along with the carbon fiber look, super lightweight and gotta love the Fuji Guides. Plan on going to purchase the 2 pcs medium spinning rod, like having 2 rods in one.",
      "rating": 5.0,
      "verified": true,
      "author": "Oakwood",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Perfect balance",
      "text": "I didn't know that a quality casting rod could make such a dramatic difference in fishing. This rod is the perfect match for my bait casting reel. I've used spinning reels and rods before, so I had to adjust my methods. When I started to \"catch on\" I realized the potential of a quality rod/reel combination. It feels right.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard K. Williams",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Well worth the price!",
      "text": "I've been looking for a small setup to do trout fishing on the creeks of PA and in my opinion, I didn't go wrong picking this rod up. I paired it with the valiant eagle size 1000 reel(also reviewing at the same time), and this rod exceeds what I was expecting from it. With the sensitivity of this rod, not only could I feel the lightest of hits, but it also had the power to set the hook with no issues. I couldn't be happier and highly recommend looking into more of the KastKing Product!",
      "rating": 5.0,
      "verified": true,
      "author": "John Markovich",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "ZERO RISK investment in quality gear.",
      "text": "Two rods for the..actually LESS than the price of one. When you consider the quality of the components used to produce these rods..there's just no comparison. I chose the M/MH and paired it with the Sharky III. I'm stoked. If you're wondering about one buy it, try it, and if you don't like it you can just send it back with no hassles. They stand behind EVERYTHING they make.",
      "rating": 4.0,
      "verified": true,
      "author": "Lemuel Clarence Cabrera II",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Amazing!",
      "text": "I've been an ugly Stik fan for years. Over the last month I've been using Kast King and I'm loving it. I will eventually switch out my rods and reels. This Rod is light weight, casts like a rocket yet it feels sturdy. ****Update. I've used it for several weeks in a row due to Covid and I still love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kin San Nicolas",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great value and quality.",
      "text": "Very sensitive tip. Well built and very light. Have it paired with the KastKing Valiant Eagle 2000! My wife tried it this past weekend and commented on how it felt lighter than her 6 ft ladies set up. Great for bass or panfish. I won’t spend $200+ on a rod/reel again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Clingaman",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Good gear but unfriendly rep",
      "text": "Try to a little chat with Kastking rep and was VERY VERY disappointed. Unfriendly , not very helpful and greedy to honor a small inexpensive promo for a roll of fishing braid. OKUMA has proven all around better gear. They just lost a customer to Okuma.",
      "rating": 4.0,
      "verified": true,
      "author": "Claude",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Superb Purchase",
      "text": "Absolutely love this rod. Was looking for a nice but inexpensive rod for inshore fishing to match up with my KK Sharky III reel. I decided to go with the KK Perigee II as an alternate to more expensive brands I usually purchase. Together this is a great light weight setup that was originally supposed to be primarily for guests to use instead of my expensive setups. I like this setup so much that I am now using it daily for myself. Now I'm gonna have to get another set for my guests. Thanks KastKing.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "The ends don’t fit into the base.",
      "text": "I am love kastking products from their lines to the reels. Unfortunately for the last two products I’ve bought of theirs, it’s been disappointing. The filet knife wasn’t sharp but I was able to sharpen it by myself and it’s working well now. This two piece fishing rod was bought because I like to break down my poles and bring them everywhere. The rod tips however did not fit into the base. No matter how much I worked on it, it still would not connect. I used grease and wd40. The pieces just would not connect. I still use it for the time being but if I do catch a big one, I’m sure the top will pop right off.",
      "rating": 2.0,
      "verified": true,
      "author": "Davis Ngo",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Broke in half casting",
      "text": "Loved the rod at first, sensitive, great action. Used it a few times striper fishing on Texoma, and this past week I went to Port A to catch some redfish. Rod worked great caught some small redfish flounder and such. Moved to a new spot casted out and the rod snapped in half. This rod has been stored inside and has been taken care of. I have their bait casting reels and spinning reels and not had an issue once out of them. But that will be the last rod I get from kastking.",
      "rating": 1.0,
      "verified": true,
      "author": "Bear T.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Enjoyed the rod, tip busted on me on second trip out.",
      "text": "It's a really pretty rod, and I used it for walleye fishing up in Canada. I enjoyed using it, and it had the backbone I needed. However, during the trip the top eyelet broke off about an inch behind it. Based off the old reviews, my worries came true. I'd love to see if the company could send me out a new rod tip. Or at least a refund, it broke just setting the hook on a fish.",
      "rating": 2.0,
      "verified": true,
      "author": "Cameron Livingston",
      "helpful_votes": 0,
      "publication_date": 20190822
    }
  ],
  "product_meta": {
    "title": "KastKing Perigee II Fishing Rods - Fuji O-Ring Line Guides, 24 Ton Carbon Fiber Casting and Spinning Rods - Two Pieces,Twin-Tip Rods and One Piece Rods",
    "rating": 4.5,
    "feature_bullets": [
      "AMAZING QUALITY CARBON FIBER BLANK - All Perigee II two-piece fishing rods are constructed with Toray 24-ton carbon matrix KastFlex blank technology for power, strength, and accuracy. Available in 29 sizes from an ultra light spinning fishing rod to a heavy 7’ spinning rod and a baitcaster rod ranging from medium to heavy power. Use them for bass fishing rods, trout fishing, walleye fishing, or as a salmon rod, catfish rod, steelhead rod, or saltwater fishing rod.",
      "PREMIUM COMPONENTS - KastKing uses the best quality components in a Perigee II fishing rod. World renowned Fuji O-Ring line guides, tuned ergonomic graphite high-strength reel seats, high-density EVA grips, Saf-T Keeper hooker holder, the finest sensitive “bare and beautiful” finish carbon fiber for light weight rod blanks, and outstanding cosmetics. Rod action ranges from baitcasting rods that are fast action rods to spinning rods that cover moderate, moderate fast, and fast action rods.",
      "SMOOTH POWER - KastKing PTS (Power Transition System) hybrid spigot joints in Perigee II 2-pcs rods transition power smoothly throughout your fishing rod blank. Specialized high technology computer control wrapping at four angles (0⁰, 45⁰, 90⁰, 135⁰) keeps the power flowing. Whether you choose an amazing and affordable Perigee II casting fishing rod as a bass rod or a KastKing spinning rod as a walleye rod, or for any species, you will agree it feels exactly like a one-piece fishing rod!",
      "STEP UP - Throw away your old technology ugly fishing pole and step into the future of fishing with a dynamic KastKing Perigee II high performance casting rod or spinning fishing poles for bass fishing, trout fishing, cat fishing, walleye fishing or any technique for freshwater fishing or saltwater fishing for red fish, striped bass, snook and more! Total Peace of Mind Warranty. KastKing is an ICAST award winning manufacturer.",
      "BEST VALUE –KastKing Perigee II graphite fishing poles are one of the best value rods in the fishing tackle market! Don’t be confused by the low price. Even better, these are simply one of the lightest rods you'll find under $100. You'll fish all day without fatigue and have power to spare because of our high carbon blanks that offer a powerful, yet light weight rod."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 9, 2017",
      "Manufacturer": "Eposeidon",
      "ASIN": "B0725HDN77",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Fishing",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Rods",
      "Hunting & Fishing"
    ],
    "price": ""
  }
}