{
  "website_summaries": [
    {
      "verdict": "A sturdy shoe for very active kids that lasts under hard wear.",
      "pros": [
        "Durable shoe with a true fit",
        "We love how it comes with a special insert to help keep down odors",
        "Offers outstanding grip and traction",
        "Moderately priced"
      ],
      "cons": [
        "Not a great choice for wide feet"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great, but runs a full size small.",
      "text": "These are great shoes. My son loves them. He won't get to wear them long though as they run really small. He is normally a 3 1/2 so because of what everyone said, I bought a size 4. The size 4's are also on the small size, should have gotten 4 1/2 but he needed them right away for school, so i will be buying the next size up in no time I am sure. Be sure to go one FULL size up, not half size (so if your child is a 3 1/2 go with a 4 1/2). Otherwise, he loves them. Says they are very comfortable and easy to run in at school.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Woo",
      "helpful_votes": 2,
      "publication_date": 20170920
    },
    {
      "title": "Get a 1/2 size larger to be safe.",
      "text": "My son loves this shoe. It looks exactly as the picture shows. The colors are bright and vibrant. The shoe looks really nice. My son wears a 6.5 in nike, sperry, and even under armor, however these shoes run a little tight. I recommend getting a half size larger.",
      "rating": 4.0,
      "verified": true,
      "author": "Staciii",
      "helpful_votes": 4,
      "publication_date": 20160909
    },
    {
      "title": "Disappointed! Shoes different size and different model!",
      "text": "Very disappointed in this latest shipment. The first time was great. I simply did a reorder from the purchase I made a couple weeks prior. The price was right and my son liked the shoes - he wanted to wear them for basketball starting tomorrow! Except this package had one 4 size shoe and one 4.5 size shoe AND to top it off, they are different styles. Seriously. Everything that could go wrong with this order has gone wrong. Now I have to pay to send back something they messed up. This absolutely surprised me about Amazon. I've come to know them as a better quality company than this. Why can't they overnight me the correct pair for free!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180112
    },
    {
      "title": "Mediocre. Runs small and narrow.",
      "text": "The quality of these sneakers look just OK. The lightweight construction won't give good foot support. The shoes are narrow and run small. I ordered my son a 5.5 (big boy size), but they were way too small. His Sketchers size 5.5 shoes fit perfectly. These UA sneakers were sent back.",
      "rating": 3.0,
      "verified": true,
      "author": "NYRock-a-way",
      "helpful_votes": 2,
      "publication_date": 20170328
    },
    {
      "title": "BETTER THAN NIKE",
      "text": "I bought these shoes for my grandson. This is the 4th pair of under armour shoses I have purchased for him. They wear SO much better than Nike's. They are very durable and he says they are very commfy. I wash them in the washer and let them air dry, they come out like new. If your boy is hard on shoes Under Armour shoes are you.",
      "rating": 5.0,
      "verified": true,
      "author": "Irene J. Meyer",
      "helpful_votes": 2,
      "publication_date": 20170308
    },
    {
      "title": "I'm super impressed with UA's product quality",
      "text": "These are the only shoes my 10yr old has not completely destroyed in a matter of months. He'll actually outgrow the shoes before their life is up. I'm super impressed with UA's product quality. So much so that I bought a pair of their hunting boots for myself. Definitely gained a loyal customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "these are ok",
      "text": "This shoes is for 8 year old, he likes them. But after a month of use I can see thread hanging from them, it does not look like they will last long. However this happens to most of the shoes I get for him, I just expected more from this brand",
      "rating": 4.0,
      "verified": true,
      "author": "Bill G.",
      "helpful_votes": 5,
      "publication_date": 20160420
    },
    {
      "title": "Comfortable and sturdy so far",
      "text": "So far, these have held up well, though as my boys have worn them only a couple of months I am holding off on giving 5 stars for now. They report that these are very comfortable. Both of my boys have somewhat wide feet but wear these comfortably in a regular size.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle M. Maze",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "My son loved them and to me they seemed better made than ...",
      "text": "These held up very well to rough use throughout the second 1/2 of a school year. My son loved them and to me they seemed better made than many sneakers in this price range.",
      "rating": 5.0,
      "verified": true,
      "author": "MHR",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Amazing value/quality for under 40$",
      "text": "These shoes are well worth it...my son wears a size 5 normally & I ordered a 5 & were very small so went up to a 5.5 & perfect. They r very flexible & fit snug against the sides of feet to help when they are active. Bought him a s imiliar pair n the past & they held up well. These r DEF worth the purchase & the price is amazing for under 40$",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Hard. Not like the kids UA shoes of 2016,17,18",
      "text": "Hard. Does not have a cozy bouncy foot bed like all of my other UA kid tennis shoes do. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "mommaA",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Not very durable",
      "text": "The shoes look very nice. My son has had them for only 2 and a half months. He wears them everywhere and the soles of the shoe are worn down already. I've purchased more economical shoes for him that have lasted longer. This is the first Under Armour shoe I've purchased for him, and it may be the last.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff S.",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Good looking shoe at a great price",
      "text": "Cute shoes for my 7 year old. He likes them too. They're comfortable and hides dirt well. Time will tell as to how long they'll last. He's extremely hard on shoes so hopefully they will last longer than his Sketchers did.",
      "rating": 4.0,
      "verified": true,
      "author": "Marleesmomma",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "but the quality isn't great for the price",
      "text": "My son loves these shoes, but the quality isn't great for the price, in my opinion. He plays sports and runs around a lot, but I don't think they should be falling apart after 2 months of use.",
      "rating": 3.0,
      "verified": true,
      "author": "Mel_W",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "when the shoes just put on it’s fine but not feel comfortable after the kids start walk",
      "text": "It’s little smaller than the normal size , when the shoes just put on it’s fine but not feel comfortable after the kids start walk ,maybe buy one size bigger will be perfect!",
      "rating": 3.0,
      "verified": true,
      "author": "Yvonne ",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "They are very comfortable on the playground and have withstood a ton of ...",
      "text": "My 11 year old loves these shoes. They are very comfortable on the playground and have withstood a ton of running and other sports, whereas other shoes usually have delaminating soles or holes at this point.",
      "rating": 5.0,
      "verified": true,
      "author": "amelia",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Great shoe for the price",
      "text": "Great shoe for the price. Well made. I actually bought them for myself. I wear a women's 8 and got the Youth 7. Should of ordered the 6.5.",
      "rating": 5.0,
      "verified": true,
      "author": "Verna Askwig",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Good Quality",
      "text": "These fit well, hold up well, look nice, and are comfortable! We will definitely be purchasing these again for my boys",
      "rating": 5.0,
      "verified": true,
      "author": "BhamMommy",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "4 months later and still look as nice as they did the day we bought them",
      "text": "4 months later and still look as nice as they did the day we bought them. That's saying a lot after an 11 year old is running in them everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "My son loves these shoes. We always get Nike ...",
      "text": "My son loves these shoes. We always get Nike, but he tears them yo within weeks. Hoping these last a few weeks longer!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate+4",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "My child loves them!",
      "text": "The look nice. The fit well. They are comfortable. My child loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Yoanni Green",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Five Stars",
      "text": "My son is happy with these sneakers, fit as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer opinion",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Five Stars",
      "text": "My grandson loved them they seem to be holding up well",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia B. Jennings",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "My son loves his shoes",
      "text": "My son says these are very comfortable. He wears them almost everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Andersen",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Five Stars",
      "text": "No issues. My son ran a 10miles race with them.",
      "rating": 5.0,
      "verified": true,
      "author": "William James",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "It is confortable and it looks great!",
      "text": "My daughter loves it. It is confortable and it looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Thomson",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "They seem like decent shoes otherwise",
      "text": "My son is a size 4, but the 4 did not fit properly. They were too small overall, and too narrow. They seem like decent shoes otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "G. Lewis",
      "helpful_votes": 2,
      "publication_date": 20160831
    },
    {
      "title": "fast shipping",
      "text": "My ten year old loves his new shoes. The fit perfect and were super comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Kerra Nguyen",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "I like them. They fit my 6 yr son well ...",
      "text": "I like them. They fit my 6 yr son well with a little room to grow without flopping off of his foot.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanisha Oliver",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Five Stars",
      "text": "Great shoes and a great price. They fit my son perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "They were of good quality and looked good",
      "text": "Fit my son perfectly. They were of good quality and looked good.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Clause Jr",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Five Stars",
      "text": "My son loves them; he wears them all day every day.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Chancey",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "For a fast growing 8 year old I would like for him to have outgrown them",
      "text": "For a fast growing 8 year old I would like for him to have outgrown them, instead he quickly wore them out (as in 3 months of wear and they were no longer nice enough for school) - he said they were super comfy though -",
      "rating": 3.0,
      "verified": true,
      "author": "Alecia Hughes",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Repeat purchase",
      "text": "My son wears these for PE at school and for playing at home. They wear well all day and fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "He said they fit great.",
      "text": "Ordered these for my son. He said they fit great.",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree Phillips",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great Quality!",
      "text": "Great quality sneaker! My son says they're very comfortable. True to size.",
      "rating": 5.0,
      "verified": true,
      "author": "JE",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Great sneakers!",
      "text": "Underarmour are great sneakers - this is our 2nd pair. They seem to hold up longer than others - but my son is very tough on shoes. These fit perfectly and are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "ACS, San Antonio, Tx",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Best school shoes ever!",
      "text": "its very light, and my 9 years old loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "IB",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Five Stars",
      "text": "Worked out great, they were a birthday present. My son loved them",
      "rating": 5.0,
      "verified": true,
      "author": "AWS",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Three Stars",
      "text": "My son likes them but beware they do run small.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve C",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "name brand to make my son happy, and they fit really well",
      "text": "Reasonable price, name brand to make my son happy, and they fit really well.",
      "rating": 5.0,
      "verified": true,
      "author": "'merica",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Great shoes",
      "text": "These are so cute in person. My son loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "samantha shoup",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "Son loved them. They are not flimsy like some and ...",
      "text": "Son loved them. They are not flimsy like some and fit true to size. My sons feet are a bit narrower so these fit nice.",
      "rating": 5.0,
      "verified": true,
      "author": "KDM",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "disappointed 😏",
      "text": "Too small than expected also arrived late and was charged for return shipment.....disappointed 😏",
      "rating": 1.0,
      "verified": true,
      "author": "Ram Atmakuri",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Two Stars",
      "text": "Shoe top started to fray after a week of wear",
      "rating": 2.0,
      "verified": true,
      "author": "David A Kobes",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "They seem to run a bit on the smaller side ...",
      "text": "They seem to run a bit on the smaller side, but a very cute and neat looking tennis shoe for my son. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Five Stars",
      "text": "no complaints, item exactly as described. Time will tell if the durability is as advertised",
      "rating": 5.0,
      "verified": true,
      "author": "The Brotherhood",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Too small",
      "text": "Shoe size are at least a size or two short than Nike/ Adidas",
      "rating": 1.0,
      "verified": true,
      "author": "namita vadhera",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Five Stars",
      "text": "They got here quickly and fit perfect. They look great on my son. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "narrow widths",
      "text": "Shoes were nice, but are smaller than expected. They are noticeably narrow from the same sized Nike shoes. 4 stars because the shoes look nice, just was narrow.",
      "rating": 4.0,
      "verified": true,
      "author": "Koala_Shin",
      "helpful_votes": 3,
      "publication_date": 20160830
    },
    {
      "title": "Slick sole",
      "text": "My son loved the shoes my only negative would be the sole is a bit slick. It's not that rubber bottom that I usually get and definitely not the type I would expect on a under armour product",
      "rating": 4.0,
      "verified": true,
      "author": "tricia burns",
      "helpful_votes": 4,
      "publication_date": 20160509
    },
    {
      "title": "Feels very cheap exactly like the sneakers I bought my son in a pinch ...",
      "text": "Should have read reviews before buying. Definitely runs 1/2 to whole size smaller. Feels very cheap exactly like the sneakers I bought my son in a pinch at filler general for $10. Except these were $26!! Don't think they are going to hold up well but we will see",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Cute shoe, however the fit is smaller than the ...",
      "text": "Cute shoe, however the fit is smaller than the other sneakers found on Amazon for this size. We bought one size larger and that one fit perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Iman Asin",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Good shoes",
      "text": "Fits my 11 year old son great. He loves them and I love that they were a good value!",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20160907
    }
  ],
  "product_meta": {
    "title": "Under Armour Boys' Grade School 2017 Running Shoe, Violet Storm/White/Brilliance",
    "description": "Breathable, lightweight mesh upper provides the ventilation you need. Overlays add structure & support without adding bulk. Anti-odor technology applied to footbed to prevent the growth of odor-causing microbes. Full-length cushioned EVA midsole delivers the ultimate lightweight & responsive ride. Non-marking rubber outsole for greater traction with less weight.",
    "rating": 4.4,
    "feature_bullets": [
      "Synthetic-and-mesh"
    ],
    "categories": [
      "Boys",
      "Athletic",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Running"
    ],
    "price": 57.99,
    "specifications": {}
  }
}