{
  "website_summaries": [
    {
      "verdict": "While a stronger chemical such as glycolic acid may be a better choice for issues like scars and wrinkles, this peel is a good pick for helping clear up and control a host of breakout issues.",
      "pros": [
        "Fairly gentle and easy to use with the active ingredient lactic acid – a solution often selected for mild exfoliation and the removal of dead skin cells",
        "Contains plant extracts that soothe skin"
      ],
      "cons": [
        "A few mixed reviews on the results it produces, but many happy customers who reported clearer skin and noticeable differences in break outs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "In a good way! But be careful and follow the directions",
      "text": "This sh#t is strong! In a good way! But be careful and follow the directions. This seems to even work better for me than what is used during a facial. Highly recommend using a vitamin serum afterwards and a strong moisturizer. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth W",
      "helpful_votes": 25,
      "publication_date": 20180508
    },
    {
      "title": "This is very strong be sure to follow the directions ...",
      "text": "This is very strong be sure to follow the directions. Start with about 1 minute on your face and work up to more",
      "rating": 4.0,
      "verified": true,
      "author": "Judy Raineri",
      "helpful_votes": 27,
      "publication_date": 20171029
    },
    {
      "title": "Good value for being a non professional product.",
      "text": "Licensed Cosmetologist review- I liked this product, I've only used it once but it resurfaced my face without major discomfort or peeling. If you have permanent make up make sure that you keep the product an inch away from it because it will strip it. I followed it up with some hyaluronic acid. Total time I left the product on was 3 minutes. Next time I plan on having fresh aloe to sooth and tighten my skin after using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelley D Perez",
      "helpful_votes": 5,
      "publication_date": 20200425
    },
    {
      "title": "I love it. Makes skin smooth and soft",
      "text": "I love it. Makes skin smooth and soft. It gently peels away the dead skin of the surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Aleen",
      "helpful_votes": 11,
      "publication_date": 20180104
    },
    {
      "title": "Very happy!",
      "text": "Works great! Removes the first layer of skin and my skin looks awesome a week later! It really works and is aweome i use this 2x a month! Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "ty",
      "helpful_votes": 7,
      "publication_date": 20180329
    },
    {
      "title": "Smoother skin/reduced acne scars",
      "text": "My very first time using it last night. After one use my skin appears to already be more smoother. My acne scars seemed to be a little less noticeable. I can’t wait until 6 months from now to see how much my scar reduction improves.",
      "rating": 5.0,
      "verified": true,
      "author": "JAMIE",
      "helpful_votes": 4,
      "publication_date": 20190308
    },
    {
      "title": "Salon treatment from my own home",
      "text": "I purchased this after having a professional treatment and loved the result but didn't want to pay a fortune to do it consistently. I leave it on slightly less time than recommended because I have sensitive skin and the results are fantastic. Make sure you have the neutralizing spray to stop the acid from working when you are done and wash gently with warm water. I try to avoid using it after sun exposure but considering how expensive spa treatments are this is insanely affordable and easy to use in five minutes or less.",
      "rating": 5.0,
      "verified": true,
      "author": "dana ",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Excellent Product",
      "text": "I bought this product to use on legs and arms, not my face. I felt I needed something to help tackle age related skin degradation and sun damage. I've only just started to use it but since this is not my first experience with acids, I can already feel the quality in this product. I like that it is a gel formula which means it doesn't run. This will allow the product to absorb and do its job. It's the right strength for the time being and I can feel it working. Overall, I'm happy with it and I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20190925
    },
    {
      "title": "Buy the neutralizing serum with this product!",
      "text": "Be sure to not exceed the 1-3 minutes the packaging recommends you keep the peel on or you may have chapped areas of skin. I've only used this peel twice and am already loving how it helps smooth out fine lines and lighten some sun damage I have on my forehead.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Culp",
      "helpful_votes": 4,
      "publication_date": 20180911
    },
    {
      "title": "Professional Product",
      "text": "I did my first acid peel with this lactic acid product. It was excellent. Make sure you have a neutralizer ready because you will need it quickly. That lactic acid works fast. Three minutes worked well for me but I don’t have sensitive skin. Skin was smooth and shiny.",
      "rating": 5.0,
      "verified": true,
      "author": "DIANE GRAHAM",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great for exfoliating at home",
      "text": "I would not recommend for sensitive skin, but It does a great job of exfoliating at home. I use about once per week and get alot of compliments on the smoothness of my skin. Great value for the money, as you would pay several times the purchase price to get a peel like this at your local spa!",
      "rating": 5.0,
      "verified": true,
      "author": "donna yates",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Expected to peel",
      "text": "I expected it to peel as I left it on my skin for over 7 minutes. I guess that’s alright. Each skin reacts differently. I have applied it 2 this week already. So far not much of a difference.",
      "rating": 4.0,
      "verified": true,
      "author": "JussG",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Amazing and priced so great!! Best lactic I’ve ever used",
      "text": "I love this chemical peel. It’s a gel consistency which I haven’t ever had before but I love it, makes for super easy application. This product has helped with my hyperpigmentation which is why I bought it. And the price is so great considering how much you pay in a salon for one lactic acid peel.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Are used this on my toes!",
      "text": "I was actually looking for a product to put on my toe cuticles. They are always so dry. I am so excited to say that it works! This is a product you have to be very careful with though. I would say probably put too much on, but it worked out OK. For my purposes, it's five star",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Dunn",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Gentle and effective",
      "text": "This product works exactly as expected. My face feels smooth and healthy after using this product, plus it's gentle enough to use on my rosacea skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 2,
      "publication_date": 20191013
    },
    {
      "title": "Not good. Money wasted!!",
      "text": "Waste of money!! No peeling just gonna make your skin dry and looks wrinkly. If I could return this product I would gladly do. It doesn’t do anything but mess up your skin. If you looking for peeling definitely this product is not for you. I don’t see any use for at all",
      "rating": 1.0,
      "verified": true,
      "author": "Gift",
      "helpful_votes": 3,
      "publication_date": 20181126
    },
    {
      "title": "Be careful to follow directions carefully.",
      "text": "I like to give myself facials.At my age 59 i like the results I get with the product.. Thank you .",
      "rating": 5.0,
      "verified": true,
      "author": "shawnie robey",
      "helpful_votes": 2,
      "publication_date": 20190629
    },
    {
      "title": "Strong and effective.",
      "text": "This is strong. Read the instructions. Don’t improvise with this stuff. I use it once every two weeks and it is helping to bring things to the surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Did not help me",
      "text": "I followed all directions and tried several times. Now, the product bottle arrived without a box or instructions-so I should have know better. I would not advise wasting your money on this brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Good product",
      "text": "It’s a reputable company. As a professional clinical aesthetician it does it’s job. This Peel is a gel, and has easier application without running into areas not intended for.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer W.",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Alright",
      "text": "This product works, it makes the skin sentitive, but it is not for sensitive skin. it makes sense tho, its acid, it won't be sensitive.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "It works great and I peeled leaving my skin smoother and clearer ...",
      "text": "This is a very intense peel and should be used only by a professional! It works great and I peeled leaving my skin smoother and clearer after",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171031
    },
    {
      "title": "Will buy again",
      "text": "Easy to apply. I was careful not to leave on too long. A nice change from exfoliating. I did purchase QRxLabs neutrtralizer.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen J Donegan",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "good grade",
      "text": "Use to get rid of growths. This is strong. Apply on a small area like a wart or skin growth and wait a day to see how sensitive the skin is before any larger area. Whilst it was stronger than expected it did the job perfectly without lasting scarring.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonas Lundberg",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Poor Quality...like water",
      "text": "tried a higher strengrh. Still does nothimg. Not good quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "no direction come with produc",
      "text": "this lactic acid come with no direction how to use i end up return it back.",
      "rating": 2.0,
      "verified": true,
      "author": "viettran61",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Don't Buy",
      "text": "Didn't do anything. No tingling indicating it's work and no peeling. Very disappointed and will not purchase again!",
      "rating": 1.0,
      "verified": true,
      "author": "Murwa Farah",
      "helpful_votes": 2,
      "publication_date": 20181003
    },
    {
      "title": "Awful",
      "text": "Product burnt my skin . Package no directions just applied to skin couple seconds later burnt came in piece of plastic wrap",
      "rating": 1.0,
      "verified": true,
      "author": "Shirley123",
      "helpful_votes": 2,
      "publication_date": 20190512
    },
    {
      "title": "The best products I brought and wroth every penny",
      "text": "I was so happy with the result I was so excited I wish I knew about this before any way to get rid of my age spots 😍❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Pillows",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "I didn’t peel or feel a difference",
      "text": "I didn’t peel. While I had it on, it was stinging a little bit. Once I took it off it didn’t make a difference to my face. The second time I did it after two days to see if I did something wrong. I left it on longer than the recommended time and still nothing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanjit",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "No noticeable difference after use",
      "text": "I’ve tried this product twice now and haven’t experienced a peel. The first time I did 3 minutes didn’t see any difference with my skin. Upped the time on my face to 6 minutes still nothing. Will try 10 minutes next time but so far not happy with product.",
      "rating": 2.0,
      "verified": true,
      "author": "Sanj",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Good for dry or normal acne prone skin not recommended for oily skin",
      "text": "I have oily skin so this works better for my daughter who has dry skin. My skin barely peels only if I use it more often.",
      "rating": 4.0,
      "verified": true,
      "author": "Taye",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Very powerful chemical. Advise to use much lower numbers to prevent facial burns",
      "text": "Product is very powerful and left me with lots of burns to my face",
      "rating": 1.0,
      "verified": true,
      "author": "Mongk",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "didn't work",
      "text": "Waist of money. No change in skin at all after several applications.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheena Bennett",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Makes you skin so smooth & clear.",
      "text": "Great product I've been using it for 5 years now.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Harrison",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Did not meet expectations",
      "text": "This product being 50 percent medical grade, could not be, as using for 10 minutes saw no peeling at all. Would not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "pd",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Works wonderfully",
      "text": "This product is my go to for balancing out my skin and lightening my hyperpigmentation. I recommend 30 percent if you are a little sensitive.",
      "rating": 5.0,
      "verified": true,
      "author": "Demetrius",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Decent product",
      "text": "Not as strong as some other 50% lactic acid peels, but skin is smoothened refreshed, without the burn.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "I thought this would be a good peel to out with",
      "text": "I am fairly new to lactic peels. I thought this would be a good peel to out with. I prepared my skin and left I t on for 3 minutes. Then I neutralized. Slight stinging and great results even after first use. Remarkable brightness, and lightening of dark spots. I can't wait to use it again in a couple of days!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Terry",
      "helpful_votes": 17,
      "publication_date": 20171013
    },
    {
      "title": "No good!",
      "text": "This one is not working as other brand sold at Amazon. Similar ingredients and Cheaper but not working.",
      "rating": 1.0,
      "verified": true,
      "author": "livefish",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Worst product",
      "text": "Not a great product to use. Your better off going to a professional. Worse product.",
      "rating": 1.0,
      "verified": true,
      "author": "Delicia",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "DID NOTHING ....",
      "text": "Zero results. Left on 3 minutes the first time, the next time 5 minutes. Then 10 minutes on the next application/treatment. Nothing. No results... Pass.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis Jespersen",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Immediate Results",
      "text": "Used it one time could feel the tingling and tightening immediately. Would highly recommend this product over any expensive procedure. Great results.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "It works",
      "text": "It is liquid, so you have to be quite careful with application. It works, if you want fresh new skin, it works.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Feels very strong",
      "text": "No peeling so far for me I used twice a week only because I want to see the results.",
      "rating": 2.0,
      "verified": true,
      "author": "shama",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Good",
      "text": "Thank you , I received my product, every bottle is sealed, experation date is good too Did not try yet",
      "rating": 5.0,
      "verified": true,
      "author": "Tetiana",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": ".",
      "text": "Still early to give comments. I just used it once and no results yet. Need more information to how to use the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Old lady",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Very potent.",
      "text": "Love this for hydration and exfoliation at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jalex ",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "More than I expected",
      "text": "This product is great Amazing I recommended definitely Five stars ⭐️⭐️⭐️⭐️⭐️",
      "rating": 5.0,
      "verified": true,
      "author": "arly delrosario",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "It works as described",
      "text": "it saves me significant money as I don't know an expensive facial any longer. I can do it at home safely.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Probably should dilute",
      "text": "It was too strong for me. It broke my face out. Also my face didn’t peel much",
      "rating": 1.0,
      "verified": true,
      "author": "Meg O",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "NOT GOOD FOR SENSITIVE SKIN",
      "text": "I left the peel on for 1 minute, LITERALLY, and ended up with 3 huge burn marks on my face. THIS IS NOT GOOD FOR SENSITIVE SKIN",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180412
    },
    {
      "title": "Do not waste your money",
      "text": "No frosting, no peeling. It just itches when you put it on. Do not waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren Blake",
      "helpful_votes": 3,
      "publication_date": 20180423
    },
    {
      "title": "Very Satisfied!",
      "text": "I am very happy with this product. You need to follow the directions and also make sure you buy the Chemical Peel Neutralizer. I bought mine from the same company.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "You could have some lite peeling or flaking",
      "text": "What I liked most was I could use skin lighting serum after using product.. peel was very light ..my face could handle this product 2x a week ..not finished yet",
      "rating": 3.0,
      "verified": true,
      "author": "Sensi beauty",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "but i really like this peel",
      "text": "i have only used it once so far. but i really like this peel, i will use it once a week from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "gina hollis",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Tingle is real",
      "text": "I maybe got too high of a percentage and probably left it on 1 minute too long. As soon as I put it on it burned. I used the neutralizer that did help. And I did have a bit of frosting or scarring afterwords. I hope my face isn't ruined more it's been 2 days since the peel. These scabs are from the peel :(",
      "rating": 3.0,
      "verified": true,
      "author": "Savonne Castro-Johnson",
      "helpful_votes": 3,
      "publication_date": 20180308
    },
    {
      "title": "One Star",
      "text": "I’m extremely upset because this product will not open for me, numerous people have helped and it’s not opening....",
      "rating": 1.0,
      "verified": true,
      "author": "ciara",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Don't Buy It",
      "text": "Did absolutely nothing. I tried it several times and left it a few minutes longer each time and NOTHING happened.",
      "rating": 1.0,
      "verified": true,
      "author": "Curious and Learning",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "I loved the gel consistency of the peel and it left ...",
      "text": "I was excited to try this product when I read its ingredients. I loved the gel consistency of the peel and it left my skin super soft. I can't wait the improvements that I will get overtime with constant use!! So far LOVED IT.",
      "rating": 5.0,
      "verified": true,
      "author": "Katia Auler",
      "helpful_votes": 12,
      "publication_date": 20170810
    },
    {
      "title": "I like it. Brightened my face even skin tone and ...",
      "text": "I like it. Brightened my face even skin tone and all. DONT FORGET THE NATURALIZER . YOUR FACE WILL BURN AND BURN WITHOUT IT... other than that no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "crystal",
      "helpful_votes": 2,
      "publication_date": 20171215
    },
    {
      "title": "I love it. No bad taste and no side effects",
      "text": "I used to have low vitamin D. I take this religiously and now I have no problems. I love it. No bad taste and no side effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Schultz",
      "helpful_votes": 3,
      "publication_date": 20170904
    },
    {
      "title": "My complexion is pretty clear now--it was getting rough-looking and I needed a ...",
      "text": "My complexion is pretty clear now--it was getting rough-looking and I needed a perk-me-up, which the lactic acid did! I did have some scabbing and peeling for 4 days after doing the peel, but once it all sloughed off, it looks great! I thought it would get rid of my age spots, but it didn't--I might need a stronger peel for that, but this is great for now. I'm using the peptide complex serum for the next 2 weeks as they recommend and I'm also using the lightening serum to see if my spots get lighter.",
      "rating": 5.0,
      "verified": true,
      "author": "xhilogirl",
      "helpful_votes": 4,
      "publication_date": 20180608
    },
    {
      "title": "Gets the Dead Skin Off",
      "text": "This removes the dead cells so that blackheads don't build up. Leaves your skin glowing.",
      "rating": 5.0,
      "verified": true,
      "author": "WPB Girl",
      "helpful_votes": 5,
      "publication_date": 20190301
    },
    {
      "title": "Yes, it burns.",
      "text": "Holy crap - I only had this peel on for a few minutes and it burned my cheek skin. I have tiny scabs on my face, but they are healing quickly. Be careful when using. This is strong stuff!",
      "rating": 4.0,
      "verified": true,
      "author": "SP",
      "helpful_votes": 5,
      "publication_date": 20180315
    },
    {
      "title": "works great but I have to use sparingly",
      "text": "very strong on my skin, works great but I have to use sparingly.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Dragon fly",
      "helpful_votes": 6,
      "publication_date": 20170925
    },
    {
      "title": "This stuff is great!",
      "text": "This really works! I’ve been getting microdermabrasion & face peels for years. With COVID-19, I haven’t been able to see my aesthetion. I followed directions the first time. Felt a little bitty sting. I’ve increased it to 10 mins. Now. It definitely works. My skin is tighter, smooth, had some minor peeling. Just as good as the Obagi blue peel. I also have the serum & neutralizer. Highly recommend. Do be careful & follow directions, especially if you’ve ne er had a peel before.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda F. Hawks",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Legit",
      "text": "Great product! Spa quality. Be careful though because it is professional grade",
      "rating": 5.0,
      "verified": true,
      "author": "yoga_mama",
      "helpful_votes": 5,
      "publication_date": 20171230
    },
    {
      "title": "Everyone's skin is different do a patch test before putting this on your face",
      "text": "I have SUPER oily skin so I slapped this serum on for 10 mins, didn't feel a thing, washed it off with a gentle cleanser. My skin feels baby smooth. I have had no redness or irritation, I was actually wondering if they had a higher concentration. The only thing I forgot to do was purchase sunscreen which I have because that is super important when using these products. If you have dry or combo skin I would say proceed with caution.",
      "rating": 5.0,
      "verified": true,
      "author": "LEJTop Contributor: Calligraphy",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Five Stars",
      "text": "Great product!!! My brown spots have faded after only a few treatments.",
      "rating": 5.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 4,
      "publication_date": 20180524
    },
    {
      "title": "Good not intense peel",
      "text": "It isn’t too strong- which is good I used 30sec first time and then used baking soda with water to neutralize. Now I’m up to 3min 30 sec and very happy with results. I do not like to peel so I keep my time low. I’ll go up until too much. It depends on your skin and how exfoliated you are. The last time I felt much more burn because I used an exfoliating scrub prior. Wouldn’t recommend doing this the first time. The results are good. Im not glowing (so 4/5) but I feel like it helps my pores and hormonal acne. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "EriKat",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "It works.",
      "text": "I liked the thickness and ease of application. Have only used twice, first time in for two minutes second time two week's apart on for three minutes. So far so good, I like what I see. Most important the instructions are non existent. I have common sense about chemicals, some people do not. please put this right so that nobody gets hurt.",
      "rating": 4.0,
      "verified": true,
      "author": "J.R",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Noticeably more wrinkly when I don’t use it.",
      "text": "I really like this peel—good fairly strong at-home peel. I use it with a microneedler three time a week, and if life intervenes, you can see that my 58 year old face looks more wrinkly within about ten days of not using this product.",
      "rating": 4.0,
      "verified": true,
      "author": "kharmadog",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Nice!",
      "text": "I use this to help lighten up my sun spots. It does tingle a little, but that's normal. I've noticed the appearance of my skin getting better and softer with time. I apply this on my clean face about once every other week for about 5-8 minutes",
      "rating": 5.0,
      "verified": true,
      "author": "Salina Tirre",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Great stuff!",
      "text": "Really works ! Had dark scabby patch that would not heal smoothly for months i put this gel on and left on overnight and peeled dead skin off the next morning and back to smooth skin.",
      "rating": 5.0,
      "verified": true,
      "author": "BenHustlin",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Waste of money.",
      "text": "This product is diluted waaaaayyyyy beyond the product details. Try another company. Complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "John West",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "GARBAGE!!",
      "text": "Garbage!! Waste of money!!! No stinging no nothing! It’s like they mix aloe gel with water and called it a peel!!!! DONT WASTE YOUR MONEY!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kaneshia Stewart ",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "great product",
      "text": "This was delivered quickly and is wxacctly as advertised and anticipated. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "C Cactus",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "I used the other brand and work well. However ...",
      "text": "I used the other brand and work well. However, this one made my skin on the dark area even darker.",
      "rating": 1.0,
      "verified": true,
      "author": "Chung L",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Worth it!",
      "text": "This is great stuff for your skin. Definitely do a patch test and don’t leave it on your skin for too long. Highly impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Winkle",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Waste of money",
      "text": "I didn’t see much peeling rather It darkened my face. It was a total waste of money I won’t advise anyone to buy this product",
      "rating": 2.0,
      "verified": true,
      "author": "Berry",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Like a $100 facial at home for $5",
      "text": "I have used this twice and am very pleased with the results. My skin texture has improved.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Cantu",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Depends on expectations",
      "text": "It definitely stings like those used by my dermatologist but I had no peeling.",
      "rating": 4.0,
      "verified": true,
      "author": "Beverly L Rowland",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Useless",
      "text": "This was no more effective than water. Didn’t even tingle. Used it the first time, left it on for 5 minutes and nothing ever happened. The second time I left it on overnight and still nothing. Never peeled and definitely didn’t lighten. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Happy with results!",
      "text": "Wasn’t too sure what to expdct, as I’ve never had any peel or anything before. But i leave this peel on for 45 seconds, then rinse off with my rose water toner. My skin is bright and healthy!",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Used for acne and Skin discoloration",
      "text": "Works well when combined with glycolic acid for Acne and Skin discoloration",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Love it",
      "text": "I’ve noticed a difference in my skin. A few drops mixed in with my moisturizer has brightened my skin. Plus it smells great!!",
      "rating": 5.0,
      "verified": true,
      "author": "K.wel",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Disappointed",
      "text": "This product only dries the skin out. There was no peeling involved. Not satisfied!",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Villafana",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "The best peeling acid ever",
      "text": "This is a great product, in a matter of 5 days I have almost removed or peeled all the dead skin from my face and still peeling.I used this acid once a day only. I love it and thx to QRX Labs. Awesome product that works.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 5,
      "publication_date": 20170925
    },
    {
      "title": "A little too much for my skin",
      "text": "Saw a little difference but not enough to continuing use. It may be due to the fact that I cannot leave it on long without it burning so others may have better results.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Schwahn",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "This should have been a \"kit\" as opposed to just the gel.",
      "text": "The Peel never peeled! Was disappointed by the claims of this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonboy ",
      "helpful_votes": 2,
      "publication_date": 20180614
    },
    {
      "title": "Two Stars",
      "text": "Too strong so use sparingly! Was not able too see results!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180228
    },
    {
      "title": "One Star",
      "text": "It does it's job can be strong so start in same spot first",
      "rating": 4.0,
      "verified": true,
      "author": "christopher Reid",
      "helpful_votes": 2,
      "publication_date": 20170913
    },
    {
      "title": "Not recommended",
      "text": "This peel burned my face badly and it took me three weeks to heal from it. I didn’t pick on my skin and I still ended up hyperpigmentation. I wouldn’t recommend this peel to sensitive skins.",
      "rating": 2.0,
      "verified": true,
      "author": "Integrity",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "I got a bad chemical burn",
      "text": "I got a bad chemical burn!!!! Left scars!!! The package also has lots of warnings. Make sure you get a nurtralizer!",
      "rating": 1.0,
      "verified": true,
      "author": "Charbear2",
      "helpful_votes": 2,
      "publication_date": 20171206
    },
    {
      "title": "Very very strong",
      "text": "Woah, I put this one my skin for about 10 min and it burned so badly I got scars for 3 days and my neck broke in a rash. Later, I was told that if you've never done a peel that you should start at 15%-25%, not a this 50%",
      "rating": 1.0,
      "verified": true,
      "author": "Paul B. Baker",
      "helpful_votes": 3,
      "publication_date": 20180130
    }
  ],
  "product_meta": {
    "title": "Lactic Acid 50% Gel Peel with Kojic Acid and Bearberry & Licorice Root Extracts - Professional Grade Chemical Face Peel - Alpha Hydroxy Acid - 1 Bottle of 1 fl oz",
    "rating": 4.2,
    "feature_bullets": [
      "WARNING: DO NOT USE WITHOUT DOING AN INITIAL PATCH TEST. This product contains Lactic Acid. Because sensitivity to Lactic Acid varies substantially from person to person, we STRONGLY RECOMMEND to ALWAYS test the product on a small area before using it. In order to test, apply a small quantity of product on a very limited dime-sized area, behind the ear or under the chin, and wait for 2 to 3 minutes to assess your sensitivity to the peel.",
      "PROFESSIONAL GRADE Lactic Acid Face Peel: especially effective for Age Spots, Freckles, Sun Spots, Skin Lightening, Hyperpigmentation, Wrinkles and Fine Lines. Each bottle contains up to 20 complete facial applications. Do it yourself at home and save on expensive spa treatments!",
      "GEL PEEL: contrary to many other peels on the market, this product is a light gel and NOT A LIQUID. This helps prevent the product from trickling down your face or dripping into your eyes or mouth.",
      "KOJIC ACID, BEARBERRY AND LICORICE EXTRACTS: very effective natural ingredients that promote a brighter and more even skin tone and uniform complexion by acting as melanin inhibitors.",
      "MONEY BACK GUARANTEE – All QRxLabs products are covered by our Money Back Guarantee. If you are not 100% happy with one of our products, we will refund your purchase."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 1 x 4 inches; 2.8 Ounces",
      "Item model number": "P-LACT50G-1",
      "UPC": "685867971795",
      "Manufacturer": "Silbonita Inc.",
      "ASIN": "B071FC77RN",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Facial Peels"
    ],
    "price": 19.95
  }
}