{
  "website_summaries": [
    {
      "verdict": "A versatile, affordable, customer-pleasing cordless phone system.",
      "pros": [
        "This phone system features a bilingual caller ID and it has large numbers so it is easy to read and operate",
        "Some of the most often used features can be accessed via a single touch"
      ],
      "cons": [
        "Some users feel the call announce could be a little clearer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It easily slips out of the base and frequently falls on ...",
      "text": "Care is needed when placing the headset back in the base after a call. It easily slips out of the base and frequently falls on the floor. When someone is recording a voice message you cann't hear it while it's being recorded. After the message is recorded then you can play back the message and the volume is adequate. The voice announcing the caller does not properly pronounce the name of the caller. Otherwise, for the price, the phone is adequate.",
      "rating": 3.0,
      "verified": true,
      "author": "Louis A. Maccariello",
      "helpful_votes": 259,
      "publication_date": 20171216
    },
    {
      "title": "it's fine. Good sound quality",
      "text": "As far as doing what a phone should do, it's fine. Good sound quality, it works. However, I miss some of the features on the older model that I used for years. There's no light on top of the handsets that show when the unit is fully charged and blinks when there was a message. Also, I miss being able to delete the messages from the handset. It's surprising that older models have better features.",
      "rating": 3.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 311,
      "publication_date": 20171210
    },
    {
      "title": "Way above!",
      "text": "After V-Tech and AT and T - WOW! This Panasonic blows them out of the water into the sky and disintegrating in space! Everything is easy to access and the sound is far superior and it just is a solid, good piece of equipment. It is possible to change the ringtones and many other things to customize. And it obeys you. Not you it. The caller ID really keeps the scammers and tele-marketers as close as possible to “controlled!”",
      "rating": 5.0,
      "verified": true,
      "author": "Harold Edward Wills",
      "helpful_votes": 337,
      "publication_date": 20171112
    },
    {
      "title": "PEACE AT LAST",
      "text": "So easy to block unwanted calls and I love that the phone speaks to you lets you know who is calling (if you have them in your phone number list)",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Paletta",
      "helpful_votes": 220,
      "publication_date": 20170926
    },
    {
      "title": "I Can Hear Clearly Now!",
      "text": "Good quality with plenty of volume. Love the call blocking feature; just one ring and they're cut off! The answer function is clear and easy to program and the base station can be wall mounted on a standard two-pin wall plate. Also, I found that earlier, similar Panasonic cordless units can be programmed to work with this DECT 6 set.",
      "rating": 5.0,
      "verified": true,
      "author": "York E. Onnen",
      "helpful_votes": 188,
      "publication_date": 20170916
    },
    {
      "title": "Plain and simple display, keypad and menu!",
      "text": "This Panasonic KX-TGD532W is a top-notch landline cordless phone. Key pad and display visuals are large, bold black-on-white. Instructions are elementary, uncomplicated. Reception is clear, very clear. I do not use voice mail; therefore, the only drawback for me is the preset voice mail program ... the answering machine must be set to respond at three rings to avoid the preset voice mail program interference. It seems that the preset voice mail program is common to all brands.",
      "rating": 5.0,
      "verified": true,
      "author": "dandergreen",
      "helpful_votes": 146,
      "publication_date": 20170916
    },
    {
      "title": "Cheap and terrible  waste of money",
      "text": "Horrible. Don’t buy. Cuts off while talking even whe it says full battery. Cheap weights almost nothing. Terrible reception no matter where the call comes from.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 79,
      "publication_date": 20180320
    },
    {
      "title": "Hate it.",
      "text": "I truly despise this phone! The volume button does not work, and the speaker phone on it is horrible! It sounds like your in a tunnel talking. I am actually looking for another phone. There was however other names and phone numbers listed in the phone book when I received this phone so that person apparently hated this phone too.",
      "rating": 1.0,
      "verified": true,
      "author": "Denny",
      "helpful_votes": 66,
      "publication_date": 20180425
    },
    {
      "title": "Harbor Freight quality phone",
      "text": "Who's giving this phone 4 and 5 stars?????? Not the quality Panasonic company you knew. The remote charger stopped charging just after the return period (60 days). Panasonic wants me to ship the charger to Texas repair center. It weighs about the same as an empty envelope (read cheap Malaysia crap). The weight of the power cord will pull the empty charger/stand off the table.I tried emailing support. no success. I tried calling, was told to go on-line. I went to shop Panasonic to just buy a replacement, out of stock. Volume low, always use speaker phone. Guess I will buy another brand of phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry Beauchamp",
      "helpful_votes": 101,
      "publication_date": 20180212
    },
    {
      "title": "CALL BLOCK BUTTON IS A BLESSING, LOVE THIS PHONE",
      "text": "LOVE THIS PHONE. EASY TO SET UP AND WORKS LIKE A CHARM. I SEEM TO BE A MAGNET FOR SCAM CALLERS AND THE CALL BLOCK BUTTON IS WONDERFUL, ACTUALLY, THIS IS THE MAIN REASON I PURCHASED THIS PHONE. SO GLAD I DID. EVERY PHONE SHOULD HAVE A CALL BLOCK BUTTON.",
      "rating": 5.0,
      "verified": true,
      "author": "DG/BRONX GIRL",
      "helpful_votes": 70,
      "publication_date": 20170928
    },
    {
      "title": "highly recommend",
      "text": "PERFECT phone & answering machine. I like how it tells me aloud who's calling that way I don't have to walk up to the caller ID to check. Everything worked since day 1 and I believe this phone will last. I bought this phone regardless of the negative reviews and I'm very glad I did. There's always going to be someone who hates an excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Davis",
      "helpful_votes": 77,
      "publication_date": 20171024
    },
    {
      "title": "Randomly Disconnects Calls",
      "text": "I purchased this to replace my old phone that had been functioning fine except the display screen stopped working. I know my phone lines are fine, but this phone would show error messages saying the base wasn't connected to the phone line (it was). Also, about 15-30 minutes into any call, the call just drops. This has been very frustrating when making calls to customer service for other issues/companies and every time I start talking to a rep, the call drops. These phones are terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 44,
      "publication_date": 20180708
    },
    {
      "title": "update: constant humming noise",
      "text": "Easy to use, comfortable handset,& the call blocking feature is worth it, otherwise it's a chintzy phone. Volume cuts out at times, and I have to hold on to the base when I press the play button or it all falls off the table.I guess for the money it's okay. Update, it's 2/2019 & I have to go out and buy a new phone already, as there is too much noise.",
      "rating": 1.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 67,
      "publication_date": 20171021
    },
    {
      "title": "Decent Phone with Practical Features",
      "text": "This is a nice phone. The only feature I miss from the old Panasonic phone I owned is the blinking light indicating a voice mail is waiting. And negotiating your way through the caller list is a bit tricky. I enjoy the variety of ringtones, which includes a Vivaldi selection! And the buttons are a generous size. The headset locator is a welcome feature for those (like me) who have a habit of leaving it wherever they were last using it. Be advised: Return the headset to the base carefully, since the \"seating area\" for the headset is not very deep, and it can topple!",
      "rating": 4.0,
      "verified": true,
      "author": "Emmi331Top Contributor: Jigsaw Puzzles",
      "helpful_votes": 31,
      "publication_date": 20180304
    },
    {
      "title": "the best phones I have ever owned and I'm in my ...",
      "text": "the best phones I have ever owned and I'm in my 60's. The only phones I've owned since moving here 38 yrs. ago that I have no problem hearing and those calling have no problem hearing me. They hold a charge for a long time and I love the block feature. I get such satisfaction pressing the \"block\" button when a telemarketer calls. Sometimes it's the small things! LOL!!! The numbers are easy to read even with my older eyes. Absolutely a 5 rating!",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda Bradsher",
      "helpful_votes": 46,
      "publication_date": 20180117
    },
    {
      "title": "Superb system",
      "text": "Did some research to find a phone system that would be good for the house. I chose the Panasonic because it received some great reviews and I am not sorry I did. The sound is great and with the feature of blocking unwanted calls is worthwhile. The intercom feature is very good, it saves everyone from \"yelling\" all over the house. Superb phone system, I'd recommend it any time!",
      "rating": 5.0,
      "verified": true,
      "author": "fgski",
      "helpful_votes": 49,
      "publication_date": 20171104
    },
    {
      "title": "Working out great.",
      "text": "These are working out great, even tho I don't use my landline much. My old ones lost battery power each time I removed it from the charger and it would start beeping in the middle of a conversation. It was time to replace it. This one stood out. I like there are only 2 phones, don't need 5 or 3 like many others offer. I really like the call blocking button. So many solicitors bugging you all day. With my phone provider, who offers a redirect recording of all solicitor calls and this call blocking my phone rings much less. I like the voice announcement too. I would have liked it in grey but white is ok.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Edgar",
      "helpful_votes": 27,
      "publication_date": 20180128
    },
    {
      "title": "Terrible!",
      "text": "It hurts to have to give this 1 star. I'd like to give it zero stars. Recorded sound quality is appallingly poor.",
      "rating": 1.0,
      "verified": true,
      "author": "2driftrs",
      "helpful_votes": 44,
      "publication_date": 20180206
    },
    {
      "title": "Call block works but...",
      "text": "I bought this specifically for the call block feature and I like it. The only reason I didn't give it 5 stars is because 1 of the features doesn't work. When I block a number, I don't want to hear the phone ring if they call back. No matter how many times I change this setting to no rings it continues to ring 1x when a blocked # calls back, which is still disturbing and almost defeats the purpose. I have similar version of this phone for my other landline and this feature works fine, so maybe it's just a defect with this model.",
      "rating": 4.0,
      "verified": true,
      "author": "Dee9",
      "helpful_votes": 19,
      "publication_date": 20180721
    },
    {
      "title": "Not enough playback volume",
      "text": "I’m disappointed with the max volume of this unit. I have to remove the phone from its cradle and put my ear up to the cradle to hear my messages. There is also no sound letting you know that you have a message. My old unit had a beep sound every couple of minutes until you checked the message. The ease of recording your out going message is good. This unit will go into the trash and I will be investing in a new unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Carl Gassmann",
      "helpful_votes": 23,
      "publication_date": 20180701
    },
    {
      "title": "Batteries Do Not Stay Charged Long",
      "text": "We will be moving soon, and this set of 6 month old phones will be tossed in the trash. I read that this was the newer model of our last Panasonic expandable cordless phone set, which was wonderful. The batteries do not hold a charge. We do not talk on the house phone often, and they do not stay charged but a couple of days. It is extremely hard to hear on these phones.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 33,
      "publication_date": 20180401
    },
    {
      "title": "Call blocker",
      "text": "Nice phone. I like that it announces who is calling you. I also like the call block option. I am still learning how to navigate around the features. More expensive, but a quality phone that hopefully will outlast some cheaper phones that I have had in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "A. R. Smithee",
      "helpful_votes": 36,
      "publication_date": 20170929
    },
    {
      "title": "Quiet Finally!",
      "text": "Wow! Since I got this new phone system my house is quiet. The best setting is to not hear the first ring. This is most nuisance calls, so it’s very quiet now. What a wonderful difference!",
      "rating": 5.0,
      "verified": true,
      "author": "FrequentBuyer",
      "helpful_votes": 24,
      "publication_date": 20171109
    },
    {
      "title": "Phones are working perfectly now",
      "text": "Update to my prior review: All the problems we were having with not being able to hear through the phones was due to our Comcast modem needing to be bounced. After turning the modem on and off again, the phones are working perfectly again. So very happy with the phones once again and I'll know next time how to fix an apparent problem with my phones!",
      "rating": 4.0,
      "verified": true,
      "author": "Tonybanker",
      "helpful_votes": 20,
      "publication_date": 20171219
    },
    {
      "title": "A Missed Call List With NO Area Code",
      "text": "The numbers on this phone's missed call list don't have an area code. I have no idea why this is. Ridiculous. Am returning this phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 19,
      "publication_date": 20180619
    },
    {
      "title": "Stopped working after a year",
      "text": "I bought this phone for my elderly mother to use at her assisted living. Initially I was pleased, as it seemed easy enough for her to understand, even though she struggles with even the simplest electronic devices; however, it has now been just over a year (bought end of Nov 2017) since I purchased it and the device no longer receives power when it's plugged in. I tested it on multiple outlets in multiple homes and no lights/power. Just past the warranty, of course, so I will just have to replace it. BEWARE!",
      "rating": 1.0,
      "verified": true,
      "author": "GET",
      "helpful_votes": 10,
      "publication_date": 20190226
    },
    {
      "title": "FINALLY A CORDLESS PHONE THAT WE LOVE",
      "text": "I absolutely love these phones! I wish I had bought the set that included more of them. The feature of the phone announcing who is calling is awesome! I haven't tried the call blocking feature yet, but with the telemarketers I'm sure I will soon. The phone are very user friendly, the ringing is loud, and the battery life is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Perez",
      "helpful_votes": 17,
      "publication_date": 20180107
    },
    {
      "title": "A disappointment",
      "text": "I had a 10+ yr. old Panasonic which was \"dying\".. This is a disapointment. The design is a little clumsy. Not comfortable to hold. Sound is only adequate. Functions are buried in a \"choice tree\". You must push a button at least 3 times just to listen to your messages. And at least 3 more times to erase an old message! So far I have not been able to get rid of that awful voice which announces every message received! I would return it, but I'm not confident that a replacement will really be better.",
      "rating": 3.0,
      "verified": true,
      "author": "gerryc",
      "helpful_votes": 22,
      "publication_date": 20180104
    },
    {
      "title": "Only worked a few hours",
      "text": "Worked only a few hours, then the main init failed. Charging but all the handsets indicate Main Unit No Power. Im just lucky amazon is very helpful with this case. Bad Product but Good Customer Service from Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 10,
      "publication_date": 20190104
    },
    {
      "title": "Works fine once I put good cells in them",
      "text": "Works fine once I put good cells in them. They came with 300 mah AAA cells, my MAHA charger said they had too high of an impedance. I replaced them with 1000 mah AAA cells.",
      "rating": 3.0,
      "verified": true,
      "author": "John Joyner",
      "helpful_votes": 12,
      "publication_date": 20180629
    },
    {
      "title": "PLEASE READ EVERYTHING BEFORE YOU PURCHASE!",
      "text": "I was excited to get these phones when they came in the mail but within a half hour I knew I had made a mistake. First of all there is NO REDIAL. If you accidentally hit BLOCK which is between the SPEAKER and HOLD, you can NOT unblock. If you pick up the phone when someone is leaving a voicemail, it AUTOMATICALLY answers whether you hit talk or not. I’ve had pretty much every type of phone out there. This phone will just frustrate you. Save yourself the hassle. I do not like leaving bad feedback but in this case I feel that I have to.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 5,
      "publication_date": 20191007
    },
    {
      "title": "Excellent Phone for the Price",
      "text": "Very good sound quality and range. I particularly like the announcing feature where a voice tells you who is calling. I didn't think I would like this feature at first, but have grown to love it; when the phone rings I just wait for it to tell me who it is before I decide if I want to answer. Call block is nice too, you can block calls right after you hang up on them. If you still have a house phone, this is a great choice. Home phone service is included in my internet package so I use my home phone number when I have to give my number to merchants or on applications.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 6,
      "publication_date": 20190317
    },
    {
      "title": "Owned for over 6 months and find it reliable and a good value!",
      "text": "If you are looking for a simple, easy to use, reliable dual handset for your land line I'm happy to recommend this product. Does the job - really long battery life and the base can 'find the phone' - really helpful if your phones tend to hide themselves all of their own volition. ( Smile) I was in no way compensated for this review. I just like the product. Oh and the handsets seem fairly indestructible too - don't ask - lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190326
    },
    {
      "title": "The spoken caller ID is not great, and if you turn it off",
      "text": "The spoken caller ID is not great, and if you turn it off, it also turns off the ability to screen incoming messages....even though that function has a completely separate user on/off selection option....obvious bug in the software. I do appreciate it that you can easily turn off the ringer on the remote (in the bedroom), and the fact that the remote doesn't \"light up\" with caller message reminders.",
      "rating": 3.0,
      "verified": true,
      "author": "quadman",
      "helpful_votes": 13,
      "publication_date": 20180115
    },
    {
      "title": "Easy set up",
      "text": "This is a cool looking phone and easy to set up. Just plug in and you're good to go. Setting the date and time is a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Highmark",
      "helpful_votes": 26,
      "publication_date": 20170917
    },
    {
      "title": "Handset died.",
      "text": "The additional handset went dead after one month of operation!",
      "rating": 1.0,
      "verified": true,
      "author": "C. Thomas",
      "helpful_votes": 17,
      "publication_date": 20180105
    },
    {
      "title": "Great replacement.",
      "text": "Nice replacement for my other Panasonic. Looks sharp and of course works well. Just wish the ring tone would be different from the previous phone. Got tired of it, but certainly no slam on this one!",
      "rating": 5.0,
      "verified": true,
      "author": "RICK LETT",
      "helpful_votes": 23,
      "publication_date": 20170908
    },
    {
      "title": "Peace of mind",
      "text": "Got this system for my elderly Mother that can not use the tiny cell phones anymore. It works well, she can hear it ringing, she can find the handset easily even if not on it's stand and no running out of minuets !! Every time I call her now, she answers because of these features. A great peace of mind for us .",
      "rating": 5.0,
      "verified": true,
      "author": "Terrie K",
      "helpful_votes": 12,
      "publication_date": 20180104
    },
    {
      "title": "Panasonic, stop selling these phones!",
      "text": "Fortunately, I found out how awful these phones are in time to send them back. After charging them for the recommended time, people I talked to said it sounded like I was in a tunnel or an echo chamber. Then, two phone calls in a row the person on the other end could no longer hear me, so they hung up. One of those calls was a critical phone appointment with my doctor. It was a disaster, and profoundly unacceptable for a brand name phone. DO NOT BUY THESE PHONES! Panasonic, fix this!!! Some phone calls are critical!",
      "rating": 1.0,
      "verified": true,
      "author": "CBarnes",
      "helpful_votes": 7,
      "publication_date": 20180831
    },
    {
      "title": "Absolutely wonderful!",
      "text": "This phone set is really wonderful. It has a call-block feature. When I answer a robo-call, push two button & it will never accept a call from that number again unless you tell it to. If anyone whose name & number you have programed into the phonebook calls it says the name when the phone rings. IIt also automatically block calls from \"private caller,\" no name callers, out of area caller and other nuisance calls. Since we installed this phone system we have been able to eat supper without many interruptions It also has a good wireless range that allows us to move about all parts of the house and outside when working in the yard..",
      "rating": 5.0,
      "verified": true,
      "author": "Wm F. Duncan",
      "helpful_votes": 7,
      "publication_date": 20180326
    },
    {
      "title": "this works great with VOIP phone lines",
      "text": "Bought this to replace a Full size phone with answering system, yep still go old school, but it works and saved me money. Have the VOIP phone because I have had the same phone number since I was a child and 62 years later still have it with OOMA. This compact Panasonic has all the features you will need. It may take reading the manual to figure some things out but the caller ID voice announce was feature I had before with a caller ID and I found I could get it with this. Same Panasonic quality Ive know for decades at a very good price. Hopefully this will be the last phone I will ever need, no complaints!!",
      "rating": 5.0,
      "verified": true,
      "author": "ZIPPER BOOKS",
      "helpful_votes": 5,
      "publication_date": 20180810
    },
    {
      "title": "Extendsion phone stopped working after 1 month",
      "text": "Like the fact that it told you who was calling , set up was easy . what I disliked is the fact I had it I month and phone number 2 stopped charging and would not work after buying new rechargeable batteries and would not charge on either base, so the 2nd phone is useless and I have only 1 working phone on hand set with answering machine, so if I'm in a different room I miss the calls, with an in home business this is very upsetting!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180625
    },
    {
      "title": "DOES NOT LET YOU PROGRAM INDIVIDUAL RING TONES AS ADVERTISED",
      "text": "It does NOT let you program individual ring tones as advertised. Everything else seems to work fine. Although, the sound quality is not as good as my old Panasonic phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathryn Murphy",
      "helpful_votes": 13,
      "publication_date": 20180125
    },
    {
      "title": "The call features don't work with Magic Jack.",
      "text": "I was disappointed that most of the call blocking features don't work with Magic Jack. But manually using the call blocking does work and the sound is a huge improvement. I not only hear the other end of the call better but the person I was talking to even commented on how clear our call was. I have cut down on 90% of calls by blocking them as they call. It takes a little more time but it is working. Overall, this is a very good phone for the money. Love the different rings that you can choose from. The first ring tone I settled on sounded too much like my dryer. LOL",
      "rating": 4.0,
      "verified": true,
      "author": "Marcia L.",
      "helpful_votes": 3,
      "publication_date": 20190709
    },
    {
      "title": "Call Block feature at it's BEST! BUY THIS PHONE",
      "text": "Bo't this for my Senior aged parents. Decent sound even for those wearing hearing aids, speakerphone is CRYSTAL CLEAR. My parents prefer \"the machine\" vs voicemail, so I'm happy that they are finally happy. Great buy in white (much less $$) EZ set-up of speed dial #'s. EZ to block calls! YEAH! IMPORTANT: each handset has 9-speed dials that need to be programmed, so they can all be different on each handset. If you found my review helpful, please click the button, right over...there. THX.",
      "rating": 5.0,
      "verified": true,
      "author": "Giovanni Tampa",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "Did NOT Live Up to its Expectations!",
      "text": "I decided to buy a Panasonic phone for my landline since my AT&T phone seemed to need a new battery or it just wasn't working anymore. I read the reviews about this phone and they were good but to my surprise upon receiving the phone, the sound quality was terrible. I gave it a bit of a chance before I decided to return it but with no luck, It was impossible to hear people on the other end and for them to hear me. It did have some very nice features but unfortunately sound is the most important factor in a landline phone. I returned it and bought an AT&T phone to which works wonderfully.",
      "rating": 3.0,
      "verified": true,
      "author": "Tucute42",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Phones work all over the house.",
      "text": "These phones replaced several land-line and cordless models and an answering machine. They all work well all over the house. Even have one in the basement. Only four stars because programming is a pain for the uninitiated such as myself. Still can't figure out how to hear the incoming message as it's being recorded (very helpful in screening calls). Maybe I'm asking for too much. But, otherwise, overall, a good system.",
      "rating": 4.0,
      "verified": true,
      "author": "Cookie Jar",
      "helpful_votes": 2,
      "publication_date": 20191230
    },
    {
      "title": "Great Cordless Unit",
      "text": "I had a cordless phone that was constantly dropping and was not compatible with my wifi. I needed to replace the phone and wanted a second handset. After some research and after reading the reviews I bought this brand and I just love it. Nice looking, clear sound, several ringers, and my calls never drop.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 8,
      "publication_date": 20180125
    },
    {
      "title": "Message alert easy to miss",
      "text": "The phone looks good, is easy to hear, and the block feature is pretty cool. However, there is no indication in terms of a sound beep that you have a message. So you have to remind yourself to check your machine to see if you have any messages. I didn't think that was important when I ordered the phone, but my old one had an audible beep, and now that I don't have it, I miss it so much, I contemplated returning the phones.",
      "rating": 3.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 16,
      "publication_date": 20180125
    },
    {
      "title": "Want to block those terrible calls? This is the machine to do that",
      "text": "The day this phone was to be delivered my old phone quit. The new one blocks calls. When you are old and at home all day long people call you. No one you know, but they all call. This phone, with the hand set has a button for CALL BLOCK. All you do when the call comes through is hit that button. No more calls from that number. It is the best thing ever. It even tells you who the caller is. Great. Got a nasty friend you don't want to talk to............hit the CALL BLOCK button. Just kidding. But it works. Get the phone. You know you want this.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Llewellyn",
      "helpful_votes": 4,
      "publication_date": 20180830
    },
    {
      "title": "Great product",
      "text": "I had previously picked up a call blocker at retail which blocked my internet access - returned it. I found this Panasonic phone with call blocking and an answering machine and it does not block my internet access. It works so well. I was receiving up to 10 spam calls a day which was very annoying. With my Panasonic I am able to block incoming calls or add them to the blocked list after they hang up. Love my new unit.",
      "rating": 5.0,
      "verified": true,
      "author": "King",
      "helpful_votes": 3,
      "publication_date": 20190302
    },
    {
      "title": "I like the phone set very much",
      "text": "I like the phone set very much. I especially like the fact that I can block so many callers (especially the ones who have been monitoring my credit cards for six months and only need all my personal information to get me 0% interest on all my cards). Either I'm a little dense, though, or the directions for setting up my call list were written by someone who knows nothing about the phone. Please, guys, hire a real technical writer to explain how to use your phones.",
      "rating": 4.0,
      "verified": true,
      "author": "Okie1010",
      "helpful_votes": 4,
      "publication_date": 20180522
    },
    {
      "title": "Great phone!",
      "text": "I love the call block feature . . . talk time is good, standby time is good. Never thought I leave V-Tech since I've used their phones for about 15 years, but this Panasonic is great!",
      "rating": 5.0,
      "verified": true,
      "author": "David E Mevis",
      "helpful_votes": 8,
      "publication_date": 20180122
    },
    {
      "title": "Likely any phone system would be an improvement",
      "text": "We truly can't believe how quickly these phones (3) started having problems and just how bad the problems were, i.e., can't hold a charge, for one. Having your call interrupted within five minutes to say the phone needs to be charged is not a recommendation. We purchased these phones ~1 year ago and the problems started within 2-3 months. They have now been replaced by another brand. Seriously, don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Tashi",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Best cordless I ever owned!",
      "text": "I've owned the phone for 1.5 years now, and it's the best cordless I ever owned! I love the call block, nowadays it's a must have. I used up the single number call block storage and figured out that I can use the area code call block for states I don't expect to call me, like Alabama, and just use the single number block for spammers that use my area code. Everything else is easy to use, and this is from someone who refuses to use a smart phone!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Y",
      "helpful_votes": 2,
      "publication_date": 20190815
    },
    {
      "title": "most annoying phone I have ever owned",
      "text": "I cannot begin to relate how much I hate this phone after using it for a few days. The ring tones are all obnoxious; every one of them (15 choices) sounds like a cheap 1980s Casio keyboard, or like being trapped in a classic Super Mario Brothers sound track. The sound quality of the voice transmission and reception is terrible - tinny and grating -- hard to understand whomever you are talking with, and hard for them to understand you. This thing is going back in the box and back to the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190412
    },
    {
      "title": "Good phones!",
      "text": "Recently my old house phones had plummeted too many times on my tile floor and bit the dust. *So long old friends* I needed a new pair and these work great! Super easy to set up, it announces the caller ID, answering machine, and 2 sets. Can't ask for much more right? Had for a little while now but seem to be performing well. Only thing is I wish when the phone was on speaker it was a little louder. Other than that, these are a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 2,
      "publication_date": 20190711
    },
    {
      "title": "Can't hear you now!",
      "text": "I used Panasonic cordless phone sets for more than 20 years. This one is the worst, ever. The handset is very small. The back of the handset is round and tapered, so forget about holding on your shoulder. It does not have a headset jack. The volume in the earpiece is TERRIBLE. Even with the volume set to maximum, it cannot be putting out any more than 10 decibels, and I have exceptionally good hearing. The speakerphone volume is adequate, however. I will be returning this one and trying a different model before giving up on Panasonic.",
      "rating": 2.0,
      "verified": true,
      "author": "AndySNJ",
      "helpful_votes": 3,
      "publication_date": 20180511
    },
    {
      "title": "Bought to replace old answering machine as well as phones. Back to also using old answering machine",
      "text": "One feature I liked was the announce for caller ID. Have an old answering machine and wanted to replace it and phones with a single phone. Having 2 that would announce was a plus. However, there are two items to note: my old unit announced caller ID. Could then determine if I knew number or not to answer. New unit does caller name which in a lot of cases is meaningless gibberish. Second, the voice is much worse. Old unit was mostly clear for numbers. new unit is blurred due to trying to say name but voice itself is not as clear. Tried for 2 weeks Put old unit back in and disabled announce on new phones. Disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "everything a land line should be",
      "text": "I added these 2 phones to my existing 3 phones because I am old and my loving children seem to choose very inconvenient times to call me. I am very fortunate they care enough to do so, but getting from the \"shower\" to the living room in time is no longer a simple feat. The product itself works very well. Clarity could not be better. I see no reason to purchase a more expensive model.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruthie",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Works very well",
      "text": "I replaced an older V-tech cordless phone whose batteries just no longer held up and which had sound problems. This unit seems to sound just fine, and has some flexibility with ring tones, intercom, and \"find me\" signal. I see no purpose for the call blocking (at least for robocalls) since they keep changing their number anyway. Only 4 stars due to a very small disadvantage. I have telco voicemail and yes, the phone can detect that there is a message, but it only produces a message on the screen (which is not normally lit up)--there is no light or anything to call your attention to the fact that you have a message.",
      "rating": 4.0,
      "verified": true,
      "author": "Burns Fisher",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Lower level of the Panasonic phones",
      "text": "These phones are ok- not great. After receiving them, I realize that they are very similar to the Panasonic set I was replacing. However these are not as nice. Some mentionable downfalls are: you are unable to answer by using a speaker at the base like some other Panasonic’s sets, the battery quality is not as advanced as some other sets, there are really no great upgrades compared to the older set. The quality is not great. I would not recommend this product be purchased unless it happens to be under $15, but remember, you get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Garbage. Quickly the remote charger ceased operating",
      "text": "Garbage. Quickly the remote charger ceased operating, then neither base unit would charge. We are left with an answering machine, and if people leave a message we can call them back on our cell. It functioned fully for one entire month.",
      "rating": 1.0,
      "verified": true,
      "author": "Bay Area Native",
      "helpful_votes": 9,
      "publication_date": 20180525
    },
    {
      "title": "BEWARE!  -  NO Talking Caller ID",
      "text": "I ordered \"3 Cordless Handsets - KX-TGD513B\", with the box labeled \"Style: Talking Caller ID\" highlighted. Phones I received had NO talking caller ID. Additionally, they are much larger and heavier than my old phones (KX-TGA931T) and have a really cheap look and feel compared to my old set too. I ordered them used from Amazon Warehouse and although they were described as being in very good condition that was not the case. They were thrown in the original box, (not individually wrapped), batteries in a zip-lock bag, and very dirty, and very scratched, especially the base. They looked like they had been kicked around a dirty floor. No thanks!",
      "rating": 1.0,
      "verified": true,
      "author": "perelandra",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Very Poor Battery Life",
      "text": "This phone is awful. I have had it for less than a year and wish I could return it. It doesn't have a battery charging light, and the worst feature is it has a terrible battery life. If you talk on this phone or leave it off the charger for two hours it is beeping and needs to be charged. Even after its been charging for days! This is the worst battery life for a phone I have ever had. I will be buying something else very soon because this is so bad that it's basically useless. What a rip off.",
      "rating": 1.0,
      "verified": true,
      "author": "Cicely McElroy",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Lots of perks and it works well",
      "text": "We purchased the cheaper returned item on Amazon and it works like a charm. It had some cosmetic scratches but that did not bother us since we were probably going to be putting some scratches of our own on the receivers with a household of 8 kids. It was easy to program and it had lots of customize-able features which were a nice touch. It all works well and love that there's an answering machine as well. The reception is great and the volume is loud or nonexistent if needed. We have it on total mute in the master bedroom and at the loudest upstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "maristar",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Doesn't work like it says",
      "text": "First off, the price dropped by $5 literally hours after I purchased this, which is already enough to anger me. But, I also didn't need a new phone. I only bought this one, because it says you can program silent hours. Since I work from home, this was the ONLY reason I bought this. So, FYI, that feature doesn't work. I followed all the instructions to the letter but it doesn't silence. Not ever. Even when both handsets says \"Zzzz\" like it's silenced, it's not. Complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "The Sinner Reader",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "Nice Product",
      "text": "I really like these phones! I gave them four stars because I wish they has a message indicator light that flashes when you have messages. If you use the built in voice mail system you'll have one, but I use the voice mail that's through my phone service provider. This system, though, has many useful features like call block, phone book, and intercom. I am hearing impaired and the volume through the speaker is excellent. They're really nice for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "jsb17",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Helps me block unwanted calls",
      "text": "I was overjoyed to see how easy it is to block unwanted robo-callers with this phone. And the setup was very easy. Be aware of one thing, though, the batteries that come with the handsets were almost fully discharged, so much so that it made the think the units were defective. But they were unresponsive only because of the low batteries, after charging them up a little everything else went very well. I recommend this product to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "shuttledude",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Excellent wireless phone with call blocking",
      "text": "The system is very well thought out. The range is excellent. Even the default ringtone seems unique. Most ringers sort of jolt me if they are loud enough to hear a significant distance from the phone. This ring seems soft but still easily heard. The Talking caller ID gives announces the caller id unless the number is listed in your directory, in which case it announces the name in your directory. The manual is pretty well written. Most features are easily remembered after one practice. One thing that surprised me is that the speed dial entries are unique to each handset. The neatest feature is the call block.",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Wilber",
      "helpful_votes": 3,
      "publication_date": 20180419
    },
    {
      "title": "No indicator LIGHT to indicate a msg is waiting.  LCD screen does say voicemail, but no light.",
      "text": "Typical Panasonic unit. Their phones are easy to program & setup. The only surprising thing is that there is no message indicator light. You must look at the LCD screen to see that a voicemail is waiting. All our older phones had a little orange light that flashed, calling your attention to the fact that a message is waiting. Other than that, works as expected. Sound quality is fine. Set up is easy.",
      "rating": 3.0,
      "verified": true,
      "author": "Karen H in NC",
      "helpful_votes": 3,
      "publication_date": 20181005
    },
    {
      "title": "Good quality sound but volume levels are lacking...",
      "text": "I replaced my Panasonic KX-TG7643M phone with 3 handsets with this due to the buttons on the handsets sticking making it pretty difficult to place a call. Upon charging them and setting them up I'm happy with the sound quality but not happy with the volume levels. At position #5 it's only half as loud as my old set. My old Panasonic system was built sturdy and had great sound and volume levels. Sad that everything made these days is made as cheap as possible. I'll be keeping this but next time I'll be doing my homework. ..",
      "rating": 4.0,
      "verified": true,
      "author": "JOE PILOT",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great phone to have",
      "text": "I love this phone. It has many features including an answering machine and I love that it comes with a second unit to put in my bedroom. You do not need a separate wall jack installed for the second unit, it just needs to be plugged in a regular socket. You can save numbers on it, speed dial, and so much more. They reach pretty far, I take the phone outside and to the next door neighbors house and it still works. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Amirah",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Good phone with attractive features",
      "text": "Replaced an older model Panasonic with this model. This is more compact in size, so easier to put into a small space. I like to use a phone with answering machine so I can screen my calls, and the caller ID voice announcement makes my day much easier. Love the call blocking feature. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "P Aguilar",
      "helpful_votes": 6,
      "publication_date": 20171105
    },
    {
      "title": "Nice phone",
      "text": "Very easy to set up. I like the Silent Mode feature because I had to set it up only once and it activates automatically every day. Unlike my old phone where I had to manually start the Silent Mode every time. One thing that caused me to scratch my head is that even when the Silent Mode is on, the base unit still rings. To solve this problem, you need to turn the volume on the base unit all the way down to zero. You don't have to turn the volume back up when the Silent Mode is off because you phone rings so you'll know there is an incoming call.",
      "rating": 5.0,
      "verified": true,
      "author": "Malcor",
      "helpful_votes": 2,
      "publication_date": 20180903
    },
    {
      "title": "Works good",
      "text": "Good sounding clear cordless phone with good working answering machine. Had several Unidens. Haven't we all? Lighting made the last one get stupid and the handset was getting so it wouldn't hold a charge after replacing the battery. Found this one in Amazon's Warehouse returns. Great deal, good phone. Super range when I take it outside, far more than I ever dreamed, almost a city block with other cordless phones and wireless routers in every house on the block. Yeah, I'm still a landliner and always will be (medical equipment).",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky D. Earp",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great Phone and Great Value!",
      "text": "Really great value for the money! Sound is crisp, functions are many and easy to use (mostly), and it serves as a great and reasonably priced replacement for my old cordless phone which recently died. Definitely recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Asphyxia 8",
      "helpful_votes": 8,
      "publication_date": 20171112
    },
    {
      "title": "Exactly one year from date of purchase this phone died",
      "text": "Wouldn't hold a charge after exactly one year. The volume also isn't that great, and I did like this phone, but when it wouldn't hold a charge anymore and kept dying, I emailed Amazon. OF COURSE it's not their problem and over a year or Exactly one yr, they can't help me. Told me to contact manufacturer. Called Panasonic and FOR A FEE they will give me tech support. Last panasonic I will buy. All these phones are all exactly the same anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Small but great",
      "text": "I have had a Panasonic phone for years and my cat jumped up on the counter sent my phone flying and that was the end. Since I have had such great luck with these phones I got another one. This one is slightly smaller and doesn't have the visible antenna which I like. The program feature for loading numbers is not user friendly but since my calls are to limited selections my son was able to program all the numbers I needed. That was my only complaint. I will enjoy the call block feature since there are occasions telemarketers do get through.",
      "rating": 5.0,
      "verified": true,
      "author": "Martie K",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Reliable phone",
      "text": "I purchased this phone for my mother who is hard of hearing last year. Not only does she talk on it all day but my 1 year old son has banged this phone around countless times throughout the day. This phone has taken a few hard hits and is still standing so that proves that it is sturdy, good quality and reliable. This was a good buy because it was inexpensive serves it purpose and after several months of abuse actually still rings and has no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "These are awesome! The clarity is great and BEST OF ALL ...",
      "text": "These are awesome! The clarity is great and BEST OF ALL THE BLOCKING FEATURE! I get positively giddy when the phone only rings once and it says caller blocked! Need landline for business but not marketing and political calls!",
      "rating": 5.0,
      "verified": true,
      "author": "Rory",
      "helpful_votes": 6,
      "publication_date": 20180207
    },
    {
      "title": "Having problems reciving calls",
      "text": "I bought this to replace an older Panasonic because this unit has a call blocking feature. There is an inconsistent difficulty with receiving calls. I pick up the receiver and hear a click. Tried picking up and using talk button to answer, same thing. The call says they get disconnected. Went through the manual several times and there is also no trouble shooting identified for this. If I can get it figured out, I will revise my rating. Easy to set up and everything else seems to work. But obviously this is a major deal breaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Mandela ",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "Great value and great sound quality",
      "text": "This phone replaces a 900 Mhz cordless Panasonic phone from 1986 - that one lasted 32 years. This is far superior, lighter, smaller, and better voice quality/range. The rechargeable batteries are standard AAA size. I don't see much that can go wrong here. The only cons would be that the handset is a little slippery and light/small - so cradling the phone in your neck is not that easy - but it fits in your pocket and the speakerphone works great. I consider that a reasonable trade-off because there are no large handset cordless phones anymore. I also bought a white version with two handsets and an answering machine for $16 more.",
      "rating": 5.0,
      "verified": true,
      "author": "William P.",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "I can hear who I'm talking to. The ringers are pleasant.",
      "text": "I had a phone from the state (FL) deaf and hard of hearing services for free. It was loud and the ringer was loud. I'm deaf in one ear and hard of hearing in the other. The free phone was okay but when it lost battery power, it lost connection. I went through 2 sets of batteries. I might have put up with it but the advantages weren't that great. I got these phones from Panasonic and they are loud enough for me plus the ringers don't make me hit the ceiling like the other phones. I'm very grateful for them. I wish they were priced lower. But the ones I have now will last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendasphere",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "I got a lemon",
      "text": "I trust that this is a perfectly fine phone (in general) but mine is pure frustration. When I set it in the cradle to charge it starts beeping, suggesting that it is not seated properly. I sometimes need to re-seat it half a dozen times because it won't stop beeping. And sometimes it starts beeping hours after I've seated it, often in the middle of the night. The phone functions fine otherwise but it's making me crazy. I didn't unbox it for several months after I bought it so it was too late to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Aluxa",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Great if you want to block annoying callers!!",
      "text": "This phone is perfect for its caller \"block\" feature! Very user friendly. Voice message machine that comes with it is nice. Just press play to hear messages. Con: wish there were a button on handset to pull up recordings other than going thru pressing 3-4 keys to pull them up.. (Previous phone had one press of button on handset) which meant you could take handset with you any where in home & listen to your messages. (.....but not a dealbreaker for me).",
      "rating": 5.0,
      "verified": true,
      "author": "Ray-Rae",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Great phone",
      "text": "This phone has good sound quality and I love the call block feature. Going to be really nice especially with the elections coming up and blocking the annoying robo calls. Works great for the credit card scams, cable tv scams, etc when they use the same number several times.",
      "rating": 5.0,
      "verified": true,
      "author": "C F Gunn",
      "helpful_votes": 2,
      "publication_date": 20200217
    },
    {
      "title": "Difficult to program",
      "text": "I purchased this Panasonic System to replace another Panasonic System which had worked so well for several years. While the new system has good voice quality and a call block feature which I love, I found it very difficult to set up and program. It has been weeks now, and I still haven't been able to program a couple of the features even though I have followed the directions provided. I had set up another very similar system recently for a relative and experienced no difficulty. Wish the programming could be made easier.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawa",
      "helpful_votes": 2,
      "publication_date": 20190227
    },
    {
      "title": "Great Phone!",
      "text": "The KX-TGD530 phone is fantastic! Nice bright large LCD characters for my less than ideal vision, good sound quality, and super feature rich. The menus and features could be a bit intimidating for those that are not technically inclined, but you don't have to use them all. I recommend downloading the manual from Panasonic for easy reference (I think referring to the manual a lot at first would put some of the complaints you see in the other reviews to rest).",
      "rating": 5.0,
      "verified": true,
      "author": "F. Greenlee",
      "helpful_votes": 2,
      "publication_date": 20180920
    },
    {
      "title": "Easy to put to use",
      "text": "I procrastinated at using these to replace my old phones although some of the old ones cut me off in the middle of conversations and battery replacements did not work. When I placed these in use, I found it was easy to do. It is still early in their time in service, but I like them and. have had no problems. One caution--as someone else commented, it would be nice to have a red flashing light when there is a new message. I don't always see the alert on the phone screens and find out about messages several days later sometimes.",
      "rating": 5.0,
      "verified": true,
      "author": "mjm",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Belt clip solution.",
      "text": "I was hoping to find a clip for this phone but I couldn’t so I had to get creative. I decided to post my solution here just in case someone might want to do what I did. I used an eyeglass case we had in a drawer and fortunately this case has a clip on it. The case is always opened at the top which makes it easy to just drop my phone into it and clip it to a belt or whatever.",
      "rating": 5.0,
      "verified": true,
      "author": "lollymop",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "JUNK stay away!",
      "text": "They certainly don’t make cordless phones like in the good old days. Following directions to set up a few things to work the way you would like them to be is ridiculous. Trying to record a personal message is a joke. No live customer service unless you allow them to charge you $9.95. I would return this junk, but I am leaving Florida for the summer. I will just turn it off and forget about calling in to pick up messages. It will take a week to press different codes and not know if it will work. It would also be nice not to have the callers name announced very loud. Stay away from this junk. announced very",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Perfect replacement",
      "text": "Particularly like the Call Block button. Spouse and I are both hearing impaired, volume is not loud enough unless we use speakerphone - that does the trick. Otherwise, excellent choice as replacement for older Panasonic system.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Williams",
      "helpful_votes": 2,
      "publication_date": 20200131
    },
    {
      "title": "Great phone system - Excellent choice",
      "text": "Panasonic has been my favorite cordless phone system for many years and it has been constantly improed product as time goes by. This latest model has some new and useful improvements. 1. You can turn on and off the speaker in the middle of the conversation. 2. The rechargeable batteries are now standard size and not a propriety Panasonic only batteries. 3. The speaker sound has been improved. 4. The keyboard numbers are slightly bigger. 5. Call block protect you from those pesky telemarketers and robocalls. (up to 100 of them) That's it. Get yourself this system and you will be a \"happy camper\"",
      "rating": 5.0,
      "verified": true,
      "author": "Dov Ben Amram",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Reccommend for hearing impaired!",
      "text": "The unit itself is rather 'tinny', however, the one feature that is critical to me (since I have Genetic hearing impairment) was in being able to HEAR & understand messages being played back! It has good 'clarity' and terrific volume control if you need to increase the volume to hear messages! That was the first test I put the phone through & it passed with flying colors! (low volume, garbled sounds on my old machine) In a word..... I CAN HEAR !!",
      "rating": 4.0,
      "verified": true,
      "author": "1776 Lady",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "New phones not as good as the old phones!",
      "text": "We had a set of 5 Panasonic phones for 7 years, they worked fine, one day they went silent. I bought a new set, I will be surprised, if, in 6 months or less I do not trash them and buy another set of 5 of another brand. The left message speakers are very hard to understand, any operation you want to perform must be done slowly or the phone goes off on some weird tangent!",
      "rating": 3.0,
      "verified": true,
      "author": "Gunner",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Good phone, but not for people with poor eyesight.",
      "text": "Reliable phone with lots of features. I love the one-button call block feature. It's laid out similarly to other phones in this form factor, so it should be easy to set up if you're familiar with this style of phone. Unfortunately I bought this for my 89-year-old mother who has really poor eyesight, and it turns out she can't see to operate the buttons. She really needs a simple phone with big buttons. Not the fault of this unit though.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Rugh",
      "helpful_votes": 3,
      "publication_date": 20180716
    },
    {
      "title": "Many worthwhile features, but does NOT block anonymous calls!",
      "text": "PROS: Allows storage of 100 names in phone book, which talking caller ID calls out, helping you to choose to pick up or not. Allows easy storage of 150 numbers in block list. Many other customizable features, like message screening, silent mode (turns ringer off, hours you set), etc. CONS: Although advertised, does not block anonymous calls (where no phone number on call ID). My older Panasonic KX-TGA653 also did not block this type of call, yet I have repeatedly followed the setup instructions. My provider is Ooma (basic) VOIP, but this seems like a Panasonic firmware issue. Only Panasonic phone in 30 years (this is my 6th or 7th) with NO OPTION FOR A BELT CLIP!",
      "rating": 4.0,
      "verified": true,
      "author": "Josh Marfried",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Does Not Have Smart Call Blocking",
      "text": "I have no idea of the quality of this phone but I gave it one star because it doesn't have SMART call blocking. We get innodated with robocalls and telemarketers and a phone that really has smart call blocking will eliminate the unwanted calls. This one has dumb, regular call blocking.",
      "rating": 1.0,
      "verified": true,
      "author": "Discerning Shopper",
      "helpful_votes": 2,
      "publication_date": 20190912
    },
    {
      "title": "Works great and has more slots to block those spammers",
      "text": "Upgraded my old Panasonic phone after the batteries wouldn't hold a charge. Decided just to upgrade instead of getting new batteries. Works great and has more slots to block those spammers!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim B.",
      "helpful_votes": 6,
      "publication_date": 20180124
    }
  ],
  "product_meta": {
    "title": "Panasonic DECT 6.0 Expandable Cordless Phone with Answering Machine and Smart Call Block - 2 Cordless Handsets - KX-TGD532W (White)",
    "description": "Color:White| Size:2 Handsets| Style:Talking Caller ID + Answering MachineThe Panasonic KX TGD532W expandable Digital Enhanced Cordless Telecommunications (DECT) 6.0 Phone system with answering machine and 2 cordless handsets is a smart, reliable home phone/home office solution designed to make everyday call management easier and more convenient for everyone. Includes one cordless handset in the base unit and two additional cordless handsets, expandable up to six handsets (additional handsets sold separately). Hear who's calling from across the room without having to get up with text to speech announcements in English or Spanish from the phone’s base unit and cordless handsets in the home/home office. Quickly see who's calling with 1. 6\" White backlit display, eliminate unwanted calls with Call Block capability, and all digital answering machine functions tie it all together making this cordless phone system one of the most reliable and functional systems available in the market today. Guided feature tutorials are available for this cordless phone on the manufacturer’s website. Disclaimer: DECT 6. 0 is a North American marketing term for DECT devices manufactured for the United States and Canada operating at 1. 9 GHz.",
    "rating": 4.3,
    "feature_bullets": [
      "One Touch Telephone Call Block: Register up to 150 numbers with one touch call block on the cordless phone base unit & cordless handsets; Compatible with hearing aid T coil (TIA 1083 compliant)",
      "BI Lingual Caller ID: Talking caller ID audibly announces caller information in either English or Spanish from the telephone’s base unit and cordless handsets when you can't view the screen",
      "Quick Read Message Counter: Instantly know how many phone messages you have received with a large, easy to read message counter on the phone system's elegant cordless base unit",
      "High Contrasts Displays & Keypads: Large 1.6 inch backlit LCD cordless handset screens clearly show call functions in any light; Soft touch amber backlit keypads Enhance readability; Talk time up to 10 hours; Standby time up to 5 days (120 hours); Charge time about 7 hours",
      "Telephone Ringer IDs: Assigned pre-programmed ringtones will sound on the phone’s base unit and cordless handsets when corresponding caller ID numbers are received from incoming telephone calls"
    ],
    "specifications": {
      "Product Dimensions": "4.04 x 5.04 x 3.48 inches",
      "Item Weight": "11.2 ounces",
      "ASIN": "B071GQB94T",
      "Item model number": "KX-TGD532W",
      "Batteries": "4 AAA batteries required.",
      "Customer Reviews": "4.3 out of 5 stars9,631 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#586 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 27, 2017",
      "Manufacturer": "Panasonic"
    },
    "categories": [
      "Office Products",
      "Telephones & Accessories",
      "Landline Phones",
      "Electronics",
      "Office Electronics"
    ],
    "price": 44.99
  }
}