{
  "website_summaries": [
    {
      "verdict": "A cleaning product that doubles as extremely effective cat repellent.",
      "pros": [
        "Cats hate the citrus scent of this product",
        "Since there are no chemicals, it is perfectly safe, and this can even be used to kill ants, roaches, and other small pests",
        "Customers love the scent and the fact that it doubles as a powerful cleaning product"
      ],
      "cons": [
        "The citrus scent is too powerful for some customers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Costs a little more per ounce than some other orange oil concentrates, but it is extremely versatile.",
      "pros": [
        "Ships with both a mixing bottle with a spray trigger and the concentrate bottle, making it easy to use",
        "Works extremely well on greasy residues without leaving any film behind",
        "All-natural ingredients make it safe to use anywhere"
      ],
      "cons": [
        "Not a food-grade type of orange oil, so it's not appropriate to use for food washing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Saved my marriage",
      "text": "This stuff is amazing. My husband told me don't feed the feral cat. Did i listen? No. Said cat had a litter under my house. When they were done nursing, i caught mom and 3 babies and got them fixed. The 2 remaining were trap smart and nearing breeding age. I hosed the outside of my house down with this stuff and they relocated themselves within an hour. Amazing product.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 130,
      "publication_date": 20181219
    },
    {
      "title": "Works to keep out cats!",
      "text": "I like how it comes with a spray bottle that works pretty good and easy mixing instructions right on the bottle. Bought this because stray cats were spraying all over my front yard and and my porch smelled like urine. Used it on the bushes and walk way on my front porch and I have not seen any more puddles of urine or feces like I used to and it covered up the previous odor I had with a nice pleasant orange fragrance. So far it has been doing it's job, but I have no idea on its other uses.",
      "rating": 5.0,
      "verified": true,
      "author": "wishiniwasfishin",
      "helpful_votes": 86,
      "publication_date": 20181108
    },
    {
      "title": "Cat deterrent",
      "text": "I bought this to use to keep cats out of my flower beds. So far, it is working great!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan LeBrun",
      "helpful_votes": 79,
      "publication_date": 20181003
    },
    {
      "title": "It really does have many uses",
      "text": "I used this orange peel oil in diluted form for general cleaning purposes - counter-tops & flooors. Works very well and the orange scent is great as an air freshener! I've also used this product outdoors where some feral cats have sprayed their musk in the flower beds - I sprayed the 1:1 oil/water in the area or directly on the plants / flower beds. The awful cat scent is gone and it deters the cats from returning (for a couple of weeks at least).",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne H.",
      "helpful_votes": 52,
      "publication_date": 20180305
    },
    {
      "title": "Works on everything!",
      "text": "Smells great (although it can give you a bit of a cough in closed quarters) and does everything it says. Used it to revive some older slightly haggard wood pieces. Helps ward off foggy mirrors in the bathroom and we used to help repel termites as well! Lasts forever bc of dilution. Only gave it 4 stars because the sprayer in the included bottle had to be replaced after a very short period.",
      "rating": 4.0,
      "verified": true,
      "author": "Anne F",
      "helpful_votes": 52,
      "publication_date": 20180317
    },
    {
      "title": "I have found this product to be as represented. ...",
      "text": "I have found this product to be as represented. I purchased it primarily to treat fire ants in my yard. I found it to be effective when mixed with Dawn dish soap and water. Since the orange aroma is pleasant I will probably also use it for cleaning. It is quite strong so dilution will be needed for normal cleaning purposes. I will definitely use this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 53,
      "publication_date": 20170920
    },
    {
      "title": "Keeps cat from peeing on rug!",
      "text": "Love the fresh scent plus I love how it keeps my cat from peeing on my foyer rug and the dog bed! Can't wait to try it as a weed killer mixed with vinegar. Thanks for the great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Lampton",
      "helpful_votes": 26,
      "publication_date": 20190820
    },
    {
      "title": "Bad for cats",
      "text": "Product arrived intact & was as described. It smells nice as a cleaning product and seems like it is good quality However, I just want to leave a warning- this made my cat very sick and he almost died. Essential oils can be deadly to cats! I took him to the vet and he had to have his system flushed out because he was vomiting and lethargic. When essential oils are wet they can enter through the cat’s skin and act as a poison.",
      "rating": 4.0,
      "verified": true,
      "author": "Abigail",
      "helpful_votes": 13,
      "publication_date": 20190829
    },
    {
      "title": "This isn't the \"Cold Pressed\" version",
      "text": "This item IS NOT the \"cold pressed\" version, like it shows in the picture. The version I received did not have the \"cold pressed\" designation and was watered down significantly. This version: 1oz only makes 22oz of cleaner. With the \"cold pressed\" version 1oz makes approximately 1 gallon. I found out the hard way. Misleading picture.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20190823
    },
    {
      "title": "Save your $$$! Product does NOT work to keep intact outdoor cats from peeing all over your property!",
      "text": "This Green Gobbler All Natural Oil Concentrate seems like a TOTAL RIP OFF! Besides the scent, it does nothing that the description states. Many people wrote in that they had been using it top keep feral cats out of their yards--I used this product according to PKG directions and each and everyday I am forced to endure the stench of male cat urine, despite having gone through my entire bottle of this Green Gobbler. What a mistake!",
      "rating": 1.0,
      "verified": true,
      "author": "DEBBIE",
      "helpful_votes": 9,
      "publication_date": 20190501
    },
    {
      "title": "Horrible",
      "text": "I hate to write a bad review, but this smelled ssoooo bad I had to take it out of the house. It said it would kill bugs, and even though I didn't buy it for that I took it outside and sprayed some ants and they seemed to love it???? I just couldn't get over how bad the smell was and I would never use it on anything in my house.",
      "rating": 1.0,
      "verified": true,
      "author": "Mimi22",
      "helpful_votes": 9,
      "publication_date": 20190701
    },
    {
      "title": "This stuff really works",
      "text": "I've never used this stuff before, but it was recommended by a friend for a mold problem in my house. Boy, does it work! It does have a somewhat strong odor, but the odor is very pleasant. I would recommend, if everything in your house is contaminated as mine was, that you do some of the spraying outside. Otherwise it can become overwhelming. But even for everyday cleaning this stuff is pretty darned great.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Cook",
      "helpful_votes": 9,
      "publication_date": 20190420
    },
    {
      "title": "Cats off",
      "text": "I got the spray to keep the cats off my new recliner. They had destroyed the old one. So far so good. The little culprit who did the most damage has walked into the room and eyed the chair curiously and has left it alone. Hoping it continues to work. Has a pretty strong smell but it doesn’t bother me. It’s orangey smelling.",
      "rating": 5.0,
      "verified": true,
      "author": "Marian",
      "helpful_votes": 9,
      "publication_date": 20190619
    },
    {
      "title": "Very effective for ...",
      "text": "... discouraging our cat to bite on the house plants! highly recommended if you need to ward off your feline friend from furniture, plants, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "dt",
      "helpful_votes": 14,
      "publication_date": 20181006
    },
    {
      "title": "NOT A CAT DETERRENT",
      "text": "When I contacted the company they said they have never claimed this spray will deter any animals. However Amazon shows this in cat deterrent searches. This deters the cat while the area is still wet. Post drying it does nothing as a deterrent. DO NOT BUY THIS TO DETER ANIMALS AWAY FROM CERTAIN SPACES OR COUNTER TOPS. There is also part of the label that says this is POISONOUS if ingested. I will return to my non-lethal natural homecare products. We are trying Feliway for our deterring needs now.",
      "rating": 1.0,
      "verified": true,
      "author": "Genevieve",
      "helpful_votes": 6,
      "publication_date": 20200217
    },
    {
      "title": "Repels cats from couches",
      "text": "I love this product so far I’ve had it for a week or two. I wanted it to spray on my fiancées couches because I’m very allergic to cats and he has two cats. I wanted to prevent the cats from going on the couches because they shed so much and I can’t sit on his couches . So far I have seen no cat fur on the couches and I’m really surprised . I’ve seen them jump up on the couch but they never get comfortable and stay on it so I’m okay with that. I’m shocked that it actually seems to work, and it makes the house smell clean and hasn’t stained the furniture !",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 8,
      "publication_date": 20190509
    },
    {
      "title": "Cuts through baked on grease",
      "text": "I remodel my kitchen and purchased a wolf wall oven I was told by the service technician not to use the self cleaning feature due to the high heat which over time would burn out the heating element he recommended a orange cleaner,so I went on Amazon to research by customers reviews and came across green gobbler pure orange. I sprayed it in my oven waited 30 minutes the product broken down the grease with a damp sponge wiped the oven clean. I would highly recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Michele P.",
      "helpful_votes": 10,
      "publication_date": 20180417
    },
    {
      "title": "Product produces success",
      "text": "As a Master a Gardener we try to use non herbicidal products like this one. The pesky cat in question has not returned to use our patio for his personal litter box since spraying your product 10 days ago. One suggestion: make sure the included spray bottle actually has measurement lines as advertised. Fortunately, my Chemist husband estimated the right solution proportions. The unmarked bottle caused this to be a 4 star rating and not a 5.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Reviewer",
      "helpful_votes": 4,
      "publication_date": 20190615
    },
    {
      "title": "Needed this to deter my naughty kitty",
      "text": "I have a bad cat who was using my houseplants to do her business. I purchased this product to deter her in a way that would not harm my plants. It worked liked a charm. Mixing it up was very easy and I have enough to last me a while!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica S D.",
      "helpful_votes": 8,
      "publication_date": 20181220
    },
    {
      "title": "Does NOT work as a cat repellent",
      "text": "I bought this specifically to use as a cat repellent because of the reviews, but unfortunately it has no effect. We have neighborhood cats that use our new patio furniture and leave stains on the cushions. I'm really disappointed I was hoping it would deter them.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20200227
    },
    {
      "title": "Chemical Free",
      "text": "I clean homes and wanted to try this for the cleaning and the clean smell. I found it to be a bit strong when I used it for showers. I sprayed it on and let it dwell for a few minutes. Being in that close quarter, It bothered me. As for cleaning, it did a great job. I liked it for the sink and countertops.",
      "rating": 3.0,
      "verified": true,
      "author": "DEBBIE",
      "helpful_votes": 5,
      "publication_date": 20181116
    },
    {
      "title": "NOT safe for cats!!",
      "text": "I just contacted the company and found out it is NOT SAFE FOR CATS!! They said it was HARMFUL to cats and NOT to use it to stop them clawing my sofa! THOSE WHO ARE USING IT AS SUCH SHOULD STOP USING IT!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "sky",
      "helpful_votes": 5,
      "publication_date": 20190909
    },
    {
      "title": "Using it on my plants",
      "text": "I bought this because a friend of mine told me this works great for killing scale, and stopping rust on epiphyllums. I've only started to use it and it seems to be doing the job. It's killing the scale and so far the rust is not spreading. You have to mix 4 tablespoons per gallon, and I use a Q-tip to apply it. Has a nice smell, so I'm sure I will find other uses for it.",
      "rating": 5.0,
      "verified": true,
      "author": "lizardann",
      "helpful_votes": 4,
      "publication_date": 20190111
    },
    {
      "title": "Cat scratch deterrent",
      "text": "I bought this to spray on furniture to stop my cats from scratching. I sprayed it on two upholstered chairs they use all the time as their scratch posts. Before I buy new chairs I wanted to be sure they wouldn't touch it again, and they haven't! Using their actual scratch post now that I've removed these items from their options. Nice scent and no staining of fabric.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Lambert",
      "helpful_votes": 3,
      "publication_date": 20190720
    },
    {
      "title": "Miracle Cleaner",
      "text": "Cleaned glass in oven door in minutes..no scrubbing!. Smells wonderful..clean and crisp. My major hope is that the squirrels will now leave my flower pots alone. Have sprayed entire porch and patio, and so far have not had a squirrel dig up anything since the spray. I poured a bucket mix on some fire ants and I hope that is the end of them..too soon to tell. This maybe the only cleaning and gardening product I ever need.",
      "rating": 5.0,
      "verified": true,
      "author": "HGB",
      "helpful_votes": 2,
      "publication_date": 20200812
    },
    {
      "title": "Chemical free strong cleaner!",
      "text": "This is my favorite cleaning product. It works amazing, I use it on everything and makes everything smell like fresh oranges. And it is just that....orange oil, so no harsh chemicals. I can clean the bathroom with my toddler in there and don't have to worry about her breathing in the fumes. I can not worry about chemical residue left over for my family soaking into their skin and eventually in their bloodstream. I love it! I mop with it, clean the bathrooms, kitchen, car, wood, granite, etc. My favorite go-to! Worry free.",
      "rating": 5.0,
      "verified": true,
      "author": "Momma Franklin",
      "helpful_votes": 4,
      "publication_date": 20190509
    },
    {
      "title": "An unexpected benefit!",
      "text": "While this works great for cleaning, and leaves a fresh natural smell, it also works for a pesky neighborhood cat who has decided to start spraying on my front porch and planters. After cleaning the area, I now just give a squirt in the areas every couple days, and the cat has not sprayed since . I do use a stronger concentration for the cat issue than I do for general cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "jwel",
      "helpful_votes": 4,
      "publication_date": 20190322
    },
    {
      "title": "This is a great product!",
      "text": "We have had borer (carpenter) bees making holes in our porch for years and nothing I tried worked to keep them away. I sprayed one light application of the orange oil on the porch, and it worked! The borer bees will hover near the area, but then fly away. It's organic, doesn't hurt the bees, and smells wonderful. I'm so happy I found this product. It has lots more uses too, so I'll enjoy experimenting with it for cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey R.",
      "helpful_votes": 4,
      "publication_date": 20200419
    },
    {
      "title": "It cleans EVERYTHING!",
      "text": "I did not realize how versatile this product is! I use it on the toilet, my shoes, the kettle, steps....everywhere and it always leaves a nice fresh smell. One stop cleaning!!!! PLYS I used it with lavender oil as a cat repellant and, you guessed, it worked! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180828
    },
    {
      "title": "No more cat poop or smell!!!",
      "text": "I love this product. I was looking for something that would keep the neighborhood stray cats away from my house. I sprayed the product according to the directions around the perimeter of my house and my back patio. It not only kept them away but also has a nice orange scent. I just used it 4 days ago and so far so good. I can't wait to see the many other uses it has. Its multi-functional. I will rate the other uses once i try them . It gets a 5 star rating from me because I've been fighting these cats since I purchased my home.",
      "rating": 5.0,
      "verified": true,
      "author": "latinastyle",
      "helpful_votes": 3,
      "publication_date": 20191015
    },
    {
      "title": "IT WORKS!",
      "text": "I bought the Green Gobbler Orange Oil because my cat had been spraying around the house. This stuff completely gets rid of the cat urine smell!! And he hasn't sprayed around the house since I started using this, so it works and it works really well!",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra Westmark",
      "helpful_votes": 3,
      "publication_date": 20190224
    },
    {
      "title": "No effect on cats",
      "text": "If you're looking for a cat repellent, save your money. Cats walked right over a fresh application with zero effect. Does not work for this purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "WreckWriter",
      "helpful_votes": 4,
      "publication_date": 20190822
    },
    {
      "title": "Finally, something that keeps our cats away from the Christmas tree",
      "text": "This really, really works! I mixed it as directed on the bottle, sprayed it on our artificial Christmas tree, and bam! Finally, the cats didn't want to chew on the branches or climb into the tree. I've found that I need to re-spray it about every 3 days or so to ensure that the cats keep out of it. Also, the orange scent is marvelous -- strong, but not \"fake\" smelling. It smells as if I'd been juicing fresh oranges.",
      "rating": 5.0,
      "verified": true,
      "author": "L. OsborneTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Wonderful aroma",
      "text": "Smells great! Works well on stove and oven. Does a nice job on the wood trim the house. Plan to try it in the carpet cleaner soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Weidner",
      "helpful_votes": 10,
      "publication_date": 20170911
    },
    {
      "title": "Cleaning greasy spots off my carpet",
      "text": "The first bottle I mixed smelled a little too strong, but I diluted it more and it was fine. I am using it for grease spots on my almost white carpet, and was worried it might 'bleach' the carpet, but decided that was better than black spots. So far it has worked great, and hasn't left bleach spots either. I am spot cleaning right now, in anticipation of a whole house cleaning. I also mixed a mop bucket and poured it in a mulch bed the neighbors cats were using for a litter box. Hoping they dislike the orange smell and move on.",
      "rating": 5.0,
      "verified": true,
      "author": "H. G. Williams",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "I Tawt I Taw a Puddy Tat  but not on my Vespa Scooter",
      "text": "I love cats but they would pee on my Vespa several times , so I get tired of cleaning the mess off,, I decided to give this product a try, it works like a charm I'm very satisfied with the results, that was like 2 months ago I haven't got to clean cat urine from my scooter anymore. I Tawt I Taw a Puddy Tat , but on the floor, not on my Vespa Scooter.",
      "rating": 5.0,
      "verified": true,
      "author": "ALEJANDRO GUERRERO",
      "helpful_votes": 2,
      "publication_date": 20190807
    },
    {
      "title": "Orange cleaning  properties and price",
      "text": "Love the fact that it cleans better than anything that I have ever used before and the cleanliness last and fresh smell lingers for quite awhile. I was ordering gp66 and just happened to see your product. I will be purchasing Green be Gobbler from now own. Also, the price is great and as a senior person this is an amazing cleaning product and I'm so glad I ordered this. I am using this cleaner for everything and the smell is so refreshing and delicate. Thank you for all your commitment in producing this amazing product. Thanks again. Brenda",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Murphy Lane",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great fragrance, use sparingly on floors",
      "text": "This lovely orange fragrance freshens the air when cleaning.. The spray bottle is made well unlike so many spray bottles that only seem to last a month. Remember to shake well after it is diluted and before each use.I did dilute the mix recommendation further. I tried on both my laminate floors and tile floors and it leaves a somewhat sticky surface. It definitely needs a fresh microfiber mop head to rinse the floors so they are not sticky and show the footprints. It works great keeping the inside of car fresh, but remember to rinse well.",
      "rating": 4.0,
      "verified": true,
      "author": "ann",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Good cleaner",
      "text": "Got this originally to deter my cat from getting into things, since they supposedly don't like citrus. It partially works for that- right when I spray it and it's still wet he stays away. But the effect only lasts a few minutes and then he perseveres. BUT I also use it to clean and it works so well at getting grime off. It leaves wood looking shiny and healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Macri",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Simple, strong, effective",
      "text": "I purchased this to kill mealy bugs on my hibiscus. It is working on the bugs and the plant is not showing any signs of harm from the oil. I also used it to clean and deodorize a garbage can, and it also worked well for that. Definitely a good product to have around.",
      "rating": 5.0,
      "verified": true,
      "author": "Elemeno",
      "helpful_votes": 4,
      "publication_date": 20180820
    },
    {
      "title": "Don’t waste your time and money. It does not work as a cat repellent!",
      "text": "We purchased this to keep the neighborhood cats off of our patio furniture. We diluted the solution based on the markings on the bottle. This did not work whatsoever. The cats were making themselves right at home on our patio furniture. So we tried a heavier, less diluted, mixture and it still did not work. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "chris baum",
      "helpful_votes": 4,
      "publication_date": 20190511
    },
    {
      "title": "Like the smell",
      "text": "Cleans like it should. If you spray it in your yard(every 3 or 4 days for a couple of weeks the cats get tired of it an move on .",
      "rating": 5.0,
      "verified": true,
      "author": "Papa bear",
      "helpful_votes": 3,
      "publication_date": 20190612
    },
    {
      "title": "Great value multipurpose product that smells like lemon heaven",
      "text": "This is wonderful for cleaning and smells fantastic. It stops fire ants in their tracks! I always have it with me when I’m gardening. If you do use it in the garden, be aware that it will kill monarch caterpillars so do not spray milkweeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Christa",
      "helpful_votes": 2,
      "publication_date": 20200121
    },
    {
      "title": "Not what i hope for.",
      "text": "I was hoping this would deter my cat from a spot he likes to poop on one of my rugs. It didnt at all. It did work pretty well for cleaning my stove. I sprayed it and let it sit for a few minutes and cooked on crud wiped off pretty easily. The scent is ok. Smells like old orange peels. I am very disappointed with the spray bottle. It broke after just a few uses. Truthfully I probably wont buy this again unless i find some other great use for it.",
      "rating": 3.0,
      "verified": true,
      "author": "L House",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "This stuff really works to keep stray cats away!!",
      "text": "I have seen miraculous results! I was desperate in keeping stray cats away from peeing, pooping, and annoyingly meowing in my front and backyard. The smell of urine started to become a noticeable nuisance. I sprayed this stuff a few times and boy, have I seen how effective it has been! Wahoo! Now I'm going to spray it weekly or biweekly! Yay!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Yung",
      "helpful_votes": 2,
      "publication_date": 20200401
    },
    {
      "title": "Miracle cleaner",
      "text": "I love trying to find more thongs to spray. It’s incredible at what it cleans. You know how on a stove or stainless steel sink they just get grimy and short of scrubbing forever with green pad there is no way to clean them? Well this stuff you spray, wait a minute, and then wipe away. I was super duper skeptical but am sold. This stuff is worth the price. It smells great too and has many uses. I’ve cleaned upholstery with it and no side effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Great Smell & Easy To Use Spray Bottle",
      "text": "The only reason I got this was to spray my outdoor furniture and repel cats. This came with an easy to use spray bottle that has lines that tell you how much water to fill, depending on severity of usage. The scent is fantastic, I feel like I'd want to use this in the bathroom and so far, I haven't seen any stray cats near my furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Orange oil works for everything, the bottle is trash.",
      "text": "I use this all over my house, I love it! I don't love the spray bottle though, I was in the middle of spraying down my shower when the nozzle stopped working.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 7,
      "publication_date": 20180313
    },
    {
      "title": "Satisfied",
      "text": "I used it to clean my house and feral's cat poop and urine smells in my back yard and front porch",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth P.",
      "helpful_votes": 4,
      "publication_date": 20181230
    },
    {
      "title": "Great cat deterrent",
      "text": "Got this mostly to keep my cat from eating houseplants. And it works!! Really pleased to get that problem solved. Just be careful not to spray it on the plants as I did once. Now I shield the plants and just spray it on the pot on all sides. Lasts quite awhile. I refresh it after maybe three months or whenever I catch him sniffing around plants again. It’s also a good cleaning agent but I don’t use it for that as I don’t want to desensitize the cat to the smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Sprite",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Pathetic spray bottle",
      "text": "I am totally disappointed in this product. 1st there are no 1,2,3 lines on bottle for proper measuring, but I can live with that. The part that is really annoying to me is the defective spray bottle that continually pours all over my fingers and hand to the point that it is unusable. I would think for the money this company could at least provide a decent spray bottle. It’s pathetic that I have to trade it out with a sprayer from the Dollar Store!!",
      "rating": 2.0,
      "verified": true,
      "author": "cin",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Good cleaner-bad grasshoppericide",
      "text": "Honestly, I originally bought this bcz I wanted a natural thing to drive away a nasty grasshopper that was assaulting my Indian basil shrub. Read somewhere that they don’t like orange oil so I got this. While the didn’t exactly work and the grasshopper got fatter and fatter by devouring my basil, this is a good cleaner :) it has a good smell and it’s great that it won’t kill you while cleaning. But it’s not for grasshoppers!",
      "rating": 5.0,
      "verified": true,
      "author": "Sh",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Not a cat deterrent",
      "text": "Supposed to be a cat deterrent but it did nothing. I have the cat in question, walking in the same place I sprayed. I made a stronger dose and again, the cat did not react to it in the least. It’s garbage in terms of a cat deterrent. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200229
    },
    {
      "title": "Don’t waist your money",
      "text": "Did nothing to get rid of greasy stains. Not a good smell, separated quickly so I needed to shake the bottle frequently",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190331
    },
    {
      "title": "As advertised, but...",
      "text": "I mainly bought this product to stop our old cat from peeing in one spot by the sliding glass window. I have to place absorbent pads there now to save the carpet. I love the citrus smell an will use this product for cleaning as advertised, but the cat stayed away from the area as long as the smell was fresh and wet. However she did pee on the pad again by morning. We will keep at it maybe she will get the idea!",
      "rating": 4.0,
      "verified": true,
      "author": "R. W.",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Shiny Granite Countertops!",
      "text": "I originally purchased this cleaner to keep my cats off the furniture, as I read it acts like a “cat repellent”. It did not repel my cats from the furniture at all. However, this has become one of my favorite cleaners!! I find it works best for cleaning granite counters, the front of my stainless steel fridge, and the sink. The smell is very fresh, but can be overwhelming right after use. Since you mix the product with water, it lasts forever!",
      "rating": 5.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Works very well",
      "text": "Works very well for the purpose I bought it for. Was happening trouble with cats disturbing the mulch around newly planted plants. Sprayed the mulch once and the cats stopped. Will probably use for cleaning at a future date. Am pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill N",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Good product, not for cats in heat",
      "text": "I’m glad there’s a safe and nice-smelling solution to keep kitties away from some things, but it doesn’t deter a kitty in heat from spraying. Hopefully it would be more effective for a cat on a normal day. Also just good for a safe option to make the house smell better, since many options are dangerous for kitties. Wouldn’t suggest detering them from the whole house or the litter room, but still a nice option to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Works but use more like 1/3  to 2/3 water",
      "text": "I tried this and it worked but when I diluted it the cat came back. I added more solution like 1/3 to 2/3 water and it did the trick. I hate other peoples cats using my yard to poop in and spray. Its so awful. But this really works. No more cat hair on our furniture!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "This did the trick!",
      "text": "I bought this for one purpose only. We had some sort of beetle in our wood windows eating through the frame. The pest control person told us we should just replace the windows. Whoa! Way expensive! I remember hearing that orange oil had been used for pest control on some houses so I bought this a painted it directly on the window frames and mullions. There is no more residue of fine saw dust from those pesky devils eating through my windows! Amazing. No stain on the wood either. It would an easy and much less expensive fix. I'll now try it on some other things.",
      "rating": 5.0,
      "verified": true,
      "author": "gina",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Keep cats away",
      "text": "Bought this to stop cats from pooping on our flower bed, it seemed to have work because now they’re pooping in the yard. I have to reapply every after rain. The scent is quite strong even though we diluted it as per instructions, I tried using it to clean the stove and it was okay~ the smell almost killed me. I don’t recommend using it indoors, unless you can stand strong smells.",
      "rating": 4.0,
      "verified": true,
      "author": "LA R.",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Nice cleaning product.",
      "text": "I bought this product to repel my cats from chewing on my houseplants. So far, so good. I was happy to find it is also a nice cleaning product for my wood furniture, so it is doing double duty!",
      "rating": 5.0,
      "verified": true,
      "author": "Mergirl",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Never be without it again!",
      "text": "I’ve been using this for awhile for basic clean up, works great smells nice. I live in a very rural area, a lot next to me started to develop with back hoses and tractors not just digging up dirt but lots of critters escaping to my home. RATS! I noticed this spray kills flies almost instantly so I gave it a try for the rats. Gone!!!! They hate it. I love it❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Multiple uses",
      "text": "I was very surprised at how one could use this. We mix the oil with water, soap, and alcohol, to create insecticides that have gotten rid of aphids in 1-3 days of application on our plants (indoors and outdoors). I've also used it to spray near our home to deter cats and it smells great when cleaning. We use it more than anything for the plants. Insects avoid the strong scent (and animals).",
      "rating": 5.0,
      "verified": true,
      "author": "Cristhian Altamirano",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Kills fire ants",
      "text": "I purchased this to deal with multiple large mounds of fire ants in our backyard. We mixed 8ozs of Orange oil per three gallons of water and added several tablespoons of Dawn dish soap. We drenched all our mounds and have been ant free since! We did use the entire bottle so will have to purchase more if they come back.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna",
      "helpful_votes": 6,
      "publication_date": 20180412
    },
    {
      "title": "Awesome citrusy goodness 🍊 🍋",
      "text": "Great cleaner! Smells amazing!!! Makes the whole house smell wonderful. I also use it for my cleaning business because it’s so versatile and customers are always satisfied. Easy to mix goes a long way and packaged well so no leaks!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy N",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Cat deterrent",
      "text": "My neighbors cat started using my raised beds as it’s litter box and started killing birds in my backyard. I decided to try this as a deterrent and it seems to be working so far. Not sure how long the effectiveness lasts. I’m happy with the product so far. (I made a much stronger solution than needed for cleaning though).",
      "rating": 4.0,
      "verified": true,
      "author": "SV",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "smells great",
      "text": "We actually purchased this to keep our cat off of the shower curtain, shower rug, etc. we have not tried it as a cleaner yet, but are impressed with this lovely scent. By the way, you did a great job of repelling our cat from where we did not want her!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "You get what you pay for.",
      "text": "My cats stay off wherever I spray it. Good enough for me. Used as directed this will last me a long time. Have not learned time wise how long one app. On my gym mats.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Brown",
      "helpful_votes": 2,
      "publication_date": 20190519
    },
    {
      "title": "Helped stop my cat from tearing up the sofa",
      "text": "So far it has been a week and my cats stopped scratching the sofa where I sprayed this! I spray it every few days. Be care as it has a very strong scent when you go by the strong instructions, but no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Darla S",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "DO NOT BUY",
      "text": "If you’re buying this to keep cats out.. don’t bother. We sprayed the entire perimeter of our yard and our lawn with this. The neighbors’ cats returned hours later. We tried once more hoping it would work, and the cats have been on our lawn more than ever. Also, the spray put massive holes in all of the leaves on our shrubs! This product is horrible",
      "rating": 1.0,
      "verified": true,
      "author": "Marco Cicchetti",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Doesn't work for cat spraying door",
      "text": "I bought this to stop a male cat from s spraying my front door. But he sprays The door right after I apply it so it's not helping with that issue.",
      "rating": 3.0,
      "verified": true,
      "author": "ZomDee",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Smells so nice",
      "text": "I mostly got this because I thought it would have an affect on the surfaces that my cats decide to walk on, but my cats don’t seem to mind the smell. So it didn’t do exactly what I was hoping for, but it smells so nice! It gives the home a very fresh clean smell. Now I use it before I have guests over. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Viola",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great stuff!!",
      "text": "I originally bought this for the stray cats that keep getting on my deck which it seems to help but they still hang around. This product works great on ants though! I had hundreds of tiny ants and nothing was keeping them away. I sprayed this and walked away. Came back an hour or so later and no more ants!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Allan Brown jr",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Works",
      "text": "We got this to keep the cats from tearing up the Christmas tree. Worked great at first. Continued working on one of the cats, but the other one is an evil Siamese who’s hell bent on destroying everything, so she summoned her Siamese demon cat powers and was able to overcome the smell. Also, it’s a good cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Charise Ryan",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Works nicely for deterring my cat",
      "text": "I bought it to deter my cat from jumping on my piano. It works quite well.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Chan",
      "helpful_votes": 5,
      "publication_date": 20181109
    },
    {
      "title": "Good cleaner",
      "text": "I initially purchased this to keep feral cats out of my garden . Unfortunately it didn’t work for that . It wasn’t a total waste of money bc I DO LOVE the way it cleans & the fresh , citrus scent . I would have rated it a 5 star purchase if it worked as a cat deterrent.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Strong orange smell, but cleans very well",
      "text": "Con: Smell is really strong and even after rinsed can last for days Pro: Works really really well for cleaning I would definitely recommend it for cleaning outdoors. For indoors, use only in well-ventilated area and be sure to rinse it off.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa J. Hulvey",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "impressive cleaning producct",
      "text": "it's so versatile and it removes grease like a charm. though I bought it initially to deter cat, unaware of its cleaning capability. as a cat deterrent, it's a fail (very short lived so the cat comes back all the time to where he shouldn't go). but I will buy more for cleaning, better than most of my cleaning product",
      "rating": 5.0,
      "verified": true,
      "author": "M. Zhao",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great purchase!!",
      "text": "This stuff is AWESOME!!! Had a backed up drain. Poured Green gob in my sink, an in less than 5 mins clogged drain was no more. No more stray cats by my door, scent is the best aroma ever. When I open my door its smells fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya W",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Mixed feelings",
      "text": "I have mixed feeling about this item, I put it around my front gate and house permitter. I don’t like that every time it rains it goes away and the cats then continue to come back, it’s becoming a every other day if spraying. Hopefully it stopes raining to see the full potential of this item.",
      "rating": 4.0,
      "verified": true,
      "author": "Claudia Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Deters my kitty and smells great!",
      "text": "I bought this to try to keep our cat from playing with the hanging blinds as she was destroying them. From the first time I sprayed them, she stayed away. I've been respraying them occasionally, not sure how often it will take to keep her away but so far every few weeks has worked. I didn't buy it as a cleaner, but I love the smell and now use it for the kitchen counters!",
      "rating": 5.0,
      "verified": true,
      "author": "K. D. Hendrick",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Great for Pet Stains and Odors",
      "text": "This product totally amazed my husband and myself when our 16 year old cat did her business 1 & 2 on our office carpet. We grabbed our bottle of Green Gobbler because we didn't have anything else and it not only took care of cleaning up both messes quickly, but it also made the room smell so good! Nothing amazes my husband but when he saw how fast the mess cleaned up out of the carpet he was sold on this product. I use this product to clean with everywhere and I am also excited by the fact that it cleans my stainless steel with a perfect shine. I highly recommend this product to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Bush",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Worked as expected",
      "text": "I bought this to use in a nonconventional way. I no longer want to use round up type products for my weeds. I had read to use this product along with vinegar would kill weeds. I used it around my bird feeder and it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Miller",
      "helpful_votes": 4,
      "publication_date": 20180302
    },
    {
      "title": "Good Value.",
      "text": "I like that you get a refill bottle to mix the product with water. However, the product scent is very strong. You definitely need to have some ventilation if using inside the home. Otherwise, it does have a orange smell that last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Still Searching",
      "text": "This DAMN DIRTY cat keeps coming around. I almost finished a bottle. Gonna start searching again for a product that can prevent him (cat) from coming near me, cause he is FILTHY",
      "rating": 1.0,
      "verified": true,
      "author": "SLD",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Versatility",
      "text": "I used it for a cat repellant, but it works great on many other household things. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirt",
      "helpful_votes": 3,
      "publication_date": 20190617
    },
    {
      "title": "Nice product",
      "text": "I purchased Orange Gobbler to try to keep our cats away from the sofa and loveseat. It seems to be working. This is such a nice product in that, the smell is pleasant, it doe not contain harsh chemicals, it's safe for pets, plus you dilute it with water so i the supply will last a long, long time. I'm also impressed with it's so many other uses. I do wish it came with clearer instructions on how to use it and on what surfaces it can be used on. Overall, very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Ant killer",
      "text": "I had read that orange oil could be used in the yard on fire ants. I ordered this for that purpose. It seems to be working quite well. I make a mixture with Dawn dish soap and water and spray spray the mounds. I like this instead of a toxic ant killer because I have dogs in the yard",
      "rating": 4.0,
      "verified": true,
      "author": "Janet Pike",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Say goodbye to uninvited creatures on my property",
      "text": "My problem was cats & dogs made my front side house where I plant perennials for summer even in the winter their toilet. (Someone always brings their dog to my flowers bed) and this product is doing a great job and send them goodbye for now. At least I can come home not being welcomed by the mess. Also cleaning everything from bathroom to the kitchen to the the basement. Why 4 stars? The spray bottle. Improve it next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Beebee101",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Cleaner and Bug Killer",
      "text": "Cleans as good if not better than a lot of harsher things I've used, and has the added benefit of killing stubborn North Carolina roaches pretty much in their tracks! Smells much nicer that the other stuff, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Beckley",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Don’t buy",
      "text": "I bought the product because I needed something natural to clean the greasy stoves and oven, but didn’t work no matter what concentration or amount used, only made it look more shinny with grease there.",
      "rating": 1.0,
      "verified": true,
      "author": "Momo",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great for Cat-a-way",
      "text": "Using this successfully to keep our two cats out from under our Christmas tree, and off the kitchen counter too. Good news is that it is a terrific cleaner as well, so we get a twofer with this concentrated product.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "It works and is pet safe.",
      "text": "Kills ants and other small insects on contact. Wonderful orange odor. Much more pleasant than other pesticides. Cats seem to handle it well. Clean it up after target eliminated, once sprayed, nothing else will wander into residue. Dries after awhile. So can't leave liquid barriers, even tho seems to contains oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Jupar",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "bought it for stray cat issue, didn't help",
      "text": "I read dozens of glowing reviews on how spraying this kept stray cats away. We have half a dozen stray/feral cats pooping in our carport, and spraying urine all over the front of our house. I sprayed an entire bottle of this all over the carport and house, they stayed away for about 18 hours and were back the next day. I'm not quite sure how people are getting this to work miracles with their stray cat problems. It does smell lovely and i'm sure it's a great cleaner, but I have enough of those, and too many stray cats!",
      "rating": 2.0,
      "verified": true,
      "author": "Gillian Ham",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great product!",
      "text": "I originally bought this to keep the stray cats away from my back and front porch, but use it in the kitchen and bathrooms.. really all over the house. I love the smell it cuts grease from the stove line a dream! Love love love , I'll reorder when I run out... it will be a while since it goes such a long way lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean brodie",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great for cat behavior training!",
      "text": "I bough this to keep my kitty from ping behind our appliances. I also use it on furniture I don’t want her scratching up and it works like a charm! I have to reapply once or twice a week, but I don’t mind because it smells nice. Definitely only add enough orange oil to the line marked on the filler bottle. This stuff is strong!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "doesn't work for cats",
      "text": "I used this for a cat problem- and it only deterred them from poopin on the garage floor 2 days after I used it.",
      "rating": 1.0,
      "verified": true,
      "author": "buyer of many things",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Does not work on Cats we still have a big cat problem",
      "text": "It stated that it would help get rid of the cat problem we have and it did not",
      "rating": 1.0,
      "verified": true,
      "author": "Danny Martinez",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Smells Amazing",
      "text": "Smell was so strong it gave me a headache at first. But once diluted it reminds me a little of orange juice. Maybe more like an orange tic-tac. It is so fresh and clean smelling. I LOVE it and I’ve been using it for EVERYTHING. LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Chrystal Wall",
      "helpful_votes": 0,
      "publication_date": 20200603
    }
  ],
  "product_meta": {
    "title": "Green Gobbler All Natural Orange Oil Concentrate - 22.5 oz (D-Limonene)",
    "rating": 4.4,
    "feature_bullets": [
      "GREAT FOR USE IN AND AROUND the Home & Garden - Includes 22.5 oz Bottle of Concentrate + 22.5 oz Trigger Spray Bottle for mixing. Makes up to 20 bottles of ready to use cleaner!",
      "ALL NATURAL CLEANER THAT SMELLS GREAT by giving off a very pleasant fresh orange citrus scent that fills up your entire home. No synthetic dyes or fragrances are used in our product, ALL of the cleaning and deodorizing properties come directly from the peels of oranges.",
      "LITERALLY THOUSANDS OF USES! Orange oil cleaners are extremely versatile and can practically be used on ANY surface to clean or remove virtually any soils. Some of the many surfaces include: Metal, Glass, Marble, Granite, Porcelain, Tile, Brick, Concrete, Stucco, Rubber, Plastic, PVC, Stainless Steel, Chrome, Bronze, Brass, Carpets, Drapes, Clothing, Wood, Finished Wood, Sheetrock, Painted Surfaces, Mirrors, Leather, Vinyl & More!",
      "WE ARE HAPPY TO SHARE OUR FORMULA! THE ONLY INGREDIENTS ARE Cold Pressed ORANGE OIL & Coconut Derived Surfactant. THAT'S ALL! You can replace all those potentially toxic cleaning products with this Orange Oil cleaner.",
      "EXTREMELY POWERFUL DEGREASING & CLEANING due to the natural solvent. This product will remove all types of Dirt, Grease, Oil, Food, Odors, Ink, Glue, Crayon, Soap Scum & much more! Non streaking and leaves no residue. Adjust strength as needed depending on the task at hand. 30 DAY HASSLE FREE MONEY BACK GUARANTEE – We value our customers and we stand behind ALL of our products 100% with no questions asked! If you are not pleased simply call or email us with your order number for a full refund!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 3 x 8 inches; 1.6 Pounds",
      "Item model number": "CPOO-32oz",
      "Date First Available": "August 17, 2015",
      "Manufacturer": "EcoClean Solutions Inc",
      "ASIN": "B071JGCQ2W",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Health & Household",
      "All-Purpose Cleaners",
      "Health, Household & Baby Care",
      "Household Cleaning"
    ],
    "price": 24.99
  }
}