{
  "website_summaries": [
    {
      "verdict": "This 544-piece set features Lloyd's Mech Dragon as seen in the LEGO Ninjago movie. It's heavily articulated and ready for battle.",
      "pros": [
        "Includes pieces to build Mech Dragon",
        "Assembled dragon has minifigure cockpit, snapping jaws, posable body, wheel-activated spiked tail and leg-mounted stud shooters",
        "Comes with 4 minifigures: Lloyd, Master Wu, Lord Garmadon and Charlie",
        "Measures 5\"H x 23\"L x 4\"W. For ages 8 to 14"
      ],
      "cons": [
        "Some sets have arrived with pieces missing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "it looks really awesome and the build is great fun and the minifigure ...",
      "text": "This set is really phenomenal with one flaw I was expecting, it's not very posable. The tail is free swinging, the middle body joint is restricted to stay in a straight position, and the neck/head each only have on axis of motion. That being said, it looks really awesome and the build is great fun and the minifigure selection is fantastic if you're a Ninjago Movie fan not looking to buy every set. At the end of the day, it's still a dragon, and that's pretty cool.",
      "rating": 4.0,
      "verified": true,
      "author": "Penny Rose Shir",
      "helpful_votes": 13,
      "publication_date": 20180113
    },
    {
      "title": "Just Incredible!",
      "text": "First of all it is a Dragon which was enough to get me excited! Plus it is green (my favorite color!) and it's a mech (robot warrior machine that is person operated) all of which make this set amazing! It's a pretty big set too, with a full functional tail, sensei Wu, the Green ninja Lloyd, his dad Lord Garmadon, plus one of his minions.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett TTop Contributor: Architecture",
      "helpful_votes": 8,
      "publication_date": 20180501
    },
    {
      "title": "Best of all.",
      "text": "After a couple of hours my grandson had it put together and after buying hundreds of sets, and seeing the results I think this one is my all time favorite. It moves and the head seems real. I wish he wouldn't have taken it home, cause I would have it out on Sunday night, WHILE watching the \"GAME OF THRONES.\"",
      "rating": 5.0,
      "verified": true,
      "author": "CN1021",
      "helpful_votes": 7,
      "publication_date": 20171109
    },
    {
      "title": "One of the best LEGO sets of the year!",
      "text": "I purchased at a discounted price as a warehouse deal with damaged box, but all the contents were included. I love everything about this set, the build is cool, it has a lot of sand green parts, and 3 out of the 4 mini figures are above average (the shark army dude is okay). I'm not all that interested in the robot ninja vehicles or the Ninjago movie but this has a great design for a dragon. Maybe my only complaint is that it has jet engines instead of wings.",
      "rating": 5.0,
      "verified": true,
      "author": "willhx",
      "helpful_votes": 6,
      "publication_date": 20171211
    },
    {
      "title": "If you love dragons...",
      "text": "My son and I love Legos especially any type of dragon model. This Lego set does not disappoint. It took my 6 yr old son about two hours to build. Highly recommend for any Ninjago fan!",
      "rating": 5.0,
      "verified": true,
      "author": "NYMom",
      "helpful_votes": 8,
      "publication_date": 20171011
    },
    {
      "title": "Great for my 6 year old. Very happy.",
      "text": "My kid is 6, so therefore supposed to be too young for this. Nah! We both put it together. It took a long time! But it fits solidly and is an amazing lego sculpture. It came with a few extra spare bits (not sure if intentional). The only bad part is the little discs it fires are FAST and hard to find. I might glue a little ribbon on them or they will soon be lost for good.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence Jamerson",
      "helpful_votes": 4,
      "publication_date": 20171121
    },
    {
      "title": "My son absolutely loved this and felt accomplished once he put it together",
      "text": "My son absolutely loved this and felt accomplished once he put it together! It's the only Lego toy we've had that has lasted through the first week!",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia",
      "helpful_votes": 7,
      "publication_date": 20170929
    },
    {
      "title": "And I'll admit I love it, too",
      "text": "Son had been asking for this for months, and it was everything he dreamed of. And I'll admit I love it, too. Terrific design, especially the way the tail can be flicked about. Would have been cool if they'd found a way to make the middle flex up and down as well as side to side, but that's a nit pick. My Lego adept 8-year-old was able to build it without help.",
      "rating": 5.0,
      "verified": true,
      "author": "Seamomster",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "Missing pieces",
      "text": "Frustrating for my son because we were missing several pieces required to build this set. We went through his other sets and loose legos to try to find substitute pieces, but this is the first time we have encountered this many missing pieces and it was very disappointing. The set itself looks like it would be really amazing if we had all of the pieces.",
      "rating": 2.0,
      "verified": true,
      "author": "BrianDH",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "LEGOs are FUN",
      "text": "This was a gift for my 7-8 year old grandson, and he (and his older sister) loved it. I have given him several LEGO sets, and it occupies him for hours. After a while, these parts get mixed in with all his other LEGO pieces, and he is then very busy designing his own creation. These take even more time.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Thompson",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "This one is beautiful, even to me Grandma",
      "text": "This one is beautiful, even to me Grandma. Had it shipped to my 12 year old grandson for Christmas. The package, marked as a gift, arrived in a timely fashion and without any damage. The dragon looks great and bigger than I expected, probably close to 2 ft long from nose to tail. It was very much enjoyed by my grandson.",
      "rating": 5.0,
      "verified": true,
      "author": "LK",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Grandson loved it",
      "text": "I purchased this for my 5 year old grandson. It was wonderful working with him to build this. He only needed a little help. Once assembled, he spent hours playing with the dragon - and was quite proud of himself. He really didn't want to do anything else until this was finished.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Butler",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Grandson LOVED this gift!!!!",
      "text": "Got for my Grandson for Christmas. When he opened it he jumped up and shouted \"look what I got\". He ioves Lego and Ninjago so this was a favorite for him. I got a great price on this so I was elated that he loved it. I highly recommend this toy and have purchased many other Lego toys from this site and will get more for birthdays, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer827",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Engrossing and impressive",
      "text": "My son loved this. At almost 7 he spent hours building it himself on Christmas Day. It's impressive when built, too, lots of details, and some good movement to the tail and head. At under $35 I thought it was a great deal for an impressive kit without spending too much on something that may end up deconstructed into just bricks.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Bedford",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "GO LLOYD!!",
      "text": "Killer set from the Ninjago movie. LOTS of pieces (kids love that) but it's sturdy enough to actually play with. One of the few sets that has stayed in tact since we assembled it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robb Zbierski",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Uhh what?!?!",
      "text": "The kid liked it but the lore and backstory makes no sense at all. First its this particular model isnt a dragon. Its a drake. Second why are ninjas even interacting with dragons. Ninjas are stealth assassins... how stealth can you be on a flying 40 foot (to scale with the lego guy that cam3 with it) lizard that breaths fire. Also there is a wizard in the collection... which even confuses me more. Its almost lego mashed together two lores with no respect to either of them. Its almost as if they are pandering for over priced plastic connectors. But my kid loves it and doesnt seem to mind the contridictions at all... 😐",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Super impressive once built!",
      "text": "Such a cool LEGO set! So far, this is the most impressive built set by my son. He had a ton of fun building it and it’s so cool for him to play with. The tail moves back and forth, with many great details throughout the set.",
      "rating": 5.0,
      "verified": true,
      "author": "sdgal",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Four Stars",
      "text": "Just to happy to express. put it together in under 30 minutes.",
      "rating": 4.0,
      "verified": true,
      "author": "Invictus... William Ernest Henley ( 1849–1903)",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "My son assembled this right after he opened all of ...",
      "text": "My son assembled this right after he opened all of his Christmas gifts. He really enjoys playing with the dragon.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Banville",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great value, great model",
      "text": "From adult collector perspective: Great price for such a large kit. It's a very good sized dragon. One of the larger pieces I've ever built. Very intricate and interactive. Definitely want to try the other dragons after this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Lego fun!",
      "text": "My son will have lots of fun with this! Shipped right away. But when amazon shipped it, the box was squished a little bit from other items shupped together. Not the end of the world. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Bought for 6 year old grandson who loves Lego’s",
      "text": "I really can’t write much about it yet, I bought this item for my grandson for Christmas and I haven’t given it to him yet, but I really think he’ll love it since that’s what he’s asked for",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "My Son Loves it!",
      "text": "This LEGO Set is amazing! So Much nicer than in the pictures! My son sat done at the kitchen table and didnt get up till he was done putting it together. He LOVES it!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Spear",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Missing Entire Head",
      "text": "The product itself is great. My son discovered that it is missing the head after he spent 3 hours assembling it. Amazon gave a refund.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171209
    },
    {
      "title": "Dragon girl",
      "text": "This was a gift for my granddaughter who lives very far away from me and whom I rarely get to visit with. She loves dragons and had a dragon themed birthday party this year. She liked her Lego set but her mother told me that she made it a little more feminine than it originally was.",
      "rating": 5.0,
      "verified": true,
      "author": "Margie A.",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "A hit with my 6 year old grandson",
      "text": "Shopping for my 6 year old grandson's birthday was easy this year because he told me exactly what he wanted! The day he received it he was able to assemble it with some help from his dad and then he slept with it that night! He loves how big it is and the way the tail moves. A call from him confirmed a very happy little boy!",
      "rating": 5.0,
      "verified": true,
      "author": "dkp",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "really cool but took time!",
      "text": "Let me tell you this was a beast!!! It took most of Christmas day to get it together. I and my husband had to help my son who is 8 do this but this was our first large one.the directions where very good they walked you though it and explained everything. the pieces are just so small its hard to keep it all in one spot. I would not recommend doing this near any small kids or animals!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica Campbell",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "impressive dragon",
      "text": "This dragon is pretty sweet. My 7 year old loves it. ...so do I. At 23 inches long, it's pretty impressive. Sometimes I just sit and whip the tail back and forth after putting the boys to bed.",
      "rating": 5.0,
      "verified": true,
      "author": "almost anonymous",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Perfect nijago LEGO set",
      "text": "Good size dragon and great price. Our 4 and 7 year old loved building it and were really excited about all the characters that it came with.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Elaborate & everything a dragon should be",
      "text": "Loved this dragons look! I almost bought 2 but stopped short due ro supply and demand (Christmas 2017 & extremely hard to locate) gave this to my older nephew as a gift, he loved it!",
      "rating": 4.0,
      "verified": true,
      "author": "Symbols Of LoveTop Contributor: Swimming",
      "helpful_votes": 2,
      "publication_date": 20180207
    },
    {
      "title": "but the finished product was undeniably amazing.",
      "text": "My nephew FLIPPED over this early Christmas present. The articulated arms and legs, and especially the tail that whips back and forth were really impressive. I helped him build it - it was a bit advanced, even for a 9 yo, but the finished product was undeniably amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Elias",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "My Grandson loved this!",
      "text": "My grandson said it was exactly what he wanted and told me that he thought it was about $100.00! Great price, It was his birthday present!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Pretty Cool",
      "text": "Its a little pricey but is a pretty cool looking dragon, not quite as intricate as some of the other ninjago dragons. It took my 7 yr old about 4 hrs to put togeather.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Super",
      "text": "Perfect. Got this for my 16 year old son who mentioned he misses playing with legos 🙂. He put it together in a jif and has in proudly displayed in his room next to all his heavy metal posters!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Awesome",
      "text": "My son is not easily impressed with legos, he has too many, but this one is amazing. It's very flexible and just awesome. Happy boy, happy mother.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra D",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Yes!",
      "text": "My nephew loved this! It took a while for my brother to put it together but well worth the wait.",
      "rating": 5.0,
      "verified": true,
      "author": "Oralia R.",
      "helpful_votes": 2,
      "publication_date": 20180728
    },
    {
      "title": "Wonderful Ninjago Set.",
      "text": "We bought this for our grandson for Christmas and he absolutely loves it. I built it with him and it is a really nice set.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Lowery",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great product",
      "text": "I love this one of all the Lego products. Bought this one for my sister's 5 years old son. He loved it. Easy to build. I highly recommend it. Thumbs up.!",
      "rating": 5.0,
      "verified": true,
      "author": "Ranadheer Jangamgari",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Wonderful",
      "text": "Got this lego set for my grandson for Christmas. He loves legos and this is a set he really wanted. He was very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Hogan",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Amazing lego set",
      "text": "This set is really cool and very affordable for what it is. It is great for gifting. I love lego sets!",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Five Stars",
      "text": "Great building challenge for an eight-year-old. He built a fierce, mobile green dragon.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "LEGO dragon - Awesome, Being Shipped in the LEGO box - bad",
      "text": "The LEGO dragon and characters are awesome and my 5 year old grandson is having a great time playing Ninjago. It would have gotten 5 stars except the seller shipped it to me using just the LEGO box. 😕 Why they were too lazy to put it in a shipping box is beyond me. The box came damaged and of course it had the UPS labels stuck on it, so to be able to remove the shipping labels to wrap the gift from Santa, I ended up ripping a lot of the box’s cover off. I almost sent it back to the seller for this reason.",
      "rating": 4.0,
      "verified": true,
      "author": "Tricia13",
      "helpful_votes": 5,
      "publication_date": 20180108
    },
    {
      "title": "Everyone loves legos!",
      "text": "This was purchased as a Christmas present for one of the kids. Everybody loves Legos and they had a blast putting it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Miner",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Very cool set!",
      "text": "I bought this as a 6th birthday gift for my nephew and he loved it! He was able to build it by himself in just a few hours.",
      "rating": 5.0,
      "verified": true,
      "author": "april",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Awesome!",
      "text": "This is an awesome build! A little tedious at times, but my 6 year old did the majority of it on his own and only called us in for the tricky parts. Even I was proud of it when we finished. Very cool toy!",
      "rating": 5.0,
      "verified": true,
      "author": "starbound4",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "A Great Lego Build",
      "text": "My son has gone nuts building this Lego set. Legos are always a great building experience for him. Just when he thinks they might be missing a piece, he always finds it. He loves building these!",
      "rating": 5.0,
      "verified": true,
      "author": "zride96",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Right on the mark!",
      "text": "Our grandson absolutely loved his gift!! He's going to play with it each day after school!! Had a blast watching his face when he opened his gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Kb2007",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Beautiful and fun to play with for a 3.5 years old",
      "text": "This dragon is amazing and pretty sturdy. My husband built it for our 3.5 years old who adores Ninjago. Our son loves to play with it and he's pretty rough. The dragon survives with only minor damages.",
      "rating": 5.0,
      "verified": true,
      "author": "Loris",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Great gift",
      "text": "My 8 year old LOVED this and was super excited to get it. Shipped fast and kept him busy for hours!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Jones",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "This dragon is so big in length ! It rocks!",
      "text": "Son is obsessed with this! It’s so big and detailed! It’s long too! It’s tail swings back and forth and he Knocks bad guys over with it ! So fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Perfect for 7 yr old nephew",
      "text": "Bought this for my 7 year old nephew. He loved it and it was the first Xmas present he wanted to put together and play. He needed a little help with the opposite side/mirror image aspect of building both sides of the creature, but otherwise did great. It's an extremely intricate build...nothing like when I was growing up, ha!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great set!",
      "text": "Child LOVED this!!!! And it’s a great LEGO set! Lots of detail and looks cool!",
      "rating": 5.0,
      "verified": true,
      "author": "shanda",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Legos",
      "text": "I purchased these for my 9 year old grand kid. He loves them so much.",
      "rating": 5.0,
      "verified": true,
      "author": "angie",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Cool looking lego that you could hang from a ceiling.",
      "text": "Cool looking lego that you could hang from a ceiling.",
      "rating": 5.0,
      "verified": true,
      "author": "Aurores",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Kids LOVE",
      "text": "My 7 year old grandson LOVED this set! He was so proud of it he slept with it and took to school to show friends! Great buy! He wants shark next...smh",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Dee ",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "LEGO Ninjago Movie Green Ninja Mech Dragon",
      "text": "Nice and at a good price point. He really likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sodaman",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Kid loves it",
      "text": "Only took an hour or two to put together for my 7 year old. Still mostly together after 4 months. That's Never happened before",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "We love legos",
      "text": "We love legos and Ninjago. This set was fun to put together, my 8 year old was able to do most of it on his own.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "A gift my 7 year old grandson loves. He ...",
      "text": "A gift my 7 year old grandson loves. He puts it together, takes it apart then put back together.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachelle Kimberling",
      "helpful_votes": 2,
      "publication_date": 20171104
    },
    {
      "title": "Looks like fun",
      "text": "This was a birthday gift for my 11 year old great grandson.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Well made",
      "text": "My daughter loves this ninja. It’s perfect and not as delicate as it looks. Easy to put together and well priced compare to other vendors.",
      "rating": 5.0,
      "verified": true,
      "author": "camircal",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Son loved it",
      "text": "My 6 year old son loved this LEGO and it was enough of a small challenge",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Lego Lover",
      "text": "My nephew received this as a Christmas gift and loved it! Several years later he still has it on his shelf in his room.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "There Be Dragons Here.",
      "text": "I bought this set to go into my Underwater Lego City display. I thought it would be cool, with the build and the colors, in the cool hue with some of the submarines and such. It didn't disappoint. It can serve as either a sea monster or a flying dragon!",
      "rating": 5.0,
      "verified": true,
      "author": "MRN Reviews",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Great toy",
      "text": "My kids love putting these together and enjoy playing with them. They look really cool too!",
      "rating": 5.0,
      "verified": true,
      "author": "Audra Lee Doyle",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Great LEGO set",
      "text": "Bought for my 6 year old grandson. He loved it and was able to put it together all by himself even though the age was from 8-14!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda McGhee",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Box was opened",
      "text": "Received a box that was previouly opened that was bought to be a birday gift for my son. Product itself is a good, fun set.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike Puglisi",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Fun activity with kids",
      "text": "Fun build with my Son. Easy step by step instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "SHOPPING ISSUES",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Must buy!",
      "text": "Excellent, a lot of fun, and really cool Lego set",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis The Menace",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Great fun!",
      "text": "Great gift for my 7 year old. He was able to assemble on own and had lots of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Five Stars",
      "text": "Another great lego kit that children will convince you they are going to assemble themselves. Once again, they LIED.",
      "rating": 5.0,
      "verified": true,
      "author": "davebkpr",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Cool looking dragon!",
      "text": "I bought this for my grandson and thought it would take him a week to build. He made it in a couple of hours! He loves it. It’s a pretty cool looking dragon if you ask me.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara K.",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Fun challenge",
      "text": "This is probably my youngest son's favorite set. It was a bit challenging but he got it all together.",
      "rating": 5.0,
      "verified": true,
      "author": "Brii",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Happy son for Christmas",
      "text": "Was a gift for my son for Christmas he absolutely loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Fun set, great colors",
      "text": "Very cool LEGO set. My son and I had a blast building this together.",
      "rating": 5.0,
      "verified": true,
      "author": "Right Hand, LLC",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "The coolest",
      "text": "So fun to put together and it’s pure magic once it’s made.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Portnoy",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Five Stars",
      "text": "My 5 year old loves it. Moves really well and looks good",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Johnson",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Really impressive",
      "text": "This was a Christmas gift for my grandson he’s so into LEGO this was the largest one he’s. built it only took him about 3hrs . Going to have to go bigger again !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Bought for two nine year old grandsons and they love it! Kept them busy for hours and it ...",
      "text": "Bought for two nine year old grandsons and they love it! Kept them busy for hours and it has moveable parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred R Jordan",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "My nephew loved this!",
      "text": "My nephew loved this!! He was super excited to put it together! Wasn’t there for the build so I’m not sure about the build time or instructions!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Super cool dragon!",
      "text": "This is by far one of the coolest Lego sets we've seen. The dragon is awesome and all the figures that came with it. Plus we got a great deal. Legos never go on sale at stores so it's nice to be able to get them at a reasonable cost online.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Kids Loved It",
      "text": "This was a big hit with our kids. Great toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean O'Hanlon",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Pieces fall off easy",
      "text": "A little challenging for little kids but once together, great toy",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Willard",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "bought for 6 year old grandson",
      "text": "My 6-year-old grandson LOVED this! He spent two days putting it together. He was so proud of himself when he finished!",
      "rating": 5.0,
      "verified": true,
      "author": "Terri M.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Four Stars",
      "text": "My 7 yr old son received this for Christmas. He loves it!",
      "rating": 4.0,
      "verified": true,
      "author": "Mattang",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "This Product was Great!",
      "text": "I loved this product! After watching the movie, I really wanted one of the sets because I love Legos, so when I saw that this set came with the main characters, I just had to have it! I would definitely buy the other sets to go along with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Dragon for the win",
      "text": "He was thrilled. And it had alternatitive ideas to build as well",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Norman",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Very cool",
      "text": "Great quality LEGO set! Got it for an 8yo. He put it together in a day (working obsessively all day because it's so fun). Kids love this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather D",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great set!",
      "text": "Love this set! just wish the head could've had more range of motion, though. but overall i really love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 2,
      "publication_date": 20171001
    },
    {
      "title": "Five Stars",
      "text": "I bought this for my niece and she absolutely loves this!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle L. Garcia",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Great gift.",
      "text": "Grandson was beside himself with this gift. Not sure how it held up.",
      "rating": 5.0,
      "verified": true,
      "author": "EZ Top",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Five Stars",
      "text": "bday present for great grand son. He liked it and assembled it in one evening",
      "rating": 5.0,
      "verified": true,
      "author": "Perry L. Crupper",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Very nice!",
      "text": "Very cool set. My son had a blast building this dragon. There are a lot of instructions but nothing overly complicated. The end product is really cool looking and tons of fun to play with.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo smo",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Super fun build with my 5yr old!",
      "text": "Super fun build with my five-year-old! He and I really enjoyed it and got to spend great quality time together!",
      "rating": 5.0,
      "verified": true,
      "author": "MA08",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Five Stars",
      "text": "the best of all the LEGO ninjago sets from the movie",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar W Romero G",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Granddaughter loved it",
      "text": "Granddaughter loves dragons. She doesn't like the warriors and so just didn't make them. Didn't use some of the stickers either. This is a set with 500+ pieces and so it took her a little time to put it together but she is 15 and very skilled at Lego's. It was good for her to have the challenge.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne M Cook",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Kids Love It",
      "text": "Kids love it! They build it all by themselves in one sitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Hernan R",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "good toy",
      "text": "I really liked this toy for my grandson, thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Garcia",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "LEGO - good as always",
      "text": "Very nice structure - very long. My son love it!",
      "rating": 5.0,
      "verified": true,
      "author": "SYC",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great set",
      "text": "I bought this for my 7 year old son and he loved building it, and playing with it! It only took him a few hours to build, which was slightly disappointing for me, but he enjoyed it. Now he’s ready to get some of the other mechs!",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie Henson",
      "helpful_votes": 0,
      "publication_date": 20200930
    }
  ],
  "product_meta": {
    "title": "LEGO NINJAGO Movie Green Ninja Mech Dragon 70612 Ninja Toy with Dragon Figurine Building Kit (544 Pieces)",
    "description": "Kids can outwit The Green Ninja's evil father Garmadon with this mighty THE LEGO NINJAGO MOVIE mech. This green dragon features articulated snapping jaws, a fully posable body, wheel-activated swooshing tail, 2 leg-mounted stud shooters and 2 hidden pop-out thrusters. The model mech kit also includes 4 minifigures with assorted action toys, including The Green Ninja's sword and Garmadon's laser-style pointer - to offer even more role-play possibilities with these battle toys.",
    "rating": 4.8,
    "feature_bullets": [
      "Kids can build their own mech with this Green Dragon in this action-packed Ninjago set. This dragon toy features a minifigure cockpit, articulated snapping jaws, posable body, wheel-activated swooshing tail with spikes, and two leg-mounted stud shooters!",
      "This mech model kit includes 4 minifigures, Ninjago Lloyd, Master Wu, Lord Garmadon and Charlie. Kids will spend hours role playing with their favorite Ninjago figures.",
      "This LEGO NINJAGO brick building kit is also compatible with all other LEGO construction sets for endless pretend play",
      "Featured in THE LEGO NINJAGO MOVIE, this Ninjago mech lets kids play with their favorite Ninjago figures and recreate some of their favorite moments alongside this dragon toy",
      "The Green Ninja Mech Dragon in this dragon playset measures over 5-inch high, 23-inch long and 4-inch wide with 544 pieces. For boys and girls between the ages of 8 and 14 years old"
    ],
    "specifications": {
      "Product Dimensions": "11.1 x 2.4 x 18.9 inches",
      "Item Weight": "1.56 pounds",
      "ASIN": "B071LB2K8D",
      "Item model number": "6136340",
      "Manufacturer recommended age": "8 - 14 years",
      "Best Sellers Rank": "#27,984 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars945 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "August 1, 2017",
      "Mfg Recommended age": "8 - 14 years",
      "Manufacturer": "LEGO"
    },
    "categories": [
      "Building Sets",
      "Toys & Games",
      "Building Toys"
    ],
    "price": 97.77
  }
}