{
  "website_summaries": [
    {
      "verdict": "This scaled-down version of a popular set-up is great alternative and can easily be expanded later, if necessary.",
      "pros": [
        "Excellent quality, right down to the last detail",
        "Boasts a lengthy sisal scratch post for climbing and clawing",
        "Multiple levels with 4 hammocks and an escape hatch is ideal for playing, lounging, and sleeping",
        "Generous size is suitable for multiple cats",
        "Canvas hammocks are removable for washing"
      ],
      "cons": [
        "Some owners felt the included screws were too weak",
        "Requires a handful of tools for installation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Craftsmanship is as good as everyone else says",
      "text": "Day one they're still a little timid, but all four cats have been on it. Ollie can be seen sleeping on it here. Craftsmanship is as good as everyone else says. Yes, it's a little pricey, I hope their sales go up enough that they can lower the price someday.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley P",
      "helpful_votes": 9,
      "publication_date": 20180410
    },
    {
      "title": "Great craftsmanship. Cat loves it.",
      "text": "At first I thought it was going to be difficult to install. I recommend looking at their website for additional helpful tips on the configuration based on stud spacing etc. It turned out to be a lot easier to install and they include all of the necessary screws and even the drill bit. In short it looks great and our cat loves it! Great craftsmanship. I will be expanding with their other configurations soon.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gibson",
      "helpful_votes": 3,
      "publication_date": 20171123
    },
    {
      "title": "great cat tree",
      "text": "it was easy to set up and it looks amazing but we did have an issue with one of the screws beings stripped and we could fully put one of the pieces together but we made do with what we had and worked around it.",
      "rating": 4.0,
      "verified": true,
      "author": "brandon ",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Great Quality Product!",
      "text": "We just finished putting up our cat Mod Climb Track. Our little Zuzu immediately jumped up the ramp and made her way straight to the top! She loves it. Installation was pretty fast and easy. We had to be a little creative with some odd stud spacing, but managed to get at least one side of most pieces into a stud. I recommend this for anyone with a cat who likes height, and an owner who hates having to sweep around cat trees on the floor! The workmanship and quality on the pieces are great. Nice solid wood with sturdy canvas.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha T Compton",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Great!!",
      "text": "We ended up going with the original layout for mounting it, as coming up with our own layout with this particular model proved tricky with our space; but once we decided on the layout, it was as easy as mounting a cat tree could be. Very well made, sturdy, and the cats love it. Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Marina",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "My Cats are Officially Spoiled!",
      "text": "Tbh, we were hesitant on purchashing such an expensive item from Amazon, but did so anyway for the kitties. When the product arrived, I was more excited then the cats to put it up. My fiance installed it and says it \"was easy to build, thanks to our power drill\". The cats took to it quickly and seem to be enjoying themselves! Would definitely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Juvina",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Too many issues for the price",
      "text": "Biggest problem.. even when properly installed, the cloth is not tight enough. The cat fell right off the top height because the cloth walkway has no stability near the edges.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Lefebvre",
      "helpful_votes": 2,
      "publication_date": 20190508
    },
    {
      "title": "Get this for your cat!!",
      "text": "This is SO difficult to install, and 100% worth it!!! I had stud problems, and my carpenter-by-trade Dad had to do the project for me. It took hours and hours..... and was completely worth it with the enjoyment and exercise that Walter gets on his new favorite contraption every single day. I want to add more pieces to it soon!",
      "rating": 5.0,
      "verified": true,
      "author": "LD",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Well made and cats love it!",
      "text": "Great product with easy instructions for installation. Cats love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Very Nice looking.  Quality product.",
      "text": "Solid, beautiful piece of cat furniture. Cats took to it immediately. Took a little time to mount, but was not overly complicated. Really pleased with this purchase and company!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee H. Youngs",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "My cats love this!",
      "text": "The wood is beautiful, the canvas is sturdy, and it looks elegant in the home, not cheap or tacky.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Five Stars",
      "text": "Very good quality, will def buy more products from them for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Logan C",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "highly recommend!",
      "text": "WOW! Our cats love these shelves. They are so beautifully designed, and the customer service we had was amazing. Thank you!",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "It's ok but",
      "text": "It's OK. Cats like anything they can climb on although they don't like the ladder thingie. If you have a nice home do you really want to drill holes in your wall? And if you don't have a nice home, your beams might not even built up to code and you could miss the beam and turn into a big headache. The screws included are weak. It wasn't 100% dry so the canvas got some stain on it. Anybody know how to get stain out of the canvas? I contact customer service and they offered nothing except they wanted a photo for their records. Not impressed.",
      "rating": 3.0,
      "verified": false,
      "author": "Aliasa",
      "helpful_votes": 0,
      "publication_date": 20180706
    }
  ],
  "product_meta": {
    "title": "CatastrophiCreations Cat Mod Climb Track Handcrafted Wall Mounted Cat Tree Shelves, English Chestnut/Natural, One Size (528375911ENNAT)",
    "description": "The Climb Track is the perfect full setup. Our cats love the Vertical Sisal Pole, but we always had to set up our walls to give them a route down once they got up to the top. For the Climb Track, we combined a 4′ Vertical Sisal Pole with some of our other pieces so that the route down is built into the complex. This set is a great option for homes with multiple cats or one spoiled cat! Having sisal pieces around our home has completely stopped our cats from scratching the furniture. For the layout shown it uses four studs spaced out at 16 apart center-to-center. This complex comes with a 4-foot tall vertical sisal pole, with fabric attachment mounts on the left. The Cat Mod Climb Track comes in your choice of Unfinished, English Chestnut, or Onyx wood. All sets will come with the canvas color of your choice (second option upon choosing the item) and Nickel mounting hardware. We use solid wood for the shelving and mounting posts, and thick heavy-weight canvas for the hammocks. All of the brackets come attached for easy installation: 124 Canvas fabric4' Vertical sisal-lined pole18 Sisal-lined escape hatch5 Mounting planks Would you like to add a Feeding Station or fun Escape Hatch onto your wall-mounted setup? Check out our Cat Mod Add-ons. Standard Dimensions: Total Width: 56 Total Height: 52. 5 Depth: 11- About The Cat Mod We're excited to introduce the Cat Mod, the second generation of our fabric cat complexes. When creating the Cat Mod, we made sure to maintain all the positive aspects of our original collection of cat hammocks and complexes, such as strength, appearance, and quality, while also adding some new and exciting features that elevate it from the original collection. This system allows you to remove the fabric from the structure without having to take down any of the mounted planks from your wall. Not only will this make cleaning a breeze, but it will allow you to continue to build the structure at your leisure. This gives you the option of switching out canvas fabric colors down the road.",
    "rating": 4.4,
    "feature_bullets": [
      "Hand-crafted beautiful, large, and sleek design",
      "Perfect play structure to bring out the acrobat in your cat",
      "A great way to correct furniture-scratching behavior",
      "Fabric can be easily removed for washing",
      "Gives cats an outlet for their climbing needs",
      "Age Range Description: All Stages"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "56 x 11 x 69 inches; 22 Pounds",
      "Item model number": "528375911ENNAT",
      "Date First Available": "May 4, 2017",
      "Manufacturer": "Catastrophic Creations LLC",
      "ASIN": "B0711DDCBW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Activity Trees",
      "Cat Trees & Condos",
      "Pet Supplies",
      "Beds & Furniture",
      "Cats"
    ],
    "price": ""
  }
}