{
  "website_summaries": [
    {
      "verdict": "This manual egg beater employs two rotating beaters to mix your ingredients twice as fast as a traditional whisk.",
      "pros": [
        "Dishwasher-safe",
        "Five-year warranty",
        "Ergonomic handle with a non-slip grip",
        "Support arm enables beaters to spin freely while it rests on the bottom of the bowl",
        "Smooth rotating action",
        "Mixes products more quickly than a traditional whisk"
      ],
      "cons": [
        "It doesn't work as well in very thick batters and it may take a little more effort to turn"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Seems to whip fine but it’s Not for Senior citizens",
      "text": "Updating our initial review. After struggling with this 3 or 4 times we’ve decided that it’s not for us. Too hard to hold and too hard to turn. Probably fine for the younger generation but we’re going back to our old mixer. It’s not very easy to hold and it’s hard to take apart for cleaning.",
      "rating": 1.0,
      "verified": true,
      "author": "Jack98110",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Not heavy duty enough to beat eggs if you have more than 3 or 4",
      "text": "I was replacing an age-old egg-beater of which the casting had finally given out on the handle. Probably 40 years old used weekly at a minimum. This device, while seemingly really efficient, does not seem to have internals which are going to hold up. When I try to beat a dozen eggs or so, I can hear and feel slippage in the internal gears, The viscosity seems to overwhelm the beater. Chose this one on reviews, and the fact that all the beaters of similar design to my old one have horrible reviews. Can't anyone make a decent egg beater any more?",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Nebergall",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "This is for light stuff like eggs only.",
      "text": "Tried to make mushed potatoes with this mixer, it started skidding gears. And I have mushed potatoes before using this mixer, just wanted to make it more creamy. So for 20 buck I'd rather buy multipurpose electrical mixer. BTW this mechanical mixer is kinda noisy also.",
      "rating": 2.0,
      "verified": true,
      "author": "Serg",
      "helpful_votes": 2,
      "publication_date": 20180721
    },
    {
      "title": "Will not purchase item again.",
      "text": "The item worked well for 7 months, but today, 12/2/2019, one of the beater supports detached from the base and the item is no longer useable. There appears to be no way to successfully repair it. Unfortunately, the item is beyond Amazon's time limit for return, although there is a 5-year guarantee in the description of the item. I will not buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "PGNC",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Works okay but a little difficult to remove parts to clean",
      "text": "This is okay but I found it hard to take apart to clean and a little to hard to whisk with.",
      "rating": 3.0,
      "verified": true,
      "author": "lily42",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Good but not great",
      "text": "I like the ease of cleaning it and it's ergonomically designed. The plastic body feels a little too brittle for the torque that it will be under. For light-duty mixing it's great but once a few chocolate chips go in, it's a workout that I'm not sure the whisk can handle. Redesign the body to be more robust and it's a winner.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Good Quality Egg Beater",
      "text": "This is a great egg beater. The action is smooth and everything is sealed so it's much easier to keep clean than my last one. This is a definite keeper!",
      "rating": 5.0,
      "verified": true,
      "author": "Madeline",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Easy to use, easy to clean",
      "text": "this whisk is really easy to hold and use. The blades and the protector pop right out for easy cleaning in the dishwasher. I'm not sure how I would clean the gears if any food ever got up in there, though. The only thing I would say is that this is probably not for super heavy duty use. I use it for things like eggs or blending fruit into yogurt. for something heavier like cake batter, you probably will want to use an electric mixer.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Askov",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Does what it is supposed to do",
      "text": "Does what it is supposed to do but I wish I could find one of the old style with the flat wire on the bottom rather than the round wire this one has.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great looking....",
      "text": "Liked the slim line. Yet found it a wobbly hold at best! Preferred the angled old fashioned grip. The slim line also hides what might lurk inside after a trip to the dishwasher!",
      "rating": 3.0,
      "verified": true,
      "author": "OmaHLZ",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Seems To Be Well Made",
      "text": "Larger than you might think. Seems to be a quality product, I've only used it twice so far. I like the bar across the bottom that keeps the \"beaters\" off the bowl. Happy so far",
      "rating": 4.0,
      "verified": true,
      "author": "Bob H.",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Made well and works fine",
      "text": "I don't like having to take it apart to clean and wish it could be clamped onto the side of a bowl when I got to get an ingredient to add to a mixture but I'm very glad I have it.",
      "rating": 4.0,
      "verified": true,
      "author": "regina hageman",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "EASY TO USE AND CLEAN",
      "text": "I like the simplicity and quickness for whipping up a great omelet.",
      "rating": 5.0,
      "verified": true,
      "author": "Stevan Andersen",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "ZYLISS Quick Whisk Double Rotation Kitchen Hand Whisk - Stainless Steel",
      "text": "i got this whisk specifically to use for scrambled eggs and omelettes. it is FABULOUS for beating eggs - especially for making a light, fluffy, no-yolk omelette. i have NOT tried using it for anything other than.... eggs. it's easy to use - light weight yet sturdy. it's easy to clean - just pop out the beaters and center bar and stick them into the silverware rack in the dishwasher. hand wash the body. it's easy to hang up - turn upside down and hang by center bar on a hook on my pan rack. i love being able to just grab this and make some eggs - no hassle. very pleased.",
      "rating": 5.0,
      "verified": false,
      "author": "kre8iv1",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Love these for my scrambled eggs!",
      "text": "This whisk works perfectly for my morning, scrambled eggs. I am able to whip the perfect amount of air into my eggs, without having to dig out my electric beaters. The beaters on this whisk easily remove, so that you can wash them. This works perfectly for gravy as well. I like the guard that is located below the beaters. This allows you to rest them in a bowl, and turn the knob, without having them slip all over the bowl. I am impressed!",
      "rating": 5.0,
      "verified": false,
      "author": "Summer Girl",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Quality made mixing option.",
      "text": "This came in handy for quick whisks. Sometimes I don't want to get out the electric hand mixer so this is really good for small jobs, like for my pancake mixes. The only thing that bothers me about this is the beaters can get stuck together. Other than that I found this useful, plus, the ergonomic design makes it feel good in your hand.",
      "rating": 4.0,
      "verified": false,
      "author": "Mick McArt",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Old fashioned beater",
      "text": "For those of us that remember beaters you hand rotated this has a modern turn in an upright handle. It beats more thoroughly than a hand whisk and quicker. It also brings back memories as I have my grandson try it when we are cooking, explaining this is how it was before everyone had electric mixers, but at least the beaters are dishwasher safe. However it is very difficult use on thick batters, the beaters themselves are of thinner composition than most electric mixers.",
      "rating": 4.0,
      "verified": false,
      "author": "wogan",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Very Little Effort",
      "text": "I had one of these when I was a kid and used to help my om cook and I always liked how well it mixed for me. I like this one even better than the one I used to have. It takes very little effort and it whisks much better than just a hand whisk. With both mixers turning with strength, you food gets mixed more quickly and without stressing your hand. I like the length on these and they it's not to wide. It's just easy to use and works well.",
      "rating": 5.0,
      "verified": false,
      "author": "RETSmile",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Excellent",
      "text": "This quick whisk is a great compromise between traditional whisks and hand mixers, which have always frustrated me by not having a low enough setting for spray-prone foods. It's comfortable to use and can be used at slow or pretty high speeds. This is a great addition to any kitchen and will, in some cases, even replace my stand mixer for small tasks I couldn't do without it before.",
      "rating": 5.0,
      "verified": false,
      "author": "eaAK",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "It's a manual egg beater",
      "text": "This manual egg beater, for that is what it is, is OK, but I still prefer my balloon whisk for beating eggs. I can get more air into my egg whites , increasing their volume, by the old fashioned method. And, for regular beating, I prefer plugging in my electric Braun as it's faster.",
      "rating": 4.0,
      "verified": false,
      "author": "asiana",
      "helpful_votes": 0,
      "publication_date": 20171024
    }
  ],
  "product_meta": {
    "title": "ZYLISS Quick Whisk - Removable Double Rotation Kitchen Hand Whisk, White",
    "description": "The Zyliss quick whisk is designed with unique double rotating stainless steel beaters, that rotate simultaneously around two axes to whisk twice as fast. The ergonomic handle and contours of the handle fit perfectly in the palm and the textured soft grip provides controlled handling, even when hands are wet. The quick whisk provides support and balance when whisking, especially when undertaking more difficult tasks such as blending batter. When you're finished the whisks and support bar easily come apart and are dishwasher safe for quick clean up. Focusing on functionality, design, cleanliness and safety, Zyliss has relied upon a heritage of excellence that began in Switzerland over 60 years ago. Building on this time-held tradition, the company has advanced to produce and distribute kitchen equipment that is world-renowned. Zyliss has pioneered the design of more than 200 kitchen essentials, with quality and engineering that cannot be duplicated.",
    "rating": 3.6,
    "feature_bullets": [
      "Double rotating beaters whip cream twice as fast as competing products",
      "Support arm on bottom rests in bowl allowing beaters to spin freely",
      "Ergonomic handle is soft to the touch and eases hand pressure",
      "Beaters easily remove for quick cleaning",
      "Dishwasher safe - 5 year Guarantee"
    ],
    "specifications": {
      "Product Dimensions": "3.35 x 4.57 x 13.39 inches",
      "Item Weight": "9.6 ounces",
      "Manufacturer": "ZYLISS",
      "ASIN": "B071RLXD52",
      "Item model number": "E970042U",
      "Customer Reviews": "3.6 out of 5 stars42 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#259,225 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 2, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Whisks",
      "Kitchen Utensils & Gadgets",
      "Kitchen & Dining",
      "Cooking Utensils"
    ],
    "price": ""
  }
}