{
  "website_summaries": [
    {
      "verdict": "Ordering the perfect size is a gamble with this lighter-weight waist trainer.",
      "pros": [
        "Shapely, with a smooth exterior that camouflages well under most clothing",
        "Slight stretch in the fabric makes it okay to wear most of the day",
        "Responsive customer service"
      ],
      "cons": [
        "Chart sizing may not be accurate as many users order the wrong size",
        "Fabric has too much “give” for some users and doesn’t offer the stiffness of other waist cinchers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect!",
      "text": "Love this. Bought this after a surgery because I had to wear a binder type compression garment and my daughter loved it so, I bought a second one. It's comfortable and very well made. I am 5'7\", 150lbs, athletic build and the large fit perfect. I started on the 1st clip and now I can wear it on the 3rd and tightest clip. These are before and after shots. Also, this waist trainer is comfortable and I had to wear it 24/7 for 6 weeks and then 12/7 for another 12 weeks. Sleeping in it was fine but sometimes too hot so I would shed it if it became to hot",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie L.",
      "helpful_votes": 189,
      "publication_date": 20180509
    },
    {
      "title": "Very soft and well made!",
      "text": "This product is made very well, easy and quick to put on. It is extremely soft and stretchy.. also really comfortable to wear. However, it seems to run a little big... other than that its a great waist trainer!",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 108,
      "publication_date": 20180123
    },
    {
      "title": "Size is too big",
      "text": "I ordered a large as that is the size I am currently in yet it was not tight enough. Should have ordered one size down as they run big. Great product other than that. Love the feel and didnt bunch up in the back like other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "mzstewie",
      "helpful_votes": 102,
      "publication_date": 20180208
    },
    {
      "title": "Love it. Perfect for gym.",
      "text": "I ordered a large based on the size chart and it fits prefect. It stretches really well which makes it perfect for the Gym. I do wish I had ordered a medium just because this one will be too large I hope in a month or so will be ordering. It’s definitely the perfect waist trainer if you’re wanting to where one to the Gym. Also I like the hook at the top. Helps it zip up",
      "rating": 5.0,
      "verified": true,
      "author": "countrygrlsheila",
      "helpful_votes": 57,
      "publication_date": 20180828
    },
    {
      "title": "Great customer service!!",
      "text": "I bought a size small and it fit very tight and was extremely uncomfortable to wear because of this. I decided to return it and someone from the company reached out to me asking what my waist size was and that they would ship me a new one without me having to return the old one. Extremely helpful and quick customer service. I can't wait for my new trainer!! Definitely make sure you measure your waist before buying!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriela",
      "helpful_votes": 58,
      "publication_date": 20180424
    },
    {
      "title": "Good Quality",
      "text": "Didn't know what to expect in quality but this is a pretty decent well made trainer the material seems very durable. I ordered a med based on reviews and glad I did as I have the hooks on the very last 3rd row(meaning on the row to make it tighter) if I would have used the 2nd or 1st row of hooks I believe it would be to loose) that being said a Sm would have sufficed but probably on the 1st & 2nd rows to fit comfortably. I plan on using everyday as much as possible with a lite workout and just everyday wear, hoping to see results. For reference I'm 5'5 165 waist 31/32",
      "rating": 5.0,
      "verified": true,
      "author": "TaJee4U",
      "helpful_votes": 54,
      "publication_date": 20180513
    },
    {
      "title": "Best quality",
      "text": "Ima Sceptic due to purchasing multiple waist trainers. I’ve somehow accumulated over 5 from other companies. I recently had a spinal fusion. And need a lil support while training my back so i ordered hoping it’d be the last time!! And this product is the very last one i will buy!! ITS FANTASTIC. it’s long which is what i needed. It’s sturdy. And the fabric quality is suberb. Customer service is the bomb! I ordered a size too big and contacted the seller direct and they were back in touch with me instantaneously and resolved the miscalculation on my part and with no headaches involved. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "NaFromDaBay",
      "helpful_votes": 49,
      "publication_date": 20190109
    },
    {
      "title": "Pretty comfortable, stays in place well, but bulges some",
      "text": "Pros: I like it better than the Velcro trainers I’ve tried. The thee rows of snaps are great so I can adjust it tight enough. The height of it works well too and it stays in place better than I expected. It is relatively comfortable and not visible under most of my clothing if I am standing up. Cons: I wish the extra piece that zips up wasn’t there. This extra layer bulges the second I sit down or lean forward so it looks like I have weird bumps. I wear the trainer all day long every day because I use it to help with a small belly button hernia, so I wish it didn’t bulge so badly.",
      "rating": 4.0,
      "verified": true,
      "author": "Myka Lauren",
      "helpful_votes": 3,
      "publication_date": 20181118
    },
    {
      "title": "Smooths the belly, hurts the back.",
      "text": "I wanted this due to postpartum belly. I ordered the size using the guide and it fits as expected. The front of it works very well. It helped my swollen belly fit into my post baby pants and was very smooth. The back ribbing, however, bends and makes wrinkles. My back has almost no fat on it so that’s possibly the problem. It makes it so uncomfortable I can not wear it. If the back did not wrinkle and dig in I would rate it five stars because it gets the job done.",
      "rating": 3.0,
      "verified": true,
      "author": "E.Smith",
      "helpful_votes": 3,
      "publication_date": 20190427
    },
    {
      "title": "Not as advertised.",
      "text": "The 1st 1 I purchased a size small didn't clip at all. So I returns it. Re ordered a Large. It fits. But it does not help give curves. (My Measurements 48/32/46 Bust, waist, hips) It makes my curves look kinda boxy and it slides down in the top and up on the bottom so much it's so annoying I can't wear it. I needed something to help compress my stomach during the healing process after part of my colon was removed from cancer but this doesn't help.",
      "rating": 2.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 2,
      "publication_date": 20181005
    },
    {
      "title": "It’s Decent",
      "text": "The waist trainer I received feel nice on the skin however it rises a lot in the back area and I find myself having to pull it down quite a bit. I really wanted something that stays put and help me during my weight lost journey but I’m going to give this a week before I decide if I’m going to returning or not. Also don’t fall for the “FREE GIFT” circular!!! I sent the email and still no response. The reason for the three stars. Even though I find the waist trainer comfortable I probably won’t purchase again because I have no faith in their customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Must buy!",
      "text": "After spending months trying to find the perfect waist trainer, I finally found one that’s Amazing and doesn’t show under the clothes. I purchased a size XL. I’m still trying to get rid of baby fat from having my son last year but this is amazing at making you sweat and shaping. The fabric is soft and comfortable. I would suggest purchasing the size that you wear in clothes. It’s also long enough to cover long bodies. It is not short like other waist trainers that make your fat bulge out from underneath or above. I will be purchasing another one as soon as I’m down a size.",
      "rating": 5.0,
      "verified": true,
      "author": "Alaya Rose",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Quality product, I love but order one size down",
      "text": "Seems like a good quality product but consumers must order one size down.",
      "rating": 5.0,
      "verified": true,
      "author": "LaDonna Thomas",
      "helpful_votes": 6,
      "publication_date": 20180122
    },
    {
      "title": "Great Shaper at a Great Price",
      "text": "I've started using the shapers that zip up over the hooks, it gives a better silhouette. Be sure to check the size chart and don't just order what you usually do. But if you use the size chart you will get the correct size. I like the zipper over the hooks and the little hook at the top of the zipper to ensure that it stays zipped. It is very slimming and yet still comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Superstefmom",
      "helpful_votes": 3,
      "publication_date": 20190403
    },
    {
      "title": "Very long, but otherwise perfect.",
      "text": "It's a bit bigger than expected, quite long so it requires some extra adjusting for those of is with shorter torsos. I tuck mine in under my bra and pull it all the way down and it just about reaches my butt. Don't let that scare you off though!! I'm five feet tall and my height is all legs. This is definitely one of the greatest waist trainers I have ever tried, and the zipper helps create a smooth effect for tighter clothing. If you're in between sizes, I recommend ordering a size down.",
      "rating": 4.0,
      "verified": true,
      "author": "Sammie1125",
      "helpful_votes": 3,
      "publication_date": 20180504
    },
    {
      "title": "These are the most comfortable waist trainers I've tried so far",
      "text": "These are the most comfortable waist trainers I've tried so far... I have gone from L to M.. they run a bit larger, so don't be afraid to go a size smaller than you think you are. remember, you are getting smaller. Washes great, I hang wet. I'm 5'6 and 170 lbs... Hope this helps! customer service answers very quickly. Can't go wrong on this trainer, my only complaint? I wish it came in white :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy BS",
      "helpful_votes": 3,
      "publication_date": 20180720
    },
    {
      "title": "My was pretty loose. However a sweat band would work",
      "text": "So this is a swear band with uncomfortable corset bones. They pinch and are all in the back, which is weird. It should be in the front. I’ve only wore this once. If you order this, get it smaller than your size. My was pretty loose. However, a sweat band would work better. Update: I heard back from the manufacturer shortly after I posted my review, which was a pleasant surprise. I'm updating my rating, for customer service and they fact that they reached out to make things right is amazin.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Great material and great fitting",
      "text": "This trainer fits great I am very pleased I got it, I lost 15 pounds and now I am 121 lbs. I was able to go from 32 inc waist to 26 inches, but still have loose skin, so I decided to buy this item to help me improve my waistline. The material is great and I really like the combination of 3 rows of hooks and then the zipper. I was able to feel the compression and workout on it. I think I can even wear under my medical scrubs all day, because it's very smooth looking, and makes the shape look natural! It came on time, according with the expected date.",
      "rating": 5.0,
      "verified": true,
      "author": "M.G. Reyna",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Nice and tiny",
      "text": "Seems to be decently made. It is too small though. I ordered an XL(I usually wear a medium to large)cause others mentioned that they run small... it was still too small. Update: seller is going to send me another one in a bigger size. Let's see if a 2xl fits an American size 10.",
      "rating": 5.0,
      "verified": true,
      "author": "DaLylia Dulyea",
      "helpful_votes": 4,
      "publication_date": 20170827
    },
    {
      "title": "Makes me look thinner",
      "text": "I have a medium sized waist and I bought the small anyway...its snug and it took a few minutes to squeeze into yet its comfortable....and it definitely took inches off my waist. My husband noticed, and I didn't tell him I'd bought it. He wants one for himself...I have to see if they make the product for men. I first tried wearing it for an hour, thinking I would just gradually get used to it, and ended up wearing it for several hours. I think I eat less in it, maybe it reminds me to be mindful with my eating. I'm really happy I bought mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Wiesenthal",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Oooooh who this in my mirror, haha",
      "text": "I read some of the reviews about ordering a size smaller for the hooks. I wear an XXL shirt comfortably. I am 229, 6’ tall. It took me a good 10 mins to zip it by myself lol. It really does cover the lower back bra bulge. Thank ye Jesus! I also have a long torso, so for it to cover under the front of my bra, lower back bra bulge, AND come down and teach my hip bones is amazing. I notice the change in my walk so it could be great for slouchers. I’d personally just go ahead put on these suckers in your amazon cart.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great Product",
      "text": "I’m 6 weeks postpartum, so stomach support is super important to me during my fitness journey back to my pre-babies body. This waist trainer has a double layer, one to hook closed and the outer to zip up to ensure support. I have bought many waist trainers from cheap to expensive, but this one by far is one of my favorites. It DOES NOT roll up, which is huge pointer for me. Keeps me feeling secure and cinched all day. Very comfortable, true to size, and great support during my workout. Communication with seller was great and delivery was fast! I would definitely recommend! Five Stars!!",
      "rating": 5.0,
      "verified": true,
      "author": "shayna",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Way more than a simple waist trainer! Love love love!",
      "text": "I love this! The corset gives you so much support while the zip up sleeves keeps it from rolling or showing. It’s awesome underneath tops that show any belly pouch or love handles. Definitely can be worn for more than working out. It’s so smooth it’s more similar to wearing (in a good way) than any other trainer I’ve worn. The length is perfect on me- as I’m very tall and have a large torso. I’m going to be wearing this a lot. For working out and looking better in certain clothes . Love it 5 stars? Definitely 😍",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin Foley",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "True to size",
      "text": "Because some reviews said this item runs big i ordered an extra small when I would normally order a small. It was just a bit too snug and hard to zip which means it is true to size. I am now looking for a small (my original size) which I think will fit perfectly. Well made product based on what i received but because I haven't had time to wear it yet , i am reserving my 5 star review.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Ash",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Perfect!",
      "text": "Absolutely love it! It fits perfectly, the size chart is spot on! It’s very comfortable, it sucks in my mom tummy and you can certainly tell a difference! I’ve worn it all day and it hasn’t slid down or rode up once. I tried a few outfits on over it (Tank top, a dress and a few blouses) and I can’t see the outline through any of them. There is a hook at the top of the zipper to make sure it doesn’t unzip. Money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "kayla",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Great choice",
      "text": "I love this trainer it fits well with comfortable material!",
      "rating": 5.0,
      "verified": true,
      "author": "latoya donar",
      "helpful_votes": 10,
      "publication_date": 20180102
    },
    {
      "title": "Sizing is off",
      "text": "I read previous reviews where others noted that the size they purchased was too big. I ordered a size down from what I measured at. Still too big even on the last hook. Its not snug at all. Also the material is very stretchy which adds to sizing issues. If it was the right size, I'd give it a better rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Kesha J",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "High Quality Waist Clincher/Well Made...",
      "text": "Great company to work with. I received my waist trainer very quickly. I couldn't wait to receive it. The quality is great and made well with the extra support of the zipper. I ordered the incorrect size, thinking I was ordering according to my size, but it was too loose with no compression even after I fastened to the last row of fasteners & zipped it up. I contacted the seller and they offered to replace item with no fuss. They were very accommodating and addressed my issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Jofoto",
      "helpful_votes": 3,
      "publication_date": 20171122
    },
    {
      "title": "Quality and Customer satisfaction",
      "text": "I ordered a waist trainer from Ursexyly, when it arrived the quality is very flexible nylon fabric (non latex) with boning. Nicely made, soft and comfortable. My measurement for my waist fell at 40 but the 3XL ran quite large. I would recommend going at least down one size. This item takes about 12 days to get to you, so if you’re in a fitness regimen and are seeing results, I’d recommend going down 2 sizes. I followed up with brand to qualify for a return, the brand offered to send me another size to make me happy. As of now I’m looking forward to an L/XL. I will happily post a photo should it fit accordingly.",
      "rating": 4.0,
      "verified": true,
      "author": "LNJM",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "The realest, no sugar coding",
      "text": "Shipped in two days because I have amazon prime. I ordered a XL I am 5’8 around 215 pounds. I thought I ordered it to “big” but no it actually came smaller than what I expected. Thank god I’ve lost a couple of pounds because If not it would’ve been a waste of money. The good thing is, it fits good. Makes me look really slim, can’t really see through clothes. Ill say whatever size you are get a size bigger",
      "rating": 5.0,
      "verified": true,
      "author": "India",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Good quality!",
      "text": "I love that this was easy enough to put on. I think it runs a little bit large though because I was suggested to buy a 3X but I bought an XL based on reviews that I read. The XL is perfect. It's a nice tight squeeze but it's not uncomfortable and I can still adjust it down as my belly goes down. The material is not too thick and not too thin. Kinda has that neoprene feel but it's not neoprene. It's thinner than neoprene. It's flexible and it feels pretty sturdy. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "J. A.",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "I love this trainer - Will be getting more!",
      "text": "I love this! I own many of these sort of belts now, this by far is the best constructed one of the bunch. It seems to run a tad on the larger side so you may want to look one size smaller ( in my case anyway) I wear these daily now for both back support and a reminder to sit up and stop slouching,",
      "rating": 5.0,
      "verified": true,
      "author": "420_in_MA",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Size 12",
      "text": "I'm a full size 12 and i purchased a M and I got great but ill need a S very soon. Super comfortable im use to breaking the metal ribs but this one doesn't have metal on the sides! I recomend this. If you between a size 10-12 go for a small. I think I could have sqeezed in a small. Is your a 12-16 go the the M. I hope this helps! When i looked at reviews i almost got the L and im glad i didn't!",
      "rating": 4.0,
      "verified": true,
      "author": "Alley & Jay",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Decent quality for the price",
      "text": "I bought this to help act as a supplement for a compression garment that would be less obvious and more comfortable. While it's not as tight as I would have liked it offers support and control without the awful rippling from other waist trainers. I'm able to move and bend normally and wear it with clothing without issues. Very durable and breathable. It can't replace a compression garment or corset but will smooth your waist in a pinch.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrienne",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great shaper",
      "text": "I have a 37 inch waist. According to the size chart I should be an xxl, I read a bunch of the reviews and a common thing said was buy a size smaller. Glad I listened I bought an xl and was able to get it done up on the second hooks with some sucking in. It fits snug and there's very little spill over on the top. I am 5'9\" and I was worried about it being long enough. It does crease in the back when I sit because it doesn't cover my love handles fully. 3 days later, I'm on the third hooks already, I've been wearing it for 10 hours a day only 2 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Jones",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "In between sizes",
      "text": "I liked the material of the waist trainer. I ordered a medium and at the last hook (as pictured) it’s not really snug. I then ordered a small and at the first hook I can get it on but after about 30 minutes of wear it starts to hurts. So I only wear it to work out in for about 30minutes. I’m 5’7, 176lbs 4137 41. Im just stuck between sizes I guess.",
      "rating": 4.0,
      "verified": true,
      "author": "Ania Zapata",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "No support & size chart is way off!!",
      "text": "Unfortunately this doesn’t do the trick. I ordered 2 sizes down from the size chart since I usually wear a large I got that size since reviews said it runs large & it still bends when I sit down no holding anything in even remotely, or support or cinching going on. I also feel that a medium may be too large so am sending this back instead of going back and forth 2 more times to get the right size! It may be that the material quality is too stretchy...",
      "rating": 3.0,
      "verified": true,
      "author": "N C",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Very good for some",
      "text": "Great product for short term use, not adjustable enough to accommodate multiple reductions is body size. If you are looking to reduce your waist size by one inch, than this product will work for you. If you want to lose more than one inch, you will have to purchase more and smaller products. I love the smoothness of the product under clothing, there is truly no added bulk.",
      "rating": 3.0,
      "verified": true,
      "author": "Wanna B.",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "I think I got a defective one.",
      "text": "Looks well made, I use portion fits snug. Outside zipper won’t even reach to zip. Tag was loose in bag, so it may of been a previous return because it didn’t fit the last person either. I’d assume if I could get it clipped, that the outside zipper souls at least touch?! Clips easily at the top, but zipper can’t be zipped. I’m 5’4 117lbs and size 0 in jeans, leggings are XXS. This should’ve fit. Going to see if I can return and try another one. Will update review if I get another one.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Order a size smaller than what you usually get!",
      "text": "Size was a little too big, even after following the size chart. Their customer service is amazing. Emailed the company and they offered to send me a new one for free, and let me keep the one I already ordered! Sizes do run a little big, so get a size smaller than what you would usually get. Other than that, it's really comfortable and I can wear it all day! I've been working out with it on, and I can tell that my stomach is getting slightly flatter, but that's with the one that's too big for me. I'm sure I'd get faster results with a more fitted one!",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Best product I’ve bought on amazon",
      "text": "I thought I should buy this product because I have a dinner coming up and I wanted to look slim in my dress. The product came before I expected it, so I was very happy, only to find out it was too small. I wrote the seller for a bigger size and he was so nice, even shopping me the larger size, and letting me keep the smaller one just in case. He got back to me in less than a day, and I am completely content with their services. I love this product and I will definitely be telling other to buy this!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam ",
      "helpful_votes": 27,
      "publication_date": 20180206
    },
    {
      "title": "Size chart waist measurements are not very accurate.",
      "text": "Runs super small. Maybe it’s because I have extra flab from babies and pregnancy, but I ordered the size that corresponded with my waist size (I measured before ordering) and I couldn’t get it to even come close to closing together. I then ordered the largest size in stock and it was still a battle. When I laid the smaller one over the largest one, it literally was only about an inch or two difference. How does an XL and a 3XL have that little difference?! Guess this isn’t made for mamas who have some extra flab.",
      "rating": 3.0,
      "verified": true,
      "author": "deej788",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great customer service!",
      "text": "I was on the higher size of the size range and when I got it. I was way to small! I emailed the company right away and they were amazing and offered to send me the right size right away. The quality of the trainer itself is very good and very well made! I can’t wait to get my new one and try it out. I got it to mainly help my posture at work because I stand all day. I’ll update after I get the new one and have it for a few months",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "A very nice shapewear and helps with my stomach pains",
      "text": "My product experience was pretty good. I have really enjoyed using my shapewear that I purchased. The shapewear helps with some stomach pain issues I have and allows me to move around during the day without pains and it allows me to sleep on my side without being in pain anymore. It rides up a little bit while wearing it but that's not too frustrating. It helps me to feel better while wearing it and also helps me look slimmer in my clothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunni Robinett",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Good Product",
      "text": "I love this waist trainer. I ordered a large but probably could have done a medium but it still fits tight. I just had a baby a month ago and need this to help pull my back in. I tried it on and I truly believe this product will do the job. The material is nice and soft and for a waist trainer it's actually quite comfy. I don't believe anyone would be disappointed with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Brice",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Im a Yoga Instructor with a Belly to Hide!!",
      "text": "I love this waist trainer corset, it was a good purchase indeed. The material is soft but sturdy, stitching is well done, there were no flyaway threads to be found. While sealing myself up in this coset waist trainer there were no signs of stress in the fabric, the hooks or the zipper. I can wear my waist trainer all day, (which I do) and not have it roll up or restrict my breathing. This one is definitely a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Pretty good!",
      "text": "Out of all of the waist trainers that I have purchased, this is one of my favorites. I like that it has the clips and the zipper to give a secured fit. I am 5’2, 135 lbs ordered a small, but wish it fit a little tighter to give more of a squeeze on my waist but I still wear it because its so comfortable and still gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "THE BEAUTY BO$$",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Doesn't stay in place",
      "text": "It rides up, buckles, and doesn't stay still. It just wants to bunch up under my boobs.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie A. Meyer",
      "helpful_votes": 3,
      "publication_date": 20171220
    },
    {
      "title": "If only you wear one everyday,its o.k,too large and the zipper is with hook and eye,isnt the best waist trainer",
      "text": "I tried this on when tecieved,it was large in the lower back.Its very tight and not easy to put on.I put it on,upside down and it takes long to put on.Its a reasonable price for the quality of this waist trainer.It feels like a corset,only too tight for everyday.There must be an easier to use,waist trainer that promotes sweating.This isnt bad but not for everyone.",
      "rating": 2.0,
      "verified": true,
      "author": "Nanette ",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Uncomfortable. Digs into your back.",
      "text": "Sizing is way off. First purchase was a S due to reviews recommended to size down which was absolutely way to small returned and ordered a M I was able to get it on the first row but unfortunately it’s so uncomfortable lining digs into Your back it almost unbearable to even wear. I was really hoping this would be a great fit I had planned on using it to sleep and to work it’s so hard to even sit in I thought about exchanging for a size L but would probably not be as tight as I would like It . my waist mearsurments are 29 1/2",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "BUY IT !!",
      "text": "This product is amazing I will be buying more from this seller, it’s comfortable to wear all day long. It doesn’t hurt or give any discomfort, keeps everything in place. Definitely my favorite piece of waist trainer yet, I’ve bought Colombian ones for $200+ and this doesn’t compare to those. this one is hands down my favorite. Thank you !! Will be recommending to my friends",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Tavarez",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "This product is amazing!!!",
      "text": "I ordered my URSEXYLY waist training and it arrived within two days! The material is very high quality. I love the way that is contours to my body. It is the most comfortable waist training I have ever owned (I have owned several). It super easy to put on and adjust. I will recommend this product for all beautiful women. This product is a MUST HAVE!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelledean",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Money well spent!!☺",
      "text": "Based on the reviews and size chart i got a small when in fact i needed a Medium. Overall the material is of really really good quality. After struggling a bit to get it on. Although it was tight it was comfortable not constricting my breathing. The bone is flexable which makes it easy when sitting. My posture immediately improved and i started wearing it 3 hrs per day and gradually increase the hours. Will definitely order again",
      "rating": 5.0,
      "verified": true,
      "author": "penny",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "FOLLOW THEIR SIZE CHART",
      "text": "Exactly as my headline says, read and follow their size chart. I purchased this after reading the reviews and looking over the size chart. I bought an XL and I am currently on the first set or eye hooks. I've been wearing it for four days now at eight hours a day. I have not tried to wear it overnight yet, and from what I read you shouldn't wear it more than eight hours at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad L. Wilcox",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great seller, good product.",
      "text": "My waist size is 34in and per other reviews, I went down a size to Medium... I should have gotten a small as the item is still too big. I reached out to the company because I really do like the product, it is very well made and if it would fit right, would do what it's supposed to. The seller made it all better and offered to replace with a smaller size. Overall very pleased with the product and seller.",
      "rating": 5.0,
      "verified": true,
      "author": "C_E",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Order the right size",
      "text": "This waist trimmer is very well made and not super stretchy, as I expected. I ordered Medium because my waist is 32, so I thought the 29-31 inch would work for now, and as I lost weight I would just use the next hook over...WRONG! This is thick, high quality material, so order your current size, then as you lose weight, just keep moving over to the next hook. There are 3 rows of hooks. Getting the right size for right now!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzie Q",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "LOVE EVERYTHING ABOUT IT",
      "text": "I love it! The size chart is pretty accurate. The boning was well structured and doesn't buckle. The material breathes but is sturdy. The hooks are very secure! And the customer service is great! I'm 5'8\", 45-36-43. I thought my waist was 34\" so I ordered a Large. I contacted the seller and the seller was very responsive and offered the correct size, an X-Large! Would definitely buy from this seller again!!",
      "rating": 5.0,
      "verified": true,
      "author": "CollegeLyfe",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "No a real waist trainer.",
      "text": "I used the size chart to order and i wish i didn't. I ordered a XL and i should have just ordered my normal size L. It fits just not tight like i would like. It is not really a waist trainer tho. Its more of just a sweat band. But even with that said it doesn't make you sweat lol. I wouldn't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "amanda",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great.. unless you need to cover Mom pooch",
      "text": "I ordered a Large based on the size chart and it was very snug. I was worried it wouldn't fit, but I was able to get it on by putting it on while lying down. The material was good quality. The only reason I am returning and am not going to order again is because it is not long enough to cover the mom pooch I have post c section. If you don't need lower tummy coverage, then this waist trainer will be great for you! It's a good price & quality material.",
      "rating": 4.0,
      "verified": true,
      "author": "Elly",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Measure first!",
      "text": "I measured my waist to order per posted size chart, however the shaper was too small by about 1-2in. I could fasten it, but with great difficulty. It is a very well made shaper, just runs too small. Recommend ordering a size up if your waist measures towards the end of the posted size. I contacted the seller, who quickly issued a refund - 4 stars for the quality of the product and the customer service!",
      "rating": 4.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Fast shipping, comfortable waist trainer!",
      "text": "This has been my 3rd waist trainer I have bought, I finally found one that fits as it should, and its actually pretty comfortable. Get ready to sweat! Will give a better update with results as the weeks go on!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Nothing is compressed, just covered",
      "text": "This is my second waist trainer I've bought and I have to say, this one kinda sucks in comparison. They seem to be made of something similar, but this one just doesn't hold in the same way. It feels more than trying to put my stomach into a compression sleeve; everything is just as large, just smoother. The other one I own actually has boning and functions more like a corset that sucks everything in. The only way this one is better is the double layering and zipper, I do like that part. Here is the link to the one I liked more:",
      "rating": 2.0,
      "verified": true,
      "author": "Chloe",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "A must have in wardrobe",
      "text": "I received my order today and put it on and I love it, first of I weight 182 height 5’6and a medium fit me to perfect actually I think soon I will be getting the small for when I am just home being lazy and workout while wearing the medium because it’s breathable, not to tight and material soft and no strong order when I open the package surprisingly, so for me personally I give it maximum vote.",
      "rating": 5.0,
      "verified": true,
      "author": "Esther",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Overall good quality",
      "text": "This waist trainer is very comfortable and can be easily worn under clothes. It’s good to workout and for a run. Something to take into consideration, this is not a waist trainer to trained your waist, it’s more for to use for a workout and help with posture. I’m usually a medium and had to reorder a small. I’m 5’2 weight around the 140-143lb mark.",
      "rating": 4.0,
      "verified": true,
      "author": "diana",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "GREAT- Buy a size smaller!!!",
      "text": "This is fantastic. I've worn other waist trainers in the past, but didn't like how you could see the outline of the fasteners through shirts I would wear. This one is different since there's another layer that you can zip up which smoothens it out. DEFINITELY buy a size lower- I'm 5'6\", 175lbs and with an hourglass type figure, usually go for a Medium in shirts but sometimes a large, and I was able to comfortably fit in the Medium. Does exactly what it's supposed to and is relatively comfortable, considering its purpose. If you've tried waist trainers in the past but didn't like the bulky outline they gave you, I highly recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Willa Murphy",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great tool to add to your workout !",
      "text": "Surprisingly comfortable, easy to put on & move in ! I have used it in a few of my workout already (I personally use skin tightening and or aloe lotion on first , them I put on the Cincher ) & it certainly warms up my core & produces more sweat ! I is FAR LESS BULKY under clothing then my previous thermo / sauna belts even with them double compression!. I am really enjoying this so far !",
      "rating": 5.0,
      "verified": true,
      "author": "A gal",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Great for comfort wear",
      "text": "Love it! The material is soft and flexable. It has a lot of stretch to it. This was perfect for my post surgery belly. I only had laparoscopic surgery but this was the 2nd time they cut through the same holes so I was having a harder time with healing. I have work in for 7 days straight with removing it at night and it is still extremely comfortable. It for the most part stayed where I put it. I didnt have many issues having to readjust it. The zipper is plastic but I have not had any issues with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great company to work with",
      "text": "Great company to work with. I received my waist trainer very quickly. I couldn't wait to receive it. The quality is great and made well with the extra support of the zipper. I ordered the incorrect size, thinking I was ordering according to my size, but it was too loose with no compression even after I fastened to the last row of fasteners & zipped it up. I contacted the seller and they offered to replace item with no fuss. They were very accommodating and addressed my issue.",
      "rating": 5.0,
      "verified": true,
      "author": "ERICA NV",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "My secret weapon",
      "text": "I love this product. This is actually a personal repurchase. With consistency, I absolutely see results with this particular brand and product. I had to repurchase and size down because of how effective this is. I wear it during walks, during workouts and also at work. I’m in love with the zipper over the hooks concept because it fits flawlessly under clothing. I will be ordering many more products from this brand in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica S.",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Very good buy for the price",
      "text": "So I was on the fence about what size to order and ended up getting a medium. I weigh 160 and waist is 32 inches. It is very, very comfortable and easy to put on. I think I will be able to sleep in this too which is what I was hoping for! The material is breathable and more like compression shapewear with ribbing as opposed to other waist trainers I’ve tried that are a latex material and very heavy. I would recommend for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "cmr",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Runs Small, GREAT Service!!!",
      "text": "Got one for my girlfriend, according to the sizing chart, she should be a Large, but, definitely too small for her. I contacted the company directly, instead of going through Amazon and they were kind enough to send out a new shaper in the correct size at no cost. Very impressive customer service! I'm very VERY satisfied! I'll make sure to update when my GF tries the new shaper. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Malfoy",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Solid buy",
      "text": "This was really tight when I bought, I had to lay down to get it in but after wearing it for an hour it became less tight, it gets more comfortable I promise ! Today is day 4, I went 4 hours and i did house work, I forgot it was on. I have a short torso and it still fits fine, helps stand up straight more than anything",
      "rating": 4.0,
      "verified": true,
      "author": "Kylepluse",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Comfortable and measure your waist to get right size",
      "text": "I love how soft yet strong the material is. I have had latex waist trainers before and it was unbearable to wear all day. This one you could wear all day and night. It has 3 rows of clasps and a zipper closure. I suggest not going by your clothing size and actually measuring your waist which is an inch above your belly button. I ordered a size too small and they mailed me a new one. This waist trainer is perfect if your trying to get back into your original size after having a baby.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff mulligan",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Excellent Customer Service",
      "text": "Although the small was too large for my waist, I have to give them kudos for excellent customer service. I contacted them regarding my size issue, they responded quickly and asked for my measurements to be able to improve on their product. They also accommodated my issue with offering options to make sure I was a satisfied customer. In terms of the quality of the product itself, it was well made, I just wish it came in a smaller size.",
      "rating": 5.0,
      "verified": true,
      "author": "ap",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Great Customer Service",
      "text": "I really like the design of the product - hooks with zipper enclosure. Most clothing items I wear a Medium, so being optimistic I ordered a large, which is smaller than recommended thinking I would be fine. That was wishful thinking. I reached out to customer service and they advised me that based on my measurements I should stick with \"their\" sizing guide and get the 2XL. I appreciate the customer service and we're working it out to get me the correct size. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "S. L. Giles",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Sensitive skin friendly",
      "text": "I took the advice of others and ordered down. I am typically an XL with a 35.5 inch waist I order the medium and it fits wonderfully. It’s not too tight or restricting but does have enough compression to smooth me out. The material is super soft and doesn’t break out my sensitive skin like other waist trainers/hot vests have in the past. I love it and would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Channi",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "The waist trainer seems to be well constructed and I love the material",
      "text": "The customer service from this company is outstanding. The waist trainer seems to be well constructed and I love the material, however, I have had a bit of a challenge finding my correct size (too large) although I followed their sizing chart. Had I found a size that fit, I am confident that this waist trainer would have provided a comfortable fit to wear during workouts and those times I get dressed up. Overall, I recommend the product and the company.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Very nice material.  Not too bulky",
      "text": "I received the shaper and it was too big. I should have ordered an XL. My proportions are not average so I instead of going down one size, I should have went down two sizes. However, I reached out to customer service and they responded promptly (same day). They were adamant about making it right and agreed to send me out a smaller size. Great customer service and because of that, they have gained a loyal customer and I will tell all my friends about my experience - they fixed it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Great product and customer service",
      "text": "I am trying to get summer ready and I decided to buy this waist trainer because it a corset fit and has 2 layers to help hold in and shape up. It arrived and I was really excited because it seemed sturdy but flexible. Unfortunately I ordered a small instead of a medium because I didn’t read the waist sizes. When I contacted customer service they got back to me very quickly and offered to send me a new one. They were very nice and super helpful. Definitely a small company with good customer service. I can’t wait to receive my new one.",
      "rating": 5.0,
      "verified": true,
      "author": "alexis singh",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Waist trainer",
      "text": "Very flimsy hard to zip misrepresented in the picture it looks very sturdy but they need to mention that it is a soft neoprene fabric not a firm latex waste censure it should not be categorized as a latex in any shape or form.Very flimsy hard to zip misrepresented in the picture it looks very sturdy but they need to mention that it is a soft neoprene fabric not a firm latex waste censure it should not be categorized as latex and any shape or form",
      "rating": 1.0,
      "verified": true,
      "author": "Pris",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Runs large but the material is good quality",
      "text": "I just received my waist trainer and I like that this product has such nice, soft material. It feels comfortable enough to be worn all day and under casual clothes without notice. My product was delivered as expected. However, it was larger than i expected it to be. I contacted the seller and they were very helpful with correcting the problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Rose'",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "I love the quality of the fabric and the abilty it ...",
      "text": "I love the quality of the fabric and the abilty it has to hold you in, however I order the wrong size by reference from some of the ratings stating that it ran big. However I was able to get it into the first row which was very very tight. I order a large and probably should have gotten an extra large...I will be ordering again but next time right size...I usually wear a 12 to sometime 14 in pants and a large to xl in tops...excellent product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mz marcia",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Size Chart Is Off",
      "text": "According to the size chart I need an extra small. It was way to small. I could get it on using the first set of hooks (the biggest set) and I could get it zippered. But it was so small it rode up and made me have rolls. There is also no boning in this which I though I would like but it offers little to no back support.",
      "rating": 3.0,
      "verified": true,
      "author": "SarahMonroe",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Surprisingly good product.",
      "text": "After not spending all that much on this product, I was not expecting all that much. I really got it to see if waist trainers worked for me. I was surprised to receive a trainer of excellent quality. Unfortunately it did not fit, but the sellers were incredibly quick and helpful in getting back to me and getting me a new one. 10 out of 10 would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Artemis",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Amazingly Comfortable",
      "text": "The material is sturdy, I suggest you order your size or a size smaller. I ordered mine a size up and realized it fits true to size. There are no hard wires in the material and surprisingly ALL DAY comfortable. I didn't feel bound up, my skin was not itchy after taking it off. This waist trainer is for those persons who want to try one but isn't sure if it's for you. I recommend this item for all first time users.",
      "rating": 5.0,
      "verified": true,
      "author": "Heaven Sent22",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Not totally bad, but not that good",
      "text": "Update: Nope, wouldn’t recommend at all as a waist trainer, it stretches way too much. It works at first, but after only a couple wears begins to stretch. Both my friend and I ordered and hers unfortunately gave a rash that turned into a scar.",
      "rating": 2.0,
      "verified": true,
      "author": "That's_Me",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Great Product, surprisingly quality material!",
      "text": "I typically wear 4/6, and I have a some what petite frame so I went with the size Small. Helps with posture. I sit all day at work, so very beneficial. Seen results in as little as two days. But it was from wearing it for 8-9 hours at a time at work. After the first week, I was able to move to the next row of hooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Britt",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Not good",
      "text": "I received corset with the tag already removed and fall out in the bag. Look like a return item from someone. The material some what cheap made. Not enough support. The zipper keep fall out when i try to zip up. The tag is not on the corset otherwise i would return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Phuong-ha Pham",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "If you’re on the max end of inches, go up a size.",
      "text": "I purchased a medium based on inches...I’m approximately 31 inches around my waste (a little less), and the medium supports up to 31.4. The waist trainer was a little tight for my liking. I contacted the company and they were very accommodating and understanding. The size chart may be off just a little, but the trainer is a good quality, and they’re willing to make it right. I can’t wait to get my replacement. It also wears well underneath clothing. The design is sturdy, but thin material, so you don’t have that bulkiness like other trainers.",
      "rating": 5.0,
      "verified": true,
      "author": "Shareka",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "good buy",
      "text": "This waist trainer the one out of 4 I've ordered and returned that actually fit right and was comfortable. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle G.",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "The outer layer doesn't match in inner layer",
      "text": "This product is made irregular. I order a large and was able to snap the first layer closed; however, I was not able to get the outer layer attached. So, I returned it and decided to order an extra large and I had the same problem!",
      "rating": 1.0,
      "verified": true,
      "author": "TheGuardian",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Don’t waste the money",
      "text": "WAY too small and short. I have a short torso as is. This product is still sitting in my closet unused. Cheap material. ShaperX is much better!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica ",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "I liked the design over all",
      "text": "I ordered size small (I normally wear size 8 in pants, size small in shirts) and have been waist training for about a year now. I failed to notice that this is not \"steel boned\" and the tip trainer you can use while working out and such. The trainer was large on my and very loose. I liked the design over all, and loved the zipper feature, it was just too big so I gave it away to a friend who is a size 12 and the small size trainer fit her good.",
      "rating": 3.0,
      "verified": true,
      "author": "Lety",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Fits but curls.",
      "text": "So I received mine today. Well, I definitely broke a sweat putting it on. It's tight but not uncomfortable. In the back, it does curl up. It's a problem I have with all products like this, so it wasn't a surprised. I have a short torso & large butt. I wouldn't wear it under a tight dress because it would show but other than that I am happy with my product.",
      "rating": 4.0,
      "verified": true,
      "author": "lainee183",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Don’t “waist” your money!!",
      "text": "Do not buy this product poorly constructed buckles and bulges.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20171130
    },
    {
      "title": "TOO LARGE FOR XSMALL",
      "text": "I ordered a xsmall because I had a waist trainer before which was a size small. I wanted to go a size lower so I bought the xsmall. When I got it, it was really loose! I wouldn't recommend this brand and do your research in finding the right size.",
      "rating": 1.0,
      "verified": true,
      "author": "Anjelica",
      "helpful_votes": 3,
      "publication_date": 20180327
    },
    {
      "title": "Jamaica  trip",
      "text": "I liked the waist trainer. The fit was rough at first , trying to get the zipper to zip. I finally got it zipped . I wear it to do lawn work and work. It does hold everything in, I'm able to breathe comfortably but I did notice I couldn't wear my duty belt with it. It starts to pinch in my back. Other than that I love my waist trainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Momo",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Way too big on the waist. I was hoping ...",
      "text": "Way too big on the waist. I was hoping a waist trainer would hold the waist tighter. I returned and exchanged for a smaller size and it was still too big. Update: Ursexyly has been incredibly helpful and attentive to my original review. They have agreed to work with me and refund me if need be. It may be that my short torso is the problem and not the product. A company that takes the time to hear customers’ feedback and personally address them deserves a 5 Star. I’m overwhelmingly impressed by the attentive customer service. I’d certainly recommend giving them a shot and meeting your needs.",
      "rating": 5.0,
      "verified": true,
      "author": "maritza perez",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Excellent customer service",
      "text": "I received my package on time. Material feels very soft and comfortable to wear all day. However the size runs a little big. I contacted the seller about returning the larger size for a smaller size, he willingly offered to re-ship the correct size without any returns. I’m very impressed and grateful and I can’t wait to get the correct size. I will definitely recommend this to anyone hoping to loose some inches around the waist.",
      "rating": 4.0,
      "verified": true,
      "author": "Florabynas",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Cut small",
      "text": "Cut very small and has no stretch to it my other waist trainer is a small and it fits well just not long enough so I order this one and it’s not any longer then my last one I didn’t even waste my time sending it back ima just give it to my daughter",
      "rating": 1.0,
      "verified": true,
      "author": "Bianca Fore",
      "helpful_votes": 0,
      "publication_date": 20190501
    }
  ],
  "product_meta": {
    "title": "Ursexyly Women Waist Trainer Corset Zipper Hook Shapewear Double Control Body Shaper Tummy Fat Burning Waist Cincher",
    "rating": 4,
    "feature_bullets": [
      "Ursexyly zipper and hook waist trainer comfortable to wear every day!",
      "♦Function & Effects♦: Flatten abdomen, smaller the waist holds your back, lumbar support, postpartum recovery, more sweat out when exercise then fat burning; Keep warm in the cold, crazy sweat in the hot, protecting spine, posture standing erect training, and promotes the noble manner, etc",
      "Fulfilled By Ursexyly USPS 2-5 working days shipping, few item stable 5-10 working days",
      "Function & Effects: Flatten abdomen, smaller the waist, more sweat out when exercise, keep warm in the cold, protecting spine, posture standing erect training, and promotes the noble manner",
      "Bullet Point: Soft skin-friendly, 7 Wires+3 Hooks+Zipper, HIGH COMPRESSION",
      "User: All lady who pursuit beauty which include women require Postpartum Rebuilding, fitness enthusiast",
      "SIZE: S M L XL 2XL 3XL 4XL. ★Run small for Amazon Sizing. Not usual cloth size not Amazon size chart. Just measure your size of ★True Waist★ and bust. We have MONEY BACK Guarantee if you follow our size chart on the left of image but found that not suitable"
    ],
    "categories": [
      "Women",
      "Lingerie, Sleep & Lounge",
      "Shapewear",
      "Lingerie",
      "Clothing, Shoes & Jewelry",
      "Waist Cinchers",
      "Clothing"
    ],
    "price": 19.99,
    "specifications": {}
  }
}