{
  "website_summaries": [
    {
      "verdict": "A good option if you have a half-patio umbrella and you want a base that will sit flush against the wall.",
      "pros": [
        "Made of rust-free resin",
        "Designed for half-patio umbrellas",
        "Houses umbrella poles from 1.25 to almost 2 inches in diameter",
        "Stylish floral design",
        "Compact, so it fits easily in small spaces"
      ],
      "cons": [
        "Only weighs 20 pounds, so it won't do well against heavy winds"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect!  Almost 😆",
      "text": "This weighs about 20 lbs and it’s perfect. Read reviews and as we’ve done on very windy days, close the umbrella. Although, because it’s against my home, it really does feel and looks secure. We have not had any problems at all. Perfect with our Sundale umbrella. 👍🏼👍🏼👍🏼👍🏼 UPDATE 4/30/2018 We had alittle snow and it toppled over. Purchased a two piece bag weight (filled it with sand). Now it’s very secure and.....perfect, again.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 24,
      "publication_date": 20180318
    },
    {
      "title": "Heavy, works excellent",
      "text": "Works great on our half umbrella. It saved it from going over our 4th floor balcony when I forgot to close it and it became weighed down with ice/snow. It toppled right over the side, but stopped due to the heavy base. A lighter base would have let it go over and crash down to the ground. Also works great for sudden winds. It also has added hardware that allows you to anchor the umbrella to the floor through the bottom of the base. Just be sure to leave some room for ice expansion if it will freeze in winter.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 20,
      "publication_date": 20171225
    },
    {
      "title": "this base is pretty good, HOWEVER",
      "text": "As a base for my half-umbrella, this base is pretty good, HOWEVER, the knob-style tightener that holds the umbrella shaft in the base is inadequate to keep the umbrella staff in the base during windy days or nights. I've used eye-bolts and plastic ties to keep the umbrella in place and so far, so good.",
      "rating": 4.0,
      "verified": true,
      "author": "GruffOldBear",
      "helpful_votes": 2,
      "publication_date": 20170613
    },
    {
      "title": "A very good base for umbrella or fan!",
      "text": "We bought this to support a fan with a broken base. It works perfect. If you are using it on hardwood floors or the floors that may scratch be sure to have three adhesive cushion pads to put on the bottom. The product is well made and works to our expectations.",
      "rating": 4.0,
      "verified": true,
      "author": "P C Z",
      "helpful_votes": 5,
      "publication_date": 20170219
    },
    {
      "title": "LEANING  PATIO UMBRELLA!!!",
      "text": "I bought this stand with the pure garden 9 ft half round patio umbrella for this summer. I am so disappointed in this product. It worked well for the first month then it started leaning forward. I contacted Amazon as suggested i drlled a hole into the poll that goes into the screw in the umbrella base to no avail. Now it has bern suggested that i put wooden shimmies in the base. Should I have to work this hard to enjoy the product!!??i solved the problem a friend gave me a round an iron base. voila..no tilting umbrella!!.please advise your customer to buy metal base instead of resin.",
      "rating": 1.0,
      "verified": true,
      "author": "Frances C.",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great umbrella base",
      "text": "I ordered this for my back patio in part to keep the water off of the back door. I needed something that would snuggle up to the backside of my condo because there's so much wrong with the structure of my back door that it leaks when it rains heavy. So far, so good. I haven't noticed any leaks and it's an extra perk to be able to sit outside and drink your coffee while it's raining.",
      "rating": 5.0,
      "verified": true,
      "author": "Betybobety",
      "helpful_votes": 19,
      "publication_date": 20181120
    },
    {
      "title": "Can’t recommend this one",
      "text": "Not very sturdy. I had to put a sand bag on the base to keep it up. The first wind knocked it over. I’ve had it eight months now and the whole pole broke off the stand today . Not happy with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Sturdy but a bit of a lean",
      "text": "This umbrella stand is sturdy and holds our half umbrella without the need for extra weight, however as others have noted, it does lean a little bit forwards. For us that's not an issue as there's a bit of a lip on our roof, but can easily see that being a problem for others.",
      "rating": 4.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "... is not very heavy at all and blows over easily with the half umbrella",
      "text": "It is not very heavy at all and blows over easily with the half umbrella!",
      "rating": 2.0,
      "verified": true,
      "author": "LittleDevil",
      "helpful_votes": 5,
      "publication_date": 20170512
    },
    {
      "title": "Does not work with the half umbrella",
      "text": "This is not strong enough to support a half umbrella. I bought the stand according to the size of the umbrella but it is too weak.",
      "rating": 1.0,
      "verified": true,
      "author": "alison",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Not secure",
      "text": "Recently purchased this and the paint is already chipped, cracked and coming off.. also the lever to tighten doesnt hold the umbrella in very well, stays loose and lets the umbrella wobble. Not really a fan of this and need to get a new one to allow a more secure base.",
      "rating": 2.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Very Nice!",
      "text": "This half base is very nice. It's heavy and well made with a nice design on the version I bought. It's great to not have to fill it up with sand or worry about rust. I'm really happy with it, well worth the money. Photo included.",
      "rating": 5.0,
      "verified": true,
      "author": "Carols Critters",
      "helpful_votes": 20,
      "publication_date": 20180214
    },
    {
      "title": "Half Umbrella Stand",
      "text": "I liked this stand so much I actually purchased a second one. Used one for our half patio umbrella and the other to hold up the pole holding my hummingbird feeder. Looks great and doesn't take up much room. S",
      "rating": 5.0,
      "verified": true,
      "author": "E D & S",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Squirrel knocks it over!",
      "text": "Thought half round would work with half umbrella, but the full round would very likely be more stable. If a squirrel can knock it over so can wind.",
      "rating": 1.0,
      "verified": true,
      "author": "Sallie50",
      "helpful_votes": 2,
      "publication_date": 20180609
    },
    {
      "title": "Not that good.",
      "text": "Knocks over very easily. A bird landed on top of the umbrella and it fell over taking the table with it. A wk later with the umbrella down, it was fairly windy and it fell over again. Full round base would be much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Ccpromua",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "The turning knob to hold the pole",
      "text": "My umbrella looks nice and sturdy, but the base where you screw in to hold the pole didn't screw in straight and when turning the knob the plastic piece attached to the base started to come apart. The screw was going in on an angle. It wasn't welded too good. So far It seems to be holding my umbrella pole up. Be careful when screwing in as it could break apart.",
      "rating": 3.0,
      "verified": true,
      "author": "Karyn ",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Super high quality and very pretty too.",
      "text": "We shopped for weeks before choosing this base for our half patio umbrella. I actually chose another and something happened where I changed to this one. It was not a mistake. This is beautifully made and very high quality. If we get a second umbrella I will definitely choose this one again.",
      "rating": 5.0,
      "verified": true,
      "author": "AReviewer.of.online.Products",
      "helpful_votes": 18,
      "publication_date": 20180727
    },
    {
      "title": "Heavy and Holding in place our beautiful umbrella:)",
      "text": "This is a HEAVY half moon base and it is awesome!!! Holds the umbrella in spot during the down pours of drenching rain and wind. Super impressed and it is really beautiful. Very, very pleases!",
      "rating": 5.0,
      "verified": true,
      "author": "Hiker68",
      "helpful_votes": 18,
      "publication_date": 20191001
    },
    {
      "title": "Does the Job",
      "text": "You’ll need to purchase this when you buy the half umbrella. It does the job, so no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Tressy",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Pretty and Sturdy",
      "text": "The base is very pretty and heavy. That surprised me I must admit. Works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Perfect",
      "text": "This was perfect for my porch umbrella. I just wish it had been cheaper.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon U",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Not Sturdy at All",
      "text": "this thing will never hold up the umbrella, I had to tighten the stem twice already, save your money",
      "rating": 1.0,
      "verified": true,
      "author": "Dugan",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great Stand!",
      "text": "Loved the stand! Easy to put together and dimensions where accurate. I ordered a second one for our side yard. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "carol jarrett hanover",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Not heavy enough",
      "text": "I love the design and it fits perfectly in the space I wanted it for. But it’s not nearly heavy enough to hold an umbrella in place. Had to chase down my umbrella multiple times in the yard.",
      "rating": 2.0,
      "verified": true,
      "author": "Cinthia",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Heavy duty!",
      "text": "This umbrella stand is perfect! I thought it would be light weight and unable to hold the umbrella down in the wind but it is heavy duty. I love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin P.",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Buy plastic.",
      "text": "Completely rusted through in two summers. Umbrella fell in pool",
      "rating": 2.0,
      "verified": true,
      "author": "Easy way ",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Totally Worth It!",
      "text": "Really nice for my new umbrella. Fits perfect and very heavy. The design makes it much more enjoyable! Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "HIREP",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "I'm happy with it but I did buy inflatable weights (which ...",
      "text": "It's ok. I'm happy with it but I did buy inflatable weights (which makes the look ugly) to be sure if some winds came it wouldn't move or tip over.",
      "rating": 3.0,
      "verified": true,
      "author": "Nanette",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "It has weathered the storm",
      "text": "This hasn't moved since I put it on for my half patio umbrella and my umbrella has held up during all weather conditions, thunderstorms, windy rain, snow, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Gray",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Half a base and study as whole",
      "text": "The designed on base is attractive The base is sturdy and heavy. It will hold a whole umbrella, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Yolie",
      "helpful_votes": 18,
      "publication_date": 20190703
    },
    {
      "title": "Quality product",
      "text": "This works great! Holds umbrella in place and very sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "Johnelle",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Great with back at a fence or even home",
      "text": "Recommend sandbag or something to keep the base from moving IF high winds.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy H.",
      "helpful_votes": 18,
      "publication_date": 20190912
    },
    {
      "title": "Sturdy and attractive",
      "text": "This half umbrella stand works perfectly as it abuts very close to the window and supports my half-umbrella well.",
      "rating": 5.0,
      "verified": true,
      "author": "PGF",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Not Sturdy",
      "text": "I wish there was more weight to this Umbrella stand. Need to place bricks or umbrella support to wall to prevent a half umbrella from toppling over",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Perfect for half umbrella",
      "text": "It is a heavy base, perfect for the half umbrella.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Tjornhom",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Amazing with the water weight and screws to hold umbrella, it really works",
      "text": "Definitely had never heard of the half umbrella or stand. Love this, it fits against the wall and has two screws to hold the umbrella in tight. As well as being able to fill the holder with water, the wind has not lifted it. Amazed that it’s staying in place when windy",
      "rating": 5.0,
      "verified": true,
      "author": "M. Morton",
      "helpful_votes": 18,
      "publication_date": 20180731
    },
    {
      "title": "its very nice, but not that heavy",
      "text": "its very nice, but not that heavy. I needed to tie it to the balusters in order to stop a heavy wind",
      "rating": 4.0,
      "verified": true,
      "author": "handygirl",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Very convenient and great value!",
      "text": "Very sturdy and easy to assemble. Be sure to NOT drop it; for it may crack. It is NOT metal, but a heavy resin.",
      "rating": 5.0,
      "verified": true,
      "author": "A Natural Touch",
      "helpful_votes": 18,
      "publication_date": 20190626
    },
    {
      "title": "Great stand for 1/2 size umbrella!!",
      "text": "This stand has been great for the place I needed to use it. It's the perfect size and is pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 18,
      "publication_date": 20190615
    },
    {
      "title": "Great Little Base",
      "text": "Great base for the price. It worked perfectly to solve our situation - a half umbrella to shade an orchid box from the midday sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Florida shopper",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Solid and sturdy!",
      "text": "Excellent quality. Hold an umbrella securely during our last round of high winds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20190502
    },
    {
      "title": "Leaning Umbrella",
      "text": "This is kinda cheesy, but I guess you get what you pay for. The tube that holds the umbrella pole, is not stable and does not connect well with the hardware it comes with, hence the umbrella leans.",
      "rating": 3.0,
      "verified": true,
      "author": "Christine ",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "It doesn't get any better!",
      "text": "Easy to use, easy to set up! Quality construction - perfect match with my half umbrella! My patio is ready for summer!",
      "rating": 5.0,
      "verified": true,
      "author": "cmecoach",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "i like it was a bit wind last night and i ...",
      "text": "i like it was a bit wind last night and i forgot to put the umbrella down. but the wind did not take it fir a for this time great product",
      "rating": 5.0,
      "verified": true,
      "author": "blan1353",
      "helpful_votes": 18,
      "publication_date": 20180714
    },
    {
      "title": "Doesn’t keep umbrella up!",
      "text": "If I could have use a minus I would havterrible stand For balance I think it needs a full circle stand",
      "rating": 1.0,
      "verified": true,
      "author": "cathy williams",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Looks great",
      "text": "It is almost perfect for what I needed, I just wish there as a little more weight to it",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Awesome & Heavy",
      "text": "Had to move to a apartment & this along with half shade is PERFECT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Pretty short tube.",
      "text": "The tube that holds the umbrella is to short, What makes the umbrella be inclined.",
      "rating": 2.0,
      "verified": true,
      "author": "Cinthia",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "poor quality",
      "text": "disappointed of this bad product not a month lasted money thrown in the trash the truth I do not recommend if I could give it back",
      "rating": 1.0,
      "verified": true,
      "author": "edismenjivar",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Nice quality and very compact compared to the other heavy ...",
      "text": "Nice quality and very compact compared to the other heavy umbrella bases. I have a troubled wrist, so being able to carry it around after emptying the water out is a big plus. I can store it easily. Also it stays very strong against the heavy winds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great",
      "text": "Very sturdy, heavy and fits great with our 1/2 umbrella. We have sit right up against our house on our deck between two chairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Gift to my Mom♡",
      "text": "Has a good weight to it. And holds the umbrella well. Thanks♡",
      "rating": 5.0,
      "verified": true,
      "author": "Ambah",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Five Stars",
      "text": "Good product. Well made, good looking, fits well, light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Seungyong Lee",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Nice and heavy for a little stand.",
      "text": "I use this stand with a half round umbrella up by my spa. Works well and hasn’t tipped over yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette French Design",
      "helpful_votes": 18,
      "publication_date": 20180820
    },
    {
      "title": "Five Stars",
      "text": "Great stand. nice design and my umbrella never tips over.",
      "rating": 5.0,
      "verified": true,
      "author": "tyrone davis",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Works well on my patio",
      "text": "Works well with the half umbrella which I purchased earlier. Fits nicely against house and allows for half umbrella to fit snugly above doorway.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 18,
      "publication_date": 20190417
    },
    {
      "title": "perfect for the half umbrella",
      "text": "perfect for the half umbrella holds it up fairly securely when place right up against the house... easy to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "yinn2yangTop Contributor: Woodworking",
      "helpful_votes": 18,
      "publication_date": 20180402
    },
    {
      "title": "Works great!",
      "text": "Perfect to put up against the fence or house. Sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20190420
    },
    {
      "title": "Umbrella base",
      "text": "Good resin quality with the look of antique. Very heavy so my flag stays put!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 18,
      "publication_date": 20181025
    },
    {
      "title": "Well made piece",
      "text": "Super nice on my balcony. Very sturdy, well holding my umbrella even on some of the strong windy days. Extremely well made piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "STURDY STAND",
      "text": "I read reviews and chose this half umbrella stand. No regrets!!! It is sturdy and I've had no issues at all. It has been through several storms on patio with no problems . Highly recommend. Shipped quicker than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Herb Love",
      "helpful_votes": 18,
      "publication_date": 20190521
    },
    {
      "title": "There was no knob provided with this.",
      "text": "Missing one of the main parts of the stand, no customer service info provided.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim D",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "love this! bought this and the Half Patio umbrella ...",
      "text": "love this! bought this and the Half Patio umbrella for my very sunny deck. Both items totaled what it would have cost to purchase the just the umbrella from a catalog store. thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Coffey",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "works perfectly",
      "text": "I have a semi-circle umbrella; this heavy base fits it and is sturdy. Highly recommend it with a \"half\" umbrella.",
      "rating": 5.0,
      "verified": true,
      "author": "catbd",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Five Stars",
      "text": "Was as nice as it looks like in the photo!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Parmley, CSA",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Just what we needed.",
      "text": "Works just right where we need it on a long narrow deck. Liked it so well that we purchased another to put on the other side of the sliding doors.",
      "rating": 5.0,
      "verified": true,
      "author": "EDC",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Strong",
      "text": "Strong and sturdy. Now I wish I had the half umbrella I need to go into it.",
      "rating": 4.0,
      "verified": true,
      "author": "LAGO",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Holder is not strong enough to hold closed umbrella and pole upright in wind.",
      "text": "This does not hold closed umbrella in place in wind. Closed umbrella and holder both flipped over.",
      "rating": 1.0,
      "verified": true,
      "author": "Jean W.",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "It's a gotta have...",
      "text": "Works great and it is a must if you have a \"half umbrella\"",
      "rating": 5.0,
      "verified": true,
      "author": "RKB",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Base angle to neck was not straight. Had to ...",
      "text": "Base angle to neck was not straight. Had to insert washers in between the two, in order to be at right angle so pole would not be leaning back.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "a great choice",
      "text": "This umbrella is heavy and durable .. a great choice",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Thompson",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Poor quality",
      "text": "This stand is poorly made. We had to destroy the knob to lock the umbrella in place.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Delena",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Excellent",
      "text": "Excellent stand for my half umbrella. Hope to purchase another one in the near future",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Henderson",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "and was easy to set up",
      "text": "It came quickly, was the color pictured, and was easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "ReaderS",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Looks good and fits well",
      "text": "Love the color and it fots perfectly im my patio. Got the ligjts as well. Looks great at night too",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy s.",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Too light",
      "text": "Too light to stop an umbrella with even a light breeze.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Five Stars",
      "text": "keeps my half umbrella standing on my deck love it",
      "rating": 5.0,
      "verified": true,
      "author": "PwayUkno",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Just what I wanted, very heavy and holds umbrella ...",
      "text": "Just what I wanted,very heavy and holds umbrella very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Must have!",
      "text": "Perfect companion for half umbrella. Makes the umbrella fit in tight space.",
      "rating": 5.0,
      "verified": true,
      "author": "MsFran",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Works for me",
      "text": "This works well for me, I added a railhookz umbrella mount to attach to railings on my patio.",
      "rating": 5.0,
      "verified": true,
      "author": "JANEM",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Works fine.",
      "text": "Good quality, works well, wish it was a bit heavier but all in all fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Five Stars",
      "text": "This base goes great with the half umbrella for my porch.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Slover",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Two Stars",
      "text": "Not as sturdy as I had hoped! I will be surprised if it lasts more than one season",
      "rating": 2.0,
      "verified": true,
      "author": "Martha Marks",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Five Stars",
      "text": "Love the product. It worked perfectly for what I needed",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn Eschbaugh",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Waste of Money",
      "text": "The umbrella blows over too easy in the wind. I will be purchasing a full round stand. This was a complete waste of money. Unfortunately I threw the box away or I would be returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 3,
      "publication_date": 20170515
    },
    {
      "title": "Excellent choice",
      "text": "Works perfectly for the application. Even stable in fairly high winds. Looks very nice and not in any way cheap. Great deal for the money",
      "rating": 5.0,
      "verified": true,
      "author": "Eric G.",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Five Stars",
      "text": "Works fine with the umbrella I ordered, very heavy, doesn't move easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Does not hold umbrella straight",
      "text": "I disliked very much that this base did not support my half umbrella sufficiently enough that it would stand straight up. It is important that it is straight so that it sits flush against my slider window. I tried to contact Sundale several times by phone and email and they have not responded. Thank you.",
      "rating": 1.0,
      "verified": true,
      "author": "Cocoanlace",
      "helpful_votes": 10,
      "publication_date": 20180710
    },
    {
      "title": "This thing is a JOKE!!! It has ...",
      "text": "This thing is a JOKE!!! It has to be, it's round on the bottom it can barely hold it's self up. Let alone an umbrella it tips right over. Jokes on me that's for sure. Now I get to return it. What a Joke did I say that before. Update: So today 8-1-19 The seller Sundale offered me 40 dollars to remove this review and I say no way to that, I'm not a sell out. I stand by my review 100% this thing was Junk 100% and now Sundale is a Joke. For trying to buy me off shame shame on you just a joke. You sold me junk so this is what you get.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180720
    },
    {
      "title": "Not heavy enough sustain summer breeze...",
      "text": "Almost flew out of my balcony on the 6th floor. Wish I could return it. 9/4/18 UPDATE: Changing from 1 star to 3 star as the seller contacted us and refunded us after we provided a photo of defective product.",
      "rating": 3.0,
      "verified": true,
      "author": "momofzam",
      "helpful_votes": 2,
      "publication_date": 20180722
    }
  ],
  "product_meta": {
    "title": "Sundale Outdoor Half Round Universal Heavy Duty Plastic Water Sand Patio Half Round Umbrella Base Stand, Black",
    "rating": 4.3,
    "feature_bullets": [
      "Umbrella Stand Dimension: 11.8\"(W) x 19.2\"(L) x 7.1\"(H), Pole Length 8.5\"",
      "Weights 40 lbs when fully filled with water",
      "Easy to clean and store and fill spout",
      "UV protected to prevent fading , water and weather Resistant",
      "Constructed of heavy-duty plastic for lasting quality, All hardware and tools included, Assembly in seconds"
    ],
    "specifications": {
      "Product Dimensions": "19.2 x 11.8 x 7.1 inches",
      "Item Weight": "5.84 pounds",
      "Manufacturer": "Sundale Outdoor",
      "ASIN": "B071L1CXBZ",
      "Item model number": "Half Stand",
      "Customer Reviews": "4.3 out of 5 stars307 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#121,581 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Umbrellas & Shade",
      "Patio Furniture & Accessories",
      "Umbrella Stands & Bases"
    ],
    "price": 84.99
  }
}