{
  "website_summaries": [
    {
      "verdict": "Though not as versatile at reading codes as pricier competitors, it's all that many vehicle owners need for reliable engine codes and data at a fraction of the price.",
      "pros": [
        "An affordable scanner that provides accurate code readings for most engine issues",
        "Tests EVAP systems",
        "Works on a wide range of 1996 and newer OBDII vehicles",
        "Comes with free lifetime software updates"
      ],
      "cons": [
        "Not as versatile as expensive models – doesn't read codes for all components, but it's great at diagnosing engine issues"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Does What We Want",
      "text": "I won't claim to know a lot about these things. But, our car had a very tiny vacuum leak which was periodically turning the engine light on. With this, we were able to verify that the problem was still minor and turn the light off ourselves. It does what we want it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett E. Baker",
      "helpful_votes": 103,
      "publication_date": 20180125
    },
    {
      "title": "BEWARE!",
      "text": "Support doesn't seem to exist. Actually, I'd give the product at least 4 stars if I could register (anseldirect.com won't let me and can't email me a code), if I could download updates for the device (the web site won't let me - tried two browsers), and if I could read the user's manual without a magnifying glass (about 4 point type rather than 10-12 point used by others). I think the product probably works okay, but you'll have to figure it out for yourself and live without updates (if you have an older car, that may be okay). I wouldn't buy it again based solely on the lack of support.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 109,
      "publication_date": 20180331
    },
    {
      "title": "Cant update without Windows 7",
      "text": "All my computers, phones etc. are OS. That is, Apple. This device will not update nor transfer data on my Mac computer. To quote the User's manual: \"The update software only support (sic) windows 7/8/10\" \"Other systems can run update software directly, only windows 7 need to install the driver\" When I connect to my computer all I get is two vertical lines on the screen. No functions work. There is nothing in the item description nor on the packaging to indicate that you must have Windows 7 to update the software or transfer data to your computer.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel R.",
      "helpful_votes": 39,
      "publication_date": 20180916
    },
    {
      "title": "It went black screen an didn’t work from start. ...",
      "text": "It went black screen an didn’t work from start. Used on a Dodge Grand Caravan 2005. 1 plugged in 2 allowed to light up 3 never light up and worked dud.",
      "rating": 1.0,
      "verified": true,
      "author": "Leo Jackson Jr",
      "helpful_votes": 60,
      "publication_date": 20180419
    },
    {
      "title": "Does Not Work on MINI Coopers",
      "text": "This product advertises working on foreign vehicles, however I have a 2008 Mini Cooper and it was unable to read the codes. I even looked through the questions on the listing, before buying the code reader, to see that the seller responded to \"Does this product work on Mini Coopers?\" with a yes. Very disappointed and I will not be receiving a refund because my return period has passed.",
      "rating": 1.0,
      "verified": true,
      "author": "KP",
      "helpful_votes": 19,
      "publication_date": 20180707
    },
    {
      "title": "Handy, inexpensive, but with one notable downside",
      "text": "This device is easy to use and comes with fairly good instructions. The problem I have is that the code reader seems to have a character limit, shorter than many codes. (See image.) This could actually be one of 3 code variations under P0037: Heated Oxygen Sensor (H2OS) Bank 1 Sensor 2 fuse Heated Oxygen Sensor (H2OS) Bank 1 Sensor 2 harness is open or shorted Heated Oxygen Sensor (H2OS) Bank 1 Sensor 2 circuit poor electrical connection The computer is sending additional information the device is not displaying.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 15,
      "publication_date": 20181116
    },
    {
      "title": "It gets the job done.",
      "text": "It gets the job done. It does what it is supposed to do and works actually quite well to my surprise. I just have a problem while scanning some stuff instead of using some words it uses dollar signs (shown in one of the pictures) to address to some stuff which annoys me a little because it confuses me. Other than that I'm very happy with it. It saves you a trip to a mechanic and some money too. Updating it through the internet is very easy. Just don't tell your neighbors you have one or they'll start calling you each time they have a problem. Great scanner it helped me identify a problem in a car quick and easy!",
      "rating": 4.0,
      "verified": true,
      "author": "Twinky",
      "helpful_votes": 15,
      "publication_date": 20180409
    },
    {
      "title": "I'm happy!",
      "text": "I'm not a techie type of guy and computers are challenging, but I was able to pull up an engine warning light problem by using the directions. I was able to read the problem and delete the code as well. Just what I needed to do. I found out that in fact I do need to take the vehicle to the dealer for the fix.",
      "rating": 4.0,
      "verified": true,
      "author": "Searcher828",
      "helpful_votes": 21,
      "publication_date": 20170809
    },
    {
      "title": "Very nice tool for the do it your selfer",
      "text": "I've only ordered this because my check engine light came on three days ago. I received this, unpacked it and read the instructions. Went outside and plugged it in to my access port. Got an immediate code and english explanation of the problem. It was my thermostat not allowing the engine to come up to proper temperature. Had a spare so quickly installed the spare and erased the computer code. This little device saved me over $100 the first day I had it. Very simple to use. Went to the website and installed the computer software on my home computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180224
    },
    {
      "title": "Very disappointed with his customer service.",
      "text": "I bought this thinking it would be helpful to have if any of my cars got a check engine light. I tried it on 2 different cars that didn't have a check engine on and after I hooked the tool up to the OBD connector and checked readiness monitors both cars had a check engine light on. I tried clearing the code and even though the tool said it cleared the codes the light remained on. I used another scan tool and was able to clear the phantom codes set by this tool. Don't waste your money on this tool. Very disappointed with his customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Gonzalez, Ines",
      "helpful_votes": 5,
      "publication_date": 20200428
    },
    {
      "title": "Defective out of the box.",
      "text": "When I connect the tool to a vehicle (I tried two), the display reads \"Entering System Please Wait\", and freezes. I waited over 15 minutes but the unit was frozen and unresponsive. I am very disappointed and may try a different brand OBD II code reader.",
      "rating": 1.0,
      "verified": true,
      "author": "William L Letizia",
      "helpful_votes": 30,
      "publication_date": 20171015
    },
    {
      "title": "Use at your own risk",
      "text": "I wanted to learn how to use it on my car which has no issues whatsoever. I plugged this scanner in and now I have 6 hard codes, complete with check engine light and my traction control system light is on so now I have no traction control. I thought about plugging it into another vehicle that has no issue but this trashed one vehicle I don't need two trashed cars.",
      "rating": 1.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 5,
      "publication_date": 20200210
    },
    {
      "title": "Worked one time.",
      "text": "I purchased this item because I replace the engine in my car, and the check engine light went on immediately. It was extremely helpful as I figured almost immediately I had unplugged a wiring harness. Since then, I have been unable to get the unit to work. The screen is just white, and it doesn’t work in any car that I put it in. I have tried contacting the seller, but this is not an option on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Dom",
      "helpful_votes": 8,
      "publication_date": 20190114
    },
    {
      "title": "Almost sent it back...",
      "text": "I could not get this unit to update and I almost sent it back. When I plugged the unit into my computer's USB port, I would just see two straight lines. Since it would not update, I almost sent it back. Then, I hit a review that said that you have to download the update software from the manufacturer's website. I downloaded the update software and the unit updated and fixed the couple of bugs Now I am happy! It reads the codes very well and it is easy to use. I am so glad that I read that review about downloading the update software from the manufacturer's website!",
      "rating": 4.0,
      "verified": true,
      "author": "Birdman",
      "helpful_votes": 3,
      "publication_date": 20191108
    },
    {
      "title": "User friendly ..!!! Don't be intimidated ..!!!",
      "text": "Initially a little intimidated with the use of this product. However, the directions are clear and user friendly, I was able to detect my DTC engine light codes, diagnose the problem, repair it, then clear the DTC .... with no issues. Thx Ancel ....good Job and great product.",
      "rating": 5.0,
      "verified": true,
      "author": "DS416",
      "helpful_votes": 7,
      "publication_date": 20170918
    },
    {
      "title": "Failed after updating so never got to use it.",
      "text": "Unit seems like it would have been great. I upgraded it per the instructions to make sure it had the most current programming. It seems to have downgraded instead. It was version 1.62.000 and after the update it was version 1.26.000. Afterwards it would come on but would never connect to read the codes. (It did before the \"update\") Just froze at the \"connecting\" stage. I suspect this was due to their website having an older version of the firmware than was already on the device. So if you get one DONT UPDATE it. It may work fine then.",
      "rating": 1.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 26,
      "publication_date": 20170930
    },
    {
      "title": "I paid for new and got a used tool",
      "text": "It's an average ODB II code reader; it works, so I'll keep it. But I got a badly repackaged return and the unit has cosmetic defects. I paid for a brand new tool and got a somebody's banged up return instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 4,
      "publication_date": 20200531
    },
    {
      "title": "Generic \"Fail\" message when attempting pull diagnostics for my 2011 Element using correct protocol",
      "text": "I was unable to pull diagnostic codes from my 2011 Honda Element using the communication protocol ISO 9141-2, which should be the correct one. I also tried the 2 ISO 14230-4 protocols since both 9141-2 and 14230-4 are listed for Hondas. All 3 protocols connected (no communication error), but returned a generic \"Fail\" after going through the ignition off/on sequence and attempting to get system information. There was no documentation in the manual on possible solutions.",
      "rating": 1.0,
      "verified": true,
      "author": "ratufa",
      "helpful_votes": 3,
      "publication_date": 20191202
    },
    {
      "title": "First use paid for it in diagnostic labor!",
      "text": "I like the basic troubleshooting capability of this unit. For the price, it's a good basic diagnostic tool. It does have some limitations, but narrowing down the code to 3 different possibilities saved me hundreds in labor costs from a shop. Starting with just a simple replacement of the fuel cap fixed my problem. Even though it didn't the first time, the vehicle I drive(Saturn Vue) had a specific need for an OEM part. The replacement aftermarket part just didn't do the trick. At least the code still read the same and I didn't have to tear into more expensive parts on the vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "Bret A. Helle",
      "helpful_votes": 2,
      "publication_date": 20200719
    },
    {
      "title": "Works great.",
      "text": "This is definitely a basic scanner, but it’s all you need. Find the code which will help you fix the problem(s) and then clear the code(s). Simple. Updating it was easy - works with windows 10. The scanner itself has a long enough cord on it, the screen is nice though don’t be fooled - it’s not a touch screen. Over all I would definitely recommend this scanner. For the price you can’t beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "WESIII",
      "helpful_votes": 5,
      "publication_date": 20180202
    },
    {
      "title": "Worth the money.",
      "text": "Does what it supposed to do. I'm not a car/truck guy but it was simple enough for me to figure out. After I hooked it up and navigated to the OBDII screen it diagnosed what was wrong with my truck. It gave me the code and short explanation - misfire in cylinder 6. I can see that this will be useful in the future. Definitely something I'll use before going to a dealership.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael W.",
      "helpful_votes": 5,
      "publication_date": 20171229
    },
    {
      "title": "Works, but a bit of Bait n Switch",
      "text": "I searched on startpage to find the AD410. The amazon link shown is as follows: \"ANCEL AD410 Enhanced OBD II Vehicle Code ... - Amazon.com Anonymous View Quickly and accurately determine whether the battery is good or bad. Read and Clear ABS and SAS Error Codes, Read and clear Engine/ABS/Transmission error ... \" The problem with this ad is its states it will Read and Clear ABS and SAS Error Codes and it does not! This was a bait n switch. Our vehicle was built in 2000 and many of the features of AD410 indicate vehicle is not capable. Never trust Amazon! Read every line of the actual page before buying anything from them!",
      "rating": 3.0,
      "verified": true,
      "author": "RPB",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "great product",
      "text": "This thing saved me hundreds of dollars .My service light went on so i took it to a shop they wanted $400 to fix it they said something about my piston rings.So i went on Amazon and purchased this unit.I had to wait a bit for the delivery because Amazon cut back on delivers during this pandemic.Well i received it and hooked it up .i got a misfiring code.Bought some spark plugs replaced them and on more service light .My truck is running great .total investment was like $60 bucks and an hour .So i am happy with this product .",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "... well for my needs and it gives me a better idea if there is a problem that is beyond ...",
      "text": "Have used it twice now and it works very well for my needs and it gives me a better idea if there is a problem that is beyond my ability to fix.",
      "rating": 5.0,
      "verified": true,
      "author": "PatrickF",
      "helpful_votes": 7,
      "publication_date": 20170824
    },
    {
      "title": "Might work for you.",
      "text": "I do not know how well it works. When I connected it to my 99 Silverado, it lit right up and then I received the message \"Unsupported Vehicle\". May just be a single-unit flaw. The description says it's compatible and a couple of YouTube vids showed it being used with same year-make-model. I have successfully used at least 3 other different scanners on my truck. The particular unit sent to me was anomalously flawed...?",
      "rating": 3.0,
      "verified": true,
      "author": "AvidAmazon'r",
      "helpful_votes": 3,
      "publication_date": 20190106
    },
    {
      "title": "Instant heart-attack/nightmare/headache relief",
      "text": "The dreaded CEL... when you do your own work on your car, this is the image that flashes in our minds in our darkest and most private moments. But this tool is a shining beacon of hope! Instead of worrying whether your car will blow up as you drive it to the nearest O’Reilly or wondering whether you need to veer off the road and call for a tow truck, just hook this thing up and assess your situation immediately. I keep mine in my glove box and it gives me peace of mind, I no longer have night terrors of the CEL",
      "rating": 5.0,
      "verified": true,
      "author": "Wouts",
      "helpful_votes": 3,
      "publication_date": 20180716
    },
    {
      "title": "Saved us from buying a car from crooked sellers!",
      "text": "This little machine saved us from buying bad cars! We would check the codes on cars we were looking at and be able to see that the seller had cleared the codes. We would not have known this without it! If you are looking for a used car, this is well worth purchasing!!",
      "rating": 5.0,
      "verified": true,
      "author": "Hookedongin92",
      "helpful_votes": 2,
      "publication_date": 20191110
    },
    {
      "title": "Rip off alert -This reader doesn’t work.",
      "text": "To start I would give it a 0 if possible. The reader doesn’t work. It doesn’t connect and says fail every time. Had a mechanic try it and the same results. Used another reader with no problem. Now I know you get what you pay for, but it should at least work. It is basically a paperweight. Save your money very upset that Amazon sells this garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "AnthonyRN",
      "helpful_votes": 3,
      "publication_date": 20200309
    },
    {
      "title": "Accurate For Good Price!",
      "text": "We've had a truck with a check engine light for about one week now. We installed the OBD into the port and it booted right up. The OBD had all the possible codes pre-installed and diagnosed it accurately. It was really easy to understand because of the large screen. Would recommend to anyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Grace Wilson",
      "helpful_votes": 9,
      "publication_date": 20171022
    },
    {
      "title": "$7 per use until the grey screen of death",
      "text": "I paid $43 for this reader and used it six times. Now it displays a grey screen every time I plug it in. It's two years old, so no chance for warranty service. Obviously, I don't use this very frequently, and I didn't expect professional-grade equipment. But $7 for each use is a little steep. This review would have been one star, but I threw in a second star because it did an okay job when it was working.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric M Johnson",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Very handy and valuable",
      "text": "this OBD scanner is affodable and works without complexity to mess with Bluetooth/WiFi. I do have one of those and when it works, it is great, but other times you are at a loss figuring out connectivity rather than the auto diag you are after. This one eliminates that issue by directly connecting to OBD Port. I was able to use this to determine the readiness for Smog test by scanning it after driving a bit instead of driving 100 plus miles to be sure and in the covid environment, driving just for sake for tests was useless. It has more features for live streaming and capturing results on a computer which I did not use yet.",
      "rating": 5.0,
      "verified": true,
      "author": "reviewag",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Works well",
      "text": "Nice item! Displays plenty of relevant OBD2 information, depending on the vehicle it's being used on. If the MIL light is on, this tool will tell you what area to begin looking at; if no MIL is on and the vehicle isn't operating correctly, just view the live data to determine what area is out of normal range. Plug it in with engine off and read information with key on, and live data with engine running.",
      "rating": 4.0,
      "verified": true,
      "author": "USA1",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Works as expected, rugged, solid value",
      "text": "Works as expected-- using mine primarily on a 2008 vehicle with 210,000 miles on the clock. It's thrown several different codes and this of course reads them fine. Have a P0420 issue (cat failure) that comes irregularly...sometimes after 50 miles, sometimes after 1,250 miles --so we keep this in the car to reset the dash light and clear the code. Easy to use and worked fine with all three of my Japanese vehicles, each a different make.",
      "rating": 5.0,
      "verified": true,
      "author": "Granite City Green Guy",
      "helpful_votes": 2,
      "publication_date": 20180728
    },
    {
      "title": "This works for basic to intermediate needs",
      "text": "This product is suitable for basic to intermediate troubleshooting of OBD2 codes. It give some decent data about the function of various systems on your car. Fuel Trim values, O2 sensors, temperatures, idle speeds, lambda values, MAF sensor values, and others. It certainly is NOT professional grade, but it will do the job for basic troubleshooting and even erasing check engine lights/codes. The graphing on this is not that great as the screen is small. It does not do split screen graphs as far as I can tell, so if you are looking at real time values for multiple parameters, the graphs all look jumbled together. Overall, I am happy with the purchase and the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Dave",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Very easy and fast to use.",
      "text": "Mine arrived looking like it was used, but very gently used. But still functioned perfectly. I suspect people use these to read and clear codes and then return them and since the packaging is a reclosable clamshell. But its cool, it works super easy and fast so I will keep this gem for only $45. I used it after a repair to see if my car was I/M ready for the inspection, with the push of 1 button the screen displays all that info and my car is good to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Stirwood",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Great product at a great price.",
      "text": "Great product at a good price. Displays live data with 02 sensor live stream and fuel trims. Love the option of being able to graph 02 sensor voltage. Helped diagnose a bad cat on vehicle. Very easy to use and loads immediately. Comes with I/M readiness monitor which is a plus. Would highly recommend the product. Worked on all my vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "Awesome product and easy to use!",
      "text": "I’ve had $100.00 Bluetooth enabled products that work with cell phones and they are hard to use, give limited info unless you buy more app features, etc. last one I had grew wing and flew across the street when it wouldn’t work. This product is perfect, great price and just easy to use. No apps to download, no connection issues and simply does what others try to do but fail.",
      "rating": 5.0,
      "verified": true,
      "author": "rmsilva07",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "$32.36",
      "text": "Was happy to catch this tool on a Lightening Deal for $32.36. Helpful even for non mechanics to get some idea on what's going on for maintenance and repair planning purposes, estimating costs and having a code for the auto techs to start with. The only ding is the instructions are all too typically made more difficult than makes sense. The basic information that should be in front following the plethora of obligatory warnings and notices then fundamental outlines of this unit is in the middle/back area instead of in any logical format. Still, highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "MC Ronson",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Simple and easy to use",
      "text": "We have 3 vehicles in our family, and with the help of the internet, these days we can do quite a number of simple repairs without the need of paying a mechanic. Sure, you can take your vehicle to National chain auto parts store and they'll pull the codes for free, but what if your vehicle won't start? The convenience of having this tool at home makes it a worthwhile purchase. A worthy investment for every car owner. We've used this tool more than once so far, and it has already paid for itself.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Enkers",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Don't waste your time.",
      "text": "Probably the worst product Ive ever bought on Amazon. Very cheaply made. After 10 attempts it finally turned on but then the displayed look like it was in Chinese. Then it never turned on again. Im a auto mechanic so I know how to use a code reader and this one is absolutely horrible . Buyer Beware!@",
      "rating": 1.0,
      "verified": true,
      "author": "Bart Alsbrook",
      "helpful_votes": 3,
      "publication_date": 20200423
    },
    {
      "title": "This gadget saved me money at the garage.",
      "text": "This unit analyzed my car's error code and told me what was wrong. The bad part was in a terrible place on the engine and I opted to take it to a mechanic who was quick to tell me that it could be several other things besides what this tool said was wrong. I insisted this item be changed first and that fixed my car. I am convinced the mechanic was setting me up for a much larger bill if I hadn't had confidence in this tool. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "pkwy117",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Settings FIRST before OBDII mode",
      "text": "So far has been accurate. I diagnosed my o2 heater sensor and misfire codes. Narrowed it down to the coil pack and saved me lots of labor costs. **So far only annoying thing is that you have to go into settings, then feedback, and turn this ON before it will READ codes. Otherwise if you go into OBDII mode right away, it will say \"unable to interface with ECM\" or something like that. You have to do this every single time you plug it in. Everything seems to work on it, even live stream data, it erased my codes since I did the repair and no more light.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Kraus",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Works how it should..",
      "text": "Great little inexpensive car code reader. Screen color is awesome, easy to read and easy to navigate. Reads all of the fault engine codes on my vehicles. Great for check ups and follow-ups. Works for me very well and it was a good buy. It it erases faulty engine codes or you can save them.",
      "rating": 4.0,
      "verified": true,
      "author": "Dom8",
      "helpful_votes": 2,
      "publication_date": 20180312
    },
    {
      "title": "Very disappointed",
      "text": "Tried to use this product on my 2011 Mini Cooper with no success. Company did not respond to my email requesting tech support. Very disappointed in this product",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Garvin",
      "helpful_votes": 7,
      "publication_date": 20180806
    },
    {
      "title": "This works great for me.",
      "text": "I find this code reader easy to use and a good buy. The reader came up with the same code as the repair shop. It's easy to use the functions and although does not give as much detail as a very expensive one like the repair shops use, it gives one a general idea of what is causing a problem. I'm happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ringztrue",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Did not work for me",
      "text": "After repair not able to reset check engine light, though it indicates complete. Took to local oil shop and they reset with there’s is under a minute for me. Waste of money if you ask me",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190105
    },
    {
      "title": "Pure and simple Chinese junk. I have three laptops ...",
      "text": "Pure and simple Chinese junk. I have three laptops and none would recognize the reader to do an update. I attempted to download the update file to no avail, the instructions are poorly written.....etc. I broke my own rule by going cheap and it bit me.",
      "rating": 2.0,
      "verified": true,
      "author": "Universal Exports",
      "helpful_votes": 5,
      "publication_date": 20180105
    },
    {
      "title": "Perhaps I got the crap out of the bunch",
      "text": "I read the reviews before I bought this product. Perhaps I got the crap out of the bunch. I received it today and I decided to go ahead and connect it to my computer via the usb cable that is included. As soon as I plugged it in the internal connector of the Ancel AD410 became dislodged. Apparently some bad soldering. Anyways the manufacturing of this product is cheaply made. Buyer beware... the electronic programming software may seem good but the hardware is cheap.",
      "rating": 2.0,
      "verified": true,
      "author": "Wolfgange63",
      "helpful_votes": 2,
      "publication_date": 20180804
    },
    {
      "title": "Product didn’t meet expectations",
      "text": "Product doesn’t work screen is blank my return/replacement window closed 7 days ago. Though today was the day I actually needed to use this... very disappointing I should be obligated to give a full refund for a product if it’s defeated!",
      "rating": 1.0,
      "verified": true,
      "author": "Bobbie Bonilla",
      "helpful_votes": 5,
      "publication_date": 20190207
    },
    {
      "title": "First, ALL communication is TO and FROM CHINA! ...",
      "text": "First, ALL communication is TO and FROM CHINA!! Many miss-spelled words in booklet. Seemed to work ok when connected to the car.. But would not talk to the computer for updates.. And trying to get help is ridiculous!!",
      "rating": 2.0,
      "verified": true,
      "author": "ScottBJ",
      "helpful_votes": 4,
      "publication_date": 20180508
    },
    {
      "title": "Does the job",
      "text": "Pretty basic unit, but reads and clears codes like it should. I have noticed on my Honda Pilot and Honda CRV when the temperature drops below zero overnight, (not 32 -zero) the engine check light sometimes lights up the next morning, This allows me to clear the code without visiting a repair shop.",
      "rating": 5.0,
      "verified": true,
      "author": "Maestro",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Manufacturer's website remains down",
      "text": "I suppose the product works just fine, but I'm unable to update the software which prevents me from downloading reports to the computer or updating the device. I'm also prevented from registering the product for warranty. I've to a few days left to see if this gets resolved before it goes back. Sorry, lack of support is a complete dealbreaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Bert Webb",
      "helpful_votes": 2,
      "publication_date": 20200923
    },
    {
      "title": "error codes correct on 2 Honda Fits and a Nissan Xterra so far",
      "text": "We bought this diagnose the check engine light that came on recently for our two Honda Fits and one Nissan Xterra. We got Mass air flow sensor errors on two of the vehicles, so are next going to clean the sensors with Mass air flow sensor cleaner which is also carb cleaner. Will update this in a week.",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Cheap",
      "text": "The system is confusing to use because it comes pre-loaded with tests that are labeled with random numbers and letters. I dont know what I'm testing! When youre checking a engine light the code is always more generic then if you got a good reader.",
      "rating": 2.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 2,
      "publication_date": 20200319
    },
    {
      "title": "Easy to use, very helpful. Didn’t bother with software upgrade....",
      "text": "I had a check engine light on my 2002 S2000 that I suspected was from a bad gas cap. Rather than pay $100 to have the dealer check the code, or rely on the availability of the guys at AutoZone, I purchased the Ancel AD 410. It took a few minutes to read the manual provided with the unit, and it was very easy to use. It quickly read the code, gave me the description of the problem, and erased the code for me, thus eliminating the check engine light! Worked great, worth the money. I didn’t bother with the upgrade, which was less than easy to use on the Ancel website. That needs to be fixed.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan A.",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Full color display is easy to read",
      "text": "Really impressed with this scanner for what it cost. Full color display is easy to read, you can check throttle position at idle, intake air temp, intake air pressure, coolant temp, ignition timing, and many other things. The biggest feature is probably that it gives you the engine trouble code, and what that code means. Buy with confidence!",
      "rating": 5.0,
      "verified": true,
      "author": "kyle gilbert",
      "helpful_votes": 4,
      "publication_date": 20170724
    },
    {
      "title": "Good bang for your buck.",
      "text": "Just received this so I'll be interested to see if it lasts as I've had bad luck in the past with other brand obd2 code readers that simply just stop working for literally no rsason. My first assessment of this particular obd2 code reader is that it works great out of the packaging. Looks to be constructed well and incredibly simple to use. Would definitely recommend it to others looking for a reasonably priced code reader, used it on my 99 jeep cherokee classic.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen M.",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Most features work",
      "text": "Bought this for live data stream and on-board monitoring. On-board monitoring shows a bunch of random characters for the type of test it is rather than things like \"Cylinder 1 misfire\". I have no idea what \"Component ID $OC\" , Component ID $07\" and so on mean. Updated to latest firmware and still didn't change.",
      "rating": 3.0,
      "verified": true,
      "author": "Travis Voth",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Recommend",
      "text": "Bought it as a Fathers Day gift for a friend who was looking for a used car (2 months ago). He has used it on every used car he looked at (I’d say 20) and absolutely loves it. He mentions it’s easy to read and understand. It not only tells you what the codes are but what they mean. I think it recommends on how to fix problems but not completely sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 2,
      "publication_date": 20190824
    },
    {
      "title": "EVERYONE Needs One of These.",
      "text": "I know VERY little about modern computer-controlled engines. And I hate when that annoying \"check engine\" light is on. This little reader will, FINALLY!, give you a clue as to what the ACTUAL problem is. The interface is fairly intuitive and, once you have the hang of it, easy to navigate. Also it has the ability to RESET the error codes so said annoying light goes off. But if the problem remains unaddressed the light DOES eventually come back on.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy Crockett",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Nice screen, though not touch screen. More features then I needed but it only cost a bit more then other basic models.",
      "text": "I am a very basic user of these devices. I had a small container detach from my air intake on my Toyota and it was running rough. P0171 code running lean. Thought it was the old gas I put in, turns out just the obvious issue under the hood. This allowed me to reset my check engine light and display the code without searching online for the description of the issue. Being that this is just a hair more then the 310 i figured the nicer screen would be nice to have. Glad I have one now in my tool kit.",
      "rating": 5.0,
      "verified": true,
      "author": "backwards1",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Great, saved me $ 300",
      "text": "Great, saved me $ 300.00. I connect as instructed, I got code P0108, that's for MAP sensor, amazon sell it for $ 48.00, for my car, I got it for $ 15.00 at the junk yard, installed, just 5 minutes or less and works perfectly. Very happy everyone should buy one.",
      "rating": 5.0,
      "verified": true,
      "author": "valpn",
      "helpful_votes": 3,
      "publication_date": 20171022
    },
    {
      "title": "Very happy with my purchase",
      "text": "Great product for the price, works as described with my 2000 Mitsubishi Montero Sport. Previouslyy, I had purchased one of the OBD II tester modules you connect to via your smartphone and it didn't work at all with my vehicle. This works perfectly and identified my issues, And it gives great real time data as well. Overall very satisfied. Only wish for improvement would be a way to save reports to the device for later download/print from my computer (right now I take photos of its screen for reference later).",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy Williams",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "If you like saving money, buy this.",
      "text": "Worth every penny! I used this to troubleshoot a problem with my car that my mechanic told me required a new catalytic converter. Using this tool and some online research, I was able to change the oxygen sensors and spark plugs. I didn't have to pay $90 to have him read and clear the codes. This tool is as simple as can be to use. Even Barney the dinosaur could use it. The instructions come in multiple languages so Barney hooked you up on that too. Of course, if you have more money than brains don't buy this.",
      "rating": 5.0,
      "verified": true,
      "author": "TMac2",
      "helpful_votes": 2,
      "publication_date": 20171222
    },
    {
      "title": "Accurate tester",
      "text": "Had trouble getting my pickup to pass smog. I bought this and hooked it up and drove the truck around to try and get all the test lights to pass. Turns out that two tests would not pass. Oxygen sensor and catalyst sensor failed. Took it to another smog station and they determined the catalytic converters where on the border line of passing. The F150 truck has seven converters and all had to be replaced plus oxygen sensor.",
      "rating": 5.0,
      "verified": true,
      "author": "bwrecondo",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "extremely easy",
      "text": "I have no experience with a car code reader before but find and fix an issue with my wife car in 10 minutes. it was very fast and easy. I like easy stuff. It's don't waste my time and health of my brain. It just saved me hundreds of dollars. I've been trying to fix my idle problem and all it needed was this tool. I would recommend knowing what you're doing as you could mess up your car. It worked great on 2011 Nissan Juke and my Jeep Wrangler.",
      "rating": 5.0,
      "verified": true,
      "author": "Maister",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Not that capable",
      "text": "Basically you can read codes, watch a data stream and graph no more than three points. Okay, that's decent, but I want to be able to watch long term fuel trim, short term fuel trim and all my o2 sensors. Be able to save that to my computer and review it at home. Sometimes its more useful to drive around and collect data. Sucks to have to fumble around with the device while driving.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel G.",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "Easy to use",
      "text": "I used it for the first time this weekend to read an error code on my 2009 Jetta TDi. It powered up immediately and was a snap to navigate. I was able to find the code online and fix the issue. It was a snap to clear the code after that. I then cleared a code on my 2002 Silverado that was saved when the OBD II fuse blew and the port wouldn't power the scanner. BTW, this is the 10amp CIgar lighter fuse and a common problem on this series GM trucks. I'm sure I'll find uses for it for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Schickie",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Incredible Value!",
      "text": "The only minor gotcha, the update worked, well once I downloaded it, from their website and ran the executable. All the other instructions are great. They even offer to explain trouble codes for your vehicle if you can't figure them out. Far cheaper than what the dealer wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "bill lawson",
      "helpful_votes": 2,
      "publication_date": 20180311
    },
    {
      "title": "It’s a nice looking reader",
      "text": "What I have issues with is that there’s an a way that they use for updates and I still haven’t figured it out. Did correspond with customer service but I still lost. Luckily I had found my old reader and went back to using it. I’m hoping my grandson can figure out how to update it so ha can use it. I do want to say that it’s a nice looking reader, just wish I could of figured out how to update it.",
      "rating": 3.0,
      "verified": true,
      "author": "Geo Eak",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Spend alittle more and a get better scan tool",
      "text": "Its a simple tool if you can get it started. For some reason some things was \"unsupported\" when running tests. I have 08 Mazda6 so i assume it needed a update. But no luck, it wouldnt update, it just sat there so i decided to return it and get the Bluedriver and im sad to say the extra money was worth it!! So in my opinion spend a little bit more it will definitely be worth your time. It also caught a problem that the ad410 didnt or couldnt detect.",
      "rating": 3.0,
      "verified": true,
      "author": "Qi W.",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "works as intended",
      "text": "i bought this after carefully looking at all the other obd2 code scanners and reading all the reviews , i found this to be very accurate in the review section , its very easy to use , does as it says , and fixed my wife's pt cruiser which had check engine light , diagnosed the problem and fixed , all sorted ...you cant go wrong with this scanner its very simple to use , has a lot of features , and other scanners cost a lot more but you wont need it ....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Easy to navigate with built-in product codes",
      "text": "It's my first time using this kind of product on my car, and this is an amazing product. I love the LCD screen with the easy guidelines. It's fast and easy to navigate, and very convenient to use. I would recommend this product to anyone who has a vehicle, as long as it's compatible. The best part about it is that this thing has a built-in code library so I don't have to go on google to search these things. I can just find out what's going on on the spot, which is pretty darn convenient. I no longer need to go to the car shop to find out what's wrong with my check engine light!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170813
    },
    {
      "title": "DANGER, DO NOT BUY !",
      "text": "Gives wrong data, Does Not Work as described ! infected my laptop with a VIRUS when updating. DO NOT BUY THIS !",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Controls",
      "helpful_votes": 4,
      "publication_date": 20190126
    },
    {
      "title": "7.3L diesel trucks not supported",
      "text": "it plugs-in quickly but it did not work on my 2002 ford power stroke 7.3L diesel. even though it says that it is supported. it did not show the 2 codes that were identified later by a mechanic's scanner.",
      "rating": 2.0,
      "verified": true,
      "author": "FetvusForTheRestuvus",
      "helpful_votes": 2,
      "publication_date": 20181030
    },
    {
      "title": "Not worth the money",
      "text": "This is supposed to be a updated version. Blank screen, Website sucks, tried to update, no such luck. Not made in America is the problem. No support, cannot talk to anyone. Returned it, useless, third scanner ordered. none are worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "LAH",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Nice unit",
      "text": "Fairly easy to use and does the job. I like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Walt N",
      "helpful_votes": 2,
      "publication_date": 20190826
    },
    {
      "title": "JUNK",
      "text": "Dislike , functions that are downloadable cannot be accessed for use. Odometer correction function listed is not present for use.-- Does not do want is listed by Amazon. No customer service by manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200704
    },
    {
      "title": "Highly recommended",
      "text": "Good tool to have if you want to read engine codes and do an emission system trouble shooting. I’ve used more advance scan tools (vehicle manufacturer specific & universal scan tools) but I keep one of this as a personal quick tool to use on my personal vehicles. I used this one time to verify if my O2 sensors are working properly and trouble shoot the emission system on my vehicle pretty accurately. I work on my own vehicle, but if you usually take your vehicle to automotive shops for repairs, most of the time you can use this to verify what your vehicle really needs.",
      "rating": 5.0,
      "verified": true,
      "author": "mechanic",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Does what it's supposed to do.",
      "text": "Had just past the warranty period, used it 2 times now its dead... Not pleased. Update and apologies, it's basic but it's working fine. My vehicle had a blown fuse that killed the obd2 port..",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great product.",
      "text": "I had a 2001 Chevrolet Silverado that had a major (it seemed) engine problem. I was thinking hundreds of dollars in a mechanics pocket. I plugged in the AD410 and it said the camshaft position sensor was at fault. I replaced the camshaft sensor and deleted the fault code. This truck hasn't run this good in years. Thank you Ancel.",
      "rating": 5.0,
      "verified": true,
      "author": "David Flanigan",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Gets the job done!",
      "text": "I received this a couple days ago and I was so excited to try it out. All of the OBD features worked as expected and I was very quickly able to determine why my check engine light had gone off and that my Civic had an issue with the VTEC transmission. Though this was crappy news, my local Honda dealership was able to fix it within 24 hours :) I don't know much about cars, but my friend recommended getting one of these and I'm glad I went with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 3,
      "publication_date": 20170817
    },
    {
      "title": "Works well but lame support would not buy again.",
      "text": "Works good was not able to up date because the web site is so lame no instructions come up wen you connect it to the usb anyway it's cheep and works well as is but I am in the market for a better one I would never buy from cancel because updates are a must on top of the line ones they would not return my emails so rain on them I'll buy a better one some were else.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Computer drivers don't work because catch-22 in loading them from the device.",
      "text": "It works well when plugged into vehicle. It doesn't communicate at all with the computer, neither with Win7 nor with Win10. Result is that it can't be updated.The difficulty is that the Win drivers come on the device, but the device won't communicate unless the drivers are loaded. And neither Win7 nor Win10 were able to find either generic or specific drivers elsewhere.",
      "rating": 3.0,
      "verified": true,
      "author": "William Crocca",
      "helpful_votes": 5,
      "publication_date": 20180413
    },
    {
      "title": "Not as good as the $20 scanners",
      "text": "The user experience wasn't intuitive at all and I felt like the scanner didn't perform any better than a cheap $20 plug-in scanner. Unfortunately, my return window has passed so I can only pass on advice: save your money and don't buy this.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather G.",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Recommended by Scotty Kilmer is almost an automatic 5 stars",
      "text": "I bought this scan tool because it was recommended by Scotty Kilmer. He's a super honest and knowledgeable mechanic on YouTube and he said this is the scanner to buy for guys looking to just read common codes and see if a car will pass smog, stuff like that. Works great, even if the interface is a little clunky.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Best for budget!",
      "text": "Best tool that I have bought in a very long time. I have not used it on a car OBD 2 yet that it wouldn't read. It has saved my butt a couple times already. It's very handy to have if your looking to buy another car. Even if the car has no engine light on it this little device will uncover any thing hidden that might be hidden. If a code has been cleared it will tell you.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Already save me a bunch of time and money",
      "text": "It's nice not having to go to the auto parts store to have your codes checked. Once you have performed your repair you can clear your code at home instead of going to the auto parts store. These days the rookie's that don't have a clue won't erase your codes. they claim it will damage your computer. I was tired of these no nothing behind the counter parts locators diagnosing my service engine light.",
      "rating": 5.0,
      "verified": true,
      "author": "RICHARD HUMPHREY",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Pretty decent for the amateur mechanic",
      "text": "I am very satisfied with this tool. Initially, however, I did not think it was worth a darn. Takes some “tinkering” to figure out all the functions. Recommend sourcing a manual online? Very helpful feature: can monitor live fuel and O2 sensor function. Clears codes. Has code lookup feature, by vehicle make. Pretty decent, for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "You get what you pay for.",
      "text": "I want to love this scanner, it does what it says it will. It's just so cheaply made, the pins came slightly bent and took some working with to get a proper fit and the housing feels so thin and brittle its definitely not meant for a shop.",
      "rating": 3.0,
      "verified": true,
      "author": "John ",
      "helpful_votes": 2,
      "publication_date": 20180503
    },
    {
      "title": "Had to download RAR opener file  from app store to extract file  for updating.",
      "text": "Instruction manual hard to follow and printing to small. Would have liked more step by step instructions. Learned more about how to operate using u-tube. More information on updating and WinRAR files would have been useful. Had never heard of RAR extact file before. Unit is built well when you learn to use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard K.",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Saved me so much time and money.",
      "text": "This code reader is amazing. Works great with my 2010 Toyota Corolla Within minutes I was able to read the code causing the check engine light on my car, which ended up being just an old gas cap I replaced for $5 through amazon. Once I got a new gas cap, I was able to clear the code and the check engine light went away. Some of the features did not work with my car, like some of the sensor tests, but that is not an issue with my code reader, more so my vehicle. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Penafiel",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Worked on my vehicle and prevented a $200 repair",
      "text": "I wanted to turn off a check engine light without disconnecting the battery, which causes lots of problems. This tool did that with just a few presses of the buttons. The check engine light has never turned back on again, so I feel like this tool saved me a $200 dollar repair for what seems to be an accidental or unneeded triggering of the check engine light.",
      "rating": 5.0,
      "verified": true,
      "author": "Kira",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Functions well when you pay attention to what you're doing",
      "text": "It does a good job of reading realtime data at a respectable refresh rate. It has a good database of codes that match with the manufacturer of your car for accurate scans. The reason I docked a star is mostly because of a UX problem that I experienced. The I/M button (Emissions check) is where you would expect the enter button to be, and I accidentally opened it and lost my place in the menu on many occasions. I'm used to it now, but it was an annoyance at first.",
      "rating": 4.0,
      "verified": true,
      "author": "DannyM93",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Best tool for the money!",
      "text": ".Easy to use/comprehensive diagnosis of vehicles systems .Universal code/manufacturers compatible .Very nice build quality of my unit I'm a Technician in college and I honestly dont know how I've never bought one before. I keep this tool in my car at all times now to clear my check engine lights on my \"fleet\" of vehicles. Thus far worked great on my 96 Saturn Sl1, a 98 ford ranger, and a 99 Acura TL. Diagnosis info can be recorded,reviewed, and even exported to a PC. Software is updateable which is more than a plus 👌",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20181225
    },
    {
      "title": "Works Okay, No ABS or SRS Codes",
      "text": "Have used it a few times. The display is a bit lackluster and somewhat vague once you drill down from the home screen. In fact, I thought something was wrong with it due to the ambiguous appearance of the screen, but it seems to work okay. It does not read any ABS or SRS codes.",
      "rating": 5.0,
      "verified": true,
      "author": "Engineer, Deep Thinker",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "good features",
      "text": "shipped very fast,used amazon prime, packed nicely in the box, very good instructions on how to use all the features,good price, I checked all web pages,also can down load up grades as needed, I tried it ,does what its suppose to do, and very easy to read all theinput of the vehicle. Works better then the other higher expensive ones that I have use and made if good caseing...",
      "rating": 5.0,
      "verified": true,
      "author": "joe bag of donuts",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "updating forget Russian software",
      "text": "easy to use but updating is impossible you have to download Russian firm ware and reader to update Kaspersky security would not let it on my computer so I ditched it",
      "rating": 4.0,
      "verified": true,
      "author": "Roy I Jones",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Nice reader.",
      "text": "Very decent reader. I was looking at these for a while & decided on this one for the color screen & functionality. Super easy to use. General Googling will help you understand the codes & it pulls codes the reader I returned to Auto Zone didn't. Easily clears codes as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Hype",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Great for the price",
      "text": "Pretty awesome. It reads/clears codes and gives you realtime diagnostics of what's going on with your sensors and engine. Well worth spending the extra money versus getting just another code reader. You might say you'd never need that stuff but when you have sensors failing it's good to know which one before you take it to a mechanic. It's going to save me over $100 since I know exactly which sensor is out without having to take it to a mechanic.",
      "rating": 5.0,
      "verified": true,
      "author": "Really a person!",
      "helpful_votes": 0,
      "publication_date": 20170906
    }
  ],
  "product_meta": {
    "title": "ANCEL AD410 Enhanced OBD II Vehicle Code Reader Automotive OBD2 Scanner Auto Check Engine Light Scan Tool (Black/Yellow)",
    "rating": 4.5,
    "feature_bullets": [
      "WIDE COMPATIBILITY - Recommended by YouTube Star Scotty Kilmer on his channel.Works on most vehicles sold in the USA with model year of 1996 or newer. Displays in English, German, French, Spanish, Finnish, Dutch, Russian, and Portuguese; Requires no battery or charger as the unit gets power directly from the OBDII Data Link Connector in the vehicle.",
      "CRITICAL FUNCTIONALITY - Reads quickly and erases stored emission-related codes, pending codes, and shows code definitions. Turns off the MIL (check engine light), helps in resetting the monitor before taking it to Smog, and tells you what is going on before bringing the car in for repair.",
      "ENHANCED OBDII DIAGNOSTICS - Supports O2 Sensor and EVAP (Evaporative Control) System Test. AD410 code scanner can be used to initiate a leak test on a vehicle's EVAP system by monitoring the integrity of the fuel tank system. The O2 Sensor Test is designed to monitor and adjust air/fuel mixture, which will help identify and troubleshoot issues related to fuel efficiency and vehicle emission.",
      "QVGA DISPLAY & NEW UI - AD410 code reader is a greatly enhanced upgrade from more basic diagnostic scan tools. It has a 2.4\" TFT true color (262K) LCD display for clear test results showing. With an easy-to-read UI design, the user can easily access Setup, OBDII Diagnostics, I/M readiness, and DTC Look-up and Review. You don't need to read the manual to know what to do, even for a beginner.",
      "DIAGNOSTIC REPORTS & UPDATE - The \"Review & Print\" option can be used to save or print diagnostic reports as needed. ANCEL brand provides life-time free software updates for this unit to fix the latest bugs or add new parameters. Just download the software from the ANCEL website and then follow on-screen instructions to install. SAVE 99% on ANCEL EVA BAG for AD410 OBDII SCANNER when you purchase 1 or more ANCEL AD410 OBDII Scanner offered by ANCEL."
    ],
    "specifications": {
      "Manufacturer": "ANCEL",
      "Brand": "ANCEL",
      "Model": "AD410",
      "Item Weight": "12 ounces",
      "Product Dimensions": "9 x 6.3 x 1.6 inches",
      "Item model number": "AD410",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "AD 410",
      "Folding": "No",
      "Cover Included": "1 * User Manual, 1 * AD410, 1* USB Cable",
      "Voltage": "12 Volts",
      "ASIN": "B071FSNL73",
      "Customer Reviews": "4.5 out of 5 stars2,256 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#1,203 in Automotive",
      "Date First Available": "June 1, 2017"
    },
    "categories": [
      "Code Readers & Scan Tools",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Diagnostic, Test & Measurement Tools",
      "Automotive"
    ],
    "price": 44.99
  }
}