{
  "website_summaries": [
    {
      "verdict": "These shirts are designed for maximum comfort and sun protection, and they're so affordable, you can buy more than one.",
      "pros": [
        "Available from medium to 3-XL",
        "Lightweight, moisture-wicking fabric",
        "No-tag collar",
        "Flat seams reduce chafing",
        "Relaxed fit allows full range of motion",
        "Fits true to size"
      ],
      "cons": [
        "Some users have found that the shirts stain easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Maybe works in temperament climate...",
      "text": "Did not work, at least in Oahu, Hawaii's fierce sun. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "S Wong",
      "helpful_votes": 224,
      "publication_date": 20190422
    },
    {
      "title": "100% AS ADVERTISED! Protective and cool!",
      "text": "I bought this for my 50 yr old son who has a lawn service, and obviously, in the sun A LOT! I gave it to him yesterday. He was not particularly thrilled about the long sleeves but said he’d try it. He put it on and went about his work day. He texted me this morning asking me to order ANOTHER one! He normally wears an XL. I ordered a XXL. He liked the little bigger fit than normal making it easy to work in and no clinging. He liked the coolness.....better than sun hitting bare arms and no sunscreen. HIGHLY RECOMMEND!",
      "rating": 5.0,
      "verified": true,
      "author": "Loni",
      "helpful_votes": 96,
      "publication_date": 20180707
    },
    {
      "title": "Works Great - even at lower latitudes!",
      "text": "This works great We went on a Caribbean cruise (Mexico, Jamaica, Cayman Islands) and my husband took this shirt to avoid getting burned. It worked like a CHARM. He is normally as red as a lobster, no matter how much sunscreen he uses. This time the only thing that burned a little was the backs of this hands since the shirt didn't come down over them, lol. He has an old UPF 50 shirt from REI - maybe they lose the sun protection over the years because the day he wore that one he burned a little through it... this one didn't let anything through! Very happy with the product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "AReader",
      "helpful_votes": 87,
      "publication_date": 20180524
    },
    {
      "title": "Lightweight",
      "text": "This shirt lived up to everything that the seller advertised. It is extremely lightweight and wicked perspiration. It kept me cool in the heat and warm in the cool night air of Southern Africa. I will definitely buy more of these in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick M. Newman",
      "helpful_votes": 67,
      "publication_date": 20180117
    },
    {
      "title": "The fit was very good. I'm thick around the middle / belly at ...",
      "text": "Got this for trip to Hawaii, and it worked very well to keep me from getting too much sun. The fit was very good. I'm thick around the middle / belly at 6'1\", 240lbs, normally wear dress shirt with 35\" sleeves, and the XL fit great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth R. Myers",
      "helpful_votes": 75,
      "publication_date": 20170807
    },
    {
      "title": "Indestructible and Great Quality",
      "text": "This his favorite work shirt. It keeps him cool in the Arizona sun and protects him from the sun as well. A spark from a grinder caught his outer shirt on fire, this shirt didn't melt, singe or burn, saving him from potentially severe burns.",
      "rating": 5.0,
      "verified": true,
      "author": "Tombstone",
      "helpful_votes": 43,
      "publication_date": 20180613
    },
    {
      "title": "But it is perfect. Fits really nice and seems to be the ...",
      "text": "This shirt is way nicer than I expected. I had a sun blocking shirt I bought from a surf shop a while back which of course has fishing images on it. I wanted something plain since I'm not a fisherman and want to wear this other places than the beach. For the price, I didn't expect much. But it is perfect. Fits really nice and seems to be the same quality as the $50 shirt I had previously purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Roberts",
      "helpful_votes": 15,
      "publication_date": 20180413
    },
    {
      "title": "Horrible fit",
      "text": "I don't know who this shirt is supposed to fit. I wear either medium or large in most shirts. I heard this shirt ran large so I ordered the medium and the sleeves went down to my fingertips. It looked more like a night shirt and was extremely thin and loose. I sent it back. I had hoped to wear the shirt under my regular shirt for golf but there is no way that I could swing a golf club with the excessively long sleeves.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190617
    },
    {
      "title": "Awesome Shirt that Protects",
      "text": "I bought this shirt because I sunburn easily and and have many things cut off my skin from almost melanoma. If it wasn’t for this shirt on our cruise and shore excursions to Cozumel, Belize, and Honduras I would’ve sunburned and probably had more things cut off my skin. Now its a little hot but it saves your skin and no sunburn. Fits nicely!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas W Huebner",
      "helpful_votes": 12,
      "publication_date": 20180729
    },
    {
      "title": "this is medium now?",
      "text": "down past my crotch and over hands. wth. Im a dead on medium at 39\" chest on all the shirts I have. whats with sizing on these so large? I dont want a skirt, and as a sports shirt I dont want to tuck it in- an that would be a massive amount of tucking as long an baggy as this thing is. I give up- Im just not ordering online anymore, with this sizing ridiculousness. NO, Im not going to exchange for a small- I give up. returning an going to a store.",
      "rating": 1.0,
      "verified": true,
      "author": "amazon customer",
      "helpful_votes": 5,
      "publication_date": 20200215
    },
    {
      "title": "Sleeves are very long and color is not light green",
      "text": "Sleeves are very long. Color is NOT light green more of a very light beach blue. Not a bad color but if you were expecting a light green this isnt it. Otherwise the shirt feels great on. Would it stop me at this point from buying another? Probably not. I will let you know after I test the sun protection. Then I nay or may not order another. I have a blue one coming as well. I wonder what color it will really be?😂",
      "rating": 1.0,
      "verified": true,
      "author": "Ruger's&Ellie's Mama",
      "helpful_votes": 4,
      "publication_date": 20190616
    },
    {
      "title": "Great shirts for my line of work",
      "text": "The material of these shirts are light, breathable, and offer great protection from the sun. I am a mail carrier and work outside from 8-9 hours a day. Sweat is hardly noticeable on the shirts. I have at least 6 of these shirts I rotate throughout the week. I mainly wear the multi colored shirts with the logo on the chest. I purchased the gray shirt with the Baleaf logo going up the arm, those are nice too. If I’m not wearing my UV protective sleeve I’m wearing these shirts.",
      "rating": 5.0,
      "verified": true,
      "author": "J.R",
      "helpful_votes": 2,
      "publication_date": 20200610
    },
    {
      "title": "Runs Small. Material Feels Like Plastic",
      "text": "I'm returning this item. Two positives: The slate-green color looks nice and the sleeves were plenty long enough for me (I'm 6'3\"). Two negatives: The sizing is off -- too tight around the torso and the fabric has no stretch to it at all. Normally a size XXL leaves me plenty of room, but not with this shirt. It's slim-fit for sure. May be fine for super thin buyers. Also, the feeling of the fabric on my skin is \"icky\" -- almost like wearing a plastic bag instead of a comfy shirt.",
      "rating": 2.0,
      "verified": true,
      "author": "Photo Brad",
      "helpful_votes": 3,
      "publication_date": 20190705
    },
    {
      "title": "Excellent Sun Protection",
      "text": "Long sleeve, Light blue, XL size. Shirt fit just a bit larger than expected but I actually liked the looser style for this. Comfortable, light, soft, breathable material that looks and feels high quality. Nice shirt design overall; looks great on. Kept me cool, wicks away perspiration yet dried very quickly after swimming. Elasticity of the material kept it from hanging/dragging down when soaking wet. Bottom line: I used no sunscreen whatsoever as a test - 5 straight hours in the hot summer sun - zero redness or burns. Excellent value and quality for this very fairly priced shirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyle M. Back",
      "helpful_votes": 2,
      "publication_date": 20190811
    },
    {
      "title": "I live in New Mexico and spend a lot of ...",
      "text": "I live in New Mexico and spend a lot of time in the intense sun. This shirt is very effective at preventing sunburn, and you don't have to worry about reapplication of sun screen. The nicest thing is it actually feels COOLER than bare skin. Sure- it insulates you a little bit, but the white color reflects far more heat than the minimal insulative value retains.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam L.",
      "helpful_votes": 5,
      "publication_date": 20180604
    },
    {
      "title": "Green river/ Canyonlands tough....",
      "text": "These shirts just spent a week on the green river in Canyon Lands NP with my Boyscout of a son. He used each shirt 3 days each and besides needing a good wash they held up great. The material prevented him from burning even though they were in direct son on the water for 6 days straight. He felt they kept him cooler than not wearing them due to there wicking ability and how fast they dried. He camps twice a month and will be using these so we will update how they wear as we go along.",
      "rating": 5.0,
      "verified": true,
      "author": "Ollbuster",
      "helpful_votes": 3,
      "publication_date": 20180803
    },
    {
      "title": "Couldn't find a good fit",
      "text": "I wear between a medium and large so I went with a large to start with since my other UPF shirts seemed to run a little small. The large was too big in the chest and waist, but was great in the arms. I returned them for mediums hoping the arms were similar. Unfortunately they were not. The mediums while they fit in the chest and waist well, were too tight and too short in the arms. One of the mediums was closer to a large than a medium, but too big in the waist and chest again. Soooo I won't be buying these again. Too bad.",
      "rating": 2.0,
      "verified": true,
      "author": "trip",
      "helpful_votes": 2,
      "publication_date": 20200123
    },
    {
      "title": "Small",
      "text": "The shirt does fit, however it is not true to the size that I ordered. Every shirt I have ever bout in XXL has fit the same, but not this one. I'm a big fella and so I ordered an XXL, but the size fit much more like a XL--I was really hoping for a slightly loosely fitting shirt for fishing. I ordered two and both came in good shape but the size is uncomfortably small. The shirt is nice quality--although I cannot say I have REALLY used it yet. If you do order, order one size above your regular if you want it to fit comfortably.",
      "rating": 2.0,
      "verified": true,
      "author": "Mongo",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Quite thin, but does the job its meant to!",
      "text": "Great color, super light weight. My fiance wanted it for a half day ocean fishing trip he went on this past weekend in San Diego. I laughed when he put it on because it is quite thin, so beware- it shows off everything! Hard nipples, chest hair, any sort of belly bulge lol. He didn't care and felt comfortable in it- no sunburns! But if you're self-conscious at all maybe not the light teal color he chose.",
      "rating": 4.0,
      "verified": true,
      "author": "Catrina",
      "helpful_votes": 5,
      "publication_date": 20180924
    },
    {
      "title": "Met expectations for the price",
      "text": "I may buy another one. It's pretty basic - synthetic fabric that blocks the sun, sown together in the shape of a shirt. But it fits reasonably well for me (athletic 160lb, 5' 9\" and bought a medium) and quality is good, but not outstanding, for the price point. The seams are exposed enough to catch on velcro as I discovered. The sunblock feature works very well, which was the main reason I bought it - if I can get 1 year of racing out of it I'll be happy. ...about as expected, but nothing special, so 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen R. Erbert",
      "helpful_votes": 2,
      "publication_date": 20190509
    },
    {
      "title": "Wow Nice Comfortable shirt. Quality Yes",
      "text": "First off so far, very comfortable, soft, seems High Quality. Today breezy day, walked felt nice breeze on my arms. I’m ordering 3 more . Two 1 size smaller for a perfect nice fit . Go with your exact size. I went 1 size larger to let it have room all over. Plus the sleeves will be longer to cover top part of Hans in sun. Two more I’m getting will be exact size to go out with. Will update when temperatures are a bit hotter and no breeze. Thank you all for taking time to read this review. Hope I helped with my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Lewis",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "It saves your skin from the sun's worst.",
      "text": "I bought a pair of these shirts to wear during the day while touring the pueblos and canyons in New Mexico. The price of replacing my Travelsmith sun shirt was just too costly in comparison. Using sunscreen only on my hands and above my shoulders, I made it through the week with no sunburn or redness whatsoever. Back in Florida, I wore one during a noon visit to St. Augustine's beach and picked up no pink. They are very comfortable, just a tad roomy, which I like. I'll ask the company to consider a few more colors, including gray or heather, dark green, and wheat.",
      "rating": 5.0,
      "verified": true,
      "author": "LarryAt27N",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Lightweight with sun protection",
      "text": "Both of my arms are sleeved with tattoos which I like to protect against the sun. I hate wearing sunscreen cause of the mess,stickyness and smell so I have 5 pairs of these shirts which I wear for work or when I'm hiking. They're super light and breathable but have the upf 50 protection. I'm 6ft and 195lbs with an average build and these shirts fit perfect. I'd say like in the middle between loose and fitted. I wash them in cold water and air dry and they haven't lost their shape or shrunk one bit. I'd definitely recommend these if you hate sunscreen but still want sun protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "No quality control",
      "text": "Left sleeve was 4 inches shorter than the right sleeve. Otherwise not a bad shirt. Returning to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Peripatetic",
      "helpful_votes": 7,
      "publication_date": 20190202
    },
    {
      "title": "Extremely comfortable base layer with protection",
      "text": "I am really pleased with this purchase. The shirt fits true to size. It is so comfortable and has become one of my favorite shirts. It is thin enough to wear under a shirt/sweatshirt or on its own yet thick enough to protect against the wind and cool air. I like it so much I plan on finding and buying multiple short-sleeved versions for the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "AZ Guy",
      "helpful_votes": 4,
      "publication_date": 20180306
    },
    {
      "title": "Page says IMPORTED.  Shirt says:  Made in China.",
      "text": "The shirt is OK. But we aren't buying things made in China any more. The listing did a great job of hiding the country of manufacture. Would like to return but apparently being deceived or trying to buy American doesn't count.",
      "rating": 2.0,
      "verified": true,
      "author": "Pauken Player",
      "helpful_votes": 2,
      "publication_date": 20200504
    },
    {
      "title": "Great value for sun protection.",
      "text": "I wear these for hiking and mountain biking. Great sun protection, wicks moisture well and breathes just fine. Fit is a little tight for me, ( XXL- I have 52 inch chest, 18 1/2 neck with a 38 inch waist, my dress shirts are custom made so off the shelf seldom works) These are a great value. Don't underestimate sun protection. I had a melanoma removed on my forearm that was about 3/16\" round. My scar is 3 inches long-skin cancer is no joke.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierraconservative",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Did not fit well",
      "text": "Bought an extra large and it fit ok but the shirt had no give. Material didn’t feel as elastic as others shirts I’ve bought. Sleeves were also tight. Was not able to pull them past my forearm. Will be returning this item and will be looking for something better.",
      "rating": 1.0,
      "verified": true,
      "author": "Rey719",
      "helpful_votes": 2,
      "publication_date": 20190811
    },
    {
      "title": "Very good product and value",
      "text": "This is a really sharp looking shirt and does as advertised. Working outside all day in 100 degree heat challenges this shirt however, it came through in flying colors. It seems to evaporate away moisture faster than cotton tees and this has an enhanced cooling effect. It also keeps the arms from getting fried to a crisp. Very good product and value.",
      "rating": 5.0,
      "verified": true,
      "author": "JWise",
      "helpful_votes": 2,
      "publication_date": 20180712
    },
    {
      "title": "Excellent Quality Shirt",
      "text": "I ordered these for my husband to be used when he is outside cutting grass, gardening, etc. for protection from the sun. He usually wears a size XL, I ordered these in L because some of the reviews send they run a little big. The L fit him very well, he could also have used the XL for a little extra room in the shoulders. So depending on the need, you could go between sizes. The colors were beautiful, Dark Blue and Deep Gray. The quality was very good, looked like an expensive shirt from the popular sporting goods store. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "rubyrose",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Kept me comfortable and sunburn free in Death Valley!",
      "text": "Great shirts! I ordered two of these for hiking around Death Valley. I just got back and couldn’t be happier. Very soft, comfortable, and seemingly durable material. Blocked the sun wonderfully. I was out all day with no sunscreen and no problems. The fit was good. I’m 5’11 160lbs and I hate baggy clothes. I ordered medium and they were a little looser than my usual fit, but that’s what I’d want in a shirt like this. Also, I have long arms, and long sleeve t shirts rarely work for me, but this had ample arm length even in the medium. Couldn’t be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "This really works",
      "text": "I bought this shirt for my son’s and we were in 114° heat and no one, I mean no one got burned as long as they were wearing this shirt. This is an expensive, great price, and did exactly what it was supposed to do. I am so pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo A Rivera",
      "helpful_votes": 4,
      "publication_date": 20190717
    },
    {
      "title": "Good for women wanting loose fit",
      "text": "This lady wanted a loose fitting UPF shirt to wear over my swimsuit. Size 14, and should have ordered a man's medium vs x-lg. Good news is it's long sleeves protect my hands which is good for Aqua Spinning and Water Zumba. I'm going to cut a hole in the sleeves for thumbs to peak out to hold sleeves.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda 1",
      "helpful_votes": 3,
      "publication_date": 20180711
    },
    {
      "title": "A little tight",
      "text": "I'm 6'03, 250lbs. Not overly muscular, but I have a little extra weight around the waist. The XL is a little short in the sleeve length and a little tight around the waist. I'll most likely return for an XXL. Shirt appears to be good quality, as far as sun protection I can't comment until I get a bigger size. If the XXL works out I will be purchasing additional colors and styles. UPDATE - Ordered the XXL - worked out great. Ordered 2 more - different colors. Would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Realistic review",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Four Stars",
      "text": "Great looking shirt, on the small side for a 3X",
      "rating": 4.0,
      "verified": true,
      "author": "Brent Taylor",
      "helpful_votes": 9,
      "publication_date": 20180527
    },
    {
      "title": "This shirt keeps him cool and covered so that he doesn't fry his skin",
      "text": "Bought this for my husband while he was working in the summer sun paving roads. This shirt keeps him cool and covered so that he doesn't fry his skin. Love the color on him and he gets so many compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonni",
      "helpful_votes": 4,
      "publication_date": 20180521
    },
    {
      "title": "Great quality and incredible softness.",
      "text": "Amazed by the quality of this shirt and soft breathable material. Others I have found at the store have been breathable but itchy and rough material. This shirt is excellent and great for work, if you work in a hot environment. Will be purchasing more! I highly recommend! Also true to size!",
      "rating": 5.0,
      "verified": true,
      "author": "Billie",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Fine for an inexpensive shirt",
      "text": "I bought this primarily for my mountain bike rides in the Texas heat. In the woods, it could breathe a bit more, but spraying a little water on my back seemed to somehow increase the coolness, so I recommend doing that. It worked better in the open if there was a breeze, even in direct sunlight. Used it at the beach also and was happy with it. Clung when coming right out of the water, but if you squeeze out the excess, it stops clinging after a few minutes.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Whitson",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "One year later - Fits like it did when I bought it.",
      "text": "I've got a dad bod, I admit it. I don't want to wear anything too tight cause I don't have the 32\" waist and 48\" chest of yesteryear. This fits well without being too clingy. The sleeves fit well without being too snug or flapping in the breeze. The only thing that sucks is that I look better in it than out of it. ;) Considering the price, it's much better than any I've bought from major companies with marketing and logos that some people like to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "KenInNC",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Short and stocky - large size fits great",
      "text": "UPDATE: I ordered the long-sleeve polo version of this shirt, large size -- too tight in the chest and waist. Returning it. I'm 5'7\" 195 lbs., broad shoulders -- stocky. For shirts this puts me between a large size (often too tight at chest, shoulder and waist, but the right length) and extra large (good upper body fit, but too long and baggy). I selected large for this shirt based on the sizing chart, and it fits just right all around, not too long. I plan to golf in the sun and heat with this long-sleeve shirt tomorrow. Just ordered the polo version, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Doetsch",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Great fit, great product.",
      "text": "I can't think of anything I dislike about this product. Used once at the beach on a mostly sunny day. In the sun several hours with no sunscreen on my body that is covered by the shirt. At the end of the day I felt a little warm but no noticeable sunburn. I bought 2 of these shirts and glad I did. These are perfect for yard work too. The shirt breathes and is comfortable. I'm 5'10.5\" and my arms are long. The large shirt was a great fit and the bottom came down slightly passed my waist.",
      "rating": 5.0,
      "verified": true,
      "author": "bigguns68",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Right now I look like a redneck raccoon",
      "text": "For the money, you cant beat this shirt. I am an avid fisherman and it as been over a 100 degrees where I live lately. Today I went out on a lake in a boat for 8 hours. Right now I look like a redneck raccoon, but this shirt kept me cool and dry with no damage from the sun. I would buy this shirt again and as a matter of fact I'm going to get another one with short sleeves. shipping was fast and the fit was great for me, not tight and loose fitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Freeyourmind",
      "helpful_votes": 3,
      "publication_date": 20180707
    },
    {
      "title": "Good sun protection and dries fast - fitting notes in review",
      "text": "For size reference: I am 5'10\", 180lbs, wear a 16.5\" x 35\" slim dress shirt, usually a 42-regular jacket/ sport coat. I bought the Large size Baleaf shirt and I am pleased with how it fit for swimming and water sports. I usually get itchy sun-rash and burn easily while on summer vacation where we swim, boat, and waterski daily for a week. This shirt protected me from both issues, and was comfortable to wear, it was not skin tight on me, and dried quickly between swims. I would definitely buy again. Best wishes",
      "rating": 5.0,
      "verified": true,
      "author": "RickZ",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "THIS is a fantastic, even sexy shirt. I love it!",
      "text": "This is an absolutely super shirt. Love the \"Right On\" US military color, and it fit me as if it were made just for my use. Even better, and VERY clever - hey, BRILLIANT - packaging, it arrived in a smart, durable plastic zip lock pouch. I love it! I was not expecting this, but it feels and looks, well, let's tell it like it is - VERY sexy. Smooth and fabulous. All of that is why after I'd purchased one, and received so many positive comments, I immediately ordered another one.",
      "rating": 5.0,
      "verified": true,
      "author": "John Clayton",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Fits, and looks great, and you gotta love that 50 SPF rating!",
      "text": "So many sun-blocking articles of clothing have plain-Jane colors, and they feel artificial and breathe poorly (like the earliest versions of polyester clothing), or they simply don't block the harmful sun rays. This shirt 1. is comfortable, 2. breathes well, 3. fits perfectly, and 4 looks great. The color gets many flattering comments (\"Ive never seen such a nice color on a sun-blocking shirt!\"), and the fit yields the same type comments. (\"looks great on you!\"). HIGHEST RECOMMENDATION.",
      "rating": 5.0,
      "verified": true,
      "author": "Cranny",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Fantastic value",
      "text": "I bought this to provide sun protection in North Carolina and I am very happy with the shirt or should I say shirts since I liked the first one I purchased so much my wife purchased 4 others for me. The shirt is well made, comes in its own reusable plastic bag that would be excellent to put in your backpack for camping or fishing. The shirts are lightweight and extremely comfortable to wear even in the hot sticky summers of North Carolina.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Kept me sun burnt free",
      "text": "I took this out for a long day out in the sun, for a water rafting trip. I thought I would be in the sun the whole time, but within that 5 hours or so there was a good mixture of shade and sun. At the end of the trip, i was not burnt and the shirt itself fit well, as expected. This was also a water event and the shirt seem to dry fairly quickly so overall I thought this was a great priced item compared to ones you may find from named brands in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Wilson T.",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Comfortable shirt for me to do outside work",
      "text": "I bought four of these shirts to do outside landscaping and grounds keeping work. The long sleeves provide extra protection from the sun, insects, scratches, etc. I normally wear a size XL, but I purchased the XXL size for each shirt so it would not be too \"clingy\" on me, i.e. would be a little loose. The breathable fabric helps keep me cool. I recommend this shirt if one wants a comfortable shirt with a good feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "May need a one time ironing",
      "text": "I use these shirts for a dressy summer look. I need my skin protected in the hot AZ summer sun. I had left a mediocre review on receiving my shirts more wrinkled than expected. After washing and hanging to dry they were still wrinkled. The seller contacted me which led to my experimentation. The shirt label states to iron after washing. I steam ironed the \"hard\" wrinkles out of the shirts then washed again and hung them to dry. They both came out with very few wrinkles so I don't expect to need to iron again. These are very comfortable, well fitting shirts that go with a sport coat or vest.",
      "rating": 5.0,
      "verified": true,
      "author": "WR Jones",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Very nice in hot weather",
      "text": "I bought a pair of these shirts because I spend a large amount of my time outdoors for work. The material is very light and allows for a great amount of air flow through them, to the point where it sometimes feels like you're not wearing anything at all. They are great for working out in the sun and you don't feel like slathering sunscreen all over your arms, or you're looking for protection on your arms without sacrificing too much comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachery",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Different fit (but same size) depending on the color",
      "text": "Previously purchased one of these shirts and was satisfied with the quality and fit. I then ordered two more in the same size, but different colors. I am disappointed in that the second shirts I received were marked as Medium but the sleeves were longer and the body looser than the original Medium I received. So, be prepared for inconsistent sizing with different colored shirts.",
      "rating": 2.0,
      "verified": true,
      "author": "Dwebster",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "and white) is very consistent and good. However",
      "text": "The fit in the long sleeve ones (I've bought blue, black, and white) is very consistent and good. However, the one non-black short sleeve one (green color) I bought fit much looser than the two black short sleeves ones I purchased and is almost unwearable. With that said, these shirts are pretty great, breathe well, and do not feel too thick or too thin. My only change would be to decrease the length of the body part of the shirt by 2-3 inches.",
      "rating": 4.0,
      "verified": true,
      "author": "JKanarek",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "True to size and comfortable",
      "text": "These shirts are true to size and very comfortable. I bought a XXL, because of reviews, but I usually wear an XL. The XXL was big on me, but useable. I liked it so much that I bought the same shirt in an XL and it fit perfectly. It keeps the sun off of me, but it also keeps me cool... almost like a second layer of skin. The price point is excellent. I will be buying more of these amazing shirts.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty Marticci",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Good for Texas Heat",
      "text": "This shirt is awesome. We live in central Texas 100 degree heat and this is my husbands go-to outdoor work shirt. It both keeps him sun protected, and cooler than a t-shirt. The only negative is that when it gets soaked from sweat, it pulls down, making it longer. He’s 5’10” and it’s a bit on the long side for him, so great for taller guys. Runs true to size- order your usual, not up or down.",
      "rating": 5.0,
      "verified": true,
      "author": "ThisGirl",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Great value for running in the heat",
      "text": "I live and run in central TX. I just recently started looking for running shirts that had some sun protection and would help me stay a little cooler than my other shirts. This shirt is great, especially for the price. I say it's 90% as good as the Columbia and Coolibar shirts I ordered, but at less than a third of the price. I see a couple more of these in the rotation at some point in the near future.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Parkison",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Just what I wanted",
      "text": "So let me preface this with the fact that I'm a woman, and these are advertised for men. I bought the same brand's shirt for women and it was not comfortable at all. I've been searching for a shirt like this for a while, but only now when I order a shirt for men I actually get what I want. Breathable and smooth, not sure how it protects against the sun though!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Perfect Sun Blocking Swim Shirt",
      "text": "Don't waste your money getting a swim shirt from Dick's Sporting Goods or Target. This shirt hits all the high points - great fit, light material that doesn't weigh a ton when wet, and a reasonable price. As a skin cancer survivor, the ability of this shirt to block UV sunlight is crucial. This shirt is good for canoeing, kayaking, swimming, surfing, sailing and anything in or around the water. Would definitely buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Nice looking shirt",
      "text": "I am 73-74 inches tall (6ft 1-2 inch) and 190-195 lbs. Bought the large in green. Nice looking shirt, but still has too much extra room in in the chest, neck, and waist. I do like the sleeve length and overall length as I can tuck it in. Had to buy the large to get sleeves that are long enough. Not sure why manufactures have such a hard time making shirts for taller/slender fellas. Probably going to try a medium and see if the sleeves are long enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Courtney Reeves",
      "helpful_votes": 2,
      "publication_date": 20180708
    },
    {
      "title": "Complete sun protection",
      "text": "Husband wore this everyday during a 10-day tropical beach trip without any sunscreen underneath and was 100% protected from the sun wherever this shirt covered. Not even a tan nor freckles. His body was as white as it was before the trip, for better or for worse! Also dries very quickly (swam in it everyday) and is super lightweight and doesn't feel hot at all, even with the long sleeves.",
      "rating": 5.0,
      "verified": true,
      "author": "anna",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Perfect sun shirt or swim shirt!",
      "text": "I purchased this Baleaf shirt just before a week long Caribbean cruise, intending to wear it with my swim trunks to protect me from the sun. This shirt worked perfectly. It is very lightweight and wicks well. The shirt color was accurate to the picture. I am about 5' 9\" and about 185 lbs. with a 41-42\" chest and the Medium was a great fit. I may order more of these shirts.",
      "rating": 5.0,
      "verified": true,
      "author": "trsmith",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Extremely comfortable shirt.",
      "text": "Fit is normal to regular tee shirt sizing. I have arm tattoos that I don’t want exposed to the sun. Excellent alternative to regular sun block. Spent a week mostly outside in Utah recently photographing in 90+ degree weather. Wore these shirts everyday. Proof to me that they block sun and we’re surprisingly cool to wear. I think that I would have been hotter wearing short sleeved shirts considering the sun on my skin. There is no shoulder seems which make these shirts amazingly comfortable. I would buy these over any other sunblock shirt regardless of the money. I own 5 of these shirts.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Mahoney",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Hey these are all around great shirts!!!",
      "text": "I bought one of these for a fishing trip with my grandson and loved it. I perspire heavily but these shirts dry quickly enough I never felt clamey (sp) in them. I liked it so much I bought three more. I have found them to be great for working in the yard or really any outdoor activity. I have had skin cancer so I must protect myself from the sun. These shirts have extra long sleeves that cover my wrists even when I'm reeling in a fish. The material feels great and I like the colors. Hey these are all around great shirts!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gwingman",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "It is \"all as advertised \" and more.",
      "text": "Living in Florida with 330+ days of sunshine, skin cancer is easy to acquire. I was hesitant to buy a long sleeved work/athletic shirt as recommended by my neighbor. But, for less than 17dollars, I decided to give it a try. It is cool, dried fast and has SPF protection. Love it, going to buy my second one now. Good work Baleaf!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill O.",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Thick, but not bulky. Beautiful Colors. arm length is great.",
      "text": "I love these shirts for the texture of the fabric, quality of construction and lack of bulk. I like the way it fits around the collar and especially the length of the long sleeve in the XL. I wear a 36-37 length sleeve and this fits perfectly as I purchased these to protect my skin from the sun and that includes my wrists that are adequately covered. Have bought several and especially like the light green and sky blue. Really wish they made a long sleeve in yellow! Rich",
      "rating": 5.0,
      "verified": true,
      "author": "Richardj",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "3xfit real nice I think I looked 40lbs lighter",
      "text": "I got a 3x. I’m 300lbs 6’. 56” chest and belly. It fit great just a little loose when dry and when wet it hangs comfortable . Good sun protection, nice style and fit for a 3x. Sleeves on me might be a 1/2” longer then I like but I just push it up on forearms. I checked my size o purchased and I should buy another. It’s a comfortable shirt and do I dare say it looked slimming on me. I know portly guys like me are sometimes a hard fit . But this 3x fits pretty good",
      "rating": 5.0,
      "verified": true,
      "author": "bob d",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Protect your skin & look good doing it!",
      "text": "Love the color, fit and SPF protection. I’ve bought several for my very active outdoorsy husband. He enjoys wearing them and sometimes gets them pretty grungy working outside. I just spray the stain with Shout, or use other stain removers like Oxy-Clean or Biz and so far the shirts still look nice. I have bought the women’s version, same brand. These shirts keep you cool and save your skin!",
      "rating": 5.0,
      "verified": true,
      "author": "LuluBelle",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Works great!",
      "text": "Bought this for my husband for our river trip this past summer and it worked great for him. I was worried about the sizing for him since some items on here do not fit according to their charts. The 3xl was not to loose or to tight on him, just right. It kept him sunburn free our entire trip and he also did not get hot. The material dried very quickly as well.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisL",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Provides sun protection...that's good.  Sizing not so good.",
      "text": "It provides the sun protection I wanted. Which is great because I burn so easily. Not thrilled with the sizing though. I specifically picked a size down to medium to have a tighter fit. But it is very loose. All other medium size shirts I own are not loose on me...my problem is usually that medium is sometimes too tight. I still plan to wear it for sun protection, just wish I could wear it under other regular shirts to provide sun protection, but it is too big for that.",
      "rating": 3.0,
      "verified": true,
      "author": "kenlund",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "Runs ridiculous",
      "text": "What's wrong with these manufacturers?.. This ain't a Large! This fits like a Medium! Not only that but it is very short length wise!! Would it hurt to give it 3 more inches length? I can't raise my arms without my stomach showing..",
      "rating": 1.0,
      "verified": true,
      "author": "Reviewer 787",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "nice and soft",
      "text": "its pretty soft but also seems thin i got this as a over shirt for my under shirt in my winter layering but i think it would work better as a under shirt or a summer shirt fyi to anybody reading. as it is super thin and seems \"cold\" cool\" to the touch like it wouldnt do well in very cold conditions with out something else on.",
      "rating": 4.0,
      "verified": true,
      "author": "fox",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Awesome",
      "text": "I really like this shirt. Kept the sun off me for 12hrs in 90deg heat. Didn’t feel like the long sleeves made me any warmer. The sweat on my back from my backpack dried very fast. Super impressed. It’s as nice as the $65 shirts that do the same thing. I’m 5’8” 165 and the med is great with a comfortable fit. If I lost 20lbs like back in the racing days, it would be too blousy.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Z",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Bargain compared to \"name brand\" shirts",
      "text": "I have several Columbia, Under Armour, and Simms shirts. I like the Columbia shirts other than the big logo on the sleeve. These are just as nice for the price. I'm 6' 190 lbs. The Columbia shirts in medium fits great. These in large fit about the same only just a little more tight. The x-large would be too big. Although I may order x-large just to see how much bigger it would be. Hope that helps someone who's not sure on the size. Really nice shirt for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Geno287",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Love it",
      "text": "Fabric is airy like a sports fabric. My family have worn on hot days and still felt comfortable. Went swimming and kept me at the right temperature. Sleeves were a bit long but I was ok with that and didn't feel heavy in water. Dries fairly quick. Keeps the sun off and you sunscreen the rest. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat Woman",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Nice shirt, neck opening is large",
      "text": "I use my two shirts for sun protection while dinghy saling, and for that they're pretty good. The neck opening is distinctly bigger than other similar shirts I have purchased, so that's a bit of a disappointment...I have to slap on more suncream than I'd like. Otherwise, very nice. I bought XL for a loose fit. 6' 0\", 205lb, 42\" chest...very happy with sizing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy Mac",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "I recommend- good service good products",
      "text": "I tried this out yesterday on a 150 mile handcycle ride with temps up to mid-80*'s.morning temps around 65*. worked well - didn't have to use spf 50 sunscreen so I would say its worth the money. I'm 5'9\" and 185 witha 42' chest and the large is somewhat snug but not bad- I would say sizing is pretty accurate......can't tell yet (of course ) about longevity, but even if I only get one season out fo it - its worth it",
      "rating": 5.0,
      "verified": true,
      "author": "doug",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Protects from the sun",
      "text": "I bought this for my other half for a full day white water rafting trip. We were a little worried because other reviews mentioned still getting burned but after a full day in the sun reflecting off the water he had no issues. No sunburns, no skin warm to the touch, no darkened skin or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Jla",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "very comfortable",
      "text": "Arrived quickly and fit perfectly. Enough room for comfort and stays dry and comfortable. I used them on a 6 mile power walk and they felt great all the way. Wicks moisture and the evaporation was pleasant and doesn't hinder your movement by weighing down. Very light weight a flowing. I bought the white one and love it. And protected me against the sun as advertised. Great shirt and great price.",
      "rating": 5.0,
      "verified": true,
      "author": "txcycler",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great product!",
      "text": "I LOVE wearing BALEAF long sleeve shirts during the hot summer months so I will not have to use sun screen. Be aware they are not to be put in the dryer. It says right on the tag not to. I ruined one of my shirts by doing this and this is my fault for not following the care instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Bender",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Great alternative when compared to the EXPENSIVE ones!",
      "text": "The shirt is exactly what it says. It wears comfortably and loose. I purposely bought a larger fit for that loose and comfy fit. Color is nice and bright and material seems to be high quality. I took one star away because it's slightly heavier material when compared to the more expensive ones. I would prefer more lightweight, but overall it's great!",
      "rating": 4.0,
      "verified": true,
      "author": "Nick the Fireman",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Fits nice...sleeves a little long.",
      "text": "Ordered this in an X-Large (White) for my husband and it fits nicely, except for the sleeve length which is long enough to have to roll up at least once. He's not crazy about that, so it may be a shirt that hangs in the closet. The material is a little thin but not too bad. It will be nice for cool days if I can get him to get past the sleeve length. He doesn't have short arms so it's weird that these sleeves don't fit.",
      "rating": 4.0,
      "verified": true,
      "author": "sl8",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "great fit.",
      "text": "Great fit and helps me stay cool in the hot southern sun. I have to buy shirts a size bigger because I have long arms and this shirt fit great. I tried on a couple of XXL in different brands in a store and the neck was so big on them. On this shirt the neck wasn't too big and the arms were the right length. I would definitely buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "beachbum",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Sun-shirt perfection",
      "text": "Excellent fabric feel Lightweight Comfortable Sleeve length - over the wrist with just a sweeping on the hand Shirt length - just below the belt so it doesn’t ride up while fishing, camping or hiking Chest fit - tight enough to feel good and allow full range of motion",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "The answer to high priced effective workout shirts",
      "text": "Great product! Will be buying more in the near future. Fit was perfect, wicked moisture really well but the feeling on me was what I liked the most. Washes and retains same size. But the price is awesome instead of paying $$$$ for a Nike or other high priced shirt when you can get a quality shirt like a Baleaf.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Jimenez",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Nothing Special",
      "text": "It's just a polyester shirt, no frills. There are hundreds on Amazon that are exactly the same, just with a different logo. With this company, they didn't even bother to put their logo on one of my shirts (I bought a blue and grey shirt). Find one with the lowest price and buy it. Specifically, it's comfortable but was a little longer than I anticipated. I'm 5'8\" and bought a Large, probably could've made a Medium work.",
      "rating": 2.0,
      "verified": true,
      "author": "CLB23",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Very comfortable and wicks sweat away",
      "text": "This shirt proved to be the perfect fit for me on my final leg of a Transcontinental bicycle trip in 2019. Wicks sweat easily off the body and kept me from getting sunburn arms. As the temperatures fell heading into Fall season, I added a Patagonia jacket at night and remained very comfortable. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramblin RobTop Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Don’t listen to them, the sizing is NORMAL",
      "text": "They are comfortable but I was told they run small so I ordered a Large, but in actuality they run normal sized. Large is a bit too baggy and long in the arms and torso to what I normally wear and like. Sun protection seems fine for me so far. No complaints other than the size thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Great shirts",
      "text": "These are great for outdoor activity, I've bought 3 so far, all long sleeve. I use for fishing & hiking. Keeps the sun off ya while staying cool. Despite buying 3 of the same size, 1 does look a little longer than the others but not enough to be a real issue. I'm 5'9\", 152lbs and the medium fits me really well. Haven't found a better value sun-blocking shirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Good for the outdoors! Runs a bit long.",
      "text": "The price for this item was great. I bought it as a present for a trip to the mountains, and it ran a little long overall and on the sleeves, but I did get a size bigger so that it wouldn’t fit too tight on the belly area. It does look like it protects you from the sun. However, you’ll feel warm in it if it’s too humid outside. Overall a good product for trips and outdoor work!",
      "rating": 4.0,
      "verified": true,
      "author": "MGomez",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Quality shirt at half the price",
      "text": "I'm very happy with these shirts. They fit great, wick away sweat and dry fast. I can feel the difference versus other performance gear that do not provide UV blocking. I bought XL which is a little snug, good for wearing a shirt over it if you want. The XXL for me fits great. (6' 260lbs)",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Will never swim in a normal shirt again.",
      "text": "I wore this in Cancun, Mexico. My hands and feet burnt (with suntan lotion on) but my chest and arms did not. Swimming in the shirt was much more comfortable than I expected. It doesn’t hold much water, so it is not heavy and dries quickly. I wore it in both the ocean and a swimming pool.",
      "rating": 5.0,
      "verified": true,
      "author": "BryMom",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Nice shirt",
      "text": "Fits well /accurate size, kept me cool and sunburn free fishing in the Gulf all day",
      "rating": 4.0,
      "verified": true,
      "author": "C. B.",
      "helpful_votes": 3,
      "publication_date": 20190415
    },
    {
      "title": "Better than that other company's similar shirt that cost $21.00.",
      "text": "fits perfect, I'm 6 2'1/2 and weigh 187, fits great and has room if you are a bit tubby. I bought three from another company that has a similar long sleeve UPF shirts that cost $21.00. These fit wayyyyyy better and cost over seven dollars less.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristopher",
      "helpful_votes": 13,
      "publication_date": 20170904
    },
    {
      "title": "Dad Approved",
      "text": "I bought this for my dad for his most recent vacation. He went to Costa Rica and was looking for a lightweight shirt that helped with UV rays. He just got back and he absolutely loved this shirt! I have a feeling I will be buying more for him before summer gets here.",
      "rating": 5.0,
      "verified": true,
      "author": "Js",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great active outdoor shirt!",
      "text": "So affordable! My son (5’ 10’, 140 lbs) wore the blue/small every day on our camping/rafting trip. Dried quickly and great sun protection. These must run big because he normally would wear a Medium, and this small was fairly roomy.",
      "rating": 5.0,
      "verified": true,
      "author": "Make it Happen",
      "helpful_votes": 2,
      "publication_date": 20190707
    },
    {
      "title": "Comfortable, Protective and Great Wicking",
      "text": "I use this shirt for cutting and uprooting non-native invasive plant species in my local park. It is lightweight, comfortable, and wicks well to keep me relatively cool in hot weather. The long sleeves help protect my arms from scratches, bug bites and poison ivy.",
      "rating": 5.0,
      "verified": true,
      "author": "Binewt2",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Great but flawed",
      "text": "I LOVE these shirts, and I wear them all the time when I work out. The downside is that I am a big guy and very broad across the shoulders and the difference between an XXL an XXXL is crazy. These shirts run small, and I would recommend getting a size larger, especially if you are uncomfortable with tight clothes when working out.",
      "rating": 3.0,
      "verified": true,
      "author": "Brett Wayne McGillivary",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Nice shirt, snug fit",
      "text": "I’m 5’10”, 180 lbs and size large is snug. The neck opening is tight. I like the fabric. I’m keeping the shirts out of laziness, because I don’t want to do a return. My suggestion is to size up if you don’t want a slim fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Ace Edwards",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Holes and color",
      "text": "I ordered 4 different colors, they were all good except the green showed up as tan but it will work I guess. Also one of the 4 shirts has several small snag holes all down the sleeve, the other 3 were fine. It’s a comfortable shirt and works good for sun protection. I have a good tan line on my the back of my wrist/hand where she shirt ends.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great for fishing",
      "text": "Does a good job keeping the sun off of you if you are going to be out in it for long periods of time. I can fish all day in the sun with no worries of a sunburn. Material is light and breathable but has enough weight to it to still feel like decent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "RglrJoe",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "I needed something for the sun.",
      "text": "Being blond haired and blue-eyed, the sun is not my friend. But I dislike the feel of greasy sunscreen. I use this shirt to protect me while at the beach. I got the large for the sole purpose of it not being baggy when I go in the ocean, but it is still large enough to be comfortable when used when I cut the grass or are just out in the sun. Of course, I wear a hat too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20191220
    }
  ],
  "product_meta": {
    "title": "BALEAF Men's UPF 50+ Sun Protection Shirts Long Sleeve Dri Fit SPF T-Shirts Lightweight Fishing Hiking Running",
    "rating": 4.6,
    "feature_bullets": [
      "100% Polyester；Sun Protection",
      "Imported",
      "Tumble dry",
      "【Sun Protection】Rating UPF 50+ protects your skin from the sun's harmful UVA/UVB rays",
      "【Ultra Breathable】Technical Non see through fabric wicks moisture away from your skin, breathes freely and dries quickly for cool comfort",
      "【No Chafe】Flatlock seamlines minimize and no tag collar reduce chafing and increase comfort",
      "【Relax Fit】Baleaf shirts is lightweight and fitted without being too tight. Raglan sleeves provide fullRange of motion",
      "【Occasion】Great for a day of athletic workout,fishing, sailing, swimming, hiking and any other of your men's favorite sports"
    ],
    "categories": [
      "Men",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Clothing, Shoes & Jewelry",
      "Shirts",
      "Sports & Fitness",
      "Clothing",
      "Running"
    ],
    "price": 16.99,
    "specifications": {}
  }
}