{
  "website_summaries": [
    {
      "verdict": "Uses only the most natural ingredients available, plus healthy probiotics for extended digestive tract health. The price is also hard to beat.",
      "pros": [
        "Exceptionally gentle on the digestive system, very few stomach issues reported",
        "Will not interfere with other medication regimens, such as thyroid or diabetic meds",
        "Improved energy and weight loss are common side effects"
      ],
      "cons": [
        "Very few critical reviews from customers, but we still recommend standard colon cleanse precautions: drink plenty of water, be prepared for digestive emergencies, and seek treatment for any allergic reactions to ingredients"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Almost works too well!",
      "text": "I wasn't able to get through all 15 days, it works that well! Definitely does the \"job\", but it was difficult having to urgently run to the bathroom when I had places to be in the morning. I had mild cramps, but only because I didn't drink enough water. Taking only one pill was effective for a few days, then I had to bump it up to two because it wasn't producing a bowel movement like it had the first few days. Cleans you out that's for sure, just make sure you drink enough water.",
      "rating": 4.0,
      "verified": true,
      "author": "Robetta",
      "helpful_votes": 15,
      "publication_date": 20180727
    },
    {
      "title": "Works just as described!",
      "text": "I’ve been having severe constipation due to medication....at times I couldn’t even remember when I passed stool last. Recently the constipation got worse and very uncomfortable. So I did research on colon cleanses and with this one getting rave reviews I decided to try it. I took 2 pills the first two nights and like the instructions said In a 24 hour period I’ve had 4 stools and I already feel better! I do have mild stomach cramping and bubbling right before I have to go but it’s nothing unbearable. I was starting to get concerned that I had a more serious condition going on but thanks to this product I finally feel relief! This product works!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Griffin",
      "helpful_votes": 4,
      "publication_date": 20200806
    },
    {
      "title": "I wanted to loose weight so a friend recommended that I try this product",
      "text": "I have been eating fast food for basically my whole life. I wanted to loose weight so a friend recommended that I try this product. Not only have I been loosing weight, I feel totally detoxified. I had no idea what was stuck up in my guts till I started working it all out. I feel lighter and healthier, even my mood is better. So yes, two thumbs up if you want get purified.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Lape",
      "helpful_votes": 10,
      "publication_date": 20171120
    },
    {
      "title": "Yowza!!",
      "text": "Yowza! These things work!!! The first time you take them be prepared to be in the bathroom a LOT. Drink a LOT of water with them. That’s important. I took them for 9 days straight. The first 3-4 days were intense then got better. Now I use these for 3 days every few weeks for maintenance. Maintence is by far easier than the first 8-10 days so BE PATIENT.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie T",
      "helpful_votes": 2,
      "publication_date": 20190218
    },
    {
      "title": "Not the best nor the worst i have tried",
      "text": "Made me feel like i was going to die, stomach cramped up bad and then nothing happened.... not for me .",
      "rating": 2.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 8,
      "publication_date": 20170927
    },
    {
      "title": "Oh the pain.",
      "text": "They work in the sense they clean your colon, however they say to take them at night and there is absolutely nothing fun about waking up in pain from stomach cramps.",
      "rating": 3.0,
      "verified": true,
      "author": "ShaShauna",
      "helpful_votes": 2,
      "publication_date": 20200321
    },
    {
      "title": "Exactly as Described! Watch the video first!",
      "text": "It absolutely does what it says it does! I would not start with two, like the video says. It’s way too much! After a few days taking just one at night, I can do two now. No side effects, nothing negative to report.",
      "rating": 5.0,
      "verified": true,
      "author": "Christen",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "This stuff will give you the runs for your money",
      "text": "I didn’t want to wake my male friend by flushing the toilet all night as this stuff makes you poop often. So I went outside and found a white flower pot and went in it. The second trip it was cold outside so I put on my sweater and proceeded to the Flower pot once again. In the morning he asked how this stuff worked. Upon telling him the story we couldn’t contain ourselves from laughing until the tears ran down our cheeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Kraus",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Removes instestines as well",
      "text": "So the headline title is over indulged words, but I stopped taking this cleanse because it made me feel as though I had a virus and couldn't leave the restroom. I found other cleanses less harsh and I will go back to those the next time. It works, but I would suggest doing it over a weekend and save yourself embarrassment at your place of work.",
      "rating": 3.0,
      "verified": true,
      "author": "Yes i tried it",
      "helpful_votes": 3,
      "publication_date": 20181119
    },
    {
      "title": "This will do a good job cleaning out that thanks giving meal the very ...",
      "text": "This will do a good job cleaning out that thanks giving meal the very next day without residual incidents. I use it once per weekend, once per month as a general maintenance.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuckmunch",
      "helpful_votes": 3,
      "publication_date": 20170930
    },
    {
      "title": "Three Stars",
      "text": "Good product and works as expected. Just don't take it before bed or you will wake with awful cramps.",
      "rating": 3.0,
      "verified": true,
      "author": "Christine ",
      "helpful_votes": 2,
      "publication_date": 20180205
    },
    {
      "title": "Amazing product. Your stomach will hurt for a little ...",
      "text": "Anytime i eat too much or feel sluggish due to overeating in the past few days i take 2 of these around 8pm by 2pm the next day i poop EVERYTHING OUT. Amazing product. Your stomach will hurt for a little in the morning then again a few hours later and then youll poop a LOT. But trust me. The act of pooping = Life. Great product will continue to buy for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley Kratochvil",
      "helpful_votes": 4,
      "publication_date": 20171129
    },
    {
      "title": "but I'd recommend only using one capsule a day through your cleanse",
      "text": "This really works, but I'd recommend only using one capsule a day through your cleanse.",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Shetler",
      "helpful_votes": 4,
      "publication_date": 20180104
    },
    {
      "title": "Works fabulously!!",
      "text": "I started this cleanse 10 days ago and it works fabulously. I usually don't use cleanses but decided to try this out and have seen results. I will update this when I finish the full 15 days. So far so good! Will definitely purchase again when I am in need of a cleanse.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Kahue",
      "helpful_votes": 2,
      "publication_date": 20170807
    },
    {
      "title": "Gentle cleanse for colon",
      "text": "Completed 15 days using one pill before bed, worked sufficiently, though no weight loss.",
      "rating": 5.0,
      "verified": true,
      "author": "Janaan Darrow",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "It really work",
      "text": "I love the way it cleans me out, but it still hurts my stomach each time. Still I would buy it again. Just take one pill sometimes, but mostly 2",
      "rating": 4.0,
      "verified": true,
      "author": "Denita King",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Unfortunately this product did not work as advertised. I was hopeful and now I’m very disappointed.",
      "text": "Unfortunately this product did not work as advertised. I was hopeful and now I’m very disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Effective treatment",
      "text": "Works as advertised .No cramping works fast .makes you happy after taking it thanks guys for this wonderful product thanks to Amazon also for selling it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Really cleaned you out but did not help loose weight ...",
      "text": "Really cleaned you out but did not help loose weight even if you didn't want to eat due to your stomach hurting..",
      "rating": 3.0,
      "verified": true,
      "author": "Marvin Perry",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "It Works.",
      "text": "Without going into graphic details, this product worked to my satisfaction. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "MCrane",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Just ok",
      "text": "They worked for a little bit but then you have to take 2 & then watch out. Just ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Ginv",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "WORKS GREAT!",
      "text": "Does what it says it's supposed to do. I m on day 4..so far so good. Less bloated and I can feel and see the results already.I will definitely be buying it again. VERY satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "I love it. You will lose weight if you eat ...",
      "text": "I love it. You will lose weight if you eat proper. Prepare your meals. Try not to eat junk food 80% of the time",
      "rating": 5.0,
      "verified": true,
      "author": "SABINE ALEXIS",
      "helpful_votes": 2,
      "publication_date": 20171222
    },
    {
      "title": "Must buy",
      "text": "Amazing!!! This product really makes you less bloated and cleans you out! I feel so great after I this",
      "rating": 4.0,
      "verified": true,
      "author": "pippa",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "So far so good!",
      "text": "So I’ve been taking this for two days now.. I’m down 2 pounds and I’m loving it! It doesn’t make my stomach cramp but it definitely lets you know when it’s “time” I feel less bloated and the proof is on the scale! So far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Alison",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Four Stars",
      "text": "Works very well!!!!!! Thank god there are no side effects!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Marlyce",
      "helpful_votes": 2,
      "publication_date": 20170816
    },
    {
      "title": "I recommend. I'm a repeat customer",
      "text": "I don't usually leave reviews, however this product has worked well for me so thought it worth mentioning. I'm regular when taking, but did lose a few pounds as well. I attribute it to the product because I've changed nothing else. Anyway, I recommend. I'm a repeat customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey C Murray",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Detox Working Great",
      "text": "I wanted to clean out my system and this colon detox is doing just that. It's nice to find a product that does exactly as it describes. I'm feeling better, and now that I am detoxing I find myself eating healthier too. Now I see how this product keeps me on track with a healthy lifestyle.",
      "rating": 5.0,
      "verified": true,
      "author": "J-rad",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "This Stuff Is The Real Deal!",
      "text": "This is my 4th purchase of this product. This stuff is the real deal. It will \"flush\" you right out. Just make sure you have access to available facilities when using.",
      "rating": 5.0,
      "verified": true,
      "author": "Godzilla",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Five Stars",
      "text": "Works well. It doesn't kick in until about ten hours later for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Salome Alfdis Lokidottir",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "On to the next cleanse....",
      "text": "Didn't do much for me. Was a little disappointed. Followed instructions to a tee.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve TwentyOne",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Five Stars",
      "text": "This works better than any other cleanse I have tried, without cramping my stomach!",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "I took this suggestion from another review and worked out perfect",
      "text": "Would strongly suggest only taking every other day, not every day. I took this suggestion from another review and worked out perfect",
      "rating": 4.0,
      "verified": true,
      "author": "Cailin",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "If you have IBS, this worked for me.",
      "text": "Works for reducing bloating and cleansing. Works to help the effects of my IBS.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Product is good and it works",
      "text": "Product is good and it works. The first few days, it was kinda harsh on my stomach. Therefore, I had to reduce taking two pills daily, to one.",
      "rating": 4.0,
      "verified": true,
      "author": "donnat",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "The makers of this product and their staff seem genuinely concerned about my results.",
      "text": "The product worked as advertised. If necessary, I will reorder this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Brown",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "It Works!",
      "text": "This product is an awesome product that did exactly what I wanted...internal cleanse.",
      "rating": 5.0,
      "verified": true,
      "author": "shae1234",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Super simple and super effective. The Key is HYDRATE",
      "text": "Super simple and super effective, I'm super happy and recommending it to everybody. The key is HYDRATE, HYRATE, HYDRATE. ... Did I say HYDRATE? Hydration. I did it three bottles of colon cleanse consecutively to get good flow and a shift, and I'll do it again in three months. Thank you! I just ordered again. I do best drinking water daily at regular intervals- hourly. Plus I take water before bed (little or I wake to pee) and water as soon as I wake up. Magic! If I don't drink water, I find my \"tummy\" is more sensitive to cleansing and I get 'stopped up'. It's why I train myself to hydrate all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "First time using a cleanse supplement use this first",
      "text": "Shapeologist 15 day cleanse was more effective. However, first time cleansing this would be great to take.",
      "rating": 3.0,
      "verified": true,
      "author": "Seanna Boyle",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "It was great but now I feel so gross",
      "text": "Is this embarrassing but I went on a seven day cruise and just ate everything. It was great but now I feel so gross. Super bloated. My friend convinced me to order this and it's actually helped me quite a bit. Major relief.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "It's honestly been a life saver - day 4 and I feel absolutely amazing.",
      "text": "If you can't poo regularly...BUY THIS NOW!!!! It's honestly been a life saver - day 4 and I feel absolutely amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 2,
      "publication_date": 20170827
    },
    {
      "title": "Crap A Lot",
      "text": "I haven't noticed any significant weight loss but It does clean you out. That's for sure.",
      "rating": 4.0,
      "verified": true,
      "author": "Wrecksrme",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "Wish I found this years ago!!",
      "text": "Only 2 days in and I am sold!! I have extremely bad digestive issues and I had very low expectations for this product ( only because I've tried everything out there) so only 2 days in and I feel better!!!! Nothing has worked up until now !! It does not have the cramping laxative effect !! So far outstanding!!!",
      "rating": 5.0,
      "verified": true,
      "author": "stacey hoover",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "2 before bed, just make sure when you ingest ...",
      "text": "2 before bed, just make sure when you ingest something in the morning to have the urge to go...but its not a \"gotta stay by the bathroom all day\" kinda thing",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 2,
      "publication_date": 20171031
    },
    {
      "title": "Very happy",
      "text": "Day 1 and I feel more energetic and not as sleepy. It is working well, I can’t wait to see how I feel after the 15 Days. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Trina D.",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Five Stars",
      "text": "This product works well...I've since read however, the dangers of Senna and will not be using again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "One Star",
      "text": "Made my stomach cramp up terribly the whole 15 days.",
      "rating": 1.0,
      "verified": true,
      "author": "Melane long",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Honest 15 day review!",
      "text": "When Looking for a product, I look through the reviews/read the product info. and then decide to purchase or continue looking. I purchased this product based on the reviews and this really the only cleanse with five stars and great reviews. What I am going to do for future posters, is a one day post, a seven day post and a 15 day post. The information on this product is based on super strength cleanse and colon detox plus weight loss. I just received the product today and will start on Monday. I will start with five stars because I received the correct product and it was fast shipment, as I go through my days, I will adjust accordingly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "It definitely works",
      "text": "These do the job! However, please PLEASE be careful when taking. Do your research! It does say on the bottle to take PERIODICALLY, which I was taking every day. It eventually ended up giving me stomach pains. I certainly lost weight which wasn't the goal but at least I know the product is working. Take them every other day or so. It wont hurt your stomach but will still work. Also, be aware you will use the restroom frequently!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170811
    },
    {
      "title": "Repeat customet",
      "text": "This is an updated review (2019). I have ordered and tried multiple multiple times this product. Previously I rated them with a 3 star because I was doing the \"15 day detox,\" and I wasn't comfortable with that because it caused me discomfort; 15 detox days for me is a bit too much. ...but now, I only take the pills when I get constipated or feel too bloated and that seems to work too good for me.. So I will up my rating to a 5 star.",
      "rating": 5.0,
      "verified": true,
      "author": "Oops.e.Daisy",
      "helpful_votes": 10,
      "publication_date": 20170905
    },
    {
      "title": "but fortunately I kept using it for four or five treatments ...",
      "text": "It is appearing that 15 Day Cleanse is eliminating a severe case of constipation and hemorrhoids, but fortunately I kept using it for four or five treatments at 1 tablet/day. I almost gave up on the product because at first it appeared to be doing nothing, but, at this time, I am thinking that the severe constipation and hemorrhoids are either totally eliminated or almost totally eliminated. I hope to have a CT scan soon to see the progress. I would highly recommend that you all advise that multiple treatments are required for severe cases of constipation and hemorrhoids: there are probably many who need to know this.",
      "rating": 5.0,
      "verified": true,
      "author": "Odysseus",
      "helpful_votes": 3,
      "publication_date": 20180520
    },
    {
      "title": "It Works!",
      "text": "Worked well and didn't give me the trots. Plenty of warning. Would have given it a 5 but I think there should be more tablets. For a hard system I sometimes had to double the dose. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaunda Cooper",
      "helpful_votes": 4,
      "publication_date": 20171005
    },
    {
      "title": "Got things \"moving along\"",
      "text": "Works like a dream. No bad side effects and got things \"moving along\" as they should. Combined with making better diet choices, I am already down 4 lbs in 1 week. Very happy with product and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 2,
      "publication_date": 20180629
    },
    {
      "title": "didn't do much - not weight loss",
      "text": "i was trying to lose a little water weight/ waste weight and decided to try these. there was minor cramping when i took 2 pills each time but nothing unbearable. would not buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Keri",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "runs",
      "text": "as many have said this will give you the runs from hell and you will be cleaned out just don't eat junk food while doing it or your runs will get worse. Had to stop after a few days since I was working at the time and couldn't be running to the bathroom every 15min",
      "rating": 3.0,
      "verified": true,
      "author": "Lori McClannahan",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Best I’ve used so far",
      "text": "15 Day Colon Cleanse really work well! I have to take pain medication for my back and because of that I get constipated! 15 Day Cleanse is the best that I’ve used so far to help with this problem!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Romero",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Best cleanse ever!",
      "text": "This cleanse initially aided my weight loss program and I still use it as maintenance. What I like best is there is no cramping and it really does get rid of any bloating.",
      "rating": 5.0,
      "verified": true,
      "author": "sistahterri",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "So far so good",
      "text": "I'm using a third at a time. Only because I dont want to do all as directed",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy S. Smith",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Cramps",
      "text": "The product does what it is supposed to do, however it gave me miserable cramps. I kinda dreaded taking them. So much so that after a few days I went to taking them every other day.",
      "rating": 3.0,
      "verified": true,
      "author": "jambo",
      "helpful_votes": 2,
      "publication_date": 20171015
    },
    {
      "title": "Stay Near The Potty.",
      "text": "This stuff works well, but do not take it if you dont have ready access to the bathroom. MAKE SURE you drink enough of water.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Long",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "I been using it for over a week now and I feel so much better and had loss 5 lbs",
      "text": "It really works, I been using it for over a week now and I feel so much better and had loss 5 lbs .",
      "rating": 5.0,
      "verified": true,
      "author": "KWALKS",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Three Stars",
      "text": "Make me fell like going to the bathroom all day!",
      "rating": 3.0,
      "verified": true,
      "author": "Dodaddang",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Not very effective",
      "text": "Not as effective as a different brand I bought previously.",
      "rating": 2.0,
      "verified": true,
      "author": "Nish",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "The first 4 days were great. Dropped 2lbs",
      "text": "Could not complete the 15 day cleanse. Really rough on the tummy by day 4. The first 4 days were great. Dropped 2lbs, but felt 10lbs lighter",
      "rating": 4.0,
      "verified": true,
      "author": "Bernadette bouchez",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "I really liked this product",
      "text": "I really liked this product, it help me to stay less bloated and loose a little weight for my daughter wedding so I can fit into the dress .",
      "rating": 5.0,
      "verified": true,
      "author": "anna russo",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Two Stars",
      "text": "Two tablets at night equals diarrhea in the morning for this sensitive tummy.",
      "rating": 2.0,
      "verified": true,
      "author": "Dr. E",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "wowsers - this was flushing stuff out efficiently!",
      "text": "This will seriously flush your system... as long as you are drinking plenty of water (ie a gallon each day... it was sucking moisture like crazy!). It was so effective that I saw gum (accidentally swallowed) within about 12 hours of swallowing... Sometimes I'm not sure if the total flush was 100% necessary; however, it was quite effective at pushing stuff through my system rather rapidly. And it emptied out any feeling of colon build-up. Just a note: it is effective throughout the day. You might want to be around a toilet and not go on too many long car rides through rural areas. Just saying.",
      "rating": 5.0,
      "verified": true,
      "author": "H'Oscar",
      "helpful_votes": 9,
      "publication_date": 20170912
    },
    {
      "title": "Better products put there.",
      "text": "This product will make you go, but \"results\" are not well formed. I have had better results with other, simular products.",
      "rating": 3.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Meh.",
      "text": "My tummy is definitely flatter. For me, the products works a bit too well. A couple of hours after a meal I have to run to the loo. I do mean run. It reminds me of laxatives, but without the debilitating nausea. Not sure what it will be like after the cleanse, but I expect the bloat to come back.",
      "rating": 4.0,
      "verified": true,
      "author": "Dominique",
      "helpful_votes": 4,
      "publication_date": 20170824
    },
    {
      "title": "I recommend this product.",
      "text": "Works great. I recommend to start with one capsules. I am glad I tested one, because I had a mild diarrhea from it. What helps if you take it with fiber.",
      "rating": 4.0,
      "verified": true,
      "author": "Bo",
      "helpful_votes": 4,
      "publication_date": 20170826
    },
    {
      "title": "and works well not like others that have you running to the bathroom",
      "text": "Does as stated, and works well not like others that have you running to the bathroom. This one works normally, but has you going more often than accustomed. 1-3 times a day to 3-6 a day",
      "rating": 5.0,
      "verified": true,
      "author": "ROMEO",
      "helpful_votes": 4,
      "publication_date": 20170901
    },
    {
      "title": "I wanted to do one because of feeling like there was a brick in my stomach everyday",
      "text": "I have never done a cleanse before so I was very nervous. I wanted to do one because of feeling like there was a brick in my stomach everyday, not for weight loss purposes. I did not lose any weight, but the pain in my stomach has been gone for 2 plus weeks. Maybe it is a mind thing, I don't know, but I feel like it reset me which is exactly what I was hoping for. Things I didn't know about participating in a cleanse is that it is essentially giving yourself IBS for two weeks and the greasier food you eat the worse it is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Alba",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Great Cleanse",
      "text": "Definitely cleanses and I noticed a decrease in bloating. I like the all natural ingredients. I didn't have any weight loss or extra energy and I was pretty careful watching that I ate healthy. I bought this to cleanse before detox my liver with Milk Thistle. I am off to a good start.",
      "rating": 5.0,
      "verified": true,
      "author": "Jokes",
      "helpful_votes": 2,
      "publication_date": 20170830
    },
    {
      "title": "Did not agree with me!",
      "text": "I have taken 2, just 2 pills. 1 and one again a few days later.. gave me explosive diarrhea. The emergency kind of poop, for days..I'm throwing them out. I must have had an allergic reaction to an ingredient. UPDATE: Without asking the company refunded my money! Thank you.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 2,
      "publication_date": 20170929
    },
    {
      "title": "Works great!",
      "text": "I bought this to jumpstart a healthier eating plan. It works very well. Made me feel like my body was clearing out the gunk and getting clean. I was ready to be camped out by the bathroom, but no need! It was very gentle and comfortable. I will rely on this to use periodically when I need a boost!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Moyer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Improved energy, mood, weight!!!",
      "text": "Great, great, great, worked for me from day one. moves things along without horrible cramps, you'll feel things moving down the line, but nothing uncomfortable. Energy up! Mood up! Weight down! Just Excellent, if you want to clean out your system and feel better, this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "QueenJustice",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "This worked great for me..",
      "text": "If you take it before bedtime, be prepared for some fireworks in the morning..",
      "rating": 5.0,
      "verified": true,
      "author": "Sam H.",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "Fizzles out after second dose.",
      "text": "Worked well for the first 2 doses - after that it seemed like I was ingesting placebos!",
      "rating": 3.0,
      "verified": true,
      "author": "Nan",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "ummmm",
      "text": "after 5 days of spending most my time in bathroom i stopped",
      "rating": 3.0,
      "verified": true,
      "author": "blessedmommy",
      "helpful_votes": 7,
      "publication_date": 20170825
    },
    {
      "title": "Warning",
      "text": "These work pretty good so far. HOWEVER, do not take at bedtime unless you are wearing diapers!!",
      "rating": 4.0,
      "verified": true,
      "author": "Brady F Smith",
      "helpful_votes": 7,
      "publication_date": 20170902
    }
  ],
  "product_meta": {
    "title": "15 Day Colon Cleanser Detox with Extra Strength Herbs and Probiotics, Senna is a Fast Acting Natural Laxative for Constipation Relief - Whole Body Cleanse - 30 Capsules",
    "rating": 4.1,
    "feature_bullets": [
      "DETOX FAST WITH OUR BEST SELLER! - Relieve bloating & constipation for healthier digestion with energy boosting herbs found in Eternal Zen's 15 Day Cleanse",
      "MANUFACTURED IN THE USA - We manufacture our non-GMO supplements in a certified facility following the strictest industry standards. The number one most important thing when you buy is that you are happy, if not we will give you your money back, no questions asked.",
      "SENNA & CASCARA SAGRADA - herbal laxatives to help provide instant relief to your digestive system",
      "PSYLLIUM HUSK & FLAX SEED POWDER - soluble fiber and omega 3 fatty acids to help remove waste from the walls of your intestines",
      "LICORICE ROOT & ALOE VERA & LACTOBACILLUS ACIDOPHILUS - help coat the inner lining of the gut and reinoculate it with healthy bacteria. Start with just one pill before bed for the first four days. Some people do not need to take two to get the result they desire."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2 x 2 x 3.81 inches; 1.6 Ounces",
      "Department": "Unisex-adult",
      "Date First Available": "July 7, 2017",
      "Manufacturer": "Eternal Zen",
      "ASIN": "B071LJ1196",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Vitamins & Dietary Supplements",
      "Probiotics",
      "Supplements",
      "Health & Household",
      "Digestive Supplements",
      "Health, Household & Baby Care"
    ],
    "price": 12.79
  }
}