{
  "website_summaries": [
    {
      "verdict": "A decent membrane-based gaming keyboard at a low price, but features like voice-response and a phone holder greatly up its cool factor.",
      "pros": [
        "Programmable LED backlit keyboard",
        "Compatible with Windows and Mac OS",
        "Good design, right down to a holder for your phone",
        "Easy to set up",
        "Membrane keyboard, but with a mechanical feel (without the noise)",
        "104 keys",
        "Backlighting has 9 modes, including one that responds to your voice",
        "Waterproof"
      ],
      "cons": [
        "Some buyers say that this keyboard either stops working completely or the lights die out after a few months",
        "The return key is placed differently than on traditional keyboards"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "They Don't Last Long",
      "text": "This was a really awesome looking keyboard. However, they don't last. The first one shipped to me stopped working completely within the first few days. I thought it must be a dud and sent it back. I received a brand new one in its place. That one lasted for about 4 months and then the P key stopped working. The next day the S key stopped working. I believe a keyboard should be made to last longer than that. I wouldn't purchase another one of these.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 11,
      "publication_date": 20180110
    },
    {
      "title": "easy to set up",
      "text": "Have used for several days before I wrote this. Appears well built, keys are responsive, lights work well, easy to set up, wife loves the phone holder. The metal is thin but strong would not want young kids using if they would someone would get hurt possibly severely. If you are like me and move the keyboard around like your lap, another desk so on the phone would fall out. Phone holder is a cut out in the metal - no bottom. This is not a bad thing just need to be aware. Wife does not move keyboard when she is using. At the price worth the effort. We are not gamers use for office, web etc.",
      "rating": 5.0,
      "verified": true,
      "author": "merv58",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "eventually it just stopped working, had to replace the usb plug to fix.",
      "text": "Seems like a very cheap usb is used on the back end of this otherwise seemingly well constructed entertaining keyboard. Before i replaced and fixed the usb issue, my keyboard would disconnect and reconnect all day long, this made it impossible to play any games, and nearly as difficult to browse the web. This keyboard stopped functioning yesterday March 10th 2019. I went to Walmart and bought a 40 dollar Logitech wireless keyboard mouse combo and I couldn't be happier. Sometimes you truly do get what you pay for, in this case a cheap light up paperweight that will go dead in a few months time.",
      "rating": 1.0,
      "verified": true,
      "author": "ProfessorShibs",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "May be good for gaming, I cannot say.  I do not do gaming, only straight typing.",
      "text": "What I do not like about it is that....when I exit, I turn off the backlight on the keyboard. When I turn it back on, my computer has a hard time connecting with it saying that \"it did not load properly\". I get this message about every 3 or 4 time. A larger instruction sheet would be good. My husband threw away the FN functions and I had a really hard time with the lights moving across the keyboard. I dug in the garbage and found this little instruction sheet. So I learned about the FN key and how to change colors . The keys feel good and sturdy. Very easy to type on them.",
      "rating": 3.0,
      "verified": true,
      "author": "Regina B.",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Great Keyboard. Sturdy.",
      "text": "Keyboard is very study and works great. I love the metal/aluminum frame and multiple colors you can use as a back-light. I've had it for about 30 months now, daily use for work. If I had one bad thing to say about it, I'd say that after 2 years, there are about 10 keys in various stages of having the letters worn off. But that is just lots of use and will eventually occur with many brands. You can easily buy a key replacement kit to replace them.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Perfect keyboard",
      "text": "LOVE LOVE LOVE this keyboard!! I work online, and type pretty much all day. I wanted a great keyboard with a 10 key and this keyboard meets all my expectations. The led lights are awesome and there’s a ton of customization options. I love the phone holder as well. The keyboard is quiet and has worked great so far. I don’t do PC gaming but I’d imagine it would work great for that as well. The chrome plus led lights just make for an awesome looking keyboard. And the price is so cheap!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180407
    },
    {
      "title": "Spill proof and sparkly",
      "text": "Love the LED lighting. Hard to type and I keep hitting the / key when I go to hit enter. Typing accuracy has dropped dramatically from the “Indestructible” silicone keyboard I was using but I kept wearing the keys off of it so at least this one has letters. I’ve already spilled an entire glass of water on it and it was easy to dry with no issues. Wish it was easier to clean between the keys and the mechanical clacking is pretty loud compared to its predecessor. I think when this dies I might go back to another Indestructible.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie B.",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Very nice mechainical feel.",
      "text": "The first one I received stopped lighting up after the first reboot of my iMac. The company sent me another one that's working like it's supposed to. Some color modes change rainbow colors in a wave effect. I went for the constant rainbow color. Since I'm a Mac user, I wish the Windows and Alt keys were reversed. The Windows Key is used as the command key when used on a Mac system.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Ervin",
      "helpful_votes": 2,
      "publication_date": 20180705
    },
    {
      "title": "These are a favorite for our grand kids on gaming machines but are ...",
      "text": "Work as advertised and after some use continues to function normally. These are a favorite for our grand kids on gaming machines but are also functional for serious work (though there are faster pure typing keyboards for the same price). I am a little puzzled by some of the key labels, especially the courser control keys between the main section and the numeric keypad, but I made conventional labels placed over its originals.",
      "rating": 5.0,
      "verified": true,
      "author": "Primie Customer",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Fun and easy to clean",
      "text": "I don't game but spend a lot of time on the computer so wanted a \"fun\" keyboard. The keys are easy to reach. I haven't had it long enough yet to see the wear that some people are complaining about. It is definitely durable. I had to bend the cell phone holder just a little bit so that my phone would rest straight up and down. I especially like this feature since my desk sees a lot of traffic and the phone sometimes gets lost otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Beautiful",
      "text": "This keyboard is bad ass! The lights are awesome! It doesn't need a driver. And the sound sensitive setting is so cool! It goes along with music or when you type! The only thing I was disappointed about is the listing says anti ghosting keyboard and doesn't tell you only like 20 of the keys are that responsive. And the box says \"emulates the feel of mechanical switches\" which for 40$, it does okay. It's no CMX set up but it can't be beat for that price. And the blued metal chassis! It matches the iMac pro so perfectly it's painful.",
      "rating": 5.0,
      "verified": true,
      "author": "tommy ohlrich",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Good when it works, warranty is a joke",
      "text": "We gave one of these to our son for Christmas and it worked fine until a month ago. Keys were sticking (the windows key for instance so when you pressed the D key it thought you were pressing Windows/D taking you to the desktop instead). We contacted the company via web and via email and a month later nothing. What good is a 12 month warranty if your customer can't talk to you to get a replacement. For the record, my wife has a mechanical LED from Corsair she got for Christmas years ago and it still works and looks like new. I would NOT buy another one of these because of the complete lack of service.",
      "rating": 1.0,
      "verified": true,
      "author": "anon.",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Awesome Price for a Awesome Keyboard.",
      "text": "Wanted that extra strong metal for them rage moments in games and this product delivered. Great shortcut system for lights and functions. The lights are bright and lots of option for them to show off with, personally I enjoy the setting were it lights up when you push a key but solid green was what I needed. Cell phone holder is nice, it also makes for a nice handle when taking it to lan parties, that also reminds me over the cord strong fabric wrapped, should last for some time. Awesome gaming keyboard for a amazing price thanks for this awesome piece of machinery!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Lasted 1 year and 2 days Update!",
      "text": "This keyboard has been working well sine I got it over a year ago. Today however it started ating up. You may notie one of the letters on the keyboard isn't responding any longer...I an't type it to onfirm whih letter it is but this is a real problem. Disappointed to realize that this keyboard is overed for 1 year year...I ordered it 9/27/17. Won't order again. Was contacted by seller and after a somewhat lengthy wait received a new keyboard. It took a while but they didn't ask me for any documentation so I'm satisfied. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Aylene W. Barr",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Nice, but letters fade",
      "text": "I liked the keyboard - it’s sturdy, heavy, and you can set it to single color, but after using it extensively, the letters started coming off. As a quick fix I used stickers to mark the letters, but aesthetically it’s not pretty. The keys are louder than I would like. Periodically, the keyboard would “reset” and go semi-dark, or return to default mode. I’m going to look for another one.",
      "rating": 3.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "I really do love the color choices and with so many choices",
      "text": "I am typing this review on the keyboard now. I really do love the color choices and with so many choices, I won't be bored with it. It works very well. I have had it for a few months now, and it works great. I have not managed to spill anything on it yet, but from the looks of it, I think it will manage very well even if I do have an accident.. I have had many keyboards before, but I really like this one. It is sturdy, and functions very well. I would buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn P.",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Awesome keyboard, and a few more things.",
      "text": "Love these keyboards! The only reason why i am not giving this a 5 star is because my husbands keyboard keeps having to be unplugged and replugged in sometimes to for the lights to work. I enjoy the metal cover on the keyboard along with the phone holder, I use the sound activated mode sometimes wish it was a little more responsive to my speaker that I put right next to it tho.",
      "rating": 4.0,
      "verified": true,
      "author": "Karate - hiya",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Do not buy!",
      "text": "So I like the look and the lights of this keyboard, but less then 1 year in and it stops working competely. I bearly got to use it and it dies. In all the years of using a keyboard I have never had one die on me let alone less then one year. Definitely Don't Buy This One. I want my $25 back.",
      "rating": 1.0,
      "verified": true,
      "author": "BRIAN",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "both my sons love them. These were shipped fast",
      "text": "I purchased two of these as Christmas gifts so they've only used them for a day but so far, both my sons love them. These were shipped fast, delivered early, they are light and so far they live up to everything described. We love them!",
      "rating": 5.0,
      "verified": true,
      "author": "K. J. Longwell",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Nice keyboard, but needs some more RGB work",
      "text": "I like the brushed frame of it; it's not too hard on my hands and while it may be cold initially, it does keep your hands cool. The RGB lighting needs some work; end frame keys do not properly light up all the way and leave something to be desired; The options ARE nice though; I was originally going to get a more expensive keyboard but since it was sold out, I opted for this one. The phone holder is a nice touch, I'll have to use it more to it's potential use.",
      "rating": 4.0,
      "verified": true,
      "author": "andrew",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Annoying",
      "text": "Love the lights on the keyboard ans that is where the liking stops. Once everything goes to sleep and you wake up the PC and monitor this keyboard does not wake up. I have tried the tricks others have addressed in the questions section and they only work sometimes. Most times I have to restart the entire PC to get it working again. Very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "KAP",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Defective",
      "text": "Maybe I just got a defective product, but while it was nice to see the dancing lights, trying to type is a whole new problem. the keyboard has a thing with password boxes and calculators. pretty much anything with a space for typing. it just runs like crazy, like the 15-sec video I posted. Needless to say, I'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "GPM",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Perfect and pretty. Great feeling for gaming and typing",
      "text": "a really fun to use, colorful and great keyboard, the keys really feel like they are mechanical, and the keyboard sounds very nice when using it. the color options are really cool also, lights up my keyboard in the dark to help if i get lost while typing. i haven't been able to figure out how the color to sound thing works, but other then that its AWESOME",
      "rating": 4.0,
      "verified": true,
      "author": "Dontclickme",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Attention-grabbing",
      "text": "I needed a keyboard that was just as obnoxious as me and this really did the trick. Everyone at the office complimented me on it and gave me attention which is what I wanted. The top surface seems to be made out of steel which means that this keyboard may also be used as a weapon against unsuspecting Jehovah's witnesses that might come wandering through.",
      "rating": 5.0,
      "verified": true,
      "author": "Lakshya",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Great value click keyboard!",
      "text": "Over all this keyboard is comfortable and it has really good Cherry clicky keys! Love the many different color options too. My only issue is, several times my Mac no longer is syncing with the keyboard commands after logging into the computer. Unplugging it, and resyncing usually fixes it and it hasn't happened in the middle of extended use.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Mackes",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "What is this lovely thing?",
      "text": "This keyboard is dope, homie. All the different light patterns, the minimal typing sound and overall comfort is boss af. I don't use it for gaming though, I just bought it to entertain/distract me during work or my writing sessions. The only thing I have noticed is that sometimes if left unattended for a while it'll kinda be unresponsive for 10 seconds and then go back to functioning 100%. I've had it for 2 weeks and it's done that 3 times. I dont mind it at all but it's noteworthy. Overall it's an excellent buy. I gave it 4 stars because I couldnt attest to the gaming responsiveness but other than that it's legit.",
      "rating": 4.0,
      "verified": true,
      "author": "Jae S.C",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Beautiful afordable keyboard that works very well",
      "text": "This keyboard is beautiful and feels great to use. I was surprised whe I opened the box, not expecting much for 25 bucks but the quality blew me away. The key switches aren't too clicky nor too mushy, I'd say about just right. I really like the level of customization with the RGB lights this keyboard gives you, too. I'm actually on my second one, thanks to my dog, but both have been really good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Great for typing in the dark. Not for gaming.",
      "text": "This seems to have a short in the wiring. It resets or the computer doesn’t recognize it for a moment, then it quickly refreshes. Slows my gaming down for just a second, but it’s enough to get highly annoyed. I love the back light with letter lighting for typing in the dark.",
      "rating": 2.0,
      "verified": true,
      "author": "Strawleyder",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Lights don't last",
      "text": "Cute keyboard, but I've only been using it a few months and already it doesn't light up. Two sections of the keyboard stopped lighting up recently. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 3,
      "publication_date": 20180126
    },
    {
      "title": "Keys....Need.....Slammed....to.....Type",
      "text": "First off it looks great, lights are just bright enough, functions like it says. I want to review it higher but the keys are terrible, very stiff and rigid, even writing this review is becoming frustrating as I feel I need to slam the key not just tap it. Overall good looks, but terrible mechanics.",
      "rating": 3.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Best keyboard ever.",
      "text": "Best keyboard ever. I have had this keyboard for about 2 months and it works perfectly. I love that you can choose between so many settings. Also it is really easy to change maybe 2.5 seconds? I can't recommend this keyboard enough. I would say the only thing i dont like is the phone stand. Its nice in theory but i dont use it. Added bonus you can turn off lights on keyboard as well. The sleek metal makes the keyboard look awesome. I have had 0 issues with this keyboard and ill be honest i use it daily and for hours sometimes...never lets me down....buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "B00GZ",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Was excited just to be Let Down",
      "text": "I have been using this keyboard for just about 3 months now at work and it just stopped working, my computer recognizes the keyboard is plugged in but lights wont come on and it will not type. It would occasionally turn off and the lights would restart but it started to do this more frequently until today it stopped. The outside is a great metal finish but when I received mine it was already bent on the top right corner. All in all it looks cool, you can not charge your phone and leave it in the phone holder unless upside down but cool concept, but most of all it needs to work.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael R.",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Stopped Working 2 Months LATER",
      "text": "How convenient, one month after the return date closed the keyboard died in the middle of use. Won't even light up when I plug it into a computer. I tried multiple computers throughout our office to see if it was just by PC but it's completely dead. DO NOT BUY!",
      "rating": 1.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Great Until It Quickly Dies",
      "text": "It looked and worked great, but the lights stopped working after about 9 months of moderate use. Surprising, given that the hardware feels sturdy, and the brushed metal base isn't what you'd expect on a cheap keyboard. Must get another, but won't be ordering from this supplier again. Too bad.",
      "rating": 2.0,
      "verified": true,
      "author": "John Cserep",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Decent backlit keyboard",
      "text": "Well it seems to be a sturdy comfortable backlit keyboard. The only reason i give ot 4 stars is because the light settings can only be save when this is hooked up to a desktop tower. I bought 2 and the one i set up with my gaming notebook will not save settings because the usb ports on notebooks aren't powered when it is off.",
      "rating": 4.0,
      "verified": true,
      "author": "ross ketchum",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Nice, but has flaws",
      "text": "I bought the keyboard for the key specs, rather than the lights. The lights are a nice touch. This would be a 5-star product, except I've owned it two days and have had to unplug/plug it back in SIX times because it will randomly stop working (both lights AND key response). I work from my home computer and it's been frustrating to deal with this.",
      "rating": 3.0,
      "verified": true,
      "author": "EF",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "May not last long",
      "text": "This keyboard died after 2 months. If it had lasted I would have given it 4 stars. Solid feel, no software configuration, full-spectrum LEDs (some dont have the orange range) and worked seamlessly on Mac. But, because of the short life-span can't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Chase",
      "helpful_votes": 2,
      "publication_date": 20180630
    },
    {
      "title": "Great looking and very functional.",
      "text": "Very sharp looking keyboard with nice functions. Anti ghosting keys, programmable keys, color functions as well as being made of aluminum. Functions great. Price is excellent for so many features!",
      "rating": 5.0,
      "verified": true,
      "author": "jaenpop",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Not good",
      "text": "Didn’t use it much , it’s been in my closet but needed it .. plugged it in and it ran me straight into a wall playing Modern Warfare 2",
      "rating": 2.0,
      "verified": true,
      "author": "Rondal Cogar",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great keyboard, Except WASD And arrow keys.",
      "text": "I love this keyboard. It is so good for gaming, typing, and holding my phone. The customization is awesome. One thing though. The WASD Keys and arrow keys usually convert sometimes. As a gamer, this is bad. I use WASD and when it randomly converts WASD and arrow keys, I just can't type or play. Overall, I love this keyboard, its probably one of my favorite keyboards ever. P.S It might just be my computer, im not fully sure if its the keyboard itself or my computer.",
      "rating": 4.0,
      "verified": true,
      "author": "Pam Hodges",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Amazing Keyboard",
      "text": "Love this keyboard. I'm a big PC gamer so having a keyboard that is comfortable and looks cool is a must. This keyboard works perfectly and the different functions of lights you can use is very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler U",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Spacebar Broke in less than a month",
      "text": "Terrible keyboard. It felt good at first, but then when the space bar came off, the keyboard became useless, so I had to trash it. What a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Dimitri D.",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Purchased the keyboard as a birthday present for my son ...",
      "text": "Purchased the keyboard as a birthday present for my son but the first time we plugged it in the lights wouldn't work. Read the manual, researched videos to see if we were doing something wrong (which we weren't) and still wouldn't work. Unhappy birthday boy and mom.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Well built and very pretty!",
      "text": "I really like this keyboard! My only qualm is the shape of the enter key. I'm used to long enter keys with the \\ located above it. This keyboard places it where the enter key often is. So I had to retrain myself a little bit, but otherwise it's a very nice keyboard!",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Hulett",
      "helpful_votes": 2,
      "publication_date": 20170807
    },
    {
      "title": "solid and wicked cool",
      "text": "way way awesome ,love the programing feature for the colors , if it were cordless it would be perfect , its a sturdy metal keyboard with a great feel and seems to be durable , im clumsy with my toys so that is important",
      "rating": 5.0,
      "verified": true,
      "author": "andrea",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Don't let the price fool you, this is a great buy!",
      "text": "For a cheaper end keyboard this thing is fantastic! I came from using high end gaming keyboards, and I have not been disappointed with this at all! The keys have a great feel when you oress them, and the colors are very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Lanna Gibson",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "I like the idea of it",
      "text": "I like the idea of it. I wish i could return it without costing me almost half of what it costs. The shift button is stuck, and the far left part of the keyboard is a lot dimmer than the rest of it. I really like how you can have it light up when it hears sound,.",
      "rating": 3.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Very good for the price, lights are very bright.",
      "text": "Love the feeling of the aluminum, edges are a bit sharp though. I like the PlayStation button layout of the arrow keys as well. Was surprised to see all of the settings for the color patterns. Don't like the cell phone holder, it's basically a hole in the keyboard and it stands it up without any angle.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew G.",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Didn't last as long as I would have liked it to.",
      "text": "It was good for a while, but just didn't last. After a few months I kept having to unplug and then plug it back in, and it eventually just stopped working. I'm kind of glad to be getting a new one now because this one was seriously getting annoying.",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "awesome!",
      "text": "been using this for while keyboard is great works great no issues so far the lights are really nice in dark for gaming!",
      "rating": 5.0,
      "verified": true,
      "author": "Ndiz",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Amazing!",
      "text": "It works really great I have no issues! Great for Gaming and typing. I will be buy another on for my Husband so he can have a new keyboard to play wow on!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Great Lighted Keyboard",
      "text": "I just love this keyboard! It wasn't purchased for gaming though, I have a hard time seeing the keys in the morning and the evening, this is the greatest! Very easy to see all keys, love how I can change the color, the price was right and now I don't have to struggle anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Great Keyboard",
      "text": "I have a 9 year old gamer boy who was dying to have a \"light up keyboard\" and this was a reasonably priced Christmas gift. He absolutely LOVES it. It was easy to install and works well.",
      "rating": 5.0,
      "verified": true,
      "author": "libertymarie",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Good value",
      "text": "So far for the price this is a good keyboard. I use it at work and it has had no issues so far being used everyday",
      "rating": 4.0,
      "verified": true,
      "author": "alfonso",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "it's alright",
      "text": "It's alright for a quick replacement of your keyboard if it breaks. It lasted almost 2 years before the key response started going and the lights started acting funky.",
      "rating": 4.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "keyboard led looks great. sometimes the space bar gets stuck and it ...",
      "text": "keyboard led looks great . sometimes the space bar gets stuck and it keeps making a lot of space . But I just press space bar again to make space stop running . Otherwise keyboard looks great .",
      "rating": 4.0,
      "verified": true,
      "author": "mix spirit",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Prefect keyboard",
      "text": "The metal frame makes this keyboard one of the best I've played on. Works better than other keyboards for the price and the lights are nice and bright. Highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Eliason",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "What a cool keyboard!",
      "text": "I love this keyboard! It works perfect! The only thing I have to say is this; On the English side of the directions, as it is listing off the key commands to switch between the different light modes, instead of showing \"Fn+9\", \"Fn+7\" is instead shown twice. On the other side, however, the \"Fn+9\" is shown, as it should be.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine and zack",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "its cool and all they if i knew how to program ...",
      "text": "its cool and all they if i knew how to program it it would be even cooler . the lights are supposed to change with the beat of the music this keyboard is not dancing and if he every body is laughing , cause his lights got one move only and never changes",
      "rating": 4.0,
      "verified": true,
      "author": "robby mortimer",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Excellent, ergonomic, and user friendly!",
      "text": "Keyboard came in flawless condition. The lights arent overwhelmingly bright and the metallic finish of the keyboard is a very nice touch to reduce reflection. Keys are very responsive and not to loud. Amazing keyboard, definitely deserves 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "jack",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Really Cool Key Pad WELL BUILT!!",
      "text": "Love the color changing well illuminated keys!! Nice Sturdy aluminum frame, No cheap fragile plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Keeps randomly turning off to where I have to unplug ...",
      "text": "Keeps randomly turning off to where I have to unplug and plug it back in. It is also a bit clunky and slow. But hey, it is cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Jensen",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "A great buy!",
      "text": "I purchased this keyboard for my personal computer. It works great, love the rbg lighting, keyboard is very fluid. Will be buying another for my work computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Darkrose",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Looks great, so far so good!",
      "text": "I’ve only had this for a few days, but everything is functioning properly, and it looks great. The only reason I’m not giving 5 stars is because the enter key and backslash are not the same as in the picture (which I’m glad about, because it is the standard format... but still it’s inaccurate).",
      "rating": 4.0,
      "verified": true,
      "author": "Shantel",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Best Keyboard Ever For Price!!!!",
      "text": "Best keyboard I ever got for this price. The phone stand fits my phone with/without case and I have an iPhone X. I love that the directional buttons look like PlayStation buttons!!! The lights are fully functional, the sound doesn’t really pick up that wel but all the other ones are P E R F E C T L Y customizable!!! Don’t go elsewhere!! Get this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Pretty pretty keyboard.",
      "text": "Pretty keyboard, my only suggestion is make the next model with tefflon coated keys, the keys on this one frictiony.",
      "rating": 5.0,
      "verified": true,
      "author": "H.d.z.",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "I love it and so do my co-workers",
      "text": "I love it and so do my co-workers! I think there will be 3 new purchases of this keyboard by them. One co-worker said she\"s going to buy one for home and one for work. The other co-worker happens to be my supervisor...she wants one too! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "I love it. The keys and colors are surely visual ...",
      "text": "Organomically astounding. I love it. The keys and colors are surely visual in the dark. Spaced perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Esmy",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "THIS IS TRULY AN EXCEPTIONAL KEYBOARD, COLOR CONFIGURATION IS ...",
      "text": "THIS IS TRULY AN EXCEPTIONAL KEYBOARD, COLOR CONFIGURATION IS VARIED COLORS ARE EXTREMELY BRIGHT, CONSTUCTION IS SOLID AND WELL FINISHED, STAND IS VERY STURDY",
      "rating": 5.0,
      "verified": true,
      "author": "luscus",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "I like this keyboard",
      "text": "I'm not a gamer but i needed a lighted keyboard. I've had it for about a week and it does the job. The keys are smooth and quiet and there are plenty of options for the lights. Seems pretty sturdy with the aluminum case and it looks cool. Glad i found this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Quality product",
      "text": "Works as advertised secretary loves it and it's reliable Quality made",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Wont remember color on loss of power",
      "text": "nice and works but since there is no drivers the keyboard forgets what you set it to every time it looses power.",
      "rating": 3.0,
      "verified": true,
      "author": "joseph",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Good keyboard. Poor LED's.",
      "text": "Works great. Aluminum frame is great. Variety of colors makes it easy to see at all times of the day. After 2 weeks the white diode under the number pad went out. Still ok though.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaun's Nonfiction",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Four Stars",
      "text": "Worked great until I spilled a 20 oz coffee on it and quickly realized it wasn't waterproof !!!",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "It’s Ok",
      "text": "Haven’t had this keyboard fir a month yet and it stopped working last week. The right side stopped functioning.",
      "rating": 1.0,
      "verified": true,
      "author": "David Ponce",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Quality for a good price",
      "text": "I was really iffy about getting a rubber dome keyboard because I tend to prefer mechanical, but I love this keyboard! It’s easy to type on and doesn’t make me forget about cleaning it the way other keyboards tend to, and has enough click to satisfy me without annoying my roommate.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Works great with no issues",
      "text": "So far the keyboard seems great. I haven’t had any issues with durability and it works well for gaming. I love the different lighting options and colors. Definitely worth the price and I’m very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Workman",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Looks awesome!",
      "text": "Very cool! Light effects are great! The only downside are that the keys sit up very high.",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsey L.",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Nice keyboard",
      "text": "I’ve been using the keyboard for a few months now and i really enjoy it. Even though I don’t use it to play games it’s nice to type in it",
      "rating": 5.0,
      "verified": true,
      "author": "Cayke",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "LTC Keyboard",
      "text": "Love the fact that I can see the keyboard at night with lights turned off. And all functions work just fine. The price was also good!",
      "rating": 5.0,
      "verified": true,
      "author": "Ernie Grier",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Nice!",
      "text": "I'm not on the desktop often. However, my family is, and they LOVE it!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Fazzio",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "So cool",
      "text": "Very cool! With very clear instructions. My 14 year old brother does alot of gaming and loves it. Lights are extremely customizable you can customize 4 different sections",
      "rating": 5.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Awesome!",
      "text": "Amazing quality and fantastic-looking it has many options and is every bit as great as it says in the description!",
      "rating": 5.0,
      "verified": true,
      "author": "jayroc",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Not great product BUT great customer service!",
      "text": "Light up up keyboard died just after one month. Posted a review and was immediately contacted by customer service about replacement. When replacement not possible, they quickly refunded my purchase price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenifer Gregg",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Ok keyboard, cool color schemes",
      "text": "Keyboard is very nice though it freezes up sometimes and stops working so I have to unplug it and plug it back in",
      "rating": 3.0,
      "verified": true,
      "author": "Tova R Samouha",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "One week",
      "text": "It stopped typing after one week. It was rather awesome while it lasted, though. Slightly seductive.",
      "rating": 2.0,
      "verified": true,
      "author": "Vince Vaughn",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Has a perfect key noise and very comfortable to use",
      "text": "Wife loves it for her personal desk top. Has a perfect key noise and very comfortable to use. She loves the multi-colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Colonel Browning",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "lights did not last more then a few months",
      "text": "my keyboard is only a few months old and the lights went out on 1/2 of it ---",
      "rating": 2.0,
      "verified": true,
      "author": "Renee Cole",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Love it",
      "text": "Amazing and love the colors. I get compliments daily at work",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Batchelor",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Good Quality",
      "text": "The color range on this keyboard makes it very easy to see in any lighting condition. The keys seem responsive and the color modes are neat. Much to my surprise this keyboard does include feet (many reviewers and answers to questions claim it doesn't). *****Update***** Today we had our first spill and now they keys are all messed up. So much for that waterproof claim. Also while cleaning it one of the feet broke cause it was too rigid to pull back out after folding.",
      "rating": 1.0,
      "verified": true,
      "author": "Chimeara",
      "helpful_votes": 3,
      "publication_date": 20171113
    },
    {
      "title": "Great product!",
      "text": "Loooove this keyboard. The modes are fun. I also enjoy the fact that I can turn off the lights too!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Amazing Product!!",
      "text": "Love it, it has been awesome and held up to spills, a toddler banging on it, and there isn't any damage on it still! Great keyboard for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Solid keyboard for the price.",
      "text": "Bought this for my wife, so far so good! Seems solid and comfortable and I'm actually considering buying another to replace my logitech.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Coe-Othman",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Really cool",
      "text": "Very cool. Solid and well made. I love the feel of the keyboard",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Pecnik",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Great product! Very pleased!",
      "text": "Very happy with this, I use this keyboard for running a lighting system at a night club and it definitely adds a little flare to the DJ booth plus the LED backlighting helps very much!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard ",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Leaning Tech gaming keyboard nice low-cost option...",
      "text": "Like the construction. Keys provide sturdy feedback. Multiple dsplay color modes as well as intensity levels. Outstanding gaming keyboard for the price...",
      "rating": 4.0,
      "verified": true,
      "author": "Warren McGary",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Had this for a year, cheap and durable.",
      "text": "Been banging on this this like an angry monkey for a year now I think I got a bargain here.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "LearningTech LTC keyboard",
      "text": "LearningTech LTC keyboard works great, the rainbow color working well, I tested all the functions. I will buy this keyboard again",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Awesome",
      "text": "This is a great keyboard. It lights up and has several different lighting modes. Great for gaming and the office.",
      "rating": 5.0,
      "verified": true,
      "author": "Jevon",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "I like to have colored lights in the room at night ...",
      "text": "I like to have colored lights in the room at night and this keyboard makes it so easy to type with...I also like the heaviness of the metal and the solid feel of the keys...good product!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol S McCoy",
      "helpful_votes": 0,
      "publication_date": 20171217
    }
  ],
  "product_meta": {
    "title": "LeaningTech LTC K828 104 Key Anti-Ghosting RGB Programmable LED Backlit USB Wired Waterproof Gaming Keyboard with Voice Control Illuminated Function for PC Games Office - US Layout",
    "rating": 4.2,
    "specifications": {
      "Package Dimensions": "19.75 x 9 x 2 inches",
      "Item Weight": "2.2 pounds",
      "Manufacturer": "LeaningTech",
      "ASIN": "B071LHQZ27",
      "Customer Reviews": "4.2 out of 5 stars223 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#31,615 in Video Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 2, 2017"
    },
    "categories": [
      "PC",
      "Accessories",
      "Gaming Keyboards",
      "Video Games",
      "Electronics"
    ],
    "price": ""
  }
}