{
  "website_summaries": [
    {
      "verdict": "Looks great and does what enthusiasts love about spinners - and if by chance it doesn't, it has a reasonable warranty.",
      "pros": [
        "Has the potential to spin 10 minutes or longer with balanced, smooth motion",
        "Heavy stainless steel build, six-month warranty, and good looks"
      ],
      "cons": [
        "Some reports of faulty or malfunctioning spinners upon arrival or in a few weeks/months"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Spin time 7:30 with a soft spin. It just keeps going!!",
      "text": "There are so many fidget spinners out there, how do you know which one to order? I just decided I would pick a random one with a long average spin time. I spun this with medium force and it lasted 7:30! Very very very pleased with this product! If you are trying to find a spinner with a long spin time, this is the one!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 15,
      "publication_date": 20170530
    },
    {
      "title": "Finally!!",
      "text": "This is the third spinner I purchased on Amazon and I finally found a good one! It is very quiet and spins very smooth. First spin out of the box was just over seven minutes! It did come with minor scratches on the gold portions of the spinner. Overall, great spinner!! FYI: Mine had a tiny issue where when I held the spinner vertically, it would make a weird clicking sound. I was able to fix this by simply removing the bearing cap and tightening the silver bearing protector.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 11,
      "publication_date": 20170614
    },
    {
      "title": "Buy this! But beware of some complications if you get a bad one!",
      "text": "Don't get me wrong, this thing spins. For a long time. But I received this spinner damaged and scratched up with a machine problem which causes the spinner to wobble and you can feel it even when holding. This would have been the perfect spinner if I received it without all the imperfections. Will review again when they do an exchange.",
      "rating": 3.0,
      "verified": true,
      "author": "Dee Felgus",
      "helpful_votes": 10,
      "publication_date": 20170620
    },
    {
      "title": "Loose caps. Not worth the money",
      "text": "My Atesson spinner arrived today, 1 day early. Looks nice, very heavy & spins well. Very disappointed in the caps. Once they are tightened up there still loose and rattle when you spin it. Doesn't seem like a well-designed piece, it's a lot of money 4 things not to fit properly. I would not have bought this item in the store once I felt how lose the Caps were. Going to contact the seller now see if it's a possible defect if not I will just return it I don't want another if it's going to be the same thing. I would not recommend buying this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark A.",
      "helpful_votes": 5,
      "publication_date": 20170913
    },
    {
      "title": "Not for small hands",
      "text": "I got this as a fidget spinner for my autistic son. It spins okay I guess, but it's hard to hold your hand wide enough for it to clear that spot between your thumb and index finger as you spin. That's the case for my 8 year old son and for me (I guess I have tiny girl hands or something). It would probably work better for people with longer fingers. It also doesn't seem to twirl as smoothly as I would have expected.",
      "rating": 3.0,
      "verified": true,
      "author": "melissa butler",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Good but need more improvment.",
      "text": "This is the best spinner I have ever owned in my collection. Out of the box first spin last 7 minutes 15 seconds. I'm happy with this spinner! Update: The spin time increased greatly after bearing broken-in (11+ minutes), but the downside also came along that noise level also increased greatly to the point I can not deal with the noises and return it. The center cap also very easy to lose its tight so I have to re-tight its very often.",
      "rating": 3.0,
      "verified": true,
      "author": "Yuki",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "The Best Spinner Out There!!!",
      "text": "This Atesson fidget spinner, in silver, blue or pink, is the very best spinner you can buy. And it's worth every penny. When they say it spins 5-10 minutes, they're being conservative. All three hat I have went 12 minutes right out of the box! The people at Atesson have bent over backwards to make sure I was satisfied and happy! They're great! Do yourself, or that other fidgety person you know, a favor and buy all three!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Wow.",
      "text": "Wow. This thing is heavy, and it spins for a lonnnnng time. I've had a 4-5 plastic spinners and this thing is a totally different league. Not as easy to one hand flick into a very fast spin due to its weight. Pretty quiet bearing, has a slight metallic ring to it when you flick it, like flipping a coin. Only reason I gave it 4 stars is it's kinda scratched up. The gold colored Circle pieces had a decent amount of scratches. Honestly do I care really? No, because this thing is awesome.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 2,
      "publication_date": 20170623
    },
    {
      "title": "Excellent Fidget Spinner",
      "text": "This is the best fidget spinner I have tried or own. It spins far longer than competing spinners. It makes cool looking designs as the light hits the spinner. It is large and heavy. Sturdy metal. I have the blue and brass model. Spins really fast, and it spins for 4 minutes or more. I really like it. As far as curing anything, I don’t believe it. While it is very entertaining I doubt its therapeutic value. If you want a spinner start with this one. If you acquire others in this price range, they will not match up. AD2",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Dale DanielTop Contributor: Drawing",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Too large for our two grand sons",
      "text": "These spinners are great. They seem to spin for ever? They look great. I like the weight \"heavy\" . If I were to buy a spinner for me this would be the one. I gave only 4 stars for durability because I don' have a clue as to how long they would last. I sent them back due to the size of them. They were purchased for stocking stuffers for Christmas. Our two grand sons are 6&7, thy wouldn't be able to even hold them. Adults with medium size hands and smaller might have problems with the size. J.A.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey A.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Don’t Judge This Spinner By Its Cover",
      "text": "I ordered this for my thirteen year old as a Christmas gift, and he absolutely loves it! It has a smooth, long spin. Great quality! The only reason we didn’t give it a perfect score is because of the case. It’s a weird blue, faux leather triangular contraption on a keychain. He thinks it’s rather “girlie.” It was disappointing given the fact that other spinners in this price range usually come with a nice tin can for storage. An inexpensive drawstring satchet would have been a nice option, too.",
      "rating": 4.0,
      "verified": true,
      "author": "NSippial",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "A 9 minute spinner...but it doesn't last long!",
      "text": "This thing spins, and spins, and spins. On my first try, it spun for a few seconds short of 9 minutes (8:54 to be exact)! Truly amazing!!!!! But, within a day, it was making resistance sounds and spin times were cut in half. Took it apart and oiled it up and it improved, but this spinner doesn't have much durability, and I wonder when it will fail again. Great spin times but pretty low quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Ron",
      "helpful_votes": 2,
      "publication_date": 20170624
    },
    {
      "title": "First spinner - can't believe how long this thing spins",
      "text": "Out of the packaging, no tweaking or otherwise, it'll spin 4 minutes easily for me, and that's REAL spinning. When you count the trickle spinning time, where it's still technically moving but it's far less interesting, I'm hitting 5-6 minutes. Now I'm curious how much more it'll go with a better R188 bearing and some tweaking. Dropped it already too and it seems fine. Good price, and it'll give you plenty of entertainment.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Yura",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Runs longer than others I've tried",
      "text": "Works as expected, and it does feel a bit heavy in hand. While casually playing with this using hand power alone, I'm able to reliably hit 5-6 minute times by spinning it up and setting on a table. It should be noted that my times are measured from when I started it spinning until the comes to a full stop. I've played with a few other spinners, and felt that this one does run longer with the same perceived effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Ro Yo Mi",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Mediocre construction and spin time, serious cosmetic issues.",
      "text": "This spinner does well enough for it's practical purpose - spinning, but mine arrived with more than fifteen distinct scratches, dents, and smudges. I personally don't care for long spin times, but since other people do, I tested it out. My average time was around five minutes, with the best time being five and a half. The caps fit loosely within the center bore of the bearing, and shift back and forth. The bearing was not fully pressed in, and the outer weights are unevenly set in the body. Edit: I realized the bearing isn't pressed into the body, but rather screwed in. Turns out it was cross-threaded, and I was able to correct that.",
      "rating": 3.0,
      "verified": true,
      "author": "Jonathan D James",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Initially was great, then failed quickly",
      "text": "First and second spin lasted 9 minutes. Then started to feel vibration in spin, and heard high pitch whines proceeding to slow done then just won't spin more than 20 - 30 seconds. Bought premium spinner, should last more than 30 minutes. Initially was great, then failed quickly, not worth $2.00 not $15.99.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170614
    },
    {
      "title": "Spintastic!",
      "text": "This product is sturdy and very well made. I was consistently getting 6 plus minute spins, I was amazed at the quality of this spinner. Smooth operation and very quiet. It has been a pleasure playing with this. This was my first spinner, and I could of not got a better one in my opinion at this price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Ezydusit",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Really great",
      "text": "I just timed a spin for 8:41 minutes, the previous spinner I had, spun for 1:30. I'm blown away. I really like the design and finish. I did drop it though and 2 out of 3 brass disks now rotate in their housing. I might be abe to sneak some super glue in there. So try not to drop it, lol.",
      "rating": 5.0,
      "verified": true,
      "author": "drew",
      "helpful_votes": 2,
      "publication_date": 20171001
    },
    {
      "title": "Not a great product.  Could be much better",
      "text": "This spinner was a bit disappointing. It's not weighted right. It's heavier on one \"arm\" of the spinner. I can feel there's a lot of grit or something in the bearings in the center. The center post keeps coming unscrewed and I have to screw it back in. Just disappointed in the product overall. I've encountered this specific spinner other places before and been very impressed. They must have started relaxing their quality controls on the product manufacturing.",
      "rating": 2.0,
      "verified": true,
      "author": "Patrick Panzella",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Not sturdy",
      "text": "I'm disappointed in this purchase. It is trivial for a small child to unscrew the central spinner, and it is difficult to find the right tension when putting it back together. Nothing like giving a gift to a child for successfully completing a sticker chart, only to have them come to you minutes later with four pieces instead of one. If you enjoy fixing your kids toys, or having expensive metal paperweights, this is for you. For everyone else, find a more reliable unit.",
      "rating": 1.0,
      "verified": true,
      "author": "William \"Chip\" Hosken",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Spins as promised",
      "text": "I took the bearing out and ran it through my ultrasonic cleaner and blasted it dry with a little compressed air. It spun for over 9 minutes. Incidentally, you don't need special tools to take out the bearing - just unscrew and remove the caps and on one side there's a sort of threaded retaining ring. Unscrew that and the bearing drops right out. This is exactly the same design as another all-metal spinner I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Not good, not good at all",
      "text": "I think this is a used spinner. The metal is stained and the bearings are maybe old? I’m not a spinner expert but I’m not happy with this for 16 dollars. The center part is also wobbly. I unscrewed the center to see if i could adjust it. I’m not sure what to call if you watch the video, the green part is lopsided. Maybe this part unscrews, if so then it is screwed in wrong. I’m not gonna mess with it and damage it myself. Sending it back. Also there is no Atteson logo on either side the spinner, which I see in other pictures.",
      "rating": 1.0,
      "verified": true,
      "author": "charles johnsen",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Pretty cool!",
      "text": "I didn't believe the advertisement that this thing would spin as long as it said. I think it needs to be broken in a little bit, but even so when my son first got it I spun it in my hand and timed it and it spun for over 8 minutes! Pretty dang cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Hanson",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Update: would buy again.",
      "text": "bearings suck. bearings are loose, they wobble, and when it wobbles there is rubbing which stops its spinning. to get it spinning can be a bit finicky and frustrating. the spinner has a good heavy weight to it, but it just has cheap bearings. i will be returning, don't bother buying.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Hughes",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "So far - So good",
      "text": "Right out of the box I got an eight minute spin. Even very light spins last longer than they seem they should. Nice weight and usually totally silent. Sometimes it does make a slight noise. Very pleased with it so far. Much better than the average spinner. Have been babying it and keeping it in the included bag to protect from dust. Everyone is impressed by the feel and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "The1LoneWolf",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Heavy duty and great for the price.",
      "text": "My son has severe autism. I give him spinners between homeschool work sessions as a reward. We have quite a few spinners we’ve collected. I have to say this is one of the nicest ones for the price. Very heavy duty and well balanced. Spins for several minutes on a flat surface. My son can be rough and things get broken. We’ve had this for awhile and it’s still good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Zerla",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "ATESSON spinners are the best!",
      "text": "This is one of the best spinners I have :D Only one that outclasses it is....another spinner by ATESSON! :D Their spinners are well-made and designed, have a great weight, and spin smoothly and quietly. I'd recommend any ATESSON product. Make sure to buy directly from ATESSON though...there are other sellers on Amazon and Ebay that claim to sell them, and in reality they are knock-offs and made with poor quality.",
      "rating": 5.0,
      "verified": true,
      "author": "frogg018",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Poor reliability",
      "text": "Worked great for first 3 weeks. At first it could spin for a 45 seconds to 75 seconds. Now 4 weeks later(once the return window ended) it only spins for 3 seconds tops no matter what. I did not use it that often and this is ridiculous how early it failed.",
      "rating": 1.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Quality work.",
      "text": "Ok. I don't do a lot of reviews, but honestly this spinner is high quality. The market is saturated with bad quality spinners, but this one is an exception. It's a solid metal body with solid brass inserts in the arms and what appears to be an excellent bearing. After watching this thing spin at a medium speed, I got tired of waiting to see if it would slow down a noticeable amount. I'm not sure what more you could ask for in one of these things.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Webb",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Great spinner",
      "text": "I like the weight, size and how solidly this spinner works. Most of my spin tests exceed 12 minutes, and that's not a hard spin either, just a normal spin.............without assist. I think for a stock device, that's pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D.",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great spinner",
      "text": "Great spinner. This thing spins forever. Seven and eight minute spins out of the box. After I had this spinner for a couple hours I immediately ordered a second one. The second one performs just like my first one. The only downside I see is the weight of this spinner (115g). That is part of the reason it spins so long, but it makes it somewhat difficult to just play with to hold and spin in your hand. There are lots of cheap spinners to use that way. I have named mine \"Big Mo\". My second one is the pink spinner. I call that one \"Pinky Mo\". Lots of fun for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "James L. Miller",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "LONG Spin time",
      "text": "Wow, this spinner has an average spin time of 6:35! It's got a very heavy weight to it, which probably contributes to the long spin time. It's a little larger, but still okay for small hands.",
      "rating": 5.0,
      "verified": true,
      "author": "PR1NCEFAN",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Very Great!! A-Blue-Solid color is VERY cool",
      "text": "Very Great!! A-Blue-Solid color is VERY cool. It comes with a little blue triangular case. First spin out of the package was 6:25, and that wasn't the strongest spin I could do! There were no scratches, although there was a very tiny dent in the gold bearing part, but nothing noticeable that affected it.",
      "rating": 5.0,
      "verified": true,
      "author": "AC-JR",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "Love the color and the feel of the spin which ...",
      "text": "Love the color and the feel of the spin which lasts a very long time. So well made and comes with an adorable blue carrying case which can also be a key ring. This is my favorite spinner of the many we purchased. This was s a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey A",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Quality product.",
      "text": "Quality product. I put it on a hard surface to see how long it would spin for. Gave it a good spin and timed it for 8:07. Cool.",
      "rating": 5.0,
      "verified": true,
      "author": "D. D.",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Great Spinner But Large In Size.",
      "text": "Good spinner and happy with the purchase. Larger than your typical spinner in diameter and can be hard for younger kids with smaller hands to use. My son dropped it a lot because it wouldn't fit in his hand while spinning. He would instead spin it on a table or use a different spinner that was smaller. Perfect for adults or teenagers.",
      "rating": 5.0,
      "verified": true,
      "author": "bsibary",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "... not stop spinning very well built high quality item perfect!!",
      "text": "after air spinning at 165 psi this thing will not stop spinning very well built high quality item perfect!!!!!! buy this thing works great never seen one this good!!!!!!! and it arrived on my back door labor day thanks amazon!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "ICEBERG71",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "The weight was great and straight out of box it spun forever",
      "text": "The weight was great and straight out of box it spun forever! Then...Center piece either comes apart while spinning or locks up. Complained and they sent me a new one ASAP which was great!! New one has only come apart once in two weeks. Maybe try a different brand than ATTESON or something other than the steel bearing.",
      "rating": 4.0,
      "verified": true,
      "author": "christopher gillikin",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "Wow",
      "text": "I have to admit I was skeptical about the spin times in some if the reviews. I bought the item anyways because I loved the look of it. I was blown away when I actually timed the spin. Over 11 minutes. I own a few spinners and this one easily doubles the spin time of my others. If you're looking for one that spins forever this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin",
      "helpful_votes": 2,
      "publication_date": 20170531
    },
    {
      "title": "Fantastic",
      "text": "This is the third spinner I've bought from Atesson, and I have to say all of their spinners are quality. This one is a beast. It's shockingly heavy and sturdy and spins like nobody's business. My dad, who has been fairly amused by the spinner fad, picked this up and said, \"Oh, that's really nice!\" Very good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "dreamyraynbo",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Wonderful SPinner",
      "text": "My son loves this spinner. it was his first metal (heavy) spinner and he has it with him all the time. Very well made. we have cleaned it once with rubbing alchahol and it is quiet and spins quite a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Departing Contestant",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "A marvelous metal spinner that pulls off long spin times",
      "text": "This is a fantastic metal fidget spinner that easily pulls off long spin times. I hit 10 minutes on my 1st spin. The colors on this spinner just pop & look oh so sweet when spinning. It is a heavier spinner as it's all metal, but it does have great balance & is pretty quiet. I highly recommend this spinner!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyb3rPh0bia",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Don't buy",
      "text": "Bought two and the bearings are loud on both, the paint is coming off the second one and it smells like rust.",
      "rating": 1.0,
      "verified": true,
      "author": "Derrick",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great Spinner",
      "text": "Heavy, well made and spins forever. I own several spinners, and this is one of the best I own. Downside, the spinner in motion is not visually exciting. I don't think 10 minutes, but 5 to 6 is realistic.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "I've bought two now",
      "text": "I tried one of these spinners and liked it so much I came back and bought a second. So smooth and nicely weighted. They feel like a good value as I've seen a lot more expensive options. I will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "B Porter",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "the bearing is a bit sloppy but the machine work is as good as it gets from China",
      "text": "Yeah, you have to wait for it to show up and there's no way it'll spin for anywhere near as long as they suggest. It's weighted which helps it retain inertia. Beyond that, the bearing is a bit sloppy but the machine work is as good as it gets from China: top-notch crap! : )",
      "rating": 3.0,
      "verified": true,
      "author": "Z. Reisman",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Best fidget spinner on the market",
      "text": "By far the best spinner I’ve ever had. It’s heavy and spins for a crazy amount of time. Looks nice too. Worth the $",
      "rating": 5.0,
      "verified": true,
      "author": "Steve-o",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Legend says it’s still spinning to this day",
      "text": "A bit pricey but spins forever and ever and ever. Pretty nice",
      "rating": 5.0,
      "verified": true,
      "author": "Tom A.",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "The spinner arrived and appeared to be used. It ...",
      "text": "The spinner arrived and appeared to be used. It was scratched in multiple places on the blue and gold. Also it did not indicate Atesson on the spinner as advertised. I returned it due to the used look and quality...disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170704
    },
    {
      "title": "Incredible spin time.",
      "text": "The description states 4 - 10 minute spins. So far I have times of 11 minutes being held horizontal and 18 minutes and 20 seconds vertically. This spinner has to have batteries somewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Hatburger",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Good spinner",
      "text": "This is a great spinner. I'm getting spin times around 8-10 minutes. I had a couple issues with an order and ATESSION was absolutely amazing in resolving the problem. The customer service is awesome and the products are great too. I would recommend ATESSION to anyone. Great customer service and products. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill P.",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Amazing.",
      "text": "This is high quality. I did a normal spin on this and it was over 7 mins. Good prouduct. Highly recommend this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay White",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "5 Star Heavy Hitter Spinner",
      "text": "Comes as avertised. 8 minute spin out of the box. Spins smoothly, and looks great. There is some noise during high speed spins. But that's because it's a very heavy fidget spinner. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "-sùlfúr-",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "As advertised!",
      "text": "This thing is awesome! I was skeptical because people said theirs didn't spin well or looked used. Mine looks brand new with no marks. And spins for 9 minutes easy. To the people that said theirs spins for 20-30 seconds, you need to tighten down the bearing retainer. Great product, highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170603
    },
    {
      "title": "Awesome",
      "text": "I bought this about a year ago. Very well made and balanced. It seems to spin for a very very very long time. Very heavy and solid. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyHawke",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Quality and Performance!",
      "text": "A thing of beauty. I bought this for my 16 year old son. He loves it! It is heavier, but spins smoothly! Great balance and long spin times! The quality is amazing. Compared to other spinners on the market you cannot go wrong with the ATESSON Fidget Spinner. I am so glad I bought this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "I got a defective one",
      "text": "It looks very nice but, it doesn't hold the center parts after few days. Review: ATESSON emailed me and explained that I probably received a bad one. I really appreciate when sellers provide great customer satisfaction ATESSON.",
      "rating": 3.0,
      "verified": true,
      "author": "Fredim",
      "helpful_votes": 2,
      "publication_date": 20170726
    },
    {
      "title": "35 year old child",
      "text": "Never used one before and now I barely go anywhere without it??? Yeah it’s a bit odd but it’s fun to...fidget with. Anyways it’s fun to mess around with it’s heavy, feels well made, spins for a long time and it’s very smooth all over. No part of it is plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Debaser",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Has ding marks as others have said. I made ...",
      "text": "Has ding marks and chips as others have said. Fit and finish is very poor for a $20 spinner. After three days, one of the brass inserts is falling out and not secure when pushed back in. I will be returning this item.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170529
    },
    {
      "title": "Best spinner I've purchased to date.",
      "text": "Longest spin so far was just over 8 minutes. Perfectly balanced, quiet, and nice weight. Don't settle for anything less than ATESSON.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Feels like I'm getting a cheap knockoff each time.",
      "text": "I've purchased 2 of these and both were damaged when I took the caps off. They felt unbalanced and wobbly. Last Atteson spinner I'll waste my time on",
      "rating": 2.0,
      "verified": true,
      "author": "Donia Russell",
      "helpful_votes": 3,
      "publication_date": 20170925
    },
    {
      "title": "this is by far the best one. its heavy",
      "text": "i use and test a lot of fidget spinners , and for the press , this is by far the best one. its heavy, durable , fast and smooth , and the spin is insanely long. anywhere from 4-6 minutes. id absolutely buy more if there was a better color range",
      "rating": 5.0,
      "verified": true,
      "author": "jax pearl",
      "helpful_votes": 2,
      "publication_date": 20170602
    },
    {
      "title": "Great Quality",
      "text": "Purchased for my husband and he loves it. He keeps it on his desk and loves spinning it and timing how long the spins each time.",
      "rating": 5.0,
      "verified": true,
      "author": "V Avery",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Love it",
      "text": "Really awesome fidget spinner. While doing a couple test spins, I got a couple of different times. This would be the longest one I had. The other ones didn't even go under 8 minutes. Really happy with this one and it is honestly the best spinner I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "The ONLY WAY this could be better is if the gold parts had bearings and could ...",
      "text": "This is definitely one of the smoothest spinners on the market!!!! I've purchased others for more money, but not as smooth. The ONLY WAY this could be better is if the gold parts had bearings and could spin also!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tango",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Looks bad and feels bad",
      "text": "Just got this in the mail and looks and feels like it’s been used a ton. The center part where you place your fingers is wobbly and feels like it’s going to break. The gold circles on the outside are blotchy and nasty looking.",
      "rating": 1.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Excellent spin time, not brand new.",
      "text": "Excellent design which allows for exra long spins. The spinner is well built for the price, but, the brass weights were scratched up and not polished. No big deal to me because this sucker did a finger table spin 7:00 min out of the package. Well worth it",
      "rating": 4.0,
      "verified": true,
      "author": "Gig",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Get the Best",
      "text": "These Atesson fidget spinners are top of the line. They work great. A lot of machine work for a reasonable price. I couldn't duplicate this on my CNC mill for anywhere near this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Skypilot 18",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Five Stars",
      "text": "If you like smooth and long spinning spinner....look no further. This one is the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Kerimian",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "9+ Minute Spin!!!",
      "text": "First spin out of box lasted 9 minutes and 26 seconds. Bought this for my daughter so she could beat the spin time of the boys in her class who have the plastic ones that keep bragging. Pretty sure once she gets the steady hold down for the long spin, she will smoke'em!! Very high quality compared to the $3 gas station ones. Right out of the box you will notice the weight difference.",
      "rating": 5.0,
      "verified": true,
      "author": "FJP",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "this spinner was great for about a week",
      "text": "With very minimal use, this spinner was great for about a week. Now, it grinds and stops pretty quickly. Not really happy",
      "rating": 2.0,
      "verified": true,
      "author": "Tavito",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Bad at first",
      "text": "I didn't get the spinner in their picture, I received a red hardened plastic type called Harley Quinn. When I first used it, it was wobbling off center.However, I was able to fix the problem by tightening the center button with my fingers and it work perfectly with long spins. I would rate this between a 3 and 4 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Doc",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "The first spin lasted 6 mins and 42 seconds. ...",
      "text": "The first spin lasted 6 mins and 42 seconds. 2 hours later it was broken. It made lots of noise and just stopped spinning well. Returning it today.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170624
    },
    {
      "title": "Nice spinner!",
      "text": "This is a really good fidget spinner! I can get almost 4 minutes most of the time!",
      "rating": 5.0,
      "verified": true,
      "author": "aKent",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "great spinner",
      "text": "Consistently over 8 minutes, best time was today with 10 and a half minutes. Definitely has some weight to it, but it's a lot nicer than any others I've seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "That is pretty impressive, I have to say",
      "text": "Right out of the package it spun for 7m7s. That is pretty impressive, I have to say. Additionally, it has a very smooth metallic feel and it looks even cooler than the image suggests. Has a very smooth, silent, metallic hum when it spins which is very relaxing to listen to.",
      "rating": 5.0,
      "verified": true,
      "author": "Warren Palmer",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Spins for 10 minutes!",
      "text": "Really spins for 10 min plus. However, very easy to damage. Takes one drop.",
      "rating": 5.0,
      "verified": true,
      "author": "Britiam",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "9 minutes and 35 seconds, absolutely beast mode! ...",
      "text": "9 minutes and 35 seconds, absolutely beast mode! Even after I took this picture it was still going. I strongly suggest this to anyone who likes fidget spinners. #mindblown",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 3,
      "publication_date": 20170825
    },
    {
      "title": "This one is good because the parts don't fall out like others",
      "text": "This one is good because the parts don't fall out like others. I have a baby and worry about them chocking on the pieces",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "The best",
      "text": "This thing keeps spinning!! I had it do 14 mins nice heavy and balanced. Great spinner.",
      "rating": 5.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "nice toy",
      "text": "very nice toy. Grandson happy, and that is what is important.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Brown",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Heavy",
      "text": "Not the best I have had. These are heavy... if you have large hands these are fine....",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Lemoi",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "It is good quality. Heavier than others",
      "text": "It is good quality. Heavier than others. It easily spins over 4 minutes. Mine did not have the logo \"Atesson\" printed in the center, I hope it is truly a \"attesson\". I would have given it 5 stars if it was as pictured with logo.",
      "rating": 4.0,
      "verified": true,
      "author": "dream catcher",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "One Star",
      "text": "never span for 10 minuts and after first drop all 3 weights fall out",
      "rating": 1.0,
      "verified": true,
      "author": "Luka Dodelia",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "One of the best fidget spinners",
      "text": "Best fidget spinner out of the 10 I have spins long and really helps me with anxiety.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Christensen",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "DO NOT BUY",
      "text": "Product is not as advertised. My spinner is extremely unbalanced and barely spins for 3 minutes. Save yourself the time and money and buy a different one.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Junk",
      "text": "8:45-10:57 minutes out of the box, after 10-12 spins took a nose dive, I'm lucky to get 5:00 minutes, after 3 days. I figured it would slow down but 1/2 the time over 3 days. Junk look elsewhere for something decent.",
      "rating": 2.0,
      "verified": true,
      "author": "james sullivan",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Five Stars",
      "text": "Spins for 7 minutes or more every single time. Get this spinner!!! WORTH IT",
      "rating": 5.0,
      "verified": true,
      "author": "joseph r woodley",
      "helpful_votes": 3,
      "publication_date": 20170603
    },
    {
      "title": "Five Stars",
      "text": "Always able to have a spin time of at least 6.5 minites.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Rusbasan",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "8 mins spin...",
      "text": "This spinner goes for a really long time, about 8 minutes with a simple flick. Its actually a very heavy spinner to hold in your hand, but great quality, very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Spain",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Don’t purchase",
      "text": "This is the second one. The middle piece in each one was not stable. First one fell off. Second one just stopped spinning.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele M Bailey-Sablon",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Nice weight and spin time",
      "text": "Very solid spinner, tends to get a little heavy on the fingers after awhile. Will definitely spin for a good 8-10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "MDessaint",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Garbage",
      "text": "This thing is terrible. You can only spin it with a specific side facing up and then developed a wobble after a week. DO NOT WASTE YOUR MONEY!!!...",
      "rating": 1.0,
      "verified": true,
      "author": "Darren Kochevar",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Atesson is a great company who cares about their customers.",
      "text": "Other than a carrier snafu the spinner came quickly. It's balanced and quiet. However it came scratched. They responded quickly to my concern. This is the best spinner that I have purchased. I got spin times over 9 minutes. I will be doing business with Atesson again!",
      "rating": 5.0,
      "verified": true,
      "author": "Devon Littlefield",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Five Stars",
      "text": "This spins better than a, well, it spins really nice and smooth.....",
      "rating": 5.0,
      "verified": true,
      "author": "Loving life!",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Quality Control!!!!!",
      "text": "Spinner arrived used. It was clearly not a new product. It had scratches and dents and smudges all over it.Will be sending it back right away. This is my second ATESSON, and the first one was perfect.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis Lyons",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Great spinner",
      "text": "Mom loves it and figits all the time with it.",
      "rating": 5.0,
      "verified": true,
      "author": "CThatch94",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "as advertised",
      "text": "My 8 yr old loves it. Dad... not so much",
      "rating": 3.0,
      "verified": true,
      "author": "toughshed",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Best one I have now.",
      "text": "Best spinner I have purchased so far. First spin was 7 1/2 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Downs",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Good Quality Janky Spin Time",
      "text": "This is really nice quality and is smoother than a seal cubs butt, but it only spins for like a 1 minute and 10 seconds. How the hell are you guys getting it to spin that long? I'm using two hands doing it as hard as I can and no bueno",
      "rating": 5.0,
      "verified": true,
      "author": "Jake, From State Farm",
      "helpful_votes": 0,
      "publication_date": 20171011
    }
  ],
  "product_meta": {
    "title": "ATESSON Fidget Spinner Toy, 4 to 10 min Spins, Ultra Durable Stainless Steel, Bearing High Speed Precision Metal Material Hand Spinner",
    "rating": 4.4,
    "feature_bullets": [
      "Fidget spinner: 4-10 minute average spins greatly fit for fidgety hands, ADD or ADHD sufferers helps relieve stress.(The actual spin time will be affected by age and strength of users)",
      "No big noise: Easy to carry, small, simple, discrete and fun, also effective for focus and deep thought with using this hand spinner",
      "Great bearing: The fidget spinner use Stainless steel bearing, SLA technology, laser industrial molding technology. The body is made of aluminum metal material CNC with high quality, feel very good gravity, fast rotation . Accompany you year by year",
      "Hold hand spinner in one hand and use the other hand to spin it rapidly using small continuous strikes to keep it spinning indefinitely with practice",
      "We Care For You: Not only a toys but also a pressure release. The best choice for kids Birthday stocking stuffers. Any question please contact us anytime."
    ],
    "specifications": {
      "Product Dimensions": "4 x 4 x 0.2 inches",
      "Item Weight": "3.2 ounces",
      "ASIN": "B0719DGSXF",
      "Item model number": "METAL_BLUE",
      "Manufacturer recommended age": "3 years and up",
      "Best Sellers Rank": "#3,155 in Toys & Games",
      "Customer Reviews": "4.4 out of 5 stars308 ratings4.4 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "3 year and up",
      "Manufacturer": "ATESSON"
    },
    "categories": [
      "Fidget Spinners",
      "Fidget Toys",
      "Toys & Games",
      "Novelty & Gag Toys"
    ],
    "price": 15.99
  }
}