{
  "website_summaries": [
    {
      "verdict": "Solid prosumer model favored by contractors and serious DIY-ers. Durable, high-quality model that's a must-have for tackling big jobs.",
      "pros": [
        "Lightweight",
        "Sturdy design",
        "Simple setup",
        "Easy to adjust pressure as needed",
        "Sprays 1 gallon of pant per charge with speedy recharging",
        "Specialized spray tips included"
      ],
      "cons": [
        "Quality like this is expected to be fairly pricey",
        "Goes through paint fast",
        "Time-consuming cleanup"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It is so nice to be able to spray latex",
      "text": "Game changer! It is so nice to be able to spray latex, enamel, chalk paint, milk paint without needing to thin it. Also sprays water and oil based poly like a champ! Make sure you are using the correct tip. The one that is included is meant for spraying thicker finishes, like latex paint, on wider areas. Make sure you order up some other tips specific to the finish you want to spray.",
      "rating": 5.0,
      "verified": true,
      "author": "Karp",
      "helpful_votes": 69,
      "publication_date": 20171125
    },
    {
      "title": "Product not in “new” condition",
      "text": "I was very excited to try this product because I heard so many great things and read awesome reviews. I ordered this “new” and when I opened it up it was obviously used. The safety seal on the package was torn open and the paint cup appeared to have paint residue. Whoever had used it last attempted to clean it out but left water in the cup. Extremely disappointed that the company would try and sell a product as “new” when it was blatantly used.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike P",
      "helpful_votes": 14,
      "publication_date": 20190816
    },
    {
      "title": "Misleading about the battery that comes with the unit.",
      "text": "The battery that comes with the unit is not the XR type.",
      "rating": 1.0,
      "verified": true,
      "author": "Raze0000",
      "helpful_votes": 12,
      "publication_date": 20190913
    },
    {
      "title": "The reviews are spot on ! This tool delivers !",
      "text": "This tool is sweet , throw away your paint brushes people! This tool is simple to use and clean up takes as long as cleaning a brush. Over spray is minimal indoors. The Ultra hold enough latex based paint to cover both sides of 2 interior doors and the jambs and no thinking required . Suddenly I’m looking forward to painting ? The instructions are easy to follow and the tool is very well made . I’m impressed ! 5 stars from me",
      "rating": 5.0,
      "verified": true,
      "author": "Jim nikolai",
      "helpful_votes": 4,
      "publication_date": 20200605
    },
    {
      "title": "and after seeing many youtube reviews I decided to go for after getting a good paying job painting a door",
      "text": "I bought this because I only do small painting jobs, and after seeing many youtube reviews I decided to go for after getting a good paying job painting a door. I set up a spray booth, hung the the door off the ground with a dropcloth under, and sprayed almost 3/4qt SW Duration. Done in 30 min, booth set, gun prep, paint, then add another 30 to clean gun properly and store.",
      "rating": 5.0,
      "verified": true,
      "author": "mh1078",
      "helpful_votes": 13,
      "publication_date": 20180426
    },
    {
      "title": "STOP WONDERING, BUY IT",
      "text": "Bought on a drunk whim. Best drink decision ever. This thing is amazing. It can blow paint out faster then a wom...... AND IT TAKES DEWALT BATTERIES!! the batteries and charger are almost worth the full price. Btw, it can be broken down pretty far to clean. Yet dad didn’t know this or even try. Ran paint striped through it for 30 min to dissolve it all and poof. Blowing paint all over again",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Uses too much paint and takes forever to clean.",
      "text": "Pros: Easy to set and use. Cons: Runs through paint unbelievably fast, and puts down way to much paint even with a quick pass even on lowest setting. You’ll have to put more paint in about every 5 minutes. The worst of all is the clean up that takes forever. You’ll spend 4x as much time cleaning it than using it. Overall: At this price, I expected to be much happier. Definitely regret buying it.",
      "rating": 2.0,
      "verified": true,
      "author": "Shaun Howe",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "The person selling this paint buy is a joke. Dont buy",
      "text": "Don't buy from this person. The item broke after I use. I've tried getting into with him. He responded but won't refund your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan flack",
      "helpful_votes": 3,
      "publication_date": 20200810
    },
    {
      "title": "Working great so far..",
      "text": "Works very well, and minimal over spray. The only over spray issues that I've had were spraying outside on a windy day, and I only tried that because i'd had so few issues with it before... Heck, I'd still do it again under the same conditions. I just ended up with some clean up to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Buck",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "The clean up is not that hard.",
      "text": "I love this little monster. I painted my fireplace with it. Primer and paint.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Vennemann",
      "helpful_votes": 2,
      "publication_date": 20180706
    },
    {
      "title": "Great but runs out of paint quick",
      "text": "It’s a great product I just have to keep refilling it constantly I would recommend getting the back pack extension,the bigger contaier, or multiple containers",
      "rating": 4.0,
      "verified": true,
      "author": "kaleob12",
      "helpful_votes": 3,
      "publication_date": 20180703
    },
    {
      "title": "Very good",
      "text": "It is a very good product, but it is very messy Prepare to clean around alot But once working is very good",
      "rating": 4.0,
      "verified": true,
      "author": "Rafael Navarro Grau",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Price",
      "text": "Was everything I hoped for. just make sure youre set to the proper region, I thought I was only spending around $500 with sale price, not over $700.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe c",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "I found out that the best way to avoid some of the mess is not ...",
      "text": "This gun works well, but is a bit messy. I only use it as a last resort. I build decks and sometimes there is no power close by. I did purchase the larger cup. I found out that the best way to avoid some of the mess is not to fill the cup all the way up, but then you have to squeeze the disposable cup to push all the air out through the vent cap. This has to be done carefully or the material will come out to. I always end up with a good amount of stain on my hands when using the gun.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobby M Talbert",
      "helpful_votes": 11,
      "publication_date": 20171224
    },
    {
      "title": "Get a paint sprayer that works and doesn't disappoint.",
      "text": "My keeps getting electrocuted when turning this on to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 2,
      "publication_date": 20190608
    },
    {
      "title": "I was disappointed, perhaps another purchaser will not be",
      "text": "One battery was defective and it still didn't spray the \"miracle finish\" that I wanted with a FFLP210 tip. I was disappointed, perhaps another purchaser will not be.",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle L Baker",
      "helpful_votes": 7,
      "publication_date": 20180519
    },
    {
      "title": "Sent me a used product should have gave me a discount",
      "text": "I think this was used .when I got it was wet inside the cup battery out the box and signs of use and for almost 700.00 I'm angry!@@",
      "rating": 4.0,
      "verified": true,
      "author": "chrisdix",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Don’t order this worthless tool",
      "text": "The dam thing is worthless all my money down the drain",
      "rating": 1.0,
      "verified": true,
      "author": "Gene martinez",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Worth every penny",
      "text": "Very easy to use.I recommend looking in to extra tips for different paints . Made painting doors a breeze. Also the finish it leaves is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "keith hall",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "No oil base material allowed!",
      "text": "Do not buy unless you only plan on using waterbase material. In other words only if you live in California.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Bruner",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Used product!",
      "text": "I can't make this seller a zero or I would. This product arrived used with water in the unit. I returned it immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "stella",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Excellent gun, worth the bucks",
      "text": "I love this paint gun! easy to use, fast to set up. Cleaning up is a bit of a job, but sure beats my bigger unit.",
      "rating": 5.0,
      "verified": true,
      "author": "i.d.entity",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Well worth the money! Cleaning is a bit of ...",
      "text": "Well worth the money! Cleaning is a bit of a pain but that is expected. Put 1 gallon of paint through this already without any hiccups.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin R.",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Worked great. Went to use it again and gun wouldn’t ...",
      "text": "Used this one time. Worked great. Went to use it again and gun wouldn’t work. Pull trigger and all I got was the Led on the handle flashed and went out. Graco didn’t know why it wouldn’t work. Probably defective unit.",
      "rating": 1.0,
      "verified": true,
      "author": "William Holmes",
      "helpful_votes": 6,
      "publication_date": 20180523
    },
    {
      "title": "Very disappointed considering the price",
      "text": "First time I used it I got shocked every time I released the trigger. Then it stopped working all together. It worked for about 5 minutes total. Very disappointed considering the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaycee Tadlock",
      "helpful_votes": 5,
      "publication_date": 20180306
    },
    {
      "title": "One of my better tool purchases",
      "text": "I paint a lot of trim/baseboards/and so on. I have tried a number of different electric and pneumatic sprayers, but really wanted to try something cordless. This thing has blown me away. Easy to use, easy to clean, takes the dewalt batteries I already have (I recommend using it with the slimmer 1.5 or 2.0 amp batteries as they allow it to stand level and even. Also the liners that are used to fill the paint can be cleaned and re-used. So, if you do a lot of painting, I would recommend this. It is one of my better recent tool purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Egar",
      "helpful_votes": 0,
      "publication_date": 20201209
    },
    {
      "title": "Battery was damaged !",
      "text": "I got this graco cordless airless sprayer Sold By: Hearthshire and the battery was dead doesn’t wanna charge at all. It was weird since I got my package with the round clear tape broken on the box. So I returned it but had to deal with amazon because this Hearthshire company didn’t wanna give my money back. After several months got fixed by amazon who gave me credit for the he amount, after a year that I decided not to buy anything from Amazon, they send me a check. So check those batteries, charge them before start using them, because they say you can’t return if the sprayer it’s been used.",
      "rating": 1.0,
      "verified": true,
      "author": "Osimellow",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "Great for small jobs",
      "text": "This is an excellent sprayer. Paint goes on evenly and looks excellent when finished. The included battery packs will allow you to handle medium sized jobs without running out of power. However, it only holds a small amount of paint, so even for medium sized jobs you will have to refill the paint many times. A larger paint reservoir would probably make it too heavy to use, so I think they got the design just right. It does an excellent job and I'm very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigtasty",
      "helpful_votes": 0,
      "publication_date": 20201124
    },
    {
      "title": "Works like a dream",
      "text": "I've never used a sprayer till this. Easy to setup, easy to clean, make sure the little cap on the paint container is open when screwing the paint canister shut, then squeeze the air out of the paint bag and you'll be in business spraying up a storm.",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton",
      "helpful_votes": 0,
      "publication_date": 20201124
    },
    {
      "title": "Will have to replace pump and are very expensive",
      "text": "Very unhappy my sprayer quit working shortly after buying it",
      "rating": 1.0,
      "verified": true,
      "author": "Elijah kiihn",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Works great",
      "text": "Just purchased and only used once. Was surprised at the very brief learning curve and was very impressed with the result. I love it. I have ordered a variety of fflp tips for use in various applications. The only negative is that it came with a 32 oz. paint capacity. That requires frequent filling. So, I have also ordered the 42 oz. conversion kit and a 42 oz. liner pack.",
      "rating": 5.0,
      "verified": false,
      "author": "Dave & Jane Potter",
      "helpful_votes": 19,
      "publication_date": 20170507
    },
    {
      "title": "doesn't last long. Nice toy.",
      "text": "I actually have two of them. One was used a little bit frequently but less than 30 gallons total I think. Now the pump is very weak. Another one is pretty new however it only last one week and completely doesn't spray at all after less than 10 small uses.",
      "rating": 2.0,
      "verified": false,
      "author": "limi",
      "helpful_votes": 3,
      "publication_date": 20191128
    },
    {
      "title": "Great product",
      "text": "Easy to use, easy to clean and leaves a professional finish for small projects. I sprayed this flag I made and I was truly impressed with the quality.",
      "rating": 5.0,
      "verified": false,
      "author": "Mike Thomas",
      "helpful_votes": 2,
      "publication_date": 20200523
    },
    {
      "title": "Awesome!",
      "text": "Easy to use and nice compatibility with dewalt batteries. Pretty light too.",
      "rating": 5.0,
      "verified": false,
      "author": "Christine  De Sanctis",
      "helpful_votes": 0,
      "publication_date": 20201031
    },
    {
      "title": "Small jobs only",
      "text": "I am a pro painter. I have owned the pro shot and pro shot 2. The first model lasted about 3 gallons for a whopping $600. The second made it about 12 gallons.. These are not made for high volume use at all.. Its a throw away as the batteries and charger will fail also. Don't get me wrong I made some cash with them but they die quickly..",
      "rating": 2.0,
      "verified": false,
      "author": "Molly Buck",
      "helpful_votes": 21,
      "publication_date": 20171029
    }
  ],
  "product_meta": {
    "title": "Graco Ultra Cordless Airless Handheld Paint Sprayer 17M363",
    "description": "Ultra airless handheld sprayers are designed specifically for small interior, exterior and specialty projects. The true advantages of the Ultra handheld sprayers are the Perfect Airless Finish, ultimate portability on the job, and that it is ready to spray in seconds. Reverse-a-Clean X FFLP tip works on all Graco Airless Sprayers. Triax piston pump. FlexLiner bag system allows you to spray at any angle - even upside down. Fast and easy Pro-Connect pump replacement system. Procontrol II adjusts motor speed. Smartcontrol advanced pressure control. Powered by DeWalt XR 20V lithium ion system - spray up to 1 Gal. per charge. Painting contractors can easily spray those small jobs without having to start-up their larger airless sprayer. Sprays water & mineral spirits based materials. Includes: RAC X FFLP 514 tip, (2) DeWalt 20V Max Compact 2.0 Ah XR lithium ion batteries, charger, (4) 32 Oz. FlexLiner bags, and storage bag.",
    "rating": 4.3,
    "feature_bullets": [
      "Powered by DEWALT XR Lithium Ion System",
      "Perfect Airless Finish at Any Speed - Without Thinning",
      "Triax Triple Piston Pump with ProConnect",
      "Fully Repairable for Extended Life",
      "Uses RAC X FFLP Spray Tips"
    ],
    "specifications": {
      "Manufacturer": "Graco",
      "Part Number": "17M363",
      "Item Weight": "11.3 pounds",
      "Product Dimensions": "17.5 x 12.8 x 6.8 inches",
      "Item model number": "17M363",
      "Batteries": "2 Lithium ion batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Blue",
      "Item Package Quantity": "1",
      "Maximum Pressure": "2000 PSI",
      "Included Components": "Power-paint-sprayers",
      "Batteries Included?": "Yes",
      "Batteries Required?": "No",
      "ASIN": "B071CW2SV2",
      "Customer Reviews": "4.3 out of 5 stars123 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#55,382 in Tools & Home Improvement",
      "Date First Available": "April 19, 2017"
    },
    "categories": [
      "Paint, Wall Treatments & Supplies",
      "Paint Application",
      "Tools & Home Improvement",
      "Paint Sprayers",
      "Painting Supplies & Tools"
    ],
    "price": ""
  }
}