{
  "website_summaries": [
    {
      "verdict": "This sleek, space-saving bag is the ideal choice for professionals seeking to protect their garments and valuables.",
      "pros": [
        "Comes with ample compartments and pockets for ultimate storage and organization",
        "Rests on 4 swivel wheels for portability",
        "Includes pockets specifically designed to hold garments and suits"
      ],
      "cons": [
        "Particularly heavy despite small design",
        "Not a great pick for long vacations"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "As much as we hate having to use an airport",
      "text": "We travel a lot, or more to the point, we cruise a lot. As much as we hate having to use an airport, we need to in order to get to our ship. When cruising, you need dress-up clothes for formal nights, casual wear for casual nights and. of course, sports wear. That being the case, we generally have two bags each to schlep through the airports. We need bags that maneuver easily and these double-wheel garment bags fit the bill perfectly. They're easy to pack and easy to roll through busy airports. We purchased one and loved it so much we purchased a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Willa Steiner",
      "helpful_votes": 5,
      "publication_date": 20180808
    },
    {
      "title": "Good value for infrequent travel with a suit(s)",
      "text": "I was considering this bag and a Samsonite equivalent. I decided to give this one a try since it has spinners and is 50% cheaper. I find the build quality to be less than the Samsonite. The zippers are a bit rough on corners. There is no internal storage space except in the corners and on the flap of the fold over for the suit. I use packing cubes to take up the extra space and add more capacity to the bag. The handle is a bit flimsy, but works. The bag is a little taller optimal. The bag comes with one hanger and a detachable hook. I have checked the luggage once on travel, and it worked fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 4,
      "publication_date": 20180908
    },
    {
      "title": "Nice looking, very functional bag",
      "text": "Thanks to the other med student reviewer, I bought this for my pre-med student interviewee for his trips across the country. He preferred to not have to check a bag, and this bag fit the bill for 2- or 3-day trips. He is very happy to be able to stow everything in the overhead bin. Zippers are sturdy. My son decorated the handle with yarn, so the bag in the pics is personalized, and I snapped these after two trips, so the bag in the pics is not brand new. I would definitely buy this bag again.",
      "rating": 5.0,
      "verified": true,
      "author": "NorCalSteph",
      "helpful_votes": 3,
      "publication_date": 20181207
    },
    {
      "title": "Perfect for a weekend trip!",
      "text": "Bought this for the ability to bring it as a carry on for the plane since I didn’t want to risk my suit being lost for important events. The first time using it I was a little concerned it was too big and would be hassled by the airline but didn’t have any problems as a carry on and fit nicely in the overhead.",
      "rating": 5.0,
      "verified": true,
      "author": "Soxfan88",
      "helpful_votes": 5,
      "publication_date": 20180404
    },
    {
      "title": "Great price, sturdy, very pleased!",
      "text": "Gave this to my grown son for Christmas and he loves it! He travels weekly and was using an over the shoulder garment bag- says this was a game changer!",
      "rating": 5.0,
      "verified": true,
      "author": "Sophieg433",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Med student here traveling for interviews nationwide. Buy this ...",
      "text": "Med student here traveling for interviews nationwide. Buy this and be set. Fits my suit, extra dress shirts, steamer, dress shoes, socks, ties, pants, extra clothes, cosmetics, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Paras",
      "helpful_votes": 3,
      "publication_date": 20171215
    },
    {
      "title": "Had zipper construction",
      "text": "Zipper broke off... The bag size and internal space is great..BUT... The zipper finger grips came off (no, I didn't force the zipper)",
      "rating": 2.0,
      "verified": true,
      "author": "VPD",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Great garment bag",
      "text": "Terrific! Held 4 jackets and slacks, (could’ve held maybe more) room for other things as well. I bought to supplement my main bag and was not disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Taylor",
      "helpful_votes": 2,
      "publication_date": 20181215
    },
    {
      "title": "Good bag",
      "text": "Liked this bag a lot. Gave as a gift so not sure if he had any problems getting it through security but looked high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Tallen",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Five Stars",
      "text": "Great suitcase, Worked great for me on a business trip. Held my suit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo B.",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great bag for short trips",
      "text": "Met expectations for short business travel as carryon for both domestic and international travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Low quality",
      "text": "I bought this bag and the zipper broke within the first week. Other than that, it’s an ok bag.",
      "rating": 2.0,
      "verified": true,
      "author": "Will Belsterling",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Very good Garment bag!",
      "text": "Very useful, sturdy and it goes as hand-luggage in any flight!",
      "rating": 5.0,
      "verified": true,
      "author": "marconap",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Great little bag!",
      "text": "Worked perfectly. Was able to fit two suits and a couple dress shirts along with other clothing items - and was able to carry onto the plane with no issues. Probably only good for a short trips when you're packing light. Clothes unpacked with no need to iron. My only improvement suggestion is that the top/front portion could be made a bit more sturdy - as it collapsed a bit when I put my laptop case on top to allow me to roll both in tandem.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171106
    },
    {
      "title": "Four Stars",
      "text": "not bad quality and fitting your needs in short business trips.",
      "rating": 4.0,
      "verified": true,
      "author": "Ameerlh",
      "helpful_votes": 2,
      "publication_date": 20170705
    },
    {
      "title": "Five Stars",
      "text": "Perfect carry on size for air plane, good for a 2-3 day trip. Good quality luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaclyn Holland",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Too small",
      "text": "This is a nice looking garment bag and very durable but overall I was disappointed. It’s just not that practical. First off, it’s extremely heavy for how little it is... Not that it’s superheavy just more than one would expect. I did like the shoe pockets, they were nice and roomy. However , It was near impossible to hang my dresses nicely. I think all of the clothes ended up re-clear that had I just rolled them and put them in a normal suitcase.",
      "rating": 2.0,
      "verified": false,
      "author": "M. Buehl",
      "helpful_votes": 3,
      "publication_date": 20180207
    }
  ],
  "product_meta": {
    "title": "U.S. Traveler Freetown Carry-On Spinner Luggage Garment Bag, Navy, 21-Inch",
    "description": "Size:21-Inch| Color:NavyAluminum 4-stage telescopic push-button handle system in gun metal finish",
    "rating": 4,
    "feature_bullets": [
      "Riveted top carry handle for long lasting use",
      "Dual spinner wheels assure exceptional maneuverability",
      "Constructed of durable 100% polyester",
      "21x8x17"
    ],
    "specifications": {
      "Product Dimensions": "21 x 8 x 17 inches",
      "Item Weight": "10.12 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "Travelers Choice",
      "ASIN": "B07122XWZT",
      "Item model number": "US04003N",
      "Customer Reviews": "4.0 out of 5 stars31 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#1,077,950 in Clothing, Shoes & Jewelry",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Luggage",
      "Garment Bags",
      "Clothing, Shoes & Jewelry",
      "Luggage & Travel Gear",
      "All Departments"
    ],
    "price": ""
  }
}