{
  "website_summaries": [
    {
      "verdict": "If you take proper care of it, this gel eye mask is versatile and made for various uses, from puffy eyes to sinus headaches.",
      "pros": [
        "A large mask with eye holes and added space to cover the forehead",
        "Good choice for sinus problems and headaches",
        "Comfortable and well-fitting on most",
        "Has a cloth side for added comfort on the skin",
        "Gel-bead fill",
        "use warm or cold"
      ],
      "cons": [
        "Seems to be more sensitive to overheating in the microwave than some competitors",
        "Leaks with typical use have been noted"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Almost like an eye and face mask in one – has all the features users love plus the perfect design with eye holes so you can get the most out of using it, warm or cold.",
      "pros": [
        "Covers a larger portion of the face than other eye masks for optimal results",
        "Can be used warmed in the microwave or cooled in the freezer/fridge",
        "Has a soft cloth side and flexible gel ball fill for added comfort"
      ],
      "cons": [
        "Overheating it in the microwave may damage it, but as long as you are careful it will hold up to repeated hot and cold use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "headache relief",
      "text": "This mask is much better than clutching a big ice-bag to one's aching head. Cold (but not too much cold) is positioned in a good spot, and one doesn't have to lift and hold it in place. After about15 minutes, just reverse the mask to get more chill-effect from the other (non-padded side). I am waiting to see whether the little beads start falling out, as happened to me with a previous mask (different brand): meanwhile I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "diane",
      "helpful_votes": 3,
      "publication_date": 20191207
    },
    {
      "title": "Helps Sinus Headaches",
      "text": "I have used the Gel Bead Facial Mask from the freezer to my face on several occasions for sinus headaches. When the material side, which is very soft is not cold anymore, I turn it around and use the other side. Overall, I can get about 30 minutes doing it that way. It helps and I really look forward to using it when my head hurts. Glad I have it. I am considering getting another so I always have a frozen one available.",
      "rating": 5.0,
      "verified": true,
      "author": "SSH",
      "helpful_votes": 3,
      "publication_date": 20190629
    },
    {
      "title": "It is a good product for me. It is great in my opinion.",
      "text": "I have terrible pain in my eye and sinuses. This actually helped a lot. It did take me a few extra seconds to connect it in the back of my head due to the fact I do have a larger head then most. But it is very helpful to me. I did see most people use it cold but the heat is perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Malchiodi",
      "helpful_votes": 3,
      "publication_date": 20181211
    },
    {
      "title": "Just what I was looking for",
      "text": "I get headaches/migraines due to allergies and big atmospheric pressure changes. This mask has the perfect design because it hits all the areas of my face that tend to be affected by my headaches. I put this in the freezer to chill it and it doesn't take long to get to a temperature that feels therapeutic. I haven't tried it heated. I would definitely recommend this to anyone who suffers from frequent headaches.",
      "rating": 5.0,
      "verified": true,
      "author": "Dwoman",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Not designed for human heads; dwarf aliens maybe.",
      "text": "Here's the nitty gritty... The head strap is too short; barely wraps around my noggin, making it a literal stretch to secure and causing more pressure around my head (intended use is to relieve headaches). So, counterproductive. The nose hole is very small. Unless you have a very diminutive schnoz, the mask isn't going to fit right. And the big killer is that--fresh out of the freezer--this thing is completely thawed and warm in 15 minutes.",
      "rating": 2.0,
      "verified": true,
      "author": "BLUDVLZ",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Does Not Recommend",
      "text": "This thing literally exploded and melted all over the microwave during our first use. Would not purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mckie",
      "helpful_votes": 3,
      "publication_date": 20180807
    },
    {
      "title": "It's quality, but the eyes are a bit far apart.",
      "text": "I'm currently using this as relief from hot weather, and for that it works great! I also like that there's a fuzzy side, it feels really nice and quality. I do have a concern though, which is that the eyes are too far apart- you can see a column between your eyes, which can be distracting. I find myself looking to one side, using only one of my eyes in order to avoid it.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Must Buy",
      "text": "I’m so happy I got this it definitely helps with headaches. It gets the face in the right areas. I would highly recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Zahra Amiri",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Great facial mask!",
      "text": "It came quickly with good instructions. I love the way it covers the lower sinuses and well as the forehead..it has a really smooth covering that goes against your face (one of my favorite things about it). It stay cool for the length of time I needed it to.. thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "alice miller",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "The mask is comfortable with face-side fabric",
      "text": "The mask is comfortable with face-side fabric. It holds the temperature (cold) well. I use it mainly for sinus head/face aches, and it works well to soothe that.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane G.",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Too short  to cover  lower sinuses",
      "text": "Too short. From picture looks like it covers cheek sinuses, does Not cover lower sinus. needs to be larger",
      "rating": 2.0,
      "verified": true,
      "author": "Arthur Seiple",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Relief",
      "text": "I am constantly plagued with terrible migraines, and I have no idea why I didn't get one of these sooner. It helps so much. I like the soft lining on the back of it. It doesn't feel uncomfortable or itchy, which is so nice. It beats a cold wash cloth by miles. Also, the mask is light weight, stays in place, but easy to adjust at the same time. I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "not a sex toy",
      "text": "i used this for migraines and to refresh away the afternoon sleepiness. i also wear this to chase my husband around the house (it creeps him out) ...i did lose it for a few weeks. only to discover the cleaning lady put it in the sex you drawer... so...",
      "rating": 5.0,
      "verified": true,
      "author": "maryksc",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "It is a great facial pain and headache reliever it is AWESOME",
      "text": "I put this in the mask in the freezer before bedtime. Then when my Husband and I go to bed I grab it out of the freezer and where it while he is watching youtube. It is a great facial pain and headache reliever it is AWESOME! I purchased two so that I could give my best friend one just because.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Moxley",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Some Migraine relief",
      "text": "Use for migraine/headache relief by freezing. Works well. Some relief.",
      "rating": 4.0,
      "verified": true,
      "author": "TXMomma",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Great product for your face and even hits your temples",
      "text": "Great product for your face and even hits your temples. I needed this so bad for sinus pressure headaches and congestion and it was perfect. The only thing I would add is maybe some flaps for your eyes if you wanted to sleep with this on :D",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "I like it",
      "text": "I get the sinus kind of headaches behind and around the eyes. Looking at a screen 24/7 at work and playing video games has not been helping lol. You can heat it up but i like keeping it in the freezer the coldness really helps with the pressure around my eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Lack of cooling on my eyes",
      "text": "I tried it. Put it on my face for 10 mins while I was lying down. I could generally feel that it was cool, after about 5 mins. Yet, it did not necessarily give my eyes a cooling feeling. I did not notice any difference in the appearance of the bags under my eyes.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great for sinus pain/ pressure relief!",
      "text": "My HS age daughter ordered this for her allergy/ sinus infection issues. She used it the same day it arrived ( currently has another sinus infection) heated it according to instructions and she loved it! Helped relieve the sinus pain and pressure!!",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Great for migraines!",
      "text": "I suffer from chronic migraines and find that icing my face really helps take the edge off. This is a great products. It stays cold for a decent amount of time and fits perfectly on my head without being too loose or too tight",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Works Great",
      "text": "I love this thing and it was so nice to have when I had a sinus cold.",
      "rating": 5.0,
      "verified": true,
      "author": "kmdbkd",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great way to remedy migraines!",
      "text": "I love this mask! Used for hot days but especially for migraines!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Ladd",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Just what I needed",
      "text": "I run hot, and it can be hard to sleep sometimes. I love taking it out of the freezer and putting it on while I'm going to bed to cool down.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Ostendorf",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Works great",
      "text": "Works great, been using it Cold have not tried the heat. Only issue is the eyes are a little far apart making it difficult to see if I’m trying to read or watch tv. Otherwise love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Church",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "cool costume",
      "text": "If you want to look like something out of Star Wars, buy this mask. Also buy it if you expect to keep having headaches. That's what I did. Every time I have one, though, I forget I own this mask. I can't really tell you if it works, but my freezer sure has taken to it.",
      "rating": 5.0,
      "verified": true,
      "author": "ThisIsAMonopoly...but convenient",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Love it",
      "text": "I had eye surgery which caused swelling to the entire upper side of my face. This mask, used cold, has been a tremendously helpful in helping with the swelling and immense pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Sinus pressure relief.",
      "text": "I suffer with allergies and sinus I pressure. After easy heating I wear this mask and instant pressure relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris Harcek",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Five Stars",
      "text": "Fits my face great and super comfortable! The inside lining is very soft and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Great for headache",
      "text": "This is great for headaches. Stays soft when frozen, I just wish the eye openings were a little better but I still like it a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Robynn",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "but it feels really good!",
      "text": "Only stays cold for about 30 minutes, but it feels really good!",
      "rating": 3.0,
      "verified": true,
      "author": "Teddy",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Great for migranes or stress",
      "text": "I love the velcro on this mask so that you don't have to hold an ice pack on your head. I use it almost every night to go to sleep. I now have two so if I lose one I have a backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Very comfortable and more importantly",
      "text": "Everything I expected and more. Very comfortable and more importantly, it works!! Thanks for paying attention to detail.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Four Stars",
      "text": "It works as expected helped my wife with her headaches.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony G",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Works well for headache",
      "text": "Great for sinus congestion and headache! The mask fits over my face comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Heyward",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Comforting and Comfortable",
      "text": "Love this mask. it is so helpful with the sinus headaches.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna D.",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Great!",
      "text": "This mask is great. I’m a migraine sufferer and it’s a life saver. Great quality and great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Cool/ hot me",
      "text": "Love the coverage it gives me and the lining is so much more comfortable than others I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith A.",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "... as I need something that is colder and has better compression under my eyes",
      "text": "I had to return it as I need something that is colder and has better compression under my eyes. I went back to my frozen spoon!",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer S.",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Mask feels amazing!",
      "text": "I loved the softness of the mask, I used it after lower eyelid surgery. It was way easier and far more comfortable than using wet gauze pads. I even went to sleep with it on and just peeled it off when I wanted to during the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Zandra Adams",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Five Stars",
      "text": "nice thing to use while watching TV or while doing something , very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Naran Sagaraajav",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Toxic smell toxic ingredients PVC",
      "text": "The item is made from pvc plastic. It is completely toxic!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "It works well at first, but it loses the ...",
      "text": "It works well at first, but it loses the cold VERY quickly and takes a few hours to re-freeze, so it's just not all that practical.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Elliot",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Love it!",
      "text": "Love these masks! I just ordered my second one :)",
      "rating": 5.0,
      "verified": true,
      "author": "Iolanda Macauda",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Everything looks nice. It’s a gift for Xmas",
      "text": "Everything looks nice. It’s a gift for Xmas, so I have not personally used it. But I think it will be well received. Quick delivery, thanks so much.",
      "rating": 5.0,
      "verified": true,
      "author": "MDrivas",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Five Stars",
      "text": "I suffer from sinus issues and migraines and this product helps tremendously!",
      "rating": 5.0,
      "verified": true,
      "author": "lauren",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Perfect for Migraines",
      "text": "Works perfect for stubborn migraines that pound through my eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma DuRoss",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Love that it has 2 different sides (cloth and plastic) ...",
      "text": "Large, cooling. Love that it has 2 different sides (cloth and plastic) for different temps.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Super soothing!",
      "text": "This mask is so soothing. It cools all of the right places on my face.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Enright",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "GREAT for sinus/tooth area pain!",
      "text": "GREAT for pain in sinus area--brows, between brows and cheeks! I love the soothing cold of ice. Can also be warmed in microwave if preferred. I got the full mask since I anticipate some dental work, and am already sure this will really help. The very soft thin layer of fabric is perfect to let the cold through, but not enough that I have to wait at all to use it straight out of the freezer. The two elastic bands with a little bit of velcro holds it in place in the back even enables you to get up and walk around. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Soft mask that conforms to your face and feels great",
      "text": "Bought this to use when I have a migraine and it is amazing! It does such a great job of helping my head not pound quite as much. It is comfortable, soft, and conforms to your face. I've tried other masks in the past and they come out of the freezer hard as a rock a do not conform to your face. Not this one! It's great!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "SORELY DISAPPOINTED",
      "text": "Should have known by the picture, my error there. I bought it for sinus pain. Doesn't cover enough of the sinus'. Not large enough to use for migraines. Used it for my knee once, same problem. Too small and thin so it loses its heat and cold very quickly. I had one before, so I am comparing it to that one. Problem there was I put it in the microwave to long twice and the beads started dissolving.",
      "rating": 1.0,
      "verified": true,
      "author": "Beverley Colville",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Average product, great seller",
      "text": "The five stars are for customer service. This seller is excellent. The product isn't perfect and I had a concern about comfort and fit. I contacted them and they honored their guarantee. I am very happy with the experience and highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs S",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "I does what it's supposed to",
      "text": "We loved this product so much we order two more . Heated or Frozen the relieve headaches or sinus pressure. We must admit the we both prefer to use then Frozen. tey relief our sinus headaches about when the mask gets unfrozen. Approximately 5-7 mutinies. The straps are the key!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Fleischer",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Helps sinus pressure headache",
      "text": "I didn't consider just how much this would make me look creepy. I suggest getting the blue color to mitigate that lol. But it works! I got it for my intense sinus pressure headaches and it helps. The cold only lasts about 10-15 minutes and I'm always wishing it lasted longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis and Ella",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Looks perfect",
      "text": "I haven't used the mask yet, but it looks perfect for my purposes. My husband needs it for sinus headaches and I need it for my eyes. A hot compress works for both of us, so the little mask should work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Caldwell",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Nice Quality, Great for Migraines",
      "text": "Bought this for my sister who suffers from periodic headaches, she uses this when she feels a migraine coming on and says it really helps to prevent it. I've also been told its great to reduce puffiness after you wake up. Also the quality is quite nice, with soft fabric on one side.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "I got it to use cold because of bad headaches. When it freezes it doesn't move easily ...",
      "text": "I got it to use cold because of bad headaches. When it freezes it doesn't move easily so when it's on your face it doesn't help as good as one that isn't a mask. The eye holes are also a little awkward. If you're not getting it for headsche purposes I can see it working fine though.",
      "rating": 3.0,
      "verified": true,
      "author": "Becca14",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Really Useful",
      "text": "Used this pre- and post-sinus surgery, and it was just super! The fabric side is very soft and skin-friendly, and the eye cutouts made it easy to use while reading or watching the tube. Cold or hot, I recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Scorched Earth",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Dont buy",
      "text": "Only had it September and it's already cracked only use a few times. Very upset I want a new one shipped for free",
      "rating": 1.0,
      "verified": true,
      "author": "juan vega",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "great product helped with swelling from a awful product hourglass ...",
      "text": "great product helped with swelling from a awful product hourglass vanish which I got a severe allergic reaction from and very angry at the vendor!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "cynthia lockyer",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Great med freefor headaches",
      "text": "Very comfortable on the face. Love that it is bigger than gel eye masks. Use for headache esp Sinus or Migraine",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Young",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great mask!",
      "text": "I have only used it cold so far - very soothing for my migraines.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie Mecca",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Fantastic product!",
      "text": "I got this mask for my wife and she loves it! She already looks young but looks even younger by using this mask! I also use it to if I have a headache and it works wonders. Fantastic product!",
      "rating": 5.0,
      "verified": true,
      "author": "MARK R.",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Facial mask",
      "text": "Mask covers a large area of the face and is effective reliving pain. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Schmotzer",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Well made",
      "text": "The product is well constructed and made of quality materials. I like that there is a fabric layer toward the face.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathe Eastham",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Very good product. Better than the plain eye ones!",
      "text": "I love the size of this mask. It helps with sinus pain as well as eye discomfort.",
      "rating": 5.0,
      "verified": true,
      "author": "kattie",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "wonderful",
      "text": "I highly recommend this mask. I does wonders if you have sore eyes and a headache. It's also very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "R.D.",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Absolutely love it. Just what I needed",
      "text": "Absolutely love it. Just what I needed. Hace been fighting a severe sinus infection and was needing a mask this size. Coukd not find it any where else. Thanks so much. Will be more than happy to recommend you to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "It’s a good mask. Does not stay cold very long and ...",
      "text": "It’s a good mask. Does not stay cold very long and needs to be a bit more pliable so more than just the tops of your cheeks get cold. I would like it to be a bit tighter. Other than that it did the job I needed..",
      "rating": 4.0,
      "verified": true,
      "author": "VirtualSol",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Cool Eye mask",
      "text": "Very nice to use in the morning before putting on makeup.",
      "rating": 4.0,
      "verified": true,
      "author": "maestraleonard",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Cool and it works",
      "text": "I bought this for my husband. I ordered gray a more manly color. He loves it. He wanted it for his puffy eyes. I want to try it too but I haven't yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Purchased as a gift",
      "text": "I'm sure the gel eye mask will be great. Purchased as a gift. Mask arrived quickly as promised and is packaged well for gift giving.",
      "rating": 5.0,
      "verified": true,
      "author": "tewstew",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Awesome!",
      "text": "I have used this for cold-use only. I suffer from frequent headaches and migraines, and after a while with this on-I get relief!",
      "rating": 5.0,
      "verified": true,
      "author": "GJtexas",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "made the swelling go down and made him more comfortable",
      "text": "My son in law had surgery on his sinuses face was swollen, made the swelling go down and made him more comfortable",
      "rating": 4.0,
      "verified": true,
      "author": "Holly Reeder",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Five Stars",
      "text": "I felt better the next night. I've only had it a couple of days but I have good vibes.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Rugg",
      "helpful_votes": 0,
      "publication_date": 20171129
    }
  ],
  "product_meta": {
    "title": "Hot and Cold Therapy Gel Bead Facial Eye Mask by FOMI Care | Ice Mask for Migraine Headache, Stress Relief | Reduces Eyes Puffiness, Dark Circles | Fabric Back | Freezable, Microwavable (Gray)",
    "rating": 4.3,
    "feature_bullets": [
      "THERAPEUTIC EFFECT: Hot and Cold therapy reduces swelling, discomfort and pain caused by inflammation, injury, post- surgical pain & burns. It restores flexibility in a wide variety of ailments including muscle pain, spasms & soreness, arthritis. Great for swollen and puffy eyes, dark circles, sinusitis, sinus pressure, head colds, fever, muscle aches and stiffness, insect bites, sunburns, stress, fever, migraine or headache relief.",
      "DUAL SIDED, CUSTOM, SECURE FIT FULL COVERAGE FACE MASK: Made to have an exact and comfortable fit for your face, with openings for your eyes and nose, allowing you to use it without disrupting your routine. Designed with an adjustable, firm fastener closure to adjust around your head for a secure and custom fit. At 4.75\" x 11\", it completely covers the sinus, forehead, and cheeks. One side has plush, soothing fabric backing for a more comfortable, spa-like experience.",
      "EASY TO USE: Simply place in refrigerator or freezer until desired temperature for a cooling or ice pack effect. For hot use, place in microwave using the indicated time on the instructions. The eye mask is then ready to relieve your swelling, aches and pains!",
      "FLEXIBLE, REUSABLE, SAFE: Made from non-toxic materials with premium PVC cover, it is safe and resists tearing and leaking. Remains flexible even while hot or cold, allowing it to conform to your eyes and sinus area and reach deep into the tissue to reduce pain and tension. It can be washed by simply wiping it down.",
      "VERSATILE: In addition to covering the eyes, the mask can be used for the head, back, neck, shoulders, arm, elbow, wrist, back, knee, shin, foot or ankle. It is perfect for travel, meditation, yoga, or relaxation. Just place it where it's needed and relax!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "8.6 x 5.1 x 1 inches; 8.64 Ounces",
      "Date First Available": "May 1, 2017",
      "Manufacturer": "FOMI",
      "ASIN": "B0713WH8Y7",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "Cold Packs",
      "Hot & Cold Therapies",
      "OTC Medications & Treatments",
      "Health & Household",
      "Pain Relievers",
      "Health, Household & Baby Care"
    ],
    "price": 12.49
  }
}