{
  "website_summaries": [
    {
      "verdict": "The D-Link DIR-822 wireless router offers good close-range throughput performance and some useful management settings, but it isn't as feature-packed as some of its competitors.",
      "pros": [
        "Solid close-range throughput performance in testing",
        "Good QoS engine",
        "Easy to install"
      ],
      "cons": [
        "Middling 5GHz long-range throughput and file-transfer speeds",
        "Lacks built-in malware protection",
        "Limited parental controls"
      ],
      "aspects": {},
      "publication_date": 20180626,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Garbage wireless",
      "text": "Wireless settings kept reverting to factory default. Range was non-existent. Xbox when connected would show no download speed and 1 Mbps upload. Constant disconnects of most wireless devices. Terrible UI with limited settings. My four year old router blows this one away with stability and speeds. I reset to defaults, upgraded firmware, nothing solved my issues. This router is hot garbage! Avoid at all costs!",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Board",
      "helpful_votes": 64,
      "publication_date": 20181013
    },
    {
      "title": "It's a lemon router",
      "text": "This router was easy enough to set up and allows for control of each devices internet access. I thought it was perfect for the first 3 months, but we've just started month 4 and we have a problem. It's constantly losing wifi connection. I've rebooted twice in one week and this time the reboot didn't fix the connection. I'll call DLink support tomorrow after work, but I'm not hopeful. Started researching how others have fixed the problem and the only permanent fix is a new router. I'll update if I do find a solution.",
      "rating": 1.0,
      "verified": true,
      "author": "cdrod",
      "helpful_votes": 37,
      "publication_date": 20180708
    },
    {
      "title": "Not all ports will work at full speed",
      "text": "After you plug the ethernet cable from your router into a port, you will have four more ports available. Expect to get inconsistent results. I tried all four ports INDIVIDUALLY and found one them was outputting at only 2 Mbps while the others were outputting at 400 Mbps+ (I have gigabit service). Ordered a replacement and found the same thing with the replacement. Same cables used, same computer. Moreover, the \"bad\" port will move. One time it might be port 4 and next port 3, etc.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeffrey N. Wilens",
      "helpful_votes": 21,
      "publication_date": 20181121
    },
    {
      "title": "Good Cheap Small Switch",
      "text": "OK. Let's be clear about what this product is. It is a very simple unamanaged Gigabit ethernet switch. As such you expect it to do 1 thing. Allow you to take 1 connection and turn it into more than 1 connection. The good news is this does that. There is no bad news. It just works. Pros: - No Setup - Plug it in and it works. - No noticeable speed degradation. I don't have test equipment to verify it gives full Gig E Speeds, but it works perfectly well with my multiple video streaming devices connected to it. Cons: - None. It just works. If you are looking for a good cheap switch you won't go wrong with it.",
      "rating": 4.0,
      "verified": true,
      "author": "--chris",
      "helpful_votes": 36,
      "publication_date": 20160821
    },
    {
      "title": "So far so good. I was using a 7 year old bottom ...",
      "text": "So far so good. I was using a 7 year old bottom end router. Over the years we have added electronics that use wifi. Currently we have 12 different items that use the wifi. The house is a 2 story 1600 square foot bi-level home and the router sits down stairs. After switching to this router I have not experienced any lag in gaming and both roku's don't stop for buffering. The range is excellent and the speed (both upload and download) are at what we are paying for. I would highly recommend this router to anyone with a lot of stuff in there house that uses wifi.",
      "rating": 5.0,
      "verified": true,
      "author": "victor",
      "helpful_votes": 16,
      "publication_date": 20180520
    },
    {
      "title": "Huge Improvement Over Verizon Router",
      "text": "Even though I have Fios, my internet connectively was terrible. The issue was clearly the Verizon router (that I was stupidly renting from them) because when I connected directly via Ethernet cable, the speed was fantastic. It took some finagling as my ONT data port was for Coaxial only, so I had to call Verizon and get them to switch it over to Ethernet. But once I did that, the setup on this router took less than 5 minutes, and as you can see in the speed tests, this router is awesome. The test was run from a room away from the router with several other devices connected at the same time. Yay!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura S",
      "helpful_votes": 11,
      "publication_date": 20190220
    },
    {
      "title": "A very compact switch, no setup needed",
      "text": "This switch is very compact and works right out of the box with no setup. I am using it to share a single network connection between three computers -- a tower computer running Linux, a Raspberry Pi acting as a print server, and a Mac. The picture shows it with a Raspberry Pi for size comparison. Things I like: 1. the network ports are on the back 2. activity lights are on the front Minor things I don't like: 1. I would rather the power adapter socket was on the back rather than the side 2. The bottom lacks anti-skid rubber feet, though these can easily be added",
      "rating": 5.0,
      "verified": true,
      "author": "Electronics for Dogs",
      "helpful_votes": 12,
      "publication_date": 20180207
    },
    {
      "title": "Needs to reboot regularly",
      "text": "Yes, it crates an AC & BGN network. Unfortunately I have to reboot it on a regular basis to keep the networks up and running. I expected much more than this from D-Link. The unit has a 90 manufacturer warranty and its just past that date. Today I've reset it at least 10 times. I would like to blame it on Spectrum but it's the AP networks that disappear, not the Spectrum. Oh well ... guess I need to start looking for another one.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Whittemore",
      "helpful_votes": 12,
      "publication_date": 20180309
    },
    {
      "title": "Quality product and easy setup.",
      "text": "So Far so good, Only reason I changed it was my second DR-655 was 4 years old Comcast doesn't support it anymore and D-Link finally sundowned it after 16 years as of July 1, 2018. Plus my throughput was not what I was paying for. Excellent throughput and easy setup and fairly good user interface. Used D-Link for years now and this one feed an older Gig, 5 port switch. All new Cat7 cables make a difference. Most impressed with the setup and throughput of the dual band Wifi and load handling. It runs a tad warm to me, so make sure it has ventilation. Be sure and register the product for support from D-Link if you need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alchemy819",
      "helpful_votes": 8,
      "publication_date": 20180706
    },
    {
      "title": "The most up-to-date router under $200.",
      "text": "This DIR-2660 is quick & easy install via the D-Link ap. It delivers WIFI speeds at about 95 percent of what our ISP claims in our 3100 sq. ft. house. With 1 Gigabit WAN in & 4 Gigabit out ports, plus 1 USB 2 and 1 USB 3 ports, it can handle a network backup drive. It's mesh capability makes its coverage area expandable. The D-Link ap and the 5 year McAfee security put this ahead of others. Those who want to get under the hood for customization wouldn't love it, but for non-techies, it's ideal.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky T",
      "helpful_votes": 5,
      "publication_date": 20191212
    },
    {
      "title": "Blazing fast",
      "text": "Just updated from the 868L. Blazing fast once you get the settings correct and that took some trial and error. (make sure you change the Wi-Fi channel if you get super slow speeds after set up) Was able to download a 20GB game while watching a movie on line without any issues buffering for the movie or a slower download rate for the game. Minus one star for having to go into the router management program to enable the 2.4 and 5Ghz every single time you have to reboot the router. Every. Single. Time.",
      "rating": 4.0,
      "verified": true,
      "author": "rae",
      "helpful_votes": 9,
      "publication_date": 20180507
    },
    {
      "title": "Very Disappointed!",
      "text": "I was very disappointed in this product. Coverage was similar to my Netgear 1750, but internet speeds were considerably slower. I also have issue with some of the software choices that D-Link made, such as only allowing reserved IP address for 24 devices and no option for DHCP leases to never expire. Even when leases were set to the max time, the router dropped connection with devices constantly. This caused several devices to enter a reboot loop trying to reconnect. If this is the D-Link standard I will not buy buying any of their products, and I have already returned this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Leonardo di ser Piero da Vinci",
      "helpful_votes": 6,
      "publication_date": 20181218
    },
    {
      "title": "DIR-3060 - Many features not working with firmware load 1.11",
      "text": "Well, after 20 years, I can no longer be a D-Link user. The new firmware load (1.11) for the DIR-3060 router is still not allowing certain features to work (like QoS and 5GHz channel selection). This was a problem with D-Link routers back in 2005!! It's 2020 and I'm still trying to get simple features to work. Frustrated and a little sad. Going to ASUS. I'm sure they'll eventually fix the firmware after all the help I gave them, but I can't wait for that due to everyone working from home these days.",
      "rating": 1.0,
      "verified": true,
      "author": "Smudgy1",
      "helpful_votes": 3,
      "publication_date": 20200710
    },
    {
      "title": "Fast, easy-to-set-up, reliable router at a great price (unless you are Wi-Fi Junkies, needing more \"speed,\" i.e., 1500 or 1900.",
      "text": "Bought this to replace a SEVEN-YEAR OLD A/G/N router, also a much earlier D-Link model (the DIR-655). The new one is far more (physically) lightweight, but who cares? Because it's setup software and \"admin dashboard\" are FAR, FAR better and easier to use than the old model. AND (to our amazement), even our home-wide Ethernet network (wired) is MUCH snappier than with the older model. Progress! We only have Wi-Fi for (frequent guests), but this IS a dual-band \"AC\" (the successor to \"N\") model, at \"only\" 1200 speed, which is fine for the freeloader visiting us. Ha ha. We bought another D-Link because the first one has been SO reliable (it was still chugging along, albeit slowly). Thanks, D-Link",
      "rating": 5.0,
      "verified": true,
      "author": "oh-please",
      "helpful_votes": 5,
      "publication_date": 20180606
    },
    {
      "title": "Impossible to configure",
      "text": "Nothing worked as advertised. We had to perform at least 15 factory resets as the router would freeze and/or drop all connections (including the admin console). When it would work for basic wifi it had to be powered on/off at least every other day. Maybe we got a defective product as many other reviews were positive but we gave up. I have a day job and it is not network administration.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180908
    },
    {
      "title": "Huge disappointment from previous D-Link Router: EXO AC2600",
      "text": "If you want something that just works then you'll probably be okay with this router. Good coverage and what appears to be good speed. However, if you like to exercise any control over your router you can forget it with the EXO AC2600. The GUI options have been severely limited from what previous D-Link routers afforded. It's impossible to get IPV6 working with Spectrum, although the ASUS Blue Cave I tried had no issues. Want to see the network speed of a specific device? NOPE. Like the Smart Connect feature, but would like 5GHz capable devices to connect to the appropriate frequency. NOPE, not if smart connect decides otherwise. How about viewing bandwidth for individual devices? NOPE.",
      "rating": 2.0,
      "verified": true,
      "author": "Ernest Pergrem",
      "helpful_votes": 2,
      "publication_date": 20190213
    },
    {
      "title": "Geared more towards novice users",
      "text": "I'm not a fan of the new user interface as it's hard to find the options I'm used to. My old D-Link router seems to have had more features than this one does. Things like seeing who is connected to the network and assigning static IP addresses definitely could use improvement. I also keep having issues with the WiFi signal randomly dropping. There seems to be less issues after turning off the Smart Connect option, but it hasn't completely cleared it up.",
      "rating": 3.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 6,
      "publication_date": 20180623
    },
    {
      "title": "Easy setup, but network knowledge helpful",
      "text": "I did love the easy setup (some network knowledge is definitely helpful). The difference was instant in my WiFi network. I have knowledge of networking which made it easy. I could update the configuration without problem. I have a bridge that connected with it without any issues. The only minus was there was no real \"quick/easy\" setup manual. You basically just scanned the QR code. If this is the first time setting up a network, might be a little tricky.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Taylor",
      "helpful_votes": 2,
      "publication_date": 20191213
    },
    {
      "title": "Worst router ever...",
      "text": "Possibly the worst \"upgrade\" I've done in my life. Bought this thinking I needed an upgrade for an old MSI router that didn't have a great range, but I'm regretting it every minute. While the D-link do offer a better 2.4Ghz range, the 5.0 channel won't reach a Roku stick 9 feet away, I found myself having to restart the router at least once a day as it suddenly stops working. I've the latest firmware installed (from 2016) and haven't found a solution. Would never buy another D-link product in my life.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20171114
    },
    {
      "title": "Upnp is a nightmare on this thing",
      "text": "Ever since the firmware has been updated to 1.11 my HDHomeRun on my network is no longer getting detected by Plex server. Not even with manual connection. With my other router everything works just fine. Also with other upnp devices they cant seem able to connect in direct mode but always resolve into relay connection. I dont know else did under the hood. Configuration page is very minimal, its like being made to a person dont know anything and expected that person to just set their wifi and thats it. Smart connect function is also stupid. want my money back if I could.",
      "rating": 1.0,
      "verified": true,
      "author": "Elektrokoy",
      "helpful_votes": 2,
      "publication_date": 20190222
    },
    {
      "title": "Very easy set up and excellent range.",
      "text": "I upgraded from an older Netgear router and the difference is absolutely stunning. My house is roughly 2800 sq. ft and this routers wi-fi easily covers the entire house with no loss. I even tested my entire property (roughly 9000 sq ft) and there is minimal loss at the edges of the property. This allows for me to use Skype with the grandparents while playing outside with my daughter; VERY HAPPY ABOUT THAT. We have 3 adults and 1 child living here. Multiple xboxes, cell phones, smart TVs and computers. ZERO ISSUES. Beyond satisfied with this router. It checks all the boxes: easy set up, fantastic range, no issues with multiple devices, and looks good!",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Wireless networks are god awful.",
      "text": "Scratching the surface, this seemed like an amazing modem to have. Really easy to set up, use, everything was great. The biggest problem I had and that I've seen others have is the wireless networks failing. I've never had issues with any routers or modems in the past, no interference in any way. The wifi just stops working. Wired always seemed fine, no issues there. But wireless often disconnected or just wouldn't work unless I restarted the modem. I believe this was because of the 2G and 5G networks being combined into one. I made sure the latest firmware was installed and essentially tried about every workaround online to no avail.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 3,
      "publication_date": 20190218
    },
    {
      "title": "Vpn server is hard to set up",
      "text": "I really did not test all aspects of this box. My goal was to see if I could create a vpn server on it. On that I failed miserably. The interface was difficult to use, the documentation poor and I ended up sending it back as it did not do what I wanted it to do. For one I was unable to create static routes to manage internal traffic to my network.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Salmon",
      "helpful_votes": 2,
      "publication_date": 20200105
    },
    {
      "title": "Worked great for few weeks, then died",
      "text": "For the first few weeks, we were amazed at the difference this unit made over our old airport extreme. We finally saw the signal speed we were paying for. But almost 4 weeks in and my phone, computer and apple tv could no longer log on. Everyone else in the house saw dramatic decreases in speed. Did numerous resets and the same issue. When I did a hard reset, it rebooted but never sent a 5g or 2.4 signal again and became useless. The increasing instability and flaws make this router not worth buying.",
      "rating": 1.0,
      "verified": true,
      "author": "Vincent Donnachie",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Cannot bypass setup wizard",
      "text": "Wanting to slowly cut the Comcast cable - one step at a time - this DLink device was first intended to be a WiFi hotspot with DHCP disabled to test the WiFi coverage and determine optimum device placement, but the setup wizard cannot be bypassed to get to the configuration screens and DLink requires a modem to be connected to satisfy the setup wizard. Thus without a modem this device is useless. I have no modem yet (my Comcast device has integrated wifi router and does not act as a stand alone modem) - as I'm not ready to cut the cable. Returned for a 20% restocking fee - thanks D-Link for all your innovations.",
      "rating": 1.0,
      "verified": true,
      "author": "cable",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Good wired speeds; wifi coverage horrific",
      "text": "I get excellent speeds with a wired connection but the wireless range, despite the many antennae, is horrific. In our wood-framed (not brick) home, the wireless range doesn't even make it 50ft. Even worse, the wireless network continually drops (even when sitting right next to it). The USB HDD features are good but the transfer speeds to/from connected USB devices is slow as molasses (even on a wired connection). I bought this based on brand reputation, reviews, and specs but it has been nothing but a disappointment. I do not recommend this router.",
      "rating": 2.0,
      "verified": true,
      "author": "Justin P",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "This thing is a BEAST!",
      "text": "I wanted to have a fast connect in the house for my TV's and all the electronics in the house. Absolutely no lag, lost connection (Well once but it was the router in question), I even had a full connection on my phone 200' away in the woods at the creek on my property. I kept my old connection on my surfboard for guest to connect and turned off the 2.5 network so our personal use will connect automatically to the 5 GH network. I would definitely recommend this to my friends without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Huckleberry Ken",
      "helpful_votes": 2,
      "publication_date": 20190115
    },
    {
      "title": "Disappointing Performance.",
      "text": "Originally installed this in the same spot where my 10 year old Netgear router resided and worked flawlessly. Hooked it up and realized that it had nowhere near the range my old router did. Also purchased a range extender... but couldn't get them to pair up. Ended up moving the router to a more central location which solved the pairing issue. Ended up keeping the old router hooked up to run some of my smart switches since they didn't want to work with the new one. Also, the app doesn't have many features. Would have returned the whole setup if it wasn't such a hassle.",
      "rating": 4.0,
      "verified": true,
      "author": "John ",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "5Ghz channel not usable for video streaming, even setting it up manually.",
      "text": "Good for the money but limited settings, and 5Ghz channel is a joke for smart TV streaming video, not able to use it on 5Ghz. Had to use 2Ghz, in order to get 4k videos straming in Youtube and Netfli , in 5Ghz not even get 720p and it lags like an EDGE Mobile data. I have changed the channels numbers and wifi analyzer, also changed band frequency on 5Ghz, but it doesn't improve anything.. If you are looking for a desert dual band router for video streaming don't go for this. Get something better. Good for regular internet use good signal due to four antennas but that's all.",
      "rating": 3.0,
      "verified": true,
      "author": "Sniper",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Not recommended product",
      "text": "Tech support couldn't able to find the issue and asked me to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "raja",
      "helpful_votes": 3,
      "publication_date": 20200628
    },
    {
      "title": "Before you return because dlinkrouter.local Error",
      "text": "Got this router and on set up got an error trying to access the router. You will find all sorts of IP manual crap solutions that are so complicated that the average person wont understand. To solve the issue all you need to do is connect you PC directly to the router with a LAN cable for the first time. After you finish the initial set up you are free to use the wifi. I am extremely happy with this router my speed went from 20 Mbps average to 80 Mbps average. Comcast MA.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold Pineiro",
      "helpful_votes": 2,
      "publication_date": 20200713
    },
    {
      "title": "D-Link AC2600 slow performance",
      "text": "This D-Link EXO AC2600 is a waste of money. I bought and installed it per the instruction, but I did not notice any change in internet speed compared to my old router that was provided by the cable company. The max speed I can get using the 2.4Ghz was 26Mbps download and upload. My old router actually provided higher speed. I spent 1.5 hours with the tech support on day 1 to fix the issue, but that did not help. I am very disappointed and frustrated. I will call support once again and if they can't fix the speed, I will return it.",
      "rating": 1.0,
      "verified": true,
      "author": "nbasta",
      "helpful_votes": 5,
      "publication_date": 20180619
    },
    {
      "title": "Great Switch...be sure to carefully count the ports you need.",
      "text": "Simple to set-up and works seamlessly. My only suggestion would be to add mounting holes on the bottom to allow mounting on a panel or wall. One warning to those new to network equipment: 5 ports means that you can connect up to 5 RJ45 connectors. If you are connecting to a network, be sure to count that connector (i.e. network plus 4 devices). These smaller switches seem to fill up fast. In my office I have 1 port to the larger network, 1 port each for my laptop, scanner and printer (my scanner and printer are stand alone). That leaves only one free port.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul T. Ushijima",
      "helpful_votes": 2,
      "publication_date": 20180307
    },
    {
      "title": "What happened to D-link?",
      "text": "I have used around a dozen different manufacturers and many D-link routers. This router by far had the worst UI I have ever used. Additionally, we had frequent internet drops as well as slowed service. We went from 115Mb downloads to 60Mb even after using the QOS option. There was no 5G option, and it was impossible to use the cellphone application with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "It's Chuck Norse",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "I trust D-Link. Used them for years. Never let's me down. This is no exception",
      "text": "Was on the fence about getting this because it was pretty inexpensive compared to some. But I got it because I've had good luck with D-Link switches for decades. This is a sharp looking ultra small and light weight unit. The wall wart to power it is big and cumbersome by comparison. As long as you can hide the wall wart, this thing looks really great, and it's hyper-fast. I got it to replace my formerly high end 100MBPS switches that were quit sharp in their day. This is smaller and tighter and nicer. Takes up less space and looks great and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Fixer-upper",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Issues with consistent connections",
      "text": "This router had issues maintaining consistent connections to Tablo, Ring, Amazon, and Apple products. I had to do a reboot 2-3 times a day to reestablish connections. I've spent countless hours with multiple tech supports, and it always came back to the router.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 2,
      "publication_date": 20200728
    },
    {
      "title": "Meh.  Software is very basic.  Not very configurable.",
      "text": "I have used a Synology router for 5+ years. In case you don't know Synology is THE standard. The software is awesome and I have been using the bands in 5ghz that most other users never even knew existed. Ain't never nobody else on those bands even in the crowd of 4 million near my house. The Dlink software is very, very basic. Unimpressed and returning the router for that reason alone. Bought the new Synology 2600 for only $75 more. So worth it,",
      "rating": 3.0,
      "verified": true,
      "author": "Babel Phaedrus",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "NOT REAL MESH",
      "text": "Their EXO mesh system is not real mesh networking. You can not have more than one router with their EXO system (unless you use a cable between them). Their EXO Mesh is not true mesh, you have to use their extenders. It is nothing more than some slightly smarter than normal extenders. Go check out Asus, any of their routers are capable of forming a Mesh network with any of their other routers (as long as they say AIMesh capable).",
      "rating": 1.0,
      "verified": true,
      "author": "Belgrath04",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Good Value",
      "text": "At this price point, this router kicks butt. Strong signal, easy set-up... well kind of. I'm taking a star off because of D-Link's stupid idea to include uselessly short cables. Unless you plan on mounting this router right next to your modem, you'll need to buy longer cables. I had to find an extension cord to put my new router ontop of my desk hutch. Ridiculous. Once I got it going, it was great. But I shouldn't have to work so hard fixing a nonsensical issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Frederick A. Weller, Jr.",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Improve your home wifi",
      "text": "I moved to a much larger apartment a few months ago and my trusty router's wifi signal no longer was able to reach another room. This makes my internet work so much better! I haven't had a hint of trouble with my wifi since. I even can get a strong signal out in my garden which is really lovely, and my router was spotty with that. It is important to note that this isn't a router!",
      "rating": 5.0,
      "verified": true,
      "author": "Miss.A",
      "helpful_votes": 2,
      "publication_date": 20200629
    },
    {
      "title": "Low power Gigabit Switch perfect for small projects!",
      "text": "While putting together a small Raspberry Pi docker swarm cluster, I decided I wanted a switch that had a similar footprint size of a Raspberry Pi *AND* could be powered by a USB power. This fit the bill. Now, this does NOT come with a USB to barrel adapter (I purchased that separately) but the power output from my USB Charger handled it perfectly. iPerf speeds show this works at 1Gb speeds with ease and the price was perfect. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "mbender71",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Reliably comforting",
      "text": "Look at this alien thing! It's got antennae going everywhere!!! Pew pew pew is what it does. Shooting blazing fast internet all over your home! And probably your neighbors home! Good thing you secured it with a password. Great product, better internet. Wifi.",
      "rating": 5.0,
      "verified": true,
      "author": "Party",
      "helpful_votes": 3,
      "publication_date": 20190209
    },
    {
      "title": "Pass on this one",
      "text": "Had same issues mentioned by other reviews. Often speeds would drop to 10-20mb even though available speed is over 100 and frequent drops made is unusable. Tried messing with the settings but couldn't reasonably get it stable so. I didn't want to mess with it further so I sent it back. Got a linksys system up and running faster with non of the issues.",
      "rating": 2.0,
      "verified": true,
      "author": "さすけ",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "LITERALLY just stopped working 1 day after product support expired",
      "text": "worked fine - worked wonderfully -- we purchased in February and it just .. STOPPED working - we called our cable provider thinking something was wrong with the internet and he stated the router just wasn't working - there was no cause - it had not been disturbed in any way",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Leavitt",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "Reliability should be better at this price point",
      "text": "I had to ditch my D-Link Exo AC2600 MU-Mimo after less than 4 months. I had an inconsistent connection on a regular basis. I had to often reboot everything (which is a pain when you're on a VPN and have other things you have to log into). Eventually the problem became so bad that I was having difficulty transferring files to my client. After that point, it became unusable, and I had to ditch it. I've replaced it with a Synology RT2600ac, and everything is nice and zippy now!",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Horrible Performance",
      "text": "So this seemed to work for a few months and then out of no where it has been slowing to molasses. I don't understand why, but when I bypass it, everything works perfectly well. At some point, it must have started dying inside or something, but I do not get a reliable connection out of it and the speeds are pretty much under 10 Mbps (25-30 when direct), but usually near 2 Mbps, and cannot sustain a reasonable YouTube video. Now I have to find a replacement because this is as good as broken. but at least it looks good? -_-",
      "rating": 1.0,
      "verified": true,
      "author": "skylander",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Don't buy it.",
      "text": "Mine failed in after 60 days. Tech support could not help and only offered a replacement. I preferred a refund, but they could not authorize that. The app for controlling the router is terrible and did not connect to or find the device. I went with another brand and I'm much happier with the performance of that device.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Vertino",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Problem with no 802.11b support",
      "text": "I have a Fitbit scale that requires the old 802.11b wifi to work. I'm also having problem with my Moto Z2 rebooting about every 20 minutes. So I installed my old Netgear router with 802.11b and my scale works great. A surprise my Moto stopped rebooting after connecting it to the old router. Jerry",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 2,
      "publication_date": 20190122
    },
    {
      "title": "Beware, DOES NOT SUPPORT 160MHz",
      "text": "Easy to install, appears to be a rock solid 20/40/80 MHz router. Does not support 160MHz in any way shape or form as advertised. D-Link support didn't BS me, they admitted it has no 160MHz support despite the advertising online and on the product box. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Kinney",
      "helpful_votes": 3,
      "publication_date": 20181108
    },
    {
      "title": "Great Router",
      "text": "Working fine for my mobile home range is good no problem there, a little confusing setting up first time but everything working fine. The speed on the unit is fine because I don't have fast speed internet but it still faster then my old router overall the unit is suited for my need.",
      "rating": 5.0,
      "verified": true,
      "author": "DT8891",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Not worth the money",
      "text": "To me this router was very expensive, and does not meet up to the specs and reviews that I considered before buying this router. To me it is overly priced and gives you on one wifi channel the 2.4 G, BUT IT CLAIMS TO HAVE A 5.0 G WIFI CHANNEL. The usb cord that came with this router is very short so short that you cannot move the router around the room much to get a stronger signal. Very disappointed with purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Hayha",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "If you like to reconfigure your router after every power fail or randomly just because",
      "text": "This is the router for you! Randomly forgets its configuration so you have to manually update it. Keep that info handy because you'll need it. Over and over and over... Of course then you'll have to reboot your security system and all your now-disconnected devices. This is for sure my last D-LINK purchase. Two words: hot garbage.",
      "rating": 2.0,
      "verified": true,
      "author": "Pedrovski",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Ok Router",
      "text": "This is good for a very simple network, some of the features they talk about don't work without other equipment on the network, like VLAN. Have not tested the VPN, but the Smart Connect feature does not work at all, it always put me on the 2.4 network and I was not getting the full bandwidth of my internet connection, once I turned that off it worked fine and I could force logon to 5ghz network. So I had to keep both 2.4 and 5 ghz networks.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Great router after first firmware update. Broken after second update.",
      "text": "I had problems with dropped links to this D-Link router and there was no firmware update at the time so I went back to my old Netgear router. However, after I finally checked for and installed the D-Link update it has been working flawlessly. Very happy with performance now. July 2019: D-link just did an update that made this router slow and unreliable. Factory resets and reboots don’t help. Can’t log into DIR-882 using Edge browser. Firefox works though. Not a happy customer anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "works",
      "text": "I used this to replace the crappy wifi signal from a spectrum unit. Coverage is so much better. easy setup and nice UI. only thing I still can't get to work is the VPN. part of the reason I got the unit. So working to figure that out which is why it's only 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Couch",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "2 years lifetime and died hard",
      "text": "For the two years, it has been serving me well as the last minute switch on my desk. When it died, instead of not powering up any longer, it was still partially working and made not just the machines connected to this switch out of the Internet, but all the other machines that are connected to the main switches as well. Thinking it was my router, main network switches or the Internet modem, I spent hours in diagnosing. Lesson learned.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Ahn",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great router but beware to try different web browsers on setup!",
      "text": "This router is working amazing at my house! I was only getting 5mb/s download at my 4K Samsung TV which is not good enough to play 4K HDR videos. So I turned off my Google Fibers Wi-Fi and plugged this into the network box and I am now getting 75mb/s down at my TV. The only issue I had was my MacBook with Safari would get stuck on the Saving screen and not work. Once I used my iPhone instead for setup it was a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Colby T.",
      "helpful_votes": 3,
      "publication_date": 20181223
    },
    {
      "title": "It worked for less than two months then died",
      "text": "It was mediocre while it worked because it created LAN degradation. I did not realize it till today when I saw that it was the actual cause of my issues. I think it might have been bad from the start, cannot say. But it does not work now and I hope that DLink will replace it under warranty.",
      "rating": 2.0,
      "verified": true,
      "author": "RobC",
      "helpful_votes": 5,
      "publication_date": 20170510
    },
    {
      "title": "Doesn’t stay connected to the internet.",
      "text": "I would never recommend this router. For the money spent I am highly dissatisfied. When it works the speed is great. But we constantly have to disconnect it from the outlet because it’s continuously disconnecting from our fiber optic internet connection. We unplug it at least every other day. Ridiculous",
      "rating": 2.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Don't but this!",
      "text": "Let me start by saying i have 20 plus years experience in networking and computers. I know a little about how it is supposed to work. I have to unplug this thing a couple times a day. A complete piece of junk. I should have paid closer attention to the other user reviews. It was perfect for about one month then it started flaking out. Devices lose connection and cannot reconnect until it is rebooted. I did not but the extended protection and i an regretting that decision.",
      "rating": 1.0,
      "verified": true,
      "author": "M Briggs",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Does the Job",
      "text": "Just plug it in, it does the rest. I have this running two Xbox consoles off the same LAN connection. Both have screaming internet connections and no lag issues at all after 6 months. I like that it powers the ports down to save power when not in use. It was $15 dollars when I bought it. Well worth it IMO and it doesnt get hot.",
      "rating": 4.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "8 port compact Gb Switch",
      "text": "The so-called \"media\" subcontractor for our new home installed a 4-port 100 Mbs switch at the junction box, but since Gbs fiber internet service is available here and I wanted to have the possibility to distribute it via ethernet to the whole house (not just 4 rooms), I replaced the 4-port switch with this one, which is light, small and fits in the junction box and works great. Recommended product.",
      "rating": 5.0,
      "verified": true,
      "author": "Texas2Step",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Horribly Unstable",
      "text": "Horribly unstable. I re-boot this piece of crap 2 - 3 times a day.",
      "rating": 1.0,
      "verified": true,
      "author": "Gar Reyem",
      "helpful_votes": 5,
      "publication_date": 20180707
    },
    {
      "title": "Great antivirus, not much else",
      "text": "I tried using this this router for a few days after using Google WiFi for a number of year. Despite having 300 MBS connection, old Google WiFi performed substantially faster that this router with almost double the throughput, listed speed, etc. Furthermore, the accompanying app had several glaring spelling mistakes. The 3-yr antivirus was nice :)",
      "rating": 4.0,
      "verified": true,
      "author": "D. Voloshin",
      "helpful_votes": 2,
      "publication_date": 20200218
    },
    {
      "title": "Works as advertised",
      "text": "It did extend the range of my WiFi relative to the router supplied by the internet provider. It was relatively simple to set-up. I have been using computers for over 30 years, but I have very little experience with networks. I am not an expert by any means. I'm pleased and would recommend to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Todd",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Great wireless router",
      "text": "Great router for my beach house. The signal is estable and the range cover the complete house, pool and Terrace.. The mimo function is great and the didn't see any speed issue while one TV streaming from Netflix my son play on his Ps4 and my dougther streaming music from Spotify or video from YouTube. We have 3 echo dot, 8 smart wall switch, one smart pool pump, smart pool light and 10 smart socket. I will update in a couple of month.",
      "rating": 4.0,
      "verified": true,
      "author": "Jorge Luis Rivero Perez",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "bad device and company",
      "text": "crappy product and crappy cs approach. my router basically stops working properly every couple hours and needs a reboot. to get help, you need to contact customer service who will run you through a bunch of tests you might or might not be able to follow, depending on your technical health inclination. if this doesn't help, they force you to call a technical line which lets you run everything again. if that doesn't work again, you will need to talk to the returns department which is ANOTHER line to call with linited hours from 9-5. you can easily spend like 5 hrs to get help, maybe, some time. d-link sucks",
      "rating": 1.0,
      "verified": true,
      "author": "MV",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "This router blows a cable supplied router away",
      "text": "Great unit. Easy to set up, great range in both bands, enough Features for an average user. Interface is a bit vague, but you get the gist of it if you have some experience with routers. Set up outside of default settings was tricky setting up separate 2.4 and 5 gHZ connections, but not impossible.... Even I could do it! I appreciate the guest connection. When I have people over, they get their own password, and bandwidth limits.",
      "rating": 5.0,
      "verified": true,
      "author": "M G M Jr",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Bang for the Buck!",
      "text": "Works great! I come from an older D-Link model and was having drop-offs after buying/using two Echo devices. Now with the dual band, I can assign specific electronics on either 2.4 or 5Ghz band. Haven't had an issue since! Improvement on speed too, went from 48-56Mbps to 92Mbps. Also the iPhone app works great and makes it super easy to get going.",
      "rating": 5.0,
      "verified": true,
      "author": "Critter",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great unit, tough hookup!",
      "text": "This unit has brought new life to my digital world! Wifi throughout the house with great streaming! Had some issues hooking it up, called dlink support and they tried to scam me out of $89 so I told them what they could do with that and continued to work with it on my own and finally got it working. What's wrong with these corporations, don't they make enough money!",
      "rating": 4.0,
      "verified": true,
      "author": "J. Souligny",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Reliable, and very small profile!",
      "text": "I needed a simple switch to be able to connect to my Google Home router to connect a gaming computer and a home hub that both needed ethernet. I wanted something small that would fit easily next to my router and not take up a lot of room on my desk. This is the perfect little router that does exactly what I needed it to! I have no complaints at all, and highly suggest this to anyone that needs a few extra ethernet ports!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Sandberg",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Poor signal, destabilized some devices and support was not able to help.",
      "text": "Installed easily. Immediately found out amazon echo did not work and other devices dropped frequently. I suspect it was something to do with the 2g network and how it was prioritizing devices but was never able to make it work consistently and was told by tech support it was not a router issue. I finally got so frustrated I got a google WiFi and instantly all problems are resolved and network is consistently showing increase speed overalll. Major disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul L.",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Failed just after warranty ran out",
      "text": "Easy setup, performed average. The wireless died just after one year, which ironically was the warranty expiration. LAN connections still work, but no wireless. I'll try another brand next time, and faster.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 3,
      "publication_date": 20190204
    },
    {
      "title": "Offensive Smells",
      "text": "Buy this product only if you like the smell of cheap plastic. I've bought many D-Link products, over many years. Often, they were in plastic cases. Never a problem. This is so terrible, even though I need to use it NOW, I am returning it. I am offended that D-Link would lower their standard so much, and Amazon said nothing about this on their website.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Plasticky",
      "text": "I know it is plastic but even so it seems kind of cheap feeling. The LED's even seem cheap in how they flash all together rather than how each port is handling their traffic. I also don't care for the power cord coming out of the side instead of the back. I ended up also buying the medal case D-Link 8 port DGS-108 version just because I was not happy with this one. Just a preference since this one does work OK.",
      "rating": 3.0,
      "verified": true,
      "author": "DJinTN",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "It made all the difference for multiple family members streaming at once",
      "text": "We have good broadband internet coming in (50-80mbps) but we would have stutters and lags when multiple family members were simultaneously streaming, particularly when using zoom and similar conferencing features. We were all on wi-fi. Upgrading our 8 year old wifi router with this one made all the difference. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "yuristargirl",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "A much needed upgrade.",
      "text": "i had a simple asus router, but it didn't reach most of my house or the back yard, though i don't have a big house, and the router was centrally located. It was a bit of a pain to set up, it kept wanting me to set it up from the beginning, resetting to the first step, but as soon as i got past that, it was a cinch and my wifi signal is strong throughout my house and far into my backyard!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Buyer bewhere not new it's a REFURB.",
      "text": "This not new router but refurbed item. Router was not in its original packing like new item the router was disheveled in the box. Password was already set in the router could not access the router therefore, it was not a new item it was USED. The bar code scan for startup instructions said it met it's monthly limit after only one scan another tell that the router was a used product pawned off as new. Amazon what's up with this?",
      "rating": 1.0,
      "verified": true,
      "author": "hopeful",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Faster, High Signal, Reliable",
      "text": "This router feels robust, quicker and easier to setup. I have a space greater than 200 meters with 8-inch walls and with all that, the signal reaches all places strong. For Gamming part, I play online and I don't feel any lag. the data transfer is high",
      "rating": 5.0,
      "verified": true,
      "author": "David García Jiménez",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "This switch had the best combo of price and positive reviews",
      "text": "This is an affordable 5-Port unmanaged switch. I had a few computers in one room that I wanted to hard wire into my network and this switch had the best combo of price and positive reviews. It's working great for splitting the Ethernet that I ran from the router, through the ceiling, and out into my office to both a mac and a windows computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Harter",
      "helpful_votes": 3,
      "publication_date": 20170513
    },
    {
      "title": "Thank you one thing less to worry about",
      "text": "Confused at first hey Siri scanning the code start restarted everything and noticed everything Wi-Fi picked everything up quick compared to rock space oh my goodness very happy very happy that you guys Did I say did I say I was happy Thank you one thing less to worry about",
      "rating": 5.0,
      "verified": true,
      "author": "Roryenglish",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "New d-link versus old netgear",
      "text": "Internet goes out whenever it feels like it and that's some thing my old netgear router never did. After the 3rd time of rebooting it and troubleshooting it and having my settings adjust to the router it's worked for 4 days now. If this keeps happening I'll have to hook up my old router just to have no interuptions in my wifi",
      "rating": 2.0,
      "verified": true,
      "author": "William R",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "The best 2G/5G router for the money",
      "text": "Perfect signal for 10 devices in a 2200 sq. foot home. Paired best with Xfinity's fastest speed. Even have it coupled with a Netgear wi-fi extender for my garage 100ft away for an equally strong signal there, too. No lag, no disconnection! Finally, no more wi-fi worries!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary M.",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "It works well",
      "text": "This thing is smaller than I expected but not disappointed. Front mounted led indicators is hard to come by these days. Installed it this morning and works flawlessly. Simple desktop switch, unobtrusive, totally silent. Good investment for not a lot of coin.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim In Idaho",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Unstable Connection",
      "text": "UPDATE Changed my review to 4 stars since it seems to be working much better now, but I will continue to monitor it's efficacy. This router is pretty fast, but is unstable. I had about three devices connected to it and all fought to stay connected, as the signal would drop inttermitedly. For the price, I expected a router that performed better than my cheapy, 6-year old lynksys router, so I will be returning. It's not worth the headache unless you're willing to put up with intermittent does until this company makes the appropriate firmware updates for this router.",
      "rating": 4.0,
      "verified": true,
      "author": "Petra",
      "helpful_votes": 2,
      "publication_date": 20180509
    },
    {
      "title": "Product is Great so far !! Delivery was terrible !!",
      "text": "Order was supposed to be Prime Delivery yea right !! It was terrible ordered on Sept 1st I just got it today on September 8th Prime Delivery FAIL !! Outside of that the plugged it in configured WiFi and it's rock solid so far !!",
      "rating": 4.0,
      "verified": true,
      "author": "Ty Pittman",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "turning off your WIFI will not reset the Router, you have to use a paperclip!",
      "text": "After a couple of mounts use, my computer would not hook up to the internet wireless. I turned the router off but no improvement. However I could hook up the computer directly to the router and it would perform. The next day my tv's started acting up and would not connect. After reading the book that came with the router, I did as instructed and inserted a paperclip into the #13 slot on the back of the router which took me back to Default settings. Then I had to re install my apps in all my Fire tv's. At least computer and Fire televisions are working wireless again. I hope this is not going to be a frequent problem!",
      "rating": 3.0,
      "verified": true,
      "author": "Brenda Estes",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Great little switch.",
      "text": "I had an older 10 port switch yet I had issues with my ethernet ever since we installed the new service provider. Naturally I thought it was something that they did. So instead of a service call I bought a cheap switch to replace it with problem solved this inexpensive lightweight switch works flawlessly. Problem solved great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Chickey",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "It does it's job well but could do better with advanced configuration features",
      "text": "The basic features all work great and this is a nice product. I think the firmware should be developed more for advanced features, for example a more advanced customization of QoS, more settings for the guest networks, more granular management of connected devices, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "B.R.",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Disappointing",
      "text": "So disappointing in this router. It had such good potential but it did not back it up. The app on your phone is terrible and when you use the browser to connect a laptop the interface is just horrible. It’s not intuitive at all, and the resulting network is below satisfactory.",
      "rating": 1.0,
      "verified": true,
      "author": "azducky",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Disappointing Wireless Connectivity",
      "text": "I used to have a DIR-868, which worked great, but died after like 6 years. This one seemed cool, but I have to reboot it every 1-2 weeks, because some (not all) of my devices can't connect wirelessly. I enabled the DHCP client compatibility feature, but still have issues. Disappointing product from DLink, and I loved the one I had before. Their IPv6 options were ahead of most manufacturers when I bought the older one.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Creviston",
      "helpful_votes": 3,
      "publication_date": 20180326
    },
    {
      "title": "Great Router!",
      "text": "I bought this middle of the road router in hopes that it would preform as described. My recent previous purchase of another brand was a big disappointment. So, far 3 weeks of using this D-Link EXO AC2600 has been fantastic! It was easy to set up with mobile app and I have only had to reboot once. I am very happy with the wifi speeds ( I have 100meg service) and recommend this router as a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. RT",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "I have a pretty demanding network load as I've tried to offload as ...",
      "text": "What do you want for $15 dollars? If you're driving a network that HAS to be up 24 hours no matter what, you need to spend double or triple what this costs, though I have not yet had any issues with downtime and this device. My network runs Modem > DLink Router > Netgear 5port gig switch > to this DLink 5port gig Switch. I have a pretty demanding network load as I've tried to offload as much from wireless as possible. It's only driving a Sonos Play:1 and an Xbox One but it's kept up great. If you're looking to get a couple more ports on the cheap, this will work fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason H",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "I really wish i would have upgraded my router sooner",
      "text": "If you are on the fence don't wait. It is a game changer. This one was really simple to set up and very effective. I am no tech wizard but it was easy instructions that had me set up and no longer dropping wifi coverage through the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "D-Link WIFI Router",
      "text": "Overall the the router worked as described. The extenders are intermittent on pushing the signal through our 2-flat. Most rooms do get a signal. It does all depend on how many people are trying to use the WIFI.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael C. Garcia",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Can't go wrong",
      "text": "Used this to connect extra equipment to my router which was 10' away. Found out though that when I tried to stream video from a cable box to my TV I had to put at least one of these two directly to the router since video would use the same 10' cable from this unit to the router in both directions. Caused problems streaming but for all other applications it worked as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimfl47",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Wireless aspect is Highly unstable constantly drops",
      "text": "Wireless aspect is Highly unstable constantly drops needs to be reconfigured often which can be highly annoying, I'm pleased with all other aspects of the router. * UPDATE: This Router is Trash, It simply died meanwhile I have 3 other routers still working after 4+ years STAY FAR AWAY FROM THIS TRASH!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Agravier",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Works great!",
      "text": "We upgraded to this from a dual-band router that we bought 5 years ago. We are now able to have two people working from home with video calls and heavy internet use. Setup was relatively quick, performed through the D-link app. It works as expected, and we are very happy so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Great little switch for the price",
      "text": "I recently upgraded my central switch to a 32 port Gigabit switch, so now my backbone is fully capable, but all my edge switches were still at 10/100. I bought these to replace the 2 edge switches that had Gigabit capable devices on them. Setup was quick and easy, I just plugged it in, swapped the cables, and we were up and running. I love the little lights that indicate which ports are at full Gigabit. My network is blazingly fast now, and I'm very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Dont buy",
      "text": "I have never had such a terrible experience with a router in my life. The set up was easy. But within the first day it started randomly disconnecting. The upload and download speeds are terrible. I have fought with this router since I received it. I thought maybe my modem was bad so I replaced that and still the same issues. It's a constant battle. I would never recall this to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Genge",
      "helpful_votes": 2,
      "publication_date": 20190528
    }
  ],
  "product_meta": {
    "title": "D-Link WiFi Router, AC2600 MU-MIMO Dual Band Gigabit 4K Streaming and Gaming with USB Ports, 4x4 Wireless Internet for Home (DIR-882-US)",
    "description": "Style:AC2600 Gigabit Router\n\nD-Link DIR-882-US AC2600 MU-MIMO Wi-Fi Wireless Router delivers premium performance for today's most demanding tasks: HD streaming, gaming, and multiple device usage. It comes packed with speeds of up to 2,533 Mbps (800 Mbps in 2.4GHz + 1,733 Mbps in 5GHz ), a high-performance dual-core processor, AC Smart Beam Technology, Intelligent Quality of Service (QoS) with traffic prioritization, four high-performance external antennas for maximum wireless range, a new user interface, Smart Connect and with an easy setup. The DIR-882-US is the perfect combination of wireless internet performance and ease of use.",
    "rating": 4.1,
    "feature_bullets": [
      "AC2600 Dual band router: WiFi speeds of upto 2600 Mbps (800 Mbps in 2.4 gigahertz + 1733 Mbps in 5 gigahertz) to support more connected WiFi devices to your high speed home network",
      "Stream, game, and more: Enjoy 4K/HD video and online gaming simultaneously with 4 x 4 data streams and 4 high performance antennas",
      "Dual Core Processor: The dual core processor gives you powerful wired and wireless internet network speeds",
      "Multi user MIMO technology: Significantly improves simultaneous streaming on multiple devices",
      "Advanced Smart Beam: Tracks your connected devices for enhanced WiFi speed and range throughout your home",
      "Intelligent quality of Service: Traffic optimization delivers seamless performance for your applications",
      "Two USB ports: Remotely deliver high speed data transmissions for storage devices (One USB 3.0 and one USB 2.0)",
      "Intuitive user interface: For Easy setupfrom your mobile devices and network management from your desktop",
      "Connect securely: WPA/WPA2 Encryption for home network security"
    ],
    "specifications": {
      "Product Dimensions": "7.2 x 10.1 x 1.8 inches",
      "Item Weight": "1.5 pounds",
      "ASIN": "B0711TPTZL",
      "Item model number": "DIR-882-US",
      "Customer Reviews": "4.1 out of 5 stars2,126 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#1,407 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 8, 2017",
      "Manufacturer": "D-Link Systems, Inc."
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Routers",
      "Networking Products"
    ],
    "price": 107.6
  }
}