{
  "website_summaries": [
    {
      "verdict": "A great choice for those who need support but don't want to sacrifice style.",
      "pros": [
        "Stylish slip-on with a 1.5-inch heel",
        "Comes in Black Snake, Gold Iridescent (Zappos and Amazon), Midnight Navy, Midnight Navy Snake Embossed and Silver (Amazon)",
        "Leather or Suede upper with round toe",
        "Leather and Textile lining",
        "Removable dual-density, ergonomic, pressure-diffusing footbed",
        "Synthetic outsole"
      ],
      "cons": [
        "Narrower fit than other FitFlop designs, so keep this in mind when ordering"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Same great sole",
      "text": "I chose a half size larger than the sandel size I order. (8.5 over 8.) The shoes are as comfortable as the sandle and provide the support I need to defeat foot pain. I have worn them for whole days with no pain. Next test will be to do longer walking but so far, great!",
      "rating": 5.0,
      "verified": true,
      "author": "Josn brewster",
      "helpful_votes": 22,
      "publication_date": 20180125
    },
    {
      "title": "Great Shoes",
      "text": "These shoes fit perfectly and are the most comfortable shoe I have purchased in years so I have just ordered a second pair. I give these shoes 5 stars. They have an exceptional arch support and are very light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Snaz",
      "helpful_votes": 19,
      "publication_date": 20180513
    },
    {
      "title": "Comfortable",
      "text": "I have a bad case of plantar fasciitis and this makes it so much more tolerable. Fits well and looks great! I was a bit skeptical of the illustration as I thought it looked a bit \"clunky\" however it is very stream lined. So much so that I bought another pair in Navy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy W.",
      "helpful_votes": 14,
      "publication_date": 20181101
    },
    {
      "title": "shoes stretched out during the first time I wore them",
      "text": "These are my 4th pair of loafer/sneaker type of fitflops. The first 3 pairs were great and did not expect any problem with this pair. I tried them on and wore them around the house and they seemed fine. Then when I was out and about in the city they started to slip off my feet. After one full day of wearing themthey have stretched out so much that I can only wear them with heavy socks.",
      "rating": 1.0,
      "verified": true,
      "author": "Marnie Moore",
      "helpful_votes": 13,
      "publication_date": 20180930
    },
    {
      "title": "Runs Narrow",
      "text": "Narrow toe bed. I bought two pairs of these to wear on vacation as I was looking for comfort and style. Considering they’re the same company who makes my FitFlop sandals, I made the incorrect assumption that these would fit the same and be as comfortable. Unfortunately, the toe box is narrow and caused my toenails to bleed. Not exactly what you want on vacation.",
      "rating": 1.0,
      "verified": true,
      "author": "Jana Freeman",
      "helpful_votes": 11,
      "publication_date": 20180423
    },
    {
      "title": "good support but the black snake is coming off the ...",
      "text": "I purchase FitFlop products because of the support, I was hesitate to purchase, I wished I had gone with gut instinct.......good support but the black snake is coming off the shoe and material of the sole of the shoe is peeling off! I have only been wearing the shoes for 1 1/2 months.....Very disappointed.....naturally this started happening when the return window was up............I have always been happy with this brand in the past but I will not be ordering Fitflop shoes anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth R Burke",
      "helpful_votes": 16,
      "publication_date": 20180208
    },
    {
      "title": "Not like my others...way too big",
      "text": "I have two pairs of Superskate loafers and these don't fit anything like them. This 7 is considerably larger than the one pair I own in a 7, which is roomy but wearable without slipping. This one is much longer than my pair...more like a 7.5 or maybe even an 8...that's how large it was. Even with an extra innersole it slipped right off my feet. Definitely size down if you order. Don't understand why Fitflop wouldn't keep their sizes uniform.",
      "rating": 3.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 2,
      "publication_date": 20190419
    },
    {
      "title": "Authentic",
      "text": "These are available in nordstrom.com, but they are 7 dollars more and they didn't have my size 7.5. I've only worn them once, but they feel like my other fitflops comfy. they don't look like real snake skin, but who cares... they still look good. office casual, church casual",
      "rating": 5.0,
      "verified": true,
      "author": "M. mcgee",
      "helpful_votes": 4,
      "publication_date": 20181006
    },
    {
      "title": "These are a pair of my favorite things!",
      "text": "I get more compliments on these shoes than I’ve ever received on any other shoes. In addition to being stylish and beautiful, they are extremely comfortable. The bling sparkles in almost every light, resulting in shoes that can be worn for casual or dressy occasions. They look great with jeans; they look great with velvet. And I don’t think they’ll ever go out of style. These may always be my favorite shoes. I might have to buy a spare pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid researcher",
      "helpful_votes": 3,
      "publication_date": 20181224
    },
    {
      "title": "They are very comfortable and great for traveling",
      "text": "I bought a size 7 and size 7.5 and kept the size 7. They are very comfortable and great for traveling.",
      "rating": 4.0,
      "verified": true,
      "author": "Bibi",
      "helpful_votes": 6,
      "publication_date": 20180628
    },
    {
      "title": "If you have a wide foot, size up!",
      "text": "After reading reviews that these run large, I ordered a half size smaller. Had to send them back. Ordered my normal shoe size and wished I had tried a half size larger. In all fairness, I do have a wide foot. Comfortable but a bit tight with socks. My sandals have run larger so I thought I was safe. Keep that in mind if you try these. Would buy again but would size up a bit. Great if you have plantar fasciitis! The heel is a godsend!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "A great shoe except for the toes scuff easily",
      "text": "I have had several pairs of Fitflop shoes. They fit great and are very comfortable. My knees don't bother me when I wear them, as they do with many shoes. The problem with this particular shoe is that the finish is almost like little scales all over the shoe. I bumped the toe on something, not very hard, and the little scales came off. I was able to use a Sharpie to fill in but I am concerned that these will look terrible in no time.",
      "rating": 3.0,
      "verified": true,
      "author": "ahtzmom",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Comfortable",
      "text": "I have heel pain and have difficulty finding shoes that are comfortable. These shoes have made it easier for me to walk. I’ve walked in these shoes with and without an additional insert. Because of the nature of my problem though, I use an insert for additional cushioning in every shoe I own. I’m inclined to think that someone without my problem would be very comfortable in these shoes without an insert. FYI: My normal size 9 is too big in Fit Flops. The 8.5 fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dislocated",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Buyer Beware!!",
      "text": "I have neuropathy, swollen feet and arthritis. Comfortable shoes are a must BUT for shoes larger than 9 there are NO half sizes. These run VERY large and the heel slips up and down from the very first step, even with socks on. The reviews do NOT cover this issue and this is a caution for anyone else trying to purchase these shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Sltaches",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Perfect Shoes",
      "text": "I love these shoes. I have severe back and knee issues yet these shoes are helping me walk better and without some of the pain. I can also where with business casual because the shoes look nice",
      "rating": 5.0,
      "verified": true,
      "author": "LAG",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "More glitter than pictures show!",
      "text": "A little snug fit but very cute, adorable shoes. The ‘glitter’ in the shoes is much more obvious than the picture suggests-I could’ve used a bit more black in the shoe. Paired with simple black trousers and a tuxedo jacket, I let the shoes become the center of attention and that works.",
      "rating": 4.0,
      "verified": true,
      "author": "WandaTwin1",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Runs small",
      "text": "I ordered these in a 7.5 but I should have gotten a size 8. I can wear them with panty hose, not socks. The bed of the shoe is very cushioned but the sides are not sturdy or supportive. I will keep them as an extra pair of shoes but will have to find another kind of shoe for everyday wear that is more supportive. If you don't have problems with your feet these shoes would be great to wear.",
      "rating": 3.0,
      "verified": true,
      "author": "mimi",
      "helpful_votes": 2,
      "publication_date": 20181002
    },
    {
      "title": "Comfortable & Stylish",
      "text": "Work in a clinic but the dress code is business casual & flat shoes were just not cutting it. These shoes have made a world of difference in how my feet feel after a day at work, walking & standing",
      "rating": 5.0,
      "verified": true,
      "author": "Janell Barnes",
      "helpful_votes": 3,
      "publication_date": 20190214
    },
    {
      "title": "nice looking, but the heel slips",
      "text": "Very cute shoes, but I had to return because the heel slips constantly. I have wide feet, but apparently my heels are not so wide, I'm not sure what the problem was, but I could see these would give me blisters.",
      "rating": 3.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "On your feet all day?",
      "text": "Fit Flops are legit game changers - these pair are worn by a physical therapist and she will never go back to Børn or any other brand recommended for people in the medical field.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Very comfortable",
      "text": "Bought these for walking during trip to Europe this summer. Have a similar pair in black and they were walking comfortable right out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190526
    },
    {
      "title": "Like wearing a snicker.",
      "text": "This shoe is so comfortable. I love them. It’s a little big but with my half Orthotics the shoe is very comfortable. It’s a shoe you could wear all day like a sneaker. But cuter then a snicker.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa B.",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Perfect fit👍",
      "text": "The fits perfectly especially for wide feet.. very supportive and comfortable to wear all day... I love my shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Licata",
      "helpful_votes": 2,
      "publication_date": 20181207
    },
    {
      "title": "Comfort!",
      "text": "Love these very comfortable shoes! Soft, light weight soles, good looking shoe material and feel great to walk in. Happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "JA",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Perfect go anywhere shoes!",
      "text": "This is a replacement pair. I wore out my fist pair! Love the fit and the comfort",
      "rating": 5.0,
      "verified": true,
      "author": "mary e",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Comfortable shoe but....",
      "text": "Nice looking shoe. Comfortable. Plantar fasciitis heel lift fits in nicely. Love the shoe but after only a few days, the “scales” on the finish started to lift off on the top of the toe. I used a black Sharpie to “paint” over the problem. Looks ok, but I can still tell the scales are off in a few places. Would have given 5 stars if the scale thing didn’t start happening after just a few days of wear. I am a Fit Flop fan.",
      "rating": 3.0,
      "verified": true,
      "author": "RosemaryShops",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Run very large!!!",
      "text": "I wear a 91/2 or 10 so I ordered 9 and they’re huge!!! I love fitflops but not these. They slip off heels when I walk. I tried to wear them for a day so guess I can’t return them. They’re cute but I’m so disappointed!!",
      "rating": 1.0,
      "verified": true,
      "author": "Sue Haney Czahor",
      "helpful_votes": 2,
      "publication_date": 20190226
    },
    {
      "title": "Snake layer came off after 1 month",
      "text": "Very comfortable shoes but the snake layer came off within 1 month and the seller refuses full refunds >30days or of worn merchandise. waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "august mom",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Comfortable as usual - but defective and returned",
      "text": "I have several pairs of fit flops = and these have the same fit and comfort but I returned them. The outer layer is like a snakeskin finish and little \"scales\" popped off after one use. Never had a problem with fit flops before, but these I returned and will purchase another style.",
      "rating": 3.0,
      "verified": true,
      "author": "acap123",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Best work shoe I ever owned!  Like walking on air!",
      "text": "It's like walking on air. It's my first closed you Fitflop shoe but won't be my last. I was given a sandal earlier this summer and loved it so I thought I'd try a pair for work. I work retail now, on my feet the entire shift. I highly recommend these shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Fits like a fit flop sandal.",
      "text": "Very comfortable. I had to buy a half size bigger because my size didn’t come in half sizes. I was able to insert an insole, and now they fit perfctly.",
      "rating": 4.0,
      "verified": true,
      "author": "H.",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Nice but narrow",
      "text": "This is a nice looking shoe but runs narrow. I got a 10 wide which is my usual size. The leather is stiff and shoe runs too narrow for me. Unfortunately I had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "CTShoeShopper",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Adding sparkle",
      "text": "These shoes are mostly comfortable; experiencing a small issue in the bunion area by the end of the day. The style is great and the sparkles make me smile. Several comments from people on the street wanting to know where I got them!",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie Hudson",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "super comfortable",
      "text": "I have terrible trouble with shoes because of hammer toes. These shoes are nice looking and don't hurt my feet !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bridget C. Allen",
      "helpful_votes": 2,
      "publication_date": 20190109
    },
    {
      "title": "versatility and support from this shoe",
      "text": "Fit flops are the best! Comfort Plus; You can't go wrong with the company; have several pair and love them; also seem to have people remark on these shoes often; true to size fit",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Great Shoe!",
      "text": "These were purchased as dress shoes to go with black pants. They worked out great And is a comfortable shoe to wear for long periods of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Aurora",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Comfortable but not durable",
      "text": "This pair of shoes was very comfortable to wear but the upper leather is not durable at all. Note that the leather “scales” are easily peeled off from just daily walks in sunny weather.",
      "rating": 3.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Comfy",
      "text": "Run a bit large But I still love these. Great with thicker socks. I love these.",
      "rating": 5.0,
      "verified": true,
      "author": "zcoolest",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Get them!",
      "text": "I really like these shoes. I have fallen arches, a small Bunion and heel Spurs. I guess that's what I get for wearing heels my entire young life 🙄. These are simple but do not look like old lady shoes. I love the color too.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hellman",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Just the right fit!",
      "text": "This brand seems to be the only brand of shoe/boot that I feel comfortable in lately. This show fits well, has the right support. Easy, comfortable, yet flattering to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "BrooklynMama",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Order up",
      "text": "Have loved my other fitflop slides. Hoped to have same comfort here, but rhey were too small and not very comfortable",
      "rating": 1.0,
      "verified": true,
      "author": "aunt jen",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "very comfortable!",
      "text": "sometimes FitFlops are not easy to find the correct size. These shoes fit perfectly, are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "anon",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Too Narrow",
      "text": "Runs too narrow, I should have listened other reviews...It's not comfortable like FitFlop sandals. I had to return it sadly. Want to find out all FitFlop shoes runs narrow or only this model.",
      "rating": 2.0,
      "verified": true,
      "author": "Takop",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Very nice",
      "text": "They fit great. I sent back Born shoes because they were too narrow. These are really cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Joni G. Johnson",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Arch support is great",
      "text": "I work in a school and I’m on my feet all day. These shows support my arch and heel perfectly. They are very light and flexible.",
      "rating": 5.0,
      "verified": true,
      "author": "audrey jane lappin",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "FitFlop Shoes",
      "text": "I love these shoes. I need the arch support these shoes have.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelda Farrar",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Very nice",
      "text": "Very nice & comfy shoes, just not wide enough for the touchy bones in my right foot.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl OBrien",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Ordered a size smaller: Size 6",
      "text": "I previously order at 6.5 and they were too large so I return them, and got a size 6. They fit perfectly, and are very comfortable. Unfortunately, they have a lizard leather appearance, and I would have prefer the original plain leather.",
      "rating": 4.0,
      "verified": true,
      "author": "Teruko Peralta",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Very comfortable",
      "text": "I stand in these all day. They are great for standing in but need to be replaced often.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great comfortable shoes",
      "text": "I just love then...have a couple. Great for travel and super comfortable on your feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "runs really large",
      "text": "Amazon recommended size 7, I ordered 6.5, and it was still way too big. Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia S.",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Cero issues on comfort",
      "text": "Very comfortable. This particular color is a bit too shiny, but I'm glad this is my second pair. When something feels comfortable and looks good, it's a nut to have a variety. Try the orange; I always get compliments on this.",
      "rating": 4.0,
      "verified": true,
      "author": "Green Tara",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Great comfortable shoes!!",
      "text": "I had another pair of these and have worn them out! Now my outside shoe. I also have these in navy blue and metallic look black and 2 pairs of flip flops! I tell everyone how comfortable they are!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Most awesome comfortable nice looking shoes ever",
      "text": "These shoes are so very comfortable and look great. I am going to get them in other colors too.",
      "rating": 5.0,
      "verified": true,
      "author": "Ding Ding",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Beautiful shoe, bad fit, sent back",
      "text": "Loved the shoe but fit was totally wrong and I sent them back.",
      "rating": 3.0,
      "verified": true,
      "author": "Genie",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "poor quality",
      "text": "The fit and comfort of this shoe are great, but the quality of the material is cheap. I wore these shoes twice and the navy material near the toe is already peeling off making parts of the shoe look white.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexa S",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Extremely comfortable",
      "text": "These shoes are extremely comfortable, light and I love them. A little pricey for the material used but, very nice shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "DONNA COLEMAN",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Super comfortable, stylish loafer",
      "text": "The Superskate loafer is so comfortable! They do run a bit large but I wear them with socks that take up any slack. The style goes with just about everything. There is even some arch support, a bonus in shoes priced so reasonably.",
      "rating": 5.0,
      "verified": true,
      "author": "Loretta J.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Fitflops are AMAZING!!",
      "text": "I have to stand all day at my job and now I only wear Fitflops to work. They have various styles so they can dress up or down. I order a 1/2 size smaller than I do in any other shoe & can wear them on the first day I get them with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Very comfortable !",
      "text": "I wear a brace on my foot and these with elastic stretched and were very comfortable and fashionable .",
      "rating": 5.0,
      "verified": true,
      "author": "Adela Kelly",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "They are sooo comfortable",
      "text": "Love love love love these shoes and want to purchase 2 more",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "The heel is too wide",
      "text": "The heel is too wide and flops up and down as you walk, very disappointed. Maybe a wide foot would be better for this shoe I have another pair that fits great, I guess they have a new manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Neetz",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "I am very disappointed that this model fits too large compared to all ...",
      "text": "I am very disappointed that this model fits too large compared to all the ones I own that fir like a glove.",
      "rating": 3.0,
      "verified": true,
      "author": "HH",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Comfy",
      "text": "I love these shoes. I am on my feet all day at work. They are very comfortable and cute as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rochelle Wasserman",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "good for the right person",
      "text": "didn't like the leather, and the sole was too stiff for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Miss Trixie",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Shoe falls apart",
      "text": "I absolutely LOVE Fitflop shoes, but this was the worst. After 1 time wearing them, the top flaked off. Very disappointed Fitflop.",
      "rating": 1.0,
      "verified": true,
      "author": "Shaun Raymond",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great shoes",
      "text": "Already had a pair I got 4 years ago and it was time for a new pair. They r fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorri Jones",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "very comfortable, soft leather",
      "text": "Love it very much! Can wear it all day long!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Super comfortable",
      "text": "I Now have 5 pairs of these shoes. I like them.",
      "rating": 5.0,
      "verified": true,
      "author": "LDB",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Flipflop footwears are good with my experience",
      "text": "This item is fine and fits well for me. I have purchase sandals and shoes from Flipflop and they are comfortable .",
      "rating": 4.0,
      "verified": true,
      "author": "Babykutty Davis",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Comfort!!!",
      "text": "Looks nice, very comfortable! I normally wear 8.5 and this was no exception. Fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Hobbytwo",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "They are soft enough to not hurt sensitive feet",
      "text": "She’s were comfortable but seemed to stretch out a little.",
      "rating": 3.0,
      "verified": true,
      "author": "Mary Marczak",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Comfy",
      "text": "They were so comfy, that my friend ordered a pair for herself and another as a gift. Love, love, love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce R.",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Comfort",
      "text": "This was a great shoe for me recently on a 2 week trip to Europe Walking around towns going to dinners",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Smitherman",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Good looking",
      "text": "I was hopeful these would work for me. Unfortunately the arch just didn’t work with my feet. Returning.",
      "rating": 3.0,
      "verified": true,
      "author": "Leslie Barbour",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "not a good fit",
      "text": "had to return the loafers as right foot was too large",
      "rating": 3.0,
      "verified": true,
      "author": "Judy Leo",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "most comfortable shoes ever!",
      "text": "Great fit and comfortable from the moment you put them all day!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue M.",
      "helpful_votes": 0,
      "publication_date": 20181119
    }
  ],
  "product_meta": {
    "title": "FitFlop Women's Superskate Loafer",
    "description": "Street style meets classic fashion with FitFlop bestselling casual-and-comfortable classic skates, this season in snake-embossed leather. Featuring slimline, elasticated foot-hugging uppers and ultra-comfortable ergonomic supercomff™ midsoles, they feel like your favorite pair of sneakers.",
    "rating": 4.2,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Rubber sole",
      "Shaft measures approximately not_applicable from arch",
      "on FitFlop's all-day-cushioning SupercomFF midsoles with average (width) fit",
      "APMA* Seal of Acceptance, for footwear found to promote good foot health",
      "ergonomically engineered, supercomfortable shoes with snake-embossed leather uppers",
      "cotton lining and leather footbed allow your feet to breathe and slip-resistant rubber outsole with hard-wearing pods",
      "American Podiatric Medical Association"
    ],
    "categories": [
      "Women",
      "Shoes",
      "Loafers & Slip-Ons",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 51.99,
    "specifications": {}
  }
}