{
  "website_summaries": [
    {
      "verdict": "Laser-loving cats and pet parents who’ve tried them all agree – this automatic laser toy simply can’t be beat. A highly entertaining option, both for cats and their owners.",
      "pros": [
        "Rotating head moves in a full circle, giving cats a good workout",
        "3 adjustable settings (fast, slow, and random) caters to different levels of agility and helps keep things interesting",
        "Operation is relatively quiet",
        "Automatic timer switches off after 15 minutes"
      ],
      "cons": [
        "The tiny screws on the battery compartment can be difficult to open"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Needs a base to secure it from tipping over, but laser function is great.",
      "text": "We have tried every laser toy made. This is the one. All the cats love this. The kittens, the seniors, all of them. BUT-You do need to make a base for this as it tips over easy and then you have a laser beam on the ceiling. That is the only thing I would change about this. A large disk base that extends out about 5 inches in a round (10 inches diameter) would make this 5 stars!",
      "rating": 4.0,
      "verified": true,
      "author": "PurpleGears",
      "helpful_votes": 230,
      "publication_date": 20180225
    },
    {
      "title": "My best friend's best friend",
      "text": "This is such a playful toy for all small animals including kids and cats, maybe dogs if I had. My 10-yr old cat has been watching it carefully. But my 2-yr old cat enjoys every seconds. I plan to train to the younger cat to turn on the toy by herself. I believe the training could be interesting. Another positive side effect is that my kids are doing clean-up more often since they want to watch cats playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Hao W.",
      "helpful_votes": 80,
      "publication_date": 20171120
    },
    {
      "title": "I extremely recommend this laser toy for any family who has a ...",
      "text": "I extremely recommend this laser toy for any family who has a cat in their house. Compare to the laser pen, it's much easier to use, and you can free your hands to do other house work. My cat is having a lot of fun of chasing the laser point, and I could just watch him play while I'm laying on my coach. It can take your cat's extra energy without scratch my other stuff. On the other hand, the battery seems lasting longer than I expected. I have bought this for two weeks and use it 30-40 minutes everyday and I haven't exchanged the battery yet. Highly recommend this toy for all my friends with cat.",
      "rating": 5.0,
      "verified": true,
      "author": "Fiona Yan",
      "helpful_votes": 29,
      "publication_date": 20171129
    },
    {
      "title": "Awesome toy",
      "text": "This toy is awesome. The cats love it and play with it constantly when it's on. I only have one complaint, when it gets knocked over the top piece tends to fall out. The different speed settings are great, and it turns off after running for a bit so the batteries don't die.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 13,
      "publication_date": 20180402
    },
    {
      "title": "The product might work well, if you can get ...",
      "text": "The product might work well, if you can get the battery cover off and install batteries. There is a small screw holding the battery cover on. When I received the unit, the screw had already been stripped, presumably by someone that returned the unit. This really seems to be a serious design flaw. Item is being returned. Here's hoping that they just don't send this out to another person.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 7,
      "publication_date": 20180720
    },
    {
      "title": "Highly recommend!!!!",
      "text": "This is an useful cat toy! Perfectly for my cat and also for me! My cat is a young girl, so sometimes she’s very active and always want someone to play with her. She likes laser so much! ( I also bought some other toys for her, she just ignored....). I became so busy these day doing my homework and preparing exams, which makes my no time to play with my cat, this laser toy helped my a lot! I just put this on the floor and doing my homework in the room. My cat was playing laser herself for 30 mins. Love it so so so so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Candy",
      "helpful_votes": 11,
      "publication_date": 20171114
    },
    {
      "title": "Misleading description! Only moves in circle at set distance!",
      "text": "The description and pictures indicated that the laser moves not just in a circle around the base but also in varying distances away from the base \"across floors and walls\". It's only gonna move across walls if you place it within 2 feet of a wall. My super playful cat just looked at and seemed more interested in the base itself as it moved and made sound than in the super boring laser. It moves back and forth in a perfect circle around the base at the same distance. Not the kind of movement expected based on advertisement.",
      "rating": 1.0,
      "verified": true,
      "author": "troy0891",
      "helpful_votes": 4,
      "publication_date": 20181221
    },
    {
      "title": "Saves My Fingers",
      "text": "The cats love this thing, and best part it saves my fingers from pressing the button on a laser pointer! Its super easy to set up, my 4yr old niece could have done it without help. Only 'negative' is that it only moves in a solid circular path, and while it does move side to side within that circle it would be nice if it could move toward and away from the base too. As a side note for the seller, it would be nice if there was a remote so I could start it again without getting up from my work. Or a way for the cats to restart it. Would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Selene F.",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Horrible",
      "text": "It came fast enough, but totally a rip off. The video shows a cat going super crazy fast for it, and with the upbeat music, you expect that the product would be something like that. It is NOT the same thing, it does not move fast, it just goes in circles and sort of stutters in places and goes back around. Top came off pretty quickly and can be reattached but if your cat bats it, u will be picking it up and reattaching a lot. More then anything, my cats were terrified of it, and had no desire to play with this toy",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great customer service but below average toy",
      "text": "Great customer service but the laser toy leaves something to be desired. If your cat like the laser going around very fast in a 7 foot circle and reversing then purchase. The 3 modes are almost the same. 1. Around in a circle 7 foot radius. 2. Wavy line 7 foot circle and stops reverses. 3. Same circle but quick back and forth motions. All my cat did was sit there and watch it. THe motor has a hum and when it stopped it made a slight clicking noise. I sent it back and that is way I gave it 3 stars for outstanding customer service!",
      "rating": 3.0,
      "verified": true,
      "author": "Pat314",
      "helpful_votes": 2,
      "publication_date": 20171208
    },
    {
      "title": "This toy seems great",
      "text": "My newly-adopted cat played with it three times and seemed to enjoy it. Now he runs off at the sight of it. It does make a noise, but it might just be the cat. I thought it was great how it stopped and started and changed directions--much better than I thought. If my cat continues to dislike it, I'll give it to someone else. One thing they don't mention: there is a very small, very tight screw holding the battery case on, which you must remove for first use. We have many sizes of screwdrivers, and finally got it off by holding driver steady and turning the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne C.",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Great laser toy",
      "text": "I was so excited for this toy. My cat was too. There is something wrong in the manufacturing process because the screw to access the battery area is way too tight. I even used an eyeglass screwdriver. I did end up using a utility knife and cut the tab off carefully. My cat is interested but basically it does a circle with a back and forth motion. My cat likes her prior laser toy that did random patterns. She still likes it but not at the fevered pitch we’ve had with other pointers. I wish it had a bit longer run time before shutting off. 5 minutes isn’t enough time.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Its just fab!",
      "text": "Omg even the fat lazy cat plays with this! We have 2 cats - 1 that loves laser pointers and 1 that is our more relazedncat that we literally had no idea what to get her for xmas. We got this for the cat that loves laser pointers- he played with it until he was totally worn out.. next day he is sitting by the unit asking me to turn it on and even the lazy cat is playing with it!!!! ❤️❤️❤️ Totally worth $$$. Also- it stays on for an appropriate amount of time so that you can turn it on before work- and not worry about it being on all day literally exhausting your kitties. 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Better products out there.",
      "text": "I bought this one due to the high rating on here compared to Petsafe Dart, which I owned for years. I am not impressed, as the random speeds and movements aren't very random and the laser also does alternate vertically like the dart, making a simple loop on the floor, which doesn't interest my cats as much. Mechanical issues aside, your cat may like the dart more.",
      "rating": 3.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 3,
      "publication_date": 20180410
    },
    {
      "title": "Great bang for the buck, and entertainment for your fur-babies!",
      "text": "My babies love this toy! Both my cats and dogs play with the laser light, and this product has actually taken a beating since my black lab has knocked it over numerous times. The light rotates 360 degrees around the cylinder and has three motion settings (Slow, Fast and Random). I usually set this to Random and have it perched on top of their living room kennel. The only think that could make this better is if there was a timer to turn it on throughout the day (timer is 15 minutes), or a WiFi to turn it on while you're at work. Great bang for the buck, and entertainment for your fur-babies!",
      "rating": 5.0,
      "verified": true,
      "author": "Ravon Rayne",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "My cat isn't impressed",
      "text": "This laser is more flimsy & cheap looking than expected. The actual light isn't very bright & my cat really just isn't interested. My cat is obsessed with playing w/ laser lights and anytime anyone is in the kitchen (where we keep out little handheld laser pen) he will cry & try to nibble on your calves until you play with him (spoiled). If I turn on this automatic laser when he does that, he might play with it for a second & then he's back begging for the handheld one. I think this one is just too predictable & slow even on the fast & random settings.",
      "rating": 3.0,
      "verified": true,
      "author": "KEAH P",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "fairly unstable, but fun for a couple weeks",
      "text": "the crystal head broke from the machine while the cat played with it. while the crystal head does go back on top and will function, it no longer stays in place if the machine falls over. The machine falls over very easily, and should have a wider base or shorter head for more stability as our cat will often run into it while attempting to chase the dot however, the reason for low stars is the cat will quickly learn the pattern and will bore of it. It's not 'fun' or unpredictable enough for our cat, forcing us to use a regular laser pointer to play with the cat",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Laser Broke After 10 Uses",
      "text": "Laser stopped working. Less than 2 months in and only about 10 uses the laser stopped working. Toy still turns on but no laser. Very expensive toy if you have to figure out how to replace the bulb every 10 uses.",
      "rating": 1.0,
      "verified": true,
      "author": "mf1431",
      "helpful_votes": 4,
      "publication_date": 20180909
    },
    {
      "title": "kitty loves it",
      "text": "My kitty cat loves chasing a laser light so much that my arm was getting tired so I bought this device and she loves it. She gets a good workout chasing it around in the circle and pouncing on the light. When she gets tired she still enjoys watching it, such as she would watching the critters running around outside the window. I initially purchased the Pixnor device, similar to this one but it quit after 3 times. So my experience is that this one it a better device.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Whiteside",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "My cat does nothing with this.",
      "text": "I gave 3 stars because it does what it says. My cat has no interest in this at all. But I can see a kitten love this Now I also purchased a laser handheld light from AMZ which my cat plays with. I also purchased this from Amazon and I put it on a cord so I can play with her and she loves it nonstop. I think this item is great with her because as I pull it from her, it gives her the feeling she caught something live. Plus she loves the crinkly sound while she bites it. \"Childplaymate Mylar Crinkle Balls Cat Toys Interactive Crinkle Cat Toy Balls for Pet Kitten- 12 Pack\"",
      "rating": 3.0,
      "verified": true,
      "author": "Misudfr",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "My kitties love it!",
      "text": "Now I can finish my morning coffee without Gray Kitty begging with sad eyes to play chase the laser. The light traces a circular arc, stops randomly & travels back & forth before continuing. There is a button for on/off & another for fast/slow/random speed, it is pretty much useless as all are indistinguishable. I raised it a few inched off the floor to trace a larger circle. My cats prefer the laser pointer for a truly random chase but this toy provides enough of a distraction to entertain them.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald J. Baranowski",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "KITTY BOOTCAMP",
      "text": "My daughter's cat was depressed after her \"mama cat\" passed away so we thought we'd get her some toys to interact with. Well, this did the trick! The cat LOVES chasing the laser beam so much, she doesn't seem to want to quite chasing it everywhere. I would like for it to have a selection of minutes on the timer as 15 minutes is a rather heavy duty workout for a once couch potato cat. A great purchase but if your cat is overweight, I would suggest supervision at first until it gets used to the workout.",
      "rating": 4.0,
      "verified": true,
      "author": "MrsNJD",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Really helps with keeping bored cats entertained",
      "text": "Our two 1 year old kittens are so full of energy and are always asking for us to play laser pointer with them. Usually this happens during TV time. So, being able to hop up and turn this laser toy on has been A M A Z I N G !!!!! They have only knocked it over once and that was because they were playing with something else at the time. Has 3 speeds and stays on for 15 minutes - brilliant!!! Thank you Friends Forever :) Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Pam L.",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Cat LOVES this!",
      "text": "We've only had this for a couple of weeks so far, so I really can't speak to its durability. 2 cats the older one (who is almost 19 years old) occasionally watches it curiously, but the 3 year old *LOVES* it! It has an auto-off, which I am very happy about. It runs 20-30 minutes or so, then turns off. And the cat will try to bring us over to it, to make it work again! So far, I'm definitely satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Too slow and predictable to be entertaining for our cats",
      "text": "This was a disappointment and we returned it. It seems like whomever programmed the laser doesn’t understand cats play very well. We have an 11 year old cat with average intelligence and a 6 month old kitten that is extremely intelligent. This laser was was too slow and predictable for either of our cats to be entertained for more than a few minutes. After the first day they just laid there watching the laser instead of chasing it. We tried a few other brands and found one a bit better - faster settings with more sporadic laser action.",
      "rating": 3.0,
      "verified": true,
      "author": "Songbirdbutler",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "The cats love it! so it's a winner",
      "text": "So as a human I wasn't initially super impressed with this, I don't really notice a difference in speed when I press the button. To make the path of the pointer larger you have to put it on top of something (like a box). However. My cats are enthralled. They can chase this all day. One of them sometimes stands next to it and cries until I turn it on. I am outvoted! Apparently from the perspective of a cat, this toy is fantastic. I've been thinking about mounting it on a small tripod so I can adjust the height and keep them even more entertained.",
      "rating": 5.0,
      "verified": true,
      "author": "mms",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Every cat owner should have this!",
      "text": "FINALLY! ONE THAT LASTS! I can’t tell you how many times I’ve bought this toy and every time something happened that I had to buy another. Laser stopped working, wouldn’t work with multiple types of batteries, etc. This one has lasted even getting bumped into. My cat LOVES this toy! My only wish is that the distance was a little further and that there was an option to use it as a normal laser, that’s more of an upgrade wish but would be cool. Every cat owner should have this toy!",
      "rating": 4.0,
      "verified": true,
      "author": "Martini",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Our Cat loves it!",
      "text": "Our cat loves this toy, even when he isn't chasing the red dot he enjoys watching it move around randomly. We don't always have the time to sit and shine a laser around so this gives the cat the opportunity to be occupied with us just simply turning the toy on. The red dot is bright enough to be seen well in the daylight. It looks to be well made and durable, time will tell as we have had it for only a couple of days. Even our dog is interested in the dot, thanks for a great toy. 😻🐶",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Carter",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "My cats say no thank you.",
      "text": "Item arrived undamaged and timely. One and a half out of five cats were interested. While it does move around automatically, it's a constant boring circle back and forth. It would be nice if it were sporadic, random movements, not in a small circle. The item itself is very lightweight and tipped over when one cat rubbed her face on the purple plastic diamond at the top. I saw a review where someone mounted this on a board. I highly suggest that if you expect to get your money's worth. My cats say this is not worth $25 and we will be returning. Hope this helps.",
      "rating": 2.0,
      "verified": true,
      "author": "MICHELLE",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Entertainment for you and your cat",
      "text": "Love this thing!!! My cat loves it so much too!!!! She goes crazy for it!! She’ll hide and wait till it stops and then pounce!! It’s the most entertaining thing to watch! And I LOVE the auto off feature!! I can turn it on when I’m leaving for work and it gives her something to do before she goes off and sleeps! It keeps her entertained! Wish it had a voice activated feature so that when I talk to them on my(hopefully working) Petcube I could turn on the laser for her. But it’s a great toy! Money well spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Clarissa B.",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Cats go voom and then dance on the dot.",
      "text": "The people that can't figure out how to put batteries in this must be the same people that can't figure out how to flush in public restrooms. It is a laser and goes in a circle that dances now and again to keep the cats attention. 3 settings slow, fast, and random. They all seem the same to me, but the cats love it. We have a small pride of 5 very playful kittens. Even the anti-soical one comes out to play with this! I'm running it on rechargeable energizer batteries, it had an auto turn off every 10 minutes. Should last a long long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda jobin",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "The cats loved it",
      "text": "We put this down at night to try to prevent the catnado that happens around midnight of them running down the halls. They’re no longer obsessed with it after a month, but one cat will even request if we start going to bed and don’t look like we’re going to eat it. Surprisingly the cats haven’t knocked it over while playing. It’s cheap, but it hasn’t stopped working after a month... if it last for 6 months this will be the best cat toy investment ever! Right after the yellow banana.",
      "rating": 4.0,
      "verified": true,
      "author": "Duhkgeorge",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Quit working/Very good customer service",
      "text": "I have changed the negative review below because the company contacted me and has changed manufacturers to correct the problem. I have a replacement laser toy and it is operating fine. I also received a credit on my Amazon account. I appreciate the prompt refund and replacement. Gave it a one because zero doesn’t show. Too expensive for a few uses. Laser light went out. Rotation etc continues working but ne light. Wish we could purchase additional lasers to fit. I have other lasers that work for years. This one lasted a wee. Very disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Worked for a bit",
      "text": "Had bought this since my fur ball loves laser pointers and thought he'd enjoy it. It had worked for a short period of time and then the laser stopped working yet the motor and head still functions. I tried swapping batteries (four sets to be exact) hoping this would cure the problem and of course it did not. A waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Bob Jensen",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Manic cat toy, lol.",
      "text": "This product is pretty cool. It isn't motion activated but if you want to keep the cat distracted for a little while and active, this works. Depending on your cats enthusiasm, it's possible they will jump through or over the device and possibly knock it over. Stays on for 15 minutes then turns off so you will have to hit the button again if your cat wants more. Not sure how long batteries will last...there's a little motor that rotates the laser, and the laser itself. Overall happy with purchase, and the cat says thank you. Well, he says \"meow.\"",
      "rating": 4.0,
      "verified": true,
      "author": "Scott D.",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "does what it says but effectiveness varies by cat, I assume",
      "text": "our two 8 month old cats got bored of even the random setting rather quickly. its not as random as it could be. With that said, we just pull off the fake Jewel looking thing on top because its purpose is to house a mirror that can slowly rotate and create the effect of the laser moving. With the top off you essentially have a laser pointer and we just by hand move it around and the cats enjoy it. Personally, for my cats I wish I had just purchased a hand laser for half the price.",
      "rating": 3.0,
      "verified": true,
      "author": "CraigG",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "My cat loves it",
      "text": "My cat loves it. I turn this on almost every time I leave the house so my cat has about 10-15 min of play time even while I’m gone. I love the different speed settings to keep my cat engaged. “Random” is so great how it mixes speeds and directions. There were reviews about it tipping over - I’ve had 0 issues with it tipping over & I’ve put this device in both stone and carpet.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan G",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "So far very good",
      "text": "Every cat is a character on his own. Mine is so lazy, playing with him to make him exercise is a challenge. He usually plays 2 minutes and then look at you and decide to lick himself. This toy, so far, is the best one. First day he was shocked and runned chasing the red dot for the 15min the timer lasts. 2 weeks after at least he is still chasing it for a few minutes, then he seats near the tower LOL Still happy with the purchase. Every evening he seats near the tower and asks for it. Totally recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Javi S.",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Perfect toy",
      "text": "Love this!! And so does my cat!! Just be careful if you have carpet because when my cat is running around chasing it, his claws tear up the carpet (yes i trim them but it still happens) Other than that it’s a good toy to keep him busy after a long day at work and im just too exhausted to play with his mouse or his string toy. So I only use this toy every so often. I would definitely buy again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "You have kitties, you need this!",
      "text": "I have two five and a half year old furbabies! This laser toy get's them up and moving. I like that it shuts off after 15 minutes so your furballs don't get too tired, at the same time, it lasts longer than me playing with a handheld laser light! I have bought many toys over the years, but this one has had the best response from my picky guys to get them some real fun and exercise at the same time!",
      "rating": 5.0,
      "verified": true,
      "author": "R Robinson",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "My KItten Loves It",
      "text": "This little unit works great! I have found that it is best to use it in a corner of your room at night. When it hits the wall/baseboard, my kitten can track it better. I put it in the corner and set it to the middle setting. It totally engages my kitten for 10-15 minutes. It stays on the floor in a random pattern, but putting it next to the baseboard about a 1-2 feet away in a darkened room really helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Mom",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Don't waste your money",
      "text": "Stays on for only a few minutes, the cats just look at it then walk away. It's beyond useless. Edit: I’m getting spam from this seller offering to pay/reimburse me $24-40 to change my review.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "Don’t waste your money",
      "text": "It says it has three settings. The first one was what I assume on the slow setting and the other two settings were exactly the same as slow setting. I returned it and got another one thinking maybe the first one was faulty. No, it’s just a crap product that my cats didn’t find entertaining whatsoever. Don’t waste your money, try a different product by a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Works like a charm to entertain an energetic kitten",
      "text": "With a new, very energetic kitty, there just isn't enough time in the day to play off all that energy so we are finding this to be as good for us as it is for the kitty! Easy to operate and works well, so this is a great find and good value. Just two things I wish were different - as others have mentioned, its pretty difficult to get the battery cover off - a glasses screwdriver does the trick. The other thing is that it makes some noise as it is turning which makes the cats a little leery about it.",
      "rating": 4.0,
      "verified": true,
      "author": "Online shopper",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Hilarious",
      "text": "2 out of 3 of my cats love it. My third doesn't care about anything in life. We keep having to move the laser in the living room out of fear they're going to wear a circle into the carpet. They absolutely go nuts with it and quickly tire themselves out - great for bedtime. As indoor cats they tend to be a little on the plumper side so this is great exercise for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie ",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Huge Hit!",
      "text": "Only one of my cats likes to play with a laser pointer. I bought this item along with several other \"automatic\" toys. This is a huge success! He loves it!!! He rubs his head on the top of it when he wants us to turn it on, and it's on a lot! I like the automatic shutoff after 15 minutes of play feature. Laser is nice and bright and there are three settings. Definitely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne K",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Pretty good",
      "text": "My boy who is obsessed with chasing lights immediately took to this and loves it. Gets him moving as soon as he hears me turn it on. My only issue is that the settings don't provide much variety. There isn't much difference between \"slow\" and \"fast\" and the \"random\" setting really doesn't seem all that random. Overall though, I'm happy with the purchase and anything that gets my chunky boy some exercise while I work is money well spent!",
      "rating": 4.0,
      "verified": true,
      "author": "littlebutfierce",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Worth every penny",
      "text": "Nothing gives me more joy then to see my one cat scrunch up and charge in circles at a laser light. This toy entertains my cats and myself as well because watching them flail around is hilarious. Setting this toy up was easy, the hardest part is probably finding a screwdriver to actually open the toy to put the batteries in. I recommend this toy to all my friends that have cats and to anyone out there who wants added entertainment for your pet. (note: my mom also has one and it works for dogs too)",
      "rating": 5.0,
      "verified": true,
      "author": "rachel miller",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Best toy ever!",
      "text": "If you have a kitten or cat that gets into everything and you need to keep it busy for a while, this is definitely the toy you need. Inexpensive and a great product. It runs on 3 - AA batteries. I also love the fact that it automatically shuts off in 15 minutes and there are 3 different speeds. My kitten slept soundly that night.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Well made, provides lots of kitty fun, and isn't \"too\" expensive!",
      "text": "We've wanted to replace our large and heavy DART laser toy that gave up the ghost last year after about 6 months of daily use. Our kitty absolutely loves laser-light play so I looked for a replacement on Amazon. This Friends Forever laser light toy is smaller, lighter weight, quieter, and cost less than half as much as the DART from years ago. So far, so good with this new product. I'm glad I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Roberta",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "The best cat toy ever!",
      "text": "I bought this June 2018 when my cat was just an eight week old kitten. You know us new parents we buy all sorts of toys this was the only one still out and she plays with it daily. It is great especially now in the winter because it gives her exercise. She loves it she charges all over the floor to pounce on the light. I also have two 16 year old cats and it got them moving too. Highly recommend this. I put rechargeable batteries in it and it last months before I have to recharge them.",
      "rating": 5.0,
      "verified": true,
      "author": "Talu",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Our cats dig this thing!",
      "text": "Better than I expected. The cats love to watch the red dot go around and around and back and forth. Sometimes they chase it. Sometimes they just sit and watch. Sometimes they just wiggle and get their pounce all ready. Sometimes they go BERSERK! YOU NEVER KNOW! Great for us if we're too dang lazy to play with the little monsters when they want some action. Just set it out, turn it on, and it runs for maybe 10-15 minutes. Shuts off by itself.",
      "rating": 5.0,
      "verified": true,
      "author": "e ahlgren",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Gullivar Looks Forward to Turning on the Laser Light",
      "text": "We bought the Laser Cat Toy to increase the variety of play for our cat, Gullivar at night. We turn it on as we go to bed so he can have one last playful fling. It is fun to see how he interacts with it and interacts he does. If I jump into bed without turning it on, he will whine until I get up and turn it on. He looks foward to it! You cannot go wrong with this toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas M. Loarie",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "MUST BUY IF YOUR CAT LOVES LAZERS!!",
      "text": "My cat is addicted to this toy, he has awoken me up in the middle of the night to play with it. If anything can be improved upon, it needs a remote control, just to turn it back on again, as 20 minutes is not long enough for him. Best $25 I have ever spent on my cat, keeps him occupied. I also put up places for him to “hide” behind to pounce on the light! I also like that it’s lightweight, and you can easily move this from room to room, keeping the game fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Queen Joscasta",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Not enough variety, nice design.",
      "text": "Cat plays with it a little, then just sits and watches for a while, gets bored and leaves. Not enough variety. Needs to be up a little higher to spread out the play area. This is a nice design, very compact and easy to use for the human.",
      "rating": 3.0,
      "verified": true,
      "author": "DZRhinoTop Contributor: Photography",
      "helpful_votes": 4,
      "publication_date": 20171221
    },
    {
      "title": "what fun",
      "text": "I bought the Friends Forever Interactive Cat Laser Toy for Boudicca, my Siamese-manx. She (and I) have enjoyed this light more than any other that she has had. The pattern can be changed ( 3 settings) so she doesn't get bored with it. She will sit by it and wait for me to turn it on. She hides in a large paper bag and attacks the light when it sneaks up on her. This laser lights turns off after a reasonable time. great exercise for the cat, and entertaining to watch",
      "rating": 5.0,
      "verified": true,
      "author": "KVP",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Worth every penny if you love your cat",
      "text": "This item comes in a secure box with lots of protection. I do not think this is a very sturdy product. I am waiting for it to break from it being knocked over by running cats. That said I like this a lot and the cats love it. I only like it because they made one big mistake designing this. It needs a remote control. It turns off automatically but I would like to start it up again without having to go near it or bend down. I would then love this. If it breaks I will get another on because of how much fun the cats have without my intervention.",
      "rating": 5.0,
      "verified": true,
      "author": "Lancaster PA",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Meh",
      "text": "I was gifted one of these for my 2-yo kitty who is extremely active. Not knowing I was getting one as a gift, I also ordered one. I am sending back the one I ordered. The one I kept (the gift) is not so great. He’s not especially interested in it. Just sits and watches the light but won’t make any effort to chase it. I think it bores him. He loves when I get out the laser pointer to interact with him. The pattern of this thing really IS boring. Plus is isn’t quiet at all. Not a fan. I’ll probably give it to the SPCA to use for kittens.",
      "rating": 2.0,
      "verified": true,
      "author": "Lorraine N. Moss",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Excellent transaction; exactly as described, and delivered when promised.",
      "text": "We bought this to keep our two young cats entertained. After having it for only 3 days, we feel the money has been well spent for the value received! They take turns chasing the dot, and occasionally will gang up on it just to see if they are more successsful... Entertaining for our cats, and even more entertaining as we watch them play.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Shaw",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "My cats love it",
      "text": "My cats love laser toys, but they can be irritating for humans, but not this toy. I really liked that it was an easy access battery door, nothing is more irritating than having to find a small screwdriver when your cats are trying to see what you have, So, it was easy to set up, start, pretty to look at (purple jewel on top), cats absolutely went nuts for the random patterns, and it shuts off automatically. Best of all I don't have to hold a button and swing my arm around.",
      "rating": 5.0,
      "verified": true,
      "author": "Furby's Mom",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Good quality laser and fun for cats",
      "text": "My cat really enjoys this. She's pretty smart and usually doesn't like toys that are \"automatic\" (she'd rather us play with her) but for some reason, she likes this one. I do wish that it moved vertically as well as in a circle for a super randomized pattern. But for the price and what it's worth, it's a great toy that she plays with nightly. I love that it auto-shuts off after 15 minutes so I don't have to turn it on myself. Would be cool if it came with a remote!",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "One Cat Loves it, the other is \"Meh\"",
      "text": "All cat owners know their pet's personalities, so I knew the one would not be excited about it. She has, however, played with it once or twice...I was actually a little surprised. The other one though, loves this thing. Even if she gets tired of it and will only play with it for a few more weeks, you can't argue that $20 isn't a good investment to keep your cat entertained and engaged.",
      "rating": 4.0,
      "verified": true,
      "author": "Vinsant7",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "they love it. It will get knocked over pretty easily ...",
      "text": "I initially thought this device would have the laser moving in all directions, however it moves in a continuous circle. It does go back and forth and the works well in all settings including the random setting....however keep in mind it will be a circle that this device will continue to make. The cats don't seem to mind....they love it. It will get knocked over pretty easily by your cat chasing after it, but it does keep them occupied for a good amount of time. I like the fact that it shuts off after 15 minutes so as not to put your cat in cardiac arrest!",
      "rating": 4.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "good idea, terrible execution",
      "text": "I think my favorite part about this purchase is that their 4th image states \"made to last\" and it was destroyed w/i 24 hours. 1. it's light. That's just dumb. It needs to be weighted at the bottom. 2. It's noisy. That's even dumber. Guess what cats like to do? If you guessed \"go investigate the noisy thing\", go grab yourself a twinkie. You put those things together, and what you get is a toy that emits a laser that the cats mostly ignore in lieu of attacking the noisy device itself until its dead. predator instinct. who knew cats had it!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Disappointed",
      "text": "While it states it goes in a circle the picture also shows other motions as well. But the picture is false! It only goes on a circle pausing to swing back and forth in that area for a moment before moving to another area to stop and swing in. It's ONE direction basically! My car was bored within the first 60 seconds!",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Toy works great, kitten loves it.",
      "text": "I bought this after reading all the reviews. My kitten loves it. It was VERY hard to get the screw out of the bottom of the toy to put in the battery. We had to use channel locks to hold the tiny screwdriver in order to get enough pressure to get the screw to turn. That said, my kitten has had lots of fun time chasing that red dot, we have had lots of fun time too, watching him. When he hears the slight noise of the unit when it turns on he starts looking for the red dot. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "CBH",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Cat was not that excited by it",
      "text": "My 3 year old kitty was not super excited by this toy. She likes chasing a handheld laser pointer way, way more than this. The pattern is much more limited than the listing would lead you to believe. It only goes around in a small circle moving back and forth randomly. Not enough variety to keep the cats attention for very long.",
      "rating": 2.0,
      "verified": true,
      "author": "allyk",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "It lasts",
      "text": "I have six, two-year old kitties (long story about their hungry, wild, Mother coming to us during a blizzard and delivering kittens three weeks later) and they are very active. Because I am raising them as indoor cats I have tried many, many toys from Amazon and this one is still going AND they are still interested. Even though they have all been \"fixed\" they are still very busy and use this toy every day. The battery lasts quite a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Mollydogbiscuits",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Good for a cat, maybe not for a dog.",
      "text": "I have it 4 stars bc it's a neat idea. I'm just 2 weeks postpartum and wanted something that would keep my dog busy as she loves lasers. The laser could be darker/stronger. I feel it could have a faster speed. I'd like if it was more unpredictable. Maybe cats can't figure it out, but my dog figured it out quick. My dog still rather I use a hand laser pointer thing we have, but will for brief moments (less than the timer) be okay with this interactive cat laser toy.",
      "rating": 4.0,
      "verified": true,
      "author": "WhatABeautifulDay",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Kitten having fun",
      "text": "My kitten is hooked on chasing the little red dot. My arm got tired from using the laser pointer so I decided to try this toy. It is a success! Felix will chase this red dot and I don't have to move a muscle, just sit back and enjoy the show he puts on. I have had the toy 6 weeks and it runs 2-5 times daily and I have not had to put in new batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "K. A. Beaver",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Easy to use",
      "text": "Our cat has a lot of energy but we can only play with him for limited amount of time. This laser tower gives him a bit more play time when we are busy or out. It uses 3 AA batteries and has three different modes. It will automatically turn off after a period of time. Our cat chases the laser when we are not around playing with him but gets bored with it quickly too. It’s a good addition to our cat’s toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Sybil",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Belongs in a Dollar Store",
      "text": "This was so poorly made. I hate returning things but the quality was something I could only justify buying from a dollar store - such a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "mstrandrrs",
      "helpful_votes": 2,
      "publication_date": 20200201
    },
    {
      "title": "Cats and I are happy",
      "text": "I have 3 of these in different parts of the house so my cats can play wherever they’re hanging out. I also bought one for my granddaughter’s cat. Not all of them play with this toy but the ones who do play enthusiastically. I have a cat who has hyperesthesia and when she goes into one of her spells I turn on the laser and it distracts her. It works better than catnip to divert her attention and I’m grateful I have this laser toy for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Nan",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Excellent exercise",
      "text": "This is one of those toys where you say to yourself, “I wish I would have thought of that!” I’ve got a one-year-old DSH, and he’s a little chubby from inactivity, so I bought him this toy. As others have noted, it tips easily, so I set it on a short bar stool in a darkened room. My cat will play with it for 30 minutes before he gets tired. This laser toy is excellent exercise, and I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "BenRobison",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "My cat loves this I just wish it was better made!",
      "text": "My little guy LOVES THIS. He cries for it when it’s not on. I wish the diamond top wasn’t removable because we constantly have to redo it for him (and he’ll wake us up at 1am to do so). Also stops working well over time. We’ve had this since Christmas and it used to stay on 15 minutes at a time or so and now it auto shuts off after about 3.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie K-H.",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Very limited range, broke very easily",
      "text": "The laser only goes around in a narrow circle, very near the device, cats figured it out too quickly and went after the laser toy, knocking it down which broke the mirrors in the laser toy. The limited range and lack of chasing options, did not make my cats very interested in chasing the actual laser.",
      "rating": 2.0,
      "verified": true,
      "author": "Shooter117",
      "helpful_votes": 2,
      "publication_date": 20180823
    },
    {
      "title": "Good quality",
      "text": "The kitties enjoy this, the random setting is fun because it keeps them interested. I was concerned when the top came off and I found it under the couch, but it twists right back on, which was impressive. Most of the time my kitties break something and that's it, it was nice to see someone thought of that problem and made it more substantial. Good product, laser has lasted for a while thus far which is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Nico S. Montanari",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Keeps my rambunctious kitten occupied",
      "text": "I love my kitten, but sometimes I just don’t feel like playing. I just turn this on and keep her occupied and wear her out for a bit. My old cat is just as intrigued.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa K",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "my cats love this",
      "text": "When the laser toy arrived I thought it was broken, however what I discovered was it just needed adjusted. The top part (laser pointer) does come off. This is a little annoying because it easily gets moved or carried/batted around the house. Overall, good interactive toy. I like that is auto stops after a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy412",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Cats still play with it, even after they broke the top off",
      "text": "If your cats break it, don't worry, they will still like it. At first, one of our cats liked it and the other didn't, but now that they figured out they can knock the top off (and tip the whole thing over) they both love it (when it's tipped over, it causes the laser to go on the wall and the ceiling, which they love).",
      "rating": 5.0,
      "verified": true,
      "author": "Opt-In Media",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Quit after 1 hour",
      "text": "This ran for about an hour - my kitty did love it - but then it quit. Thought maybe it was batteries (however, if it chewed through batteries that bad, I'd return it anyway), so replaced them but it was very, very dead. Will return.",
      "rating": 1.0,
      "verified": true,
      "author": "Maureen",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Disappointed!",
      "text": "What laser? This item is a good concept for my 2 new kittens but the laser doesn't work. The diamond at the top turns, we purchased and installed the recommended 3 expensive batteries, it turns at one speed only despite 3 speed buttons and slight noise but no laser. I will return, expensive for what it doesn't do.",
      "rating": 1.0,
      "verified": true,
      "author": "PRISCILLA YAMAKAWA",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great product BUT cat knocks it over too frequently",
      "text": "Cat loves it. BUT it stops lasing when cat knocks it over. EVERY time I put it on floor cat knocks it over. However when I put it 6 inches above floor on fireplace, cat doesn’t knock it over. Only negative to this is that now it’s 180 degrees instead of 360 degrees. In any event I still highly recommend this product. Wish it would have one hour timer instead of 15 minutes. Or plug into wall.",
      "rating": 4.0,
      "verified": true,
      "author": "Expert Reader",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Video is misleading",
      "text": "The demo video shows it going back and forth on the wall. It points down and in a circle. You can put it on a table but it won't spend a lot of time shining on the wall. We have two cats. They don't chase it as much as a manual laser pointer but seem to enjoy staring at it. Just OK. A little pricy for what it does.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Steen",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Highly Recommend!",
      "text": "I swear this is the best thing I've bought for my 3 cats! They absolutely love it. If it's off and they want to play, they sit by it and meow. It has been knocked over many times also but it is made sturdy so it didn't hurt it at all. The rotating pattern the laser makes is very ideal, as each of my cats get a turn when the laser is near them. Our dogs have even tried to get in on the fun, but the cats take their laser chasing pretty serious and quickly scare them away. Extremely happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Hours of enjoyment for kitteh",
      "text": "When I ordered this laser chase tower, I wondered if the cats would enjoy it, or as per usual, would end up playing with the box that it came in instead. As it turns out, the older of the two cats (11) has zero interest in chasing the laser while the younger cat (6) enjoys playing with it immensely. On the whole a win, since the younger cat is large and a bit overweight. The tower is well constructed, quiet, and works well. The only feature it lacks is a remote, but at this price point, it's understandable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Shepherd",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Hours of fun!",
      "text": "My cat absolutely loves this toy. He will play with it for hours. When it times out he'll sit by it and meow incessantly until I turn it back on for him. Every now and then he'll get a little too into the chase and knock the toy over, but that is the closest thing to an 'issue' we've had. I love that he can get all of his energy out on his own and really enjoys it. I would definitely order this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy NYC",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Don’t bother",
      "text": "Had high hopes for this. It claims to have multiple speed setting but it does not. And it only moves the laser in a circle around the base that’s it. There is no other motion than that. I have two EXTREMELY playful cats and both of them infinite this piece of junk. It was also advertised that is came with a free gift, alas it did not...",
      "rating": 1.0,
      "verified": true,
      "author": "Joey ",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Worked great - short term",
      "text": "My cat really liked it, but it quit working after the 4th time on. We did not bump it, drop it, or anything other than turn it on. on the 5th night, the head turned back and forth but no laser light. I don't recommend spending this much money to have it quit after a few times. Very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Melody's Emporium",
      "helpful_votes": 2,
      "publication_date": 20180901
    },
    {
      "title": "Works as advertised. Cats don’t like it enough to make it a good value. Bit of a wasted purchase.",
      "text": "Ok, the product itself is quite sturdy. It does exactly what it says it does. HOWEVER (and I recognize all cats are different) when I turn it on, my cats are bored in like 5 min. It makes sense: the thing literally just goes in a circle. And yes I knew that when I bought it, but I didn’t consider that cats probably won’t love it. You’re better off getting a laser pointer because you’re cats are more likely to have fun with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Madeline H.",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "My cats LOVE it!",
      "text": "My cats absolutely LOVE it! The laser goes a bit fast even at the slow setting, so it took them a couple tries to get used to it, and now they can’t stop! They paw at it now to try to turn it on, haha. As others have said, it knocks over pretty easily, but it doesn’t bother me much. (I’m usually the one accidentally knocking it over.) I 100% recommend for hyper kitties that like laser lights!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber A",
      "helpful_votes": 3,
      "publication_date": 20181005
    },
    {
      "title": "Good while it lasted",
      "text": "I've had this for a few months. It has gotten daily use and abuse from my 16lb siamese boy. He has recently figured out he can knock it over and take off the blue jewel from the top. Even with new batteries in it, it will randomly go dim and slow down. And then go back to normal. I haven't figured out what else to do. But it was definitely worth the money paid for how much entertainment my baby has gotten from it.",
      "rating": 3.0,
      "verified": true,
      "author": "E. McKenzie",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "It’s a huge hit with one kitty!",
      "text": "Always hesitate to purchase these high priced toys for my kitties. So may have been flops and had to be returned. A hassle. I was looking for a laser pen and came across this jewel. I decided to take a chance based on the great reviews. I’m thrilled with the outcome. One concern was that it would be knocked over continuously during aggressive play, so far so good. The laser projects far enough that my kitty has not knocked it over yet.",
      "rating": 5.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Worth the purchase.",
      "text": "I have an older cat who isn't all that active these days, but she like it and will make a run for the travelling light from time to time. This \"toy\" has 3 settings for the beam but I can't see any difference between any of the 3 settings (maybe one moves around a little faster, but I'm not even certain of that.) I do like this cat toy in spite of my not seeing any difference between the settings. I run the beam for the cat just about every evening.",
      "rating": 4.0,
      "verified": true,
      "author": "Chaz T.",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Ingenious!",
      "text": "My cat plays with this more than with any other toy I've bought for him. Ingenious! Sometimes he will sit by it until I turn it on. The low mode is sufficient for him. My only problem was with opening the battery case. The instructions never mentioned that you had to remove the screw first, and I'm not a handy person so spent much wasted time trying to remove the case. It is a tiny screw so I had to have my son bring over his tiny screw kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Larissa",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "The three speeds are great, it actually comes to a complete stop during ...",
      "text": "The three speeds are great, it actually comes to a complete stop during 15min session which is what my Sterling needed to be fully engaged. It is a bit noisy, which was the initial deterrant however after several attempts and my cat became comfortable with it- well he loves it. I was a bit nervous but it’s cats so be patient and try a few times, different lighting, (corners) in house, amount of time, etc, I’m glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "zdaliagarcia",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Love the small size, hate that it stopped working after one week.",
      "text": "Cool looking design, small and laser light show cool in the beginning. But when it stops working completely after one week, not a good sign. Cats attack the laser light, not the mechanism. Should not have stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "JujuB1955",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Does not amuse all cats",
      "text": "I thought my 2 year old big orange tabby would love this since he’s always running around playing with toys etc. But he followed laser light for 60 secs then just sat to look at it. He is too smart. He wanted something tangible to attack / like a real mouse. Maybe for a kitten. It’s not toy’s fault but rather my Garfield like cat.",
      "rating": 3.0,
      "verified": true,
      "author": "lilianne",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Would be awesome if it was rechargeable -",
      "text": "A nice thing about this toy is that you can move it around and raise it higher or lower to make different circumferences. It has a time and turns off which is nice so it doesn't drain the battery. The only thing that would make this better is to have it be rechargeable rather than battery operated.",
      "rating": 4.0,
      "verified": true,
      "author": "Vedana Freitas",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Nice but doesn't replace the other laser",
      "text": "We got this toy for our kitty that loves to chase the laser every night before bedtime. This is a great asset but our kitty still prefers the laser that she can chase up the wall. Still a good investment, now I can turn it on let her play. Great exercise for our furry friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Baldwinda",
      "helpful_votes": 0,
      "publication_date": 20200117
    }
  ],
  "product_meta": {
    "title": "Friends Forever Interactive Laser Cat Toy - Automatic Rotating Laser Pointer for Cool Cats, Electronic Toys for Stimulating Exercise, Battery Powered Auto Lazer, 3 Speed Mode, Blue",
    "description": "Friends Forever Interactive Laser Cat Toy will keep your pet happy and healthy. Automatic rotating laser pointer for cool cats, Electronic toys for stimulating exercise, battery powered auto lazer, 3 speed mode.",
    "rating": 4.1,
    "feature_bullets": [
      "NEW POPULAR CAT TOY - Concealed auto rotating laser pointer create unique & mystery experience for the challenging hunt, Keep this furry friends move and never get bored with 3 speed setting (slow, fast, random)",
      "A PERFECT SELF PLAY - Quiet laser beam moves randomly across floors that appeals to the natural hunting instinct of cats, Keeps cat up for running and exercise but not over tiring with 15min auto timer",
      "LARGE PLAY AREA - The spinning tower head project the lazer beam 360 degree around it, forms an infinite circle area to play, So the cat will not be limited to a small spot like other toys do",
      "PLAY ANYWHERE EVEN OUTDOOR - Operated by three AA battery(not included), You can take this toy to any safe place, Not fixed on a door or a window, Without a plug thereby reducing trip hazard",
      "GUARANTEED - Designed in the USA, we stand behind the quality of our products, We guarantee your 100% satisfaction or money back"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "8.5 x 4 x 4 inches; 9.92 Ounces",
      "Item model number": "PET66-0035UPC",
      "Batteries": "3 AA batteries required.",
      "Date First Available": "June 19, 2017",
      "Manufacturer": "E&E Co. Ltd DBA JLA Home",
      "ASIN": "B072WCZQ4V",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Mice & Animal Toys",
      "Toys",
      "Pet Supplies",
      "Cats"
    ],
    "price": 24.99
  }
}