{
  "website_summaries": [
    {
      "verdict": "An effective product that  supports the neck, jaw, and spine. The fit may be slightly rigid at first, but owners say it becomes more comfortable with wear.",
      "pros": [
        "Great for daytime and nighttime use",
        "Appropriate for the treatment of headaches, neck strain, and other conditions",
        "Price is reasonable"
      ],
      "cons": [
        "Sizing may be different for this brand than it is for some others"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked for occipital muscle pain and tension headaches.",
      "text": "It worked for my occipital muscle pain. I’ve been going to various doctors because I’ve been having persistent localized pain in the occipital muscle/nerve area. The doctors were perplexed and kept suggesting stretching it. The pain kept getting worse until I decided to get this collar. I wore it for only a week and the pain reduced by almost 80%. I still wear once in a while to get 100% result. All I needed was some restriction in the neck motion not the stretching as per doc’s suggestions. I shelled so much money on them and the actual solution cost me only $15.99. Unbelievable!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 166,
      "publication_date": 20180808
    },
    {
      "title": "I love it!",
      "text": "I love it! I probably should have ordered a Large instead of Medium...being the velcro is a little short to attach well. My neck is 13 1/4 inches and should have fit well with a Medium size according to the chart. I plan to attach more soft velcro to the end of the soft velcro strip attached to it. Update: Today is my second day wearing it. Right now I am glad I got the medium! It has gotten softer and putting it on today it seems to have loosened up enough that my velcro strap seems to fit better.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 119,
      "publication_date": 20170913
    },
    {
      "title": "I have to say this product has made my waking up hours 80 - 90% better. I highly recommend this for cervical issues",
      "text": "I had a triple cervical fusion in 2003 and now my other discs are going out - I bought this especially to wear at bed time because I always woke up with pain and a headache...I have to say this product has made my waking up hours 80 - 90% better. I highly recommend this for cervical issues.",
      "rating": 5.0,
      "verified": true,
      "author": "mary beliakoff",
      "helpful_votes": 119,
      "publication_date": 20171103
    },
    {
      "title": "Not all products are alike- beware!",
      "text": "I fractured my neck 7 months ago and had a spinal fusion. I've been using this brace since I got my hard collar off in the car or on public transportation and when I sleep. I ordered two of these over the course of a month and the second item i got has the reverse small part and large part of the brace- see photo! I prefer the first one which looks like the picture on the box. Still I kept the second one because it was $15 and still functions well just not as nice as the first one.",
      "rating": 4.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 110,
      "publication_date": 20171025
    },
    {
      "title": "She is very happy with it",
      "text": "Bought this for my mom. She is very happy with it. It’s a perfect length to support the neck, and very comfortable with the adjustable size. She has a very big problem with her neck, she wear it no only when she sleeps but during the day time as well. Also this neck brace can keep the neck warm, a good bonus for my mom.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwen Novho",
      "helpful_votes": 77,
      "publication_date": 20180208
    },
    {
      "title": "Wow!",
      "text": "Thank you, thank you, thank you! As a sufferer of arthritis of the spine, I have finally found a product that allows comfortable, virtually pain-free sleep. Sure, it might not do the same for every person, but I speak as a person who was up a couple of hours most every night, pumping up the old neck brace. and sitting on the side of the bed until the pain would subside. No more! I slept 9 hours of uninterrupted sleep with very little neck pain. Looking forward to tonight. Again, thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 38,
      "publication_date": 20190312
    },
    {
      "title": "Not enough lateral suppory",
      "text": "As a physical therapist with herniations and bulges in my neck I prefer the cervical collar that is built up on the sides which keeps the neck more neutral. I purchased the “amazon choice” first and then purchased this one as a second one and I did not have the same relief as I did with the “amazon choice”. This one has less build up on sides which allow for more lateral compression of the spine which is undesirable and defeats the purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "pen",
      "helpful_votes": 41,
      "publication_date": 20190130
    },
    {
      "title": "Alternate travel pillow",
      "text": "The traditional travel pillows did not work for me. One, the padding of those pillows were never enough to support my neck and woke up with neck pain. The soft neck brace is a great alternative for me...it keeps my neck straight and I get no neck pain after sleeping a few hours in my airline seat. I recommend people to try it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rancisco B.",
      "helpful_votes": 32,
      "publication_date": 20190619
    },
    {
      "title": "Comfort and protection is is what I wanted!",
      "text": "My neck and I were in a car accident and my neck was broken. I needed a way to protect my neck, something that was not attached to my head. When the \"thing\" was removed from my head (yes, it was attached) I was given a soft collar that was very, very uncomfortable. I tried many collars that were all too big, too small, etc. This Velpeau Neck Brace foam cervical collar really does relieve pain. It also supports and protects me when in the car. Thank you for helping me get my life back to \"normal\"!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customerlois A.",
      "helpful_votes": 29,
      "publication_date": 20190714
    },
    {
      "title": "Finally a neck brace I can sleep in.",
      "text": "I have cervical disc issues. Being a side sleeper, I found that sometimes when I would be turning over, I muct have fallen asleep before making a full turn. This would cause me to lay on my back without my next supported. I shopped around for a brace that was less wide (under the chin) because when I lay down it is impossible to keep my neck extended and any other brace would choke me. I am very please with the size of this brace.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 39,
      "publication_date": 20181112
    },
    {
      "title": "Highly recommended",
      "text": "I live with chronic cervical pain. I have 3 disc fused after another rear end accident, all my disc are damaged. This brace has been a lifesaver in I did have 24/7 headaches and neck pain. It’s still a daily struggle, but this brace being more supportive is the BEST for daytime use. I do go back to my less supported brace when sleeping. The brace has held up well with everyday usage.",
      "rating": 5.0,
      "verified": true,
      "author": "L Moore",
      "helpful_votes": 31,
      "publication_date": 20190401
    },
    {
      "title": "True to size chart",
      "text": "I have had neck braces in the past. This one is wonderful. I was afraid to travel because of my stenosis but now I believe this will make all the difference. I got the one with support plastic and it makes me feel secure. I just know this wont fail or slouch fo a long time. When it does, I will buy another. I may just do it anyhow.",
      "rating": 5.0,
      "verified": true,
      "author": "Thais Cesare",
      "helpful_votes": 31,
      "publication_date": 20190413
    },
    {
      "title": "Very comfortable contour cut!",
      "text": "Very comfortable, although hot as expected since it’s foam. I have very weak neck ligaments and when I work out sometimes the muscles pull on my vertebrae and pull my neck out. This reminds me to keep my neck relaxed and not braced. The V cut does NOT jut your chin out compressing the back of your neck like other kinds do. I can keep my neck in neutral posture and this just helps me keep those upper cervical attachments relaxed while lifting heavy. It has worked well and I don’t care if I look silly! Not a crutch just a reminder for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Super Shopper",
      "helpful_votes": 31,
      "publication_date": 20180825
    },
    {
      "title": "No more pain",
      "text": "Just what I was looking for. Wear it to sleep which relieves the constant neck ache I was waking up with due to tucking my chin down low toward my chest. Takes a couple of nights of getting used to, but I actually slept better with it on & don't wake up with the neck ache now. Better than the hard version I had (which was for a previous vertebrae problem).",
      "rating": 5.0,
      "verified": true,
      "author": "Justa Girl",
      "helpful_votes": 29,
      "publication_date": 20180729
    },
    {
      "title": "Great fit, very comfortable",
      "text": "VERY comfortable, well made, and great fit for me (average woman with a pretty long neck). The soft collar my surgeon provided me post-cervical fusion was terrible (thick white foam, cheap frail cover, folded in half with no anatomical molding to the shape of your neck/chin/etc. ... it gave me migraines). But THIS collar was SO much better in fit, comfort, and quality. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Smith",
      "helpful_votes": 29,
      "publication_date": 20180704
    },
    {
      "title": "Great supporter for my neck",
      "text": "Great supporter for my neck. I believe the main functionality is to make my sitting posture and habit better. No more neck pain for now. Hope it could last long to change my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Christo C.",
      "helpful_votes": 36,
      "publication_date": 20170826
    },
    {
      "title": "Misleading description and poor quality neck support",
      "text": "The neck support WAS NOT a \"Soft Neck Support Relieves Pain & Pressure in Spine\". It felt too firm and rough and seller charged me for return shipping. What a way a seller does business!",
      "rating": 1.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 17,
      "publication_date": 20181229
    },
    {
      "title": "A MUST FOR ANYONE with cervical instability, EDS!",
      "text": "I have cervical instability due to Ehlers Danlos Syndrome and this had been such a fantastic mobility aid..Comfortable to sleep in for sure, both with and without plastic support although more so without, I choose to buy the size that started with my measurement and glad I did ad I can place my cryo ice pack on back of neck and still use this brace..LOVE IT..",
      "rating": 4.0,
      "verified": true,
      "author": "Diversely Able",
      "helpful_votes": 8,
      "publication_date": 20190401
    },
    {
      "title": "The neck brace you won't mind wearing any time you need to",
      "text": "As far as soft collar neck braces go this one takes the cake for design (actually looks decent on, not as boxy or clunky as others) and comfort with foam that is firm but not too firm as well as covered with a soft yet durable fabric. Anyone that truly needs a neck brace will actually look forward to wearing this one at home, asleep, or in public. The packaging is well designed (kept mine to store brace when not in use) and the thank-you bookmark a very nice surprise to show they care about the people who use their product.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 5,
      "publication_date": 20190630
    },
    {
      "title": "Comfort",
      "text": "My wife just had neck surgery. The hospital sent her home with a neck brace that was not at all comfortable. We looked online and found this one, ordered it, and it arrived promptly. It is comfortable and serves the purpose very well. I would recommend this product highly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 7,
      "publication_date": 20181021
    },
    {
      "title": "It does make a difference",
      "text": "I have issues with my neck & related to my neck. I work at a computer all day & commute so, tend to put it on once I get home. Depending on how bad my neck is hurting, I do sleep with it on sometimes. I can definitely tell a difference after I take off the brace. It actually stretches it out & takes the weight off of my shoulders (while I have it on). It isn't very comfortable on but, it works. The fabric could be softer. It would have been great if the width of it was just a little smaller. I do believe it does the trick though.",
      "rating": 4.0,
      "verified": true,
      "author": "J.R.S.",
      "helpful_votes": 2,
      "publication_date": 20191027
    },
    {
      "title": "Wanted to enjoy, but received a used item with hair",
      "text": "Would not give any stars if I could - sent back without trying as there was a hair stuck on the velcro... clearly a returned item that has not been checked",
      "rating": 1.0,
      "verified": true,
      "author": "madam_cielle",
      "helpful_votes": 4,
      "publication_date": 20200527
    },
    {
      "title": "helped my neck nerve pain so much",
      "text": "I have issues with my neck, pinched nerves that cause major migraines. Bought this brace because I've been using a travel pillow to sleep with at night but it wasn't working. Since I've started using this brace I've had no migraines. Not that this will cure everyone's issues but it sure helped with mine! I wish the cover material was a tad softer but overall I love this! I wear the added plastic piece during the day and remove it to sleep. I will definitely order from this company again! Great, sturdy brace for a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth wester",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "The best collar for support and comfort.",
      "text": "This is the by far the best cervical collar I have ever purchased. With all the different thicknesses, widths and lengths it was difficult to find just the right one for me, but I did, I found the 3\" Soft Support by Velpeau! Excellent product, the washable sleeve provided to cover the collar is an asset and quite a brilliant idea, I love everything about this collar, wish it came in other colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 2,
      "publication_date": 20191006
    },
    {
      "title": "I choose this one because the reviews said it was more comfortable than the ones in pharmacy stores",
      "text": "I got this for my husband because doctor required him to get a cervical collar. I choose this one because the reviews said it was more comfortable than the ones in pharmacy stores. My husband didn't find it comfortable, though I don't think these type of things are made to be comfortable in first place. He says it takes a lot of getting use to but that it actually did work. He was happy with the results. We also like the soft cover it has on it. I gave it 4* because I had contacted them and never got a reply.",
      "rating": 4.0,
      "verified": true,
      "author": "Janice Mills",
      "helpful_votes": 3,
      "publication_date": 20180613
    },
    {
      "title": "Small = extra small. Nice collar..",
      "text": "This is a very nice collar and small is my usual size but this was too short as the collar did not meet in back of my neck. I am Petite, 5', 100 lbs. The sleeve included is nice thicker cotton material than thin gauze type found with other collars I've had. I will need to order the Medium for replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Marianna",
      "helpful_votes": 2,
      "publication_date": 20200108
    },
    {
      "title": "Not good....",
      "text": "Looks soft and comfy. Couldn't be further from the truth!!!! Stiff and hard. Couldn't even use it. SAD111",
      "rating": 1.0,
      "verified": true,
      "author": "Tiger",
      "helpful_votes": 11,
      "publication_date": 20171103
    },
    {
      "title": "Velpeau neck brace",
      "text": "My cervical spine is deteriorating from an old horseback riding injury. As the pain worsens with age, this collar gives me relief and support. I love the removable plastic piece. It’s not comfortable to sleep in but I don’t image any collar is. Ordered one for my friend who has similar problem and she loves it too. She says it gives her more support than her other simple collar.",
      "rating": 5.0,
      "verified": true,
      "author": "Tisha King",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "Very comfortable.",
      "text": "I really like this neck brace. The curve in the front is much more comfortable than my old white one. And I like that it is blue because it doesn't get dirty as quickly. I wash it every few uses, and it still looks new. I am a woman, but was fitted for a men's size large (l dont have a lot of meat on my shoulders or collarbone). This is a bit shorter on me than my old one, but I find it equally comfortable. I think this size would work for most people",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah S",
      "helpful_votes": 2,
      "publication_date": 20200906
    },
    {
      "title": "Well made",
      "text": "Got it quickly, as described -- but returned it because did not fit and had to get one here fast. Take account own shape of neck, head, etc. -- and get the right size by actually measuring with a ruler.",
      "rating": 5.0,
      "verified": true,
      "author": "Frequent Buyer",
      "helpful_votes": 3,
      "publication_date": 20190524
    },
    {
      "title": "Great support, great item.",
      "text": "This is a perfect size. I am getting wrinkles in my neck from looking down for phone and watching tv. So I got this to keep that from happening. Double bonus is that it gives my neck amazing support at night for sleeping. I was tired of waking up with an achy neck. Has a notch for your chin so it is very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "DenverMom46",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Amazingly comfortable -- immediate relief!",
      "text": "I needed something to help support my neck while sleeping, as I was continually waking up with severe pain due to arthritis in the neck. I tried a variety of pillows but none helped. Someone suggested a \"neck pillow,\" which led me to the Velpeau neck brace. I was afraid that it would feel awkward or uncomfortable during the night but I found the opposite -- it is extremely comfortable! It's soft, with a removable/washable sleeve, while at the same time providing needed support. It fits perfectly -- I especially love the dip in the front which is designed for the chin. I'm so happy to have found this product, and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaye ",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Perfect Support and Comfort....",
      "text": "This product stabilizes my neck while sleeping, as I have been grappling w/ a pinched nerve in my neck and creates a slight decompression which is what I need, so I can get a good night sleep. I think it'll also be great when flying again b/c it has enough support. It is is not bulky but firm. Like it a lot!!",
      "rating": 5.0,
      "verified": true,
      "author": "A2Zn1",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Good product.",
      "text": "This is a pretty basic product that provides temporary relief when my neck gets tired or sore. I put it on and it seems to take pressure off of the neck and upper shoulders when needed. A nice product for the price. Now, I need to get my neck problem checked out by a doctor.",
      "rating": 4.0,
      "verified": true,
      "author": "slant6bob",
      "helpful_votes": 5,
      "publication_date": 20170927
    },
    {
      "title": "WORKS FOR SITTING OR WALKING.  NOT FOR SLEEPING.",
      "text": "I suffer from neck fatigue and have needed to use this at the office while I'm sitting at my computer and walking on the treadmill, but it does not provide enough support for sleeping. For that purpose, I use a travel pillow that is fantastically supportive and wake up in no pain. But this one is good for sitting at your computer and walking like I said.",
      "rating": 5.0,
      "verified": true,
      "author": "Ravenhair312",
      "helpful_votes": 2,
      "publication_date": 20190302
    },
    {
      "title": "The best neck support purchased in years",
      "text": "This neck brace is above and beyond. Very soft and comfortable fit. Can wear all day long. Was confused between size M and large. Got large before from other brands where they overlap from behind for a tighter fit. I got M and the size is a perfect fit. My neck circumference is 13.4",
      "rating": 5.0,
      "verified": true,
      "author": "Hana Abdul",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Excellent support!",
      "text": "I got substantial and almost immediate relief with this neck brace. I ordered the version with a fixed stiff support. It gets uncomfortable if you want to wear it all day, which I do for now. I believe there is a version of this neck support that has the very stiff part that is removable. I would recommend that over the version with the fixed stiff support. Also, I expected a removable washable cover which the version I ordered does not have.",
      "rating": 4.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Tight fit",
      "text": "I bought this to help with my vertigo. It is a very tight fit and my head was pushed up at an angle. It was is uncomfortable and I could not wear it. It is very soft. I could not sleep in it because of the angle of my head.",
      "rating": 2.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 2,
      "publication_date": 20190801
    },
    {
      "title": "Really helps with occipital pain",
      "text": "This has been a life saver and my neck pain is under control as long as I sleep with the brace. I suffered from bad occipital pain which was unrelenting until I found this brace. I started by wearing it during the day at work and now I only wear it at night while sleeoie. My biggest complaint is that it gets hot and the velcro can be a little irritating. Otherwise, it washes well and has been the answer to getting rid of my neck pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Melody",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "The perfect fit",
      "text": "I like it better then the old off white ones it fit right under the chin I wish it was a sleeve to slide on",
      "rating": 4.0,
      "verified": true,
      "author": "Sherry Hicks-Savage",
      "helpful_votes": 4,
      "publication_date": 20190203
    },
    {
      "title": "Very comfortable solution",
      "text": "At age 66, some of my 'spinal disks' are aging faster than others, especially a few cervical ones. I was looking for a convenient way to 'stretch' my neck out a bit during the day or evening to help ease the strain and help the muscles relax. Found it! And very comfortable to wear. Sizing chart was accurate, materials and workmanship are excellent. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim W",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Product is comfotabe and attaches appropiately without cumbersome discomfort",
      "text": "I loved everything about this product. It works, is simply when using attach Velcro strip one to the other together, its comfortable, dependable stays in place and helps correct any unintended desire to move the neck in a way that can cause discomfort. Outstanding product I bought another one because the size was too small but I am keeping them both. no need to exchange a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Great to use when a bit of support is needed",
      "text": "SHIPMENT: The product arrived on time and the packaging protected the contents so that nothing was damaged while being shipped. USE: Easy to use, no instructions needed. The only downside I have is that it falls off when I am sleeping, but I am a violent sleeper and I suppose the alternative would be strangulation. Regardless, even when I wake up without it on the difference in neck pain between when I wear it and when I don't is immense. PRICE: I am satisfied I paid a fair price. The equipment does what it says it will and is easy to use and store.",
      "rating": 5.0,
      "verified": true,
      "author": "Deep6",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Works",
      "text": "First time wearing a neck brace. Had vertigo over the weekend and did the Eply maneuver, and needed a neck brace for 24 hrs after. I was also using it for driving, too keep my head up right👍 Works!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Bug",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Not as advertised",
      "text": "In the picture it says the sleeve is provided to protect but there is no sleeve came with the it",
      "rating": 2.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 3,
      "publication_date": 20191008
    },
    {
      "title": "Neck brace",
      "text": "Getting ready for neck surgery this was required to buy by the doctor. Love this particular brace as the proper size can be determined by your neck size. Very excellent support. I did put a microfiber cloth under the brace as I felt the material too scratchy for my skin. Easy to sleep with it on but sleeping on my back seems to be the most comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "janice S Weisenbarger",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Soft but firm support",
      "text": "I do not have a neck injury. I wanted something soft to sleep with to reduce the horizontal wrinkles on my neck. It also came with a removable sleeve. I am very satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa G.",
      "helpful_votes": 2,
      "publication_date": 20190708
    },
    {
      "title": "Perfect fit and support🙂",
      "text": "I purchased this one as a replacement for the one I got from the hospital after my spinal fusion surgery. This fits perfect and provides me with the support and immobilization that I need after my surgery - much better than the hospital one. I am very impressed and will order another just to have one ready while washing the other. I would definitely recommend this cervical collar👌 Make sure you measure your neck first as they run smaller. I have the hospital one in size S and this I have in Medium - Perfect Fit!",
      "rating": 5.0,
      "verified": true,
      "author": "\"Chloe245\"",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "RN neck support.",
      "text": "I have a cervical fusion so I thought this would help with some neck pain. I’m currently a RN working Case Management. It involves a lot of sitting at a desk and this is hard on my neck. I tried this brace and it was instant relief. It sets the proper alignment, relieving pain from my bad posture while sitting at a computer. It’s soft and I barely notice it. I definitely recommend if you need neck support. Great price point too.",
      "rating": 4.0,
      "verified": true,
      "author": "C. J. McBroom",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Great comfortable support",
      "text": "My cervical surgery has been delayed due to the covid crisis and I found relief with this collar while I’m waiting. I wear it while at the computer and while I’m sleeping. It’s excellent support and comfortable. I think it runs small however. I’m a small person and the medium fits like a small from another brand. I do recommend it if you are so inclined to purchase one. Stay safe and well people and appreciate one another with respect.",
      "rating": 5.0,
      "verified": true,
      "author": "That Italian Chick",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Easy to use cervical collar.",
      "text": "I like the the ease of use. I have vertebrae problems in my neck. I sometimes wear the collar for sleep and sometimes when I am up and active and have neck pain. I don't put it on tight enough to truly support my neck, but it keeps it warm and usually eliminates the pain.",
      "rating": 5.0,
      "verified": true,
      "author": "S Lewis",
      "helpful_votes": 2,
      "publication_date": 20200314
    },
    {
      "title": "An opened product.",
      "text": "It looked like it had been opened & the plastic bag containing the collar had a film on the inside.",
      "rating": 1.0,
      "verified": true,
      "author": "Miss Kitty",
      "helpful_votes": 3,
      "publication_date": 20190625
    },
    {
      "title": "Great quality, but sizing is wrong.",
      "text": "I ordered the Large 3.5\", 13 1/4\" to 16 1/2\" Dual-Use Neck Brace. Was impressed with the quality. The problem is my neck measures 15 inches, this should of fit, but I have a gap of 1 1/2 inches. With the gap, the brace isn't supporting the back of my neck sufficiently.",
      "rating": 3.0,
      "verified": true,
      "author": "MistyMarie",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Not large enough",
      "text": "I get it, I am a lot larger right now than I like, please don't shame me for that. But when I bought the largest size they had I was hoping or at least expecting that it would be large enough for me. It wasn't. It otherwise looks and feels like an okay product. It just feels like its literally cutting off circulation and making it more difficult to breathe if I put it on.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven M.",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Too small",
      "text": "I received the wrong size than I selected on the site (which I felt might happen because the choices were out of order on the site) so I just returned it since I had another option that fit better",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "This brace helps with my chronic neck issues due to degenerative disc disease",
      "text": "This brace is helping me deal with pain and pinched nerve issues due to degenerative disc disease in cervical spine.It is not a cure but has been very helpful at those times when I overdo it, and then suffer. It takes a while to adjust to it , but when you get there, it really stabilizes your neck, firm, but soft feeling. And there is a stiffer collar if you need more support.",
      "rating": 5.0,
      "verified": true,
      "author": "catzilla",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Uncomfortable",
      "text": "Works for neck pain but very uncomfortable. I like keeping my neck straight while sleeping due to neck pain and I wore this band on while sleeping, I almost felt choked after some time. Not a recommendation but a suggestion that donot wear it while sleeping. However it’s good in keeping your neck straight.",
      "rating": 2.0,
      "verified": true,
      "author": "Mamta",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Is supportive with or without plastic insert.",
      "text": "I bought this neck brace to help deal with a very bad stiff neck. It's supportive and quite helpful, though I found using it with the plastic insert made the areas of contact around my jaw line and base of my skull rather sore. After 2 days I took the stiff plastic piece off and used the brace without it and it's been more comfortable while still providing support. I ordered a size up, based on other reviews.",
      "rating": 4.0,
      "verified": true,
      "author": "Vickie",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Do not buy this!",
      "text": "This collar might not even fit a child depending on how small their neck is! Ridiculous!!!",
      "rating": 1.0,
      "verified": true,
      "author": "MariaG",
      "helpful_votes": 2,
      "publication_date": 20200320
    },
    {
      "title": "Neck pain and migraine Reilief!!",
      "text": "Really helped my neck and migraine pain all weekend . Love the long straps but needed it just to be a little longer length under the neck I measured my neck and length and ordered myself another one in nude. Wish the Velcro’s strap was a little bit longer . Love my navy blue one!!",
      "rating": 5.0,
      "verified": true,
      "author": "laura phillips",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Soft Support",
      "text": "My wife mainly uses this for sleeping since the car accident. She suffers a lot of neck pain and this helps keep her head from getting in the wrong position. During the day she goes between this and an inflatable collar. It doesn't offer the support of a solid collar but it does help. Material are good. Size is perfect for my wife but if you have more than one chin it may not fit you. Check the measurements before buying.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Taylor",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Good product. I recommend them.",
      "text": "I have two of these soft neck braces. They are both comfortable and gave the support I needed at the time pre-cervical neck surgery. They also came in handy, after the surgical incision healed enough and I was out of the post-op hard neck collar, to give support once I began physical therapy. Easily cleaned using the gentle cycle on the washing machine. The only thing I did not like was how quickly my neck became sweaty, which normally does not happen. I cannot say if it was a material breathability issue or from me. Regardless, these support collars are good and I recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Bridget Kirkpatrick",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Better than I expected",
      "text": "I have a reverse curve in my neck due to a childhood injury. I purchased the 3\" enhanced version for support while I study, but it feels so nice to relieve pressure I may wear it for more than that. Also considering purchasing a second one for sleeping. I love it. Great support and great quality. Better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "rgalley",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "As it says",
      "text": "My daughter had herniated two discs in her neck and they were surgically repaired. However, the neck brace we brought home for her to wear rubbed her chin raw. This neck brace is simple but is much gentler on her to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "LoveGod",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Big improvement!",
      "text": "I am using after a neck surgery. Wearing a soft collar can’t really be characterized as comfortable, but this one is vastly better than the GoT torture device I was sent home with. Fabric is soft and it has a washable over-sleeve, which is nice. Very supportive and limits movement effectively, but it has enough give to not dig in with hotspots around my jaw or skull. I haven’t tried others so my comparison is limited, but I’d certainly recommend. If you have to wear one, this one is worth a go. Make sure you size carefully as the range of adjustability is limited.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin CB",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Snug and comfy. Definitely helps",
      "text": "My neck went out when I woke up and put pressure on it. Couldn't move my neck without having some pain there. This really helped me get through the week. I was going to order a small, since my neck measures 11.5\" but the medium was a lot more flexible for me which fits nice and snug. I wore it when I slept too. I would imagine the small being rather tight even though it is adjustable around the neck. Kinda wish they had the medium in 2.75\" with the neck height. This one at 3\" was a tad to much.",
      "rating": 4.0,
      "verified": true,
      "author": "ctG",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "very comfortable",
      "text": "This soft collar is a great improvement over most available collars. I was between a small and a medium by measurment and bought the medium after reading the comments. It is a good fit and stabilizes my neck comfortably with its' \"vee\" design. Personally unable to sleep in it, but it is lightweight and the fabric is soft. Will probably buy another one so I have one to wear when one needs to be washed.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce A.",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Not very big around and very stiff, not comfortable at all.",
      "text": "These are not big enough around for normal necks. I am not a tiny person, but I am not large either and definitely don't have a big neck. This brace won't fit all the way around my neck. They are also very stiff and not comfortable to wear at all. I bought two since I was not sure how thick (tall) I needed them to be. I will probably just throw them away as I throw them away.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelly W.",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "great!",
      "text": "I am differently abled, so I can only speak for myself and I thank you for the privilege. this item helps me walk better than I have in years,. a poor excuse for an exoskeleton. but really extremely helpful, to the likes of me. thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Irene Dubyk Bergen",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Both quality and comfortable support",
      "text": "It feels like custom made. It give me way better support than the Walgreens option, and the quality is just superb. No unnecessary pressure points like the adjustable Walgreen's. In addition to comfort and quality, it arrived on time, professionally packaged with additional cover. Basically feels and looks like luxury item.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica Dimitrova",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Chokes you",
      "text": "Not so comfortable. There must be a way to design these things so that it doesnt compress your blood vessels so much. Feel like im being choked. It is soft though i give you that",
      "rating": 2.0,
      "verified": true,
      "author": "Master U",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Support neck brace",
      "text": "A bit stiff and hard but does give great support. I believe with more use it will shape to my neck a bit better and feel less hard. I'm happy with the purchase as it has helped my neck and I would recommend the product.",
      "rating": 4.0,
      "verified": true,
      "author": "paboyd2657",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Runs very small! Check your neck measurement",
      "text": "This product runs extremely small. I normally wear a child size and I ordered a small. It would be more helpful if they would give you the neck measurements for the sizes. I was happy with the comfort & the support but it was too small",
      "rating": 4.0,
      "verified": true,
      "author": "Alisha Carr",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Worked well",
      "text": "This is a great brace. Great support. Not great comfort but it's a neck brace by their design they're not comfortable. Same can be said for softness. I liked the additional plastic piece to add for more support. I didn't need it. It worked well for me .",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Helps me sleep",
      "text": "It makes it easier to fall asleep and my neck doesn’t hurt when I wake up",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Easy to travel with. Comfortable.",
      "text": "Soft, easy to carry and travel with. Helps keep neck in the right position to prevent long term neck sprain/pain. Adjustable straps allow it to fit various neck width. As for height, choose the right size. Purchased several for family as well.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonFanB",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Way too firm in my case.",
      "text": "Very firm foam however it was so firm that it was unwearable for any length of time. Might throw it in the washer and tumble dry low in dryer to see if it will loosen up foam.",
      "rating": 3.0,
      "verified": true,
      "author": "The Truth",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Way too hard",
      "text": "This product is way too stiff and uncomfortable it feels like I'm wearing a neck brace for a broken neck... I would not recommend anyone to buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Lakeesha",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Recommended by my daughter for headaches",
      "text": "Works as promised. Recommended by my daughter for headaches. It really work especially in headaches caused by neck pain",
      "rating": 5.0,
      "verified": true,
      "author": "David  A Myers",
      "helpful_votes": 4,
      "publication_date": 20180723
    },
    {
      "title": "Compresses upper back spine",
      "text": "This product actually compressed my spine. I wore it for an hour and felt like I needed to stretch out my upper back and sit inverted to alleviate the pressure I felt in my upper back.",
      "rating": 2.0,
      "verified": true,
      "author": "Giant",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Comfort with support.",
      "text": "I am a petite woman and have a significant case of cervical spinal stenosis. This neck brace (size small) provides support while watching TV and doing other general tasks when my neck is achy and tired. It also keeps my neck in alignment while sleeping. It is easy to adjust, and It is soft enough to be comfortable for extended wear while firm enough to reinforce my neck when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline Swaim",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "If you’ve never needed a c-collar before... try this one first!",
      "text": "I was hesitant about ordering a collar without trying it on first, but I’m definitely glad I found this one! So easy to wear with most of my clothes without being in your face that I have a Cervical collar on, especially in the winter; I was able to get my hoodies and shirts over them without a problem (I have both versions) and even customized them with colorful, fuzzy socks on a few occasions. Highly recommend if you have never had to wear one of these and need it for daily support/protection!",
      "rating": 5.0,
      "verified": true,
      "author": "MamaSloth",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "A Tip For Wearing!",
      "text": "I had to wear a heavy duty hard collar for 6 weeks due to 2 fractures. After that I was able to wear a soft collar and ordered this one. I love that is has a silky sleeve to go over it for comfort and for cleanliness. There is a seam on the sleeve that WAS badly irritating the skin beneath my neck . . . but when I figured out it was the seam not the brace itself I took the sleeve off and put it back on being sure the seam on the collar was facing out and not touching my skin. Then it was very comfortable day and night!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Jill Wainscott",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Great comfortable support!",
      "text": "Sooo comfortable compared to the stiff wrong size piece foam rubber given to by the hospital after cervical laminectomy. This brace feels very supportive without binding. Even with my claustrophobia, this is comfortable while awake or asleep. Have recommended this brace to my neurosurgeon.",
      "rating": 5.0,
      "verified": true,
      "author": "BobAStacy",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "I am pretty small and it barely reaches around",
      "text": "Advertised as a medium but must be a medium child. I am pretty small and it barely reaches around.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20171027
    },
    {
      "title": "Very supportive but too stiff",
      "text": "I like that this neck brace is very supportive but it is very stiff. Has no give to it. It’s not that comfortable but it may just take some getting used to considering the one the hospital gave me was really soft. I am going to give it some time to see if it gets more comfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "Tammy H",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Make sure you order the right size. It comes larger than what I thought.",
      "text": "This product provides enough to correct the problem, but make sure you order the right size. I ordered a medium and it is still too large for my neck.",
      "rating": 4.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Good neck support.",
      "text": "I had a crik in my neck that would not go away, it kept me awake at night. I could not move my head without my neck hurting badly. I used this for a few days until the crik went away. It's soft, gives good support but doesn't feel like it's choking you. Served its purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Honestly...",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "NECK FUSION",
      "text": "I WEAR THE BRACE BUT WISH IT WAS SOFTER AND IT REALLY KEEPS NECK STRAIGHT. IT IS A LITTLE UNCOMFOTABLE. I WAS TRYING TO FIND ONE LIKE THE ONE HOSPITAL GAVE ME. I GUESS MY NECK IS TO SHORT.",
      "rating": 3.0,
      "verified": true,
      "author": "theresa",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Great !!!",
      "text": "Best neck collar I’ve ever had !! I’ve had 2neck surgeries and this is a very comfortable collar",
      "rating": 5.0,
      "verified": true,
      "author": "Micki",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "To tall at the front",
      "text": "This was for an elderly person, we were trying to get some help to keep her head from rolling forward, she sleeps upright.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Works but little soft, not firm",
      "text": "The product is a little soft for me. I was looking for something firm but this one is rather less firm. Because of that It doesn’t hold the neck in place. But even so, it did help with the pain noticeably, hence I am giving 4 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Ranjit",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "measure correctly",
      "text": "sprained my neck. Was very painful. This brace helped me be able to do things with a lot less pain. It was also useful for sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Mondy",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Supports the neck but not convenient for sleeping.",
      "text": "Bought the first one (Large/Special) and it was too big so I ordered a second one (Medium, regular) and it was better. I'm still not sure how it is even possible to sleep with these one... They are not very soft, and would make for an uncomfortable sleep in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "A. D. ",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Not ventilated and gets hot while you wear it.",
      "text": "Purchased this for my elderly mother to help her with neck pain. She stopped wearing it because there's no ventilation to help minimize the heat generated by wearing the unit.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley Mostofi",
      "helpful_votes": 5,
      "publication_date": 20180308
    },
    {
      "title": "Stiff and uncomfortable",
      "text": "Bought this item for family member who's recently had surgery and unfortunately it was really rigid, hard, and not at all comfortable.Returned it and purchased another collar.",
      "rating": 2.0,
      "verified": true,
      "author": "SGD",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Easy to use",
      "text": "The product is easy to use, velcro and fairly comfortable. It does help pinched nerve sore neck - be patient, it takes a while. Also chin tucks and good posture helps. I would have liked a diagram in the box, was not sure it was on correctly until I went back to the website.",
      "rating": 5.0,
      "verified": true,
      "author": "M Young",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Checks ALL the boxes! But go smaller!",
      "text": "Checks all the boxes including only well-fitting neck brace I’ve ever found!!! Very supportive but softish at the same time. But ... it runs large I’m a fairly big guy but find the medium to actually be huge! The small is excellent for me.",
      "rating": 5.0,
      "verified": true,
      "author": "DON Z.",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "The best one I have used... larger necks",
      "text": "Very good collar. This is the best one I have tried and I tried many. Ordered extra large and this is the only one that really does the job. If you have a larger neck size, I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Fine",
      "helpful_votes": 3,
      "publication_date": 20180224
    },
    {
      "title": "Great Product.",
      "text": "I really do like mine. The only thing I would like is to be able to purchase sleeves separately. I pretty much have to wear this comfortable product all the time and when the sleeve needs to be washed, I don’t have another sleeve to put on. This is a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Hancock",
      "helpful_votes": 0,
      "publication_date": 20200129
    }
  ],
  "product_meta": {
    "title": "Velpeau Neck Brace -Foam Cervical Collar - Soft Neck Support Relieves Pain & Pressure in Spine - Wraps Aligns Stabilizes Vertebrae - Can Be Used During Sleep (Comfort, Blue, Medium, 3″)",
    "rating": 4.1,
    "feature_bullets": [
      "【IMPORTANT NOTE】Velpeau Neck Braces have three designs, comfort version, dual-use and enhanced version.The comfort version is soft and comfortable. For the dual-use version, the external flexible plastic support plate that can be removed freely is added to improve the support force. If the support plate is removed, the effect is the same as the comfort one. The enhanced version is made of double layer foam and EVA foam superimposed on each other, which is soft and provides more powerful support.",
      "【SUPERIOR PAIN RELIEF AND INJURY SUPPORT】Our Cervical Collar supports the jaw and neck while limiting mobility to relieve pain and pressure in the spine. Realigning and stabilizing vertebrae, the soft foam collar can be worn throughout the day and while sleeping, it is for superior support and pain relief. The non-rigid Neck Support will also relieve headaches caused by cervical strains and sprains. It is useful for post-operative rehabilitation and injury support.",
      "【BREATHTAKING DESIGN & PERFECT FIT】Designed according to Ergonomics, its“V”shape at the under jaw makes it more comfortable and solid, and the curve rise at the back supports the neck better. Velcro design, which is free to adjust the tightness, is to prevent the pain caused by swinging. It is even more comfortable to wear at night.",
      "【PREMIUM QUALITY】Our Neck Collar is made of top materials, and exquisite workmanship, which is lightweight, and relieves pain without compromising your mobility. It absorbs sweat fast and keeps your neck dry and odor free with breathable and latex-free materials. Skin-friendliness gives you comfort in continuous use which helps keep your neck cool.",
      "【100% REFUND GUARANTEE】Buy the item with confidence! Either you love the Neck Support Brace or get full refund! Just let us know what the problem is and we will take care of the rest. We highly appreciate all customers' opinions to improve the quality and service, also if there is anything you are unsatisfied, pls contact us for probable best solution."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6.2 x 4.2 x 4.2 inches; 4.94 Ounces",
      "Item model number": "4332456215",
      "Date First Available": "June 4, 2017",
      "Manufacturer": "Shenzhen Weprotex Technology Product Co.,Ltd",
      "ASIN": "B072Q9QG68",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Medical Supplies & Equipment",
      "Contoured Support Pillows",
      "Mobility & Daily Living Aids",
      "Health & Household",
      "Bedroom Aids & Accessories",
      "Health, Household & Baby Care"
    ],
    "price": 14.99
  }
}