{
  "website_summaries": [
    {
      "verdict": "The whole family can enjoy this brightly colored reasonably priced hand board.",
      "pros": [
        "Speedy and compact size",
        "Good price",
        "Come with a wrist leash",
        "Company stands behind the product",
        "Also comes in blue",
        "Comfortable design makes it easy to use"
      ],
      "cons": [
        "This hand board is a little shorter than a few other models on the market"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I'm satisfied with this purchase",
      "text": "just used it today for the first time. It does give a little extra lift in the wave. You really have to hold it right so that it doesn't dive under the curl of the wave and wipe you out. Wearing this on your hand makes it hard to swim though. But, overall, I'm satisfied with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Oscar R Truitt",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Great for the price",
      "text": "So easy to throw this in the backpack and go have fun. Holds up well. Not plastic.fiberglass or CF. It feels like its made of a super rigid \"boogie board like\" material. Can't beat the price. Lot's of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Ric Mc",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Delightfully surprised!",
      "text": "Had never used a hand board and saw this pretty cheap one on amazon so figure I’d give it a try. Received it today and took it out for a sesh and damn, it was so much fun! I’m used to body boarding but this was a cool experience as well. It gives you a really nice extra push when you’re swimming and even better base when you’re catching waves! I’ve seen crazy expensive ones that don’t look as good as this one. Crazy good value!!",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac ramirez",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Fun and Easy to Use",
      "text": "My son had fun using this on our beach vacation last week. It worked well and was less bulky and cumbersome than a full boogie board. He was able to get some good wave rides. The only downside is that is that the small size doesn't offer the chest/stomach protection that a full board does, so you need to be careful of getting scratched up by the sand.",
      "rating": 4.0,
      "verified": true,
      "author": "Boys Kindles",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Catching waves never easier!",
      "text": "Packed in average size back pack. Still had room for my fins and water socks. Only missed one wave I paddled for during initial forty minute session. Easy access for shore break barrels. Still need to figure out best way to swim and float with it. No regrets!",
      "rating": 5.0,
      "verified": true,
      "author": "MILES MCBRIDE",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Surf Plane",
      "text": "Only 4 stars since I have not had a chance to use. Will try out in March in Costa Rica. Looks well made",
      "rating": 4.0,
      "verified": true,
      "author": "no name",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Present for a 16 year old",
      "text": "While I did not utilize it, we did get a great review from the end user. He used in the Pacific Ocean and said it was a fun change up in the water!",
      "rating": 5.0,
      "verified": true,
      "author": "Geri K Nelms",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "It is just what we wanted",
      "text": "The handboard is so much fun. The orange color is very bright and happy. All of us can fit our hands in it. We have a beach house that we go often in the summer for family vacation and we look forward to this coming summer to have some fun with this surfing handboard with our kids. The orange board will look so sharp in the blue water.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Thurso surf hardboard great product",
      "text": "Had alot of fun playing with this at the beach. Fits great and the strap is easily adjustable",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Awesome !",
      "text": "Awesome handboard!! Definitely suggest ! Great price ! Super fun out in the ocean!",
      "rating": 5.0,
      "verified": true,
      "author": "alana",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Good product",
      "text": "Seems like a well made product. Like the bright color.",
      "rating": 4.0,
      "verified": true,
      "author": "Aurora Ministero",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "It is pretty fun.",
      "text": "My kids weren't sure about it but it was pretty fun once they got used to it. Better than traveling with a boogie board on vacation. Add fins and you are ready to go. Price was right, especially when you are not sure if they will like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric C. Brown",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Will make you a pro in water",
      "text": "Great hand plane with excellent buoyancy.excepcional bite in steep waves",
      "rating": 5.0,
      "verified": true,
      "author": "m campbell",
      "helpful_votes": 0,
      "publication_date": 20190205
    }
  ],
  "product_meta": {
    "title": "THURSO SURF Slash Handboard Body Surfing Hand Plane with Wrist Leash PE Construction Durable Lightweight Buoyant and Comfortable",
    "description": "THURSO SURF Slash handboard is the ultimate equipment for some fun hand surfing. The board is made of premium polyethylene material that increases speed, projection and flexibility. Sizing 14’’×8.5’’×1’’ (36×21.5×2.5 cm), the board is perfect for everyone. Comes with a wrist wrap leash. Never worry about losing the board when surfing. Your satisfaction is 100% GUARANTEED! If there are any manufacture defects with your THURSO SURF Slash Handboard, let us know and you can get your item refunded or replaced with no question asked!",
    "rating": 4.7,
    "feature_bullets": [
      "THURSO SURF Slash handboard is the ultimate equipment for some fun hand surfing",
      "The board is made of premium polyethylene material that increases speed, projection and flexibility",
      "Sizing 14’’×8.5’’×1’’ (36×21.5×2.5 cm), the board is perfect for everyone",
      "Comes with a wrist wrap leash. Never worry about losing the board when surfing",
      "Your satisfaction is 100% GUARANTEED! If there are any manufacture defects with your THURSO SURF Slash Handboard, let us know and you can get your item refunded or replaced with no question asked!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "14.3 x 7.4 x 2.1 inches; 6.38 Ounces",
      "Date First Available": "June 8, 2017",
      "Manufacturer": "THURSO SURF",
      "ASIN": "B072TW2CMV",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Bodyboards",
      "Surfing",
      "Sports & Outdoors",
      "Water Sports"
    ],
    "price": ""
  }
}