{
  "website_summaries": [
    {
      "verdict": "With decent heating power and nice power saving and sound on/off controls, this compact unit works well for those with limited counter space.",
      "pros": [
        "The 900 watts of power is adequate to handle smaller dishes",
        "Simple to use power-saving mode",
        "Includes an option to turn off the keypad and timer beeps that some users find annoying"
      ],
      "cons": [
        "The plastic feet on the bottom of the unit may not prevent this small microwave from sliding around when opening or closing the door"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great microwave",
      "text": "I had been searching for a good microwave for quite some time. I was surprised at how cheap some of the ones on the market look and wanted something sleek that would blend in with my new kitchen. This was the perfect choice! It's very easy to use and isn't very loud at all. Great if you wake up earlier than someone you live with and don't want to wake them. The buttons are clear and easy to read. It has several specialty functions that are going to be really useful! I really don't have anything negative to say about this microwave. I'd highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Keely AllyseTop Contributor: Pets",
      "helpful_votes": 622,
      "publication_date": 20170923
    },
    {
      "title": "Great microwave! Heats stuff fast",
      "text": "Great microwave! Heats stuff fast. Others love that you can turn the beep off. Personally I need the beeping because I tend to wander off. I love that you can turn the idle power off. The only thing that I'm not crazy about is that you have to pull the handle to open the door, rather than a button to push that releases and pops the door open. The latch is secure, so when you pull it would not be hard for it to slide enough to drop off the edge of the counter. But that's minor compared to everything else, including the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen Marie",
      "helpful_votes": 204,
      "publication_date": 20180713
    },
    {
      "title": "Really good with nice features!",
      "text": "Seems to work well, and heats stuff fast, This is a smallish microwave, and not meant for large items. An standard 10-11\" plate will fit inside, leaving about a 1/2 inch on each side of the inside area. The \"one-touch\" times cooking feature is nice. The microwave makes a bit of noise when it first starts (like a warm-up), but quiets down in a second. It's not super quiet though. The button beeps are quite loud, so silencing them is a good option.",
      "rating": 4.0,
      "verified": true,
      "author": "JVII",
      "helpful_votes": 132,
      "publication_date": 20180531
    },
    {
      "title": "The Beep Muting Process",
      "text": "Thanks to all people trying to help with the my \"muting/attempt\" problem, especially Amazon. I couldn't get the beep to stop and returned it for an exchange. Got the new one and still a no go. I called Toshiba,(thanks Toshiba). and here's the secret which is not in the instructions.( You need a better tech writer Toshiba. Call me, I'm available for the next nine months.) All you have to do is hit the stop/clear button twice and then push the #8 for 3 to 5 seconds. You'll hear a goodbye beep and it's done. Repeat to reverse the process. Good product. Fits my needs and otherwise works just as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Maverick",
      "helpful_votes": 86,
      "publication_date": 20180617
    },
    {
      "title": "I LOVE this microwave",
      "text": "This microwave is the greatest! I love Toshiba products, and this one has not disappointed. The black stainless steel is beautiful. The fact that you can turn the 'beeps' off is amazing (I have it in my office at work). It is quiet while running. You can lock it (easily) so unwanted users can't invade. It even has a power save mode. The LED light is another plus. It is well worth the price. And ordering from Amazon was, as usual, amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherylanne",
      "helpful_votes": 51,
      "publication_date": 20180628
    },
    {
      "title": "Poor product support, outrageous cost for $2 LED light.",
      "text": "Well! Had this microwave for 14 months and the light started to flicker. An easy fix, no? No. Unit has a led circuit board soldered in place. Customer service says sorry out of warranty take to a service center. I paid under $100 for unit, having it repaired would cost at least that much. Toshiba gave me a part number for GE. $45! Half the cost of the unit. No thank you Toshiba! Will live with flickering light for now. Do not buy, terrible service, led should have been sent for free. Do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "R. J.",
      "helpful_votes": 22,
      "publication_date": 20200220
    },
    {
      "title": "Light failure after 3 months",
      "text": "Used for three months before light inside failed (stays dark even when the door is open, as pictured). Sometimes will flicker on for a few seconds so it seems like the bulb itself hasn't burned out but something in there is shorting. Had my last microwave (a Samsung) for a good nine years of daily use before anything went wrong so pretty disappointed that this Toshiba didn't even last three months. And since it's outside the 30 day window for returns, there's no recourse with Amazon. Not great.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina Lee",
      "helpful_votes": 26,
      "publication_date": 20190212
    },
    {
      "title": "Broke after 2 months",
      "text": "I received this microwave on October 10, 2018. Return window closed on November 9. Day before yesterday the interior LED light started to flicker and today it goes out completely within a minute of use. I am very unhappy with this purchase. I emailed Toshiba customer service twice but have not received a reply.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Lomond",
      "helpful_votes": 23,
      "publication_date": 20181217
    },
    {
      "title": "Quiet and functional",
      "text": "I bought this to replace a more expensive Farberware microwave which was extremely loud (grinding noise from the plate spinning gears) and had the buttons stop working. So far this does the job of heating this and all the buttons work. It's also surpsingly quiet, and even allows you to disable all beep sounds which is something I wanted but wasn't expecting. I'm very happy with this so far. UPDATE January 2019: Still very happy! UPDATE September 2020: Still works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Portland Ben",
      "helpful_votes": 32,
      "publication_date": 20181010
    },
    {
      "title": "Not working properly",
      "text": "I bought this microwave in October 2018. I do not use microwave much. I was melting some chocolate in a glass bowl for 1 minute. Microwave went on fine and then I heard a pop and it was lit up inside. I unplugged and when I checked inside the metal plate was charred and smelled really bad. I no longer have the packaging.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra A. Shaw",
      "helpful_votes": 17,
      "publication_date": 20190702
    },
    {
      "title": "I really like the microwave it does an awesome job for the ...",
      "text": "I really like the microwave it does an awesome job for the price I paid it's well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary R.",
      "helpful_votes": 37,
      "publication_date": 20171219
    },
    {
      "title": "Nice microwave, love the sound off feature",
      "text": "Nice microwave, love the sound off feature. Only complaint is that the feet should be made of a rubber which will not slide on the countertop when trying to open the door. Update: Within two months, the light stopped working inside. It flickers on randomly, may be just a loose connection but it’s not easily accessible.",
      "rating": 3.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 43,
      "publication_date": 20180211
    },
    {
      "title": "Continues to Run After Microwaving Completes",
      "text": "I think it's broken. After microwaving something, I open the door to take it out, shut the door and it starts running again though w/o heat and no time left on the timer. I have to open and reclose the door to get it shut off.",
      "rating": 1.0,
      "verified": true,
      "author": "Tina Rorrer",
      "helpful_votes": 126,
      "publication_date": 20180226
    },
    {
      "title": "Caught on fire after 5 months",
      "text": "I bought this microwave because it came highly rated. This morning my microwave started sparking and lit on fire within seconds of starting it. It appears the waveguide cover started the fire. Seems to be a more recent problem as other reviews about fire seem to have popped up in the last few months.",
      "rating": 1.0,
      "verified": true,
      "author": "ML",
      "helpful_votes": 15,
      "publication_date": 20190415
    },
    {
      "title": "junk",
      "text": "I bought this item 9 months ago. The lights NEVER worked right, always flickering and going out. Tonight while making dinner it started to overheat. The exterior got very hot and you can smell burning electronics. We were careful to follow the manufacturer's instructions regarding the amount of clear space around the microwave,and all other recommendations, so there's no good reason for this to die after such a short time. I'm very unhappy with the quality of this product. Unfortunately, this is the third time this has happened to us with microwaves. We keep trying different brands and the results are all the same. None of them last more than year, but this is the shortest-lived microwave I've ever had.",
      "rating": 1.0,
      "verified": true,
      "author": "K. C. Bromm",
      "helpful_votes": 8,
      "publication_date": 20190711
    },
    {
      "title": "Highly recommend this Toshiba",
      "text": "I purchased this microwave for a gift. It replaced an old 1200 watt microwave. This 900 watt microwave takes approximately 2.5 minutes longer to cook a meal than the higher watt, but that really isn't too long to wait. The handle is a much nicer feature than the push to open button on other models and the darker stainless finish gives it a modern look. Highly recommend this Toshiba.",
      "rating": 5.0,
      "verified": true,
      "author": "OverandOut",
      "helpful_votes": 21,
      "publication_date": 20180703
    },
    {
      "title": "Four Stars",
      "text": "I like everything about it but the door latch. Takes two hands to open it.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia Perryman",
      "helpful_votes": 15,
      "publication_date": 20180305
    },
    {
      "title": "This is a great product!",
      "text": "I'm really pleased with the quality and appearance of this oven. It arrived today - a day ahead of schedule - and was very securely packaged. I used it to heat a frozen burger and it took a little longer than my old one but that's okay. I haven't set the clock or used the kitchen timer yet. It seems a little complicated but I'll take my time and read the user's manual. All in all, I don't think you can go wrong with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "John Horky",
      "helpful_votes": 12,
      "publication_date": 20180930
    },
    {
      "title": "Fast Heat Up / Looks Nice",
      "text": "Arrived fast, thank you!! Nice looking, easy to use and fits nicely. Heats fast, easy to read. Packaged great. I'm happy it arrived so fast as my other one (4 yrs. old) I found had broken/rusted and I'd been using it. I threw it out and came here immediately to get a new one and different brand. So far, perfect! Easy to clean also. No noise I notice at all. It seems well built so I guess it's about a normal weight as I don't have anything to compare it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Blu J",
      "helpful_votes": 17,
      "publication_date": 20181029
    },
    {
      "title": "I'm very satisfied",
      "text": "I've had this microwave for about 3 months and I have zero complaints. It fits perfectly into a little nook in the corner of my kitchen, is lightweight and I like the black color - dirt doesn't show up as easily lol I don't think this microwave is any louder than any other microwave I've used. Although I wear reading glasses I still have no problem reading the numbers on the control panel. What else? It's a microwave oven. And I'm very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Josiah X",
      "helpful_votes": 6,
      "publication_date": 20181113
    },
    {
      "title": "Junky Microwave, keep looking",
      "text": "I've only had this microwave for 2 years, but I am look to replace it because I hate it. Specifically because the turn table inside comes out almost every time you reach in to take out your food and then you're holding hot food trying to reset the tray directly onto it's axis point and it is super frustrating. Also, lately it has gotten so loud that I'm afraid of whatever it may be emitting into the air. Wasted my money on this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "The Alvesians",
      "helpful_votes": 4,
      "publication_date": 20200517
    },
    {
      "title": "Stopped working after a week of use",
      "text": "The microwave stopped heating up food after a week of use. The light still turned on and the tray rotated, but the food would not heat at all. I put in a bag of steamable vegetables in the microwave for 5 minutes and when the 5 minutes were up, the vegetables were still frozen. Not even slightly melted. This happened several times in a row.",
      "rating": 1.0,
      "verified": true,
      "author": "Valerie B.",
      "helpful_votes": 6,
      "publication_date": 20191207
    },
    {
      "title": "Light burned out after a week",
      "text": "The LED light, like so many others reported here, burned out after light use for a week. That's absurd. It's clearly a known problem, given how many 1-star reviews are here with that exact issue. Everything else about the unit is great, but this awfully failure-prone \"LED light\" system is bad news. Incidentally, when else in your entire life have you seen an LED light burn out? I have never had an LED light bulb or other light source with an LED fail on me. I really wonder what is going on here.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Higgins",
      "helpful_votes": 5,
      "publication_date": 20190408
    },
    {
      "title": "LOVE!!!!!",
      "text": "I cannot say enough about this microwave! I purchased it to replace one that I had had for years, but hesitated because my 95 year old mom with dementia knew how to use the old standby. I was afraid that introducing a new one would cause confusion and inability for her to operate it. I was so wrong. It's extremely user-friendly, pretty, the perfect size and wattage, and I couldn't be happier with this purchase! I would highly, highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Marie Hailand",
      "helpful_votes": 6,
      "publication_date": 20181001
    },
    {
      "title": "Worked OK but did not last long",
      "text": "I purchased this in May. It is late August and the microwave has died. When I looked for a replacement, this had the best rating, but 3 1/2 months is not a long time for a microwave to last.",
      "rating": 3.0,
      "verified": true,
      "author": "NANCY J.",
      "helpful_votes": 10,
      "publication_date": 20180816
    },
    {
      "title": "Happy & then it died at day 31.",
      "text": "Already died. It arced out and we have no idea why. We are extremely cautious and I put a dab of butter in an approved bowl to melt for 5 seconds.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathryn Loveless",
      "helpful_votes": 7,
      "publication_date": 20180829
    },
    {
      "title": "Don't buy this",
      "text": "After a few months, this microwave just up and died. Today is November 19 and the product support window closed on November 18, so there is no recourse. I'm going to buy locally from now on as there are many items like this that can't be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20181119
    },
    {
      "title": "If I were you, I'd get this :)",
      "text": "I actually like this microwave. I thought it would be cheap, like cheap heating since it's the average size but it's actually really good. I'd recommend this to you if you're looking for a small but good microwave. It also came packed in 3 boxes lol and it came in 4 days. I ordered on the 6th and it came on the 9th or 10th when it was supposed to be here in 2 weeks. Crazy fast huh",
      "rating": 5.0,
      "verified": true,
      "author": "Leanne",
      "helpful_votes": 5,
      "publication_date": 20181115
    },
    {
      "title": "So Far, So Good, Pretty Happy",
      "text": "Its been 2 weeks, so far, so good: Perfect size for us, great power, easy functions, reasonable noise during operation (wished it was quieter, but deleted the annoying beep), good looks, competitive price. Impressive packing (2-box packing) from Toshiba; I consider this as (possibly) actually prizing customer satisfaction (rare these days). Hope it lasts nearly as long as our previous Sharp (20 yrs!); recording their warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "HOWDY2+5",
      "helpful_votes": 6,
      "publication_date": 20181021
    },
    {
      "title": "Doesn't last long",
      "text": "Purchased in April of 2019. Within a couple months the interior light started to flicker, and after another couple of months stopped altogether. As of the last couple of months the microwave itself only works intermittently, but who knows when that will be. This is very unfortunate as this unit has some very desirable features, sharp appearance, and has adequate interior space for it's exterior size...but is just not worth it if it is unreliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Oliver",
      "helpful_votes": 3,
      "publication_date": 20200326
    },
    {
      "title": "Good microwave oven for the price",
      "text": "Found out that this oven has a feature called \"Time Cook.\" Most ovens I have used in the past let you enter the numbers in directly without needing to push an extra button. But on this one, you have to push the Time Cook button first. The turn table makes a small noise as it turns. Hope this is OK and not a flaw.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Wastier",
      "helpful_votes": 5,
      "publication_date": 20181001
    },
    {
      "title": "Over heated and shut down on safety first use",
      "text": "I bought this microwave because it had excellent reviews. So when I received the first one and it over heated and shut down on safety I just assumed it was a fluke. The second one arrived, I unpacked it, repacked the first one in it's box etc... I plugged the second one in and it did the same exact thing as the first. It was louder than I would have expected and within two minutes I could smell a hot electrical smell, it ran the four minutes I set it to, the bell rung and boom, lights out. I guess I'm buying from my local box store... James",
      "rating": 1.0,
      "verified": true,
      "author": "J. Duffy",
      "helpful_votes": 4,
      "publication_date": 20190906
    },
    {
      "title": "Don't waste your money!",
      "text": "I ordered this microwave because it would fit the small space in my kitchen and because the beeping sound could be turned off. I thought Toshiba was a reliable brand. However, this microwave did not last three months. Tonight while popping corn, it sparked and flamed. Unfortunately, it is past the returnable date so my money was wasted. I will never buy another Toshiba product. Very disappointing. (I would rate it no stars, but that isn't an option.)",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 7,
      "publication_date": 20190216
    },
    {
      "title": "disappointed.",
      "text": "The LED light is flashing when the machine is in use after my family's light use of two months (less than 20 minutes per day). Another shortcoming is the heating power. A bowl of frozen fruit (brussel srpout, kale, green bean, corn) weights about 400 grams. Covered with a lid to improve the heating efficiency, it takes more than 7 minutes to reach the satisfaction point. My conclusion is that the overall performance is mediocre.",
      "rating": 1.0,
      "verified": true,
      "author": "L. YUAN",
      "helpful_votes": 8,
      "publication_date": 20181018
    },
    {
      "title": "Stop working less than 2 months",
      "text": "This is just awful we had it for less than two months and hardly used. It just blew a fuse stopped working. Smelled weird in the morning then we went to microwave and it turn off went black after 4 seconds. Repligged into different outlet did the same thing. Don’t want an electrical fire so won’t be trying again. The worst part is I can’t return (returns only for 30 days) I see why",
      "rating": 1.0,
      "verified": true,
      "author": "Richardsons",
      "helpful_votes": 7,
      "publication_date": 20181204
    },
    {
      "title": "Glass plate comes off track easily.",
      "text": "It's really worth moving up to a larger capacity larger power microwave. It's something you use hundreds of times a year. The round glass plate comes off the track unless you perfectly lower your cup or plate onto it. I have used dozens of different microwaves in my 37 years on this planet and never had one with such a flimsy, easily misaligned roller mechanism. I think this one will go to the thrift store",
      "rating": 2.0,
      "verified": true,
      "author": "genegenre",
      "helpful_votes": 14,
      "publication_date": 20180910
    },
    {
      "title": "Great for houses with sleeping babies or pets.",
      "text": "Nothing terribly fancy here--a working compact micro, but thank heavens for that mute function! I don't have to cover my ears or stop the machine with one second left to avoid obnoxious, piercing beeps.",
      "rating": 5.0,
      "verified": true,
      "author": "RobertaTop Contributor: Pets",
      "helpful_votes": 59,
      "publication_date": 20170820
    },
    {
      "title": "Cheap- Broke after little use",
      "text": "Microwave started sparking/light flickers when in use, and read other complaints with same issue with Toshiba Microwave. Amazon closed return window and it has a 1 year warranty. I used Amazon a lot and they should honor 1 year warranty return. Very disappointed in this Toshiba product and warranty. Should I stop ordering electronic products through Amazon if we have concerns like this. I expected better from Toshiba products ( computers, micro,tv) .",
      "rating": 1.0,
      "verified": true,
      "author": "Donald Elder",
      "helpful_votes": 4,
      "publication_date": 20200102
    },
    {
      "title": "Quit after six months",
      "text": "This is a cheaply made product, of course, didn't spent that much on it. But I did expect it to last, with very light residential use, at least through it \"one year warranty.\" It did not. That's my problem.. Just hope you don't make the same mistake. Now I have to go to work and find out how to get it fixed, is that shipping box somewhere that they recommend using? Ha . Buyer beware. Appreciate the chance to sound off.",
      "rating": 1.0,
      "verified": true,
      "author": "Stan R.",
      "helpful_votes": 2,
      "publication_date": 20200818
    },
    {
      "title": "Fits my needs!",
      "text": "I was trying so hard to hold out and NOt use a microwave - but I finally relented and decided on this one! It’s exactly what I needed for my small kitchen - the glass turn table is the size of a dinner plate and it will pop a bag of popcorn - done and done! This is no louder than any other microwave I’ve ever had/used! This gets the job done! I was pretty happy that it also has a kitchen timer - almost bought one!",
      "rating": 5.0,
      "verified": true,
      "author": "J.P.",
      "helpful_votes": 4,
      "publication_date": 20181028
    },
    {
      "title": "Didn't Last",
      "text": "I am knocking one star because the turn table seems to get knocked out of position extremely easy, other than that I have no complaints about this microwave at all. Looks good works great. EDIT: 11 months after purchase the lights started flashing and then stopped working all together. Seems to still warm food but Its taking longer then it originally did. Think its about shot already.",
      "rating": 1.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 4,
      "publication_date": 20190212
    },
    {
      "title": "Burned up after a few months",
      "text": "I really liked this microwave at first until it burned up after only a few months of light use.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise McBride",
      "helpful_votes": 11,
      "publication_date": 20180728
    },
    {
      "title": "Light flickers when door is open and when in operation",
      "text": "I've had this microwave for about 6 months, and as another reviewer has stated, the internal light now flickers at a constant rate when the door is open and when the door is closed while cooking food. Also, the turn table in which the food is placed does rotate smoothly but rather rotates in a jerky motion. Toshiba: these defects should have been caught in the quality assurance process.",
      "rating": 1.0,
      "verified": true,
      "author": "roycwhitt",
      "helpful_votes": 5,
      "publication_date": 20190611
    },
    {
      "title": "UNSAFE AT ANY SPEED",
      "text": "FLICKERING LIGHTS ALMOST FROM DAY ONE. THEN SHOOTING SPARKS. HOW DOES THIS PRODUCT MAKE IT TO MARKET. BUYER BEWARE. IT WILL BURN YOUR HOUSE DOWN.",
      "rating": 1.0,
      "verified": true,
      "author": "david k.",
      "helpful_votes": 7,
      "publication_date": 20190831
    },
    {
      "title": "Great microwave for a reasonable price!",
      "text": "I bought it a few months ago and it is still holding up well! I especially like the automatic 30 second turn on by pressing the start button. The design is nice. It's weight is normal for a microwave, maybe a little lighter than the older models. Noise is average for a microwave. Overall, i would recommend to anyone looking for a new microwave. It comes with a glass plate by the way. I hate it when my cup noodles spill on it. It's easy to wipe though.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben Torres",
      "helpful_votes": 4,
      "publication_date": 20181110
    },
    {
      "title": "Irritating",
      "text": "The glass turn dish is always falling off the tracks no matter how gentle you are. You have to fix it every time you use it. The glass just smashed because it got stuck to a soup bowl and dropped a whole 4 inches. GLASS EVERYWHERE. We’ve owned it for four months and the light when out a month ago. Food heats extremely unevenly. Not super easy to use control the settings. I could honestly pick on this microwave so much more but I’m not in the mood. I just don’t recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "Shana ",
      "helpful_votes": 5,
      "publication_date": 20190321
    },
    {
      "title": "Interior light flickering",
      "text": "The microwave is great but using is for a few months the interior light is flickering. Not sure if I can still use it. Can someone let me know if there's any way to replace the interior light?",
      "rating": 1.0,
      "verified": true,
      "author": "Wayne L.",
      "helpful_votes": 6,
      "publication_date": 20190905
    },
    {
      "title": "Horrible",
      "text": "We have not even had this unit a full year yet and it needs to be replaced. The bulb flickers when in use, makes you feel like you'll have a seizure if you look in that direction. Sometimes after 1 minute things are piping hot or stone cold. For the price i never would have thought it to be basically disposable. Super disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 4,
      "publication_date": 20191113
    },
    {
      "title": "Dangerous and Absolute Trash.",
      "text": "Bought it in July, and now it’s decided to start doing this ( watch video )with nothing inside it. Total garbage. Not to mention absolutely dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190125
    },
    {
      "title": "DO NOT BUY--POOR QUALITY",
      "text": "two months after purchase with one person using it, the layer that protect the buttons is tearing, making it hard to read the buttons, very poor quality. reached out to support but manufacturer never responded to Amazon support. Waste of money and time.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary K.",
      "helpful_votes": 5,
      "publication_date": 20190129
    },
    {
      "title": "Quiet, Effective, Affordable Microwave",
      "text": "Have had it for about a year without a single problem. It is effective and warms the food consistently and almost equally. It has a great option that by pressing 8 you can turn off beeping which is good at nights or early in the morning. It does not take much room but is big enough to serve a small family. A minor problem is that the glass plate sometimes comes out of its place and you need to readjust it. Overall, we are happy with this microwave.",
      "rating": 5.0,
      "verified": true,
      "author": "Mahdi",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Dead after 7 and months",
      "text": "Magnetron shooting flames inside after 7 months. Waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "R. Merwede",
      "helpful_votes": 7,
      "publication_date": 20191228
    },
    {
      "title": "Don't do it.",
      "text": "I purchased this microwave in August of 2018, its now May 2020 and the thing is basically useless. It took me 12 minutes to defrost some vegetables. It barely heats up. I thought the if I got a well known brand like Toshiba, I would get a long lasting product. I was wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Where I get my unrealistic expectations of men",
      "helpful_votes": 4,
      "publication_date": 20200514
    },
    {
      "title": "Perfect for counter",
      "text": "I love this little microwave. I wanted to change the look of a few things in my kitchen so I removed the really large microwave above my stove and switched it with a simple vent hood, so I purchased this small one for the counter. It looks great, works as well as (or maybe better) than the much larger one I had, and takes up a minimal amount of space. I would highly recommend it to anyone looking for a simple, smaller microwave.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Bacso",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "TOSHIBA  This has to be the best microwave for the money",
      "text": "I was on my 4th. month without a microwave oven. I set it up and heated a frozen dinner and never bothered setting the power level. I had a cold coffee in the refrigerator and after just 1 minute it was hot. The rated input power is 1350 watts and the output power is 900 watts. My old one was rated at 1,500 output and 1,000 input so there is very little difference in heating power. This is a keeper for good. Still trying to figure out who needs a $800.00 microwave when this GEM does most of what people cook in them. I love the darker color and display is easy to read. Also super easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "BOB LECH   AF2DX aka SKYLAB",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Works great!",
      "text": "We like this little microwave! It replaced a similarly small one that was manufactured by GE, if memory serves. Our noise-phobic dog appreciates that its alarm can be turned off. It's a little more spacious and substantially more powerful than our previous model, its carousel operates smoothly without clunking around, and it doesn't slide on the quartz countertop when opening and closing the door. Attention to anyone in the field of microwave design: you might make a million bucks if you route the wire out of the rear of the microwave in a vertical position, thus allowing it to be placed closer to a wall.",
      "rating": 5.0,
      "verified": true,
      "author": "fxvonthron",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Quit Working",
      "text": "I really liked this microwave oven a lot, but it has quit working other than on one minute or two minutes. The rest of the buttons stopped working. This is very disappointing, because my other microwave oven worked for 20 years! Now I have to buy another one, and hopefully the next one will last longer than a month.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 3,
      "publication_date": 20181230
    },
    {
      "title": "Pretty but Crappy!!!",
      "text": "Very pretty & however is does NOT heat up as quick as my previous microwave which was the same wattage!! It is also VERY noisy .....the turn table spins but makes so much noise. VERY disappointed!! And the return process is crazy as well. Ughhh!!",
      "rating": 1.0,
      "verified": true,
      "author": "Gayle",
      "helpful_votes": 4,
      "publication_date": 20181127
    },
    {
      "title": "Heats things.",
      "text": "It heats stuff up. Not designed to cook a full turkey. Things get hot and done pretty quickly on time with typical frozen food times given on boxes or whatever, was surprised, thought it would take longer, it doesn't. Which is good. Slightly louder than my last one, but got use to it pretty quick. Its not annoying. Buttons work good. It will begin cooking soon as you hit any of the 0-9 buttons. You can add 30 seconds to the timer by hitting the Start button, which is useful as I'm lazy. Can hit start multiple times to add 30 seconds on timer every press, also good. Works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Genuvien",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Don’t waste your money",
      "text": "This microwave (to put it simply) just sucks. It wasn’t super expensive, but it also wasn’t cheap, and the heating just sucks. It heats very unevenly. Made tostadas and the cheese was perfectly melted on the outsides and cold on the inside. I’ve tried moving them around for a more even melt, but I that didn’t help much. Seriously, go with your next choice, this microwave sucks.",
      "rating": 1.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Microwave surprise",
      "text": "I purchased this item December 2018 and September of 2019 (yes less than a year.) and I am having problems with this item. The light flickers and then turns off while in use. The flickering is like having a strobe light inside of your microwave. One month later (October 2019) and the light no longer comes on. to say this is extremely annoying is an understatement.",
      "rating": 2.0,
      "verified": true,
      "author": "By His Mercy",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "You Should Know....",
      "text": "First of all, the first one I ordered arrived DOA - no lights, no beeps, no power. Fine, Amazon will replace it of course. A hassle but not a huge deal. More importantly, a serious QoL issue that had I known wasn't featured, I certainly wouldn't have ordered it: you can't run the kitchen timer and cook something simultaneously. I know, it's either important to you or not. It's important to me. The manual even states that you cannot use the cook function while using the timer function. Apparently that level of technology hasn't been achieved over at Toshiba. Thankfully my Walmart no-frills microwave is capable. Otherwise, yep...it's a 900w microwave.",
      "rating": 3.0,
      "verified": true,
      "author": "mack1905",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Dangerous fire hazard",
      "text": "Internal light started flickering a few months or so after purchased. Recently (just over a year after purchasing), microwave seemed to be unusually hot inside after cooking something like a bag of popcorn. Noticed what looked like a burn mark on silver plate on inside wall. Then, when heating something for 30 seconds, the microwave caught fire! Looks like common problems. Never buying Toshiba microwave again.",
      "rating": 1.0,
      "verified": true,
      "author": "Misha",
      "helpful_votes": 2,
      "publication_date": 20200709
    },
    {
      "title": "Hard to believe it's 900 watts",
      "text": "This is a nice looking,easy to keep clean microwave,but I really doubt the 900 watt rating,oven heats more like something with about 600 watts.Oven heats very slowly and if I had it to do over again I would not have purchased it.The rollers under the rotating plate are also very noisy,something the manufacturer should have upgraded.",
      "rating": 3.0,
      "verified": true,
      "author": "GRUMPY JIM",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Great Mucrowave",
      "text": "Delivered today and unpacked & looks great. One of the better looking microwaves. Like that it has a handle on the door, my other one did not.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Edwards",
      "helpful_votes": 22,
      "publication_date": 20180524
    },
    {
      "title": "Not Sure If It Was Worth It",
      "text": "Bought this in September 2019.. the time cook and power level button no longer works, so we are left to use the 1-6 min fast buttons then pressing the \"add 30 secs\" button to go any higher. It also seems now that the power level is not as high and food is taking longer to heat up than it was before, but since the power level button doesn't work, we have to deal with it. Not too happy about that, but we will still use it so the job is still being done lol",
      "rating": 3.0,
      "verified": true,
      "author": "arianne",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Fine for my purposes",
      "text": "All electronics have a lot of negative reviews because electronics have become throw-away items. Use them for a couple of years, then pitch 'em. Rather than waiting two years to write a review, I waited three months. This Toshiba works perfectly for me. It's easy to use, it has a good light inside while it's running, and it seems to heat evenly. Please note that I don't actually cook; I heat frozen dinners and occasionally reheat leftovers. One last thing: It looks GREAT.",
      "rating": 5.0,
      "verified": true,
      "author": "PaintmanjanTop Contributor: Jigsaw Puzzles",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Could have been slightly cheaper",
      "text": "It’s smaller than anticipated. It would be very compact for a smaller space kitchen. The power is not that great. I would still expect it to heat things up quick. It has modes that are handy for heating beverages and defrosting. However, I still feel this is slightly overpriced. Could have been little cheaper",
      "rating": 4.0,
      "verified": true,
      "author": "Ashwin Kumar Nagarajan",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Do not last long..only 60 days",
      "text": "I have used this for 2 months and it started making a loud noise...it gets louder and louder so i cant use it anymore. I afraid its gonna blow. I tried to return it to amazon but was told my return date had past.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200309
    },
    {
      "title": "Electrical component going out according to the internet :(",
      "text": "It only lasted 18 months. The light went out the other day, and this morning it was giving off a burnt plastic odor while heating up some milk in a cup. At first I thought it was the stove, but nope, it was coming from the microwave. Very disapointing.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Lagerstedt",
      "helpful_votes": 2,
      "publication_date": 20200323
    },
    {
      "title": "Disappointed",
      "text": "Owned less than one year, light burned out. Using less than 7 times a week. Smaller in side than previous microwave, had ordered by its dimensions. Nothing larger than a dinnerplate will fit inside. Presets cook too hot. Replacing soon.",
      "rating": 1.0,
      "verified": true,
      "author": "Mysteryfied",
      "helpful_votes": 2,
      "publication_date": 20191217
    },
    {
      "title": "Really, really good",
      "text": "I am thoroughly pleased with the microwave. It's smaller than the one it replaced, but the smaller size isn't an issue at all. A microwave's noise or lack thereof isn't a big selling point, but it was noticeable quieter than any other that I've ever used. The color is a win as well. It seems to cook things evenly; no popcorn disasters yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Stéphanos",
      "helpful_votes": 2,
      "publication_date": 20200519
    },
    {
      "title": "Is small but works like a large one",
      "text": "With this microwave oven it is compact but it cooks like a large one. Many microwave tasks are accomplished in record time. Meals come out as well as those cooked in a large one but with an emphasis on size conservation. Your need only a little room to place this appliance but with the cooking time of a large appliance. This is really a smart buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "El Garbage",
      "text": "Showed up with a broken plastic piece rattling around inside. It caused the panel on the right side with all the buttons to be loose on the bottom half. This made it harder to open and close the door. Not wanting to send it back and be without a microwave for longer, I glued it back together. It's a 900 watt micro so you have to cook longer if you're used to having a 1000 or 1100 watt version. It's noisy when it first starts up but then quiets down a bit. Just typical cheap throw away crap of today.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris Taylor",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Efficient and Quiet",
      "text": "Both my husband and I love this microwave. I was concerned about a lot of the negative reviews, but, there were negatives for each oven I researched. I finally decided to give Toshiba a try, and, I am happy I made the purchase. The microwave heats quickly, it is quiet, and, I am thrilled.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Kinner",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Unattractive but works great!",
      "text": "This is a great microwave. You can shut off the annoying beep easily and it will stay off after that. The thing is not quiet when it hums but the fan is super quiet. Unless you set a time the start button will give you 30 seconds per push. Very convenient. I'm giving it 4 stars because it is so boring to look at. Black case and grey frame door. I wish they would team up with Pioneer Woman brand and make some attractive microwaves like they do crock pots.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Sleek in black! I LOVE this microwave oven!",
      "text": "The Toshiba EM925A5A-BS Microwave Oven is everything I had hoped for. Other reviews complain of it being noisy and producing loud beeps at the end of a cooking cycle. No, no! This is by far the quietest microwave oven I have every had. It's the perfect size for 1-2 people. It cooks evenly at 900 watts, and the turntable works well. The manual is easy to follow, and the pre-set memory buttons are most welcomed by these ol' fingers. Three personalized memory functions can be set and/or changed with ease. Since I do not find the beeps loud or distracting, I can only assume that disabling them will work....everything else certainly does. Over all, I am one happy camper!",
      "rating": 5.0,
      "verified": true,
      "author": "L. J.",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Very Disapointed in this Microwave",
      "text": "We've had this Microwave for 1 1/2 years and from day one, one of the button didn't work but it wasn't worth returning at that point. Yesterday it started flashing and finally stopped working. Very poor quality Microwave and will not buy from Toshiba again.",
      "rating": 2.0,
      "verified": true,
      "author": "Notsofast",
      "helpful_votes": 2,
      "publication_date": 20200126
    },
    {
      "title": "OK microwave",
      "text": "I did a lot of research before getting this microwave and I find it OK but in some aspects disappointing. It fits in a small space, is quiet and, best of all, you can turn off the beeps. Why does anyone need five (5) beeps every time it is finished cooking? I have low vision and my biggest disappointment is how hard this machine is to set up and use. If the deadline to return had not passed (I am deeply frustrated about this) I would return it in a heartbeat and get another make and model. Otherwise, I am sure this would work well for most people.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Robitscher",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Quiet and even heating",
      "text": "I bought this product because of its lower cost compared to other microwaves and its reputation for even heating. So far I have tried heating frozen bread, cold pizza, frozen pasta, frozen vegetables, and cold soup. All of these were heated evenly after manually entering the time and power level. The microwave is also very quiet compared to older models. For easier comparison, this microwave is less noisy than the range hood fan and AC fan, and louder than a refrigerator fan. Interior is easy to clean and glass plate rotates smoothly.",
      "rating": 4.0,
      "verified": true,
      "author": "KV",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Powerful little Microwave",
      "text": "Have had this little microwave for about a month now and it has been working well. It's more powerful than my older built-in microwave. I bought it while remodeling the kitchen to get us through the next several months while out of the kitchen. I'm very impressed with this model and may keep it longer than I intended to. It's smaller footprint is perfect for the smaller kitchen or apartment living.",
      "rating": 5.0,
      "verified": true,
      "author": "J. O. Pierce",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Great little microwave!",
      "text": "I purchased this microwave when I downsized into a much smaller place. The size was perfect, takes up much less counter space, and it works great. My boyfriend liked it so much that I ended up ordering another one for him to have at his own place.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki L",
      "helpful_votes": 4,
      "publication_date": 20190808
    },
    {
      "title": "Short Life Consider Lack of Durability",
      "text": "I bought this August of 2018 and it is already broken. Very disappointed to get only a little over a year.",
      "rating": 1.0,
      "verified": true,
      "author": "AO",
      "helpful_votes": 4,
      "publication_date": 20191016
    },
    {
      "title": "A MIRACLE OF SCIENCE!",
      "text": "Imagine a world where your microwave doesn't get mildewy and gross-smelling if you look at it the wrong way. If you buy this microwave (and take, like, basic care of it), you could be living in that world. Other perks: cooks things, looks pretty (for a microwave), is neither tiny nor enormous, pretty quiet while running.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 3,
      "publication_date": 20181004
    },
    {
      "title": "Absolute Piece of Trash",
      "text": "Bought it six months ago, now there is a massive hole inside the side panel inside the microwave. No chance to get a refund, piece of garbage",
      "rating": 1.0,
      "verified": true,
      "author": "M. Perry",
      "helpful_votes": 3,
      "publication_date": 20190627
    },
    {
      "title": "Great little microwave",
      "text": "We have a small space built in our kitchen for a microwave that will only take certain sizes. Most of the ones that small are plastic, geared more toward a college dorm. Fortunately we found this one that looks adult, is quality and works great. It is also enough wattage (unlike the small plastic ones) to heat/reheat very well. Happy with this purchase. Hoping they make this model for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader24",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Looks good and functions thus far.",
      "text": "Microwave looks good seems to be working fine but if it suddenly starts acting up I'll know why. The package was so trashed it was clearly tossed around in shipping so thanks for that UPS.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew&CheyenneMostlyCheyenne",
      "helpful_votes": 5,
      "publication_date": 20180723
    },
    {
      "title": "Unforgiving customer warranty service.",
      "text": "I really like this microwave, except for one thing. After about three weeks a chip appeared on the glass door under the handle. Photos included. I contacted Toshiba with the photographs and a description of what happened, telling them that this problem happened on its own; it was not caused by me hitting the door with an object. I was hoping they could just put a new door on it. They denied my warranty claim, which I feel was pretty unjust. It's still a great microwave, I just didn't like the way I was treated by Toshiba customer service, that's why I gave the one-star review.",
      "rating": 1.0,
      "verified": true,
      "author": "jon robbin",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Product arrive damaged",
      "text": "The microwave arrived on time but damaged. The glass portion in front door shattered in pieces and I almost cut my finger when I was opening the box. Immediately returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 4,
      "publication_date": 20190412
    },
    {
      "title": "Broken after 17 months",
      "text": "The microwave worked fine for about 17 months. Last night the light started flickering. Today I turned it on for about 5 seconds, then I heard a sizzling noise, followed by a pop, and then I saw a cloud of smoke come out of the side. Its garbage now and the 1 year warranty is up. Toshiba must have made a big profit on this microwave because the electrical components are cheap. I’m very dissapointed in this appliance. It was a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Marc K Robins",
      "helpful_votes": 3,
      "publication_date": 20200515
    },
    {
      "title": "Doesn’t seem to hold up over time",
      "text": "After using this microwave for a little over a year the light began to fail. It also seems weaker than it should be. I’m not sure how long it’s going to last but I bet I’ll be cashing in my 4 year warranty on this one. Also on a side note the rolling wheels fit funny under the glass tray. Nothing too bad; I’ve seen more frustrating microwaves but I’ve also seen less frustrating units as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Impressed with this microwave",
      "text": "So quiet! Great for a small space but still holds a large dinner plate no problem. I love the beepless function! Cooks food evenly whether at full power or reduced. I don't use the pre-set functions so I don't know how well they work but I am impressed with it's overall power and consistency otherwise. Wipes clean easily and doesn't leave fingerprints on the digital pad. I'll be buying another for my studio.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Love having the option to mute the beep sounds!",
      "text": "I love my new microwave! It was Amazon's choice and it is a beauty. The key feature that sealed the deal was the optional mute button. What a joy to never hear a beep. My last microwave would beep every few minutes until you removed your food. It drove me nuts. I could not be any happier with this microwave.",
      "rating": 5.0,
      "verified": true,
      "author": "susan claire",
      "helpful_votes": 2,
      "publication_date": 20180617
    },
    {
      "title": "Not so robust",
      "text": "Crapped out 1 week after warranty expired. Don’t know how they manage that. I am use to getting 5 years or more with a microwave. Surprised me. Manufacturer sorry they couldn’t give me a refund. Ha ha.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20191219
    },
    {
      "title": "Small footprint but roomy interior and easy to use.",
      "text": "I love this little microwave oven. It fits where my old did but has a larger interior and is higher wattage. It was easy to learn how to use and even though the sides are black it still looks good with my other stainless appliances. I wish the interior light stayed on when cooking and I’m concerned the turntable ring is not going to hold up because it sometimes makes a dragging noise if I cook in a heavy casserole dish. I did purchase the warranty pkg just in case",
      "rating": 4.0,
      "verified": true,
      "author": "PZ",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Not impressed",
      "text": "Was very disappointed with this microwave. Had it a little over a year and it started making a terrible noise while cooking (like there was a metal item in it) and emitted a terrible smell. Finally was done with it. Before that, the light would go off for days and it was sounding bad. Timer is terrible - you can’t cook while it is on and it only makes a noise once, (not continuous until you shut it off). Also, and this might be my bad, I had to cook everything twice as long. All around just wasn’t happy with it. Got a new one today - not Toshiba though.",
      "rating": 2.0,
      "verified": true,
      "author": "Amber T. McGinnis",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Works Perfect",
      "text": "Detracted 1 star from ease of use because the minute you press a number it instantly takes 2 as 2:00 and starts running for 2minutes when you wanted say 20 seconds. So if you want 2:30 you have to press 2 and then the 30 second button to add 30 seconds more to 2 minutes. And if you want just 20 seconds you need to man the microwave to open the door and stop it after 20 seconds. Cooks Food though with no problems and easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Microwave sparked and died after only a year",
      "text": "Had this for one year and a week and the inside plate blew out causing sparks. Outside warranty window by a week. Should not have happened for a microwave of this price and advertised quality",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Sullivan",
      "helpful_votes": 3,
      "publication_date": 20191107
    },
    {
      "title": "Finally -  a Mutable Microwave",
      "text": "I ordered this microwave based on the reviews and the fact that there is an official mute button front and center on the control panel. The description showed a photo of family members sleeping while someone was microwaving. This should not be a novel concept. Why would anyone want a buzzing, beeping monster in their kitchen? We can now microwave peacefully. Ah, that's better.",
      "rating": 5.0,
      "verified": true,
      "author": "Kamalani Lee",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "So far so good",
      "text": "It works fine. Since it is a 700 W microwave, it is not very powerful but that depends on everyone's needs, just think carefully about it. My only complaint is that the plastic film of the buttons worn out quickly although it doesn't affect the functionality. Overall, I'm satisfied with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Camilo Gomez",
      "helpful_votes": 0,
      "publication_date": 20190324
    }
  ],
  "product_meta": {
    "title": "Toshiba EM925A5A-BS Microwave Oven with Sound On/Off ECO Mode and LED Lighting, 0.9 Cu. ft/900W, Black Stainless Steel",
    "description": "Color:Black Stainless SteelThis Toshiba 0. 9 cu. ft. 900 watts microwave oven with its Black Stainless Steel finish and timeless look can match different kitchen styles. It features easy defrosting by weight/time, 6 auto menus, microwave cooking with 10 power levels, express cook buttons for 1-6 mines and memory function. It is equipped with bright A LED cavity light, a glass turntable, energy saving ECO mode, mute button, clock and kitchen timer. The bright LED digital display, easy-to-read control panel and easy-to grip door handle further improve the user experience. The compact size is ideal for apartment kitchens, vacation homes, offices and dorms. For further information please kindly refer to the user manual provided as a PDF document below the product description section.",
    "rating": 4.4,
    "feature_bullets": [
      "Stylish black stainless steel with timeless design; Rated Voltage: 120V~ 60Hz; Rated Input Power (Microwave): 1350W; Rated Output Power (Microwave): 900W",
      "Pre-programmed menu for 6 popular foods like popcorn, pizza, potato and more",
      "One touch start - quick access to start the microwave from 1 to 6 minutes cooking at full power",
      "Equipped with power-saving eco mode, sound on/off option and child safety lock",
      "900 watts with 10 power settings, clock, and kitchen timer",
      "Bright digital display, easy-to-read control panel, LED cavity light and 10. 6 inches glass turntable",
      "If you wish to mute the buzzer of the microwave, please long press on the button \"8\" for 3-5 seconds. The buzzer is automatically switched off after a long beep.",
      "The keypad was covered by a protection film during the shipment. Please peel it off before your first use.",
      "1 year, please keep the packaging for contacting Toshiba after sales service and product returns."
    ],
    "specifications": {
      "Product Dimensions": "19.2 x 16.1 x 11.5 inches",
      "Item Weight": "27.3 pounds",
      "Manufacturer": "Toshiba",
      "ASIN": "B072JML2GZ",
      "Item model number": "EM925A5A-BS",
      "Customer Reviews": "4.4 out of 5 stars3,110 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#161 in Kitchen & Dining",
      "Date First Available": "September 2, 2017"
    },
    "categories": [
      "Microwave Ovens",
      "Small Appliances",
      "Home & Kitchen",
      "Countertop Microwave Ovens",
      "Kitchen & Dining"
    ],
    "price": 89.99
  }
}