{
  "website_summaries": [
    {
      "verdict": "A uniquely shaped blind spot mirror designed for rectangular side mirrors.",
      "pros": [
        "Comes with a mix of curved, elongated corners to squeeze into rectangular side mirrors for a better fit",
        "Uses a strong adhesive that can withstand highway travel"
      ],
      "cons": [
        "Rectangular shape does not fit well in circular or small side mirrors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pros and Cons",
      "text": "Pros: - Very high quality, glass, durable plastic, etc - Nice design - Excellent adhesive Cons: - Not very functional or useful compared to circular versions - Tested site, some paid fake reviews on here (fakespot website used to test) - Impossible to remove without damaging mirror or using a strong solvent (also can be seen as a pro of these) - Are specifically for improving your horizontal viewing, these do not improve your vertical view that well like a circular-type would (I like the circular functionality to see parking lines or curbs, these are unable to do that) - Expensive (these should be around $3, as they are in auto part stores)",
      "rating": 3.0,
      "verified": true,
      "author": "Grey S",
      "helpful_votes": 4,
      "publication_date": 20170819
    },
    {
      "title": "I recommend it for any defensive driver",
      "text": "I am always very careful when driving, and I will turn my head to look at the blind spots whenever I need to change lane. This mirrors help me keep an eye on the blind spots anytime. You peel off the back of the mirror like a sticker and stick it on the bottom part of your rear view mirror, after cleaning. Wait for 24 hours and then turn the angle to adjust the blind spot mirror so You can see the blind spot. Very important to have for defensive driving.",
      "rating": 5.0,
      "verified": true,
      "author": "Reikailu feng",
      "helpful_votes": 8,
      "publication_date": 20170603
    },
    {
      "title": "Great mirrors.",
      "text": "These are very well made glass mirrors, they use 3M \"emblem tape\" to stick them on with, hold they're adjustment and give an very wide range rear view. No more of those little round mirrors for me. I have these mounted horizontally on my Jeep wrangler and am very pleased with the result.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Btica",
      "helpful_votes": 6,
      "publication_date": 20170629
    },
    {
      "title": "Perfect for eliminating blind spots",
      "text": "Both our cars have blind spot indicators/warnings, but that's not a complete solution. Nothing beats being able to see the object in the blind spot, not just sense it. These mirrors are perfect: they fit well into the side view mirrors, blend into the design, and cover that all-important rear corner outwards view that is impossible to see unless you angle the mirrors a certain way, which while it works, also limits the field you can cover with the side view mirrors. These beauties overcome that at a very attractive price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Art of Books",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Lasted 2 years!",
      "text": "I bought these 2 years ago and today I noticed one of them fell off. I’m not sure how or when. That said, I get my car washed regularly and live in Southern California where it’s blazing hot a lot. They still lasted 2 years, which is really great for the price point. I realized once the one fell off how much I’ve grown to rely on these and how much easier it is to do things like change lanes on the freeway. I’m buying another pack to replace the one that fell off because I know they’ll last at least 2 more years.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "They are amazing! About 2 inches long",
      "text": "They are amazing! About 2 inches long, and warped so you get a bit of wrap around. Perfect for the blind spots on my 2015 Murano. If you want to make sure you can see the sides and see backing up by your side view mirrors this really helps. Easy to put on, it comes as 2 pieces that snap together (mirror and base) and a sticky pad.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Kwong",
      "helpful_votes": 2,
      "publication_date": 20171022
    },
    {
      "title": "Highly Recommend",
      "text": "OK I drive a Honda Odyssey and as you know there is a nasty blind spot right where you don't want it. I mean where do you want a blind spot right? I picked these from reading other reviews and some personal knowledge of what I think would work. Once these came in I experimented with many different placements. I ended up putting them horizontally on the bottom outside edge. They work great! On my last trip from Albany to Manhattan I felt like I had an extra level of sensory information allowing me to make more confident lane changes etc. Highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant Falk",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Barely A Difference For My Car",
      "text": "I have a Nissan Murano so the blindspots on my car are pretty bad. I bought these hoping it would help and reduce the probability of an accident. It seemed to work for a while, but I found myself adjusting them constantly as I felt it wasn't quite reaching the blindspot areas. I could have been overthinking it, but eventually, I decided to remove them. Had them on for 6 months and they were still in great condition, easy application and removal.",
      "rating": 3.0,
      "verified": true,
      "author": "Mika Moore",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Work Great!",
      "text": "These work really well. I had a friend help me trial position them on a 2002 Ford E-350. Decided they would be best mounted horizontally in the lower, outside corner of my existing mirrors. Once installed, they have plenty of adjustment range. Now, the blind-spot areas to the side and rear quarter-panel of my van, are clearly visible. My only suggestion to the manufacturer would be to offer a second option in a larger size. Lastly, I would be leery of mounting them vertically - when I did the trial positioning - they did not cover enough side-ways range for my liking. However, your vehicle may be different.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnWDobie",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Easy to install",
      "text": "I used to have the circular blind spot mirror before a bought a new car. My new car's side view mirror wasn't large enough to fit the circular one so I bought this. It's okay. Easy to install, doesn't fall off and you can adjust it after you've applied it onto your mirror. The thing I wish it could do is show the lines of parking spaces because I am the 2nd worst person in the world for parking. Being able to see the parking lines was a game changer that I wish were able to do on these mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuong Ly",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "I put them on my Subaru and they are without a doubt the best mirrors to date",
      "text": "I have tried so many mirrors and trashed so many mirrors. They either didn't work or they were made of plastic. The view was distorted or you couldn't tell what was in the mirror next to you. I read the reviews on this set of two mirrors and it looked favorable. I put them on my Subaru and they are without a doubt the best mirrors to date. They work perfectly in every way. My son drove my car and said hey where can I get a pair of these. You won't be sorry if you buy these little life savers. Great job. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "david cook jr",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "Why dont all card have these now?",
      "text": "I know cars have all sorts of sensors on them now but these increase your vision around your car so much I dont know why convex mirrors aren't on all new cars. I chose these because they fit more seamlessly into the shape of my sideviews and i feel the round versions look dorky. These stick very well hand have held position for a year and counting.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Not good for smaller cars",
      "text": "Sorry I didnt really like these at all. These would work on a bigger car, like a 4x4 truck sized mirror. Not on my mid-size Tesla Model 3. Thankfully the guys who detailed my car got them removed for me. Waste of money. Better off getting the round ones for a smaller car. These took up half my mirror and actually lost view instead of improving. The tilt feature is actually worthless because it moves around, and hard to see.",
      "rating": 1.0,
      "verified": true,
      "author": "Luana’s Happy Home",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Better than the Round Ones",
      "text": "I like these better than the round ones. I only use this on the passenger's side window for a blind sport. Position on vehicle's mirror: Lower left hand corner. Angle of this product: I can see the blind spot when I angle it slightly down and push it all the way towards the right. Personally, I don't use this on the driver's side because I found it too distracting.",
      "rating": 5.0,
      "verified": true,
      "author": "BAE",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Works really well.",
      "text": "Take a bit of practice to get used to, but it definitely expands your FOV. I recommend placing it somewhere on the mirror that works dependently on the original mirrors position. What I mean is that if you dedicate it to one particular spot you may get a headache having to manually adjust it every time you adjust the original mirror.",
      "rating": 4.0,
      "verified": true,
      "author": "TenTigers",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Great blind spot mirror!",
      "text": "These blind spot mirrors worked much better than I'd expected. On the driver's side, the mirror provides a great view of all traffic lanes as well as showing what's in the blind spot. I used this mirror to replace a circular blind spot mirror and I'm vey happy with making the switch. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Rickster",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Wide angle view works as advertised",
      "text": "The product works as advertised. The wide angle convex mirror does help detect vehicles in blind spots. I found sticking the mirror in the lower left corner of the driver side mirror and the lower right corner of the passenger side mirror helps. In these positions, all one has to do is to tilt the mirrors up a little. The three degrees of freedom for the mirrors movement also helps quite a bit. The glue seems to be quite strong and so one must be careful of the placement location. I don't know how hard it will be to remove it once it is stuck to a side mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "Pradipto Das",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "So close yet so far away...",
      "text": "Well the package arrived and one mirror that was placed on the passenger side is clear and works great. The other mirror placed on the drivers side looks blurry and like a fun house mirror! Not sure what the deal is so this is 50% good and 50% junk. Trying to get a non-defective replacement, if not than I guess a refund and back to the tried and true circular blind spot mirrors.",
      "rating": 3.0,
      "verified": true,
      "author": "RLo",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Fantastic mirror",
      "text": "Great mirror! I only used one on the driver's side mirror and positioned it exactly as pictured and it works great. Very clear and definitely improves vision in the blind spot. Very helpful, especially when changing lanes or merging onto the highway. I wasn't sure if I'd like the adjustable feature but it's great for positioning once it's attached.",
      "rating": 5.0,
      "verified": true,
      "author": "Spiritual Explorer",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "The idea is good and the mirror itself is excellent",
      "text": "The idea is good and the mirror itself is excellent, but the mounting is horrendous. These would be the perfect blind spot mirrors (wide viewing spread and easy-to-view surface area) except that the mounting leg is way too short to allow much adjustability. The mirror is so wide and the leg is so short that there's only a few degrees of movement when positioning the mirror and you won't get much better range than the normal mirror anyways.",
      "rating": 2.0,
      "verified": true,
      "author": "Jared Takasaki",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "A great choice",
      "text": "After trying 2 other \"stick on\" wide angle mirrors and removing them because they were nearly useless, I mounted this pair of wide angle mirrors. Unlike the others which were more round, these are narrower and don't display too much unnecessary sky views while covering a portion of the car's regular mirror. Best feature is that these mirrors are adjustable after mounting so the images can be fine tuned to fit each driver's need.",
      "rating": 5.0,
      "verified": true,
      "author": "Darwin",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "These are the BEST mini mirrors on Amazon!",
      "text": "These are an AWESOME add to my Dodge Challenger!! High quality mirrors that I recommend to anyone with a sports sedan. They add about 10 feet of extra viewing area, in a very minimal size. The convex angle is perfect and the ability to adjust angle for other drivers is priceless.",
      "rating": 5.0,
      "verified": true,
      "author": "TA",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Eliminate blind spots and make driving safer",
      "text": "I really appreciate having a wider view and feel safer now that I no longer have blind spots. I may buy more as gifts or stocking stuffers. Why not share something so simple that can possibly prevent your loved ones from accidents.",
      "rating": 5.0,
      "verified": true,
      "author": "B Hall",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "they work fine. I am use to them & know exactly ...",
      "text": "This is my second set for car & truck. For me, they work fine. I am use to them & know exactly where to look when I am needing to differentiate the car mirror from the blind spot mirror. Was very satisfied w/ the packaging & especially the delivery time.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard/TX",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Do not stay in place !",
      "text": "Took up more then half of my mirror and the swivel was very poor quality. Whenever I would drive on the highway they’d move all over the place and would become useless to view blind spots.",
      "rating": 1.0,
      "verified": true,
      "author": "Lesley Castineiras",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Up to my expectations!",
      "text": "These come in matching pairs. You have one chance to get it right. I cleaned the truck mirror with lacquer thinner for extra adhesion. They seem to do a great job and have held their positions well so far. The material is glass, not plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty S.",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Meh!",
      "text": "Meh! It does work, but I wish there was juuuuust a tiny bit more adjustment, or that the curve would have been just a little bit more pronounced. I strongly miss my old ones, the curve was giving you a better view of blind spots.",
      "rating": 3.0,
      "verified": true,
      "author": "InTartifletteWeTrust",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "good miror easy to install and stick well but there ...",
      "text": "good miror easy to install and stick well but there no indication to say if left or right side is better I use it for my toyota sienna for help the dead spot but not sure if it work corretly.",
      "rating": 4.0,
      "verified": true,
      "author": "philippe vu",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Not bad at all",
      "text": "I have had a couple of days of use with these mirrors. I put them in the bottom inner corners of my side mirrors. They work well, and with the tilting option, you can aim them where you want. Waiting to see how they hold up in winter. Item arrived as described and on time.",
      "rating": 5.0,
      "verified": true,
      "author": "smerr59",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Do what they're supposed to.",
      "text": "These are quite good for wide angle view, and have saved me from merging into other motorists. Con: If the angle is thrown off, it's pretty tedious to re-adjust perfectly. So basically after every car wash you need to spend a good 5-10 minutes adjusting. It's also difficult to clean behind the mirror. Nonetheless, good mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "David Rassikhin",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "I would still recommend a circular mirror",
      "text": "The quality is top notch. however, I would still recommend a circular mirror. With the circular, I can see the tyres, curb and my blindspot in one angle. But with this one, it’s hard to adjust to see everything all at once. You have to choose which one is important. Blindspot or curb. I’m going back to the circular ones.",
      "rating": 2.0,
      "verified": true,
      "author": "intrimitido",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Can save you from accidents",
      "text": "I went from a small SUV to a large one (Chrysler Pacifica) and I was crossing into lanes too close to cars even though I always looked. I put these on and I haven't had a problem again or another driver blowing his horn at me.",
      "rating": 5.0,
      "verified": true,
      "author": "WPFLreviewer",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Adjustable, easy to install and give a great view",
      "text": "I have blind spot warning but often can't see the vehicle (duh, it is \"blind spot\" right). These do a gr4eat job of providing the exact location of vehicles on either side of me. I'm buying another set for my Camry.",
      "rating": 5.0,
      "verified": true,
      "author": "MRD",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "I really enjoy it and the fact that they swivel",
      "text": "This is my second pair of blind spot mirrors that I bought. The first pair of put on my car this pair I'll be putting on my truck. I really enjoy it and the fact that they swivel, that's really a plus for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "they are good but they need to be able to be adjusted ...",
      "text": "used for a long time. they are good but they need to be able to be adjusted further (more degrees left and right). I can't fully see my blindspot in my van but it helps a ton. the mirror itself is good quality and price is great.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia L. Kaehler",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Love it.... Highly recommended 😀",
      "text": "Completely satisfied. Quick delivery. No problems with packaging & shipping. Great value. Good quality. Works as advertised. A must buy.",
      "rating": 5.0,
      "verified": true,
      "author": "j0e",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Cures blind spots.",
      "text": "Sticks well, adjusts, and give you clear sight of former blind spots.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Blind Spot Mirrors",
      "text": "Nice for the price. I had to place a drop of super glue to hold in place as the wind would bump them out of alignment.",
      "rating": 4.0,
      "verified": true,
      "author": "Monica D.",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great fish eye mirrors",
      "text": "Great fish eye mirrors, wide range of positions to get the perfect adjustment. I have been using them for over a month with no problems. My car mirrors are not very big so these do not take up much space leaving ample viewing room.",
      "rating": 5.0,
      "verified": true,
      "author": "Sasquatchbrb",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "nicely made but may take up a lot of mirror space depending on mirror size and shape",
      "text": "They're fine but largish if you have a small mirror which is my only reason for not liking them as they dont work for me. Likely great for larger mirrors though as the quality seemed fine",
      "rating": 3.0,
      "verified": true,
      "author": "Woody",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "These mini mirrors have to be the best that I have had",
      "text": "These mini mirrors have to be the best that I have had. A good wide view and easy to adjust. Recommend that you place them on the top of your mirror rather that the bottom, that way they do not obstruct your regular view.",
      "rating": 5.0,
      "verified": true,
      "author": "Reese Chapman",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Very easy to install and they work perfect",
      "text": "Very easy to install and they work perfect. While I was on the highway I tested them out. Waited till I couldn't see someone in my side mirror, then checked these and sure enough there they were, in my not so blind spot.",
      "rating": 5.0,
      "verified": true,
      "author": "logan wouters",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great Product.",
      "text": "The blind spot mirrors are wonderful as they cover a large wide space leaving no doubt for a vehicle hidden there. They also look beautiful. The rear view mirror is also great covering a large area around the back side and sides too. Thanks for making such a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Syed k Raziuddin",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "The best.",
      "text": "This is the best blind spot mirror I have ever had. not only does it give a good picture of the blind spot, it is adjustable to fit each drivers needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Tmike",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "but I like how I can see several lanes",
      "text": "It took me a few days to get used to these...but I like how I can see several lanes, not just the lane next to me. I also like the way these look on my car, as opposed to the round ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Pretty happy with these although I do wish they were ...",
      "text": "Pretty happy with these although I do wish they were SLIGHTLY further out from the base to allow for a bit more adjustment. Not enough to knock a star off, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Otherwise good.",
      "text": "I thought these would be cooler looking then the round ones. Adjustment is more critical, could be rounder. Otherwise good.",
      "rating": 3.0,
      "verified": true,
      "author": "Italian Mommy",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Work great, stay in place.",
      "text": "I love these things. They are adjustable and stay in place really good. I use them to see my back tires for when i am backing up.",
      "rating": 5.0,
      "verified": true,
      "author": "walter collins",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "The design is a joke. The shape of the ...",
      "text": "The design is a joke. The shape of the mirrors is poorly conceptualized--if there is any conceptualization to speak of--is more a distraction than anything else.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank Gao",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Very nice!",
      "text": "Covers a wider view than similar products, without taking up too much of the larger mirror surface.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Rhoades",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Easy to apply and gets the job done",
      "text": "Easy to apply and gets the job done. I feel safer driving in my car with these on the mirrors.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "great addition for safe driving",
      "text": "these work great, easy to install and adjust as needed for side viewing",
      "rating": 5.0,
      "verified": true,
      "author": "KDL",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Poor blind spot",
      "text": "Not enough concave in mirror to cover blind spot.... The swivel is useless...moved after every car wash",
      "rating": 1.0,
      "verified": true,
      "author": "linh tran",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Like the round ones better",
      "text": "The post is hard to get adjusted on the passenger side, and can loose adjustment",
      "rating": 3.0,
      "verified": true,
      "author": "Cubical Czar",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "These are the mirrors you want",
      "text": "Great product. Took away my blind spots once the mirrors were affixed. Easy to adjust after a car wash and I found only one of two had moved after having the vehicle washed. They present a very clear image. Recommend them highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Baron Perlman",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Great little mirrors to see with",
      "text": "I didn't like these at first, but it turns out it just took time to get used to them. They're more useful that the circles, and give you a wider field of vision. They just take some time to adjust to.",
      "rating": 5.0,
      "verified": true,
      "author": "JDM",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Sleek design and functional!",
      "text": "Mirror arrived fast and liked that it had 3M tape on the backing. Rating it 3 stars since one of the mirrors has a manufacturing defect where a corner of the black plastic piece is defective. (see picture) Not worth the hassle of returning it since the mirror itself is fine. Hopefully it doesnt cause any issues later. Just poor quality. Review Update 9/1/17 I was contacted by the seller to ensure I am 100% satisfied with their product. The seller knows how to take care of their customers and by how they handled this defect says a lot about them. Updated rating due to customer service and product satisfaction. Design is sleek and functional!",
      "rating": 5.0,
      "verified": true,
      "author": "Angelo F",
      "helpful_votes": 4,
      "publication_date": 20170831
    },
    {
      "title": "Five Stars",
      "text": "Wider length than what our Honda CRV side view mirror had, which is great",
      "rating": 5.0,
      "verified": true,
      "author": "rosmarc",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Perfect Blind Spot Mirror and Parking Aid",
      "text": "Perfect!!! Your able to adjust the angle as well which is another plus. If your trying to park close to a curb it helps your view as well.",
      "rating": 5.0,
      "verified": true,
      "author": "MJay0781",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Very aggressive tape, hopefully I can get it off ...",
      "text": "Very aggressive tape, hopefully I can get it off when needed. Hinge is very tight, I don't expect it to move after time. Horizontal orientation takes a bit to get use to visually, after a few days not a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "I like that I can fully adjust them",
      "text": "Just installed them yesterday and they work perfectly, I like that I can fully adjust them, even turn them 180 degrees so if you put one on upside down like I did you can totally fix it without trying to take one off. Fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan R. Bowman",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "I bought the car of my dreams and it had the worst blind spots",
      "text": "Wow what a help. I bought the car of my dreams and it had the worst blind spots. It took a little time to retrain my brain to focus on these tiny mirrors instead of the regular for Max helpfulness. Litterally a lifesaver.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan D. Walsh",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "great shape, pivots all directions",
      "text": "great shape, pivots all directions, strong adhesive. Would buy again if needed but had held up well during a tough winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren D.",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Good product.",
      "text": "It does the job, but it moves after a while. It is hard to adjust while driving.",
      "rating": 3.0,
      "verified": true,
      "author": "RIVER",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "It really does not provide that much more visibility. ...",
      "text": "It really does not provide that much more visibility. Material and quality wise it's ok. I just regret buying it.",
      "rating": 3.0,
      "verified": true,
      "author": "Prat",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Driving with confidence",
      "text": "Very clear and easy to clean, eliminate blind spot. Feels even more confident driving and probably use the mirrors 80 % instead of the regular side mirrors.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Went on easy and have stayed on through 1 car wash and ...",
      "text": "Went on easy and have stayed on through 1 car wash and lots of rainy days. Very pleased so far, and really helps me drive safer.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Zoomtown",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Three Stars",
      "text": "The little convex mirrors tend to move from road vibration and need readjusting from time-to-time.",
      "rating": 3.0,
      "verified": true,
      "author": "Millard",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "These are 10x better than the circular mirrors",
      "text": "These are 10x better than the circular mirrors. A must if you ask me, gives you real piece of mind on the road and great spatial awareness.",
      "rating": 5.0,
      "verified": true,
      "author": "penNameAlpha",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Great value!",
      "text": "Great mirrors, you can orientate them any way you like. Once you stick them, they are stuck!",
      "rating": 5.0,
      "verified": true,
      "author": "MPKramer",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "it works okay, sort of small, but sticks like crazy",
      "text": "meh...it works okay, kind of small, but man does it stick well..",
      "rating": 3.0,
      "verified": true,
      "author": "Dave B.",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "terrible field of vision",
      "text": "terrible field of vision, wish i would've have bought the round ones. Now i have to remove them which is another pain",
      "rating": 1.0,
      "verified": true,
      "author": "Ben B. Photography",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Horrible I can’t get it right for my new suv ...",
      "text": "Horrible I can’t get it right for my new suv I just bought! Will by the round ones! They are to narrow and create more of a blind spot!",
      "rating": 1.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Looks a lot better than having a round mirror.",
      "text": "Pretty good product. I wish it was a little more convex.",
      "rating": 5.0,
      "verified": true,
      "author": "Changry",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "making the unit useless.",
      "text": "Rain water sticks to the surface, making the unit useless.",
      "rating": 3.0,
      "verified": true,
      "author": "Awakened",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Really great",
      "text": "Nice mirror. Will pivot, so in my mind, much better than most",
      "rating": 5.0,
      "verified": true,
      "author": "CSE 13",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Perfect for what I was looking for!",
      "text": "Easy to install and gave me the view I needed to eliminate blinds spots in driving",
      "rating": 5.0,
      "verified": true,
      "author": "BAMARJH",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Different and Better",
      "text": "Different size and shape from my previous one. Like it better. Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "T.A. W.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Like these.",
      "text": "Works great. Adjustment helps to get the exact area of interest",
      "rating": 5.0,
      "verified": true,
      "author": "rc-",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "I had a set of these years ago and enjoyed the benefits of more visability",
      "text": "I had a set of these years ago and enjoyed the benefits of more visability... I'm glad I found them again.",
      "rating": 5.0,
      "verified": true,
      "author": "MBV31",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Four Stars",
      "text": "Only issue with these is when you go through the car wash, you have to readjust them.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Just not what i wanted...",
      "text": "I wanted something that flush mounted to the mirror and these do not.",
      "rating": 2.0,
      "verified": true,
      "author": "Ghost",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Just what I needed!",
      "text": "They were exactly as I hoped they would be \"PERFECT!!!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Andrews",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Three Stars",
      "text": "Double sided tape very weak. But mirrors work as intended.",
      "rating": 3.0,
      "verified": true,
      "author": "pro",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "I think I can see better in the round mirrors",
      "text": "Work well, maybe a tad narrow, I think I can see better in the round mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "Linlea",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Fast shipping. Ive just started using these,",
      "text": "Fast shipping. Ive just started using these, but they do give me more confidence for traffic on my many travels",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Easy to adjust and provides excellent view of blind spots",
      "text": "Easy to adjust and provides excellent view of blind spots. Wish mirrors were just a bit taller though. As is, cannot see parking spaces' lines in order to tell if parking within lines or not crooked.",
      "rating": 4.0,
      "verified": true,
      "author": "Millard Howard",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "This thing did the job.",
      "text": "Just exactly what wanted. It gives me the extended view I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Great value for money",
      "text": "Good spot mirrors! I have had them now for a few months and they are still in place! No cracks, like new!",
      "rating": 5.0,
      "verified": true,
      "author": "RicAndTheWorld",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Five Stars",
      "text": "Super easy application and is adjustable, so it does everything I need it to!",
      "rating": 5.0,
      "verified": true,
      "author": "Michellh",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "placed these on a Volvo S-16 with bad blind spots - they eliminate the blind spots and ...",
      "text": "placed these on a Volvo S-16 with bad blind spots - they eliminate the blind spots and leave enough room for the normal mirror - great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "the drivers side mirror helps a lot but the pax ...",
      "text": "the drivers side mirror helps a lot but the pax side is way too \"zoomed in\" to help with anything",
      "rating": 2.0,
      "verified": true,
      "author": "andy",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "I have stuck this on my cubicle monitor so I ...",
      "text": "I have stuck this on my cubicle monitor so I can see what is happening behind my back. It does its job",
      "rating": 4.0,
      "verified": true,
      "author": "Vishnu Raghav",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "awesome",
      "text": "These work great, they do exactly what I want them to do.",
      "rating": 5.0,
      "verified": true,
      "author": "neal",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "but sticks on and stays on great!",
      "text": "A little smaller than expected, but sticks on and stays on great!",
      "rating": 4.0,
      "verified": true,
      "author": "A.L.",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Four Stars",
      "text": "Good so far. Just installed. I prefer backing into parking spots so these will give me better visibility.",
      "rating": 4.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "HIGHLY RECOMMENDED! AWESOME PRODUCT",
      "text": "Love it. Matches me car and easily adjusted. Not too big not too small either. Stays on strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "The good and the bad",
      "text": "One works good, the other does not stay in place.",
      "rating": 2.0,
      "verified": true,
      "author": "bikerdude",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Bought these for a 2005 Sequoia with a bad passenger side blind spot",
      "text": "Bought these for a 2005 Sequoia with a bad passenger side blind spot. Installed in about 5 minutes and they work as advertised. Now I wish they were on my wife’s car.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret S.",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "Nothing to complain about",
      "text": "Does the job well. Only advice to other buyers - paste it horizontally like in the picture. I put one horizontal & other vertical. Needless to say, vertical one does not cover a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Anshuman",
      "helpful_votes": 0,
      "publication_date": 20170824
    }
  ],
  "product_meta": {
    "title": "4 Pack Blind Spot Mirror, COURAGES Square No Blind Spot Mirror for All Universal Vehicles Car Side Convex Rear View Mirror Wide Angle Blind Spot Mirror Fit Stick-on Design",
    "rating": 4.2,
    "feature_bullets": [
      "4 PACK 2019 New square packaged, 360° Rotates and adjusts for better visibility and 20° sway adjustabe, maximize your view with wide angle in car. All side view Blind Spot Mirrors are equipped with tiny adjustable swivel mounting bracket for Car Fit Stick-on Design easy installation.",
      "Convex Mirror Length: 9.5 cm, Width: 3.5 cm, Material: ABS,glass, HD Glass curved ultrathin slim design, Ingenious concave design insures helps you to forecast the next surroundings when passing or changing lanes.",
      "The mirror is connected onto a rotatable base separately, Flexible Blind Spot Mirrors which allows it for full maneuverability in all angles of your vehicle so you are comforted with the ease of driving.",
      "2 Installation methods optional (horizontal or vertical), IP65 waterproof, rust resistant and the glass will not haze. Guaranteed durability with adhesive，Waterproof adhesive, solid paste, tear off without leaving marksSuitable for interior or exterior use,Can be used as a rearview mirror in the automobile to better ensure the safety of the child.",
      "Install and test within seconds, all universal vehicles car fit accessory, car accessories MUST have for every truck, cars, SUV, jeep, RVs and vans. NOTE: this item do not fit for motorcycle."
    ],
    "specifications": {
      "Manufacturer": "COURAGES",
      "Brand": "MTSZZF",
      "Item Weight": "0.8 ounces",
      "Product Dimensions": "3.74 x 1.38 x 0.79 inches",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "Blind Spot Mirror",
      "Folding": "No",
      "Lift Type": "Manual",
      "Vehicle Service Type": "Cars",
      "ASIN": "B072HT2WHW",
      "Customer Reviews": "4.2 out of 5 stars248 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#302,648 in Automotive",
      "Date First Available": "July 17, 2017"
    },
    "categories": [
      "Replacement Parts",
      "Mirrors & Parts",
      "Body",
      "Automotive Parts & Accessories",
      "Body & Trim",
      "Automotive"
    ],
    "price": ""
  }
}