{
  "website_summaries": [
    {
      "verdict": "With the ability to charge a wide range of devices, the indication lights on this 6-device charging station make it easy to use.",
      "pros": [
        "Clever technology allows individual docking spots to light up blue when charging a device and turn off once done",
        "These lights can be turned off if not desired",
        "Once a port has charged a device to completion, it turns off",
        "Purchase includes a range of cables compatible with many devices"
      ],
      "cons": [
        "Some find the slots to be a bit narrow"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great, easy product!",
      "text": "I now own not one, not two, but THREE charging stations. I use them in my classroom for my high school students to charge their phone. It’s a win-win for them and for me. They get a quick 45 minute charge. I get an almost phone free lesson! 🙌🏻🙌🏻 Each station is equipped with charging cords for iPhones, iPads and android phones. It’s super great!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Causey",
      "helpful_votes": 110,
      "publication_date": 20181011
    },
    {
      "title": "STOP LOOKING, this is the best rapid charging station!",
      "text": "After much research and returning numerous brands that made claims that were simply untrue I found this Hercules Tuff product. I was so impressed I did a quick YouTube video. It answers lots of questions at pottsy1907. Basically this product does everything the others claim to do but DON’T! It’s rapid charge. It comes with cables. It won’t scratch a surface. It will charge multiple devices brilliantly. It has an ON /OFF switch, many don’t have this basic want. The deviders are sturdy, solid, won’t move when u pull out ur device and actually hold ur device. This is it. I would def recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris P.",
      "helpful_votes": 94,
      "publication_date": 20180414
    },
    {
      "title": "Excellent product!!!",
      "text": "I have the iPad pro and an iPad, just like they said seller sent me a longer cable for the iPad pro and it fits perfectly. Regular iPad can use cables that came with the box. It's pretty weighted and sturdy, two heavy items at the back and the plastic dividers stay put, and so did the unit. A+ product highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Momoftwo",
      "helpful_votes": 101,
      "publication_date": 20170803
    },
    {
      "title": "Hazard",
      "text": "Acid leaked out of the unit and melted it and burned my kitchen counter but it’s too late to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy M",
      "helpful_votes": 41,
      "publication_date": 20190101
    },
    {
      "title": "Great for all Devices.",
      "text": "This is an absolute must if you need to charge multiple devices. My kids have school iPads and they also have iPhones. This product has really been a great solution for our needs.Thx for a durable product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 32,
      "publication_date": 20190203
    },
    {
      "title": "Great for organizing devices",
      "text": "I wanted all kids’ devices downstairs overnight, but there was no safe place to set them. I chose this charging station because it includes the short cords, and cords hanging everywhere drive me crazy. So far, I’m impressed with this. The cords included weren’t all useful, but they offer another 3 pack for $3 which arrived in 2 days and helped me completely organize the table. You can see the thick blue case on my son’s Fire, and the flip phone, fit easily. It also seems very sturdy and balanced - won’t tip with only one heavy tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 40,
      "publication_date": 20180829
    },
    {
      "title": "Worked great for a few months and then lightning cable failed one after another",
      "text": "Title says it all. I contacted the supplier after one lightning and the USB-C failed and after multiple emails back and forth they happily said they will send me new cables, but in 2-3 weeks. While I was emailing back and forth the 2nd of 4 lightning cables failed. That was 2 days ago. And today, the 3rd of 4 lightning cable failed. So now my dock is a glorified single lightning charger. After my experience and reading others, I have no confidence in the new cables working more than a couple of months. Horrible waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 21,
      "publication_date": 20181112
    },
    {
      "title": "This product was a great design.",
      "text": "This product was a great design...until it stopped working after one month. There is a problem with the power supply and nothing charges. Not worth the money and hassle if it only works for a few weeks. After contacting the seller, the item was quickly replaced with no hassle. The new charging station works wonderfully and we are very happy with it. Excellent customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "BDavis",
      "helpful_votes": 44,
      "publication_date": 20180220
    },
    {
      "title": "Returning",
      "text": "Ok so my first impression is that it’s a nice looking charging device and should work well for my families needs. Charges well thus far. Plates are really difficult to get out so plan ahead for your devices. Edited update: Stopped charging after about a week. I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Rylie Williams",
      "helpful_votes": 24,
      "publication_date": 20180526
    },
    {
      "title": "Cheap cords that break",
      "text": "ita just shy of three months since my purchase. All the tips of the chargers have either broken off (in a device!) or are bent. I have contacted the manufacturer. Will update my review if they decide to do anything about this. Before this happened I was 50% pleased with this charging station. Sometimes you walk off thinking your device is charging and then realize it disconnects a minute later and isn’t charging at all. You have to babysit sit the devices and double check first few minutes and make sure it’s going to stay charging.",
      "rating": 2.0,
      "verified": true,
      "author": "AmazonMom",
      "helpful_votes": 18,
      "publication_date": 20181105
    },
    {
      "title": "What a Great Idea!",
      "text": "We no longer have to search for a charger that one of the kids absconded with. Now this charging station is in a centralized location where everyone spends most of their time. Therefore, everyone plugs their phones in and watch TV, cook/eat dinner or do homework. If they receive a call they can still get up and check their phone without unplugging it unless they want to. what a great idea",
      "rating": 5.0,
      "verified": true,
      "author": "jack wilson",
      "helpful_votes": 34,
      "publication_date": 20190212
    },
    {
      "title": "This is yet another garbage charger. Received it yesterday and not a single ...",
      "text": "This is yet another garbage charger. Received it yesterday and not a single port works. It worked for about 10 minutes and then shut off and now nothing works. Amazon should screen these products instead of having unhappy customers. I would not recommend buying this and go with a more reputable brand name",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180525
    },
    {
      "title": "Power cable is faulty",
      "text": "I was so excited to order and receive this product based on the description and photos. However, I was let down within 3 minutes of opening the box. The product feels very cheaply made and the power cord would not stay connected causing the devices to connect and reconnect every 30 seconds. I immediately returned the item and will be purchasing a better quality version from another brand. So disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Sebastian Blake",
      "helpful_votes": 28,
      "publication_date": 20180205
    },
    {
      "title": "This stopped working completely within 2 months of purchase!",
      "text": "We were excited to get this docking station and organize our pile of electronics. Then one by one each cord stopped working. You plug it in and the device recognized it was plugged in but it wouldn't charge. The blue light wouldn't come on. You had to wiggle the cord to get it to charge but then within a few minutes it would stop charging again. It was only adults using this station and we were careful not to bend the charger. It was the product, 6 cords shouldn't fail in less than 2 months. I contacted the manufacturer and received no response. I do not recommend this product!! Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Sauls",
      "helpful_votes": 11,
      "publication_date": 20181128
    },
    {
      "title": "Do not buy this charging station.",
      "text": "Do not buy this brand! Really like the concept, but we have only been using this charger for 2 months and 4 of the iphone charge cords stopped working already. I did not expect to have to replace the cords so soon. Would not buy this again.",
      "rating": 1.0,
      "verified": true,
      "author": "SPerkins",
      "helpful_votes": 11,
      "publication_date": 20181116
    },
    {
      "title": "Highly recommend",
      "text": "Nice to have a charging station. A little tight with the cases on the ipad",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie J",
      "helpful_votes": 38,
      "publication_date": 20190212
    },
    {
      "title": "DO NOT BUY!",
      "text": "JUST LOOK AT THE ON * REVIEWS AND BELIEVE IT! I received this product in Janurary but just started using this charging station a couple of months ago. I can't believe that 3 of the 6 cables that came with the charging station are not working. It's only been a few months and one of the cables sparked at the base connection to the unit. I should not have purchased the item and took to heart all the negative comments, something I will surely do in the future! BAD, BAD PRODUCT...DANGEROUS TOO!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mikihilina",
      "helpful_votes": 6,
      "publication_date": 20190514
    },
    {
      "title": "Stopped working after only 2 months",
      "text": "Most of the charging ports are no longer working after only two months and the tip Of one of the adaptor cords provided broke off! Waste of money. DO NOT BUY! Misled by good reviews. Worked fine initially. Should last longer than this!",
      "rating": 1.0,
      "verified": true,
      "author": "avid reader",
      "helpful_votes": 10,
      "publication_date": 20180804
    },
    {
      "title": "Great Little Charger",
      "text": "This charger performs very well. We bought a similar but cheaper charger and it died over a few months. This charger is built very solidly and provides full power to all ports, so go ahead and pug your iPad into any of the 6 ports. It has lights to indicate which port is charging and they go off when charging is complete. The lights don’t seem to work for very low capacity devices such as Apple Pencil or small Bluetooth headphones, but the devices still charge properly. This charger configuration is very neat, and it looks good enough to sit out on a counter. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Mineo",
      "helpful_votes": 15,
      "publication_date": 20180414
    },
    {
      "title": "Great buy",
      "text": "I wish I had blught this sooner! We have 3 phones and 4 tablets and they were scattered all over the house and chargers often got lost. I found this and decided to give it a try. The plastic dividers are sturdy and can be adjusted to fit your needs. Larger kid tablets with the bulky cases fit and so does my thin iPhone. The cords are a good length. You may want the shorter cords for a sleeker, prettier look, but the cords all worked fine for me. I would very much recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Snailboat",
      "helpful_votes": 10,
      "publication_date": 20180223
    },
    {
      "title": "Fire hazard!!!",
      "text": "I happily used this product for 9 months, but I just came home and one of the open chargers on this product was so hot that it burned my hand (this is while one device was charging on another port and the other 5 chargers were open). One of the 5 was radiating so much heat, it could have easily started a fire if I had not caught it in time. The concept of this great, but not worth the risk.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacki Raines Higgs",
      "helpful_votes": 9,
      "publication_date": 20181024
    },
    {
      "title": "really nice product design",
      "text": "really nice product design, good exterior and handling. however, the LED light doesn't seem to be glowing as described, and there's a random on/off button that's unclear of its function. (seems to be charging regardless of how it's flipped. --- Updates Sep 22, 2017 --- Customer service contacted promptly to resolve the issue. A new one was received, and worked as described. All the LEDs are beaming happily when charging. Improvement on personal preference - would like to have two LED lights per charger, with one indicate it's connected (blue), and the other indicate it is charging (red or green)",
      "rating": 5.0,
      "verified": true,
      "author": "YC Tseng",
      "helpful_votes": 12,
      "publication_date": 20170917
    },
    {
      "title": "Broke after less than 2 years",
      "text": "Bought this charger June 2018. The plug from the wall to the unit has always been sensitive to touch and movement and now less than 2 years later it is broken. The plug from the wall to the unit no longer makes consistent contact. Also the small plugs from the unit to the devices you are charging died pretty quickly after purchase so I bought new ones from a different manufacturer and they worked great. Disappointed I got less than2 years life out of this charger and therefore I would definitely not recommend it",
      "rating": 1.0,
      "verified": true,
      "author": "C Hersel",
      "helpful_votes": 2,
      "publication_date": 20200510
    },
    {
      "title": "Doesn’t charge devices properly",
      "text": "We have had this charging station for 2 months...it worked great when it arrived. For some reason the cords that were included with the docking station seemed to have quit working or barely work. Sometimes I plug my device in and it takes power away instead of adding! We put devices on the docking station at night and after several hours of charging, the devices will barely and sometimes not at all charge! So frustrating. We are past the return window so I’m stuck with this charging station but save yourself the headache and money and buy something else!",
      "rating": 1.0,
      "verified": true,
      "author": "EP",
      "helpful_votes": 6,
      "publication_date": 20180709
    },
    {
      "title": "Ruined our devices",
      "text": "We’re pretty sure it ruined 2 of our devices. One died and the apple repair people couldn’t even recover anything- not even a new battery fixed it! When the second device but the dust we began to suspect it was the Hercules charging station. We asked around to different experts and they all said that was highly likely. Infuriating.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny Mathews",
      "helpful_votes": 6,
      "publication_date": 20180829
    },
    {
      "title": "Nice and neat device charging solution",
      "text": "Love the Hercules Tuff Docking Station. It replaces a rat’s nest of cables and transformer plugs with a very neat charging platform for up to six devices at a time. We can now charge iPhones, iPods and iPads with either lightning or the older large connectors as well as Android phones, a Kindle and a Fire tablet. The blue indicator lighting is great for monitoring charging progress, and the short 8” cables are just long enough to work yet keep everything nice and neat. Highly recommend if you want to regain control of your kitchen counter space. Visiting friends now know where to go to recharge their toys.",
      "rating": 5.0,
      "verified": true,
      "author": "JayKayHay",
      "helpful_votes": 4,
      "publication_date": 20180226
    },
    {
      "title": "Stopped working in about 2 years",
      "text": "Bought this in Feb 2018. Its now almost Jan 2020 and this thing has stopped working consistently. When I first got it, I also purchased short lightening cables and was able to charge iPhones , iPads , etc. at rapid speed. Now a days, When it does work, it takes 3 hours to charge my half way full iphone x using a lightening cable with nothing else charging at the same time. The charging station does work but if you are in a hurry, this is not the device for you over time.",
      "rating": 2.0,
      "verified": true,
      "author": "GL",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Cables stop working",
      "text": "Bought this in March of 2018 to manage our devices. About 2-3 months ago two of the apple cables stopped working. Then a month later another apple cable stopped working. Then a few days ago the last one gave out. We have mostly apple devices so this renders the unit pretty useless to our family now. Looking at the company’s other offerings I was hoping to find just the apple cables themselves to remedy the issue. But I’m seeing only mixed cables or buy a whole new unit. Was expecting this item called Hercules Tuff to last me longer than a year and some months.",
      "rating": 2.0,
      "verified": true,
      "author": "fizzypop",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Staying Organized",
      "text": "Desktop space is essential in being organized. What I like best is not only that the Hercules Tuff charging system holds my tablets, phones, and mobile chargers, but the blue light that shows a device is charging is a good touch that adds to the decor in the office. The charging station comes with a variety of cables that fits my ipads and my androids. This is real handy device for the office or the bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 7,
      "publication_date": 20190204
    },
    {
      "title": "Works great! Glad I bought it.",
      "text": "Works well. Super easy to assemble and works simply. My only complaint is that the power cord plugs into the left FRONT side. I wish it plugged into the back so the cord is not visable but it's strictly an aesthetic complaint. I only use 3 of the dividers because I have and Ipad2, iPad mini & fire tablet all with the thick kids covers. They wouldn't fit with the dividers spaced normally. Last the company seems very attentive. I've received 2 emails asking how I like the product & they even attached a PDF instruction pamphlet just in case.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Wagner",
      "helpful_votes": 2,
      "publication_date": 20180731
    },
    {
      "title": "Stopped Working",
      "text": "The unit has stopped working after only a few months of gentle use. When I plug a device in (such as an iPhone, Kindle tablet, etc.) the unit will not charge the device. The unit has power (the blue light is lit up) and the cables are securely inserted into the USB ports, so getting power to the devices is not the problem. If I could return it, I would, but it's been too long since I purchased it. I like the idea of having a central charging station for all of my family's devices, and may try to find another one. This one however, at $40+, is cheaply made and doesn't work well.",
      "rating": 1.0,
      "verified": true,
      "author": "William K Winkler",
      "helpful_votes": 4,
      "publication_date": 20181204
    },
    {
      "title": "Works as expected",
      "text": "As a family of three with an android phone, and iPhone, and two iPad's, I was tired of looking for an available outlet or charger. I decided to take my chances with this one stop charging station. This serves the purpose. Though through trial and error we realized two of the cords weren't charging and they did not have the charging cord I needed for my LG phone - but no biggie - I just use the cord my phone came with. In all, I'm satisfied with this charger.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Very functional and nice looking as well!",
      "text": "We love this docking station. It's a great place for all of the kids to put their phones at night and I love the way the port lights up blue when something is plugged in. It's attractive and functional. Cords too short for the teenagers to \"steal\" but perfect length for charging and not taking up space on the counter. I like the fact there are more lightning cables for our situation and the two other cables help because one charges my bluetooth speaker and one charged one of the kid's friend's phones that was a Droid. We've really enjoyed this product for the short time we've had it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Johnson",
      "helpful_votes": 3,
      "publication_date": 20180219
    },
    {
      "title": "Love it! Highly recommend!",
      "text": "OMG! I absolutely LOVE this charging station! It's simplistic, yet seemingly durable. I currently have a large old model IPad, an iPad mini 4, a kindle, my phone, my husband's phone, and my bluetooth earpiece charging on it. The blue lights on the dividers can be switched on or off, as long as your device is plugged in - it will charge with or without the added divider lights. The accompanying cords are perfectly sized to not be annoying - as in they don't cause a messy tangle. I'm beyond happy with this purchase! Going to buy my brother 1 for his birthday ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny L. Paul",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Great as a one stop charging station for people",
      "text": "Overall a great product. We purchased for our family vacation so we had a one spot charging location for everyone. Only thing we would say needs improvement is we were not able to remove the separates easily when we packed up to go home. We felt like we needed to keep it in tack as to not break any of the separates. This made it for a little inconvenience when we packed to go home.",
      "rating": 5.0,
      "verified": true,
      "author": "JQS",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Inexpensive, does what it's supposed to.  N.B. - \"Kids' edition Kindle\" tablets don't fit in slots.",
      "text": "I bought this to \"bring to order to the galaxy\" of my household's ever growing collection of rechargeable electronic devices - each with its own wall wart competing for outlet space and cheap cable littering the place. This does the job and looks pretty good doing it. My only further comments on this product are that: a.) the \"kids edition\" Amazon Kindle does not fit in the provided slots (though phones, ipads and a nintendo switch lite fit no problem); b.) the provided cable set is mostly for iOS devices. If you're an Android or otherwise mini/micro USB family, you may have to buy some additional cables. Otherwise, this is a good product, and cheaper than many of the alternatives.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart Shapley",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Paid For Itself....Love It",
      "text": "Love this thing! We have 7 kids and we go through chargers at a ridiculous pace, so I decided to get this and it was an amazing decision!! We have one port/cord that is starting to act up on us after all this time, but the rest still work perfectly! The value is exceptional! Even once we stopped buying the brand chargers, still at the cheapest it’s $5-$10 each and some of my kids were needing a new charger monthly-every other month....so this thing has paid for itself in that sense!",
      "rating": 5.0,
      "verified": true,
      "author": "Princess Mommy",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "no power switch, or energy saver",
      "text": "Does exactly what it's suppose to, organize devices at one compact station. The only item that needs to be redesigned is on/off switch in the front. I thought this was an actual power switch (smart device) so I can leave it plugged in all the time. But it's just a cool blue light. I am now looking for same item in a smart device, so it doesn't waste energy, just plugged in all day, as most charging cords draw energy when plugged into wall socket, regardless if you're actually charging something. Apple/Google, and all 3rd parties, need to demand smart chargers/devices for everything, and stop wasting electricity 24/7",
      "rating": 4.0,
      "verified": true,
      "author": "JoJo GTG",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Don't assume we all have Apple devices!!",
      "text": "So far, so good. The only thing I don't like is it came with 3 cables for iPhone. We don't have Apple anything. So I had to order additional cables compatible with Samsung and Google Pixel phones. It would be better if we could choose what cables we need. UPDATED REVIEW!! I put my tablet on this charger tonight. It was at 31%. I kept checking to make sure everything was plugged in and lit up. After 3 hours it was at 46%. It's going back.",
      "rating": 4.0,
      "verified": true,
      "author": "gltrgrami",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Nice features/real space saver.",
      "text": "My first impression was that the unit is too flimsy. I don’t know how well it would hold up in a house full of kids. However, I am retired and all the grandkids are 750 miles away. So for me it is perfect. I especially like the blue diodes which are on for each device and go off when charging is complete. It is also a great space saver when my too numerous devices all need charging the same night. As Mikey would say, “I like it!”",
      "rating": 5.0,
      "verified": true,
      "author": "R. Robertus",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great product, but can’t get needed replacement parts",
      "text": "Love this product. Works as advertised, EXCEPT almost all the plastic dividers over time have broken. I’ve tried to contact the company, Hercules Tuff to get replacements but IMPOSSIBLE to get any email reply from their customer service! Also, in the original packaging they included a note with an email address for Nina, but that returned a reply that my email was undeliverable. If I could get replacements this would be 5 stars. Without, we just have phones and iPads stacked on top of each other and we lost the organized look we had before they broke.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert A",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Works great",
      "text": "We have this on the desk at the lake and it works great for hubby and my electronics and also is easy for overnight guests to use. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "T in MN",
      "helpful_votes": 4,
      "publication_date": 20181107
    },
    {
      "title": "Outstanding company and product!!",
      "text": "I would absolutely buy this again, not only for the product, but also for the extraordinary customer service that comes along with it. We love our charging port, and are able to charge all of the kids iPads/ our iPhones and even charge our stroller fans as well— all at one time. We will absolutely purchase from your company in the future, and send additional business your way as well. This truly is an outstanding company, and I encourage anyone who is looking to purchase a charging station, to do so with these guys!!!",
      "rating": 5.0,
      "verified": true,
      "author": "lazzle",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "No more charger wars! Charges quicker than expected!",
      "text": "This thing is the best. I got it for my parents who have 7 kids, all married with our own kids. So when we come in from out of town and all stay with them in their house, there are usually charger wars or fights about whose is whose. This thing has finally put an end to that! We can charge numerous devices at once and all in one place! The light that turns off when the charge is complete is awesome. I was expecting it to charge slowly, but I’d say our apple devices charged just as quickly as the block charger that comes standard with the iPhone. Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "JA",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Convenient and looks clean",
      "text": "We have this annoying little \"nook\" on the corner of my kitchen countertop area that has mail and a 4 usb charger plug in the outlet. It looks like a mess, especially when we have multiple devices tangled amongst cords. This 6 charger dock cleaned up the entire area, and we even stack mail and gift cards in one of the charging slots. I like the blue illumination when turned on and charging a device. Happy purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy P",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Good product",
      "text": "I really like this product because I'm able to have all of our devices in one spot out of the way, especially with all the wires we used to have. This makes everything compact and does the job. All 5 of our different devices can be plugged in and get fully charged, so it does the job. My only complaint is that the wires for the iphone tends to stop working after a few months. It's odd because the wire for the android devices (4) continue to work, charging the devices (and we use these devices almost daily). But the iphone cord stopped working twice. For that reason, I gave it three stars.i",
      "rating": 3.0,
      "verified": true,
      "author": "Lucy N.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great design, poor cable quality",
      "text": "I love the concept of this product, but the included power cables are very poor quality. This is a great device for storing electronics in one place and charging overnight without overcharging. We have been using it daily since we got it about 3 months ago and we are down to one working iPhone cable. One died shortly after purchase and the others lasted a few months then died. I tried our other power cables and thankfully they work so the device is still usable. For the price paid I really feel that the cables should’ve lasted significantly longer. I wouldn’t not recommend this device, but I would say plan on buying replacement cables sooner than later.",
      "rating": 3.0,
      "verified": true,
      "author": "kara beth",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Cord burned up.",
      "text": "At first I loved this product as it helped to organize my counter filled with phone and tablet charging cords. However My daughter woke up this morning to grab her tablet and burnt her finger on one of the cords. One of the cords that came with the charging stations had started to burn and was smoking. Thank goodness the was no paper around and it was on a granite counter top or it would have caught on fire. Would recommend using another cord not the one that comes with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebekah",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Great product",
      "text": "This product fulfilled a need my daughter had while in the Rehab facility. I never knew something like this was available but she found it and I ordered it for her. It made it exactly what was needed for all her phones and other items she needed to have easy access to during her stay. The invention of this item and this seller have a great product. It is excellent and something all of us in the technical age need to have at our disposal!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Kepler",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "excellent charging station",
      "text": "We inevitably have a tangled mess of cords for charging electronics, and when family comes to visit, it is a disaster! This has been a tremendous help, and has multiple kind of adaptors to accommodate different devices. All cords have worked fine for us, going on 2 months now. The dividers are a perfect height. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Moss",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Very Disappointing",
      "text": "I am sure this was a packaging problem. I received my docking station today and I got my iphone X plugged in. Then I got my ipad Pro. Not one cable to worked to plug it in. Very disappointing. Gave my other docking station away. Now I'm searching again. No excuses really for this. Returning item.",
      "rating": 1.0,
      "verified": true,
      "author": "CHAR",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Serves my purpose",
      "text": "I’ve been looking for a charging station to clear up and organize the ten million chargers in my kitchen cluttering my counter. I decided on this one and does what it’s supposed to do. It charges our iPhones, iPads and other devices which use a USB charging system. One thing I’ve noticed is if you’re using multiple ports at the same time, it doesn’t charge quite as fast but it definitely works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Stops working after a few months",
      "text": "This product has turned out to be the worst waste of money. It worked for a few months and then one connection stopped working, then another and another. We started to noticed the usb’s had to be inserted with a certain side facing up to work. It should work no matter which side faces up. Now we are down to only one port working, as the other ports appear to be charging and then when you come back an hour later it didn’t charge your device at all. Total waste, buyers beware.",
      "rating": 1.0,
      "verified": true,
      "author": "GP",
      "helpful_votes": 3,
      "publication_date": 20181215
    },
    {
      "title": "Having a family of five this does it's job.",
      "text": "The product is great. I have three kids and they have their own tablets. Between a family of five, we were always fighting over charging phones and tablets but now with this we are able to charge multiple devices at the same time. Also it helps organize the tablets. Before the kids would have their tablets all over the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Choi",
      "helpful_votes": 6,
      "publication_date": 20200630
    },
    {
      "title": "Easy, clean, simple, organized!",
      "text": "This charging station has worked out perfectly for us. We had our 4 children plug their devices in in our bedroom each evening but the number of chargers was getting ridiculous. They were all over the place and during the day they would take the charger and some would inevitably disappear. This dock keeps everything simple and organized in one spot. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Toothdoctormom",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Work great",
      "text": "I was unsure if I should buy this product after reading some bad reviews but am glad i did purchase it, it work great and it charges fast I could have all connections charging at the same time with no problems",
      "rating": 5.0,
      "verified": true,
      "author": "Adsel777",
      "helpful_votes": 34,
      "publication_date": 20200624
    },
    {
      "title": "Great stand, not so great cords.",
      "text": "Easy to use. Tablets and phones stay upright and you can fill the stand and it holds up. Downside are the cords it comes with. After about two weeks our Apple products no longer recognized the cords and so it they wouldn’t charge. So I ordered APPLe replacement cords and now it works great consistently.",
      "rating": 3.0,
      "verified": true,
      "author": "junebug624",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Easy to use,  sturdy,  but must be cautious on charged devices",
      "text": "I bought this charging station organizer as a gift for my husband's birthday. This station is compact and seems sturdy for its purpose. Assembly was quite easy. My husband has used it since then and the only issue I'd caution about is to do a trial and error on devices being charged. His phone got quite hot while charging on the station, but his tablet charged without incident.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara Greczyn",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "The convenience of having ALL the devices in one place and charging at the same time!! Genius!!!",
      "text": "I first saw the charging station organizer when my daughter had it on her Amazon wish list. I purchased it for her and decided to purchase one for us. She loves it... to always know where the devices are and that they are all charged has been a wonderful thing. We have 2 Ipads and 2 cell phones all with different chargers...the station works great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Trudy L. Hardy",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Not very “Tuff” - lasted 6 months.",
      "text": "I’m back at Amazon looking for a charging station and noticed I’ve only had this Herculean Tuff one for six months. After six months, 3 of the plastic dividers have snapped off and are broken , most of the cords don’t work, even after buying replacement ones. We keep on plugging devices only to find them without charge hours later. We used this for iPads and iPhones in our family room. For the price, I expected to get more than 6 months of use.",
      "rating": 2.0,
      "verified": true,
      "author": "G's  Mom",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Only 4 months later and multiple charging outlets no longer work...",
      "text": "I hate writing negative reviews, and I loved this product for the first few weeks we had it. However, now after only 4 months of use, only ONE of these outlets is actually charging anything. Only after a few days one was not working, and then gradually the others have stopped as well. we have tried cords that work in the one outlet in the other outlets and they no longer work, which tells me it isn't the cord. I was hopeful that this product would actually become a nightly charging station for all our devices. I am outside of the window to request return from Amazon. Hoping the company will try and resolve the issue for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathryn Solomon",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Perfect charging station for home & travel",
      "text": "I saw one of these at a friend's home and promptly ordered one for myself. It is so convenient to have everything in one place, with cords that are perfectly sized. No excess cable to get tangled, look messy or tempt one of the cats. I took on travel with me and not only did I have enough USB ports but also a much tidier place to charge everything (phones, iPad, headphones, charging bars, iPod...). Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Perfect for families!",
      "text": "At the beginning of the summer brought 3 grandchildren to our summer cottage. They each chose an outlet for their tech and I stepped over cables and devices for a week. THAT needed to change. Next trip up, I setup this charging station and they actually use it! No long cables...no stepping over cables, no devices on the floor. iPods, iPads and iPhones all stack nicely. It's the end of the summer now and the Hercules Tuff Charging Station has definately done it's job. Thanks for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Stagg",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Organized!",
      "text": "Modern technology now a days plus every member in my family has at least two devices that need to be charged. We had cords scattered everywhere. Kids screaming because there ps4 controls were not charged. This product came in organized everything and kids keep there controllers charged! Very nice product and worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Seitze",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Versatile and easy to use",
      "text": "I work at a hospital in many times people get admitted without they’re charging cord. Patients and other people I work with are able to use this and it really comes in handy. Have not found a device it does not support yet. Would buy it again",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A Brown",
      "helpful_votes": 9,
      "publication_date": 20200129
    },
    {
      "title": "All charging ports failed in a few months.",
      "text": "This was a great product when I first bought it. Very helpful for a mother of 3 who all have iPads and phones including myself. However it did not last long. All the charging ports failed to charge our devices. It did not last a year.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley ",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Love love love this product. Makes a great gift.",
      "text": "I bought 4 of these at Christmas time and gave them as gifts. Every single person that got one loved it and has told me it’s super convenient. We use one in my 8 year olds room and it’s great. No more looking for missing charger cables. iPad, Fitbit, cell phone, blue tooth headphones... charged all in one place. It’s great downstairs or when you have company and they need to charge their devices. This is also great for Seniors because there will be no more tripping over cords. Great for teens because the cords are too short for them to steal the cords LOL! It’s a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracie Ann",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Perfect for multi-devices!",
      "text": "Works great! Love having all my devices in one place in my office. Plus, maybe it's the girl in me, but I like the light up feature! Lol The seller reached out to me as well to make sure everything worked and I was satisfied. I would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 4,
      "publication_date": 20170829
    },
    {
      "title": "Waste of money.",
      "text": "Update: I just received an email from this company asking me to change my review and they would refund me $40. I seriously wouldn’t purchase anything from them after this. It doesn’t charge our iPads and sometimes our iPhones won’t charge. We have to use different cables than what came with this. We ended up throwing this away because it never worked. Waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea Tyndall ",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "Love this",
      "text": "Love that we have a placed for all of our stuff to charge and to be 'docked' at night! This works great and comes with plenty of extra little cords for any device. We have used with the Amazon Fire Tablets and Apple I pads! It is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Brock  Nelson",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Fantastic product!",
      "text": "The stand can hold several items (or one) and is heavy enough that it will not tip over. Excellent design. The little dividers even light up when in use. The small cables that are supplied are good quality. Rare to find an item that truly works well. I got this as a gift, but I will definitely be purchasing one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Clean and Smart",
      "text": "I've been researching for a while for a new charging station. I had a \"Sharper Image\" charger that lasted 3 years but did not have several features: higher amp charging, the light indicator for full charge, and of course the inclusion of the cables we needed for all our devices (iPad Pro, iPad 5th Gen, iPhone 6S, iPhone 8S, FitBit, Samsung Wireless Headset, and our Ring Batteries. This station does it all, while looking Clean and acting Smart. Great job Hercules, now the ultimate test: Longevity....",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Sarratea",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "I love the idea of this product, but it stopped working early on",
      "text": "I wanted to love this product, but had troubles with it early on. The first issue was that 2 of the wires stopped charging devices. I contacted the company, and they said they would send me replacements for the two that didn’t work, but the replacements never arrived. I used my own wires, and that worked for a while. Within 4 months, all of the original wires had stopped working. At 6 months, the main charging piece stopped working. It was a real disappointment from start to finish.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather M",
      "helpful_votes": 2,
      "publication_date": 20190104
    },
    {
      "title": "Does not work well with Apple products - AVOID - AVOID - AVOID!",
      "text": "Extremely dismayed with this purchase. Despite all the \"glowing reviews\" here - the product that we were delivered was only capable of charging our iPhones / iPods at 1 of the 6 charging portals. This has rendered the device effectively useless. When we attempt to charge, we get a message saying \"This accessory may not be supported\" with a dismiss button. I would discourage anyone here from purchasing this. I would wholly welcome a response from the Hercules customer service staff as well. Yours truly - M in W. PA on 12/29/2018",
      "rating": 1.0,
      "verified": true,
      "author": "Matt C. in PA",
      "helpful_votes": 2,
      "publication_date": 20181229
    },
    {
      "title": "Convenient and works great!",
      "text": "The station works great, lights help with knowing if your device is charging or complete. My husband loves it. He has an iPhone, iPad and a iPod that controls a back stimulator that has to stay charged at all times. My only issue is the box it arrived in was not damaged at all, but the box the station came in was damaged quite a bit. Luckily, the station wasn’t and works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela R. Norsworthy",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Great value, works as advertised",
      "text": "Amazing for tidying up a messy space. I love that this charging station includes different charging cables including USB-C. They all work fine. It’s nice that the blue light for indicating whether a device is fully charged can be turned off since we don’t want a glow at night. Highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Kammy",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Comact and Easy to Use",
      "text": "I bought this for my husband for Christmas with the thought of alleviating piling up of his devices and organizing multiple wires. It didn't work for him. He said it took up too much room on his desk. So, I took it over and really like it. It's compact and fits on a little table next to my desk. No more labeling wires to fit devices. Only criticism is it is a bit flimsy fitting my I Pad and the blue light is unnecessary as only one light works and has nothing to do with charging.",
      "rating": 3.0,
      "verified": true,
      "author": "Dolly.718",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Work at first bought in July 2018",
      "text": "Work at first bought in July 2018 now my kindle fire won't charge worth a flip so i turn it off. Buyers beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Tennessee Kidd",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "Beware do not buy it",
      "text": "Do not buy the dock charging station they stopped working after 2 weeks and I got replacement and it’s still the same. Beware sellers",
      "rating": 1.0,
      "verified": true,
      "author": "Tracy Greer",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "4 styles of cords and you can use your own use cables.  Plus you can get more for 2.99",
      "text": "I have several devices and I can charge them all safely in one spot. The nightlight turns off without turning off the charging station. I can charge my devices in the cases. I suggest you don't in all the deviders until you set your toys where you want them. This is great for overnight charging, but it charges my new tablet or my Iphone in about 2 hours if I run out of charge early.",
      "rating": 5.0,
      "verified": true,
      "author": "REMECCAN",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Only worked for a couple weeks",
      "text": "After two weeks none of the connections would charge anything. It was easy to put together and I liked the convenience of keeping all the electronic devices in the same place for charging. I will probably buy another one but will choose a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "BSJ",
      "helpful_votes": 2,
      "publication_date": 20181109
    },
    {
      "title": "Cheap feeling, flimsy, seems like it might break my electronics with prolonged use",
      "text": "Made of a flimsy grey plastic that's hard to set up and heats easily. Do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Chang",
      "helpful_votes": 2,
      "publication_date": 20200709
    },
    {
      "title": "Great multi device charging station.",
      "text": "Charges quickly and handles most mobile devices. Too bulky to travel with but that was not why I purchased it. Easy to tell which device is plugged in and when it is charged. Would recommend it to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tall man",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Clutter reduction",
      "text": "Great product. Takes the clutter out of charging multiple devices I would like to add to this review. The Hercules Tuff customer service is exemplary. They are more customer focused than any company I have ever dealt with. The charging station works perfectly. We just took it on a cruise and it worked perfectly. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ellen Monteith",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Slowly not working...",
      "text": "When I got this I was super excited that we were able to charge all devices in one area! After about 3 weeks one of the cords stopped charging.. then another one the metal prong just fell right off when I tried to plug it in my phone. Now another cord charges “sometimes” Sad to say I need to look for more chargers. The prong on that one looks like it’s going to fall off:(",
      "rating": 2.0,
      "verified": true,
      "author": "KPEP10",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Nice concept",
      "text": "This unit is a nice concept but made of plastic. The plastic divider inserts do not stay in place very well. It is nice to have our electronics in one area of the den and plug into this unit, but a heavier-duty item would be appreciated.",
      "rating": 3.0,
      "verified": true,
      "author": "TireTracksUpNorth",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Garbage within 4 months",
      "text": "Initially, I loved this product. Everyone in family had to \"check in\" their electronics every night in my room to charge. This limited kids from having their phone/ipad in their room and also had a spot so we could find everything every morning fully charged. Suddenly, one or two of the connectors weren't charging. Now a couple of them will connect but quickly disconnect. There is obviously an electrical short and it's become another piece of plastic junk that has limited life expectancy. It's a shame that some products today are never durable or built to last. Just more garbage that cannot be recycled. Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "carrie",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Unhappy",
      "text": "It was too good to be true. I thought it was a great price for what it was. I've had this charger just over a month. Since the cords are usually the first to go, in any charger, I treated them better than my two children. Gently encouraging them when in a rush, and praising their ability at every turn. I get that the ROI on parenting is about 30 years, but I expected my charger cords to at least live to their first year. They all died. They're dead. and I'm grieving and now am grieving my loss and have the 1% blues. Please learn from me. focus on your kids and spare yourself from this disappointing charger.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Very Disappointed",
      "text": "I would not recommend purchasing this product. Unfortunately, it was coming up to almost a year that I owned the product when it stopped working. I contacted the company and they sent me a new power wire. The problem was not the wire because the charger still wasn't working. I let the company know this numerous times. They stopped responding and are ignoring my messages.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle A.",
      "helpful_votes": 3,
      "publication_date": 20181205
    },
    {
      "title": "It failed after a couple of months.",
      "text": "Inourchsrs this to use in my special needs classroom, and it worked great at first. After 1 month, a couple ports no longer charged my devices. Then another stopped working. The devices have an error message that said “device does not support this...” (or something like that)- I am down to 1 port working. I also am constantly having to replace the dividers because they pull out with the devices when you pick them up. Really disappointed because it seemed like it would be exactly what I need to keep a charge for my classroom needs. My aids and I use these along with the students and power is a must.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Dugger",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Worked great -- but then it died",
      "text": "I purchased this item after doing a fair amount of research in October 2018. I really liked the number of ports, that it came with a variety of cables, the clear light-up dividers, the fact that the dividers were moveable, etc. I've used it pretty constantly for a year and a half, but in the last few days the device has started to flicker on and off constantly. Certain items won't charge anymore.",
      "rating": 3.0,
      "verified": true,
      "author": "appleandarrow",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Well made. Doesn’t really help with mess. Light switch is dumb.",
      "text": "Solves the ‘we need more usb power plugs’ problem. Completely does NOT solve the “there is a mess of wires everywhere” problem. It seems to be made well. It doesn’t hum or anything like that. I would have been perfectly happy for them to NOT include the very nice, sturdy light switch. It’s pointless as are the leds it is there to control.",
      "rating": 5.0,
      "verified": true,
      "author": "dc",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great for family or multiple technologies!",
      "text": "Product comes with multiples adapters for charging. 4 apple and 2 others. 6 slots total. You can purchase more cords for items needed. Lights indicate when charging and when charging complete they turn off. Great for a family or persons with a lot to charge... all items located in one space!",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra Hardy",
      "helpful_votes": 33,
      "publication_date": 20190223
    },
    {
      "title": "Excellent device with one reservation",
      "text": "The Hercules Tuff Charging Station Organizer for Multiple Devices is well-constructed and solid device. The connection are excellent and it works reliably. My one reservation is that the included power chords do NOT work on Apple i-devices. I had to supply my own. They work well, but the promotional literature led me to believe the \"Lightning\" connectors would be included. Overall, it is a great improvement on all the separate adaptors and chords I was forced use for my five Apple i-devices.",
      "rating": 4.0,
      "verified": true,
      "author": "David D. Huston",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Pulling all those devices together",
      "text": "This is a nice tool for gathering all the household devices together into one spot every night to recharge. And thankfully this one spot is not in our bedroom, because devices put out a lot of wavelengths that you shouldn't sleep next to. It's a cinch to put together and nice when people come to visit. Just encourage them to recharge their device. It has two different connections, one of iPhone (3 short cords) and another for Androids (another 3 short cords). And now we can get rid of all the other cords all over the house because we have this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Organized and Fast charge",
      "text": "I love this device. It has 3 iphone/ipad cables; one kindle and one C-3 for an Android or G7 Galaxy or higher. I organized my 2 kindles, fitbit and iphones in one central location. Never searching for my devices again. I think it charges extremely fast. I have 1 plug in the outlet now instead of 2-3 at a time. Looks just like the picture. It only had 6 dividers in it but I called the company and they sent out the extra divider. Extremely pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "prc",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "want to give it more stars but cannot cable's do not work",
      "text": "I’m sad to say this product was disappointing, because I really wanted it to work! Biggest problems are the cables. One of the cables did not work right away and 4 other cables stopped working after 2 month. It's been about 4 months now that I own the charging station and only one of the original cables works. 2 charging slots stopped working as well. Overall it looks good and if the cables worked it would have been an amazing product. I use my own cables now and the station looks cluttered because of the length of the cables. Looks cluttered and totally defeats the purpose of this product. I wouldn't not buy it if I knew.",
      "rating": 1.0,
      "verified": true,
      "author": "MZ",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "My students are grateful for this!",
      "text": "I teach high school and several students stay after school for extended hours of sports or activities. They are very appreciative of this wonderful lifesaver! I allow them to charge their devices during class, with the condition that they must leave it on the charger and not check it ever! It's been an incredible classroom management tool as well as a way to show my students that I respect their need to stay connected.",
      "rating": 5.0,
      "verified": true,
      "author": "JAMES",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Worked great at first, then it died.",
      "text": "This product worked great at first! I loved being able to plug in all my devices at one location without a mess of cables. No more losing chargers or trying to find and available plug! This product is compact yet sturdy and customizable to fit larger devices with cases. Unfortunately it is no longer usable, after about two months of use it quit working. I suspect the power connection is flawed because at first it would work if I wiggled the power cable to the unit but then it just stopped working. Not a durable product for the price. Disappointed with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura Schwarz",
      "helpful_votes": 2,
      "publication_date": 20180703
    },
    {
      "title": "Does the job!",
      "text": "Awesome product. My Nexus 6P takes forever to charge. This little gadget gets it done in a third of the time. Although they provide I phone cables for several Iphone models, I only use Android. When contacted they immediately sent extra cables for my Kindles and Android tablets. Highly recommend this product and this company.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170825
    }
  ],
  "product_meta": {
    "title": "Hercules Tuff Charging Station for Multiple Devices - 6 Short Mixed Cables Included for Cell Phones, Smart Phones, Tablets, and Other Electronics - Multi Charger Organizer Docking Station",
    "rating": 4.3,
    "feature_bullets": [
      "CONVENIENTLY INCLUDES CABLES - 4 Apple Lightning Cables, 1 Type-C Cable, and 1 Micro-USB cable perfectly sized to keep your space neat and organized! WARNING: NOT COMPATIBLE WITH CABLES NOT INCLUDED",
      "FAST AND SMART CHARGE - Six 2.4 amp ports charges cell phones and tablets up to 80% faster than other chargers with less than 2.0 amps; recognizes devices to deliver the exact amp needed; eliminates worry about overcurrent or overvoltage; ETL, FCC, CE and RoHs certifications",
      "LOVED BY FAMILIES & BUSINESSES – Use at home on kitchen counters, desks, tables, or nightstands; excellent fit for schools, restaurants, hotels, courier companies, concierge desks, libraries, classrooms, and more",
      "BANG FOR YOUR BUCK - We have a 1 year manufacturer's replacement warranty because we truly believe you’ll love this charging station. If you have any questions or concerns, message us! We will always get back to you within 24 hours for any warranty claims or questions.",
      "GIFT READY PACKAGING - a perfect gift for anyone who has a phone (ie. EVERYONE) This unit comes in a sleek, beautiful packaging that is retail ready, and plastic sealed. Makes excellent gifts for teachers, dads, moms, mother-in-law, father-in-law, sisters, brothers, coworker, men who have everything, women who have everything."
    ],
    "specifications": {
      "Product Dimensions": "7.25 x 5.25 x 1.4 inches",
      "Item Weight": "1.49 pounds",
      "ASIN": "B07222V19V",
      "Item model number": "BH11140125",
      "Customer Reviews": "4.3 out of 5 stars3,903 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#504 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Colour": "Silver",
      "Manufacturer": "Hercules Tuff",
      "Date First Available": "June 16, 2017"
    },
    "categories": [
      "Accessories",
      "Cell Phones & Accessories",
      "Chargers & Power Adapters",
      "Charging Stations",
      "All Departments"
    ],
    "price": 44.97
  }
}