{
  "website_summaries": [
    {
      "verdict": "iHome's bedside dock for the Echo Dot makes plenty of sense, but $70 is too high of an asking price.",
      "pros": [
        "iHome's attractive dock for the Amazon Echo Dot offers improved sound quality, an extra USB charging port and a clock face, all of which make the Echo Dot an even more appealing bedside gadget"
      ],
      "cons": [
        "The dock doesn't have its own controls for audio playback or even for the alarm, and the lack of programmable smart buttons or a wake-up light are both missed opportunities"
      ],
      "aspects": {},
      "publication_date": 20170707,
      "rating": 6.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Speaker interferes with voice commands. Really disappointing.",
      "text": "Really rather disappointed with this. The speaker faces upward, surrounding the mics of the Echo Dot and interfering with its ability to recognize voice commands. The clock on the front, while handsome, is entirely separate from the Dot, and requires manual timesetting. This is basically a poorly-thought through speaker cradle for the Dot that happens to have a completely unrelated digital clock on the front face. The sound quality is quite good, but once it starts playing, the mics can't pick up voice commands, as the speaker's output is directly between you and the Dot's mics. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Justin M. Carpenter",
      "helpful_votes": 45,
      "publication_date": 20171213
    },
    {
      "title": "Great for listening to music and more",
      "text": "I bought the clock dock for my bedroom echo 2 dot. Great if you enjoy listening to music in bed or not. My wife and I use our docks music feature every night to fall asleep to hard rain, wind, thunderstorms, ocean waves whatever sound you like . The next model should have the speakers on the front or sides of the dock and not on top. This makes it hard to communicate with the dot when music is playing. That's why I give 3 stars and not 4 stars",
      "rating": 3.0,
      "verified": true,
      "author": "ethompson49",
      "helpful_votes": 25,
      "publication_date": 20180126
    },
    {
      "title": "Nice Enclosure for the  Amazon Echo Dot",
      "text": "Nice enclosure for my Amazon Echo Dot. The dimmer works great and I like being able to set the clock to Military time. The speaker is a real improvement over the Dots Tinny speaker. It is a little bit bigger than I thought it would be. Over all it is worth the money...",
      "rating": 5.0,
      "verified": true,
      "author": "RMScholbe",
      "helpful_votes": 32,
      "publication_date": 20170815
    },
    {
      "title": "Room filling sound??",
      "text": "The description said this has room filling sound. . .NOT! The sound is better than the Dot itself but don't expect rich room filling sound from this thing. The bass is flat with only 2 small and simple speakers in it. What it's dome for me is freed up 2 outlets because I no longer need my alarm clock or iPhone jack. Both are provided for in this unit. I think a better price for this would have been in the mid to low $30s; I Paid $49. It serves it's purpose but does not provide the sound the description claims.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard T. Deitz",
      "helpful_votes": 30,
      "publication_date": 20171101
    },
    {
      "title": "Not to mention that there's no way to connect the iavs1 to the internet to update crap. Save your money and don't buy it",
      "text": "I've had this device for barely 6 months. Last night the thing died! No display, no audio. Called customer service and was told to download the app and update the firmware. Well there are several different iHome apps. So I tried the \"iHome AVS\" app. There's no mention anywhere in the app that refers to any \"firmware update\" . Not to mention that there's no way to connect the iavs1 to the internet to update crap. Save your money and don't buy it. It's just an expensive clock with a speaker.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael  Fullmer",
      "helpful_votes": 3,
      "publication_date": 20180607
    },
    {
      "title": "Piece of Junk that doesn't Last",
      "text": "Tried to use as a bedside clock/alarm. Bought two, one for my son and one for myself. His quit working in the 1st three months but was able to return it and get a replacement. My quit working 3 months later but I am unable to return mine and get the replacement. Not worth the hassle. Apparently there is a problem with these or we were extremely unlucky to have two go bad in 6 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry Valone",
      "helpful_votes": 3,
      "publication_date": 20180910
    },
    {
      "title": "Good, but Don’t use it as an alarm.",
      "text": "I really like this speaker. It’s sleek and clean looking and the sound is decent. The biggest issue I have with it is that we use it for an alarm and there really needs to be some sort of snooze button. My fault for not being thorough enough when I purchased it. It’s just really hard to remember to say “Alexa, snooze” when you’re brain hasn’t started functioning yet. We got this to replace an iHome and I do miss the iHome a bit.",
      "rating": 3.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Quit working less than 6 months",
      "text": "Worked great when it was working, sound quality was good and easy to install. About 3 months in the brightness of the clock face started randomly changing. I would have to constantly hit the dimmer sensor on the top to adjust the brightness to our liking. After 6 months the clock dies completely, now it s just a speaker for our Echo with no clock.",
      "rating": 1.0,
      "verified": true,
      "author": "Lance",
      "helpful_votes": 2,
      "publication_date": 20180920
    },
    {
      "title": "Sound Quality Good, but Digital Clock keeps messing up",
      "text": "We have had this for a year now and three times (including present) the digital display for the clock goes crazy. Not readable, cannot make out actual numbers as it seems all lights are lit at once. I have tried suggested trouble shooting, removing batteries and waiting a few minutes and reinstalling and it resets last for a while then bam, you wake up at night look over to the clock and cannot make out the time. It was only a week this time between the time I tried the trouble shooting suggestion and the mess up again. I would suggest you rethink purchasing this if you need a clock along with the speaker.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Thompson",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Nice looking unit that costs a bit more than it should",
      "text": "This is a nice looking clock and Echo holder. It is only a clock and speaker; the only controls are to set the time and the brightness control of the clock. There isn't even an independent volume for the speaker. That said, it is a nice looking speaker/clock and looks better on my kitchen counter than the previous one I was using (the useless VAUX Cordless Home Speaker + Portable Battery which lasted only 3 months before dying). So even though it's a bit expensive for what it is, it is the best looking one piece unit I could find for my echo.",
      "rating": 4.0,
      "verified": true,
      "author": "Sendjohnadollar",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Helps reduce clutter!",
      "text": "I was able to replace an old clock radio I used for the clock only, and a Bluetooth speaker I used to increase the volume of the Dot, with this one item. Cleared up a lot of space and clutter on my bedside table, and does a pretty good job. The audio quality is not fantastic, but pretty good for audiobooks. The clock numbers are small, but it'll do even if I need to squint. The Dot maintains the separate volumes for alarms and still lights up visibly to indicate different events. Now that there are several new Echo products, the only real reason for this item is for the clock.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Epstein",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Clock Radio Powered by Dot",
      "text": "This is a great dock for the Dot. The wires that connect power and sound from the Dot to the speaker system are all hidden inside. Now at 2:00 am when I can't sleep, I can read the time. The sound is great. The button on the top adjusts the clock brightness. Use Echo Dot's ability to set the alarm. It will even snooze for 9 minutes when you say \"Alexa, Snooze\". Only thing is you need to set the time manually - it does not sync with the Echo Dot.",
      "rating": 5.0,
      "verified": true,
      "author": "Curt Funk",
      "helpful_votes": 4,
      "publication_date": 20180127
    },
    {
      "title": "Read everything before you buy it.",
      "text": "Once you finally get it installed.. it is easy to use. However, the picture that was shown to me did not include an Alexa. I have an ihome and I just wanted to get a new one as mine had become worn out over the years. So I was shocked when I saw the hole in the middle where Alexa goes when I received it. I decided to keep it and get an Alexa. I wouldn’t buy it again but I do use it quite often. I bought it to listen to my music but I only use it now to talk to Alexa. The sound quality doesn’t compare to the last one I had.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelsey miller",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Love this. A little larger than I expected but ...",
      "text": "Love this. A little larger than I expected but love the usb slot at the back for charging my phone. If you are expecting a perfect stereo sound you may be disappointed. But for me and the size room it is in, it’s perfect for what I need. I will say that the clock numbers are great for seeing across the room (bright but they are dimmable). One quirk is when there are double digit hours there is a space between the two hour numbers that are too wide but one you are use to it, it’s ok. Thinking about a second one for my son’s bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Mudhen",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Love it",
      "text": "This is the 2nd one I purchased (the first one lasted a LONG time, and it only stopped working after our house had a super power surge). I love that the light is dimmable to a number of different brightnesses. Works absolutely perfectly with my Echo Dot and provides a good sound. Setting it up is a no-brainer - the instructions are easy to follow and accomplished quickly while the connection to my system took only seconds. Perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Zan",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Broke after 1 year",
      "text": "At first, I was a fan of this simple and effective tool to make the echo a bit louder. The set up was easy and the ability to dim the light was a bonus. I had it for a year. It stopped working. I replaced the auxiliary batteries. It still wouldn't work. I tried different outlets. It still didn't work. With it being so simple, the most logical conclusion is that the device is poorly made and meant to last a short time. I'll look for something similar as a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Lavoie76",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Nice design, OK sound.",
      "text": "Makes the Dot look more “at home” on my night stand and I really like the digital clock’s display. Being able to dim all the way to off is a big plus for us Sound is OK. Of course it’s WAY better than the Dot itself, about as good as an echo.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Crippin",
      "helpful_votes": 15,
      "publication_date": 20171104
    },
    {
      "title": "Good accessory for the Echo Dot",
      "text": "I was looking for an alarm clock replacement and a better place to put my Echo Dot. This fit the bill. I have used this with the Echo Dot Gen 1 and 2 - both work. The speaker is much better than the Echo Dot internal speaker but no where near as good as the full size Echo speaker. I purchased this item when the price dropped to $42 and thought it was overpriced. At almost $50 at the time of this review it is way overpriced. It is simply a digital clock with a speaker, an audio input and a usb port. Unfortunately iHome seems to be the only one making anything like this so there aren't many options.",
      "rating": 4.0,
      "verified": true,
      "author": "David Yoder",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Reduced Night Stand Clutter",
      "text": "So far so good. Now my dot sounds like a small stereo. This volume is perfect for my use, though if you want loud this isn't the right device. I've only had it 1 day but my alarms and timers went off as scheduled and, listing to my audio books as night is now effortless. I really like that it has reduced the device clutter on my night stand. No need for an additional clock or wireless speaker clutter. It also worked flawlessly when playing in my whole house music group. It's a bit bigger than I expected but not by much. I'm happy with my purchase and would definitely recommend to echo dot owners.",
      "rating": 5.0,
      "verified": true,
      "author": "Sande",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "The design is excellent and dot fits great in the unit",
      "text": "The design is excellent and dot fits great in the unit. I gave it four stars because I feel The speaker system is not greatest? I do NOT expect much for sound but have heard better wifi stand alone units of the same size sound better. The dots sound performs just as good on its own? This is a very contemporary unit and looks great. I do like the dimmer touch button right on top of the unit very smart for that one! I highly recommend this unit but anyone expecting bass from this unit think again?",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "iAVS1 Charging Cable",
      "text": "Although iAVS1 works great with my Echo Dot 2 the included charging cable ia not compatible with my Echo Dot. I had to use the charging cable that came with my Echo.The USB end of the cable fits as it should but, the end that fits into the Echo is clearly not compatible. I tried it on two different units with the same result. It seems the company would have had other complaints by now and offered a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Duane A. Lueders",
      "helpful_votes": 2,
      "publication_date": 20180121
    },
    {
      "title": "This speaker/alarm clock combo is perfect for the bedroom",
      "text": "I stream my music through Amazon. This speaker/alarm clock combo is perfect for the bedroom. The sound quality is greatly improved over the echo dot's speaker. There is only one minor thing. The display clock on the front does not automatically (re)set through the echo dot. So if the power goes out, or the time changes, you have to manually reset it. It's a minor thing, but would be great if I didn't need to figure out each time how to set the clock. Other than that, it is a perfect item.",
      "rating": 5.0,
      "verified": true,
      "author": "John B.",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Good for a Bedroom",
      "text": "The Echo Dot fit in it just fine and hooking it up was very easy. The finish on the clock is nice and was very easy to set. I mostly wanted a speaker for music purposes but the clock has turned out to be very good thing (of course I still end up asking Alexa for the time most often). As for music, it does a good enough job (certainly better than the Dot speaker); I just found it interesting that the bass from it isn't as deep as what I get from my Echo (I used Bach's \"Little Fugue\" and RUSH's \"Red Barchetta\" for reference).",
      "rating": 4.0,
      "verified": true,
      "author": "Neo",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "We really like being able to have a digital clock where you ...",
      "text": "I have been using this in our bedroom for a couple weeks now. We really like being able to have a digital clock where you can adjust the brightness of the readout so easily. My wife is sight impaired and small buttons are a challenge. Setting the alarm with Alexa with voice confirmation is a perfect solution. It also helped clean up our bedside table, with combining two devices in to one. We will purchase a second for our son who is headed back to college soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Duke Cornwall",
      "helpful_votes": 3,
      "publication_date": 20170804
    },
    {
      "title": "Liked the product until it stopped working after a year",
      "text": "I enjoyed the product while it lasted, but like many other reviews have stated, mine stopped working after a year, just past the warranty. One morning I woke up, and there was no power to the clock or the speaker. It powers the dot, but no clock or sound. I called ihome, and they told me they would fix it for about half the price of the clock. First and last ihome product I will be buying.",
      "rating": 1.0,
      "verified": true,
      "author": "Hist 101",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Looks great, microphone functionality decreased",
      "text": "It's a little upgrade from the dot's sound, but definitely does not meet the sound performance of similar priced speakers. The thing that sets this apart from other speakers is the simple clock display. The echo dot's ability to listen decreases due to the sound that seems to engulf the device, drowning out the Alexa commands. Neat little clock, but functional design not so great.",
      "rating": 3.0,
      "verified": true,
      "author": "Miguel",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Organized and Compact",
      "text": "This speaker system totally changed the entire organization of my room. Instead of thousands of wires and alarm clocks and Alexa's, I can fit my watch charger, Alexa charger, alarm clock, and speaker, into one compact product. This product plugs into your Echo Dot, allowing you to pick what you want to wake up to form their wide selection of sounds. Although, because the speakers totally surround the Echo Dot, sometimes the Echo Dot cannot hear you when music is playing. This will cause you to have to shout her name or manually lower the music.",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan F.",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Perfect size, great product!",
      "text": "This is a very simple product that really compliments the echo dot perfectly. We had an iHome iPhone docking clock for years but it died so I was looking for replacements. This is so much more convenient than docking your phone. The ability to have a decent speaker alarm clock with all of the ease of use of Alexa is awesome! This was a surprise stocking stuffer for my wife and she loves it. I have recommended to friends and they all bought one. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Seano",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Great idea, sound not that good",
      "text": "Great idea for a product. The Echo dot does not sound good. Its great to unite it with an alarm clock so you can see the time but use Alexa to set the time for the alarm. I wish the sound was better. It is better than the Dot, but not by a big margin. I had expectations it would be at least as good as the big Echo. It lacks any bass.",
      "rating": 4.0,
      "verified": true,
      "author": "AMZN2000",
      "helpful_votes": 2,
      "publication_date": 20171011
    },
    {
      "title": "Great enhancement for the Amazon Dot!!!",
      "text": "After purchasing an Amazon’s echo, I purchased two dots for bedrooms. I was disappointed with the sound quality of the dot compacted to the echo, but this is the PERFECT SOLUTION!! With the clock on the front it’s perfect for my bedroom. The sound is great and the dot is perfectly integrated into this iHome. I would recommend this to anyone that already has a dot and is wanting something to enhance it a little bit!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby Hepner",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Overpriced LED clock",
      "text": "This is essentially an LED clock with a mediocre speaker. I just felt it is overpriced for what it provides as an Echo accessory. It is not a stand-alone alarm clock. It is just an LED clock. The speaker isn't much of upgrade from the Echo speaker. Plus, when you are using it as a speaker, it tends to hamper Echo's response to verbal commands. Also, it takes up a large footprint if you plan to use it as a bedside speaker but your nightstand is small. Had I to do it over, I would not purchase this again at this price.",
      "rating": 2.0,
      "verified": true,
      "author": "Gadget Mom",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Perfect iHome for Echo Dot!",
      "text": "Not even a day after ordering my Echo Dot i ordered this! the chance to have an iHome again and have it amplify my Dots sound, perfect combo! the sound is really good! it can get loud but i would exactly say room filling, but for my bedroom its perfect! if you order a dot, look at this too! the Dot plugs into it for power, it has an extra port so you can plug your phone in to charge. so you have a Docking Station, a Dot Amplifier, and a phone charger all in one plug! Highly Recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Furman",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "I love this thing",
      "text": "I love this thing! Many of the reviews i read were that the sound wasnt great, or the fact it didnt have an alarm etc built in like a normal alarm clock would have (duh, it has an Echo Dot just chilling in it, there's your alarm clock)... i think the sound is great! Im not using it during house parties, or rocking out so the neighbors can hear it, youd need something better than a clock speaker for that. 5 stars, i highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "While nice, I wouldn't recommend it.",
      "text": "This is interesting and does work. I expected it to be like an alarm clock and while it does do alarms, it is the echo dot that does the alarm. The speakers don't make the echo dot much louder either. Basically, it gives you the time, has additional speakers that make the dot 10% louder and holds the echo dot. It is great if you don't have room on your nightstand for the Dot, and extra Bluetooth speaker and an alarm clock. Then you can use this and get all three in one.",
      "rating": 3.0,
      "verified": true,
      "author": "Sandi",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "I would surely recommend this product",
      "text": "What an incredible change in the audio. The provided hookup cable and design made getting this speaker system working a breeze. The illumination adjustment on the top is quite handy. The sound itself nearly equals my full sized echo device. I would surely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "When It Worked, It Was Great",
      "text": "Like many other reviewers, mine stopped working around the year mark. No display, no sound. Had to disconnect the audio cable. At least it still powers the dot and charges my phone. If there was another available option, I’d probably give it a try even if it cost more. This one just became a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Falling Down",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Not what I expected",
      "text": "This may be good for others but personally I was disappointed. I bought it to get a better audio experience from my dot in the bedroom. I thought at least I would get volume similar to my echo unit. I found the sound quality the same and the volume not any different. It didn't add any value for me and am very disappinted.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 4,
      "publication_date": 20180121
    },
    {
      "title": "Good speakers, not so great clock but decent device",
      "text": "The regular iHome can sync the time with your iPod/iPhone ect, this one can't sync the time with the echo and you have to manually put in the time with buttons located on the bottom of the clock (literally underneath it). I kept this and use it for the speakers (which are nice) but my main is still a regular iHome connected with an extra Bluetooth device to the echo.",
      "rating": 3.0,
      "verified": true,
      "author": "Allen Collins",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Lasted two years and then died!",
      "text": "I bought this product about two years ago. I just realized that it stopped working all together and now it is being recycled. It was cool while it lasted, not sure why it just died completely. I tried everything to check it but it just stopped working.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Faris",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "MAJOR DESIGN FLAW!",
      "text": "Alexa (echo dot) will not listen when volume is above 5. The speakers outgoing sound waves impede any incoming.",
      "rating": 1.0,
      "verified": true,
      "author": "GV",
      "helpful_votes": 8,
      "publication_date": 20171227
    },
    {
      "title": "Perfect",
      "text": "The speaker worked beautifully and everyone works as intended. People who are saying it covers up the mic are dumb because the mic is on the top of the echo dot. It is normal that the echo will have difficulty hearing you if you are playing loud music since it is directly in the center of the speaker, kind of like how other people are hard to understand if you are next to a loud speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "David Mathews",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Crapped out at 6 months",
      "text": "Well, I also ended up with a unit that crapped out at the 6 mark. Worked great as a clock right up until it didn't. As many others posted, the speaker unit itself interferes with the echo voice functionality, but I wasn't looking for some Uber sound system, just a nice clock that was multifunctional. I'm extremely disappointed as I REALLY liked this clock.",
      "rating": 2.0,
      "verified": true,
      "author": "AdorkableGeekGirl",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Looks beautiful. Speaker could be a little bit louder",
      "text": "Looks beautiful. Speaker could be a little bit louder. For the amount of real estate this item takes, I would expect a higher quality speaker. Otherwise it is a good looking device and very modern.",
      "rating": 4.0,
      "verified": true,
      "author": "W. Dambra",
      "helpful_votes": 2,
      "publication_date": 20171013
    },
    {
      "title": "... for my boyfriend for Christmas and the sound is terrific! He has this in his bedroom and while ...",
      "text": "I had bought this for my boyfriend for Christmas and the sound is terrific! He has this in his bedroom and while listening to music on his Alexa, it works great! If you're a party person you might want to invest in something else. It's loud but not loud enough for a party, which again fits my boyfriend's needs. I like the size because it can fit on the smallest of dressers/tables etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Alana D",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Great addition to the Dot",
      "text": "This thing is great! awesome sound, easy to set up, has 2 built in usb ports, and it comes with the aux cord and a very short cord for the dot. The only thing is that the plug will take up 2 spots on a powerstrip because it is long. Other than that, I highly recommend this porduct for anyone with an Echo Dot!",
      "rating": 5.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Not empressed",
      "text": "I like how the Echo Dot nested in the clock! However, look for another brand as this one is way over-priced. I had to set the time on the clock - it’s not automatic. Which means every time change I will have to re-set the time! I didn’t read the return policy & will have to pay shipping charges to return! My fault!! :( for the price of the return shipping- I kind of feel stuck with my purchase & not pleased with the performance of this clock!!",
      "rating": 3.0,
      "verified": true,
      "author": "Amy McKenna",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Love it",
      "text": "This was purchased to add volume to the Echo dot in my bedroom. Being hard of hearing I had to turn the volume up to maximum on the dot in order to hear it and still it was muffled. This docking unit still has to have the volume adjusted, but only to lower it now. My one problem was that I the AA batteries were not included and I could not undo the battery door even eventhough I used multiple sized Philips head screwdrivers to try to open it.",
      "rating": 4.0,
      "verified": true,
      "author": "Danni's mom",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great product",
      "text": "Really did surprise me. Audio quality is acceptable, much much better than the Echo Dot speaker. Easy to set up and I love the charging capabilities. It even charges my I Pad, we know how temperamental I Pad charging can be. Looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher M. Schulter",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "OMG...THE SOUND!",
      "text": "We bought this for our daughter's Echo and were blown away by the incredible sound of the speakers. She now never uses her Echo without this product because it sounds so good. Now my husband and I are thinking of getting a few more for our Echoes. Well worth the money, and to be honest we thought it was very well price especially for what you get.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Clock and speaker interior",
      "text": "Really likeked the unit when I purchased. Like the sleek low profile design, speaker sound better than the Dot, and the dimmable light on clock display. After only18 months of purchase, the clock and speaker stopped working. Totaling disappointed for a unit of this price, I've had $10 units last much longer. Tried to reset, to no avail. Purchased two more for other family members, hope that they have a better experience.",
      "rating": 2.0,
      "verified": true,
      "author": "troy green",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "It makes an excellent bedside radio warm clock among the many other functionalities ...",
      "text": "Greatly improves the audio of the echo for. The clock is independent of the dot and has a battery back up. It also includes a charging port to charge one of your devices from. It makes an excellent bedside radio warm clock among the many other functionalities of the Alexa ecosystem. I would not hesitate to recommend this to anyone with an echo dot.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Howard",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Perfect Product!",
      "text": "This product works great with my Echo Dot. The clock display is great--the first night I used it, it was WAY too bright, but was very easily dimmed. The speaker sounds great as well. I use this as an alarm clock/sound machine/radio and was able to replace my separate alarm clock/radio and sound machine with one smaller unit. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "KDT",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Good value for the $$",
      "text": "Good little setup for a dot! Wanted better sound out of the dot in the bedroom, and this was a good solution! Sound not nearly as good as Alexa full size, but still pretty darn good for the money. Only downside I see is the clock must be manually changed for daylight savings time.",
      "rating": 5.0,
      "verified": true,
      "author": "Keven L. Mehaffy",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Nice Sound, but...",
      "text": "The sound is great, however, it seems to greatly limit the Dot's ability to hear, especially when the sound is above minimum. To make the commands 'heard', you have to raise your voice a notch or move closer. I am 60 and find the clock's font too 'curly/curvy'. I often makes the time hard to read where more 'block' type numbers would help a lot.",
      "rating": 3.0,
      "verified": true,
      "author": "Keith R. Lancaster",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Better sound, but a different speaker would be better.",
      "text": "The Echo Dot fits well and looks good in the device, and the sound of the speaker is better. Cons are the speaker surrounding the dot makes it harder for Alexa to hear and respond to a request, and the style /shape of the numbers on the clock are hard to read.",
      "rating": 3.0,
      "verified": true,
      "author": "Dottie's Mom",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Great addition for Echo Dot",
      "text": "This is the first thing from IHOME that actually works. Great addition for Echo Dot. These two are the perfect combination. Easy to set up. Heavy, so the echo dot doesn't fall to the floor. I have two in bedrooms. I use them as alarm clocks and to play \"Ocean Sounds\" to help me nod off to sleep. I couldn't be happier. I plan on putting others in the other bedrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Ball",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "The sound quality is great and I love that I can dim the clock",
      "text": "When I saw that there were alarm clocks that were made for the Echo Dot, I was thrilled! I had lost my power cord over the summer with moving and haven't been able to justify buying another one. But, that wasn't a problem! It charges in the clock so I can use it again. The sound quality is great and I love that I can dim the clock, have it off, or have it bright if I wanted to.",
      "rating": 5.0,
      "verified": true,
      "author": "Elena",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "This is a great product. I enjoy listening to music as I ...",
      "text": "This is a great product. I enjoy listening to music as I fall asleep--or sounds of nature. It's nice to have an Alexa in the bedroom as well. The only deficiency to the product is that it seems to make the Alexa a little 'hard of hearing' so that you have to sometimes repeat yourself more than my other dots.",
      "rating": 5.0,
      "verified": true,
      "author": "sarahmama2ev",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "WARNING - this product doesn’t work with the current Echo Dot version",
      "text": "You should not sell this product without clearly stating that this DOES NOT FIT the Echo Dot Gen 3. Nowhere did I see that caveat, which is a SHAME and a DISGRACE. I feel duped, misled and swindled - and I’m sure I’m not the only one",
      "rating": 1.0,
      "verified": true,
      "author": "ChuckB",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "good",
      "text": "This dot holder is great. Easy to set up, nice dimming settings. My only wish is that it connected to the echo dot to set up the clock. But it is just a simple stand and dies its job well",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Alexa can’t hear in the clock.",
      "text": "While the sound on a speaker was good, it was actually a bad thing because the only way I could get Alexa to listen to me was by shouting at her. Even at volume 4 I had to shout. I assume that the casing it falls into is blocking her microphone. Also, the numbers are only about an inch high and they are pretty thin so it’s difficult to read at night from even 10 feet away.",
      "rating": 3.0,
      "verified": true,
      "author": "ajnutt",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Just What I Needed",
      "text": "This was the perfect thing for my Echo Dot. It sits nicely on my dresser and blends in with my decor. It dims quite nicely, too, which is great because I have trouble sleeping with any sort of light. My only issue would be that when I am laying in bed and the alarm goes off, Alexa doesn't seem to hear me very well when I tell her to stop or snooze. A small inconvenience for such a great little product.",
      "rating": 4.0,
      "verified": true,
      "author": "DrowsyDragonTop Contributor: Cross-Stitch",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Does the trick.",
      "text": "This isn't anything more than a glorified speaker with a clock display, but if that's all your looking for then this is a great buy. Our family went all in on the Alexa smart home movement, so when my alarm clock finally died I started looking at the Echo Spot, but that was too much to swallow. We already had a Dot in the bedroom so this works perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg S.",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Unless your have perfect sight, you can't clearly make out numbers to ...",
      "text": "Unless your have perfect sight, you can't clearly make out numbers to know what time it in light or if the room is dark. The type of font and the distinction of the numeric number is terrible. Otherwise I like it. I need to find something better. I've been putting up with it but lately it is getting frustrating that I can't see the time.",
      "rating": 3.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great Deal for the Price",
      "text": "Very small and compact. Easy to setup. Wish numbers were a different font or style of lettering as it can be hard to read when half awake. Sound quality is about as good as the Dot, which isn't saying too much.",
      "rating": 4.0,
      "verified": true,
      "author": "surfingump",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Looks nice , convenient",
      "text": "A little louder than regular eco dot but much more convenient with added charging port. I do feel is a little harder for the dot to understand commands now being encased than out in the open but overall pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Pack",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Love it!",
      "text": "Purchased this as I had an echo dot but didn't have a clock in my bedroom - this enhances the sound of the echo dot and is the perfect bedside table clock. Has charging ports for my phone, the clock light is dimmable so it won't bother you in the dark. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis Bogosian",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "It can be dimmed easily, but then I can't read the time in ...",
      "text": "The sound at low levels is ok, but try to get the volume up to over low / medium and it gets distorted. And the blue light time is very bright. It can be dimmed easily, but then I can't read the time in the dark. There is likely better products out there if you want to change your dot into a bedside clock/music devise.",
      "rating": 2.0,
      "verified": true,
      "author": "JM in OH",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "As advertised",
      "text": "Exactly as advertised its a great little speaker and echo dot holder. My son uses it and its handsome in the black finish. Matches the Dot well. Speaker is just a few octaves better than dot and does not hinder dot performance at all. I would buy again. Size is about 8-10 inches squared.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Garcia",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Surprisingly nice!",
      "text": "Wasn't sure if this would be nice, but it is. Effective clock display that's dimmable (and can be turned off). Sound quality isn't as good as the larger Echo or Show, but completely adequate, and a nice home for Dots.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Newton",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Only works with the unit it says it works with.",
      "text": "My daughter got this for her Echo, but when she realized she didn't like the echo and commentated one of the Google Home Minis from the three pack I got on sale, this just became a useless piece of plastic that I coulnd't give away.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Davies",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Great echo product",
      "text": "I received it today..easy to install and works great!! Exactly what we expected! Love it and would reccomend it!! This is a updated..it's a good clock but with the type of numbers they use it's difficult to read at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Egor",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Died after 10 minutes of use",
      "text": "Update as of Jan. 12 - replacement arrived. Works fine now. Must have been bad apple first time. Setup was easy. Unit died after 10 minutes. Called iHome support. Said needed to be charged for 4-6 hours before using. Problem was this was not a rechargeable unit. Has 2 AAA batteries. Hope a replacement will work. On the positive the sound was fine until it died.",
      "rating": 5.0,
      "verified": true,
      "author": "Guyster",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Great addition to the Echo Dot",
      "text": "Sound is good and it's a great add on for the dot. I got these for my daughter's rooms. Great way to integrate Alexa and a real clock. I think the sound is better than any stand alone alarm clock I've heard.",
      "rating": 5.0,
      "verified": true,
      "author": "Omaha Beach",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "stopped working, only 1 1/2 years old",
      "text": "I liked the product. However, just yesterday, it stopped working - simply went dead. It has power, for sure because the attached Echo Dot still works. It's only 1 1/2 years old. Yes, out of warranty, but REALLY?",
      "rating": 1.0,
      "verified": true,
      "author": "Bob Scheetz",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Died after just six months",
      "text": "This Alarm/Speaker worked very well for six months -- I liked the design, which nicely complemented the Echo Dot look and gave it a decent speaker. The clock display and function was intuitive and made this a great compact bedside alarm with all of Alexa's capabilities. But note that I am describing all those features in the past tense. And that's because after six months this device just died. After many attempts to restart it (including inserting new batteries) I can only conclude that either my unit was a lemon, or the design has a significant flaw.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "It appears to break after a year to 18 months.",
      "text": "Like many other reviews, this device worked great until it died. The dot still received power but the clock and speakers are toast. I would suggest there is a major issue with this device. Too bad the company will not stand behind their product. I would avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "I like this it makes a Dot with a clock",
      "text": "I like this it makes a Dot with a clock. Like other reviews if the volume is turned up you have to shout Alexa or be right next to it. As far as room filling sound it doesn't but it sounds much better and is louder than the Dot. If you want loud buy an amp.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary C",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "nice sound ,easy install, looks good on the nightstand",
      "text": "this arrived today, was very easy to connect with my dot, it was bigger than I expected but much smaller than my bedside clock radio/cd combo. sound quality is very good, a surprise was it came with battery backup installed clock was very easy to set, I would recommend and would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "mckenna797",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Perfect addition for your echo.",
      "text": "I bought this little speaker for my echo for myself for Christmas. I really like it the sound is excellent it was easy to install any man could do it or a child. I highly recommend this as the accessory to your echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Very good, frugal buy.",
      "text": "So far, I love it! Easy to set up, very simple to operate, good sound, and an extra port on back to plug in your USB phone charger. Music's a bit distorted at maximum volume which seems just shy of the max volume of a full size Echo. Would buy again - the Dot and this speaker are less money than a single Echo full sized unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Dunlap",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Great product. Wish it was compatible with 3rd generation model",
      "text": "Echo Dot was easy to install. Plugging power cord and AV cable was a little difficult to plug into the back but I think I just need smaller fingers Wish it worked with the newer models.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Delaplane",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Great clock for Alexa",
      "text": "You want a clock for your Alexa, look no further. This is the greatest thing for it. You have a spot on the top and you just rest your finger on top and can dim it or brighten it that way. It was extremely easy to set up with Alexa. My 8 year old was able to do it himself and have no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "ash",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Great for bathroom or bedside.",
      "text": "Great addition for a \"dot\". We have this in our master bath. Clock is quite readable day or night. Brightness can be adjusted from very bright to completely dark. Speaker is decent sounding for the size. About what you'd expect and similar to the full sized Echo.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Pechek",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Good while it lasted - 16 months",
      "text": "This clock was great! WAS for one year and three months and then it just stopped working. It cost too much to work for such a short time.",
      "rating": 1.0,
      "verified": true,
      "author": "Zoester",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Great for bedrooms",
      "text": "This was wonderful for amplifying my children's alarms to help get them up in time for school in the mornings and it's not too bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Parker Kids",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Works well",
      "text": "The number \"One\" is not placed well so some numbers are a little hard to read for people with vision problem. I use it in tthe the bedroom so I naturally keep volume down even when playing music so Alexa works just fine. I like being able to dim the display so its not so bright when we are sleeping.",
      "rating": 4.0,
      "verified": true,
      "author": "Don Schultz",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "This product fills that void nicely and adds a better speaker than that on the ...",
      "text": "When my clock radio died adding another Amazon dot made sense as the replacement, but I missed the glowing clock. This product fills that void nicely and adds a better speaker than that on the dot.",
      "rating": 5.0,
      "verified": true,
      "author": "Yorkshire Exile",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "one for me and one as agift",
      "text": "just what i needed for my defiant in home assistant` .. it gives her a bigger mouth to annoy me(makes her louder) LOL works great i even bought one for my mom",
      "rating": 5.0,
      "verified": true,
      "author": "PIKA-BUM-BUM",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "I purchased the iHome iAVS1 Bedside Stereo Speaker as a ...",
      "text": "I purchased the iHome iAVS1 Bedside Stereo Speaker as a gift for my son in January (delivered Jan. 25) . The speaker/clock worked for about a month and now it is completely dead. It is March 30 and he hasn't been able to use it for weeks. I have searched for manuals or info on troubleshooting online, but I haven't found ANY information to help with this problem and my product support window closed 3 days ago - go figure. I wish I had read reviews BEFORE purchasing because there are far more negative reviews than positive.",
      "rating": 1.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "It was a gift for my daughter. I know she was very happy that it was small. She is pleased with the product and has no complaint",
      "text": "It was a gift for my daughter. I know she was very happy that it was small and didn't take up very much room and she uses it all the time when she's in her bedroom with her Alexa. She is pleased with the product and has no complaints",
      "rating": 5.0,
      "verified": true,
      "author": "hurricainelorraine ",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Very easy setup. Worked perfectly right away",
      "text": "Very easy setup. Worked perfectly right away. Not needing full volume. Makes casual music listening much better. I have a serious stereo to which this does not compare but for background music it's very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Fox",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Amazing Buy!",
      "text": "Easy to install and has a much better speaker than the built-in 2nd Generation Echo Dot. Being that I use Alexa for my morning alarm clock, it's nice to be able to glance at the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Elliot",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "To me this is a superior product that is very easy to set up and use.",
      "text": "This product is fantastic. Just by speaking I am able to set the time and alarm, daily, as needed. I also enjoy that I can listen to the music of my mood and play trivia games.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Awesomeness",
      "text": "What a beautiful clock this is, it is beautifully designed, well crafted and surprisingly boots the sound of the Echo Dot to a more stereo fuller sound. Looks beautiful, sounds awesome, it gives you several dimming options to even complete black out of the light of the clock if it’s a sleep disturbance. I am loving it!! Great purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Lucian A. Sperta",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Easy installation",
      "text": "We have been using this for two weeks now and we really like it. Our echo dot slid right in and the installation was easy. The alarm function was easy to set and when it goes off you can tell Alexia to snooze or turn it off. It looks nice in our room vs our old alarm clock.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Wilcox",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "They enjoy having the time display along with the louder speaker ...",
      "text": "This was a Christmas present for my parents. They enjoy having the time display along with the louder speaker for playing music. The speaker quality isn't what you would get from a portable speaker from Bose or Beats, but overall the sound quality isn't bad. You do want to watch the volume though, as if you have the volume too loud there is a good chance that Alexa will not hear you.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Thomas Jr",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Perfect",
      "text": "I never look at the clock I usually ask alexa what time it is. better then having this connected to a wall and not seeing there is an alexa in the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Cisconetdude",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Perfect bedroom unit.",
      "text": "The speaker is too small for 'room filling' sound. But it is an excellent bedside unit. I use it for the clock (self setting would be a nice plus) and Audible reads to me at bedtime. The speaker plays acceptable quality music while getting dressed.",
      "rating": 5.0,
      "verified": true,
      "author": "BlownItem",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Great way to have Alexia in the bedroom.",
      "text": "Excellent product. The sound is good, the lighting control of the dial excellent, and phone charging is very easy. Just what I was looking for to have easy house control in the bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Bayou Weed",
      "helpful_votes": 0,
      "publication_date": 20180117
    }
  ],
  "product_meta": {
    "title": "iHome iAVS1 Bedside Stereo Speaker System for Amazon Echo Dot [Dot sold separately]",
    "description": "Color:BlackEnjoy room fi llowing sound with your Amazon echo dot through this compact bedside clock speaker. Enjoy audio directly from your Amazon echo dot via the hardwired aux-in cable. Powers Amazon echo dot via included USB cable. Operates on included 100V-240V universal AC adapter. 2 AAA backup batteries for clock included. 1 amp USB port to charge mobile devices. Gen 1 and Gen 2 docking insert included.",
    "rating": 3.9,
    "feature_bullets": [
      "Specially designed to power & connect your Amazon Echo Dot, Includes insert for Gen 1, Gen 2 & charging cable for Echo Dot",
      "Stereo sound for room-filling music;Weight: 1.64 lbs,Dimensions: 6.70\" W x 2.13\" H x 6.70\" D",
      "Additional USB port for charging for phones or other USB-powered devices (charging cable not included)",
      "Glanceable 12/24 hour clock display and compact design to keep your nightstand clutter-free",
      "Dimmer control with adjustable brightness levels"
    ],
    "specifications": {
      "Product Dimensions": "6.7 x 6.7 x 2.13 inches",
      "Item Weight": "10.9 ounces",
      "ASIN": "B0722NGLC7",
      "Item model number": "iAVS1B",
      "Batteries": "2 AAA batteries required.",
      "Customer Reviews": "3.9 out of 5 stars749 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#16 in MP3 Player & Cell Phone Audio Docks#9,666 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 2, 2017",
      "Manufacturer": "SDI Technologies, Inc."
    },
    "categories": [
      "Portable Speakers & Docks",
      "Audio Docks",
      "Electronics",
      "Amazon Devices",
      "Portable Audio & Video"
    ],
    "price": 49.95
  }
}