{
  "website_summaries": [
    {
      "verdict": "A versatile mobile with ample features; designed to grow with your baby.",
      "pros": [
        "Six music categories with 18 melodies allow for 40 minutes of uninterrupted play",
        "Colorful toys and soothing motion entertain smaller babies",
        "Large, colorful buttons are easy for older babies to operate",
        "Converts to a standalone music box with handle for toddlers",
        "Comes with nightlight"
      ],
      "cons": [
        "Some reports of clicking sounds when mobile is set to rotate"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Makes noise but fixable",
      "text": "Son loves it. You can eliminate the clicking noise by adding some blanket yarn at the base of each section where the animals move. Otherwise the clicking is a little annoying.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Perez",
      "helpful_votes": 27,
      "publication_date": 20180114
    },
    {
      "title": "Best. I also bought mobile stand from Korea so ...",
      "text": "Best. I also bought mobile stand from Korea so I can carry around and she can watch from her swing, bouncer and on the play mat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennette Lim",
      "helpful_votes": 26,
      "publication_date": 20161129
    },
    {
      "title": "Endless entertainment for my son",
      "text": "This was such a great purchase for my son. He really enjoys laying in his crib, babbling to his little friends and kicking at the buttons. I bought this when he was just a month old and he still enjoys it at 3 months old. I haven't had to change the batteries yet and he uses it multiple times a day every day. As for the clicking noise others have mentioned, it's really not that loud and my son doesn't even notice it. I highly recommend this and am excited that he'll continue to use his even when he gets to be mobile.",
      "rating": 5.0,
      "verified": true,
      "author": "KO Bentley",
      "helpful_votes": 3,
      "publication_date": 20190224
    },
    {
      "title": "Great quality mobile and good price.",
      "text": "This is the second Tiny Love Mobile that I have purchased. The first is 3 years ago for my first brand baby and it has been worth its weight in gold! The music box is awesome with several features that make it unique. It is attached to her crib and now my second 4 month old grand daughter is totally occupied by watching the mobile and falls asleep to the music. I was so delighted that the music in this new one is the same as the first one I bought 3 years ago because this is being used at my house. The baby recognizes the music. I highly recommend this to anyone who has small children.",
      "rating": 5.0,
      "verified": true,
      "author": "Phala Pesano",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Cute, easy to put together, can only be used with slats.",
      "text": "My remote control was missing. My baby loves the hanging animals and seems to talk/laugh at them. The volume is too loud so I can’t use the music at bedtime. There should be another lower/quieter option. There is a clicking noise every few seconds because each arm has an animal and flower (pink princess version) which rotate. The sound isn’t annoying to me, but it’s loud enough that I worried it would keep baby awake. This can ONLY be attached to cribs with slats... it won’t work for the bassinet or pack n play because of the way it is fastened with a giant plastic nut and bolt.",
      "rating": 4.0,
      "verified": true,
      "author": "C.S.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Good crib mobile with nice features",
      "text": "We really like this mobile for our son. We think its a cool design feature that the music box can continue to operate separately from the mobile. The music is a little bit too energetic sometimes, so we silence it using the volume toggle. The lights are a little brighter than we expected and sometimes seem to distract from sleeping. Overall though, we think this product will be useful. Its great as an attention grabber when we have him in his crib while we get ready for work or just need to set him somewhere fun and safe for a few minutes. Also, the little characters are very cute and brightly colored.",
      "rating": 4.0,
      "verified": true,
      "author": "alodhia",
      "helpful_votes": 2,
      "publication_date": 20180417
    },
    {
      "title": "Hangs on the crib at a weird angle...",
      "text": "I thought I did adequate research before choosing which mobile for my son's crib. I wish I would have done better. Let me say that the music/sound options are great and pleasant, and the variety of options is nice. The characters are cute and the colors are vibrant. My dissatisfaction lies in the position of the arm and the motor that spins the characters around. Instead of being flat (completely horizontal over the crib) it is at a strange angle which causes the characters to independently rotate oddly and therefore makes a clicking noise and rocks the whole mobile. For the price, I was pretty disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Prentice",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Would not purchase again",
      "text": "Pros: The potential ability to use it for more than just infancy. The variety of songs available. Cons: To play music the light must be on. The light is very bright, so renders the mobile useless because I cannot play music for my daughter to help her fall asleep because the light keeps her up. Also, while the mobile is spinning, the animals get \"stuck\" and make a loud clicking noise and the whole mobile jerks. Messes up the soothing motion. Wish I could return it. Maybe this is just a faulty one? I waited too long to use it and am now, unfortunately, out of the return window.",
      "rating": 2.0,
      "verified": true,
      "author": "MommyRN",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "A little noisy",
      "text": "I opted to keep this mobile mainly because I liked the fact that it plays music continuously without having to wind it up. I also liked that it shuts off after 30min I believe of play. What I didn’t like was because the design of the mobile is on an angle and the items rotating makes a clicking noise as they reposition as other reviews have mentioned. It doesn’t seem to bother my little one but could be a hinderance for others",
      "rating": 3.0,
      "verified": true,
      "author": "Tjwess",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "4 as a sound machine 2 as a mobile",
      "text": "The sound machine portion is great but the mobile does make a loud clicking noise that can be disruptive when your baby is toddering between being awake or asleep. It also has a bright light from the buttons and the option for light off only turns off the large center light not the buttons again not conducive to convincing your baby he wants to go back to sleep. Some one posted a fix for the clicking so I'm going to try that and will probably be happy with it for the most part but frustrating that these simple design flaws were not address before manufacturing.",
      "rating": 3.0,
      "verified": true,
      "author": "T. O.",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Lifesaver !!!",
      "text": "This thing was a lifesaver. Our son was such a bad crier. He would watch this mobile for the entire cycle I believe about an hour or 45 minutes! He fell asleep to it during nap times ! You have different tunes to choose from or just let it run itself through music , so much better than the wind up old school mobiles ... volume control , music control.... now that he’s over a year old he takes just the bottom music portion around with him and listens to the music and melodys. Once he’s done we can sell the whole mobile ! So perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Only one con so far",
      "text": "So far, my only issue with this mobile is that it pops every time a new character drops down since it’s spinning at an angle, not horizontally like classic mobiles. It’s annoying from a parental level when you are trying to sleep and you are sensitive to noise. Other than that, my daughter seems to enjoy it. She woke up in the morning and was having a blast kicking and hitting it (she’s only 8 months) so I do love that they can easily interact with the base. It buys me more time in the morning and after naps. Lol!",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20171224
    },
    {
      "title": "Meh.",
      "text": "For the price, I feel like this mobile should have lights and be motorized. The only light is the “nightlight”, which is the tiny dim light on the control panel. The three little mobile arms are not motorized. They spin because as the main mobile turns, the weight of the animal flips the arm around. It makes noise and jerks the cradle every time. I do like the options of music and noise and the animals are cute, but I think it’s way overpriced for what it is.",
      "rating": 3.0,
      "verified": true,
      "author": "c4TXangel",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Cheaply made.  Wow",
      "text": "This mobile is jankety. You constantly hear the motor and because the stuff animals are so heavy, everytime they swing around it makes a loud noise which startled my baby. When you turn it on the music blasts so you have to immediately turn down to nothing. The light is just the little middle circle. The biggest thing is when the mobile touches anything it stops working - music and all . Little one touches it- stops working - if you take the mobile part out of the music box it won't play if it touches anything. This was such a waste of money. So cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great little mobile with cute animals and songs",
      "text": "Had an issue after a couple weeks with the turning part, contacted the company. They were excellent at sending the turning assembly motor thing. Works perfectly now. My son has a couple jingles he is smiling about when it comes on to those jingles. The first gray song button and blue one is where those are. Arve makes a pedestal base if you don't own a traditional crib, we use a playard \"pack n go\" for his crib, these two devices together make our son happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "My 2 month old adores this",
      "text": "My 2 month old adores this to the point of ignoring me. I am not sure if that’s a good thing yet. In any case, it’s easy to assemble and install. It uses 3 C batteries. This also tilts to make sure it’s out of the way when lifting your wee one from their crib.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra ",
      "helpful_votes": 4,
      "publication_date": 20180228
    },
    {
      "title": "Worth it!",
      "text": "This product is great! Super easy to assemble and attach to the crib. There are a lot of music options to choose from, including shuffle. My son loves to lay in his crib and “talk” to his friends. I like that it shuts off after 45 min. I know some reviews have mentioned you can hear the motor. I heard it the first couple times we used it but it’s not that loud and doesn’t interfere with the music. I love that once you can’t use it as a mobile anymore you can keep the sound part as a portable music box toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Super cute, gender neutral, it’s perfect!",
      "text": "Just received this today so we haven’t put it through the ringer just yet. But there’s a few things I should note. I do not hear any “clicking” sounds that some people have mentioned. Also, the top section where the animals are do not light up. Make sure you have C batteries on hand or order some as well. That’s one size we didn’t have stashed somewhere. The only light it has on it is on the Juke box by the buttons. I was disappointed about that. But my son loves it and am glad to have purchased it. I would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Brook Alexander ",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Not good quality",
      "text": "We have another mobile from Tiny Love and it’s wonderful. I wanted to order another for the Grandparent’s house and it seems like they don’t make thebobe we have anymore. I ordered this one thinking it would be the same quality and it isn’t. It’s terrible! The motor is loud and it started making a horrible squeaking sound after a few minutes. I’m returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa P.",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Such a disappointment",
      "text": "Lovely little mobile with nice song selection but cheaply made. Makes a buzzing sound through part of the rotation, like the motor is straining. Also made the \"clicking\" sound others have described when one of the small mobile animals turns during the rotation. Annoying and aggravating when minimal attention to these problems in manufacturing could have produced a product worth keeping and enjoying! Also, final attachment screw was stripped and couldn't tighten it securely.",
      "rating": 1.0,
      "verified": true,
      "author": "Eileen A Schleifer",
      "helpful_votes": 2,
      "publication_date": 20200105
    },
    {
      "title": "Keep baby entertained and engaged :)",
      "text": "We had bought another product which had lights only to return it as toys were ok, it didn’t fit our crib and overall the quality was bad. Hence I was wondering how this one might turn up. I wasn’t disappointed at all. The piece is very easy to put together. The toys are cute. Music has good variety and you can disconnect the mobile and just keep the music on if you wish. Our baby loves it. She can keep starring at the hanging toys endlessly and tries to grab them now that she can. Very good buy to keep the baby entertained and engaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Shweta",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "im disappointed for all the \"good\" reviews about this product",
      "text": "im disappointed for all the \"good\" reviews about this product. I requested my money back the same day I got it. A lot of things are just not right. Makes a very annoying \"clicking\" every time it turns and each disk adjusts on every half turn because they of the oval shape. All that was very distractive for my baby. I don't understand why all those good reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruben H",
      "helpful_votes": 2,
      "publication_date": 20180209
    },
    {
      "title": "Good mobile for crib.",
      "text": "Great mobile. Lots of sounds and music and options. The only thing is that you can't run just music or just music and lights without the mobile itself running. I would like to run just the music or music and lights without the mobile. I know you can take the mobile part off, but I don't want to have to disassemble and reassemble all the time. The mobile itself makes a clicking sound when the animals turn and it is a little distracting",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremi Watkins",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "I was concerned about how much the battery life would ...",
      "text": "I was concerned about how much the battery life would last on this toy but after almost 2 months the batteries are still going strong. We've used it about 2-3x a day, everyday until auto shut off. To keep the batteries from draining we would turn it off right away but sometimes didn't. Music plays for a long time, but I just wish there was an option to turn off the mobile when the music plays. The volume can be turned up enough to hear across the bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "MamaBear",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "My 2 year old son loves this mobile and he's had it since a NB!!!",
      "text": "My father in law purchased this product for my son at his baby shower and I am beyond satisfied with this mobile. There are multiple different volume levels, and on the side has an option to play the music with light and plays music with the light in the middle on. Theres multiple melodies as well which gives your baby a great selection of music to listen to. My favorite part about this product is once your child outgrown having the mobile on his crib your child can enjoy the feature of removing the part that spins and use it like a little portable music player.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosalie Sanchez",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Worth Every Penny!!!",
      "text": "Hands down, the best baby purchase I've ever made! My daughter is 3 months old and is very fussy. She wants to be held all of the time and cries the moment you put her down. This amazing apparatus has kept my daughter occupied long enough for me to get chores done around the house, cook dinner, and even enjoy a bit of mommy time. Bonus: only took me a few minutes to put together. I was torn between purchasing this mobile and the Skip Hop Moonlight & Melodies mobile (it has a remote). So glad I chose this one. Better reviews and cheaper!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Perez",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "Loves and entertained by it",
      "text": "I’m so surprised how much she loves this. Keeps her entertained when needed, calms her down when upset a lot and offers a nice distraction when wiggling to change diaper. Easy to put together and put up. My only negative is I wish you could separate music and mobile sometimes, which isn’t an option when the entire thing is assembled. Sometimes I just want music but no mobile but it’s not an option unless you take mobile off for music box mode.",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Occupies baby for a good while",
      "text": "I love this. My son used to cry after a few minutes in the crib and since I purchased this I can get things done. The different types of music from a Caribbean feel to classical to white noise so I can choose which one. It doesn’t drain the batteries quickly. I used it multiple times a day for about 3 months and it didn’t completely shut off but the light dimmed and the mobile spinning slowed so I figured it was time for new batteries. You can adjust to whatever height using the side rails since it doesn’t just clip to the too side rail. I would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "presidentunruly",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "We were Skeptical",
      "text": "I love it. We purchased this item for our son when he was 3 months old and were very skeptical about its durability and longevity of battery life due to the lights and constant motion as well as the music. He is 9 months old now and we are still using the very first set of batteries. We use it several times a day and most of the time my son pulls on the dangling toy animals and it still works without breaking. We love it and strongly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ketch1133",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Buy it!",
      "text": "My 7 week old loves it. It grabs her attention and she tries to talk to it ❤️She doesn't nap very long anymore and she likes to be held a lot. So when she wakes from her 15-20 min naps I turn it on and it distracts her for about another 15-20 min. Helps me have a bit more free time to get some small chores done! Definitely a win win...shes happy and I'm productive!",
      "rating": 5.0,
      "verified": true,
      "author": "AMS",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Perfect",
      "text": "This is perfect for my little one. I had a hard time finding one that fit my baby’s crib and this works great. I was discouraged at first from buying this mobile because of some reviews stating that there is a clicking sound from the plates when it rotates. Honestly there is a slight click sound but nothing that’s that annoying. It’s extremely easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna C.",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "No nightlight/ clicking / squeaking",
      "text": "Update: in addition to the below, it is now making an awful squeaking noise when turned on. I’ve asked for a replacement. Hopefully one with a light that doesn’t squeak. There is no way to contact the shop so it’s a gamble. Will update the review with what happens with the new one! Doesn’t have a nightlight as advertised. I saw some reviews that said this and some that didn’t. Why are people getting different products? Also when the animals rotate it makes a clicking noise. Def not worth the price tag. I thought judging by the reviews and price tag I would be sacrificing style for something practical, however- wish I had gone with a cheaper cuter option.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy O",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "One of the best product on Amazon so far",
      "text": "The product is exactly as described and reviewed. Music is soft, sound control is easy. Song choice is relevant, with clear sound and especially, it can play on a really low volume while the baby's asleep. The toys make a dropping sound indeed that used to wake up the baby, so I keep taking the toy part off when he kips and put them back when he is awake and wants to play with them. The item quality is really good. It was extremely easy to assemble. I'd highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "May N.",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Absolutely love it ❤️",
      "text": "I was not convince at first after reading the reviews , I was debating between this one and another one but I trusted my gut feeling and decided to get this one for my 2 month baby girl . And I got to say I’m very happy and my baby absolutely loved it so much . She was very entertained and the music is very baby friendly . I got to say if you have a fussy baby , you must get this . You. Won’t regret it !",
      "rating": 5.0,
      "verified": true,
      "author": "Alana Bella ",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Skip the fancy homemade mobile!",
      "text": "I was going to get a cute, handmade mobile on a craft sight but after my son was born I realized I needed something practical. This has tons of music theme selections and lasts for 40 minutes. It has the option of a light which makes it easy for those nights he's not quite ready to go to sleep. The way the animals spins around when it rotates keeps my 9 week old's attention until he's asleep. It was easy to assemble and the mounting is a no-brainier. For the price, this mobile has it all!",
      "rating": 5.0,
      "verified": true,
      "author": "Another Sarah",
      "helpful_votes": 2,
      "publication_date": 20160911
    },
    {
      "title": "This Thing Rules",
      "text": "Heck. Yes. Sure car seats and diapers and strollers and bottles and all the other necessary baby stuff is exceptionally important, but this mobile is easily in the top three best purchases we’ve made for our new baby. He LOVES it. He loves to lay under it and smile and laugh with his friends. There’s enough of a variety of music on it to be easy on the parents, too. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Yost",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Love - dim the bright buttons please!!",
      "text": "This is really cute and I love the movement of the creatures when the mobile is spinning. My only complaint is how BRIGHT the buttons are. The buttons for the different types of music light up and are very bright. So much so that when my baby was brand new and not moving in her crib, I wrapped a blanket over the front of the mobile. Now that my baby is older, I have moved the mobile to be facing out of her crib. This is a bummer because when she wakes up from naps, she can’t play with the mobile. But the lights are just way too bright to be used during the night.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine0102",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Absolutely perfect. My son (11 weeks old) only wanted to ...",
      "text": "Absolutely perfect. My son (11 weeks old) only wanted to be on my arms at all time. Now, he stays in his crib for the complete 40 min. He enjoys this mobile so much it makes my heart melt. My only complain is that each time the animal rotates, it makes this unpleasant noise. At first it used to drive me insane but I guess I got use to it now. I was not too concern about the noise waking up baby since I am pretty loud when he is sleeping. I live in NY. There is not such a thing as noise-less sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Rin",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Lullaby baby to sleep",
      "text": "Grandson is old enough to enjoy the sights and sounds of this mobile. His mom said he seems to like listening to the music when he goes to bed.",
      "rating": 4.0,
      "verified": true,
      "author": "Dimarsh",
      "helpful_votes": 2,
      "publication_date": 20200603
    },
    {
      "title": "Ok product, not great",
      "text": "The product was easy to assemble. It fits well between the slats of the crib. It does make clicking noses when it turns. It’s annoying but doesn’t seem to bother my son or wake him if he’s fallen asleep. Last thing, I’m not sure if it’s just the one that I bought or if it’s all of them, but some of the songs sound distorted and have a lot of static. Also if the volume is turned up, the songs sound distorted.",
      "rating": 2.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "The variety of music is fantastic; there is upbeat music they love when waking ...",
      "text": "Have two, one for each child, and the oldest still loves the music box coming up on 3 years (had to remove the mobile arm around 1.5-2 years when he could reach it and decently pull on it). The only complaint is that there is no way of setting the default volume when turned on or locking the volume control. The variety of music is fantastic; there is upbeat music they love when waking up and really soothing music for putting them down to sleep. Also, the huge button is wonderful when the little ones finally figure out that it turns the mobile on.",
      "rating": 5.0,
      "verified": true,
      "author": "M. C. Ambrosini",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "But it’s actuall better this way",
      "text": "This mobile has provided hours of entertainment! At first I was skeptical because this didn’t have all of the bells and whistles (lights) as other on the market. But it’s actuall better this way! There are several options. You can just have the tiny colored light on, or the larger round button on, on the bottom. You can turn the sounds up and down, and if baby pushes the big button, it changes the sounds/music. My son usually plays with this for 10 minutes or so then falls asleep. He loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle N. Mason",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Awesome!",
      "text": "We had to exchange the first mobile we bought for a sound defect, but the exchange was easy and smooth. We got the new one even before send the old one back and a LOT of time to send it back. That helps, because with a born it’s hard to drive to the UPS store. Thanks for that! My baby loves it and since new born she likes to watch the little animals and listen to the lullabies.",
      "rating": 5.0,
      "verified": true,
      "author": "Priscila Villacres",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Very cute",
      "text": "Very cute took less than five minutes to take out of the box and assemble the only downside is it has a screw type feature to attach in between the bars of the crib and does not work on a pack and play if it had a clamp type of a mount that would be better for our current situation but this is still cute. I am not sure why it is giving me an option to rate the remote control because this did not come with a remote control",
      "rating": 4.0,
      "verified": true,
      "author": "Kira Kerins",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "NOT SAFE!!! Unsecure attachment!!!",
      "text": "It attaches to the crib from under the crib rails and is very likely to fall inside the crib. PARENTS BE CAREFUL! NOT SAFE!!",
      "rating": 1.0,
      "verified": true,
      "author": "GLL",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Disappointed",
      "text": "This thing worked for a few days then it ended up not rotating the rotator makes weird machine like noises and not all the animals flip or move. I even put new batteries in it. The music plays just fine but it will not rotate. My son is finally able to use it and it’s very disappointing it doesn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily O’Donnell",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "We love it!",
      "text": "We love that our baby loves it. She stares at it for long periods of time. We love the colors, light and music. I just wish the music would stay at the same volume when you turn it back on. But it always go down to its original volume at turn off, which is too low. And people complain about it making noise when it spins and the characters drop. But ours doesn’t make noise, hardly. But I did buy yarn to put around them as others mentioned, and I still haven’t used it. I love it! And so does baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Lea Martinez ",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "If you want to sleep in...",
      "text": "This product allowed us to sleep in! Once our son was in his own room and could pull himself up to sit, this mobile was amazing. We would hear him wake up around 6-6:30 and he would turn the music on and entertain himself. That usually allowed for another 45-90 minutes a morning which really helped us when he wasn't fully sleeping through the night yet. In addition, it runs for 40 minutes when we turn it on as part of the night time routine. He still has it and likes to turn it on while playing in his room at 2! While every baby is different, this is a must buy on my list!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Gates",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "I was looking for a mobile for my newborn that ...",
      "text": "I was looking for a mobile for my newborn that could transition to toddler hood and beyond. I found what I was looking for with this product. The only reason I gave four stars is becasue the lights on the base of the product where the music plays shine right in my daughters eyes. There is no way to turn them off either. If I could ask the manufacturers to do one thing, it would be to put the light somewhere else or make a switch to turn it off.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Great mobile!",
      "text": "I spent 160 on my daughters handmade mobile a couple of years ago and decided to find something more stimulating for my son that had brighter colors, etc. I’m so glad I made this decision! My 9 week old son will laugh at this mobile for a half hour at a time! He loves it so much and the price is so much more reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Rspark",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Low hanging but adorable",
      "text": "Super cute, very colorful and has my 6 week old enthralled. I give it four stars because it hangs a little low on one side for my preference where tiny little grabbing hands are flailing. So after about 15 minutes it has started squeaking incessantly and will not stop. Update: Amazon sent us a replacement and its working as expected. My daughter absolutely loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Di Marie",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Cute mobile",
      "text": "This mobile us really cute, and my son loves it. It has a lot of different songs and sounds it runs through and auto shuts off after 45 mins. The mobile itself spins as a whole and the individual green leaves flip and rotate the creatures. The only complaint i have is that when the leaves flip it will occasionally make a brief click noise which can startle a baby thats not 100% asleep, also there is a constant hum when it spins but its not too loud it just kind of becomes white noise.",
      "rating": 4.0,
      "verified": true,
      "author": "Supatramp",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Slight Disappointment",
      "text": "I'm disappointed a bit with this item. For the price of it, I feel it should have a little \"more\". The only lights on it are buttons and usually, when a baby goes to their crib, they want something to look at to fall asleep. The baby cannot even see the animals going around because theres no light shining on them.",
      "rating": 3.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Batteries don’t last long",
      "text": "The product is overall very good. My son loves it and enjoys the sounds and and the dim blue light BUT the product literally takes a lot and a lot of battery life. I have been changing batteries every 10-12 days. We use it every night for 30 mins and in the day time for 30 mins. That’s about it!!!!! I wonder if the product I received has something wrong going on or that’s what it does to batteries. I have used it for a little over a month and spend $$$ on just batteries!!",
      "rating": 2.0,
      "verified": true,
      "author": "Gaurav Sharma",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Good for large cribs",
      "text": "We have a more traditional oak crib which has large borders all around. The regular mobiles would not fit, but this one works perfectly, has a variety of sound and the animals slide down when they reach the mid point which seems to entertain my baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Mason",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Love this...bought two!",
      "text": "Used this with my daughter and it grew with her. She turns it on whenever there is a storm or a nightmare and goes right back to sleep. When we were pregnant with our second I assumed we could give the mobile to the baby but my 4 year old couldn't give up the music box/night light. Well worth the money and my son loves it too. The mobile captures his attention more than it ever did for my daughter. They both love that they could control the light and music.",
      "rating": 5.0,
      "verified": true,
      "author": "TooMuchShopping",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Fixed clicking-now perfect",
      "text": "Love love love this! It's so cute and I love all the different sounds. I also didn't like the clicking noise and as another reviewer suggested, I tied something to the underneath of the tree/leaf, but I used twine instead and that worked just as well, the clicking us gone. 4 stars because I had to do that.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany Doffyn",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Excellent Product for my daughter!",
      "text": "I love this brand of crib mobiles! This is my second mobile purchase from this brand. My daughter is very active and eager to learn and explore. She loves the music and the lights! The moving animals make her giggle and it offers different music selections. Excellent product and quality at a very good price! This also grows with the child which is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Phoenix",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "My grandbabies love it!",
      "text": "My newborn granddaughters love it! Being newborns, it doesn't keep them from crying long, but does help distract them when tending to two hungry twins. I think it's odd that the mobile portion itself doesn't hang level. It's at a maybe 40 degree angle, but it works, the music lasts a long time and there are lots of musical choices, and the girls love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane C.",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "What is that loud whirring sound?",
      "text": "This started making a loud whirring sound (see my video recording) within about 15 minutes of turning on the mobile. This sounded like the thing was about to break, and was so loud it was all you could hear even with the music playing. This plus the \"clicking\" noise other people mentioned, detracted from the other pros of this mobile, such as the prettiness of it, ease of assembly, and ease of attachment to crib.",
      "rating": 1.0,
      "verified": true,
      "author": "TP Nguyen",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great to transition to a toddler bed too",
      "text": "We stopped using the mobile portion of this music mobile a long time ago, but my 2.5 year old still uses the music every night! He even knows how to turn it on and off himself now, the switches are chuncky very easy to use. In the ober 2 years we have had this, we have needed to change the batteries 3 or 4 times",
      "rating": 5.0,
      "verified": true,
      "author": "OurParticularPerspective",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Keeps little one entertained while I shower",
      "text": "I purchased this while my son was probably a month or so old. There are few activities you can do with them when they are so little but this is really fun to watch how much he is entertained by these little mobile friends. I love the movement of this since it isn’t your traditional mobile - they spin and move independently from each other. He is about 4 months old now and still loves spending time underneath it in his crib every morning and it allows me time to jump in the shower without worrying about him.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Super cute",
      "text": "My son loves it! It’s a great mobile super cute and its great quality. I cannot give it 5 stars because one of the parts that covers the outside was either broken or defective. I was not able to screw it but it’s mostly for looks so I didn’t return it. Other than that is a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Happy with it",
      "text": "The only thing I was worried about after reading reviews was the noise level when toys turn/drop one by one while it’s spinning. It’s very quiet, although I hear soft click it does not wake the baby or annoy me. Easy to install, when tightened enough it does not slip. Only installed between crib bars.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Animals not turning after couple uses",
      "text": "My baby is a month and a half. We only turned on a couple times and the animals already are not turning around (this is the main point of this toy). It's not attractive to my baby anymore. We have to push it to turn and sometimes it works sometimes not. It's passed the return window so now we left with a useless one.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny N. ",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Love it!",
      "text": "Love this! We tried a different, more expensive mobile before this one and it was terrible. I love this one has different songs you can play, my daughter likes the white noise or the lullaby. I also like that it automatically shuts off after a while but plays long enough. She loves looking at the mobile move too. Its a great idea that you can disconnect the music box for when they're older. Very pleased with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kmic",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "GREAT PRODUCT! Very durable!",
      "text": "We loved this! Has so many sounds and it entertained our little one. The music had adjustable volume, it can be s night light and it’s very durable. Leaving it on gave us some cover as our house creeks and it would keep our baby asleep. She loves it and she is at 11 months now, she was pulling the Mobil down so we detached the top and now just play the music next to her crib and she still loved it. It’s even got lullabies and white noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Rosales",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Great product.",
      "text": "What a great toy. He loves it in his crib it was a life savor during the early weeks as they got him to stop crying and have some fun. Helps with eye moments in my opinion. Our baby loves it even now he still enjoys it. But there are times when he doesn’t want it but that’s normal. A few times it put him straight to sleep. Hahahaha thank you and great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Nice touch",
      "text": "The songs are great, it even comes with white noises, my baby loves it. The animals are also super cute. There are only to things that I dind’t like: 1: I have the Da Vinci Jenny Lind Crib and the grid is cylindrical. Putting up the mobile hurt the grid a little bit 2: evereytime the animals turn they make a “click” sound",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Mimassi Pedroso",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "one of the best purchase I made for my baby",
      "text": "Very high quality products, one of the best purchase I made for my baby, the music box is very well made, the speaker is really good. I got this when my baby was 5 - 6 months old and it promote him to sit up to reach for the button light. He loves sitting up and playing with the mobile now inside the Crib, and it will takes his attentions of 30 minutes to an hour just switching from one songs to another.",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy Wijaya",
      "helpful_votes": 2,
      "publication_date": 20160114
    },
    {
      "title": "#1 must have baby item!",
      "text": "Hands done best purchase for baby so far! He was never one to just hang out by himself until we attached this to his pack and play. He will just stare at it and talk and giggle which means we can get some things done around the house and baby is happy! Win win! I recommend this to all first time parents or parents of babies who prefer to be held all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "A. White",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Stopped spinning after 5 months",
      "text": "This mobile was perfect. It gave baby something to look at, played a variety of songs/genres and quickly became a part of our bedtime routine. 5 months after purchasing, the animals stopped spinning. I thought it might be the batteries, but brand new batteries didnt really help. It was perfect other than that. For $50 I expected it to last a little longer",
      "rating": 3.0,
      "verified": true,
      "author": "Fran",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Nice",
      "text": "I just received this mobile yesterday and so far so good. It was easy to put together and put on the crib. My 5 month old seemed to love the movement of the animals. It is angled so there is a very slight jerking movement but it seems to draw my sons attention to the animals. The songs are nice and clear with a variety of options. The heartbeat sound is a little creepy. I liked that the volume can go from soft to louder without sounding weird. Overall a good buy. Just wish my son liked it more.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Great mobile",
      "text": "This mobile works well and the animals are very cute. Our baby is in the NICU for an extended stay, he's now almost 3 months adjusted (5 months actual). This mobile makes him very happy! There are a lot of music choices and a few volume settings which is very nice. The songs are nice and not annoying.",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory E.",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Must buy",
      "text": "Best toy out there so far Different music options. White noise or nature Volume control Animals turns Turns off by it self after a while Has light if u want to turn on Option to have random music play It is the best purchase. I was hesitant at first but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kadri",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Issue with one of the animals on 2 the same items after couple weeks of using",
      "text": "First 2 weeks me and my baby were happy with this crib toy. After couple weeks strange noise appeared from the motor department and one of the animals stopped turning out. I replaced the item for totally the same one. Looks like item we received is opened box and it has the same issue with one of the animal.",
      "rating": 4.0,
      "verified": true,
      "author": "Ievgen",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Babies seem to love this",
      "text": "For some reason babies love this. A lot of people around me told me this was a prerequisite for any to-be parents. received a jungle mobile from a friend and was successful so bought this one. The Jungle version seems a bit more popular but my baby loved it till she was 5 months old and now at 12 months she falls asleep to the music box (lullaby songs)",
      "rating": 5.0,
      "verified": true,
      "author": "Downholic",
      "helpful_votes": 2,
      "publication_date": 20170111
    },
    {
      "title": "LOVE this mobile!",
      "text": "My son LOVES this mobile! It moved at an angle so all of the pieces spin an extra spin within their normal mobile spin. He is 6 months old now and enjoys changing the music and attempting to grab the mobile. The only downside is there’s no real white noise option.",
      "rating": 5.0,
      "verified": true,
      "author": "Hope D.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Like the product a great deal upon arrival",
      "text": "Like the product a great deal upon arrival, but impossible to put together due to design. They certainly made a simple thing unnecessarily complicated with this design. Like others mentioned, ours won't stay together once assembled... We called company numerous times and unlike others we didn't hear back. Amazon returns makes things easy, so as result we're returning and ordering this product 1 more time hoping that next one that arrives is stays together as other reviews mention happened to them. Time will tell.",
      "rating": 3.0,
      "verified": true,
      "author": "TonyD",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Very good crib mobile",
      "text": "This crib mobile is awesome one for babies.My 2 month old son love it lot.The toys are really bright and colourful.This crib mobile has designed very well for babies with colourful elephant,monkey and horse.The added advantages of this crib mobile is the rotating toys and they are rotate themself also.The music from the mobile are very soothing and impressive.This crib mobile easy to fix and fits very well to my crib and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Great baby entertainment!",
      "text": "This mobiles has saved my life. My baby has reflux and colic. I can poop him down under this and get 20 minutes of peace and quiet while he is mesmerized. It's fantastic!! I do wish that the animals would not make a clicking noise as they go round and turn, it's good for entertainment but a little noisy to put him to sleep. The white noise is not amazing and mixed in with pink noise.",
      "rating": 5.0,
      "verified": true,
      "author": "NCStateAlum",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Lasted only a few months with minimal usage",
      "text": "the light and sound machine are great, however they time out without an optional setting. The mobile started out making a clicking sound as the individual animals rotated. That gradually turned into a loud clicking sound that disrupted my little one's sleep. So unfortunately I had to remove the turning mobile and just leave the sound machine.",
      "rating": 2.0,
      "verified": true,
      "author": "Julisa Riley",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Not what I expected",
      "text": "The mobile is at a weird 45 degree angle so the animals spin around as they get to the top and make a loud clicking sound that is at random intervals so definitely not good for a sleeping baby! Also the \"nature sounds\" have music with them, no idea why they did that. It also has no top portion to hold onto the crib only the back piece so you have to screw it on tight and if your crib would is soft pine like ours it can damage the crib. It is cute, but overall very disappointed thus far.",
      "rating": 2.0,
      "verified": true,
      "author": "M.D.",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "but I am so glad I got this one",
      "text": "I was struggling to get my two month old to sleep in his crib as he got too used to falling asleep being held or in his baby swing. This mobile was just the trick to soothe him with its options of comforting sounds and music. He also loves to look at the animals spin and watch the lights. I was hesitant at first to buy this mobile because there were other options that cost less, but I am so glad I got this one. You won't be disappointed in this. A must for little ones and can be transformed to a music box for a toddler to carry around when they outgrow needing a mobile.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Great, but wish better Volume",
      "text": "Love love, has helped so mcuh my only conplaints being it doesnt quite hang over like you would usually expect a mobile to, but not a big deal because l.o. doesnt mind at all. And the VOLUME meh, wish it would go a little quieter its lowest setting is a little loud for trying to get her to sleep. She DOES go to sleep with it on though, but i start it on like the middle cycle because the oters feel like they just keep her up.",
      "rating": 4.0,
      "verified": true,
      "author": "Krysten N Failing",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Good little mobile.",
      "text": "My kid is mesmerized by this mobile when I turn it on after waking up. Easy to attach to the crib slate and it seems to be well made. Good entertainment to keep him from being so fussy in the mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumer Goods",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Good purchase",
      "text": "Has been 2 months since install, battery hasn't run out. Been playing at least once a day full cycle. Song selections are typical baby lullabies (Think they could add more songs). My baby is enjoying it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Hyangdanc",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Sanity Saver",
      "text": "My baby loves watching this mobile especially watching when the animals flip over when they get to the top and bottom. He can be in full scream mode and if I put him under it and get him to open his eyes he’s mesmerized and stops crying. If I need to pump it can usually buy me some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Happy!",
      "text": "I had high hopes that it will help my baby transition into his crib Unfortunately the top part just does not rotate well. I really tried to make it work but it justs spins halfway and stops. I thought I was doing something wrong but then I realized based on other reviews that its not normal and there's something wrong with it. It sucks that I just have to give a bad review. Total waste of my money. Edit After talking to customer service, they sent a replacement and it works perfectly. Changing review to 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Obazee",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Best purchase",
      "text": "Tell me why so many mobiles are made for such thin crib rails? This is one of the only ones that would fit my crib. My daughter loves this thing! She lies there for about an hour everytime kicking and cooing at it! Only way I can get the laundry done 😂. It does click when the animals spin but it's really not a big deal... If anything it helps entertain her.",
      "rating": 5.0,
      "verified": true,
      "author": "Bulldog Girl",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "She’s almost three months now and it is a great tool for both helping her get to sleep and ...",
      "text": "My baby started looking at this mobile at about six weeks and absolutely loves it. She’s almost three months now and it is a great tool for both helping her get to sleep and to occupy her for a half an hour or more when I need to take a shower or get something done. There are upbeat music options for daytime (at least that’s what I use it for) while she watches it spin around and then softer music at night for when you just want it to soothe. Only small complaint is I wish there was an option to just play the music and not make the mobile move without taking it apart.",
      "rating": 5.0,
      "verified": true,
      "author": "Kalah",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Don’t BUY!",
      "text": "I normally don’t do reviews. But this is literally the worse thing I’ve ever bought. The Mobile doesn’t even stay attached to the handle meaning, the mobile (the part that holds the toys) will fall right on your babies face. I can’t even use it. Unless I go buy strong glue to keep it together, but still that’s such an inconvenience. I was so excited for this, figuring this will be something to keep my baby occupied while I showered. I so want my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "Meme",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Best baby mobile!",
      "text": "Best baby mobile around! Bought this when my daughter was about 4 weeks old. She is now 3 1/2 years old and we still have the music box attached to her bed and she uses it every night. Very sturdy, love that it plays for 45 minutes! She always sets it to one particular button to cycle through the type of music she likes best. Occasionally we'll here it in the middle of the night or early in the morning where she has hit the button to restart it and goes back to sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Robison",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "My baby loves it, but they really need to do something about the clicking.",
      "text": "My little one loves this, and so do we. It offers a lot of music variety (baby;s favorite is the lullaby.). I just wish they'd fix that clicking sound when the animal mobile rotates because it really does wake the baby, especially when she's still trying to fall asleep and hasn't quite fallen into deep sleep. This brings me to another point, which is an off button for the animal mobile. It's constantly rotating and you can't turn it off and just have the music on. It's not a big deal, though, so it's still a good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Riya Seifert",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Excellent",
      "text": "Much better then the one i had. Not for a pack and play which is what i have. I built a backboard to mount it because this is just what i needed. It has many sound settings with 2 volumes and the animals move enough to catch her eye with the option of a light at the top to draw her in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Cute but...",
      "text": "Cute mobile but the angle of the mobile causes excess sound i.e. a loud click as the little characters rotate. It keeps my baby awake which defeats the purpose of having the mobile so while it works well, plays music and lights up it doesn't work as well as I had hoped",
      "rating": 3.0,
      "verified": true,
      "author": "Frank D.",
      "helpful_votes": 2,
      "publication_date": 20170118
    },
    {
      "title": "cute but random static sound",
      "text": "Really cute! My baby loves it and it keeps her entertained. My only complaint is that during some of the songs it makes a random loud static like sound that is unpleasant. Other than that it's great",
      "rating": 3.0,
      "verified": true,
      "author": "Mumu_88",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Baby likes kg",
      "text": "My baby is 3 months and love this toy! We feel safe leaving him playing by himself for couple minutes because he is in the crib. My husband and I are able to leave him playing for about 15 minutes and it's awesome for us to have a peacefully meal in the kitchen lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Cute",
      "text": "My boy loved this! The only problem was it did start having rotating issues after about 1 year. But we used it a ton and he did start to pull on the toys. The music was very cute.",
      "rating": 4.0,
      "verified": true,
      "author": "a",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "My grandson is fascinated by this mobile and its music!",
      "text": "This mobile is just perfect for entertaining and soothing your baby. My grandson loves watching the toys go around and the music is perfect for lulling him off to sleep! Very pleased with this product and would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "DrPepper1330",
      "helpful_votes": 0,
      "publication_date": 20190313
    }
  ],
  "product_meta": {
    "title": "Tiny Love Meadow Days Soothe 'n Groove Baby Mobile",
    "description": "Color:Meadow Days\n\nStimulate your child's love of music with the Tiny Love Meadow Days Soothe 'n Groove Mobile. This mobile's versatile design grows with your baby, beginning as a crib mobile and then transitioning to a stand-alone music box that a toddler can carry on their own. Entertain and engage your child with the baby mobile's motion, activating and changing the music via the colorful buttons. The baby mobile plays 18 different tunes in six different musical categories, for 40 minutes of continuous play and features two high-quality speakers with adjustable volume. Help comfort your baby during quiet times or nap time with the baby mobile's soft, glowing night light. This JPMA-certified baby mobile meets ASTM safety standards. Requires three size C batteries (not included). Tiny Love strives to identify the latest discoveries in child development and translate them into engaging, interactive baby toys that nurture skills and delight the senses. Recommend attaching toy to a crib side that is fixed which cannot move up or down. Attach all provided fasteners tightly to the crib or playpen according to the instructions. Check frequently. Remove the mobile portion from the crib or playpen when the baby begins to push up on his hands and knees. The mobile is suitable for babies from birth to five months. Five plus months as music box\n\nThese are the key Developmental Wonders that this product can encourage in your baby:\n\nCognition The mobile’s cute Meadow Days characters appear and disappear above baby’s head. This creates a sort of peek-a-boo game that helps baby grasp the idea of object permanence. As baby grows and begins to press the music box’s various buttons, your little one learns about the wonders of cause (pressing a button) and effect (music and lights). Language & Communication As babies lie in their crib or bed, cooing at the mobile characters, smiling and practicing some baby talk, they hone their communication and language skills. Senses The smiling characters’ large eyes and the mobile’s slow motion along with the diverse musical selection stimulate baby’s sense of sight and sound. EQ The soothing music and steady movement create an atmosphere that calms babies and helps them through the process of going to sleep.",
    "rating": 4.5,
    "feature_bullets": [
      "Grows along with baby: Starts with baby in crib as a musical mobile; Later, the mobile can be removed for fun toddler play as stand alone music box",
      "Entertaining choices: Offers 6 different musical options with a total of 18 engaging melodies",
      "Soothe and amuse: 40 minutes of uninterrupted music: Choose between calming tunes for naptime, more energetic music for interactive play, or use the shuffle option for a fresh listening experience every time",
      "Soothing mobile motion: Specially designed soothing motion for a calm, relaxed baby",
      "Calming nightlight: Soft nightlight comforts baby during quiet times"
    ],
    "specifications": {
      "Product Dimensions": "4.75 x 16 x 13.5 inches",
      "Item model number": "TO025",
      "Is Discontinued By Manufacturer": "No",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Item Weight": "1.98 pounds",
      "ASIN": "B072PCXCJT",
      "Customer Reviews": "4.5 out of 5 stars2,239 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,993 in Baby"
    },
    "categories": [
      "Décor",
      "Nursery",
      "Mobiles",
      "Baby Products",
      "Baby"
    ],
    "price": 49.99
  }
}