{
  "website_summaries": [
    {
      "verdict": "Versatility is the Beau Jardin doormat's strong suit, since it has a low profile and plush, absorbent fibers. Ideal for homes with pets and children. Smaller size may be an issue for some.",
      "pros": [
        "Plush fibers help absorb water and other moisture",
        "Works well in any indoor room, not just an entryway",
        "Machine washable, with strong non-skid backing"
      ],
      "cons": [
        "Overall dimensions on the smaller side for a doormat",
        "Somewhat like a less durable plush bathmat"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Save your money, it's a bath mat",
      "text": "THIS IS A BATH MAT!!! The label even says so. I thought that this would be the answer to my husky's wet paws, but its not. He still tracks in water and mud. Save your money. If it sounds too good to be true it is. Wish I could return the two I bought. What a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 33,
      "publication_date": 20171204
    },
    {
      "title": "They told the truth about the roads",
      "text": "I love my New front door rug. I live in the low desert and we have an out of sand, so this is the first rug as you enter my house before hitting a long runner! It definitely does pick up the sand and dust from peoples feet before entering my house what a great rug I followed The instructions to wash first in no soap just water get a delicate cycle and I left it out all night long to dry and it did spruce it up I would buy this again and again great item !",
      "rating": 5.0,
      "verified": true,
      "author": "REGINA E REYNOLDS",
      "helpful_votes": 28,
      "publication_date": 20180131
    },
    {
      "title": "Works great!",
      "text": "Ordered this to put under my dogs water bowl. So far so good! The rug I used to use had a rubber backing and yet the water still got through. This mat has much thicker rubber backing. The fibers seem much more absorbent too... I'll probably order a few more for the back door where the doggies come in and out. The less clean up for mommy, the better!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "NashGatorGirl",
      "helpful_votes": 31,
      "publication_date": 20171220
    },
    {
      "title": "I Just Washed It First as Required",
      "text": "The color is perfect for my cocoa color marble entry. I really got lucky for a change. If it works I will buy another one for the garage entrance. I would advise you to run another empty rinse cycle even after cleaning out all the lint from washing the rug per instructions. You do not want the fibers to end up in your clothing with your next wash. It took two days to dry. If you put it in the dryer you will rot the rubber backing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunlightening",
      "helpful_votes": 55,
      "publication_date": 20171004
    },
    {
      "title": "Amazing rugs!",
      "text": "Amazing rugs!!! After seeing how well they \"stay put\"...I bought extra, cut them in thirds and put them on my oak stairs. Best thing ever!! (I used to spend half my day straightening stair rugs!!) These rugs are soft, absorbent and stay in place - even on the stairs!",
      "rating": 5.0,
      "verified": true,
      "author": "RedDragon",
      "helpful_votes": 32,
      "publication_date": 20180117
    },
    {
      "title": "Happy with the product and happy with seller communication!",
      "text": "Initially I had a negative review. But the seller contacted me to make things right. I must have gotten a defective rug because when I tried the replacement one- it worked just like it was described. Very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal H",
      "helpful_votes": 37,
      "publication_date": 20180131
    },
    {
      "title": "Keeps your floors clean",
      "text": "I washed it in cold water and gentle cycle as directed with no detergent and it only shed a little bit and then I walked outside in the gravel in the wet dirt stepped on the floor mat and then stepped on paper and the paper remained clean",
      "rating": 5.0,
      "verified": true,
      "author": "Rosa",
      "helpful_votes": 19,
      "publication_date": 20180421
    },
    {
      "title": "Good doormat means clean floors",
      "text": "I like this mat because it gets the LIGHT stuff like dirt and water from your shoes and in doing so keeps the floors clean so I don't have to sweep or mop everytime I come inside. Adding to this the customer service was great! If you have any questions just send an email and you'll get a helpful response! Plus it looks cool. Overall I'm happy with this product. I really am.",
      "rating": 5.0,
      "verified": true,
      "author": "Izic",
      "helpful_votes": 12,
      "publication_date": 20181029
    },
    {
      "title": "Great rug and customer service",
      "text": "Excellent customer service when I experienced an issue. I hadn’t realized that this isn’t a true dark grey like it looks like in the picture. It was black and white fibers that may appear grey. They helped me ensure that I received a rug that would work for me.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 16,
      "publication_date": 20171219
    },
    {
      "title": "These are nice and worth the money.",
      "text": "I bought two of these for my cottage. I love them! One ended up in my house so had to buy another one just now for the cottage again. So I got yet another one for another door in my house. Now that I think about it, I think I'm going to get another one for a door I just remembered needs something. I have a lot of doors. I do think they are a little pricey for a doormat, but you know what? They are worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Streeter",
      "helpful_votes": 13,
      "publication_date": 20180213
    },
    {
      "title": "Stays in place",
      "text": "Update! We got the next size up & we use both rugs together. Works much better now. We’ve had a tremendous amount of rain in So. Cal. Truly has cut down on the paw prints on our white kitchen floor! I’m not sure how much mud this keeps out. It stays in place at the doggie door. So that’s worth the $. We still get 🐾🐾 paw prints on our kitchen floor. 🥴",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn Rising",
      "helpful_votes": 9,
      "publication_date": 20181111
    },
    {
      "title": "Love this mat",
      "text": "Love this mat. It stays in place even though my dogs jump on it before going out for a walk. I followed the washing instructions before using it and it seems to pick up more dirt and water than my former mat.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Kane",
      "helpful_votes": 14,
      "publication_date": 20171011
    },
    {
      "title": "Color looks blue",
      "text": "Arrived on time. Black and White fibers to give it that salt-and-pepper look. Awesome! Came in a roll. Per the directions, prior to use, I washed it in only cold water. Not too much fuzz released. I drip-dried it. I laid it down. Not too many wrinkles from being rolled up. My only concern is that now the rug looks blue. I would like to give 5 stars, but doesn't the rug look blue to you?",
      "rating": 4.0,
      "verified": true,
      "author": "cassie",
      "helpful_votes": 7,
      "publication_date": 20180511
    },
    {
      "title": "Redeemable customer service, but not much past a normal mat",
      "text": "UPDATE: I was a little disappointed that this didn't soak up as advertised. The company reached out to me right away and used my review to critique the description for the mat, and also gave me a 30% refund. It doesn't soak just from walking on it like it showed in the video, you kind of have to stand there and stomp around a few minutes. If your feet are muddy (or paws) it doesn't soak up that great.",
      "rating": 4.0,
      "verified": true,
      "author": "S. L. Harpel",
      "helpful_votes": 7,
      "publication_date": 20180421
    },
    {
      "title": "Don’t work!",
      "text": "They don’t work. Plus they are pretty small. My dog still made tracks on the floor. See photos.",
      "rating": 1.0,
      "verified": true,
      "author": "Jelucero",
      "helpful_votes": 38,
      "publication_date": 20180110
    },
    {
      "title": "Won't stay put and sheds",
      "text": "I wanted to use this in my kitchen so that drips or spills from the refrigerator or from preparing food weren't tracked onto my carpet. I washed it per the instructions (cold water, air dry) and placed it on the floor where it continues to slip all over the place. If that weren't bad enough, I know have fibers from it ground into my carpet right outside the kitchen. I don't know if it's transference from feet or from the vacuum cleaner but it's actually made more of a mess, not less.",
      "rating": 1.0,
      "verified": true,
      "author": "TerryD",
      "helpful_votes": 5,
      "publication_date": 20180429
    },
    {
      "title": "After washing, very soft and absorbant, great mat for camper",
      "text": "First, I vacuumed the loose fibers then lightly washed it as per instructions, then used it in may camper where I take off my dirty shoes. Works very good. I use a plastic brush type mat for the bottom of the stairs to get most of the heavy dirt and gravel off my shoes before climbing the stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Philbert",
      "helpful_votes": 6,
      "publication_date": 20180416
    },
    {
      "title": "Good quality",
      "text": "This is great on hard floors for protection with use of female urinal. However they do shed terribly so it’s unusable on carpets as it’s so visible and requires constant vacuuming around it. It holds onto dirt too ... however all that will come out during a good washing. Washes well in washer and must be hung to dry. Dries very quickly within a 24 hour period",
      "rating": 5.0,
      "verified": true,
      "author": "Laura lu",
      "helpful_votes": 5,
      "publication_date": 20180523
    },
    {
      "title": "Same as any other rug",
      "text": "1) Do not look as good in person. Reminds me of a shag rug from a 70's apartment. Followed instructions completely and washed first no detergent, dry on low. Did not stop mud or wet feet anymore than the $5 Kmart rug I had did. Waste of $$. I am confused as to the positive posts as well as what I received did not even come close. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180119
    },
    {
      "title": "Terrible!!!!",
      "text": "This rug is absolutely not described as on Amazon reviews. I actually have a photo of how the rug does not stay in place on my carpet, in addition to the fact that there is mud all over my carpet. In fact, I believe it’s worse at trapping dirt/mud from that of the standard rug I had there earlier. Please note, I did follow the directions which said to wash it in cold water without detergent and let it air dry. This borders on false advertising.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "Don’t bother",
      "text": "I bought a different brand and loved it so much I wanted another, but was looking for a lower priced option that didn’t have a big paw print design. Tried this one, which was really a waste. This mat is thin and flat and absorbs very little from the bottom of our shoes. I’ll go back to my dog print",
      "rating": 1.0,
      "verified": true,
      "author": "Mbaj",
      "helpful_votes": 3,
      "publication_date": 20190210
    },
    {
      "title": "Does NOT Work",
      "text": "I have two of them, one next to the other one, as the dogs walk in they have to walk on them. I have dirt and mud all over the place, they don't absorb at all like it says. Don't waste your money. I mopped the floor, then 20 minutes later my husband asked if I was going to mop, it was that bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura H.",
      "helpful_votes": 2,
      "publication_date": 20190312
    },
    {
      "title": "I have a daycare and kids are always tracking in ...",
      "text": "I have a daycare and kids are always tracking in dirt. When I saw this I thought this is what I have been looking for. No such luck:( I bought one for the front door and the back door. I still have the same problem. It didn’t work for me at all:(👎",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180317
    },
    {
      "title": "Don’t do it!",
      "text": "This rug is definitely not what I was looking for. It sheds horribly in the wash and takes forever to air dry. Looks matted down and gross as soon as you walk on it. Save your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Designer1234",
      "helpful_votes": 6,
      "publication_date": 20180621
    },
    {
      "title": "Unsure how to rate these....",
      "text": "As an actual functioning floor mat, I’d give them 5 stars. The reason for the 1 star rating is because of the manufactures suggestion to wash the mats before hand. These things absolutely destroyed my washing machine, literally. They shed so much that the drain pump filter was clogged and could not be removed, the entire drain pump was replaced as a result. Luckily my washer was still under warranty, but I highly suggest finding a door mat that won’t destroy your $800 appliance.",
      "rating": 1.0,
      "verified": true,
      "author": "JFrancis",
      "helpful_votes": 2,
      "publication_date": 20180210
    },
    {
      "title": "The fibers are less than half an inch tall and don't pick up dirt like it should",
      "text": "This mat literally does nothing. The fibers are less than half an inch tall and don't pick up dirt like it should.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 9,
      "publication_date": 20180109
    },
    {
      "title": "... it doesn't just absorb anything that's on your feet like I thought it would",
      "text": "It's definitely smaller than I expected and it doesn't just absorb anything that's on your feet like I thought it would. Leaves blow on my porch all the time and I thought it would stop that from coming inside, but it didn't. Some of them stayed on the mat, but most of them still ended up in the house. Same thing for rain water. Disappointed. It looks nice though",
      "rating": 2.0,
      "verified": true,
      "author": "Hope",
      "helpful_votes": 2,
      "publication_date": 20180319
    },
    {
      "title": "NOPE!!!",
      "text": "As other reviewers have written, this does NOT perform as described. For $35 you expect the mat to at least look presentable for a day or two! Nope. After a couple shoe wipings it looked filthy and completely stopped absorbing. Do you self a favor and pass this up. Wish I had.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristen L. Elliott",
      "helpful_votes": 3,
      "publication_date": 20180123
    },
    {
      "title": "Zero stars-false advertisement",
      "text": "Followed the directions with OCD accuracy and it basically fell apart and clogged my laundry tub. But, I followed the instructions so maybe that’s supposed to happen. I put the placemat sized rug on my back porch to work as advertised for my dogs paws. I forced my dog to stand and stay. I said, ‘come here girl’ and she happily entered the kitchen leaving her muddy paws in a Cinderella patten all over the floor. What a waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "RunningBear",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Works fine.",
      "text": "I got this for my rv. I should of gotten a bigger one. It does good for dirt. But I did notice dog hair really sticks to it. I can’t sweep it off with a broom. But the vacuum works good on it. Washing is pretty easy. Just toss it in. At least you don’t have to worry about the backing getting all flaky on it. It doesn't slide around at all on my floor.",
      "rating": 4.0,
      "verified": true,
      "author": "toni",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "nice",
      "text": "I bought this to use from the garage to the house. It was a little too small for that due to us leaving our shoes on it. I used it where our glass sliding door to keep that traffic off my floors. It did a pretty good job. I would have liked a bigger one but wanted to see what this one would do before I spent the money on the bigger one. The material is soft and it did shed at first but not for long. It's very pretty also.",
      "rating": 4.0,
      "verified": true,
      "author": "Teres",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Works ok but so small my dog just steps over it",
      "text": "This rug works ok but it’s ridiculously small. My German Shepard steps over it when she comes in and if one of her feet does touch it, it’s not long enough to get the moisture off. Works fine for me if I stand on it then step off. Hosed off easily when my dog had an accident on it. I would really like this if it were larger and more attractive.",
      "rating": 3.0,
      "verified": true,
      "author": "TDK",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "\"Activate carpet\" what a mess!!!",
      "text": "This carpet straight out of the box sheds everywhere! Instructions says to \"activate carpet\" you have to wash and dry it. Washer was FULL of threads after wash. The carpet still had tons of loose fibers so I used my hand to brush leftovers into my tub. I had to do this 4 times before the shedding lightened up. 45 mins w/ cleanup. Wouldn't recommend due to the time it took to get the map ready before actually using the mat. After all.. It's good and works without shedding.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Harding",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Ugly little mat that does soak up the water, snow, etc., off your shoes!",
      "text": "The mat does the job! It absorbs wet snow off the bottom of our boots as I had hoped. We usually wipe our feet a few times before stepping off the rug and this helps alot to absorb the sand, salt, etc. While it does what it says, it is not the prettiest rug. The brown colors are not very pleasing to the eye. And yes, you can put this next to the door and it does not bunch up when you open the door. It is very slim and stays put with the rubberized backing",
      "rating": 4.0,
      "verified": true,
      "author": "TwoOfAKind",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Unexpected shedding",
      "text": "I haven’t had the mat for long but it seems to do a pretty good job of capturing dirt/water/mud. It’s a nice looking rug and has a nice rubber backing. It shed a ton after I washed it (the directions said it would). After I vacuumed the rug, the shedding is much better.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 2,
      "publication_date": 20181008
    },
    {
      "title": "Mine did NOT stay in place, and didn't last over a year",
      "text": "I got this rug in 2018, and I liked it at first. I placed it on tile by my side door, and it was extremely difficult to position the rug so that it wouldn't slide because my door would barely touch it, which would cause it to move. It did absorb water from wet shoes pretty well, but I don't think it's that great for getting dirt and other dry objects off of shoes. I think I tried cleaning it once in my washing machine, and it made my washing machine super dirty, so I never cleaned it that way ever again. Also, the cloth material on the rug would fall off of the rug sometimes.",
      "rating": 2.0,
      "verified": true,
      "author": "BREAUXseidon",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Misleading photos- actual doormat is much smaller",
      "text": "I can’t comment on the quality of the doormat yet as I have just received it and have not been able to put it to use. I am very disappointed with the size of the mat. Shame on me for not realizing how small it would be based on the (accurate) measurements in the description. The pictures definitely indicate a larger mat than what you will receive. Very misleading.",
      "rating": 3.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 4,
      "publication_date": 20180101
    },
    {
      "title": "I am very pleased with this mat",
      "text": "I am very pleased with this mat! I followed the instructions in washing it on gentle without detergent and air drying it before using it. It rained heavily last night and was able to do the water test this morning. I placed two paper towels in front of the mat before heading outside. I walked around and stepped in a puddle before re-entering my home. Walked on my mat and then on the paper towels. Very little moisture on the pater towels. I would say that the mat absorbed most of the water before stepping on the paper towels. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "This mat does the job!",
      "text": "I have had two of these door mats for over 5 years. I have given them to my daughter who has 2 Labradoodles who love getting wet and muddy. The mats do just as advertised. They stop people and pets from tracking in wet or muddy foot prints. I have washed them many times and personally had no problems doing so. They collect leaves that come in the door also. Now I have bought 3 more for a vacation home that is out in the country. We had 17 people for Thanksgiving and I had one at all three entry doors. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila B.",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Nice looking mats, but too thick for my doors!",
      "text": "This mat is absorbent, looks-and is-more plush, and has better color than some I bought at Costco, but it really isn't flat enough to allow the door to open over it, which makes it close to being useless in my house, since they aren't made for outdoor use and my doors open in, not out. I've already opened and washed two of them without realizing the problem, but will return the third, and I won't be very happy if I have to pay the postage!",
      "rating": 2.0,
      "verified": true,
      "author": "JLK",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Gorgeous & Soft!",
      "text": "Gorgeous and soft! Wish it was larger, but still good enough for covering the entryway. Must be washed and dryed before using, so anxious to see how it performs. Lighting shipping! Expect I’ll be ordering more for the rest of the house soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 2,
      "publication_date": 20180104
    },
    {
      "title": "Sheds ALOT",
      "text": "It’s OK.. definitely not as absorbent as they show in their comercial. Also sheds ALOT. Strands of yarn all over the house.. they suggest to wash the rugs beforehand to activate the “super absorbent” magic powers or whatever, but this only turned my washer into a hot mess. You are better off going to homegoods and getting an attractive, way less expensive rug for the same results.",
      "rating": 2.0,
      "verified": true,
      "author": "LP",
      "helpful_votes": 2,
      "publication_date": 20180127
    },
    {
      "title": "Effective",
      "text": "Received it last week. Have used it only once to clean shoes coming in from the yard but it worked well. You will need to wash it when you first get it. Don't wash it with any other items since it sheds. Same for the dryer. Dry it on low heat for no more than 10 -15 minutes at a time and clean your filter each time.",
      "rating": 4.0,
      "verified": true,
      "author": "Orson Hall",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Totally Worth It!",
      "text": "Bought this for the winter mush. While it doesn’t get EVERY spec of dirt, it does a pretty good job. I have 2 dogs and a construction working husband. There was a LOT of dirt/snow/mush tracking in. This really helped to keep the floors clean. Am buying another for the back door!",
      "rating": 4.0,
      "verified": true,
      "author": "Yogo",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Not all it's cracked up to be",
      "text": "It's really small and doesn't absorb like it says it will. Wet and muddy footprints of both human and dog varieties are just as visible afterstepping on the mat as they were before stepping on the mat. It's nice and heavy, so our puppy isn't able to tow it around, but that's about the only advantage over a regular mat, as far as I can tell.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer Escobar",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Works surprisingly good and exceeded my expectations",
      "text": "This works surprisingly well. I don't know how it works - static electricity possibly, since it says not to use fabric softener, which discharge of static electricity, but it works and it works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 10,
      "publication_date": 20180113
    },
    {
      "title": "Not all as seen on tv stuff works!!!",
      "text": "The idea of a one step rug is too good to be true. Unless I received a different rug then other five star reviews did, they must be lying. This rug gets a little dirt and water/snow on it and it is useless. Once this rug is saturated (which doesn’t take long) it has the opposite of the desired use. Washing instructions are more hassle than helpful. No detergent, delicate cycle and preferably hang to dry. The frequency that this rug requires washing, I might as well just buy a nicer looking set of rugs to switch out more often. It was worth a shot but it’s just an overpriced gimmick.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "So far, so good.",
      "text": "So far, this mat has been fantastic. I wish it were a bit larger. I got this to go by the back door and the doggie door to help keep dirty doggie paw prints off the floor. When my pup walks on the mat, it works fine. The problem is that she DIVES through the doggie door, and occasionally misses the mat altogether. Hence the wish for it to be a bit larger.",
      "rating": 4.0,
      "verified": true,
      "author": "Lindazilla",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Awesome,!!",
      "text": "I saw this at the state fair but the cost was extremely high. I really like this rug and it does everything that the really expensive rug does. I really like that it keeps my dogs feet clean when he comes in from outside. It also catches grass and leaves on shoes so they don't end up on the floor in the hall. I would recommend this to anyone that wants to keep the dirt, grass, leaves etc. from being tracked through the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Spoons",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Great Product",
      "text": "We work in a area that can be extremely muddy during rainy time. We saw the ads for this product and decided too try it out. Amazing results and loved it. We were so thrilled that we purchased another one so we could wash one and have another down at the same time if needed. We recommend this product, it does what the ad says it will do.",
      "rating": 5.0,
      "verified": true,
      "author": "rcarter",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "perfect size",
      "text": "Using for an inside doormat in a small entry way. Got 2 so I could angle past a corner. Does not slip or slide is a good safety feature. Down side was the shedding when first washed but a damp paper towel easily removed the debris from my top load washer. if you have the room, buy a bigger one.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Pratt",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Way better than expected!",
      "text": "I bought this rug because of my two big dogs coming in and out of our house on the farm (not expecting it to work well, but to help as the reviews were mixed) and wow! It works really good! WAY better than I expected! Follow the directions and wash in COLD water before use. I dried mine in the dryer after and they look and feel great. I bought another for the front door. Totally worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Leah V G.",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Waste of money",
      "text": "Terrible product...not sure why others are giving good reviews but I washed and dried like it said and it does not seem to work any better than any other thin piece of carpet. Not sure why it works for so many others and not for us. We tried stepping onto it, wiping our feet on it and even standing on it for several seconds and it still would track mud and water onto the floor. Also, it left its own mess, little carpet pieces everywhere!",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "I like it",
      "text": "We live in the Pacific Northwest - a rain forest. This mat has a nice heavy duty feel and does a great job soaking up water so we don’t track it in. We have a debris catching mat outside and this one inside. Haven’t had to sweep up the mud room other than just on a regular cleaning day since.",
      "rating": 5.0,
      "verified": true,
      "author": "Strick360",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Perfect size! Stays Firmly in Place!",
      "text": "This is very grumpy. Perfect for inside of our RV. The size is nice for a small entryway. I took one star off because I would’ve loved it to be a little more plush and cushy. Also the initial washing process was a little bit of a hassle because of the emense amount of shedding.",
      "rating": 4.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Pieces of yarn keeps coming off",
      "text": "While I follow the instructions and washed this door mat as instructed, every week we find small balls of yarn from this mat. It look attractive, but it shouldn't be releasing small fiber pieces that look like balls of lint.",
      "rating": 3.0,
      "verified": true,
      "author": "Beach Bum",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "It works!",
      "text": "I love this door mat! When it first arrived, I was upset that it needed to be washed first. Then it shed A LOT in the washer and dryer. But when it came out of the dryer, it was soft and absorbing. The backing keeps it where I want it. And I love this mat!! No more dog tracks to clean up after our walks!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris H",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "These might be legit!",
      "text": "I will edit this review after it’s rained and my dogs have tracked in mud and nastiness but my dog did spill her water bowl all over her feet and then came inside and had to step on this rug, I noticed wet spots on the rug from where her paws were but no wet spots on my floor.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "I love this product",
      "text": "I love this product, I bought one for the front door and one for the back door. It absorbs really well, even when shoes are wet or dirty, and best of all IT STAYS PUT! There is nothing worse than a doormat that slips and slides around on the ground so that you constantly have to re-position it. That is not the case with this one, you literally set it down where you want it and never have to think about it again. 10/10 would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "melrose",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Really does what it promises",
      "text": "This is my second one I love the one at the front door so much I put this one at the back door for the dog. This rug catches at least 90% of her dirt and keeps the floor noticeably cleaner not only by looking but I can tell when I sweep.",
      "rating": 4.0,
      "verified": true,
      "author": "Tracy R",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "DON'T BUY! Door mat nothing special. Should have ...",
      "text": "DON'T BUY! Door mat nothing special. Should have went to Walmart and got a regular mat. This one does not do anything listed, and it comes apart. I have fuzzy mat pieces on my floor constantly. Missed the return window otherwise I would have definitely got my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "Les Sundra ",
      "helpful_votes": 2,
      "publication_date": 20180325
    },
    {
      "title": "Disappointed in the color, not as advertised.",
      "text": "Disappointed. Item is shown as dark gray, which was essential to match the location for it. Instead, it is black and off-white, which looks awful. Unfortunately, I needed it right away to protect a new floor, so I have to keep it. It seems to work well, but the zebra effect isn't great and will probably need to be washed a lot more often.",
      "rating": 2.0,
      "verified": true,
      "author": "C.P.",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "So far so good!",
      "text": "We're fans, they absorb, keep in mind there are a dozen private label brands all selling the same product from the same factory. I think in some cases there are minor differences, but thats why I've found in my research.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Perfect to have inside your door for when you let the dogs out!",
      "text": "I love this doormat! It is perfect for anyone who lives in a house or apartment and has to let their dogs out on a leash. I have this mat right in front of the sliding doors in our kitchen that lead out to our patio. It's the perfect little size. It does an amazing job at not tracking in dirt or mulch from the outside and it also gives us some traction when we come back inside if it's been raining. It seems like it will hold up for a very long time and I'm already impressed by how useful this has been for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Alana T",
      "helpful_votes": 8,
      "publication_date": 20171108
    },
    {
      "title": "Keeps Your Floors Cleaner!",
      "text": "Works really well! We have hardwood floors and during the wet/rainy season, we're always leaving footprints, including the animals. Since we got these rugs, our floors look much better! I'd highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathie R.",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "I wish it was bigger",
      "text": "It works ok, but I wanted it use it for my big dogs. The mat is quite small where they often step over it making it not as useful. Take the measurements provided and measure it out in front of your door and decide if this is the mat for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard Puski",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "works well to wipe shoes off at the door",
      "text": "I washed it and put it thru the dryer, as instructed. It washed well, no problems. I have it at the front door. It really does work to clean off shoes. And - my cat enjoys curling up and napping on it. Win-Win!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth T. Shapiro",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Not perfect but a major improvement to muddy paws on my kitchen floor!",
      "text": "Not perfect but so helpful! I have 4 Jack Russells that love mud season! I followed the instructions and washed without detergent and hung dry.this Matt was put to the test during the last Nor’easter,not even perfectly dry yet.What a difference, still some very light paw prints on my floor ( not many) would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "angelika c fieseler",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "The colors are GREAT for hiding dirt",
      "text": "The colors are GREAT for hiding dirt. It has not yet rained since I finally got them unpacked at the new house, but I am anxious to test them. Follow the instructions to wash/dry them before putting them out. They do NOT slip and stay in place. So far, I like them!",
      "rating": 4.0,
      "verified": true,
      "author": "Jody G",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Just a mat.",
      "text": "I bought this back in Jan 2018 and washed it as instructed. I put this mat at my backdoor where we get the most traffic hoping it would reduce the amount of dirt and mud tracked in by the dog and kids, but it doesn't work as well as I'd hoped. Even after the kids walk on the mat, and into the house, I find dirt tracks everywhere. The \"non slip\" on the back doesn't work on my floors as I can barely tap the mat with my foot and it slides across my hardwood floors with ease. It is nice that it's machine washable though.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca M. Trimm",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Different from what as expected",
      "text": "I expected the material to be a rough, plastic-like material that could easily get the mud and dirt off of shoes. Turns out the material is much softer and doesn't wipe the shoes nearly as well. It also moves around a lot when you wipe your feet. Definitely not was was expected.",
      "rating": 1.0,
      "verified": true,
      "author": "Elliot Snider",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "It’s just OK",
      "text": "It’s OK. It’s smaller than I expected, but my fault. I should’ve measured. I wouldn’t say it’s fabulous like the description states. It did not shed in my washer or dryer, so that was good.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Harper",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "This doormat is exactly what I was looking for. ...",
      "text": "This doormat is exactly what I was looking for. I have one by the front and back doors to my home. The brownish tan color is neutral and matches nearly any decor, and the mat functions well. I especially appreciate the low profile.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hofelich",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Absorbance of wet shoes from rain.",
      "text": "They are incredible - be sure to wash them first and tumble dry - follow the directions and they will be amazing! Great product and fast shipping! I use them in front of all exterior doors!",
      "rating": 5.0,
      "verified": true,
      "author": "Randall L Swanson",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "I love this rug",
      "text": "I love this rug! It really keeps a lot of the outside dirt and other things off of my floors. I have hardwood tile and hardwood floor. The runner that I had did nothing but track more particles on to my tile and hardwood floor. I am buying a second one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Jody's Girl",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Good for the price",
      "text": "I read through a ton of reviews before buying this. The mat definitely does its job, stays in place, and collects the dirt/pebbles/etc from our shoes. The only downfall is the neverending amount of fibers that this thing loses. Good overall though.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "These things rock... and mud...",
      "text": "These mats are the bee's knee's, best mats I have ever used. Pretty sure you could throw then in one of the great lakes and within a few minuts all ythe water would absorb into them. They hold tons of dirt mud and clean your shoes as good or better than any mat I have used.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Really work",
      "text": "Really work - good looking - easy care instructions. Wish there were some for outdoor use as well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Macisco",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "Now they tell me",
      "text": "This 18\"x28' mat was purchased for $27.99 and a week later is priced at $34.99. I just received it and learned I must wash it first, to activate the absorbency feature. This is not the kind of bother I expect from a small floor mat, shedding and all. It may well function ok, but its larger predecessor was cheaper and had no such requirements.",
      "rating": 2.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "This is a very great product only wish they would make it in larger sizes for the larger dogs",
      "text": "This is a very great product only wish they would make it in larger sizes for the larger dogs",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Groves",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Seems to work",
      "text": "So far so good. Little smaller than expected but seems to work well",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lucas",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Good quality and effective",
      "text": "Liked the doormats very much. They are good quality. Would like to see more colors selection.",
      "rating": 5.0,
      "verified": true,
      "author": "HipsterChica",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Somewhat works",
      "text": "I had hoped for better results. It helps with some of the mud tracked in, but plenty still gets by. Also, do not wash in your own washer, take it to a laundromat. It sheds fibers like crazy, and you have to wash it and dry it to activate the absorption, according to the instructions.",
      "rating": 3.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "So far it seems to be pretty sturdy, stays in place really well",
      "text": "It keeps out a lot of the dirt my 2 little dogs bring in the doggie door. I thought it would prevent the muddy little foot prints they bring in after the rain but it doesn't. So far it seems to be pretty sturdy, stays in place really well.",
      "rating": 4.0,
      "verified": true,
      "author": "Princess me.",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Looks Very Plush",
      "text": "Even nicer than I expected. It lies flat, does not move, and accomplishes everything I wanted it to do. I have not washed it. It is very plush but the door moves easily over it when opened. I would buy this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "jmr",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "A little messy the laundry ( excess lint) but they was and wear beautifully. Durable and effective",
      "text": "I used these in my motor home for years and now living on the water, I knew we needed these to catch the crud before it got tracked into the house. A little messy the laundry ( excess lint) but they was and wear beautifully. Durable and effective! I want one in a larger size for the front entry",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Burkhardt",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Should have cost $8",
      "text": "I have owned this mat since January 20th. It was great for the first month or so. Now four months later I can say that this was not worth the $30. It performs the same function as well as a $10 door mat from Home Depot.",
      "rating": 2.0,
      "verified": true,
      "author": "Kin",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "It is not super absorbent like it states",
      "text": "These mats stay in place well, and they are very soft, but we are not impressed with the product claims. It is not super absorbent like it states, and it’s not even as wide as the door. Too small for the front and back door like it is advertised for.",
      "rating": 2.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "I like the color and size of the rug",
      "text": "I like the color and size of the rug. While it captures wet mud, a lot of dried dirt still does not get trapped. My husband is in construction, and comes home with dirty boots. I still have a lot of dirt on my floor",
      "rating": 3.0,
      "verified": true,
      "author": "MBanti",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Sheds and does not absorb mud from shoes",
      "text": "I have tried this product for a while now and have two. This product sheds a lot and leaves strips of fibers everywhere. On top of that, it does nothing for absorbing moisture, especially off of shoes in winter. Tried washing them and even then if you have wet shoes from outside the fabric doesn't absorb very well and I track mud into the house. Will be looking at other door mats to see if they work.",
      "rating": 1.0,
      "verified": true,
      "author": "Deirdre Pendleton",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Falls apart when washing",
      "text": "The mat sheds the fabric when washed. It now doesn't look good and got fibers all over my light colored bath mat that were very hard to get off.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Is not the miracle mat in the video.",
      "text": "It does not perform as good as the video. It cleans your feet somewhat. The true test was the plumbers tracking muddy water in and out of my house for hours. When they were done there was standing water under the mat.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Mat is not working as advertised in the video",
      "text": "Not as advertised, not at all, not even cleaning your shoes repetitively you’ll get the results shown in the video, and I followed the instructions washing it previous to use, very disappointed, good thing is I only bought 2, I was going to buy 4 based on the results shown in the video but fortunately I didn’t and I’m glad for that decision, would’t never recommend buying this mat",
      "rating": 2.0,
      "verified": true,
      "author": "Pablo G",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Great mats, I wish it were bigger",
      "text": "I love these mats, I gave it 4 stars because, I would like it to be bigger. They are smaller than I expected. The do a wonderful job for it's purpose, keeping dirt in the mat and not tracked in the house.",
      "rating": 4.0,
      "verified": true,
      "author": "CHosey",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "it does a better job trapping dirt and water than the average mat ...",
      "text": "Just ok, it does a better job trapping dirt and water than the average mat (maybe), but does not preform as advertised (pictures with the mud...), plus its kind of small... Not bad, but not excellent, probably won't buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew Peterson",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Don’t buy if you have a bigger dog or a lot of mud",
      "text": "It works sometimes but definitely not made for a bigger dogs they walk right over it . The rug is way too small and you have stand on the rug for a couple seconds then step off it sometimes it works and sometimes it doesn’t .",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180127
    },
    {
      "title": "CUSTOMER SERVICE",
      "text": "GREAT RUG--FAIR PRICE--GOOD QUALITY AND GREAT CUSTOMER SERVICE--SELLER EMAILED ME TO TELL ME TO CONTACTHIM IF I HAD ANY ISSUES---NICE TOUCH--WILL BUY AGAIN FROM THIS SELLER---THX",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Love This Mat...",
      "text": "Love this mat. It works so well grabbing the dirt from my rain boots and my dog’s paws. It helps cut down tremendously on both wet and dry grit and grime that is so easily brought into the house. Also, (bonus) it did not shed as badly as I expected after the first wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Five Stars",
      "text": "Love the color and density. Absorbs all the wet shoe crime.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Acker",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "Very soft and absorbent",
      "text": "I purchased two of these mats and I am very happy with them. One I have leading out doors with a pool and is very helpful absorbing the water as people walking in. They are very soft to walk on. I highly recommend these mats",
      "rating": 5.0,
      "verified": true,
      "author": "Jewell N.",
      "helpful_votes": 0,
      "publication_date": 20180706
    }
  ],
  "product_meta": {
    "title": "BEAU JARDIN Indoor Super Absorbs Mud Doormat 28\"x 18\"Latex Backing Non Slip Door Mat for Small Front Inside Floor Dirt Trapper Cotton Entrance Rug Shoe Scraper Machine Washable Carpet Brownish Tan",
    "description": "Size:1Pack| Color:Brownish Tan\n\nSpecifications:\n\nDimensions: 18\" in wide x 30\" in long\nMaterial: 55% cotton + 45% microfiber\nBacking material: Latex backing\n\n\nSuper absorbent fibers:\n\nThis material with our dirt trapper technology allows home or office floors to stay clean and dry! Our quality floor mats help maintain your carpets and floors by preventing muddy, rain, snow, slush and sleet footprints and stains from ruining the look and finish.\n\nGreet your guest with style:\nGreat for entrances, doorways, kitchens, conservatories, back doors, garage and even caravans. Suitable for all kinds of home styles, you will be able to find one that is just right for your home year round or swap out for a seasonal design.\n\nDurable and Non-Slip:\nLatex backing and is capable of withstanding harsh conditions. The non-slip backing will stop the mat slipping or rucking when used and keep you safe by preventing unwanted falls.\n\nLow profile:\nLow profile design is thin enough for your front door, doesn trap the door.\n\nMachine washable:\nThe advantage of the Dirt Trapper mat is it withstands washing at 30 degrees.\n\nOne year guarantee:\nWe have a one-year guarantee for return or replacement. If you are not totally happy with the purchase, return it hassle-free for a full refund.\n\nNote 1: It is not suitable for the bathroom, some wet or watery place.\n\nNote 2: Mashine wash in cold water without detergent or fabric softener, some shedding of fibers will occur in first washes.",
    "rating": 3.9,
    "feature_bullets": [
      "55% Cotton",
      "Made in the USA or Imported",
      "ABSORBENT FIBERS: Scrap off dirt, water, dust, grit, mud, slush, sleet, grass or rain, snow and absorbent moisture from shoes instantly, keeping floors clean and dry. What it most excels at is wet feet. eliminates dirty wet foot prints on tile, hardwoods and light carpet after you walking across a wet driveway or deck before entering the house. If you have lots of mud on your shoes in rainy day, please rub your shoes a few more times.",
      "INDOOR MAT: Measures 18\" x 28\",4/5 inch thick. Heavy duty entrance rug carpet widely used for home decor, indoor front welcome mat and kitchen rug, floor mat, bedroom, back door, laundry, living room, garage, office, industrial, commercial deal with high traffic inside. It also can be cut easily to your customized size to fit your specified area.",
      "NON-SLIP ON DRY FLOOR& LOW PROFILE: Non-slip Latex backing on dry floor won't slip or scuff floors. Low profile design so doors won't get stuck. Durable and the edge won't get curved. Perfect for homes with pets dogs cats or kids.",
      "EASY TO CLEAN: Machine Washable or just shake or hose off with water. Please note machine wash in cold water on a low agitation cycle without fabric softener, some shedding of fibers may occur in first washes or use, we suggest you vacumm the doormat prior to first use and washing.",
      "CUSTOMER CARE: We are dedicated to provide premium products for you and offer impeccable customer care to you. Don’t wait any longer and just enjoy your ideal products today!"
    ],
    "specifications": {
      "Product Dimensions": "28 x 18 x 0.6 inches",
      "Item Weight": "2.63 pounds",
      "Manufacturer": "B&G Beautiful Gardener",
      "ASIN": "B072WRDNNW",
      "Customer Reviews": "3.9 out of 5 stars1,133 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#27,129 in Industrial & Scientific",
      "Is Discontinued By Manufacturer": "No",
      "Fabric Type": "55% Cotton",
      "Is Assembly Required?": "No",
      "Warranty Description": "Refund or replacement within one year are guaranteed!",
      "Batteries Required": "No",
      "Import Designation": "Made in the USA or Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Industrial & Scientific",
      "Janitorial & Sanitation Supplies",
      "Floor Mats & Matting"
    ],
    "price": ""
  }
}