{
  "website_summaries": [
    {
      "verdict": "A cheaper pair of behind-the-head earmuffs that's still comfortable and easy to wear.",
      "pros": [
        "Despite the lower price tag, these earmuffs are well built and fit a range of head sizes",
        "They fold up easily and cover the entire ear"
      ],
      "cons": [
        "The fabric is not of the best quality"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great value for the price",
      "text": "This will be my third winter wearing these earmuffs. I am surprised that they have lasted as long has they have, considering the price. I originally purchased these earmuffs for ocean fishing, the wind tends to hurt my ears. I now however take them with me everywhere, they are my go to ear protection while fighting the cold weather. The earmuffs are very basic, light weight, they contour to my head, and don't slip off, and I find them very comfortable. They are however not fleece, but more of a velvet feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel K.",
      "helpful_votes": 54,
      "publication_date": 20191113
    },
    {
      "title": "Does not dissapoint",
      "text": "When I saw this product on Amazon, I had low expectations. I thought this ear warmer was going to fall off and be thin as a piece of paper. I WAS WRONG! When I first received this product, the packaging was great with no damages. I opened it up and immediatly put it on my ears to see how well this would work. After walking a bit outside, my ears did not get cold! I use it almost everyday in the winter to counter the cold air of fall and coming winter. Compared to regular ear warmers that go over your head in a headband form, this product simply does not fall off!",
      "rating": 5.0,
      "verified": true,
      "author": "hz",
      "helpful_votes": 50,
      "publication_date": 20191022
    },
    {
      "title": "Comfortable and simple, just what I wanted",
      "text": "I wanted to find a good pair of earmuffs that would be sleek so I can wear them to work and still look professional. Also wanted them to be compact so I could throw them in my bag. For the price these cannot be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Montoya",
      "helpful_votes": 54,
      "publication_date": 20190914
    },
    {
      "title": "Really large warmers that get the job done!",
      "text": "Great item! Definitley keeps the ears warm. Pros: I have used in subzero temperatures and they kept everything warm. The sound holes are a great feature. You are able to hear everything around you. Also, they are pretty large, they cover a good portion of your cheek! Cons: Because of their size, they feel odd at first. But got used to it eventually. Another slight issue about these is that they are not actually foldable.. Although they do somewhat reduce in size when not being worn, they do not actually fold which makes them a bit difficult to store away. All-in-all, a great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Ramon",
      "helpful_votes": 10,
      "publication_date": 20180102
    },
    {
      "title": "Great quality",
      "text": "Purchased these for my husband and daughter to wear on a February trip to Oklahoma to tour a college. As a Florida girl my daughter had never experienced weather below 50 degrees, so she didn't feel the need for these. She was VERY happy to have them for her tour!!! They kept her ears warm and toasty and didn't mess up her hair! My husband also liked them and commented that he wished we had these when we lived in Michigan.",
      "rating": 5.0,
      "verified": true,
      "author": "OrlandoMom",
      "helpful_votes": 3,
      "publication_date": 20191012
    },
    {
      "title": "Best buy muff!!",
      "text": "Nice and comfortable earmuffs. Soft on the ears and larger than most (the part covering your ears). Wear these everyday for hours. Hint for better fit, the ear pieces tend to curve and not fit flat on the ears. If you grab the fabric on the headband and pull the inside fabric so it’s a little folded over the outside fabric, the earmuffs fit much flatter on the ears. I bought two of these because I lost one. Great buy! My review is honest and I was compensated to be compelled to leave a review. This does not change my opinion",
      "rating": 5.0,
      "verified": true,
      "author": "technodude",
      "helpful_votes": 2,
      "publication_date": 20190223
    },
    {
      "title": "I'm glad I bought these earmuffs!",
      "text": "I regularly have to take the bus home from the hospital where I volunteer - and the Midwest winter is not kind when you have to stand outside for 20-30 mins at a time. I've got a great warm hat, but it always rides up leaving my ears exposed (and freezing). These earmuffs are the perfect solution! Connector in the back keeps it right where it needs to be when my hat is on and my ears stay toasty and warm. A great product and I would definitely buy them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Donaldson",
      "helpful_votes": 43,
      "publication_date": 20191113
    },
    {
      "title": "Too big; Bad product",
      "text": "I should have listened to the negative reviews...not sure how it got so many positives. These things are HUGE!! Way too big to fit a normal persons head. The actual “muff” part is what is oversized. They not only cover my ears, but half my face when I put them on. And they don’t do a great job of covering my ears at that. There are huge gaps between my head and the muffs due to whatever plastic is holding their shape. I got these for friends because I thought the sound hole was cool... and it’s a little embarrassing. I wish I’d spent a little more for a better product.",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmin K",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Moderate fit, moderately warm",
      "text": "I wanted these to fit under the helmet straps when I ride my bicycle in cold weather. I usually ride until there is the possibility of ice on the road, but below 45 degrees, my ears need some insulation. I had another, but it disappeared since last season. This fits similar, adjusts poorly, and sin't as warm. I have no idea what the small brass screen on each side does, since it doesn't seem to do anything.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Poorly made the second time around",
      "text": "This is the second pair I order but the first pair was good quality. The ear part filler was well patterned and I was happy with the product so I ordered another one. This second pair is thin and I can feel the wire and seems flimsy. Not sure what the heck happened but I was not happy with the product the second time around. If this is how they are being made...I do not recommend anyone purchase this product. ☹",
      "rating": 1.0,
      "verified": true,
      "author": "es_consumer",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Kept me warm",
      "text": "I was looking for an affordable quality earmuffs and found this. A perfect one for my need. Very durable using this for almost 2 years now.",
      "rating": 4.0,
      "verified": true,
      "author": "JKesika",
      "helpful_votes": 49,
      "publication_date": 20190526
    },
    {
      "title": "Awesome Ear Warmer with Great Comfort",
      "text": "Actually, I ordered this ear-warmer for my wife last December (2018). Its fits her ear nicely and does what it is expected out of it. Of course, I used these few times as well, and it work well for me too, as it says Unisex. Especially, we use it even now in summer during rain/drizzle that happens once or twice in a week. My wife and I get cold and allergy when exposed mild rains and this one helps in a big way with intermediate rainy days in summer avoiding exposure. Overall a Great, and I am recommending to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Ganesh. G.",
      "helpful_votes": 47,
      "publication_date": 20190520
    },
    {
      "title": "Cheap.",
      "text": "They are made of more cheap materials. It doesn’t really protect your ears or stay on your head as I expected them to. I have yet to use them bc just trying them on they kinda sat on my ears and were left unprotected from the elements. I’m going to have to look around for a real pair that can actually cover and protect my ears",
      "rating": 2.0,
      "verified": true,
      "author": "StephN",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Broke eventually",
      "text": "Broke after a few months. The boning snapped as i put it on. I don’t think I pulled on it particularly hard, just enough to fit my head (which is also not particularly large), must not have been very sturdy. I’m giving 3 stars because it was nice while it lasted.",
      "rating": 3.0,
      "verified": true,
      "author": "Aly M",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Keep your ears very warm",
      "text": "I would have given them a 5-star rating if they folded up enough to fit in my pocket. I’m a little spoiled from wearing Ear Grips in the past but these serve the purpose of keeping my ears warm and they’re really cute and significantly less expensive than Ear Grips.",
      "rating": 4.0,
      "verified": true,
      "author": "KatieB",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Warm and comfortable",
      "text": "I don’t like wearing hats Because my hair doesn’t recover but my ears get cold. This is a good alternative and comfortable to wear. It doesn’t go flat for sticking in your pocket so you have to deal with it if you go somewhere and have to take it off",
      "rating": 4.0,
      "verified": true,
      "author": "E. Welch",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "GIGANTIC",
      "text": "These are gigantic, way too big for a normal persons head (and I even have a particularly large head). They're awkward and seem pretty chintzy. I wanted to return them but the cost of return shipping is more than what I paid for the item. Oh well...",
      "rating": 1.0,
      "verified": true,
      "author": "StephanieA",
      "helpful_votes": 2,
      "publication_date": 20180411
    },
    {
      "title": "Warm and Soft",
      "text": "We live in Florida and had to travel to Chicago last Winter. We were very happY to have purchased these ear warmers. The Windy City is well named and wind and freezing temperatures mean you need to protect your ears. These comfortable ear coverings did the trick! 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Welch",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Great Product",
      "text": "Bought these for my husband. He wears them whenever it's cold. He has a really large head (like struggles to find stuff the fits his head kind of large) but has jo problems wearing these. He loves that it can be slick with is work dress clothes too.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany B.",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "snug, comfortable and soft",
      "text": "Nice ear warmers! Snug-fitting and comfortable. I have been using them for a while and sticking them in a backpack and even sat on them accidentally, but the spring inside is intact, still holds well. They are also machine-washable and dry fast and don't change their form. Good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Alina Kiryayeva",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Good Muffs - but not as durable as the foldable ones",
      "text": "I was initially pleased using these muffs. One of the kids got a hold of it and bent it in and out. No matter how much I tried to bend it back into place, it never quite hugs my ears like it should. With proper care it would probably serve you well.",
      "rating": 3.0,
      "verified": true,
      "author": "TZ",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Pretty good item",
      "text": "As someone who hasn't worn earmuffs/warmers since I was a kid, comfort was what I was most interested in. This is a really great item to have as part of your winter gear. They are extremely comfortable, both directly on my ears and over my beanie or 2-piece ski mask. They fit just right around/over my head, so there is no annoying movement. This is particularly a plus when I'm driving. I haven't used the built-in phone receiver to comment on that feature. I bought this item primarily to stay warm, not to be on my phone. All in all, I would buy this product again for myself and gift it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber E. Rendleman",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Warm and cozy!",
      "text": "I’m a teacher in Wisconsin and I have recess duty every day, so I need something warm for my ears! I usually wear a ponytail, so I didn’t want a hat. This is super soft and comfy and keeps my ears very warm. It’s not big or bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "K-Dub",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "I Wear Them Every Day",
      "text": "Unfortunately, I live in North Dakota where winter exists for 8 months out of the year. Fortunately, I purchased these earmuffs and I no longer have to worry about my ears falling off from frostbite. Aside from keeping my ears safe from the harsh winter wind, they're fairly soft and cozy; sometimes I forget to take them off even when I'm not outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Morales",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Great way to keep your ears warm.",
      "text": "We have used ear warmers for many years, but last year we lost 2 pair. These Items are also getting harder to find in stores, so we ordered from this seller and were very pleased. We received our order promptly. We were surprised by how much better these were than the ones we've had in the past. With the fleece, they are softer and warmer - very comfortable. An added bonus was that the packaging was outstanding, perfect for gift giving. I would love to see these stuffed in my stocking!",
      "rating": 5.0,
      "verified": true,
      "author": "Hal Roth",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Not Comfortable Fabric",
      "text": "The ear warmers fit but aren't very comfortable. The fabric that touches the ears is cheap and rustles quite a bit. It feels like a candy wrapper is pushing up against my ears. Are they made from recycled newspaper?",
      "rating": 2.0,
      "verified": true,
      "author": "MrMr",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Love these!",
      "text": "These are very nice as I have tried wearing winter hats and headbands and they always gave me a headache. These I can wear for hours and my ears stay nice and warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Jennerman",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Perfect and comfortable.",
      "text": "My daughter teaches figure skating and the rink is quite cold. These keep her ears warm, without having any plastic to pull at her hear. She loves them and says they're quite comfortable too.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy de Leyer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Replacement",
      "text": "Lost my old earmuffs and thought the picture looked pretty similar but not the same. The portion that fits over the ears is way too big and lets air circulate under and around ears. Perhaps they are meant more for a man?",
      "rating": 1.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Comfortable to wear and great value!",
      "text": "The earmuffs are soft and comfortable to wear and are very good value. I like the behind the head earmuffs and these are large enough to cover the ears comfortably. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne T. Schroeder",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Soft and comfortable",
      "text": "I just wore these earmuffs this morning. They are soft and comfortable and stay in place. I’m sure I will use them all winter. The only thing that would make them better is if they were a little smaller.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Symanski",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Nice ear warmer",
      "text": "Fit is great, warm and comfortable! I walk a lot and these keep my ears nice and toasty. They are a bit big for me, but then I have a really small head. So if you have a normal size head they would fit perfectly. I still wear them whenever I'm out for my walks, and they do an excellent job at keeping me warm.",
      "rating": 5.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Great Earmuffs!",
      "text": "I purchased these earmuffs for my dad as a Christmas gift. He absolutely loves them and they are hands down the greatest when on a motorcycle. They are not in the way of a helmet or hat, comfortable, tight fit and very warm!! Will purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra DeVictor",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great product and worth money!!",
      "text": "I have been using this product since last two years in the Minnesotan winter. This is one of the best product I used for ear warming, it really gives you warmth for ears. After use you can scroll the product and place it in your jacket pocket. It is a great product worth money. Will recommend this for friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Too big and slide off",
      "text": "These were a waste of money. They do not stay on your head, they just slide down. Also the ear part is huge and takes up half my cheek. Not giftable as they look like dollar store brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "nice ear muffs",
      "text": "have not have earmuffs since I was a kid but glad bought these . very comfortable and soft you can hear just fine with them on and they even keep your neck warmer.",
      "rating": 5.0,
      "verified": true,
      "author": "John WenzelburgerTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "snug fit",
      "text": "I've been wearing these type of earmuffs for years....don't go out without them in Michigan's crazy fall/winters. Fit snug, they're warm. will continue to purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "P. shipley",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Falls off easily",
      "text": "This doesn’t stay on my head. It falls down because it is too big. I don’t know who they were thinking this would fit but it is for someone with a really really big or wide head",
      "rating": 2.0,
      "verified": true,
      "author": "Maquillaje by Mollie",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Don't waste your money on these.",
      "text": "These were terrible- I wear ear warmers daily in the cold weather. My mom is a quadriplegic and sensitive to cold so I wanted to get her a pair. They were cheaply made and the base that goes around your neck was misshapen and wide so the muffs did not sit snugly over the ears. I did try to bend them so I could at least wear them, but the metal was too firm. I had to discard them. These will only fit you if you have a wide, square neck. I ended up spending the extra money and buying her a pair of \"180's\".",
      "rating": 1.0,
      "verified": true,
      "author": "Nurse G",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Exactly what I needed for running",
      "text": "I hate wearing hats or headbands when I run but my ears freeze immediately if it’s the least bit chilly so I was looking for an alternative. These are SO soft, low profile and comfortable. I worried they would feel too tight after wearing for a bit but I’ve been very happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "christopher gomez",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Very large",
      "text": "I was surprised that these ear muffs were so large. I have already returned them. They must have been about 4-5 inches in diameter. And they weren't adjustable - so they were too large for my head.",
      "rating": 1.0,
      "verified": true,
      "author": "Elaine Cunningham",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Love these!",
      "text": "Very comfortable ear muffs. Kept my ears warm during the winter when it was in the single digits. And because of the protection, I didn't get sick at all this past season. I never left home without it!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Mac",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Good quality earmuff for the money!",
      "text": "Great product and well worth the money! Earmuffs are large enough to cover ears fully and are built with material that lasts! Would recommend to anyone looking for a good quality earmuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Ds",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Too short. Didn’t cover my ears",
      "text": "Wouldn’t recommend to purchase or gift. I would have been nice to have the capability to stretch. It couldn’t cover my ears. I’m 5 ft! I think it for a child. Not an adult.",
      "rating": 1.0,
      "verified": true,
      "author": "Annie Gravelle",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "She absolutely loved it! Our winter consisted of weather where it ...",
      "text": "I bought this as a christmas gift for my mother who always complained about cold ears during the winter. She absolutely loved it! Our winter consisted of weather where it was usually -10 F - 20 F. I tried them on myself and the inside is very soft and comfortable to wear. They do not look ridiculous at all! This is coming from someone who cares if they do look ridiculous or not, lol. Don’t hesitate to buy them!",
      "rating": 5.0,
      "verified": true,
      "author": "Odalis",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Most comfortable and soft ear warmer’s ever!!",
      "text": "Most comfortable and soft ear warmer. They lay flat so no bulging also, not heavy at the same time. Goes well with all winter wear. Been using it for a while now and have no complains. Will highly suggest to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Kittu M",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "They’re perfect!",
      "text": "I got these for my boyfriend, who gets cold very easily, ESPECIALLY his ears! He now wears these ALL the time and he absolutely loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "Krissy",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Didn’t work for me",
      "text": "Unfortunately they didn’t fit me very snuggly. They would not stay in place. I had to return them. I’m a smaller woman so the unisex sizing just didn’t work. The look and feel was fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Dmiller",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "These are much better than the flimsy folding ear covers I was using ...",
      "text": "These are much better than the flimsy folding ear covers I was using before. Large, so protects more of your ears from cold wind. The holes in the center really helps you hear without letting wind in. Can carry a conversation on a walk in the cold.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Tracy",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Comfortable and warm",
      "text": "I love having these earmuffs on when I walk during the winter. They are so comfortable I hardly remember I am wearing them but my ears stay toasty warm.",
      "rating": 5.0,
      "verified": true,
      "author": "KCinKansas",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "great earmuffs",
      "text": "Great ear warmers. Have had them for almost two years now. Only minus is that they are a bit hard to store (the metal isn't bendable) but otherwise great earmuffs.",
      "rating": 5.0,
      "verified": true,
      "author": "Poe",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Very comfortable and warm.",
      "text": "These are very comfortable and covers my ear completely in are very warm. I've been looking for something that doesn't mess up my hair . They work perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Kept Our Ears Warm But...",
      "text": "They kept our ears warm but man are these things huge. They just look goofy. I've always seen the smaller ones and they just look so much better. They also don't collapse or fold up very flat. Decent for a one time use I guess but nothing I'd carry in a jacket pocket for regular use.",
      "rating": 2.0,
      "verified": true,
      "author": "blubusdrvr",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "they should come in different sizes",
      "text": "The possibility of earmuffs that don't flatten down my hair was appealing. But these are too large for my somewhat small head/neck & don't stay in place. I am unlikely to use them unless totally desperate.",
      "rating": 2.0,
      "verified": true,
      "author": "Marjorie",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Nice earmuffs, but a little too big for me",
      "text": "Warm, fuzzy and quite comfortable; however, despite being \"unisex,\" they're a little too big for my petite woman head, despite bending the wire this way and that to get them to fit snugly. They fit my husband perfectly, though. I'll continue to fiddle with them to get the best fit.",
      "rating": 4.0,
      "verified": true,
      "author": "idgie57",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "You get what you pay for.",
      "text": "They were humongous and did not block the cold air. They also slid off my ears constantly. I eventually wrapped my scarf around my ears and threw them in the next bin I passed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bridget",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Not compact",
      "text": "Ehh, not particularly high quality and doesn't fold down compact at all. These are big, like unnecessarily big and they won't stay folded so they are huge in your pocket or bag when not being used. While in use, they are fine I guess but still not great.",
      "rating": 3.0,
      "verified": true,
      "author": "Humphrey",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "They are very large.",
      "text": "These ear muffs are designed for skiing and outdoor sport use. I prefer smaller one for working in the outdoors. Really nice earmuffs however.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Pitts",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "I did not find this product satisfactory.",
      "text": "This ear muff was not a satisfactory product for me. It was too big, I could not make it smaller to fit around my head. It was very lightweight, no body/heft to keep the wind out.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue D",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Great Ear Warmers",
      "text": "Bought multiple sets and they work like a charm. All family uses to keep warm in the bitter cold weather. Product works great... 2nd season with no issues",
      "rating": 5.0,
      "verified": true,
      "author": "E. D.",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "HIG ear warmer unisex classic",
      "text": "Warm and I like the material and the slim line style vs the puffy fat ones, the earpiece is large covers all the ear, they are not adjustable or as snug fit as I prefer, but not bad, kept as a second pair to keep in the car. Might be big for a small person.",
      "rating": 4.0,
      "verified": true,
      "author": "Hi-lo",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Decent",
      "text": "I’m not the happiest with this. There is a crunchy sound due to what ever material they used. Quality is eh. But for the price you get what you need. It was a little large for me but for someone with a larger head- worked great",
      "rating": 2.0,
      "verified": true,
      "author": "A. Castillo",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Warm ears!",
      "text": "Comfortable, stay in place well. I can place them over the top of my head or around the back of my head. Do a good job of blocking out the wind and still allowing sound.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Miles",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "They stay up!!",
      "text": "I have used these several times, and I love them!! They stay up and really do keep your ears warm. Ponytails and beanies are a bad combination . . . these are the perfect solution :)",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Arnold",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Keeps the wind out.",
      "text": "They are nice, but they are large, and shift around. My neighbor has the same problems with hers, but they do keep the wind out.",
      "rating": 4.0,
      "verified": true,
      "author": "Blessedandcontent",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Amazing Earmuffs",
      "text": "I got these earmuffs and I am so glad to get a pair. They are easy to carry and easily curl to put away when not in use. The earmuffs go snuggly on when you are in a hurry and keep you warm on those days that the cold weather is not letting up. I highly recommend to anyone looking for a replacement. A must buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Plase",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Fit is great, warm and comfortable!",
      "text": "Fit is great, warm and comfortable! These are very nice ear warmers. I am a 200LB + man, they fit me an my petite girlfriend as well.",
      "rating": 5.0,
      "verified": true,
      "author": "David Armon",
      "helpful_votes": 2,
      "publication_date": 20180119
    },
    {
      "title": "Works well.",
      "text": "They clasp tightly enough to stay on well but not uncomfortably so. Occasionally the forward edge will tingle but that's rare and doesn't last long. The round part is very large which is their way of making sure everyone's ears are covered no matter what the head size. Wind resistant and warm.",
      "rating": 4.0,
      "verified": true,
      "author": "Harborseal",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Warm and comfy! Perfect fit!",
      "text": "Adjusts to fit. Very warm and comfy. I have since ordered more. I keep one in the car and one in the house and one for my husband. We love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Bugs Bunny",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Pleasantly suprised",
      "text": "I was surprised that the muff part is much larger than anticipated. Pleasant surprise though. About twice the size of regular muffs.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Decent ear warmers",
      "text": "I like these, they sit on my ears correctly, they are adjustable which is nice, they are very soft and keep my ears warm.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Vrba",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Not flexible and very big",
      "text": "These indicated that they were foldable, but they are not. The are very inflexible and uncomfortable. No adjusting id possible. The ear pieces are HUGE! Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheryl M. Schneider",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "works great and soft",
      "text": "these stay on really good and are very soft and warm bought 2 pairs and they work both on my head with hair and my husbands with no hair",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Poor quality",
      "text": "These are cheaply made, not at all comparable to the brand name ones. They do not fit well (only tight against your ears on the top, not the bottom), and do not feel that warm. They are also much bigger than the brand name ones.",
      "rating": 2.0,
      "verified": true,
      "author": "Mich",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Great ear warmer",
      "text": "Great ear warmer. It's comfortable and soft - necessary qualities of a good ear warmer. For the price, it's hard to beat. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "John L.",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Comfortable and attractive.",
      "text": "Have ordered these on two occasions for a friend who couldn’t find something similar locally. She was well pleased with them. They were very comfortable and effective. They are also very attractive, light and come in many many colors. Excellent option for those who don’t want to wear a hat over their hair.",
      "rating": 5.0,
      "verified": true,
      "author": "PB77",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Too large, Too comfy",
      "text": "The ear muffs engulfed my face. The plush fabric was so soft and warmed me up, but I was sad that it was too big for my head. No matter how often I adjusted them, they tried to eat my face. Stick it just right and the band stuck out too far and the muffs worked their way back to where we started. I gave them to a friend who they fit just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecky",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Cheap foam",
      "text": "Super cheap material. Not worth the purchase. Even if they were for sale for a dollar.",
      "rating": 1.0,
      "verified": true,
      "author": "Lane",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "They are warm and feel very good but they are rather large",
      "text": "Received on time. They are warm and feel very good but they are rather large. I should have gauged it looking at the product pictures. They also have a weird chemical smell. I almost wanted to return them but refrained from doing so because they were very inexpensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "more than worth the price!",
      "text": "I LOVE these ear muffs!! They are so soft and comfortable! I really like how they go behind your ears instead of on top of your head!!!",
      "rating": 5.0,
      "verified": true,
      "author": "pjnlmt123",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Not very comfortable",
      "text": "The product is MUCH larger than they appear in picture. Unfortunately they were much too large and covered half of my face on each side which made them uncomfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Shaishanna Neland",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Awesome buy",
      "text": "Fits perfectly around my ears , is soft and warm not itchy, i personally can still hear people when they are talking to me when I have them on. Worth buying.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Parker",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "great to avoid losing my hearing aid",
      "text": "I lost a hearing aid last year while removing a tobaggon hat and thid fixes the problem and keeps my ears toasty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Warm ears... cool head",
      "text": "These ear muffs were perfect when I didn't want to wear a cap that would mess up my hair. Also stylish and comfortable. I recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Got to have it",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Poorly Made Garbage",
      "text": "Not sure where all these rave reviews are comng from, these are absolute junk. Bad stitching unraveling before I put them on, bent and misshapen, cardboard shavings in the bag. Amazon is becoming a sinkhole of lousy products cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "shteeve",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "They are ok",
      "text": "I love the concept of these but they are definitely not one size fits all. They are huge which makes them a bit awkward.",
      "rating": 3.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Warm and don’t mess hair up!",
      "text": "Ordered for my mom and she absolutely loves these. They are warm and as she says the best part is they don’t mess her hair up!",
      "rating": 5.0,
      "verified": true,
      "author": "spookers",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Great Earmuffs! Warm and Soft!",
      "text": "I love these earmuffs! They are warm and soft! My wife loves them as well, so I bought another pair! 5 Stars! highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Need earmuffs - buy these!",
      "text": "These are great earmuffs. Light, well fitting and warm. I've had more expensive ones, but these are every bit as good for way less money. YAH AMAZON.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "They are poorly made.",
      "text": "Worst earmuffs EVER! The material is cheap and definitely not worth the cost. After reading the reviews I had high hopes for this item. They do not cover my ears well at all, so keeping my ears warm is out of the question. These are dollar quality at best. I did not expect much but these are just ridiculous. Not happy at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "well made and I enjoy them inside and outside the house",
      "text": "Very warm, well made and I enjoy them inside and outside the house. If the tv is too loud for me, I pop them on and just right for both of us .. Plus my ears stay toasty warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Buttram",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Does the job.",
      "text": "Great price for this. Does the job keeping the wind and weather out of ears. Wearable with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "linda whittington",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Do NOT BUY",
      "text": "Don’t waste your time. Not adjustable, stiff and overall bad. Only reason I can think it’s an Amazons choice is because it’s cheap",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Huge and cheap",
      "text": "I ordered these for my son. They were huge and looked nothing like the picture. We returned them right away.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "love these earmuffs",
      "text": "We love these earmuffs and how they wrap around the back of your head and keep your ears cozy warm!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan the fan",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great for the husband",
      "text": "I have a small head and they didn't fit tight to my ears. I gave them to my husband and they fit him perfectly. He does snow removal in the winters and he wears these when he is working. He says they keep his ears warm and protected from the wind.",
      "rating": 5.0,
      "verified": true,
      "author": "Breezy",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Comfy!",
      "text": "Supper cute ear warmers. Love them. They keep my ears warm during this windy cold front we are having. Very comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Too big for my head and not comfortable.",
      "text": "These are earmuffs are too big for my head. I tried to wear them a few different ways to get them to stay on my head. They are not comfortable. I I've only wore them once due to them being so uncomfortable. I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "michelle",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "They keep your ears warm",
      "text": "These are soft and comfortable to wear, they keep your ears warm. They don’t fold up and aren’t super cute but they sure do keep you warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Sofie ",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great quality and price",
      "text": "Great quality for the price. I have been using it for a year now, no issues. Like it covers a large area and when I have it on, so no need to wear a hat. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "tsmile12011",
      "helpful_votes": 0,
      "publication_date": 20191007
    }
  ],
  "product_meta": {
    "title": "HIG Ear Warmer Unisex Classic Fleece Earmuffs Winter Accessory Outdoor Earmuffs",
    "rating": 4.1,
    "feature_bullets": [
      "✮SUPER COMFY AND WARM:This faux fur Earmuffs is super soft and comfortable, Perfect accessory for cold weather. Coddles your ears in fluffy softness.",
      "✮MULTI-PURPOSE: This earmuff is a great outdoor accessory, perfect for hiking, biking, skiing, Hunting, and all outdoor sports activities in the winter.",
      "✮One size fit most people, not easy to slip off. Perfect for winter accessory, ideal for both your family and friends.",
      "✮Warm and breathable, Strong steel wire shape of earmuffs stay put. The steel wire frame is fixed so that it is safer to use.",
      "✮After sales service: If you are not satisfied with our product, please contact us and we’ll give you a satisfied answer without any additional conditions. All issues will be solved within 24 hours"
    ],
    "categories": [
      "Earmuffs",
      "Women",
      "Accessories",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 7.99,
    "specifications": {}
  }
}