{
  "website_summaries": [
    {
      "verdict": "This inexpensive option lets you easily enjoy a mini \"campfire\" where a regular wood fire would be too risky.",
      "pros": [
        "Small and lightweight, it's easy to transport this anywhere you want to have a safe campfire",
        "Burns bright and gives off a good amount of heat",
        "Easy to light and extinguish",
        "Will burn for a total of about 4 hours"
      ],
      "cons": [
        "Gets very hot when lit, making it difficult to move after extinguishing",
        "Not refillable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome great heat convenient and easy cary only thing is ...",
      "text": "Awesome great heat convenient and easy cary only thing is I wish they would put a handle or groove when placing the cap back on its hard not catch a flame on the fingers ouch",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 83,
      "publication_date": 20180125
    },
    {
      "title": "Good for camping.",
      "text": "Size is good. It works well. Add wax as needed to keep it working longer. I would like to see wax in blocks offered for sell on same site. And a ceramic pot that it fits down into.",
      "rating": 4.0,
      "verified": true,
      "author": "Froggy",
      "helpful_votes": 63,
      "publication_date": 20180306
    },
    {
      "title": "Awesome product",
      "text": "Saw this product on Shark tank and bought it immediately. I am a campfire junkie. Sometimes I want a quick fire to sit by and have a cocktail. This is perfect. When you're done you put the lid on and go in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 51,
      "publication_date": 20180215
    },
    {
      "title": "Great for camping trips",
      "text": "Bought two of these to try out on a weekend trip up to Lake Hume in Sequoia National Forest. These worked amazingly well. Used only half of one the first night the rest on the next morning. Used the next one for the second night and before it was completely out toasted marshmallows to perfection. Watched the vid on how to stop the fire by placing the lid back on and worked every time. Cant wait for these to be back in stock as this is a must have for me on all my trips from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Mgonz",
      "helpful_votes": 65,
      "publication_date": 20170920
    },
    {
      "title": "Easy campfire",
      "text": "Great item. Used it on a camping trip at about 12,000 feet, after a long day of hiking. Worked great in rain (and some hail). Puts out a lot of light and is easy to manage (just put the cover back on) and is easy to light.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Wilhelm",
      "helpful_votes": 71,
      "publication_date": 20170804
    },
    {
      "title": "If you can’t have a fire pit/grill this ain’t a bad substitute!",
      "text": "I really like campfires and fire pits but I recently moved to a place where I don’t have anywhere to use/store a fire pit or outdoor grill. This product works out perfectly. Easy to light, generated heat, doesn’t smell or get smokey, and extinguishing is easy. I think after the flame has gone out it’s best to remove the lid so that the wax can cool quickly so you can move/store it. Takes about 30-40 min for wax to re-harden. When you extinguish you don’t have to fully replace the lid, just cover to snuff out flame.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Kyker",
      "helpful_votes": 25,
      "publication_date": 20180225
    },
    {
      "title": "Why didn't I think of this!!",
      "text": "WE LOVE THIS!! Had a small gathering last weekend and put the Radiate in the center of our outdoor coffee table (on top of a 12\" tile for protection) and it was a hit. Gives off the perfect amount of heat for a chilly evening and it creates quite the ambiance. I'm ordering more now!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Perry",
      "helpful_votes": 18,
      "publication_date": 20180301
    },
    {
      "title": "Really is amazing!",
      "text": "We used this for the first time on the beach and it was chilly. We were surprised at the warmth that radiated from this can of wax & paper! Ordered 4 more of these to keep in our RV!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180421
    },
    {
      "title": "These are perfect for a fire on the beach",
      "text": "These are perfect for a fire on the beach!! We roasted marshmallows for s’mores on the beach. We took a couple of potholder mittens with us to the beach so we could carry it back to the condo afterwards. It’s ready to go again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20180316
    },
    {
      "title": "Smoke anyone?",
      "text": "I had high hopes for this little portable campfire.. unfortunately it was just a black smoke machine that set me back $30. From what I could tell it was nothing but wax and cardboard, though it did have a pleasant aroma. Yes it’s portable but it’s quite heavy so don’t think I’ll be throwing this in a pack heading up K2. It burned for hours but with all the smoke it was like huddling around 5 tiki torches. Get me a clean burner and I’ll buy some more people.",
      "rating": 3.0,
      "verified": true,
      "author": "Dwight  Schrute",
      "helpful_votes": 8,
      "publication_date": 20180804
    },
    {
      "title": "Wow, I'm impressed!",
      "text": "We are finally trying this thing for the first time tonight, totally impressed! We arrived late to our campsite so we didn't get an opportunity to buy firewood. I said \"oh, let's try our big candle thing\" assuming it would be like sitting by, well, a big candle. Nope, this has the ambiance of a small wood fire! No wood fire smell, but it is kicking off nice heat! A little smoky, but it isn't sting-your-eyes smoke. I'll be interested to see how well it works to extinguish and use again, and what kind of life span we'll get out of it. But so far this is a winner and I'll be buying again!",
      "rating": 5.0,
      "verified": true,
      "author": "yellowdogmom",
      "helpful_votes": 7,
      "publication_date": 20180721
    },
    {
      "title": "I am giving 5 stars for a cookie tin filled with wax and paper chunks.",
      "text": "Why am I giving this 5 stars? Because it is ingenious and it works. It's one of those \"wish I'd thought of that!\" ideas. My wife laughed at it when I got it, but within 5 minutes of lighting it she was sitting there enjoying the mini-campfire on our lanai table. Very little smoke, and just smells like a big candle. Some advice: Make sure you are careful when closing the lid to put the flame out. It does kick out a heck of a fire so it would be easy to burn yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "E in Orlando, FL",
      "helpful_votes": 5,
      "publication_date": 20190118
    },
    {
      "title": "This is AN AWESOME IDEA! DO IT!",
      "text": "I used four stepping stones on top of each other to create a safe place 12”x12x. It took a while to light since it’s all full of the wax. Was a little paranoid about “hot wax” and having a small dog run around, but it was AWESOME! I live in an apartment and it made EVERYONE’s night. Everyone came by. Made smores. Kept me warm. Was windy out! SO BEAUTIFUL. I kept some to have another go at it, I’m not sure if I saved enough to get far, but I will update if I have to junk it. Still AWESOME regardless. Do i wish it was cheaper? Sure? Definitely buying again!!!! Telling everyone about this!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20200517
    },
    {
      "title": "Neat idea but too expensive to be practical",
      "text": "This is a cool idea for times when you might \"want\" a campfire but don't have supplies or a fire ring that you'd need to do so. That being said, the price point is too high for the disposable nature of the product. There needs to be a refill kit to affordably be able to use it more than once.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter Mills",
      "helpful_votes": 4,
      "publication_date": 20190925
    },
    {
      "title": "Many uses",
      "text": "I've used these a few times now on my back patio. It's a shared space in the city and these campfires don't give off embers or smoke (very little, anyway). They put out a surprising amount of flame and heat for their size. They're easy to light, and the components in the unscented version are non-toxic, so you can do s'mores or hot dogs over them. Burn time varies, but havent had one burn for less than 2 hours. I also have a couple in my emergency supplies. A little pricey, but you get quality in return. Buy the 4-pack; best deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B.",
      "helpful_votes": 5,
      "publication_date": 20190613
    },
    {
      "title": "Kind of Pricey",
      "text": "This ite is worth the price for us. We typically used those creosote logs in our outdoor firepit but this is so much cleaner and worth the higher price. The burn time is typically 3 hours which we use several evenings sliding the lid over to snuff out fire and have ready to relight the next night. We have used it to roast marshmallows with about 8 people standing around our pit and medium sized resulting fire. Everyone thinks it is a wonderful invention, a large sterno for your campground or backyard. Awesome product.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 2,
      "publication_date": 20200714
    },
    {
      "title": "Useless",
      "text": "Unable to make s’mores over as you cannot eat anything cooked over it",
      "rating": 1.0,
      "verified": true,
      "author": "Mom4",
      "helpful_votes": 5,
      "publication_date": 20190921
    },
    {
      "title": "Takes 45 min to cool off before you can pack it up",
      "text": "My college aged son asked for this for Christmas and he likes it a lot. He lives in WV where there’s a lot of snow right now. The only part he didn’t like about it is that you have to wait 45 min for it to cool down before you can pack it up. Kinda inconvenient when you’re in the snow at a state park and it’s cold outside that you have to wait so long for the tin container to cool off before you can leave.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Riley",
      "helpful_votes": 2,
      "publication_date": 20200116
    },
    {
      "title": "Great idea!",
      "text": "If you don't have space or time for a backyard fire pit, this is the perfect solution! We use this on our back deck. The flame gets about 12 inches + high but is contained in the can. When we're done, we just put the lid on. It lasts for hours and multiple nights of burning. I've ordered as gifts, given as gifts and bought three for our use. Just love this product. It's soy so it's not toxic. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Bonfilio",
      "helpful_votes": 2,
      "publication_date": 20191201
    },
    {
      "title": "Fire on the beach, easy peasy",
      "text": "Have we made “real” fires on the beach? Of course. Then we’d need to deal with potential hotspots and the unsightly mess next to where we want to spent the day. With this, we lit it on the beach with an old log & some stones for atmosphere, enjoyed the ambience, and put it out easiwhen we were done. Will definitely buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Northwind",
      "helpful_votes": 2,
      "publication_date": 20200726
    },
    {
      "title": "Not what it used to be.",
      "text": "This use to be a great product. I discovered this on amazon 2 years ago and I loved it! Purchased it again this year and sad to say, something has changed. The quality is not what it was. It seems smaller, the can is thinner, makes an odd noise while burning and the burn time is half of what it used to be. Same price though. Don’t waste your money. Better options are out there like the propane camp fire pits. Much better value than these.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200418
    },
    {
      "title": "easy to use, easy to dispose of when you're done",
      "text": "it opened without tools, kind of like a cookie tin just pull lid off. Definitely place something like a ceramic tile underneath to protect the grass and prevent a fire where unintended. Extinguished flame easily using lid. Lit with flame clicker easily, but i didn't even try matches since they seemed too small to get the job done. Light items which appear to be pieces of paper rolled up. Flame spread quickly and lasted hours. Lasted for hours and hours. We make s'mores and it was great. Flames in my photo appear a bit higher that actual since the camera was slow to capture.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great portable mini camp fire",
      "text": "With the pandemic, it's been hard to get away. So we bought a pop-up tent, a smores kit, and the Radiate campfire. This worked out great. It lights easily, doesn't have any embers and is easy to put out. My kids had a great time making smores over a real campfire (instead of a stove). It also gets large enough for us to sit around on a cool night with a sweater and this fire going in the middle. Some people complain it's too expensive for what it offers, but we think it's well worth the cost considering it's infrequently used and very convenient",
      "rating": 5.0,
      "verified": true,
      "author": "Chirag S.",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "GREAT camp fire!",
      "text": "We absolutely LOVE this campfire! It is nice to have a fire in places that do not allow them. We also like that we can put it out quickly by placing the cover back onto it. We have bought 4 of them so far, and will continue to use them! The only complaint we have is that it doesn't last too long, about 8 hours of burning (split between 3 nights)",
      "rating": 5.0,
      "verified": true,
      "author": "KSB",
      "helpful_votes": 2,
      "publication_date": 20190502
    },
    {
      "title": "Terrible",
      "text": "terrible product .. it burnt quickly, became one big mess. Wasn't anything like I expected as advertised on Shark Tank. Would never buy or suggest this item to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara Farrell",
      "helpful_votes": 7,
      "publication_date": 20181202
    },
    {
      "title": "super easy to ignite!",
      "text": "During shelter in place due to the corona virus , we used this in our backyard firepit and it worked great! Super easy to ignite and also easy to put out with the metal lid. We will continue to use it again for our backyard camp outs and creates a fun camping enviornment while we are on lockdown! It would be perfect for a real camping trip too!",
      "rating": 5.0,
      "verified": true,
      "author": "Lois D. Koval",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great!",
      "text": "I got this as a small gift for my mom and she loves it! It is easy to use, quick set up and clean up. She has used it now 3 times and still has a few more uses in! Highly recommend for a gift or for picnic/camping.",
      "rating": 5.0,
      "verified": true,
      "author": "christabelle",
      "helpful_votes": 2,
      "publication_date": 20200603
    },
    {
      "title": "Compact and easy to use",
      "text": "Love this as a easy way to get a small outdoor camp fire going within little to no fuss. Take off lid, set it in a safe place, put a lighter flame to an edge of its wax coated cardboard fuel. Within a minute or two there is enough flame for useful light and enough warmth to heat chilled feet or hands. This is especially nice in the case of setting up camp in the dark. Can run it for hours as a stand alone minimalist fire to huddle next to or use it short term just while you get a a true fire pit fire started. No soot or harsh smoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Terrific for the beach, park, or even at home!",
      "text": "Terrific small bonfire! Good when you just need a quick fire for warmth or mood. Good for beaches where a real wood fire is not allowed. My teenage boys LOVED their portable campfires!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 3,
      "publication_date": 20190701
    },
    {
      "title": "Easy to use",
      "text": "This product is awesome! My daughter & her husband have a fire pit & burn wood if they’re having people over & they’re going to be outside for hours This product allows you to light a fire & burn it for as long as you like. Then just slide the lid on to cover & it’s extinguished! We burned it for hours & it still looked like it had a lot more fires left in it! The size of the flames & warmth were amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Beautiful convenient",
      "text": "It's so beautiful they have a ring for my campfires and it has cutouts of Wildlife and when I put it in the middle you can still see the wildlife animals it's absolutely gorgeous it doesn't Flickr much different than a regular campfire the only thing that I disliked about the product I think it's overpriced I think it's wonderful thank you so very much",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Cool idea",
      "text": "We bought this for our cabin stay at Disney. Pretty cool idea, but the soot coming from all the recycled pulp makes your toasted marshmallows black when it’s not even close to burning. The description says it’s all food-grade so there’s no harm in it, and once it’s in s’mores form, you can’t see it so we all enjoyed it. It also gives off great heat, and the fire went out almost instantly when I put the lid on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bear",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Love the campfire",
      "text": "I just love being able to have a fire on my patio. It adds to the atmosphere of a party or just hanging out. The reason I gave 4 stars and not 5 is because of the smoke that the campfire gives off. It's not too bad. Campfires generate smoke, and do candles really put out that much smoke? Please work on the smoke. I will continue to buy the portable campfire.",
      "rating": 4.0,
      "verified": true,
      "author": "James MacLeod",
      "helpful_votes": 2,
      "publication_date": 20190117
    },
    {
      "title": "Campfire To Go",
      "text": "We took this on a recent trip to Colorado. Due to fire bans we couldn't use it in the fire pit but we could use it on a portable grill and it was nice to be able to experience some fire. We experienced a little wax leaking from the metal container and were glad we didn't place it on a table top vs. the grill. This campfire is perfect for any place where wood is limited (like the beach).",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick K",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Great alternative to traditional campfires",
      "text": "Got these for a camping trip this summer. There was a campfire site but there are often burn bans due to dry conditions and fire dangers so we are unable to use the sites. This is basically a giant candle so it’s safe to use. We loved it! It gave off great ambiance and it radiates heat too. Super happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jjj333",
      "helpful_votes": 2,
      "publication_date": 20181211
    },
    {
      "title": "Absolutely amazing!!",
      "text": "This portable vampire is so much fun and works really well. There is quite a big of heat that comes off the vampire so not only does it look good but it is functional! I love that you can take it anywhere and it is really easy to start and put out, You cannot cook s’mores on the eucalyptus campfire so I will be buying the original next so that we can cook s’mores on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Simply awesome",
      "text": "Easy, containable, perfect for our deck, we live in an HOA townhouse complex and don't think they'd like a rock pit",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Sunther",
      "helpful_votes": 5,
      "publication_date": 20180503
    },
    {
      "title": "Love it",
      "text": "These are great but I wished they lasted longer. Tried adding more beeswax but that didn’t work well with the chips...hard to get passed the flames too. Bringing the price down would help!",
      "rating": 4.0,
      "verified": true,
      "author": "MMi",
      "helpful_votes": 2,
      "publication_date": 20190607
    },
    {
      "title": "A Must Buy!",
      "text": "Don't purchase on Radiate website. Amazon has free shipping & comparable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie_in_Virginia",
      "helpful_votes": 2,
      "publication_date": 20200726
    },
    {
      "title": "Legit campfire",
      "text": "This thing is legit. Puts off a really good flame and lasts for hours. Cannot wait to buy another one!",
      "rating": 5.0,
      "verified": true,
      "author": "MJG",
      "helpful_votes": 2,
      "publication_date": 20200524
    },
    {
      "title": "Interesting Concept",
      "text": "Great little fire pit! Hiking go a night or two works out great. Sometimes, it’s difficult to find good wood to burn or even its wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Donny",
      "helpful_votes": 21,
      "publication_date": 20171214
    },
    {
      "title": "Awesome fire, no danger, no mess...",
      "text": "This creates a nice smelling fire by simply putting it on a rock and lighting it with a lighter. I bought it on a lark for my vacation, and it worked perfectly. I only used half and just popped the lid on the lit can (quickly and carefully) and it was good to go in the morning. The can just darkened where it burned, and the paint did not flake off or make a mess. I really like this and will be buying more of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Taylor",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Good gift",
      "text": "This is a great gift. Just a note that no matter that the company says you cannot bring this as a carry-on on an airplane! Has to be in checked baggage. It also came with some loose paper scraps that dislodged from this a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Good size and weight",
      "text": "Product is a lot larger than I was expecting and has some decent weight. Excited about trying it out this weekend! Will update review after. Used the fire pit the other weekend and loved it. My favorite part is you dont smell like smoke afterwards and it gives off a much larger and warmer flame than expected. I will definitely be buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael T",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Great quick, portable and reusable fire.",
      "text": "We love the radiate. We use it as a quick fire in the back yard on cool evenings, for neighborhood parties in the cul-de-sac, even on our front porch in the fall. Easy to use and re-use. Does have a little black smoke /soot during the burn, but it isn’t major",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Towne",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Spilled Wax",
      "text": "My boyfriend and I had a little romantic getaway for a few hours and thought that this campfire would be perfect for s'mores. The taste of them was just like any other roasted marshmallow! My only complaint is that I wish the lid had a tighter seal on it. After extinguishing the fire and letting it cool off for a little, the wax on the inside was still liquid and if not carried carefully could spill out of the tin. If you light this campfire, plan on leaving it in one location for awhile!",
      "rating": 4.0,
      "verified": true,
      "author": "Hannah Nicole Gill",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Definitely ordering again",
      "text": "I absolutely love these portable campfires!!! We love to roast marshmallows and enjoy the fire, but with two small kids, it’s often short-lived. These kits were absolutely perfect for a mom on the go who wants to spend about 20 min at the fire before it’s time for bed. They are a bit expensive, but I also think they are worth it for once in awhile family time.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine Barry",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "This is an awesome product. After hiking 10 plus miles sometimes its ...",
      "text": "This is an awesome product. After hiking 10 plus miles sometimes its hard to gather firewood, not enough in the area because its already been burned by other hikers or to wet from the rain. The extra weight in my backpack is worth it just to have the comfort of a camp fire!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S. Alt",
      "helpful_votes": 5,
      "publication_date": 20180330
    },
    {
      "title": "Excellent Fire in a Can",
      "text": "This sure beats lugging logs to the fire pit or beach. It burns at the appropriate size for a cozy campfire for 2 to 6 people. It was a little hard to light with a cheap gas lighter, but a wood match did the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Rion Sanford",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Good clean fire!",
      "text": "This thing is amazing! Produces good clean flame. Worked perfectly to roast marshmallows. Great solution for portable and just the occasional use of fire. Just as described!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Carrillo",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Great for camping!",
      "text": "Super easy to use! And good for the environment since you can easily use lint from dryer and soy wax to refill it. It’s cute and small and ready whenever you need a fire.",
      "rating": 5.0,
      "verified": true,
      "author": "Calista",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Five Stars",
      "text": "Works really well in our backyard for quick marshmallow sessions! Will definitely purchase again!!",
      "rating": 5.0,
      "verified": true,
      "author": "michael l dudzik",
      "helpful_votes": 4,
      "publication_date": 20180328
    },
    {
      "title": "Know who  the person is  you try to please",
      "text": "Gift for 55 Y/O, L.A., California, Son...🥰 Beach- Camping etc. 😊 I was promptly told he would probably be Arrested if he 🔥 Lit it.... ??!! 🤔 😢",
      "rating": 4.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Excited to light it up on Christmas!!!",
      "text": "SO COOL! Bought one for my dad for Christmas. It’s something different for the man who has everything! PLUS it’s functional, and Dad’s love that.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Tots",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "It’s okay but not amazing",
      "text": "Ok it’s great for backyards but it’s not really for backpacking it is much to heavy. If you’re not heading far this is perfect but make sure it is cool and solid before trying to take it with you. Please Leave No Trace. So it burned great but it’s just to bulky for our use",
      "rating": 3.0,
      "verified": true,
      "author": "louise Sherman",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Review",
      "text": "I bought this to have a small fire without having to use wood and smell like smoke on the last RV night. Lights easy and burned well. All of our firewood was wet so this was a nice thing to have as a backup one night. Few little pops/sizzles here and there but burned stable. Was able to put the lid on and reuse for another 45 minutes. I plan to buy again, I would like to try a scented one.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Petrangelo",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Great product!",
      "text": "This is so cool! I bought it for my fiancé for Valentines Day to have a s’mores date and he loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Fire in a can",
      "text": "Perfect gift for that guy you never know what to get. It’s unique , a great gift for someone who loves the outdoors. We called it a fire in a can",
      "rating": 5.0,
      "verified": true,
      "author": "Becky knuite",
      "helpful_votes": 3,
      "publication_date": 20181229
    },
    {
      "title": "Nifty",
      "text": "Purchased for my son-in-law. He's an outdoorsy fellow. Liked the whole idea, said it worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "tgeisick67",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Urban Bonfire",
      "text": "We used this on our deck for s’mores and just to hang out with friends. Does emit a surprising amount of heat and it’s just really cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Cormier",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Great idea for a campfire",
      "text": "The portable campfire lived up to its expectations. A very good fire with no bad odor and no ambers flying around. Well worth the money. We cooked smoores with the campfire. It worked great",
      "rating": 5.0,
      "verified": true,
      "author": "Camp Man",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "We love this product",
      "text": "I love this product!!!! It was perfect for a chill night on the deck.",
      "rating": 5.0,
      "verified": true,
      "author": "Sjwcslook",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "People in your campground are going to be jealous LOL",
      "text": "If you have problems with fires this is your solution very nice glow last a long People in your campground are going to be jealous LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Todd G",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Fun and it throws a LOT of heat!",
      "text": "These are just really fun and no muss no fuss for creating the atmosphere of a wood burning fire. Granted they only last for about 6 hours but well worth the price to place on your patio or deck if entertaining out there. And did I mention they crackle? Super cool!!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Cernius",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "great solution for my party but didn't last as long ...",
      "text": "great solution for my party but didn't last as long as I'd thought after reading the reviews. not usable for us... but it did light fast and offer a fire that is just the right size",
      "rating": 3.0,
      "verified": true,
      "author": "pat costello",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "This thing is great!",
      "text": "I have a pretty big balcony and a fire pit is out of the question, but this thing is FANTASTIC. The size, the heat it puts out, the lack of stinking smoke. I will be buying these as long as they make them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Nice product",
      "text": "We used this product outside, on Halloween. It is small and does not throw off much heat, but it was great ambiance!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Works without being lit!",
      "text": "This keeps bugs away without even having to be lit. It's a bit big to have indoors but I have Taurus works great with decent tablespace",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20180624
    },
    {
      "title": "Worked well",
      "text": "My only \"complaint\" was that the flame was very tall and made me nervous. But now that I know that I will be more thoughtful of where we light it.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Blackburn",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great item for campers and it keeps you warm",
      "text": "Bought this for a family member who has an RV and travels around the country. They love it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Moore",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Portable Fire",
      "text": "Purchased for a fire by the lake. Great concept works as intended. However, if you don’t have a lot of time before you have to pack it up it will be too hot to take with you.",
      "rating": 4.0,
      "verified": true,
      "author": "Moondaisy",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Fire in a can",
      "text": "Love theses so easy to use we bring to camp ground and to our backyard",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Very convenient.",
      "text": "I used the candles in my wood burning fire pit. Works great. No muss or fuss.",
      "rating": 5.0,
      "verified": true,
      "author": "Ned T.",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "you'll love it!",
      "text": "Used this in my Weber fire pit and it worked perfect. I thought the flame would be too small, but we roasted marshmallows and it worked perfect. I love a campfire, but not the smell and smoke. This eliminated almost all of that ! Perfect for a summer night on the patio.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Love it! Easy to use, good flame, great idea!",
      "text": "I love this! What a great invention. Lights easily, gives off a good amount of heat/fire, and goes right out when you put the lid on.",
      "rating": 5.0,
      "verified": true,
      "author": "Ptickles31",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Very cool",
      "text": "I bought this as a gift for my neighbor’s birthday. I thought he could take it with him when he takes his nightly walk at the beach. However, he’s been using it on his front (open) porch a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "sharon knight",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Great product for convenient romance",
      "text": "Really good flame, we have this on the deck with wine to finish off the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "I want to order 10",
      "text": "This is my favorite thing ever! I discovered these at one of those lantern festivals and they’re just such a good idea. The eucalyptus one is my favorite! Smells actually good.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley Stumpf",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "An hour and almost no flame and no heat.",
      "text": "This is the fire after one hour. No heat 2 feet away and I can place my hand within 2 inches of the tin. My grandson is very disappointed. Not sure if I should return the second tin.",
      "rating": 1.0,
      "verified": true,
      "author": "Seshat",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Perfect for camping",
      "text": "While I wish the price was less, I have to say we enjoyed having an easy to transport fire for our camp. It lasted 4 hours and provided a real campfire experience. 🤗",
      "rating": 5.0,
      "verified": true,
      "author": "Barb D.",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Awesome idea",
      "text": "My mother in law and father in law love camping. We purchased this for them and it was a HIT! Great IDEA!",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 2,
      "publication_date": 20180518
    },
    {
      "title": "Have used six times still “glowing” strong",
      "text": "Works as advertised. More for glow than warmth. Warmth if your within two feet I Have used six times still “glowing” strong",
      "rating": 5.0,
      "verified": true,
      "author": "Whop",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "winner",
      "text": "I love this product. I don’t know what I would do without it. I love to be able to load it up and roast marshmallows and put the lid back on it and walk away.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Bryant",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "City life",
      "text": "Not bad for city living to have a small gathering. Would be alot better if it was slightly larger like 15\". As far as time goes it was burning for about 5 hours, Doubtful it would re-light now but could get 6-6.5 hours",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth christy",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Pricy but great product",
      "text": "These are awesome. A little pricy. You can’t beat this for the campfire feel without all the work. Plus you can slide the lid over and put it out whenever your ready. No water. No smoldering hot coles. Yes, it obviously gets hot place it on something appropriate.",
      "rating": 4.0,
      "verified": true,
      "author": "MAR",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "ginormous candle",
      "text": "pretty cool, but only lasted about 2 hours. puts off good amount of heat. little expensive for a few hours",
      "rating": 3.0,
      "verified": true,
      "author": "LSC",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Good for camping!",
      "text": "These are awesome, if not overpriced. Got a solid 2 hours of warmth off these.",
      "rating": 4.0,
      "verified": true,
      "author": "seu0301",
      "helpful_votes": 2,
      "publication_date": 20180906
    },
    {
      "title": "Loved this little campfire!",
      "text": "Great product for those without a fire pit! We roasted marshmallows and made s’mores! So much fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Smoky..",
      "text": "Lots of smoke. Can only take it for a short time unless I walk away and come back or there is a little wind.",
      "rating": 3.0,
      "verified": true,
      "author": "M M P",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Resusable many times!",
      "text": "Awesome product! We bought 2 and they made a huge campfire in our fire pit. We used it for s'mores and everyone had a blast sitting around it. When we were done we just put the lid back on and the fire went out. We are able to use it again. A great value and no mess afterward!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Haro",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "So easy",
      "text": "This is just so convenient. My husband loves it! I am definitely ordering again.",
      "rating": 5.0,
      "verified": true,
      "author": "NeverSayNever",
      "helpful_votes": 2,
      "publication_date": 20180616
    },
    {
      "title": "Candle like but very much a camp fire",
      "text": "I love the way this smells, it's like the best candle campfire ever. You could have this among a small group but I've just had to it myself most times I've used it. I love it, will buy it again if I need to",
      "rating": 5.0,
      "verified": true,
      "author": "Isabelle",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Outdoor fun for lazy people!",
      "text": "Product as expected and provided lots of fun for late spring and summer evenings.",
      "rating": 5.0,
      "verified": true,
      "author": "Miriam",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Really Great for the Backyard!",
      "text": "We wanted a easy safe campfire for the backyard - and this was fantastic! It generates a campfire feel with no mess and lots of heat. We even roasted marshmallows on it. I bought two more!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Simple with no clean and easy to shur off fire",
      "text": "No clean up and easy to put out (like a candle). Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "m moore",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "A little pricey, but pretty cool",
      "text": "It has provided me with a bonfire for a few get togethers and was an instant hit. It would also be great for an emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Easy fire without worry of burning everything, the best",
      "text": "This was so easy to use, and really good we added some few branches on top to make the fire bigger, which was great also turning it off was even easier just place the cap over the fire and it turns off.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "It’s awesome!",
      "text": "Honestly, I wasn’t sure what to think... it’s awesome. It smells good. No smoke. And we’ve used it multiple times. Sometimes for an hour, or sometimes for 3. Our first cab has lasted at least 6 hours and I think it’ll have an hour left. We bought more we liked it so much. We use it in out patio fire pit at home too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Surprising Great Fire!",
      "text": "We went camping to a spot that didn't have any fire rings, and gave radiate a try. We were surprised at the size of the fire, lasted for several hours (5 hours) and would've kept going. No smoke, all organic, an amazing product. We were 6 around the fire and all felt the warmth. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "harold b.",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Portable",
      "text": "Great item! Gives warmth and no fumes! easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "KathleenMeyer",
      "helpful_votes": 0,
      "publication_date": 20181129
    }
  ],
  "product_meta": {
    "title": "Radiate Portable Campfire",
    "rating": 4.6,
    "feature_bullets": [
      "Radiate Portable Campfire! Designed to be sleek & portable with 3-5 hours of burn time",
      "Easy to light & reusable portable campfire for camping, beach, and backyard",
      "Made from recycled soy wax. No smoky smell & low soot. No Embers!",
      "Convenient, Portable and has recycled paper briquettes",
      "Shelf life of 30+ Years!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 5, 2018",
      "Manufacturer": "Radiate",
      "ASIN": "B079Q2S6HM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Camping & Hiking",
      "Sports & Outdoors",
      "Outdoor Recreation"
    ],
    "price": 27.99
  }
}