{
  "website_summaries": [
    {
      "verdict": "These stylish DC boots come in a variety of styles and colors to enhance your experience on the slopes.",
      "pros": [
        "Attractive snow boots for the winter season, super comfortable and keeps feet warm due to its custom material, and the price is great for the quality of the product",
        "Easy to lace up",
        "Most consumers recommend getting a half size larger for a great fit",
        "They are also light weight"
      ],
      "cons": [
        "Insoles have been reported to get a little slippery",
        "Some sizes tend to go out of stock sooner than others"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Fit, durable and warm.",
      "text": "I ordered a size 13 , but I normally wear size 12 in DC shoes, and they fit my feet perfectly. My older size 12 DC snowboard boots (that I replaced with these) were uncomfortably tight on my toes. Advice: order one size larger than your normal shoe size.",
      "rating": 5.0,
      "verified": true,
      "author": "Cade Klock",
      "helpful_votes": 8,
      "publication_date": 20170102
    },
    {
      "title": "Nice boots, in terms of quality Fits real small",
      "text": "Nice boots, in terms of quality Fits real small, real tight. If this were Dc Skate shoes, I would fit 8.5. I assumed that 8.5 by DC, in snowboard boots would translate to the same fitment ... but I was wrong. I eventually ended up trying a few other DC boots in 9 and 9.5 and each model varies. some size 9s fit, some models fit better if I went up to 9.5",
      "rating": 4.0,
      "verified": true,
      "author": "The Night King ",
      "helpful_votes": 3,
      "publication_date": 20171115
    },
    {
      "title": "Good boot",
      "text": "I read the reviews before I ordered this boot for my son. I ordered up a size. That was a good decision. He wore them over the New Years holiday and said they worked great. Comfortable and his feet stayed warm all day, even with sub zero weather.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie Stephens",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "They were perfect and I ended up wearing them more than any ...",
      "text": "My first pair of boots for myself. They were perfect and I ended up wearing them more than any other footwear simply bc they were warm. Great for the price, they did everything I could have asked for, for my two weeks of constant powder, dry em out and they were champs everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny O",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Great affordable boot",
      "text": "I'm pretty much a full time skier, but I switch to snowboarding off and on during the season depending who I go ride with, or the conditions. These boots are perfect for price and design since I'm not 100% on a board. I listened to the other reviews about the sizing and it worked out well. I normally wear a 9-9.5, so I ordered 10 in these boots and it worked out well. I haven't rode on them yet as I'm waiting for snow to fall, but I doubt that will be a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Lenny",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "Great!",
      "text": "Fit like a glove and feet have never been cold. Read other reviews as o believe I ordered a half size bigger based on what others wrote. Overall, I love em and they are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Catshateme",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "... are fairly light and from my experience have a pretty good flex to them",
      "text": "These boots are fairly light and from my experience have a pretty good flex to them. They run pretty small though. I wear a size 10-10.5 shoe and I got these in 11.5 and was debating on going up another half size because they fit a little too snug. I just decided to get new socks instead of wearing 2 pairs, one being wool. It's a pretty solid boot, I gave it four stars because I prefer a stiff boot vs. a boot with flex. It's not extremely flexible, but it's there. They are really comfortable and the lining actually molds to your foot overtime which is nice. Overall, great price for what you get. I would recommend",
      "rating": 4.0,
      "verified": true,
      "author": "nick c.",
      "helpful_votes": 15,
      "publication_date": 20151125
    },
    {
      "title": "Good quality and sturdy.",
      "text": "Seems to be of very good quality and sturdy. Haven't used them yet but I am sure they will last long.",
      "rating": 5.0,
      "verified": true,
      "author": "Gaurav Gupta",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Best boot for the price",
      "text": "I was due for some new boots and did some research. These fit true and seem very comfortable and warm. They have a medium flex and feel more natural compared to my old ones that made me walk like I had a.....I won't say. They are light and stylish. I can't wait to get out and use them. I can already tell that I won't have sore feet/ankles/calves after a day on the slopes. They seem like the best boots under $120-150, go get em.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Nolt",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "To small didn’t fit was supposed to return them for ...",
      "text": "To small didn’t fit was supposed to return them for an exchange but by the time I received the return info I had already missed the deadline it’s my fault the return shipping label went into junk mail and I didn’t see it any body need any snowboard boots never used brand new still the box 🤤",
      "rating": 1.0,
      "verified": true,
      "author": "Mike T",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Good deal bought these for my son his feet girl ...",
      "text": "Good deal bought these for my son his feet girl all the time they're really comfortable probably more comfortable than others he bought in the store",
      "rating": 4.0,
      "verified": true,
      "author": "Anne Golding",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "What a deal!",
      "text": "I've used these boots for this past winter season. Super comfortable, great fit and durability. No blisters, no issues, I would highly recommend these boots. Fantastic price!",
      "rating": 5.0,
      "verified": true,
      "author": "Erik R",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Comfortable. I’m a girl and bought these for myself",
      "text": "Comfortable. I’m a girl and bought these for myself. I’m an 8.5 and they fit perfectly. So excited to shred",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi kartrude",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Great deal for me..",
      "text": "Great price for a great product. I saved a lot by purchasing online vs. my local board shop(s) crazy tourist prices..",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Great boots. For the most part fit as expected ...",
      "text": "Great boots. For the most part fit as expected with the right foot just a little tight but the left foot was perfect and still good for the slopes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Mediocre at best",
      "text": "Laces came apart pretty quickly and takes quite a few sessions to break them in. A pretty stiff boot and never felt like my foot was fully secure",
      "rating": 3.0,
      "verified": true,
      "author": "Peter Miranda",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "These boots are great. Look great",
      "text": "These boots are great. Look great. Feel great. Would give 5 stars but my toes for some reason get cold while going down the hill even with wool socks. Other than that great boots.",
      "rating": 4.0,
      "verified": true,
      "author": "Hunt",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "These Boots are pretty good used them this pass season snowboarded with them ...",
      "text": "These Boots are pretty good used them this pass season snowboarded with them for 79 days total and i will use them for a little bit begging of next season",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler McCully",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "I feel like I'm flying",
      "text": "Very light! Buy a full size up and replace the insoles with snowboard specific insoles.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Zavala",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Good fit, good quality",
      "text": "Used them 2x this year, not much good snow! Fit was nice and has good ankle support.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy D",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Five Stars",
      "text": "My son is happy with the product. All expectations met.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Newman",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Pretty soft flex",
      "text": "Pretty soft flex. I usually wear 8.5-9. I ordered 9, they are just a tad snug. But hopefully I'll wear them in. They looks nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon Do",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Bought for my son at Christmas last year. They ...",
      "text": "Bought for my son at Christmas last year. They did not even make it through 1 ski season before they started ripping out.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Withers",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Nice Snowboard boots",
      "text": "very nice snowboard boots. Fit well. Can't use since it's summer. Looking forward to snow to try these out.",
      "rating": 5.0,
      "verified": true,
      "author": "RHunt",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "one size more better",
      "text": "fitvery well. great brand. aways good enough . one size big more is necessory than your nomal shoes. one and half more maybe better for a young kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Clark",
      "helpful_votes": 0,
      "publication_date": 20140309
    },
    {
      "title": "Tight but got worn in after a day and felt great the rest of the trip",
      "text": "Fit as expected. Tight but got worn in after a day and felt great the rest of the trip. Nice simple boots.",
      "rating": 5.0,
      "verified": true,
      "author": "luckyjesuspatrick",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Nice",
      "text": "they fit perfect and look bad ass....i cant wa8 to use them they are the first real paid that i desided to pay for, i just got tired of renting the gear and went with the DC boots cuz i figured they would be a gr8 product and i wasnt wrong..",
      "rating": 5.0,
      "verified": true,
      "author": "snax",
      "helpful_votes": 3,
      "publication_date": 20111006
    },
    {
      "title": "Good boots.",
      "text": "Good boots, but too small. I had to return them. Maybe will reorder but, 2 sizes up. My son asked to reorder.",
      "rating": 4.0,
      "verified": true,
      "author": "Oxana",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Flat footed? These are for you",
      "text": "Great boots. Flat footed people rejoice. For non flat footed people, tons of space for new souls. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Alex Zeisberg",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Is this fake?",
      "text": "1) No original DC shoes box covered; 2) Not original DC liners; 3) One of the lace pull was even broken; and 4) Not original insoles. Is this fake?",
      "rating": 1.0,
      "verified": true,
      "author": "Gary Lau",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Awesome boot for a great price",
      "text": "Awesome boot for a great price! Fits great, the only issue was that the insole is kind of slippery. Therefore I find my foot slipping on the inside even when fully laced in.",
      "rating": 4.0,
      "verified": true,
      "author": "kyle",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Boots",
      "text": "Boots fit and were right on time for the snow board trip and snow mobiling that weekend too love them",
      "rating": 5.0,
      "verified": true,
      "author": "Joleen Midtgaard",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "tight if planning thick socks",
      "text": "A little tighter then expected. Was planning on wearing a thicker sock. Great looking boot love the style of the boot.",
      "rating": 4.0,
      "verified": true,
      "author": "Kira Pace",
      "helpful_votes": 4,
      "publication_date": 20140106
    },
    {
      "title": "Good flex, very light",
      "text": "Size was comfortable/slightly snug at 0.5 sizes above my normal shoe size. Good flex, very light.",
      "rating": 4.0,
      "verified": true,
      "author": "Colin Gillis",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Five Stars",
      "text": "Awesome boots, make sure you choose a full size larger.",
      "rating": 5.0,
      "verified": true,
      "author": "truemo",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Five Stars",
      "text": "Nice price comfortable great support, but they do run small you may need to go 1 size larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Great, warm, and lightweight boots",
      "text": "I love these boots, quick laces inside, extremely light material, and very warm. I know that they are very warm because the first day I went riding (and I have lived in Hawaii and Florida for the last decade) it was almost 50 below with the windchill, and only about 23 below if you don't count for windchill. My feet were toasty and comfortable in the soft lining of these boots,plus they go on and off very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "tyler cary",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Three Stars",
      "text": "The boots are amazing but did not match the size. They are almost 2 sizes below.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Good boots but runs small. Read more for detail",
      "text": "They run a half size smaller than Nike running shoes. Good example. So if you have some roshe that are 8 get the boots a half size bigger. So 8 1/2 for a perfect fit. 9 for wiggle room. They are great light and fit nicely. Happy with the product and the price ———Update after two seasons——- They are holding up well. I abuse them and they can take a beating on average I make 10+ trips to tahoe.",
      "rating": 5.0,
      "verified": true,
      "author": "John A",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Three Stars",
      "text": "There lacing system is not the best but overall is a great boot.",
      "rating": 3.0,
      "verified": true,
      "author": "Andres",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Five Stars",
      "text": "These boots feel great, I feel like that is expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Sebastian",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Great snowboard boots for a tight budget.",
      "text": "These are awesome boots at about $100. Sure, there are better boots on the market, but unless you are a really serious boarder, do you really need to spend $300 plus. My teenager is just glad to have his own boots and not be renting at $25 each time! Size runs a little small, so order up.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 2 Boys",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Five Stars",
      "text": "They are comfortable and work great! The boots arrived quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Other than that I love it, feels great",
      "text": "I wear 11, sometimes 11.5 on regular shoes. Got me a pair of 12 and they fit very tight. Doesn`t give me pain but it`s very tight. I`m gonna give it a few runs to pack out but definitely keep in mind that they run smaller than usual. Other than that I love it, feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Aline ALBINO",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "These boots are awesome and fit great",
      "text": "These boots are awesome and fit great. I got 11.5. They seem very durable and solid build offer a lot of control and comfort. Also they keep my feet warm and dry all day I would highly recommend these to a friend. For the price I don't think you can beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brennen",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "It should be a very good pair for beginners",
      "text": "This pair of boots helped me from a complete newbie to intermediate snowboarder in just a few days. It should be a very good pair for beginners. The traditional laces take a bit of effort to tighten. However, I think they are not bad as I worry the fancy strings system may break easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom W",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "great for me",
      "text": "I'm new to snowboarding, but these boots feel great. They take a few runs to break in, but I feel like that is expected. They do not give much flex. They are slightly bulky, but so comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "Runs VERY small",
      "text": "I ordered a size up and my toes were curled up even without thick socks. I would say order 1.5-2 sizes up from normal. Can't review the boot on the mountain yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy L",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "5 and they fit like a dream",
      "text": "I was a little weary when I bought these, but for the price I could not pass them up. They definitely for a little small, my last pair of Burton's were size 9 so I ordered 9.5 and they fit like a dream. Planning on ordering another!",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Fine, AFAICT",
      "text": "My son, for whom these were a gift, swears by them. Sorry for lack of details but the budding boarder is in love. Minus one star for second-hand information.",
      "rating": 4.0,
      "verified": true,
      "author": "T. D. Kozan",
      "helpful_votes": 0,
      "publication_date": 20160515
    },
    {
      "title": "I absolutely love their products",
      "text": "I don't know why everyone keeps saying that these boots run small, they fit as expected! I've been a dc customer for years, I absolutely love their products. I ordered these boots in the same size that I've been ordering my dc shoes for many years and they fit and performed as expected! Thank you DC*",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Scheller",
      "helpful_votes": 2,
      "publication_date": 20160221
    },
    {
      "title": "fit smaller than size would indicate",
      "text": "My son wears a 8.5 size shoe and so I went a full size up for the snowboard boots and they still didn't fit. I returned them, pretty disappointed because he really like them and now they aren't available.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "... we actually bought a size bigger and it worked perfect brand is light sturdy and well made can't wait ...",
      "text": "Was a Smidge small but we read that on the reviews so we actually bought a size bigger and it worked perfect brand is light sturdy and well made can't wait for the new boarding season",
      "rating": 5.0,
      "verified": true,
      "author": "alicia",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "3star for now. Need to use it 1st.",
      "text": "Looks cool & well built. Will give detailed review after my son use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Reyjoan",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "got the newer model because they were such nice boots. Really nice boots all around",
      "text": "Had the older model, got the newer model because they were such nice boots. Really nice boots all around. Sturdy, and lightweight.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon C",
      "helpful_votes": 2,
      "publication_date": 20160223
    },
    {
      "title": "Awesome boot very good support and is light",
      "text": "Awesome boot very good support and is light! Needed a full size bigger, not a big deal but just a heads up!",
      "rating": 5.0,
      "verified": true,
      "author": "Rod Scurry",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Very good for the price",
      "text": "Got these boots a little over a month ago and have boarded with them about 5 times now. They do run small, I typically wear a size 10.5 in vans, and I ordered these in 11.5 and my toes barely fit, a 12 would have probably been more optimal for me. These boots do have flex to them, enough to be noticeable but it's not terrible. They also tend to come loose fairly easily, so you will have to re-lace a good amount throughout the day. They are really comfortable, and keep your feet nice and dry all day. For the price, I would highly recommend these boots.",
      "rating": 4.0,
      "verified": true,
      "author": "Christian Lopez",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Too small",
      "text": "Should have went with an eleven. How do I swap them? I need a size 11. The boots are awesome.",
      "rating": 4.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 4,
      "publication_date": 20131224
    },
    {
      "title": "Broke after 2 days",
      "text": "Tried to tighten the liner on my boot only 2 days into using them and the device broke...",
      "rating": 1.0,
      "verified": true,
      "author": "John Montchal",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "beginner's needs",
      "text": "Again, a beginner so I don't speak for quality but they work just fine! They did seem to come loose but I don't know if that's just a trait of cheap boots??",
      "rating": 3.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "They were very comfortable and flexible",
      "text": "I bought the boots in August 2016 and this year was the second season in which I used them. They were very comfortable and flexible. However, I was surprised to get the inner boot since it was broken at the tip and repaired with tape",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160912
    }
  ],
  "product_meta": {
    "title": "DC Men's Phase Lace Up Snowboard Boots",
    "description": "A classic in the DC line, DC Shoes has updated the Phase snowboard boot with their new low profile, lightweight Unilite outsole for better board feel and control. Direct power lacing features strategically placed overlays in the boot's upper to provide more power and leverage for optimal closure.",
    "rating": 4.2,
    "feature_bullets": [
      "fabric-and-leather",
      "Imported",
      "Traditional lacing system",
      "Foundation unililte outsole",
      "Red liner with snow basic insole",
      "Flex Rating 5 of 10"
    ],
    "specifications": {
      "Department": "Mens",
      "Date First Available": "November 28, 2011",
      "Manufacturer": "DC Snowboard (Outdoors)",
      "ASIN": "B073QPDMXR",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Winter Sports",
      "Men",
      "Boots",
      "Snowboarding",
      "Outdoor Recreation",
      "Sports & Outdoors"
    ],
    "price": 149.99
  }
}