{
  "website_summaries": [
    {
      "verdict": "An innovative option for those who want a rechargeable waterproof lighter that does not require butane.",
      "pros": [
        "Uses state-of-the-art technology to create a plasma wave that is hotter than fire",
        "Rechargeable battery provides more than three hours of use on a single charge",
        "Intended for use in rain or shine"
      ],
      "cons": [
        "More expensive than comparable options",
        "Lid does not open very far"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This reliable yet stylish lighter slips easily into your pocket. Dual plasma beams get the job done in all weather conditions.",
      "pros": [
        "This futuristic-looking lighter is sleek and compact",
        "The rechargeable lithium-ion battery eliminates the need for butane",
        "Comes with a USB cable",
        "Built to last and relatively inexpensive",
        "Excellent overall value (2-pack)"
      ],
      "cons": [
        "Despite company’s airport-approved claim, some users have reported TSA seizing their lighters"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A lightweight electric lighter that substitutes butane with state-of-the-art plasma technology.",
      "pros": [
        "Uses a lithium ion cell to create consistent heat",
        "Lighter is airport-approved, windproof and splashproof",
        "Requires only about 1 hour to recharge the lighter",
        "Lighter is both butane-free and chemical-free",
        "Sold with a one-year manufacturer's warranty"
      ],
      "cons": [
        "Does not hold a charge as well as comparable electric lighters",
        "May overheat when you charge the lighter"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Lighters stoped charging",
      "text": "The lighters stop charging after 3 months. Made contact with seller. He gave me a complete refund. I gave the product one star but the seller five stars.",
      "rating": 1.0,
      "verified": true,
      "author": "F. M. Lange",
      "helpful_votes": 39,
      "publication_date": 20180126
    },
    {
      "title": "fine little tool",
      "text": "Received my lighters yesterday and it's time to retire my old trusty zippo. This thing really works well and other than the fact that it weighs more than the Zippo it works better. A bit breezy while the dog and I went for a walk and out of habit I cupped my hand around the lighter, realized what I was doing took my hand away and lit my smoke with no shield and no problem. It would light in a storm, although the smoke would get soaked and my dog hates rain. Great product and fast service",
      "rating": 4.0,
      "verified": true,
      "author": "Don Hilston",
      "helpful_votes": 26,
      "publication_date": 20171018
    },
    {
      "title": "I really like the quality and it works fine",
      "text": "I really like the quality and it works fine. I just can NOT handle the high pitch frequencies these put out. I can be in a different room and get painful chills down my spine every time it is used. If you are not sensitive to high frequency noises then this should work just fine. We use for lighting kindling and paper to start our fireplaces which works fine just can't handle the dog whistle sound it puts out.",
      "rating": 3.0,
      "verified": true,
      "author": "LM.",
      "helpful_votes": 13,
      "publication_date": 20180219
    },
    {
      "title": "High tech comes to cigarette lighters",
      "text": "These lighters are a major improvement over unreliable matches. They are an improvement over disposable lighters and refillable lighters. I’ll tell you why: 1) Humidity doesn’t touch them; 2) and 3): Rechargeable through USB. I have bought several, enough to placee around the house. I leave the cable attached so I don’t lose it. They aren’t pipe lighters but do their single job quite well. My only complaint—they do get lost.",
      "rating": 5.0,
      "verified": true,
      "author": "Etomkins",
      "helpful_votes": 11,
      "publication_date": 20171010
    },
    {
      "title": "... days now but seem to a quality lighter and nice looking, had no problem charging them",
      "text": "Only had them for a couple of days now but seem to a quality lighter and nice looking, had no problem charging them. Will update if I find any faults or problems. Would by again Update: After 4 months the one I kept quit working and just talked to person I gave the other one too as present has quit working too a month or so ago. So I no longer will buy again, stick to my zippo",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 5,
      "publication_date": 20180308
    },
    {
      "title": "and it works great! This isn't a big deal",
      "text": "Ordered product on a Wednesday, received it the next day! Quality product! It takes a bit getting use to using this lighter vs. a regular cigarette lighter, but after a few clicks of the button, you get use to it, and it works great! This isn't a big deal, but, you are provided with a USB charging cables, but no USB chargers are included. As I said, this isn't a big deal because I have a lot of USB chargers from phones and other USB devices I've purchased over the years, plus you can get one almost anywhere, like Walmart for $2.",
      "rating": 5.0,
      "verified": true,
      "author": "lab99",
      "helpful_votes": 9,
      "publication_date": 20170821
    },
    {
      "title": "One of the 2 lighters had a button stuck in ...",
      "text": "One of the 2 lighters had a button stuck in the on position. I had to fiddle with it to get it to stop sticking. After that it worked as it should. Update 6/26 Last week the button got stuck inside and stopped working... After opening it and replacing button, it worked a couple times, then stopped. The inside was held together with sloppy scotch tape that tore and the parts were loosely put together. It's a cool idea and I loved when it worked. Now I need another lighter since I gave one away as a cool gift. Hope it still works...",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20180616
    },
    {
      "title": "1 BROKE FIRST DAY. NO RESPONSE F/ SELLER",
      "text": "* *I WILL UPDATE IF I HEAR BACK FROM SELLER * * One of the lighters broke the first day. The charging port was loose and I wasn’t able to charge it. I sent a message to the seller but unfortunately never heard back. One of the lighters works great and I’m happy with it. I hoped to get one replacement lighter rather than return both. Disappointed I didn’t hear back from the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Solo",
      "helpful_votes": 2,
      "publication_date": 20191023
    },
    {
      "title": "You get two but one was Dead on Arrival",
      "text": "These look nice and are fun - I bought them just to see what a plasma lighter was and it makes a little arc that will light stuff on fire. You charge it from a USB port and the little (short) charging cable has a nice blue \"charging\" light. The only problem is that out of two, only one works. The other one was D.O.A. I charged it - but that didn't help. Finally I took it apart for fun (easy to do) and then threw it out. This wasn't a bad little lighter - but if I bought one again I would try another brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom in CA",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "meh",
      "text": "I initially liked this lighter, but a short battery life and being so fragile made me take out 2 stars. The battery life is not that great, I must recharge it every 3-4 days. Also it fell out of my pocket on to a tiled flor and stopped working, I disassembled it from the bottom screw and saw the wire that connects to the button was disconnected, so I had to solder it back, now it works again but a lighter that stops working so easily after falling out of your pocket is not reliable enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Pirumyan",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Good gift",
      "text": "Excellent little lighters! I got them as a gift foy husband and he has greatly enjoyed lighting things (mainly candles, thankfully). The lighters have a decent weight to them to make them feel nice in the hand and the button to activate it is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 2,
      "publication_date": 20200213
    },
    {
      "title": "Already disappointed",
      "text": "I’m very disappointed! I brought the set of two for Father’s Day for my boyfriend & he was so excited showing his family & friends his new lighters. So when the one lighter died & he went to charge it guess what it didn’t charge. I felt so bad & ashamed I just told him to bring the 1 back & I’ll send it back. I don’t understand how it don’t work brand new out the box! Hopefully we’ll be able to settle this.",
      "rating": 1.0,
      "verified": true,
      "author": "mira green",
      "helpful_votes": 5,
      "publication_date": 20180620
    },
    {
      "title": "Terrible battery performance will not stay charged longer than 12hrs and poorly explained",
      "text": "Well the first thing I liked about the lighters was a plasma beam for lighting cigarettes however it only lights half of the cigarette and then you got to click the button again to lite the other half and the biggest problem I have with the lighter is the battery life. Also it only lasts half the day and it needs to be charged again, and I use it for cigarettes only but I was still expecting a 4 prong plasma not just two prongs with one little straight plasma line, I thought it was going to be an x plasma beam...",
      "rating": 1.0,
      "verified": true,
      "author": "Edward Enos",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great product, price, and vendor",
      "text": "So my wife and I love these lighters for several reasons; it's as cool as a zippo, but doesn't evaporate its fuel away in a blink, feels solid, etc., but what I REALLY loved about buying this is that the vendor emailed me the lifetime warranty info. How convenient and reassuring is that? Why have I never had that happen before with any product? That should be standard for any warranty info for easy searchability. Great product, great price, great vendor interaction.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 3,
      "publication_date": 20171125
    },
    {
      "title": "Good Looks but unsafe",
      "text": "The lighter is good but unsafe. The lighter gets heated up, if the ignition switch is pressed even if the cover is closed. Very likely that it will get activated in the pocket. Hence returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Natraj Kumar C",
      "helpful_votes": 3,
      "publication_date": 20180914
    },
    {
      "title": "I understand Golum.",
      "text": "I don't smoke. I buy lighters to light incense and just to watch them work. Fires when I can get a burn permit. The SaberLight is the most miraculous lighter I have seen. It has a heft about it. The Black Stainless Steel housing is gorgeous! When you open and close the flap it makes a beautiful Clink. This is a piece of art. I just love to hold it and look at it. I understand Golum. My Precious.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Put it through the ringer!",
      "text": "Love them I had another saberlight prior to these 3 new ones I just got. The other was phenomenal. Held a charge, lit in my boat at 45mph running offshore, and duck hunting every day of last season. I abused it. I dropped in water, soup like mud while hunting several times. Dried it out. Always worked. Then I lost it. Got 2 more. Great product and prompt service.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171203
    },
    {
      "title": "Probably Fair Value for Price",
      "text": "Worked for a few months, then virtually every part broke or started malfunctioning. Lid became loose, USB port became loose - would only charge intermittently, and ignition button became stuck, and would not work, however lighter would heat up unexpectedly in pocket. I eventually threw away. For the price, a few months was probably fair value, still kinda disappointed A bit soured on trying the second in set out after seeing the short life cycle and rapid decline of first.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeffrey Fike",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "One lighter didn’t last three weeks.",
      "text": "Opened one lighter to start. Lasted about a week and I was able to recharge it fine without a problem. Upon my second charge the lighter is working intermittently. The company sent me the warranty email about a week after I got the lighters, but unfortunately I deleted the email and can’t figure out how to get the warranty. Oh well, I plan on opening the non-working lighter and hope to have better luck on the second one",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Mingrone",
      "helpful_votes": 4,
      "publication_date": 20180413
    },
    {
      "title": "Simple and Perfect EDC",
      "text": "These were a great deal and arrived with a decent charge to test. They have an effective arc to create small flames or light cigarettes. I would not recommend these for cigars, primarily because the arc is not wide enough to reach the center. They are thin profiled and have a dark, classy look. I love them and will use them in my Every Day Carry",
      "rating": 5.0,
      "verified": true,
      "author": "jburnett1987",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Love this lighter. Really works. Neither snow nor sleet nor dark of night will keep this lighter from working!",
      "text": "Great lighters. Work like a charm. Flameless, so you can use it in the wind, in the car, anywhere. These have a nice heavy feel and look elegant",
      "rating": 5.0,
      "verified": true,
      "author": "L. Lopez",
      "helpful_votes": 2,
      "publication_date": 20171124
    },
    {
      "title": "Just don’t buy it.",
      "text": "Total garbage!!! I thought it might be good for camping. On the second attempt to charge the connection failed and sliped back into the body of the mechanism. Do not waste your money. Ashamed to have to give it a 1star rating.",
      "rating": 1.0,
      "verified": true,
      "author": "paul levar",
      "helpful_votes": 3,
      "publication_date": 20180702
    },
    {
      "title": "They seem to work pretty well, though they take some getting used to",
      "text": "Saw an ad/sale for a competing product. Decided I didn't need the flashlight feature of the other product Saberlight was selling 2 for less than the price of one of the other. They seem to work pretty well, though they take some getting used to. The igniter button popped out of the first one on day 2. I took it apart and found it was just clear tape holding it in place. I scratched it off, put the button back in place, and applied some new tape. They've both been working fine every since. If this problem happens to you, it's easy to fix.",
      "rating": 4.0,
      "verified": true,
      "author": "bcurran3",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Well Built & Reliable Windproof Lighter",
      "text": "I wasn't sure what the quality of this lighter would be for the price but I was presently surprised. The lighter has a good solid feel to it and so far it works well. I appreciate the gift boxing as I gave both lighters away as gifts. This flameless lighter works equally well in windy situations and calm. I'm now curious to see how long they last...",
      "rating": 5.0,
      "verified": true,
      "author": "GMO",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Its ok",
      "text": "Lighter is awkward when trying to light a cig. I've already threw away one lighter because the charging port on lighter got loose and wouldn't charge unless you stood there and held it a certain way. I'm on the second one atm, so we will see how long that one lasts. I guess for the price, it's a decent item but I won't be purchasing again.",
      "rating": 3.0,
      "verified": true,
      "author": "Luv2Bowl",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Very cool! I only wish the nodes were a little ...",
      "text": "Very cool! I only wish the nodes were a little farther apart because you have kind of wind the cig around a bit to fully light it up. And it doesn't last 300 lights without needing a charge but it charges very quickly. Works great in the wind and rain too!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170901
    },
    {
      "title": "reliable and aligned with my conservation goals",
      "text": "I bought these because the drawer full of lighters I have are disposable and it seems I'm constantly running out of butane. I figured why not try this? I love it. A charge lasts a good long time and it recharges fully. And I'm not adding to the waste with disposable lighter after disposable lighter. Definitely feel this is the way to go now!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Labadie-Mendes",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Lighter Worked great when I received it but only for a short ...",
      "text": "Lighter Worked great when I received it but only for a short period of time. I used mine for the wind while riding my motorcycle and liked it. I charged it several times during a two week span with no issues until it died one day. Once stopped I noticed the light wasn't on when I plugged it in so I tried a few different USB cords and had no luck, it just won't charge. I gave one away as a gift but haven't heard anything about problems with it but I hope it keeps going for them.",
      "rating": 2.0,
      "verified": true,
      "author": "Donald",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "THE IDEA OF NEW STYLE LIGHTER IS A GOOD IDEA.",
      "text": "THE IDEA OF NEW STYLE LIGHTER IS A GOOD IDEA.......BUT THE DISTANCE BETWEEN THE 2 POINTS OF THE LIGHTING AREA THERE IS ABOUT A 1/4\" TO LIGHT THE CIGARETTE. AND THE FLAME IS PITIFUL.",
      "rating": 1.0,
      "verified": true,
      "author": "BETTY LITTLEJOHN",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Pretty cool",
      "text": "Good build quality. I don't smoke. I bought these to have as fire starters for camping. They are fuel less and rechargeable. Both lighters come with their own charger so you can give one as a gift. These are common micro USB chargers. Wind and water is not a problem either. It's a great solution for my needs. Need to see how these hold up over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike JM",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Not bad lighters for sure",
      "text": "I obviously got an older model of these. They worked alright for a bit but one was a bit touchy to charge. They both stopped working fully around the same time (wouldnt charge any more because the same piece broke off on both) but seemed to last me a decent amount of time for sure.",
      "rating": 3.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Really works well.",
      "text": "I bought these lighters for my husband who smokes, works outside and has difficulty keeping disposable lighters lit long enough to light his cigar. He likes them so far saying they work great in the wind staying lit and allow him to light quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Ambrose",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Must for emergencies.",
      "text": "Must have in case of emergencies. Fast long charge. Lightweight.great fir outdoors or in emergency kit.",
      "rating": 5.0,
      "verified": true,
      "author": "mary rykalsky",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Great quality for a great price.",
      "text": "I love these lighters, they’re nice and sleek, slightly textured or whatever. They’re heavier than normal lighters but I don’t mind it, I like the extra weight. Damn good price too, comes with two of them for just around twenty dollars. The only thing I’d prefer to be different is the pair of conductors, I personally would like it if they were slightly farther apart if possible, I’ve found it a bit difficult to light cigarettes effectively at times, but other than that, everything about these lighters is nice. I recommend these to anyone and everyone in need of lighters",
      "rating": 5.0,
      "verified": true,
      "author": "Defender",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "looks sturdy charges easily but......",
      "text": "button on front fell off after a day how sad it is a good looking lighter not the best only one electrical line but it was adequate until the damn button fell off and now its fairly useless",
      "rating": 1.0,
      "verified": true,
      "author": "TrumpSucks",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Very Handy & Easy to use & recharge",
      "text": "Have not used enough to know battery life , but its seems to last a while. Unique alternative to lighters that have to be refueled. Gave as gift to groomsmen & ushers @ wedding. They used to light sparklers for Bride & Groom upon departing.",
      "rating": 5.0,
      "verified": true,
      "author": "SilverDollar",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Pretty good",
      "text": "Great for lighting fireworks on a breezy day. Not so great for large candles that have been previously lit due to the heat source not being able to reach the wick. I should have gotten the long version.",
      "rating": 4.0,
      "verified": true,
      "author": "figuy",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Prepare your ears",
      "text": "I didn't know it'd make that high pitched sound- got over it. It's different and I collect unique lighters.",
      "rating": 5.0,
      "verified": true,
      "author": "wanda",
      "helpful_votes": 5,
      "publication_date": 20170808
    },
    {
      "title": "I've had a chance to compare. This one rules the day!",
      "text": "The battery charge lasts a long time. I have waited weeks between uses and it \"fires\" right up. I use it mainly to burn paper to start fires. No complaints. This one is simple, no silly extra led lights. It also stays lit while you depress the button for the fire.",
      "rating": 5.0,
      "verified": true,
      "author": "Isa",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Quit working",
      "text": "Only 1 of the 2 lighters still works. The first one quit working after about a week.",
      "rating": 1.0,
      "verified": true,
      "author": "KyBart",
      "helpful_votes": 3,
      "publication_date": 20171223
    },
    {
      "title": "Worth the money.",
      "text": "These are a great fun gift for your friends that smoke, the arc lights cleanly and for lack of a better term they’re just cool to watch and use. I do agree that being able to gauge how much battery life is left would be a great feature but at this price point I can understand why they would leave it off.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Espinosa",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Works well, consistently... note that the single plasma element is not powerful",
      "text": "Battery lasts longer than expected on a charge, works consistently (push button and it 'ignites', no need to click over & over)... These single plasma element units are not practical to light a cigar for example, but would work well when you want a smaller burn that is contained to what the element touches (such as lighting a wick).",
      "rating": 4.0,
      "verified": true,
      "author": "K. Mays",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Reliable, rugged, unexpectedly useful!",
      "text": "I discovered this clever product on one of those \"40 things under $40 you didn't know you need\" lists, and decided I really did need a set. The Saberlight is small, sturdy, and completely reliable. I'm sure I'll discover plenty of ways to use it (though I'm not a smoker), but it's already replaced my fuel-based candle lighter. The second unit in the kit will be a much appreciated Father's Day gift next week!",
      "rating": 4.0,
      "verified": true,
      "author": "MCS3015",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Nice lighter, but needs an interlock.",
      "text": "This is a very nice lighter. It feels great in the hand and was a real bargain as a two pack. I think you should not be able to ignite it with the cover closed though. If in a pocket or purse/case and the button is depressed, the igniter lights.",
      "rating": 4.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "No flame..... no problem !!!",
      "text": "A very different technology in cigarette lighters..... seems to be superior in some conditions and needs some practice for use in other conditions.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Sol M. Wald",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Worth it",
      "text": "I love the product and how well it works! Only thing I would have enjoyed a bit more is if the space between the electrical pulse was a bit wider so you could fit whatever you’re using more evenly. But other than that, amazing product! Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Jariel",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Nice - just wish the cover opened wider",
      "text": "I can't use it for some things because the top doesn't open wide enough to allow contact with the arc... but otherwise these are pretty cool. Like that they recharge and they seem to work a while without a recharge (not a smoker... so, I don't really use it much).",
      "rating": 4.0,
      "verified": true,
      "author": "TooMuchStuff",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Ignition hazard",
      "text": "Be very careful when ordering this. The lighters can ignite while in your pocket, and you don’t know it until you feel the burn on your leg. Both of the ones I received had this problem. Wish I had read the reviews prior to ordering.",
      "rating": 1.0,
      "verified": true,
      "author": "mrgroessl",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "i did not have super high hopes for these just based on the price ...",
      "text": "i did not have super high hopes for these just based on the price but i have to say, the fit and finish on them is rather good. the lid has a very firm and crisp detent in it and closes with no noticeable gap. ill be getting more of these, they will make nice gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "j",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Quality Product, Packaging & Service from Seller",
      "text": "The product is built with high craftsmanship and material, precision cut metal with a solid feel and good weight. The hinged cap has an appropriate amount of spring load and fits snugly upon close, but can be opened with one thumb. The beam (flame) is solid, consistent and durable. The USB charging cable & gift box are of high-quality design and appearance. The seller follow-up has been professional and sincere. We were also provided with a free one-year extended warranty in writing.",
      "rating": 5.0,
      "verified": true,
      "author": "G. David Lapin",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Excellent... would buy again without hesitation.",
      "text": "Got the double pack... both worked perfectly out of the box. Gave one to my daughter... she had wanted one of these for a long time, and she had a ball lighting all of her candle decoration Excellent... would buy again without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Quickly sent me a replacement.",
      "text": "The first ones I ordered, one of them woyld not charge. It was my first return to Amazon in years of ordering. It was very hassle free to get the replacement and they are both working fine after several months. Now very happy with this purchase. Would highly recommend, especially if you you are a smoker in a windy state like Kansas!",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Franklin",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Rechargable lighter",
      "text": "Works great so I ordered a two pack, then quit smoking after that. So I git them sitting on a shelf collecting dust. Should have quit before ordering. Lol, But they work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "But these lighters are fantastic. I was so tired of using butane lighters ...",
      "text": "I don't write reviews of items because most of the time they speak for themselves. But these lighters are fantastic. I was so tired of using butane lighters and having to refill them everyday. Took a few lights to get used to and the sound is kind of cool. The weight of it makes me feel that this lighter will last a long time for me. Since I am handy with a soldering iron I will be able to replace the battery when it doesn't hold a charge. Buy this item and you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Garcia",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "It really is one of my favorite purchases recently its very convenient and for someone who ...",
      "text": "It really is one of my favorite purchases recently its very convenient and for someone who smokes and is friends of smokers normal lighters dont last that long and this solves the problem. Great item. Only small thing is it makes this high pitched noise when in use. But other than that its awesome and ive recomended all of my friends and family to this specific item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Works but very short battery.",
      "text": "Loved the concept of this product. Works great but the battery life is very short. If used regularly it lasts less than 24 hours before you need to charge.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "What a amazing little lighter",
      "text": "WOW! What a amazing little lighter,just what I needed.It’s very small but so useful tools to have around.I love them so much that I ordered another 2 pack Incase of emergency needs. They also gave me free extended warranty for a year. I’ll definitely order again in a future. Thank you for your wonderful product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer I like To Edit my review ",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Looks good, works great, lasts a long time.",
      "text": "Liked that there was 2 electrodes instead of 4, and a higher output between them. Would buy them again, the last one l had lasted 3 years and was pretty beat up and still worked good.",
      "rating": 4.0,
      "verified": true,
      "author": "William D.",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Stopped working after 5 months",
      "text": "After five months of use infrequent use, the lighter fails to charge. I've only used the lighter to burn incense and have changed it a minimum of three times since I've bought it. I'm surprised to see it fail after a few months. You get what you pay for. If you're looking for a long-term solution for a quality lighter. I suggest you look elsewhere.",
      "rating": 3.0,
      "verified": true,
      "author": "Charlton Barker",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Burn hazard",
      "text": "I am a smoker and carry my lighters in my pocket. When I went to grab the lighter it was very hot. The lighter was pushed up against my cigarette pack and it lit even though the top was closed. I don't know if it is a design flaw or if I just got defective lighters.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "The Saberlight can save you money from spending on gas lighters.",
      "text": "I like that this product is rechargable, windproof, and waterproof. The packaging is beautiful, the design is elegant, and the product works. My mom will be using this to light her cigarettes, so we'll spend a lot less on prices of gas lighters. The only thing I disliked about the product would be the fact it came in a box much bigger than necessary, but even then I appreciate it. They care about the customer's opinion and the quality of their product.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Stafford",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "highly recommend!",
      "text": "this is really cool and convenient to use! i bought this for my boyfriend and i because we always complain about lighters losing the spark so easy when it’s windy, and obviously that problem is gone! my only suggestion is make the electric part easier to access as the lack of flexibility on the part that opens makes it harder to light things that aren’t as easy to place directly in the electric part. other than that, really nice quality for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "It works.",
      "text": "I can light a cigarette while cruising on my bike. That's why I bought it and it works just fine. Not sure about the battery life yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Best lighter ever",
      "text": "Love them, work beautifully and very wind/wet resistant, used on first day outside in storm for hahas and they WORKED!!!Will buy more for gifts",
      "rating": 5.0,
      "verified": true,
      "author": "Amethyst",
      "helpful_votes": 2,
      "publication_date": 20171005
    },
    {
      "title": "Plasma is cool",
      "text": "Excellent lighter. It worked right out of the box with no charge. Worth the money. Definitely the coolest lighter I have ever bought.",
      "rating": 5.0,
      "verified": true,
      "author": "jake stevens",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Love them havent travled with them mayb problem with that Idk.",
      "text": "Great for on the go. I haven't tried to fly with these lighters and don't want to risk losing them. So that maybe a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Magen Wheeler",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "It's ok",
      "text": "Works good and seems like a good price, but in the picture seems like it has 2 electric violet lights. In reality it's just one, and is harder to turn on the cigarette. I had before others with double and works much better",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "This electronic cig lighter is so awesome, all you need is plug and chrge it",
      "text": "This electronic cig lighter is so awesome, all you need is plug and chrge it. and there you go, no worries about the wind blowing when your lighting up and no.need for butane. and it looks so classy and expensive! haven’t use it that much so i can’t tell how long before charging time, and for the price, it’s well worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "anthony c. dio",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Great invention!",
      "text": "I received the lighters in perfect condition and in a timely manner! Im very pleased with mine as is my wife. Shes blind and still smokes but regular lighters were always so difficult for her until I happened to search just by chance on Amazon! Thank you again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "I like it",
      "text": "works great, the charge lasts still. I'm must have used it dozens of times and still no recharge required. I even gave one a gift to my gadget oriented sister. Just beware the mouth between the area that creates the fire is small. i was able to light candles, light paper on fire to start a pit fire. I'm impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "APC",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "easy to carry",
      "text": "I have one in the car for emergencies, and camping. Works great. will light up even wet items after a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou ",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Nice lighter but.........",
      "text": "Order the set of two lighters. Nice, small, easy to use. My concern is safety in that there is no off switch, you can hear the slight buzzing sound of the lighter operating even with the lid closed. This could be a major safety problem if you have it in your pocket or in a drawer (where it will spend most of the time, nonsmoker here) and something presses against the power button. Although I will keep them I purchased another model with both a on\\off switch in the base and will not operate with the cover closed.",
      "rating": 3.0,
      "verified": true,
      "author": "DChism",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Address to return defective lighters",
      "text": "Right now two of my lighters will not charge up, looking for an address to return and replace. They are great lighters and I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Bertil H Johnson",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "The lighter works the first time everytime. I would ...",
      "text": "The lighter works the first time everytime. I would give it 5 stars but the top cap doesn't open wide enough and the closely mounted prongs make it very difficult to use with cigars. If I were a cigarette smoker it would get 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Damon Fizer",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Does not work to light candles",
      "text": "These work great to light cigarettes but not for candles which is what I bought them for. The cap does not flip back all the way so the arc cannot touch candle wicks",
      "rating": 3.0,
      "verified": true,
      "author": "imlynnadok",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great product",
      "text": "It works great and looks so amazing. Thr design makes it a little difficult to use it with some candles but not a biggie. I still th8nk this is a 5 stars product",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Reviews",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "It hasn't melted yet",
      "text": "These arc lighters worked well for my flux capacitor experiment. It handled the current rather well I must say. The other lighters melted.",
      "rating": 5.0,
      "verified": true,
      "author": "Mad Scientist ",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "I like it",
      "text": "These are pretty cool you have to hold your whatever on it to light or very very close and slow for us inpatient heavy smokers",
      "rating": 4.0,
      "verified": true,
      "author": "Scott W Dabbs",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Quality",
      "text": "The overall quality of the product is outstanding. We are in Southern California and spend a lot of time in our backyard, not having to buy lighters or butane is a great convenience.",
      "rating": 5.0,
      "verified": true,
      "author": "roger f.",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "I love this, considering no more lighter fluid was a ...",
      "text": "I love this, considering no more lighter fluid was a plus for me. I got a chance to use it while out and it was rainy out windy, etc. People around me were amazed as well myself. It took one chance and I was smoking in no time. To top it off, here comes Jason from the company with a well appreciated follow up. Thank you Jason may your family small start up business be a world success.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurtis Solomon",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Great",
      "text": "I’m not sure if it is just me but a little hard to use . Great for what I purchased for though in car and on beach . I would def. recommend just have to get use to them",
      "rating": 4.0,
      "verified": true,
      "author": "Maxxine",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Fast shipping. They both work perfectly as expected. ...",
      "text": "Fast shipping. They both work perfectly as expected. I really appreciate the note telling me about the extended warranty. Thanks for everything. Nancy F",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy F",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Great Gift!",
      "text": "The double pack of lighters arrived and will make wonderful stocking stuffers for my husband. Better still, the packaging is really nice, each lighter is in its own sturdy black box, so they're easy to wrap and look like high quality products. I'm quite happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Stays charged 1 day or less",
      "text": "Cool don’t know any other word to describe. Could last longer on a charge. Will light a smoke or start a fire rain or shine",
      "rating": 5.0,
      "verified": true,
      "author": "William E. Hearn",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "No fuel needed!",
      "text": "Just charge it and you're good to go. Very stylish! Just love it since it requires no fuel.",
      "rating": 5.0,
      "verified": true,
      "author": "Miles",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Battery charger does not fit into lighter.",
      "text": "Purchased one for myself and one as a gift. The gift lighters battery pack connection is too big for the lighter. Would you please send another. Was just given yesterday.",
      "rating": 2.0,
      "verified": true,
      "author": "Helen C. Minotti",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "One stop working already",
      "text": "One stop working already. Pls, can client support connect to check what is the issue? Thanks.",
      "rating": 1.0,
      "verified": true,
      "author": "Baroni",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Not very useful with candles",
      "text": "I bought these to light candles unfortunately the shape and size of the lighter made it difficult to light",
      "rating": 3.0,
      "verified": true,
      "author": "Katrina Krisner",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Cool product",
      "text": "Fantastic seller. Even sent a warranty on the lighter to my email. The product is just as described and a gift to my dad for Christmas. He will love it.",
      "rating": 5.0,
      "verified": true,
      "author": "KAud",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Seems like I push the button when it is in my ...",
      "text": "Seems like I push the button when it is in my pocket closed - meaning it is dead when I need to use it. If I leave it home it is charged, but not where I need it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason Meservy",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Nice to have around.",
      "text": "Currently I am pleased with my Sabrelight, because it is performing better than the previous ligthers I have owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Walker",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "So far so good",
      "text": "Nice solid feel, lid snaps closed well But it will ignite even when the lid is closed. Makes utter kinda scary if you carry anything more than just lighter in your pocket.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Works Well",
      "text": "Seems to take a while to light a cigarette, could be a issue with battery life",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan W.",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "AWESOME",
      "text": "I bot 2 of these a few months back and they are fantastic. I just bot more for Christmas gifts. You can't beat the quality and price. Buy some today you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "David Graves",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great value",
      "text": "Great value and both work. Feels good in my hand and the button is finally in the right place!.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Davis",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Tiny lighter",
      "text": "Great little thing, but would work better if I was lighting toothpick sized cigarettes. You have to work the cigarette around the lighter to get it lit, but it does work",
      "rating": 4.0,
      "verified": true,
      "author": "The Haunest Truth",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Can’t go wrong with this lighter",
      "text": "I got this lighter to use at the beach. It’s so hard to light a cigarette in that wind. I received my lighters promptly & am very pleased with them. They’re easy to charge & they sent me a one year warranty on anything that goes wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Branson",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Nope!",
      "text": "Crapped out after one charge. Now it’s garbage. Do not buy this item. UPDATE: both lighters ended up in the trash within a month. Why? Because they were trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "great quality",
      "text": "i love them..i’m not a big smoker so using a regular lighter on a daily basis is a hassle esp in philadelphia the wind constantly blows them out or the get lost or stolen by more avid smokers...with the saber light i don’t worry about whether or not i’m going to be able to light my product. It was a good purchase have definitely recommended it to others",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Works great at the beach",
      "text": "Works great at the beach. Girlfriend loved it because she was able to light up a joint while riding her scooter around San Andres.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20171204
    }
  ],
  "product_meta": {
    "title": "Saberlight 2 Pack - Rechargeable Flameless Plasma Beam Lighter - Electric Lighter - Plasma Lighter - Rechargeable - no Butane - splashproof - Windproof",
    "rating": 4.2,
    "specifications": {
      "Package Dimensions": "4.8 x 3.5 x 2.2 inches",
      "Item Weight": "9.6 ounces",
      "ASIN": "B073BY1W7Q",
      "Batteries": "1 AAA batteries required.",
      "Customer Reviews": "4.2 out of 5 stars1,395 ratings4.2 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 26, 2017"
    },
    "categories": [
      "Home & Kitchen"
    ],
    "price": 37.0
  }
}