{
  "website_summaries": [
    {
      "verdict": "A sturdy bike basket that's suitable for most bikes, but not all. If it will work for your bike and dog, it will provide stability thanks to the steel mount and safety leash.",
      "pros": [
        "The safety leash on the inside of the carrier provides security by attaching to the dog's harness",
        "Doesn't tend to sway",
        "Mesh sides provide air flow for pets",
        "Comes is various colors"
      ],
      "cons": [
        "Somewhat challenging to attach",
        "At least one owner had issues with it fitting a mountain bike"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bike basket",
      "text": "Very well made, big enough for my two Yorkies, Bacca & Daisy love it!!!!!! Best basket to purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly Shever",
      "helpful_votes": 35,
      "publication_date": 20170804
    },
    {
      "title": "New found freedom!",
      "text": "Pet Pilot is worth every penny! Designed well and very sturdy. The attaching and locking mechanisms are ingenious and easy to use! The leash attachment is secured from two sides, instead of one. From the very first time, Lulu, a 10 pound Malti-poo, felt safe and comfortable. She loves her new ride! She says, \"Best thing since liver treats!\" Mommy likes that the grey inserts match her bike!",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby5110",
      "helpful_votes": 26,
      "publication_date": 20171115
    },
    {
      "title": "Very easy to install",
      "text": "Very easy to install. Love that it is metal instead of plastic. My 12-14 lb Cavapoo is a little talI so I had to get a heavy duty carabiner to extend the leash. I think I need wider handlebars to compensate the weight (or just get used to having a basket on the bars). Overall I am glad I chose this basket. Also, because it is removable so without my dog I can go to market and take off the basket to shop.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Briggs",
      "helpful_votes": 39,
      "publication_date": 20170818
    },
    {
      "title": "sturdy mounting systems",
      "text": "Well built, sturdy mounting systems. Installs in a few minutes with a screw driver. My dog is an 18 pound mixed breed. She fits, but she fills the basket. It is perfect for our other dog (Yorkie). Get product at a fair price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20171101
    },
    {
      "title": "The best pet carrier. Great for RV life. Easy on and off bars",
      "text": "The best pet carrier. Great for RV life. It’s eway to get on and off the handle bars. This is good for towing your bike as we do on the RV. Basket is clothed and can be removed for washing. This basket has the dog lash coming from both sides so you do not have to worry about your dog being able to go o we one side. Has a handle that leans over and Velcro Strip folds over the edge and the basket latches to the top of bracket with the handle. So easy to put on and remove. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Ward",
      "helpful_votes": 3,
      "publication_date": 20180402
    },
    {
      "title": "Great for small dogs",
      "text": "Great for small dogs! Fits my 9lb chi/mix perfectly. - has integrated tether(use this so dog will not fly Out when you hit a large bump!) - be sure to use the attached velcro strip to hold Down the handle during riding; lifting of the handle detaches basket from bike immediately. - use both sets of instructions when assembling the mount; as one has better illustration. - if installed correctly, the basket will be level and Very solid. *con* only one minor thing; not really a con but I would have liked to see reflective inserts Included with the included color pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle G",
      "helpful_votes": 3,
      "publication_date": 20180426
    },
    {
      "title": "12 pound Yorkie loves it",
      "text": "Easy to install on bike. My 12 pound yorkie quickly learned to like it. I put the basket on the floor with treats and he hopped in and out, then I picked the basket up, with dog in it, and walked around the house. Next step was bickering him in and walking the bike around with basket attached. Buckle strap is easy to adjust and worked great with a harness. Basket fits this dog perfectly - he can't move around very much so the bike stays stable. Now he can ride with me to the disc golf course and then I use the basket to carry my stuff around the course while he has a nice time on a leash.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Smith",
      "helpful_votes": 3,
      "publication_date": 20180317
    },
    {
      "title": "Great product for small dogs.",
      "text": "I was skeptical that this would do the job but I ordered anyway and love it. My 24 lb french bulldog fits perfectly in it. Easy assembly though the rubber bushings were too thick for my handlebars so I used electrical tape as the cushion between the bracket and handlebars. Easy to put basket on or take it off as needed. Overall very satisfied with this purchase and highly recommend it for anyone that wants to bring their small dog on their bike rides.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Tye",
      "helpful_votes": 4,
      "publication_date": 20180313
    },
    {
      "title": "This works great for us",
      "text": "This works great for us. Very sturdy. My dog is 14 pounds and active .the only change I would make if I could is I wish it was a tiny bit bigger. And had a ledge for her to rest her paws on ...on the top of the basket",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Katz",
      "helpful_votes": 4,
      "publication_date": 20171210
    },
    {
      "title": "Totally Safe Ride fir My Buddy",
      "text": "My 5 month old Yorkie, Ozzie, LOVES this ride!! He now wears goggles if there are annoying bugs!! The basket is very sturdy and also comfy for Ozzie. Two great mesh pockets. We love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "K Jones",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "puppy basket",
      "text": "good quality but to small for my toy poodle wish you would advertise larger ones",
      "rating": 4.0,
      "verified": true,
      "author": "Neal Munn",
      "helpful_votes": 5,
      "publication_date": 20170919
    },
    {
      "title": "Perfect for what I needed",
      "text": "Perfect for what I needed. It is secure and sturdy and I feel like my 10lb Chihuahua is safe during a bike ride. Easy to remove as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin F",
      "helpful_votes": 3,
      "publication_date": 20180404
    },
    {
      "title": "Ease of use",
      "text": "Super easy to install and also easy to remove carrier. Dog loves it and can be by their owner. Great idea and product is designed really well. Purchased one to try and now buying second for other dog and selling my burley.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "It took my 12 pound miniature poodle to get used ...",
      "text": "It took my 12 pound miniature poodle to get used to the basket. She has been riding in a basket on my bike for 13 summers - the old basket was larger - this one is more compact but it helps me as her weight is more centered.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary E. Carr",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "My dog loves it",
      "text": "Perfect for rides along the beach and around town. My JRT mix fits perfectly and really enjoys it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chach",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "which is good, so she can't move around",
      "text": "My chunky Chug is right at 20 lbs. She fits but it's snug, which is good, so she can't move around.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "Great product but not big enough.",
      "text": "Loved the seat, but had to return and order the next size up.",
      "rating": 5.0,
      "verified": true,
      "author": "TTzmommy",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Five Stars",
      "text": "great dog basket for under 10 lbs dog. Sturdy. Does not shift around",
      "rating": 5.0,
      "verified": true,
      "author": "Mark S. Taylor",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Five Stars",
      "text": "Great product. My 3.5 pound chihuahua loves to go for rides! It's well built and very stable.",
      "rating": 5.0,
      "verified": true,
      "author": "karen westrick",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Our 4lb Chihuahua loved riding around in it",
      "text": "Our 4lb Chihuahua loved riding around in it. We live in Florida, so the dark interior color (black) seems to absorb heat, but while riding the vented front and back allowed for good airflow. The installation went well. Look forward to many more rides!",
      "rating": 5.0,
      "verified": true,
      "author": "Lora Pricenor",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Easy return when I realized seller sold a larger basket",
      "text": "Easy return when I realized seller sold a larger basket. Really a quality product!! Would definitely recommend both product and seller!!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 2,
      "publication_date": 20180513
    },
    {
      "title": "Super safe and easy",
      "text": "Love love this basket! Is perfect for my 5 lb Papillion!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy ",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Good quality and exactly what we were looking for but ...",
      "text": "Good quality and exactly what we were looking for but I have to say that is too heavy. After 20 min riding my bike with my dog one that is one 9 Pounds my arms were sore.",
      "rating": 4.0,
      "verified": true,
      "author": "Florida2007",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "... bikes the basket hit the front tire not a good design",
      "text": "They didn’t fit our mountain bikes the basket hit the front tire not a good design",
      "rating": 1.0,
      "verified": true,
      "author": "nancy hawkins",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "This is one of the best things I have ever purchased",
      "text": "This is one of the best things I have ever purchased. My dachshund is partially paralyzed, so it's been a great way to help him get out and see the world! The basket is very secure, strong, stable, and comfortable. The interior is easy to clean and remove with the velcro, and the basket is easy to remove. My dachshund fit perfectly in this basket, and he weighs about 14 pounds.",
      "rating": 5.0,
      "verified": false,
      "author": "Ashley Hancock",
      "helpful_votes": 9,
      "publication_date": 20180106
    }
  ],
  "product_meta": {
    "title": "Pet-Pilot Original Dog Bike Basket Carrier | 10 color options for your bicycle -(5-Color)",
    "description": "PET-PILOT BIKE BASKET \n\n Innovative - UPGRADED design (2018) - with a steel frame and mount that are made right here in the USA\n\n Strength, Stability, and Comfort and \"Best in Class\" weight capacity are the major features of this dog bicycle pet carrier that was upgraded for 2018. With its sturdy, steel frame and mount ....this new Bike Basket for small dogs and pets has both you and your pet covered\n\n MAIN FEATURES \n\n - Top Opening is 14\"x 9\" (padded floor is 12\"x 7\") and 8.5\" deep\n\n - Cooling Air Flow - through a front mesh air vent !!\n\n - Steel Frame - Steel Handlebar mount with rubber bushings\n\n -Padded foam floor w/ Thick Sherpa lining\n\n - Is your pet too heavy for this basket ???\n\na. Body Size and Leg Length are KEY!! … not your pets weight.\n\nb. If your pet fits comfortably – the steel mount will support your pet, guaranteed!\n\n - safety leash can be adjusted to accommodate taller dogs - upper bar or lower bar attachment points\n\n - Side mesh pocket for keys, cell phone, leash\n\n - Side mesh water bottle holder\n\n - Reflective silver safety strip on front and sides\n\n - 2-point, chrome clasp, safety leash (attaches to dogs harness)\n\nMORE DETAILS \n\nThe Pet-Pilot is designed to carry more weight, without swaying, than any other front bicycle dog carrier on the market today. Patented handlebar mount is the key stability. Other bike baskets tend to wobble when loaded ....not the Pet Pilot. Fast and easy attachment method used to lock the bicycle basket in place makes it very convenient to switch between \"Pet Rides\" and \"People Only\" rides.",
    "rating": 4.4,
    "feature_bullets": [
      "Best for pets weighing 8 pounds or less. Tight fit for your pet? A Larger \"MAX\" model is also available!.. please double check the measurements before ordering. MEASUREMENTS: Top Opening is 14\"x 9\" - side walls are 8.5\" deep |Padded floor measures 12\" x 7\" (measure your pet sitting to determine a comfortable fit- If your pet fits comfortably – the steel mount will support your pet, guaranteed!",
      "STURDY DESIGN: Can carry more weight, without swaying, than any other front bicycle dog carrier on the market today. The patented handlebar mount is the key to this stability",
      "QUICK INSTALLATION: Installs securely in 5 easy steps |Not compatible with most E-Bikes, the mount handlebar clamps have a 2.5 inch space between them which is not enough to clear the electronics on E-Bikes.",
      "FEATURES: Cooling Air Flow - through a front mesh air vent | Padded Top Edging",
      "SAFETY: 2-point, chrome clasp, safety leash (attaches to dogs harness)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "15.25 x 10.85 x 9.65 inches; 3 Pounds",
      "Date First Available": "July 14, 2017",
      "Manufacturer": "Travelin K9",
      "ASIN": "B073XNX68C",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Carriers & Travel Products",
      "Dogs",
      "Pet Supplies",
      "Bicycle Carriers"
    ],
    "price": ""
  }
}