{
  "website_summaries": [
    {
      "verdict": "A safe, reliable and FDA-approved electric wheelchair.",
      "pros": [
        "Premium rear wheels and footrest",
        "Joystick provides seamless steering",
        "Front wheel shock absorber delivers tremendous stability"
      ],
      "cons": [
        "Sometimes can be tough to lift, even when it is folded"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It is only for 220lb. Not like Amazon to 295lb",
      "text": "I would give 0 stars if I could. The chair was pulling to the right and each time I needed to correct direction it almost came to a stop making it hard to keep up with a walking person Got stock in grass and had to push it out to a sidewalk After that when crossing a street and coming up on the sidewalk the linking pin broke, the chair folded and I flipped backwards hurting my elbow (see pics) Amazon states the chair is up to 295lb; owners manual (poorly written ) to 220 lb (100kg)",
      "rating": 1.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 53,
      "publication_date": 20181014
    },
    {
      "title": "Reliable, durable, comfortable",
      "text": "This is a very nice portable electric power wheelchair. The 2 batteries provide plenty of power. Spent a whole day at Universal Studios using just one battery. Comfortable and reliable. Seller continues to stay in contact to make sure chair continues to function properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Freddy Carbonawitz",
      "helpful_votes": 46,
      "publication_date": 20180620
    },
    {
      "title": "Sporty, foldable wheelchair!",
      "text": "I purchased this chair for my dad who is 75. He cannot walk for very long but did not need a full size wheelchair so this was perfect. It's very comfortable so far and he liked the sportiness of it and the quality construction. It's foldable but a bit heavy for him to lift @ 50lbs into the back of his Honda Pilot SUV. The seller is going to send us a travel bag as a gift so we are looking forward to see how it works as far as getting it into a travel bag.",
      "rating": 5.0,
      "verified": true,
      "author": "DragonLady",
      "helpful_votes": 72,
      "publication_date": 20171201
    },
    {
      "title": "I couldn't be happier with this chair, it's AWESOME!",
      "text": "I recently broke my leg and was told it would be at least 6 weeks before I could even step on it again. That's a long time to use a walker or regular wheel chair. So I ordered this instead and I couldn't be happier. This is state of the art and allows me to navigate my home without needing help from anyone. It's comfortable to sit in for long periods of time too. The only downside was learning how it all works from the Owner's Manual. But the seller kindly emailed me when it shipped and included more pictures that enabled me to resolve those issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Gold Acres",
      "helpful_votes": 48,
      "publication_date": 20180324
    },
    {
      "title": "You will love it",
      "text": "I love this chair!!! It’s so comfortable and works really well. My husband loves it too. Before we had this, I had a really big chair he had to get up a ramp and put on a trailer. Which got harder and harder as we aged. Now he just folds it up and puts it in the trunk of the car. I always have it if I need it. People always ask me about it. Most importantly this company has the best customer service ever.",
      "rating": 5.0,
      "verified": true,
      "author": "sheri Level",
      "helpful_votes": 60,
      "publication_date": 20180719
    },
    {
      "title": "Seat belt",
      "text": "The chair works nicely and is just what was wanted. The delivery was delayed and it took a long time to come. The seat belt is terrible. It pulls out and through the material so it is not usable and it is very short. We ended up getting a new one at a mobility store.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Gagen",
      "helpful_votes": 62,
      "publication_date": 20180917
    },
    {
      "title": "Solid, secure, good purchase.",
      "text": "Comfortable, solid, feels secure. Turns in tight places. Has made my life so much easier. Hard to get in and out of and every door jamb is my house is now marked because of my poor judgement while driving through. Regular doorways are not designed for wheelchairs! But I would't give it back. I am getting better at going through the door ways.",
      "rating": 4.0,
      "verified": true,
      "author": "PDK",
      "helpful_votes": 53,
      "publication_date": 20180804
    },
    {
      "title": "Five Stars",
      "text": "It's comfortable and built for and average size person. But it's hard to get out of",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Sue",
      "helpful_votes": 52,
      "publication_date": 20180731
    },
    {
      "title": "Great Electric Wheelchair",
      "text": "This chair is so great. It is light weight for my husband to get in and out of the SUV with no problems. It is comfortable to sit in for 8 hours. The company that makes them will be glad to help if you have any questions. So, please if you are looking for a chair this is the one use should be getting.",
      "rating": 5.0,
      "verified": true,
      "author": "Mabel S Mastro",
      "helpful_votes": 23,
      "publication_date": 20180829
    },
    {
      "title": "Nice chair",
      "text": "Chair is of good quality. Just used it at Disneyworld it was nice to not have to push my daughters chair. It is a little awkward to fold and lift but fit in the trunk of my car. Best part was that it fit in Wheelchair closet on airplane so it did not have to be tagged or stored underneath plane, in the past daughters chair has been damaged in cargo hold.",
      "rating": 5.0,
      "verified": true,
      "author": "brian mccormick",
      "helpful_votes": 44,
      "publication_date": 20190805
    },
    {
      "title": "Helpful, good product and responsive. Delightful",
      "text": "Purchased for a 95 year old very active man, chair has performed flawlessly and within expectations; communication with seller has been above average, extremely helpful and fast responses; a pleasure to deal with.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Tamara",
      "helpful_votes": 48,
      "publication_date": 20180628
    },
    {
      "title": "Hard to use, too heavy for a woman to lift",
      "text": "Sadly this was wasted money for us! It’s too heavy and bulky for me to lift in an out of the car for my 94 year old mom! She struggled to get into the chair because of the stationary footrest and having to straddle it to sit down! It’s hard to unfold, the controls need to be on the left for my mom but the cord isn’t very accommodating for that and so many steps I have to try to remember to fold and unfold the chair. It’s only been tested twice and sits unused in my home! Backing up this chair is not accurate it goes crooked! Sorry to say it’s not been a happy purchase for us.",
      "rating": 2.0,
      "verified": true,
      "author": "Grandma & Grandpa",
      "helpful_votes": 7,
      "publication_date": 20190815
    },
    {
      "title": "Portable, light weight",
      "text": "I purchased the wheelchair for my nephew overseas. I was concerned about the condition of the item with the travel. It arrived in a perfect condition. The packing was excellent. My nephew loves it. It is very portable. Though he has spastic cerebral palsy, he goes to college and he is on the move all the time. This was a life saver for him that replaced his old bulky chair. The battery time is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "MOHAMMED A.",
      "helpful_votes": 9,
      "publication_date": 20181218
    },
    {
      "title": "Five Stars",
      "text": "Love the chair! Works great I would buy another if I needed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamog",
      "helpful_votes": 23,
      "publication_date": 20180105
    },
    {
      "title": "Easy Mobility, Light so I can fold and put in my car by myself and gives me independence.",
      "text": "I LOVE my Electric Power Wheelchair! It is small, compact to fit in my car. Easy fold up, not heavy. I have more independence and able to use it alone without help in putting it in my car. Love the option of how fast or slow I want to go. Great at going over different types of terrain, and comfortable that I won't tip over or fall off. The shipment was great and fast. Love the duel batteries, easy to charge! A+++ Thank you for helping me with my independence and mobility either at home or outside. I would recommend this electric wheelchair to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "TorresLa",
      "helpful_votes": 7,
      "publication_date": 20190213
    },
    {
      "title": "Great compact wheelchair",
      "text": "My husband has MS a needs to use a wheelchair. This is perfect as it fits in our SUV. Sturdy and less bulky so it gets in tight spaces. Perfect to take traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Hopkins",
      "helpful_votes": 41,
      "publication_date": 20190809
    },
    {
      "title": "Comfort and lightweight",
      "text": "I'm disabled and used it going to the park rode all day and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181229
    },
    {
      "title": "That this product will do what it says it will do.",
      "text": "It is very easy to use. The company that I bought it from has been helpful to help me with any question that I have. I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "JOSEPH",
      "helpful_votes": 7,
      "publication_date": 20181020
    },
    {
      "title": "More than I expected",
      "text": "I am very happy with my chair. It makes me feel much more independent than other electric chairs. I did not know it would be so cute comfortable. It weighs a bit more than 50 lbs but folds up like a stroller for easy carrying in the car. Great investment.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura bell",
      "helpful_votes": 3,
      "publication_date": 20190529
    },
    {
      "title": "Great, quality and highly nimble wheelchair",
      "text": "Bought this for my sister who has Parkinson's. She just went through major surgery on one foot, and is unable to put weight on it for up to 3 months. This wheelchair has 2 batteries that she can easily manage, and is light enough for her to use inside her small apartment. It is also capable of running 10 mph or so, so she can use it to go to the convenience store and walk her dog. While staying inpatient rehab, the nursing staff made several comments about her wheelchair being one of the best they had seen.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 2,
      "publication_date": 20190722
    },
    {
      "title": "User friendly, lightweight, and easy to maneuver.",
      "text": "As soon as I received this power wheelchair I took it for a spin inside & outside the house. It didn't take a long time for my little wife to put it together. It is easy to fold & unfold. It maneuvers easily through narrow spaces/ doors & it has a 360° radius turning maneuver ability. It is much lighter compared to my power scooter. It takes a little bit of time getting used to the joystick because it is quite different from my power scooter. My only suggestion is to put a rubberized texture to the joystick so it will not be too slick. Other than that I really like/love this power wheelchair...the Innouvo intelligent lightweight power wheelchair.",
      "rating": 5.0,
      "verified": true,
      "author": "buffalo gap",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Manuaverable not too big1",
      "text": "This wheelchair is compact, easy to maneuver and the right size for the average contemporary home. Easy to move between furniture and easily goes through doors. The speeds are great, although I primarily use the lowest speed indoors. Like how easily it moves in and out of forward to reverse. Gets up close to tables. Quiet in forward gears a little annoying in reverse but better than some others I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "BookMaven",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Nice set of \"Wheels\"",
      "text": "I am enjoying discovering what I can do with this new chair. I like that everything is straight forward and simple to operate. While I am unable to pick it up. Its light weight and potability is easier for my friends to lift and put in a car. I get compliments on its sleek design. The company has been kind and reached out to me several times to make sure I am satisfied. I am very pleased with this purchase. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "kimmyssong",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Overall okay.",
      "text": "I use it to get around because of difficulty walking. I haven’t tried folding it so I don’t know if it’s easy to fold. It’s quite comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Houston",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "very convenient and fast",
      "text": "I am so very happy to get this power chair. I bought this about 6 months ago for using at home. It is so easy to maneuver with a very small turning radius (rotation 360 degree) that I can change the direction freely in the small space. So far, I am so enjoying my daily life with this power chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard ",
      "helpful_votes": 3,
      "publication_date": 20190319
    },
    {
      "title": "Perfect chair for me",
      "text": "I love this chair! It was so easy to set up and use. I needed it to get down those long corridor halls in the hospitals to see my husband. A little heavy to load in my high Explorer so I take out the batteries, lift up one end and slide it in. It runs so smooth and I even use it outdoors to get to the mailbox. Best chair for me!",
      "rating": 5.0,
      "verified": true,
      "author": "bjo2298",
      "helpful_votes": 2,
      "publication_date": 20190302
    },
    {
      "title": "Great Wheelchair with Responsive Customer Service",
      "text": "We have had our wheelchair for almost a year and we love it. It works well and the company has been very responsive when we have had questions or needed replacement parts due to wear and tear. This is better service than you receive from most companies. We would buy this chair again without hesitation. It has been taken on vacation multiple times and is great on a cruise ship. Being lightweight was the primary reason we purchased it, but it’s maneuverability and ease of use are it’s strengths. People constantly stop us and ask where we purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Coralie Bouchard-Carty",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Great item got those with limited mobility.",
      "text": "This is a great item for those with limited mobility. I also have limited strength and find it difficult to get the chair in and out of standard trunk. However, if I don't have assistance it helps to remove the batteries to make it much easier. Great item overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied customer",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "CAN SOMEONE HELP ME, PLEASE?",
      "text": "Would love to give it a good review, BUT I misplaced manual and cannot get one or see it online.! Did pull manual up but it was in a foreign language and when I tried to get it in English. nothing happened. I bought this for my ;husband and we haven't been able to figure out how to charge battery. That' s what I needed the manual for. Of course, its my own fault, because I misplace the original manual but I didn't think it would be so hard to find one on the internet.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "If you’re sensitive to loud electronic beeping don’t buy this chair.",
      "text": "I bought this for my brother hoping it would be easier for him to get around in.........and it is. However, the beeping sound when the chair is in reverse is so loud and annoying that he never uses the chair. If I had realized this beforehand I never would have purchased it. I should have returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tara McDonough",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Horrible customer service!",
      "text": "I ordered this wheelchair in October 2019, and started using it full time in December 2019. At that time one of the batteries started failing. I called Amazon who refused to cover the battery because I had the wheelchair over one month. (For a $2100 wheelchair, with a $279 battery! I think this is horrible.) Amazon did not provide help to contact the manufacturer, other than saying they were in China. Awful, awful customer service--especially on an expensive item like this!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Almost a decent wheelchair but the battery is faulty",
      "text": "I wish I could recommend this wheelchair but one of the batteries is faulty and the support has been slow in helping resolve this issue even after going through to show a video of the issue happening. I am limited in range and still dependent on using this chair until I can figure out another option.",
      "rating": 2.0,
      "verified": true,
      "author": "Steven Bassett",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Best power chair ever",
      "text": "This chair is everything I have been looking for. Really gives me a chance to go places that would have been too difficult in a manual chair. Only had for 1 month but I’m highly impressed so far? I have used other power chairs which I HATE! It give me a part of my life back.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Mudgett",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Compact and comfortable",
      "text": "Absolutely love this chair for my mother and she loves it. It’s very comfortable and convenient to take with us wherever we go.",
      "rating": 5.0,
      "verified": true,
      "author": "Nonna Gambino",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "We continue to enjoy the electric chair",
      "text": "My Dad loves riding his chair all around the outdoor garden center! It's lightweight enough to get in and out of the van and allows him to enjoy some time outdoors among the flowers. It's easy to maneuver and does not take up a lot of room going down the aisles. He's able to go more places now as we don't have to worry about him being on his feel for any length of time. I would highly recommend this electric chair!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Harmon",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Dad loves it",
      "text": "I purchased this for my 94 year old father. He likes the maneuverability and finds it’s easy to operate. It folds and stores in our SUV for trips. The only cons are battery life and does not move well on grassy surfaces.",
      "rating": 4.0,
      "verified": true,
      "author": "G Lewis",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great value, lightweight, easy to operate, service is exceptional after purchase",
      "text": "Product is absolutely amazing. My mother is in a long-term care facility, and it is better than any other product we have seen",
      "rating": 5.0,
      "verified": true,
      "author": "Zman",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "very good!",
      "text": "This wheelchair is very good. The best part for me is that it is easy to control and can turn in a small radius. So, it has made my going out more comfortable. And the service of this shop is quite kind and quick. I appreciate it very much.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaz",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Manufacturer cares about customer satisfaction",
      "text": "We found this wheelchair to be lightweight and easy for taking it shopping. My wife is paralyzed on the right side can steer the chair with ease. The manufacturer has been very helpful with any questions we have had. Would recommend this chair",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Powell",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Great product for my disabled father.",
      "text": "Great product. A bit expensive but worth it. My disabled father reclaimed some mobility and independence thanks to this chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "This is the best transportable electric wheelchair",
      "text": "Got this for my dad who is 77 year old. It is very confortable and works well. My dad loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kuo Fung Chen",
      "helpful_votes": 3,
      "publication_date": 20180926
    },
    {
      "title": "Get your mobile freedom back!",
      "text": "Bought this chair for my Dad who has difficulty getting around. The chair is great. Easy to set up and simple to operate. Folding the chair down does take some practice. The chair is comfortable and the perfect chair for someone that still wants to go out and do things but needs a little help getting there.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Howard",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Super chair",
      "text": "Easy to fold, maybe some difficulty in lifting but folds to carry on size, powerful enough to explore a village, charges quickly",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Pike",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "By far the best.",
      "text": "This has been a very valuable product for my Father-in-Law. He has been able to get around the house, get to Doctors appointments and travel with ease. This chair is much lighter and less cumbersome than larger less portable models. We have tried others and this one is by far the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Swenson",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Neat",
      "text": "It’s a very nice ride. Batteries lasted 2 years..but they are a little tricky to come by",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Excellent wheelchair",
      "text": "Excellent maneuverability, fast and sleek, purchased for my mother and she absolutely loves it. It is quite heavy to lift into a car, that has been the only challenge, otherwise I highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "MattD",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "A Nice Little Chair, Folding and Battery ain’t that good though",
      "text": "I got this for my grandpa and while it’s great, it’s quite small with very little space, it gets the job done. It dies a bit quick and maneuvering is pretty good. Folding is easy once you remember but it could be a lot easier than it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Angel A.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Living after Double knee surgery",
      "text": "My husband who was upset that I bought him a motorized wheelchair now can’t live without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucille",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "I think it was a good bye",
      "text": "Bought this chair for my grandmaw she is 84 years old and she loves it easy to move around the house and through doorways I also bought an extra battery But didn't really need it. batteries last long",
      "rating": 5.0,
      "verified": true,
      "author": "jerretmccaslin",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Portable",
      "text": "We love my son’snew portable wheelchair. He has so much freedom. It’s light enough and compact enough to carry everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "France de L. rosa",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "this electric wheelchair is awesome!",
      "text": "My mother is 100% satisfied with this chair. Mom is 88 years old, 4'11\" height, and 150 lbs, so this chair fits her perfectly. She says it is easy to maneuver herself using the charged battery; and her home attendant says it is easy to maneuver manually. Mom says she will recommend this wheelchair.",
      "rating": 5.0,
      "verified": true,
      "author": "Nali",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "I’m glad I chose this chair",
      "text": "I purchased this in June this year. I haven’t used this a lot, but when I have, it is everything It says it is.. It is very comfortable, handles well and is easy to fold and unfold. I researched all these types of wheelchairs for months, and am glad I chose this one. I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Hecker",
      "helpful_votes": 4,
      "publication_date": 20190828
    },
    {
      "title": "Would purchase the chair again!!!",
      "text": "Took our first trip on an airline with it, it was excellent. They let us stow the folded chair in the back of the plane. It is a great chair for portability and traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Norgart",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Lean slightly forward when going over hills or steps",
      "text": "We got it for my father in law who had his leg amputated last year. It moves around great! Rides in grass and goes but recently battery has died and we do not know how to replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "AmazonLuver",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great chair",
      "text": "The chair and service have been great. The chair is very compact when folded and has long battery life. My son gets a lot of compliments about the chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey P.",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "A good choice",
      "text": "My second try. Better than previous brand. A little small a little heavy but does the job and very maneuverable.",
      "rating": 4.0,
      "verified": true,
      "author": "Harold C. Nolde",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "One of the best motorized wheelchaira available.",
      "text": "Some of the plastic parts come apart too easily. The controller and night flash light occasionally become loose and fall off.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Electrical could be better",
      "text": "It’s not all that easy to pick up and put in a trunk. When u fold watch out for the cords I now have a short somewhere",
      "rating": 4.0,
      "verified": true,
      "author": "Tom  Boy",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Very nice wish I would have looked earlier",
      "text": "Nice light weight for me but not for my wife, but she loves it. A little hard to get into very nicea small vehicle",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy Flores III",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Love it!",
      "text": "Got it for my mom and it is so easy to fold and put in my trunk.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Smith",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "A good chair",
      "text": "Very well built,relatively easy to fold up. Just didn't work out for the person it was got for.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Love it!!!",
      "text": "It took me a while after receiving this Product to write a review!!! I can honestly say I love it goes great on grass have no problems with cobblestones it rides very smoothly! My husband folds it up no problems. One person can lift it to the car. last week we took an airplane ride I was able to ride it right up to the airplane then my husband folded it up took the lithium batteries out and the airplane workers put it underneath I am very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180822
    },
    {
      "title": "Folds easily, lifts easily and rides smoothly.",
      "text": "What a joy to be able to move around freely when visiting others and not have to ask for someone to push my transit chair. The wheelchair folds easily, in approximately one minute, as advertised. Lifts easily into trunk of car.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy E. Shaw",
      "helpful_votes": 23,
      "publication_date": 20180528
    },
    {
      "title": "Good Motorized chair !",
      "text": "My fiance (Matt) needed a motorized wheel chair to use inside our home to help relieve his ankle problems. Although the instructions can be confusing, it's good that they have pictures of the parts in question. Also, it's listed as lightweight but it's total weight w/batteries = over 50 lbs. I'm a strong woman but I have a hard time lifting this chair into our cars. However, it does maneuver well inside, easily makes tight turns & it's worth the price for a sturdy wheelchair. Highly recommend it & it doesn't take up much space.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy H",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Power chair saves the day",
      "text": "Purchased this chair for my son it is really light weight, great speed, and good quality. It saved me a lot of money buying this affordable great quality chair over National seating.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 5,
      "publication_date": 20181224
    },
    {
      "title": "Very well built & space age. Uncomfortable footrest.",
      "text": "Very well built & cool wheelchair but the footrest is uncomfortable & doesn’t fold up far enough to get off the chair easily.",
      "rating": 4.0,
      "verified": true,
      "author": "John Pomeroy",
      "helpful_votes": 4,
      "publication_date": 20190316
    },
    {
      "title": "I like the chair",
      "text": "I've had it for a year. I use it within my apartment complex. It's large with a lot of common areas. Comfort is good! I thought I could still manage to lift 50 lbs into my trunk. I cannot. I tried to slide it in on a blanket and for me that did not work. I recommend the chair. I also very much recommend their support system. They answer IMMEDIATELY. I made the mistake of putting the \"manuals\" on. Something I rarely rarely do. And then asked for help \"What's wrong\". They even figured that human error out.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "This is a fantastic chair. I have used it locally and look ...",
      "text": "This is a fantastic chair. I have used it locally and look forward using it when traveling. I, without hesitation, will wholeheartedly recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20181026
    },
    {
      "title": "Nice small mobile chair.",
      "text": "Bought this for my 81 year old Mom. She is tiny and this fits well. Only down side is that neither myself or her Personal Assistant can lift it in or out of car. About 45lbs and awkward. We will need to get a tailgate lift.",
      "rating": 4.0,
      "verified": true,
      "author": "Vanna",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Five Stars",
      "text": "makes it so easy for my husband to get around",
      "rating": 5.0,
      "verified": true,
      "author": "southern girl",
      "helpful_votes": 3,
      "publication_date": 20180802
    },
    {
      "title": "Easy to get around the house",
      "text": "I am using this wheelchair around the house. Also, since it is so easy to fold and open it is easy to put in the car trunk and take it with me whenever I go out.",
      "rating": 5.0,
      "verified": true,
      "author": "waltzing Mary",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Works as advertised",
      "text": "I got this chair for my wife she has mobility issues and this has made life a lot easier for her. We don't have to walk behind her anymore which she loves. The seat is comfortable and the chair moves pretty quickly. We are very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D Hicks",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "All around great product is",
      "text": "Great product. It’s no fun being handicapped but this chair makes it easier weight was an important consideration and my wife can lift it with the batteries out of the chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted Watson",
      "helpful_votes": 0,
      "publication_date": 20200307
    }
  ],
  "product_meta": {
    "title": "Innuovo Intelligent lightweight foldable Electric Wheelchair, Compact (Net Weight 50 lbs) Power wheelchair, Portable Folding Carry Motorized Wheelchairs, Durable Wheelchair",
    "description": "Excellent Details: \nStandard equipped with seat-belt and anti-tipper;\nEquipped with 2 batteries, each can go 6.25 miles with fully charged, two for 12.5miles.\nOverall Dimensions: 35.4 in x 23.6 in x 34.6 in\nSeat Height: 19.7 in\nSeat Width: 16.5 in(seat cushion)\nSeat Depth: 16 in\nArm Height: 8.3 in\nSeatback Height: 16.5 in\nWeight Capacity: 265 lb. (Manufacturer’s recommended)\nBattery Weight: 3.1 lb per battery\nWheelchair Weight without battery: 43.lb\nTravel Range 6.25 Miles (per battery)\n2 Brushless Electric Motors: 24V/250W (each)\n2 Lithium-Ion batteries: 24V/6.6Ah (each)\nMax Output Current of Controller: 35A\nMax Output Current of Charger: 2A\nFront Wheel - Solid Tire - Outside Diameter: 7.0 in\nRear Wheel - Solid Tire - Outside Diameter: 9 in\nMaximum Speed: 3.7 MPH\nBraking Distance: 40 in (on a level surface)\nMinimum Turning Radius 35.5 in\nMax Climbing Angle: 6 degrees-8 degrees\nEnjoy the Free Mobility Now!",
    "rating": 4.5,
    "feature_bullets": [
      "★THE SAFER CHOICE– Our electric implements a variety of safety features. These include a 360-degree joystick, solidly stable front and rear wheels, a foldable foot rest, dural motors, and extremely durable construction.",
      "★SIMPLE TO OPERATE – Using an innovative joystick design and an updated electric magnetic breaking system, our wheelchair gives you superior motion control and quick stopping. It’s adjustable anti-leaning rear design also keeps it perfectly stable. Also with the separate 2 high performance lithium battery design, keep left one side battery running for the chair and customers can backup 2nd batttery charged outside.",
      "★LIGHTWEIGHT AND EASY TO FOLD – Being built with an aviation aluminum frame and weighing only 50lbs, our power wheelchair is durable and incredibly lightweight. It’s also easy to fold in 3 seconds, making it perfect to travel with and store for later.",
      "★FANSTATIC STABILITY AND COMFORT – Thanks to our power chair’s unique 7.5cm thick seat cushion(with seat belt), it’s extremely comfortable and prevents against seat depression and bedsores, as well as protecting the caudal, lumbar, and neck vertebra from twisting.",
      "★SATISFACTION ENSURED – FBA service, best gift option."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "32 x 25.9 x 16 inches; 61.25 Pounds",
      "Batteries": "2 Lithium ion batteries required. (included)",
      "Date First Available": "July 10, 2017",
      "Manufacturer": "innuovo",
      "ASIN": "B073V11B1Q",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Electric Wheelchairs",
      "Wheelchairs, Mobility Scooters & Accessories",
      "Mobility & Daily Living Aids",
      "Mobility Aids & Equipment",
      "Wheelchairs",
      "Health, Household & Baby Care"
    ],
    "price": 2199.0
  }
}