{
  "website_summaries": [
    {
      "verdict": "An effective scalp scrub that works to heal and makes your hair look better in the process.",
      "pros": [
        "Recommended by hair professionals whose clients need an instant scalp pick me up",
        "We love that this scrub won't affect color jobs or other hair treatments",
        "Not only relieves itchiness but adds a boost of shine as well"
      ],
      "cons": [
        "Can dry your hair out if not followed with conditioner"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "If you want squeaky clean hair, this is for you",
      "text": "I'm military and have to wear my hair in a bun for 16 hours a day, 7 days a week. This stuff is a life saver for me. It cleans all the gunk (hairspray, etc) out of my hair-- way better than shampoo alone. Other reviewers didn't like how you have to really work the product into your scalp. I don't mind, I do it meticulously because the end product (squeaky clean, full, healthy hair) is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly S.",
      "helpful_votes": 20,
      "publication_date": 20180807
    },
    {
      "title": "Amazing Product That Works Immediately",
      "text": "Fantastic product, recommended by my barber to help revitalize my dry scalp. Only need to use a walnut sized drop to cover the entire scalp. The impact of the product was immediately felt. No itching, flaking or tightness and my scalp + hair felt softer. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Enrico",
      "helpful_votes": 23,
      "publication_date": 20180221
    },
    {
      "title": "Can’t be without it",
      "text": "I love this scalp scrub! I have an oily, itchy scalp and color processed hair that tends to be dry on the ends. This scrub does it all, cleans my scalp, doesn’t strip my color and leaves my hair soft, clean and easily styled. Love it so much I put it on auto delivery which is rare for me. I’m a product junkie, always sure that the next product will deliver the miracles I’m seeking. I found the gold standard for scalp scrubs in this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Romeo",
      "helpful_votes": 5,
      "publication_date": 20200712
    },
    {
      "title": "Great for volumebut haven't seen improvement to my scalp",
      "text": "Bought this product to try and rehab my scalp after many many years of balayage drying it out and a harsh Northeast winter, but not really sure whether or not it is doing anything to improve the health of my scalp. Definitely has not cut down on flakiness or itchiness whatsoever. A nice \"side effect\", though - the volume this product provides to my next-day hair is unreal. After using this product and air drying my medium length, mid-thickness hair overnight I wake up with the hair at my crown as if I had backcombed it.",
      "rating": 3.0,
      "verified": true,
      "author": "goldgoop",
      "helpful_votes": 9,
      "publication_date": 20180521
    },
    {
      "title": "Awesome product!",
      "text": "I get dandruff as the seasons change and so far there’s been nothing I can do about it. For me it’s just tiny flakes of dry skin, but nothing moisturizing helped. This actually removes all that dead skin while being gentle and adding a lot of shine. Love this.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily S.",
      "helpful_votes": 8,
      "publication_date": 20180401
    },
    {
      "title": "Love this line and product",
      "text": "I have very fine, oily hair with dry ends. Its really hard to find products that clean my hair without weighing it down and/or drying the ends. This scalp scrub is fantastic, not only do i absolutely love the scent but its helped heal my scalp damage from hard water, and my hair is soft, not weighted down, and the ends feel smooth. I love it so much I wont complain too much about the price, which knocked the score from 5 stars to 4. Bazinga.",
      "rating": 5.0,
      "verified": true,
      "author": "Saz",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Good scalp help",
      "text": "Wonderfully invigorating feeling on the scalp, does really help with flaking. Best followed by good conditioner.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemarie D. Hill",
      "helpful_votes": 6,
      "publication_date": 20180311
    },
    {
      "title": "Thought about shaving my head until this!",
      "text": "Thank goodness I found this lifesaver, I was confused Why my scalp felt like there was so much build up, I didn’t realize my expensive Goldwell shampoo and Conditioner were not doing the trick. After ONE wash my hair feels like I should be in a commercial, smells amazing and is so silky! My scalp feels so clean and I think I used too much but it definitely worked well above my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "That Awesome Guy",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Not for those with thick long hair",
      "text": "This product is really high priced but I was willing to try it as I have dry patches on my scalp that I struggle with. Problem is that for someone with super thick hair, it’s really impossible to get this product to my actual scalp - even with wetting my head and then putting into a bun and trying to get just to my scalp. It’s smells amazing and makes your hair squeaky clean (not sure that’s a good thing). I had high hopes but just not effective for me.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Jones",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Fantastic.  I'm healed.",
      "text": "Seriously, after 3 weeks using this scalp scrub 1x a week, my scalp is clean and build up free. I was ready to make a doctors appt. thinking I might have psoriasis on my scalp (after looking online)... I tried this & wash my hair 1x a week because of fragile gray/colored hair... and my scalp is HEALTHY & CLEAN! I can't believe it. Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeri",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Unimpressed",
      "text": "Bought based on magazine reviews \"life changing!\" \"You'll feel like you're at the spa!\" \"Worth the money!\" I didn't feel like it did anything sp coal and it was hard to get it on your scalp if you have any amount of hair.",
      "rating": 2.0,
      "verified": true,
      "author": "Missy Malick",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Best Hair/Scalp Removal of Buildup!",
      "text": "Love this! Put a bit on and rubbed in followed up with shampoo and I could feel the shampoo working! You don't have to follow up with shampoo but it sure feels great. I noticed my hair is more shiny AND its finally growing!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle G.",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Impossible to get through",
      "text": "The first time I didn’t section my hair it was nearly impossible to move the product. The second time I used it I sectioned my hair into four (and I cut my nails short so that the product wouldn’t get stuck there) Still nearly impossible to move the product on my scalp just ended up getting stuck in my hair and when my hair dried it was oily. I’m better off using the neutrogena anti residue shampoo. Doesn’t leave my hair oily and is affordable.",
      "rating": 1.0,
      "verified": true,
      "author": "Montse",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Be sure to follow with a rich conditioner, even a 30 minute one. Hair will be really dried out",
      "text": "Helped my itchy scalp. Easy to use. Made my hair shine like a diamond and made my color bright",
      "rating": 5.0,
      "verified": true,
      "author": "D.J. Denney",
      "helpful_votes": 12,
      "publication_date": 20180130
    },
    {
      "title": "Revitalizing lathering scrub!",
      "text": "Wow this feels like a spa product! It feels so amazing on my scalp - the scrub quickly turns to this delicious and thick lather where you can still feel the exfoliating scrub. I tend to have a lot of buildup from hairspray and I felt like it gave me a really good clean that made my scalp feel revitalized.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Doesn't Work",
      "text": "This product was TERRIBLE! It didn't feel like it removed any build up at all! It literally just made my hair feel greasy and dirty, even after following with the R+Co Clarifying Shampoo (another terrible product). Ugh, so disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Impulse buy",
      "text": "This is too messy and difficult to use in the hair. I use it as a rather expensive body scrub",
      "rating": 3.0,
      "verified": true,
      "author": "Flopsy",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "The feel.",
      "text": "The smell first off is so amazing. Love how it feels as you massage it into your scalp. My hair has been a bit damaged so with this I'm hoping for some rejuvenation.",
      "rating": 5.0,
      "verified": true,
      "author": "Lourdes delosRios",
      "helpful_votes": 3,
      "publication_date": 20180520
    },
    {
      "title": "Start with a small amount add small amounts of water to help it get to the scalp",
      "text": "Amazing for anyone with thick hair. Shampoo never gets all they way down to remove everything left by styling hair. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Decastro",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "What a waste",
      "text": "Does not lather Saw clumps of hair go down the drain :(",
      "rating": 1.0,
      "verified": true,
      "author": "Notmakingittotheym",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Did Nothing",
      "text": "Hoping this would help with my dry scalp that's also quick to get oily after washing my hair. Did nothing and I felt that it was hard to distribute throughout the scalp. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Very Thick",
      "text": "I was trying this product to compare with Kerastase. The R+Co is very very thick, and isn’t easy to massage into the scalp or even get out of the bottle. Going back to Kerastase.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Not worth the money AT ALL",
      "text": "I really, really wanted to like this stuff. But I didn’t. At all. It left my hair greasy and disgusting and didn’t solve any of my scalp problems. All in all I think it sucked, especially considering that it cost $40.",
      "rating": 2.0,
      "verified": true,
      "author": "Margaret Brown",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "This scrub is amazing. It feels sooooo good on my scalp and ...",
      "text": "This scrub is amazing. It feels sooooo good on my scalp and get my hair super clean. The scent is aromatic. I love it and would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Five Stars",
      "text": "Scalp felt really clean after and dandruff/dry scalp and itching was gone.",
      "rating": 5.0,
      "verified": true,
      "author": "CAtoVA",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Leaves scalp feeling fresh",
      "text": "Works well but is hard to scrub your scalp without tangling hair.",
      "rating": 4.0,
      "verified": true,
      "author": "Lizrippe ",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Would not buy this product again",
      "text": "Fun packaging, but impossible to really work into the scalp past medium length hair. Didn’t leave my hair/scalp feeling any different. Plus, not a fan of the smell.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Peterson",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Three stars",
      "text": "It’s not very easy to use, it’s very rough and has a general effect.",
      "rating": 3.0,
      "verified": true,
      "author": "Donna Necci",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "so this product makes me feel like I'm really getting it all off",
      "text": "I am guilty of using a too much product in my hair, so this product makes me feel like I'm really getting it all off. Treat yourself to a scalp scrub!",
      "rating": 5.0,
      "verified": true,
      "author": "yamaris",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "It's like a gentle scrub but for your hair!",
      "text": "This product feels so detoxifying during a shower and a little really does go a long way! Definitely for those days where you need a little extra clean after a long day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Love this product!",
      "text": "Great scrub for your scalp! Leaves your scalp feeling exfoliated and clean. M husband uses it too loves it! It helps alleviate his itchy scalp.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Goodbye dry winter scalp!",
      "text": "This is a great, gentle scrub that’s perfect for use after a long cold winter. Feels nice when applying and doesn’t feel like my scalp is burning.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa P.",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Highly recommend",
      "text": "I love this scrub! It feels so good on my scalp and smells awesome. Leaves my head feeling taken care of and exfoliated!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Five Stars",
      "text": "I get an awesome cleanse from this scrub and it leaves my hair soft and rejuvenated!",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "do not like",
      "text": "did not like this at all. honestly thought it was a waste of money and time. I was looking so very forward to using and loving it because I love everything this company makes but, this... is just a no. I didn't feel anything but, gross after.",
      "rating": 1.0,
      "verified": true,
      "author": "shan",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "would highly recommend for anyone with dry or itchy scalps",
      "text": "This product has helped me so much with dandruff. Since using it I haven't had any flakiness. I use once a week and it really cleans out all the product build up in your hair, would highly recommend for anyone with dry or itchy scalps, or people who use a lot of product in their hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolina Vogt",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Love it!",
      "text": "Completely revitalized my scalp! Made me feel and look great! Will be buying this product again :)",
      "rating": 5.0,
      "verified": false,
      "author": "Ricky Fernandez",
      "helpful_votes": 0,
      "publication_date": 20180522
    }
  ],
  "product_meta": {
    "title": "R+Co Crown Scalp Scrub, 5.5 Fl Oz",
    "description": "In modern day monarchy, always start at the top. This purifying and soothing scrub will detox, cleanse and rebalance your scalp. Thermal Protection, UV Protection, Gluten Free, Vegan and Vegetarian.\n\nBRAND STORY\nR+CO IS A COLLECTIVE OF SOME OF THE MOST KNOWLEDGEABLE HAIRSTYLISTS THAT HAVE COME TOGETHER TO MAKE A LINE OF PRODUCTS. MODERN FORMULATIONS OFFER IMMEDIATE RESULTS, EMBODYING EXPERIMENTATION, DESIGN, ARTISTRY, AND PASSION.",
    "rating": 4.3,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.9 x 1.9 x 6 inches; 5.71 Ounces",
      "UPC": "810374025451 810374022498",
      "Manufacturer": "R+Co",
      "ASIN": "B073RTMJB1",
      "Amazon Best Sellers Rank": "#59,225 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hair & Scalp Treatments",
      "Hair Care",
      "Beauty & Personal Care"
    ],
    "price": 38.0
  }
}