{
  "website_summaries": [
    {
      "verdict": "The Speedcross Vario 2 has delivered an impressive performance, according to many runners, with its technologies working together to yield multiple benefits to the user. However, despite the remarkable features, there were some who thought improvements are needed. Overall, the Speedcross Vario 2 has proven to be a reliable trail shoe.",
      "pros": [
        "Many runners have observed that the outsole did a fantastic job, especially on muddy trails",
        "A reviewer stated that the shoe provided excellent grip on all trail surfaces",
        "The upper was very effective in guarding debris out as well as retaining foot dryness, according to a tester",
        "Most users experienced a comfortable wear that did not require a break-in period",
        "Several wearers said the Speedcross Vario 2 was a durable trail-running shoe",
        "The shoe presented a snug fit resulting in a pleasant and smooth ride, one runner expressed"
      ],
      "cons": [
        "A few consumers noticed the insole was not secure and kept moving out of place",
        "The lugs on the outsole were not on the same level of efficiency as other Salomon trail running shoes, as mentioned by a reviewer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Grip. Very comfortable.",
      "text": "Bought these trainers for a tough mudder event to replace a previous pair of Salomon Speedcross. Required no breaking in and performed well for the event. Great grip, very comfortable and no blisters. Would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "trevm",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Tough light weight trek shoe",
      "text": "Great light weight trek shoe, very good grip. The shoe is narrow so if u have a wide foot may have to try it for comfort. Fit size is accurate and has half sizes if in doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark G.",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Had to return them. Felt really unstable.",
      "text": "My ankle felt incredibly unstable. Going to look for something that offers grip on a wider surface area on the front of the foot.",
      "rating": 2.0,
      "verified": true,
      "author": "Kyle Daniels",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Order a size up.",
      "text": "Amazing trail shoes, light, tough, fab grip. Make sure to order whole size bigger than your usual size. Huge fan of Salomon shoes, but i always order a size bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great shoes",
      "text": "My husband loves these! He's on his second pair as they are so comfy. Wears them to go walking and running.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruthieb",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Snug with the greatest sole tread and grip",
      "text": "Great quality, with the best grip I've experienced over wet surfaces. They are very snug, maybe choose a size larger than usual.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great Trainers from Solomon",
      "text": "Great pair of Solomon trainers, Im a size 9 and they fit well no issues. Prompt delivery as always be Amazon. 5 Stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr G.",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Way too small...",
      "text": "Impossibly small! I’ve always been a 10 and just holding these they looked tiny. My partner’s an 8 1/2 and they fitted perfectly - so that’s a massive 1 1/2 sizes smaller then the label.",
      "rating": 3.0,
      "verified": true,
      "author": "Gavin Barnett",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Comfy but poor quality",
      "text": "Had to go up a 1/2 size as toe box is tight but have found them comfy now for weeks on but the tongue has come away from inside on one shoe as the stitching has failed. Had to now complain to customer services. How poor is that !",
      "rating": 3.0,
      "verified": true,
      "author": "steven parkes-smith",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great shoes",
      "text": "Excellent shoes, I use this for fast hiking, much stronger grips than normal Speed cross.",
      "rating": 5.0,
      "verified": true,
      "author": "DOMINIC PULLEN",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Good for long distances!",
      "text": "The size is very snug but didn’t have time to change. Otherwise a great trainer. Used them for Tough Mudder! Worth it for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Ananayo",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Don't buy as incorrectly sized",
      "text": "I am usually a size 8-9 and these size 9.5 are so small I can't wear them and have therefore wasted the cost of them.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "They feel good quality though and were comfy apart from the toes",
      "text": "Sent second pair back as much smaller than expected. I usually wear a 10 but went for 11 then 11.5. Very short with toe close to end. Got 12 on the way now. They feel good quality though and were comfy apart from the toes!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Maskill",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Size, does matter.",
      "text": "Salomon, tend to be on the small size, I bought a 10.5, in place of a 9, which fits Nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "derek whittle",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Very comfortable",
      "text": "Just ordered the wrong size. Reordered smaller and no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Great shoe, and as everyone else says go a half size up",
      "text": "Really comfortable out of the box, great grip and look good too",
      "rating": 4.0,
      "verified": true,
      "author": "Horsley",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Two Stars",
      "text": "really tight fit even though I ordered up half a size",
      "rating": 2.0,
      "verified": true,
      "author": "Simon Kerrigan",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Check sizing.",
      "text": "Great trainer. Only thing had to send back for next size up.",
      "rating": 5.0,
      "verified": true,
      "author": "GC",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "An excellent shoe but too small by 1/2 size",
      "text": "Shoe is exactly as expected from Salomon with the only issue being that you will need to buy half a size larger than normal to get a normal fit. I am a size 8 in every other shoe but these fit perfectly in an 8.5.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. A. Hill",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Check size first",
      "text": "Quality trainer very good value for money second pair ive owned possibly get a larger size i am a nine had to get a size 10 this time 9 ok 10 bit better for movement",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "1st trail runners I bought",
      "text": "Will never bother with another shoe. Usually do a daily 10k that takes me across beaches, pine forest and some hard packed trails around where I live. These shoes are superb and with enough protection to wad off the occasional root or sharp stone. Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "julia",
      "helpful_votes": 0,
      "publication_date": 20201102
    }
  ],
  "product_meta": {
    "title": "SALOMON Men's Speedcross Vario 2 Trail Running Shoes",
    "description": "The SpeedCross Vario 2 shoe is the trail monster that's not afraid to go to the extremes. Based on the iconic Speedcross the Vario uses a slightly less aggressive tread with siping, and traditional laces for precise grip and comfort on soft or hard surfaces. Lightness: The lightweight shoe (270 to 310 g) ensures easy comfort even during long trainings. Water resistant: Protects your feet from rain and accumulated moisture. Traditional lacing system: The traditional lacing system allows you to manually tie and adjust your shoes to achieve the suitable fit. Fit management The Sensifit system cradles the foot perfectly, offering a secure and snug fit. Sole: The Wet Traction Contagrip sole is made from smooth and resistant rubber that offers exceptional traction and support for running on wet surfaces.",
    "rating": 4.3,
    "feature_bullets": [
      "Erwachsene",
      "Black",
      "Outer Material: Synthetic",
      "Inner Material: Manmade",
      "Sole: Ethylene Vinyl Acetate",
      "Closure: Lace-Up",
      "Heel Height: 4 centimetres",
      "Material Composition: Synthetic",
      "Shoe Width: Medium",
      "Textile"
    ],
    "specifications": {
      "Date First Available": "4 Mar. 2020",
      "Manufacturer": "Salomon",
      "ASIN": "B08GVR7MDR",
      "Department": "Men's"
    },
    "categories": [
      "Trail Running Shoes",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 99.75
  }
}