{
  "website_summaries": [
    {
      "verdict": "One of the best durable and affordable key lock boxes available for high security and protection.",
      "pros": [
        "Inside locking container is made of heavy zinc and steel to protect the box from theft attempts involving hand tools",
        "Can hold around five average-size keys"
      ],
      "cons": [
        "The lid can be difficult to open quickly after putting the correct code into the lock"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Essy to install and use",
      "text": "I bought this lock box for two Airbnb properties so that guests could conveniently retrieve keys when ever they arrive and return them when departing. The combination can be quickly changed to provide additional security. The boxes are secured to the wall near a night light so the combination numbers can be easily read and entered. Guests have appreciated their ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "berry patch",
      "helpful_votes": 28,
      "publication_date": 20180329
    },
    {
      "title": "Great product",
      "text": "After my autistic son locked my wife out of the house (while daycare was going on ((6 kids total)) I bought this immediately. Came right on time and installed it quickly and easily. Once a month I spray it with wd40 to keep the tumblers lubricated and havent had any problems. Has more than enough room for keys to multiple doors on our house.",
      "rating": 5.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 20,
      "publication_date": 20181006
    },
    {
      "title": "Strong and Secure Lockbox",
      "text": "Should have bought one long ago. I have a basement door that I was always coming to without a key. Mounted this next to the door and am saving having to go around the the house to get a key. The product is strong and well made. It is definitely stronger than the wood door.",
      "rating": 5.0,
      "verified": true,
      "author": "Runner30005",
      "helpful_votes": 18,
      "publication_date": 20180915
    },
    {
      "title": "Very well made. Unlike the kind you hang on ...",
      "text": "Very well made. Unlike the kind you hang on your door knob, you can install this somewhere only people you trust can find it. Spacious inside so you can stow keys to your front door, back door, gates, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "GOBILAMAKO",
      "helpful_votes": 20,
      "publication_date": 20171227
    },
    {
      "title": "Great quality. Does what it’s supposed to.",
      "text": "We love this guy! If we’re gokng out for a walk, we don’t even bring our keys because it’s so easy to get the spare one from the lockbox. The unit is very sturdy, but easy to open when you have the combo.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 19,
      "publication_date": 20171219
    },
    {
      "title": "Great Key Holder",
      "text": "This is a great lockbox to put on a steel door or a wall. Now I use it for my drivers, so what is great if one leaves you just change the code without having to call a locksmith to change locks.",
      "rating": 5.0,
      "verified": true,
      "author": "BRCINFAY",
      "helpful_votes": 17,
      "publication_date": 20180622
    },
    {
      "title": "Perfect solution for hiding an electronic gate opener for our property!",
      "text": "We have an outside gate to our property and I was looking for a weather proofed box to put a small electronic gate opener inside. This is perfect and now solves my problem of needing to bring a bulky garage opener to get out of our property.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Russell",
      "helpful_votes": 16,
      "publication_date": 20180320
    },
    {
      "title": "Very sturdy simple to install.",
      "text": "Excellent addition to my mom's Life Alert security package. And now if I forget my key a hundred miles away who cares; I can still get in the house and be with Mom.",
      "rating": 5.0,
      "verified": true,
      "author": "Waterickson ",
      "helpful_votes": 15,
      "publication_date": 20180727
    },
    {
      "title": "Problematic - Recent Purchases all seem to be Duds",
      "text": "First, let me say that I've supported vacation rentals for many years and used these lockboxes without fail. Unfortunately, the FIVE of the last SIX I've ordered have all been problematic and have had to be replaced within a couple of months. They're getting stuck locked and one has a lever that won't move. As one might imagine lockboxes are critical to vacation rentals and guests so it's important that they work as expected. The company was very good about replacing the first broken one but there are now FOUR more. Let's see if the company responds about a bad batch or two...if NOT...I 'd recommend others and include myself on looking for other options!",
      "rating": 1.0,
      "verified": true,
      "author": "S. Kumar",
      "helpful_votes": 5,
      "publication_date": 20190507
    },
    {
      "title": "Excellent device to facilitate key access for kitchen renovation.",
      "text": "Had this installed prior to kitchen renovation to allow worker's access to home when I was at work. Combination easy to set and change. Recommend key be removed from lock box when no longer needed for access to increase home security.",
      "rating": 5.0,
      "verified": true,
      "author": "greenthumb",
      "helpful_votes": 15,
      "publication_date": 20180122
    },
    {
      "title": "We had a hide-a-rock for our spare key. We ...",
      "text": "We had a hide-a-rock for our spare key. We worried someone might find it. Now we have the security of a safe way to keep our keys.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Roberts",
      "helpful_votes": 15,
      "publication_date": 20180316
    },
    {
      "title": "It is secure and easy to use.",
      "text": "My husband orders this item and installed it right next to our door. Other than the neighborhood now knowing where we keep our key, it is well built and sturdy. It has been secured safely and is well intact. It is easy to use and we can change out the code anytime.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathi O.",
      "helpful_votes": 11,
      "publication_date": 20180417
    },
    {
      "title": "Great product!",
      "text": "This was a very good purchase for me. I wanted a safe place to leave our house key when our housekeepers come, and this does the trick. I attached it next to our front door on the door frame, using five screws for the pre-cut holes supplied on the inside of the unit. I used longer screws than were supplied, but I'm sure the four screws that come with it are fine. The combination dial is easy to move with a fingernail. It looks very neat on the doorframe and seems to be a quality product. Very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazongal",
      "helpful_votes": 6,
      "publication_date": 20171223
    },
    {
      "title": "Provides Access for Lockouts and Emergency or Service Personnel!!!",
      "text": "At a time when we all have way too much on our minds, this little lock box provides a way of making sure that we ourselves, and the kids don't get locked out of the house. I put one on my elderly Dad's house so that different aides can get in but also so that his Life Alert company could give the code to emergency personnel. I used to rely on the Garage Door Opener Keypad but a power failure led me to this. Well worth the added peace of mind and not hard to install. It's also easy to change the code, which for simplicity's sake, I keep the same as the garage door but change both periodically.",
      "rating": 5.0,
      "verified": true,
      "author": "Smart Shopper",
      "helpful_votes": 4,
      "publication_date": 20180117
    },
    {
      "title": "A Solid Product",
      "text": "A solid product design, considering the price I paid. Also, looks pretty good. Put it next to my garage door and it looks like a key pad for my garage door. Applied a little WD-40 to the number dials and the opening switch helped to make them move smoother. I wish the number dials are easier to read (particularly at night).",
      "rating": 5.0,
      "verified": true,
      "author": "Leland L.",
      "helpful_votes": 6,
      "publication_date": 20180105
    },
    {
      "title": "Perfect for the back door of my house.",
      "text": "Perfect for those of us (me) who tend to lock ourselves out of the house and can't break in due to have made our homes dang near burglar proof. I mounted this on our back door to the garage and it works great. It's nice to have a key handy for friends and family that need access to our house. Just mount it in a good spot, set up your code and away you go 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Mike D",
      "helpful_votes": 6,
      "publication_date": 20171103
    },
    {
      "title": "Froze up after a month of use",
      "text": "Very disappointing. Worked fine for a month then froze up so i now cannot get my keys out of it (or get it off the wall where i mounted it). Now what? Spend hours trying to figure out how to break into my own lockbox? Don't buy this. Follow up: The retailer contacted me and offered a full refund. I ordered the same lock box to replace it and it works fine. No issues here.",
      "rating": 5.0,
      "verified": true,
      "author": "SF Gustav",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Extremely sturdy and well worth the money",
      "text": "Really nice, I felt the instructions were very easy to follow and to set the combination to exactly the 4 digit code I wanted. The box is extremely heavy duty and heavy metal and even has a little cover over the numbers. I did see where people recommended that you put a little bit of oil on the numbers periodically to keep them working and also manipulate the combination. No matter what it is it requires a little bit of maintenance and that goes a long way for the price I definitely would buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "shane",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "DON\"T BUY",
      "text": "I purchased this so my dog walker could gain entrance. Got it mounted, changed the code, won't open. Thank goodness I didn't put the key in first. After purchasing I read the reviews (my mistake) and found this isn't the first time this has happened. The response to won't open; pry it open, so much for security. Will never buy anything from this company again",
      "rating": 1.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 3,
      "publication_date": 20190210
    },
    {
      "title": "If you're just storing only keys this is fine but....",
      "text": "We bought this because of the descriptions of large storage capacity. We wanted to keep a small garage door opener in it, but the mechanism at the top takes up a lot of space and this is not evident in the pictures. The unit is well built and if I was only storing keys it would be fine.",
      "rating": 2.0,
      "verified": true,
      "author": "colorgirl",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Poor quality",
      "text": "Well this is my second lockbox. The first was so good that it was a no brainer for the second. However, this is is not that good. The pad door does not stay shut to cover the keys. Setting the lock, I coughs feel how thin n flimsy the numbers were..But it seems to function. This one feels like a generic take off of the first... It's too bad, especially that it does not look neat with the door closed..",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Good lockbox for a great price",
      "text": "What we like: - easy to use - safe, with 10k+ possible combinations What we don't like: - included screws are very low quality and the heads became useless just by screwing them into the wall. We ended up taking them out and using our own set of screws to not risk never being able to remove the included screws. - black notch to open the cover would be easier to operate with more space around it. Recommendation: The best lockbox that we've found. Just make sure to use your own screws. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Jubal Smith",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Product Failed",
      "text": "This key storage box did not operate well on my 8 family apartment building. The spring installed to open the lid did not flex effectively to allow easy opening. Several times people could not open the cover even with the correct code. This product did not last one year. I was unable to open it when it completely failed. I was able to use a hammer and chisel to open the cover and remove the storage box screws. I have used the Master Lock product and have never had this issue. I replaced this product with the Master Lock and will not buy another one.",
      "rating": 1.0,
      "verified": true,
      "author": "m",
      "helpful_votes": 2,
      "publication_date": 20190112
    },
    {
      "title": "Using for credit card lock box",
      "text": "Bought this to use as a lockbox for credit cards and keep in my closet. That way I can keep cards that I need close but use infrequently. The dimensions are appropriate except for the depth - the upper portion of the internal locking mechanism protrudes into the interior and I can only put 3 cards in it. Would like to put 5 cards in it. Otherwise should work well for keys.",
      "rating": 4.0,
      "verified": true,
      "author": "gstan",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Just in case you need it...a spare key in a secure place",
      "text": "I bought this to use in our rental because the door from the house to garage can be locked at the handset and we are accustomed to a deadbolt lock. I installed it in an obscure spot in the garage so it is not obvious, but having the box with a combo seems better than having a key hidden with no security.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. McW",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Failed, like most others. It FAILS to open when you need it.",
      "text": "It FAILS to open when you need it. On the plus side, two raps with a normal hammer gives you access to your keys [not really an actual plus through]. One of the combination wheels wasn't gripping like the other 3. Back to hiding a key where no one knows where it is.",
      "rating": 1.0,
      "verified": true,
      "author": "Yosemite Stan",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Very pleased with my purchase.",
      "text": "I have just installed this today. By having a key available, I can register with emergency responders so they will have access. My husband is fall prone and I have had to leave a door unlocked so responders can get in if needed. Very easy to install. Very sturdy box, very easy to set my own code.",
      "rating": 5.0,
      "verified": true,
      "author": "gjf",
      "helpful_votes": 8,
      "publication_date": 20171104
    },
    {
      "title": "Like it fairly well",
      "text": "The first place I installed the safe was a bit shaded and I found I couldn't read the numbers on the dial. A flashlight didn't help as the light reflected obscuring the numbers. So I moved the safe to a bit brighter location and can see the numbers well enough to open the safe. I only have one key in it but believe it will hold more if needed. It is easy to reset the combination from the factory default or to change it. The construction appears to be quite rugged and I'm confident it will protect my key from ordinary assaults.",
      "rating": 4.0,
      "verified": true,
      "author": "Milo Johonnett",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "I would recommend everyone to oil the mechanisms beforehand and you should ...",
      "text": "The item worked perfectly for a few months then malfunctioned. Once I applied more oil to the tumblers the problem fixed itself. I spoke to the seller to mention more grease during the assembly and he was very receptive. I would recommend everyone to oil the mechanisms beforehand and you should have no problems. Very easy to use product.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy Doll",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Easy to Install and Serves its Purpose",
      "text": "I am using this product to store keys for my airbnb rental. Thus far, all of my guests have been able to open this box without a problem. It was easy to install and it was easy to set up. It is a great product, for a reasonable price. Thumbs up! Would recommend to any airbnb host.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Torres",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "... keeps jamming and we are unable to open it easily after being installed in a protected area for 2 ...",
      "text": "This box keeps jamming and we are unable to open it easily after being installed in a protected area for 2 months. I wish I could return it as I have used other lock boxes before and never had this much trouble with them. **************Update...after communication with the company regarding my problems with the jamming they quickly refunded the total amount to my card. Very easy company to work with. I have since started spraying my lock box with a touch of WD-40 and it is working better. **************",
      "rating": 4.0,
      "verified": true,
      "author": "SUSAN PELKEY",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "I purchased a bunch of this boxes",
      "text": "People tend to change the combination and then lock the box leaving me without access to the keys. People do this to keep the keys over the argument that they can not put them back and lock them. The lockbox keys work just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "george santiago",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Solid",
      "text": "Solid and functional. A bit larger than others. Numbers in lock are very hard to see in low light.... with easy confusion between similar shaped numbers (2/3, 1/7, 7/9, etc.). More than one tenant has called saying the code was wrong.",
      "rating": 2.0,
      "verified": true,
      "author": "xXx",
      "helpful_votes": 2,
      "publication_date": 20171218
    },
    {
      "title": "Product itself is great but the screws that came with it were awful",
      "text": "Product itself is great but the screws that came with it were awful. I only tried 2/4 before just getting my own. The first one snapped in half with no pressure put on it and the second one stripped trying to drill into very soft wood.",
      "rating": 4.0,
      "verified": true,
      "author": "Kayla Mizell",
      "helpful_votes": 2,
      "publication_date": 20180531
    },
    {
      "title": "Take Your Time and Be Careful",
      "text": "The picture makes it look great, but you will have to take metal key holders and put them into place. Those keyholders have the potential to make some good cuts so be careful and take your time. On my particular unit, I had some alighnment issues on the back cabinet tabs that required me taking a flat head to bend the piece to one side before I was able to get the holder in place.",
      "rating": 4.0,
      "verified": true,
      "author": "Callery59",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Extra security and safe keeping of extra keys",
      "text": "The lock box is very sturdy and made of thick metal. The mechanism for the number dials are easy to change and seemed to work smoothly. The required screws to install the lock box is provided, but you will need to use an extension or manually screws to reach the screw head inside the lock box.",
      "rating": 5.0,
      "verified": true,
      "author": "Aries Tan",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Good key box, car keys fit.",
      "text": "Good keybox. Feels sturdy, easy to use and mount. The only complaint is that it could be a little deeper. I put car keys in there and the key fob/remote is a tight fit. A little hook on the top to hang the key ring would be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "e. shealy",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great product!",
      "text": "We needed something at work to hold gas credit cards, but needed it to be accessible to certain individuals. This fits the cards perfectly and was easily mounted to my metal cubical cabinet. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Unit is sturdy, roomy and easily mounted",
      "text": "The black slide door protects the lock from weather, but also hides the combination keys. This could delay emergency response personnel attempting to respond to an alarm. Unit is sturdy, roomy and easily mounted.",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Loring Jr.",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Not a good product",
      "text": "Not happy with this product. I opened it and now can’t get it to close and can’t figure out how to reset it",
      "rating": 1.0,
      "verified": true,
      "author": "Charmaine Revitsky ",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Good Product",
      "text": "Very sturdy and non obtrusive look. The only negative would be the size of the thumb wheels.Difficult to determine the numbers.I would recommend due to the sturdiness of this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike I",
      "helpful_votes": 2,
      "publication_date": 20171109
    },
    {
      "title": "Very easy to change passcode",
      "text": "Very easy to change passcode. Currently using it for workers to have access to the back yard. Can change it after they leave. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jones",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Tough and easy",
      "text": "Very sturdy box. Seems will resist any weather condition, or manipulation by third parties . The only little detail missing could be a small hook for hanging the keys. Nevertheless It is a sure shot, with a very easy 4 digit number dial too.",
      "rating": 5.0,
      "verified": true,
      "author": "AGPYE",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Avoid",
      "text": "Editing my review: Put this on your avoid list. Now not only does the door stick, but the lock has jammed and it's stopped working altogether. Installed in a protected location and very little use (<30 openings). Total junk.",
      "rating": 1.0,
      "verified": true,
      "author": "mike stevens",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Strong and smooth operating. Attractive.",
      "text": "Excellent case. Strong and sound. Smooth operating. Easy to install. Wish it had an inside hook to hang a key on. Can add that myself, though. There's an opening in the back so I can twist in a hook.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike RM",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Fumbling in the dark",
      "text": "We liked the sturdiness of this lockbox and we liked the instructions for install. However this lockbox isn't easy to read in low light for guests fumbling in the dark to see the numbers. Our fault for not taking this into account and we have returned the item.",
      "rating": 3.0,
      "verified": true,
      "author": "Joni G",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "High quality and easy to install",
      "text": "I winter and share a duplex in Phoenix with my elderly Mom. She was worried about losing her key so She was putting the spare key above the door. I said Mom, thats not a very dood idea! I installed this and used a 4 digit code easy for her to remember. This is a very high quality unit, easy to use and easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Stabiae",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Good and does the job.",
      "text": "The ejecting button kind of causes a scrape on the inside of the lock box. Works well for my purposes of storing keys securely somewhere within my home if I get locked out of my electronic locks. Feels very solid once mounted on a stud.",
      "rating": 4.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great product but not very spacious",
      "text": "Love everything about the item except it's deceptive on how much space is available for storage. Mounted it on a wall to keep extra keys but the design of the tumbler prevents standing them up or hanging them on a \"hook\" - won't close. Mounts easily, and securely. Easy to adjust combination as often as necessary but actual storage space is very limited and no \"retainer\" to keep items in so it's a constant annoyance if you find it useful to access it frequently.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer B.",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Strongly made key box that was easy to setup and install",
      "text": "Key box arrived on time and as advertised. It was easy to setup and install. Well built, appears able to withstand weather outdoors. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Tolbert",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Love this little key holder",
      "text": "Super simple to use. Makes me feel far more secure than a non-locking key storage or under the mat. You can change the code easily if you want to be able to let in house cleaners or pet sitters.",
      "rating": 5.0,
      "verified": true,
      "author": "HelpfulReviewertotheRescue",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Worth it.",
      "text": "Easy to set up with security code BUT make sure the numbers you want are LINED UP correctly. Did one- fine. Did second-and guessing was not careful enough with lining them up. Flipped the switch and just like that- can’t unlock- pretty much operator error. Easy install onto wood. Screws and done.",
      "rating": 5.0,
      "verified": true,
      "author": "J. W.",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Well made product",
      "text": "This product is made of quality materials and is a very functional and compact design. Good instructions, easy to set combination lock. I suggest any keys stored inside should be placed in a small envelope to avoid the possibility of blocking the door/locking mechanism.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Butler",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Works great in extreme outdoor weather",
      "text": "It's regularly below freezing & icy/snowy at our new house, so this has been a great way to let contractors or friends/family have access while we're still moving between the old & new house. Easy to change the code, easy to mount.",
      "rating": 5.0,
      "verified": true,
      "author": "AJK",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "good amount of space for keys.",
      "text": "Great amount of space for key storage but the open latch is hard to slide open making it difficult for first time users. not good for an Airbnb lock box",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel E. Lowe",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "sturdy and simple to install and set your 4 digit ...",
      "text": "sturdy and simple to install and set your 4 digit code. I had one at our last house which was left there. The weather proof construction allows installation anywhere that is convenient for you and looks nice also.",
      "rating": 5.0,
      "verified": true,
      "author": "William E. Hanson",
      "helpful_votes": 2,
      "publication_date": 20180106
    },
    {
      "title": "Not Happy With this Lockbox!!",
      "text": "After 3 months of used I'm now having issues with this lockbox, the combination keys are getting stuck and you actual have to bang on the box in order to release the keys seems to be the only way I'm able to open this lockbox. I hope someone from Oria reads this review so I can return this item since it's now defective.",
      "rating": 3.0,
      "verified": true,
      "author": "Rosie osie",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "The report is good",
      "text": "I gave this to my sister as a gift and she has reported that she likes it very much. She can confidently leave her key in it in case she gets locked out of her apartment.",
      "rating": 5.0,
      "verified": true,
      "author": "Swedemom",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Would definitely NOT recommend.",
      "text": "I purchased this for a vacation rental to allow guests access. Worked ok for a few guests, then wouldn't lock at all for while, then worked. Now, it will not open at all. Not sure how to get my key out or take this off the outside wall to the house. Would definitely NOT recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "D. L. Schlott",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Like this product and would recommend it",
      "text": "I like this product because I have a shed key and my nephew comes over and cuts my grass and he can get into the shed without me having an extra key or being home to give him the key to the shed I would recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "Gale E. Watkins",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Recommended",
      "text": "Works great, easy to install, easy to set personal combination, solid build",
      "rating": 5.0,
      "verified": true,
      "author": "ViaVeritas",
      "helpful_votes": 2,
      "publication_date": 20171031
    },
    {
      "title": "Handy and functional",
      "text": "Small, discrete and enough space for a couple of keys. The resettable combination is easy to manipulate. It does not appear to be a key box which gives added security.",
      "rating": 5.0,
      "verified": true,
      "author": "zhukov",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Works fine but easily picked",
      "text": "When my kid changed the combination and forgot to write it down, I went on YouTube and watched an instructional video. I then successfully picked the lock without any previous experience or special tools. You'll need something more secure for anything of serious value.",
      "rating": 4.0,
      "verified": true,
      "author": "Neta Weber",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Small, sturdy and easy to use",
      "text": "Installed for guests arriving late at night at the Michael Cahill B&B. The housekeepers also like it. It's a basic lock box that works great.",
      "rating": 5.0,
      "verified": true,
      "author": "jbella",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Sturdy",
      "text": "Awesome concept. Forget putting a key under a rug when you can lock it up. Easy to change the code easy to install and dood lock breaking in to the box. You would have to be extreamly motivated making tons of noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Good deal!",
      "text": "I ordered this key lock box because the other one that I ordered that hangs on the door know is a hassle. We use this on our cabin and the one that hangs on the door knob gets in the way of the door closing. This one will be up and out of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy W. P.",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Not good for real security.",
      "text": "Needs a hook inside the case to hold keys in order for door to close properly. The digits should automatically set to 0000 when close the latch. Otherwise the code is still in place anyone can then access the keys.",
      "rating": 3.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great way to secure an extra house key",
      "text": "I have bought two of these. One for my mother in-law and one for my elderly neighbor who has locked herself out of her house a couple of times. It’s so easy to install outside of the house and it’s a secure place to keep an extra key for yourself or a cleaning lady or anyone else you might want to give access too.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Sbarro",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Heavy duty",
      "text": "This is my second purchase of this product. I use it to store keys for housekeepers, gardners, and visitors. It is easy to set up and change codes. In addition, it is heavy duty and seemingly impenetrable without the code.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Folse",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Nice key storage box",
      "text": "Use to store extra key. Made very well. Not terribly hard to anchor. Ended up buying second one. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony L",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "I like that the numbers are a bit larger than on ...",
      "text": "Works well, only issue is the door is difficult to close. I like that the numbers are a bit larger than on most similar products making it easier to see. Very easy to set the code.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180122
    },
    {
      "title": "Very reliable lock box",
      "text": "This is a nice permanent mount lock box. It comes with mounting screws and a padded back to limit damage to mounting surface. The slid cover does tend to stuck open and needs to be pulled out.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith J Allen",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Sturdy and Safe",
      "text": "Very easy to install with the 4 provided screws and sheet rock anchors. I'd recommend hitting at least 2 screws into a stud and using the 2 achors just in case. Very easy to set the code and to open/close",
      "rating": 5.0,
      "verified": true,
      "author": "WholemealDrop",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Good quality product but frustrating to mount.",
      "text": "This lock box is well made. The only complaint is that the lower mounting screw hole in the back of the case is located below the drop down door. So you cannot get a screwdriver bit straight on. Neither can you remove the door.",
      "rating": 4.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Does not consistently open",
      "text": "This is very difficult to open. I installed it on a wall on my porch and it will Not open without forceful prying with a tool. Had to take it down and will only open with a key prying it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy Hood",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Lock box",
      "text": "We put this up at my mom's house for her caregivers to use instead of putting the key under the mat. A lot more secure and safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin L. Follett",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Not bad !!",
      "text": "Like the box, not a fan of the plastic slide cover over the combination. It’s flimsy and sticky sometimes",
      "rating": 4.0,
      "verified": true,
      "author": "Ali Khan",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Not water tight.",
      "text": "It’s a durable box and overall good, but it does not have any gaskets so it doesn’t seem very weatherproof. Probably ok for a basic key, but make sure whatever you put in there doesn’t corrode.",
      "rating": 3.0,
      "verified": true,
      "author": "Anton Pugachevsky",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Instructions to Set Don't Work",
      "text": "I followed the instructions exactly to reset the code and it didn't work, and somehow the lock box ended up getting stuck open, with no way for me to reset. Useless and a waste of time and money. I would give 0 stars if I could.",
      "rating": 1.0,
      "verified": true,
      "author": "M Stone",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Very nice for spare keys",
      "text": "I use this for spare keys. It is easy to install and very secure, as it would take many hours to drill or saw through it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. K",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Setting the combination is easy, as is mounting",
      "text": "The product is exactly as described and very, very well built. Setting the combination is easy, as is mounting. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Albert",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "Works for us!",
      "text": "This is our key box with the extra key hidden on our property and it seems to work fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of Four",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Great key storage box",
      "text": "This is a solid product, easy to set the new combo code, easy to install, is holding up nicely to the weather. I'd buy again and recommend it .",
      "rating": 5.0,
      "verified": true,
      "author": "Pat from Florida",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Very easy and effective!",
      "text": "I have some apartments on AirBnb and this helps allot. I have it outside, I live near the beach, & so far so good. Very good option in vale too!",
      "rating": 5.0,
      "verified": true,
      "author": "Gianfranco Alvarez",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Nice product",
      "text": "Easy to install very solid very nice key security box. I am very pleased with this product",
      "rating": 5.0,
      "verified": true,
      "author": "alp",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Great little box to keep keys hidden and secure",
      "text": "Worked as intended, outside the house for more than a year now and has withstood the elements",
      "rating": 5.0,
      "verified": true,
      "author": "Ignas J.",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Good but to many screws",
      "text": "It worked really well and secured all of my stuff really good but it took way to many screws to Install in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Buy better screws for installation.",
      "text": "First, buy better screws. The head broke off the first one. I went to my hardware drawer to install this. The box itself, works well. It’s easy to reset the combination.",
      "rating": 4.0,
      "verified": true,
      "author": "Charlotte, NC",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Very nicely built",
      "text": "it is very nicely built and sturdy. So far it does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken King",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Well built, easy mounting, easy to set combo!",
      "text": "Easy to mount and set your own combination. I left the uppermost screw backed out a quarter inch to hang my key on.",
      "rating": 5.0,
      "verified": true,
      "author": "2 Tone",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Easy to setup and install",
      "text": "The lock box was very easy to setup and install. Seems like a decent and sturdy lock box.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Love it!",
      "text": "I loved it! Dont have to worry about the keys anymore! Its a bit small, looks bigger than what i thought but still keys fit fine if you dont use big key chains or things hanging!",
      "rating": 5.0,
      "verified": true,
      "author": "zabrina",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "EAsy to install and use.",
      "text": "Great lockbox. Is easy to install, waterproof and holds a ring of keys.",
      "rating": 5.0,
      "verified": true,
      "author": "S. M. Stapleton",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Should work fine",
      "text": "It should have a gasket around the door to keep water out.",
      "rating": 4.0,
      "verified": true,
      "author": "Dux",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Great price and fast delivery from Prime",
      "text": "Great price and fast delivery from Prime. Easy to set or change combination and easy to mount. Actually used it a few days after it was installed when I got accidentally locked out of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171103
    },
    {
      "title": "Easy to install and use",
      "text": "This was very easy to install just outside of my garage for easy entry into my house for cat sitter while I was away. I keep an extra key in there all the time now. It’s so convenient!",
      "rating": 5.0,
      "verified": true,
      "author": "Destiny",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "great key lock",
      "text": "Good solid lock. Easy to set it up and change the code. Enough space inside for several keys and maybe even something else. Comes with screws but we just used zip ties for the fence.",
      "rating": 5.0,
      "verified": true,
      "author": "Yeska",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "no more locking myself out",
      "text": "I don't need to give my key to anyone; if I need someone to get in my house I can just give them the code for that day and change it after.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Easy to install, Easy to use",
      "text": "Installed on concrete wall in less than 10 minutes, Easy to configure and use. No more security issues with the keys on the plant pot....!",
      "rating": 5.0,
      "verified": true,
      "author": "cramossan",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "easy installation but hard to open.",
      "text": "nice, sturdy product that is easy to install and the combination is simple to set. however, it is very hard to open without some type of thin pry tool.",
      "rating": 3.0,
      "verified": true,
      "author": "TyrannosaurusRix",
      "helpful_votes": 0,
      "publication_date": 20180218
    }
  ],
  "product_meta": {
    "title": "ORIA Key Storage Lock Box, 4 Digit Combination Lock Box, Wall Mounted Lock Box, Resettable Code, 5 Key Capacity, Silver",
    "rating": 4.5,
    "feature_bullets": [
      "Durable Material: This key lock box is made of zinc alloy and heavy-duty steel, which can protect the box from hammering, sawing or prying. Also, it is environmentally friendly paint, so it isn’t harmful to the body.",
      "High Security: This product is an adjustable combinations lock with 4 dials. It can offer 10000 combination. It can be converted to non-resettable mode for extra security.",
      "Large Storage Capacity: The box has large space which you can place 5 keys at most. You can put your house keys or car keys in it when you go to work or on vacation.",
      "Easy Operation: It is easy to install and use it. You can set your favorite numbers as your passwords. The 4-digit combination is easy to remember and reset.",
      "Wide Application: The key box can be used in many areas. It is suitable for outdoor use. It can be fixed to a wall for emergency entry, vacation home, pet sitters ,etc."
    ],
    "specifications": {
      "Manufacturer": "Oria",
      "Brand": "ORIA",
      "Item Weight": "1.01 pounds",
      "Product Dimensions": "4.3 x 3.1 x 1.6 inches",
      "Item model number": "OUS-HA39S-O52118",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Silver",
      "Material Type": "Steel, Zinc alloy",
      "Size": "4.7 inch",
      "Manufacturer Part Number": "OHA39S-OA",
      "ASIN": "B073RXZNKK",
      "Customer Reviews": "4.5 out of 5 stars567 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#11,530 in Office Products",
      "Date First Available": "July 7, 2017"
    },
    "categories": [
      "Drop Slot Safes",
      "Tools & Home Improvement",
      "Safety & Security",
      "Safes"
    ],
    "price": 18.99
  }
}