{
  "website_summaries": [
    {
      "verdict": "A well organized, strong wall mount that allows for easy access to the console.",
      "pros": [
        "This mount is made from a stable iron material that you can rely on",
        "The console rests on the mount without being locked into place, allowing easy access to your switch, should you want to remove it from the wall",
        "Additional holes and hooks are designed to hold the controller and Joy-Cons in place"
      ],
      "cons": [
        "The mount extends outward farther than most"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A good wall mount",
      "text": "A fantastic wall mount. I have been uaing this for over a year and have had no problems with the mount itself. The weight can be a bit of a problem however. Over time the hole in the dry wall got bigger and it fell, luckily nothing was damaged. It may have been my old dry wall. Just be sure your mount is secured and check again every so often.",
      "rating": 4.0,
      "verified": true,
      "author": "Miharu Yoshizawa",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Perfect wall mount for Switch",
      "text": "VERY well built, just a solid piece of metal. Matches the dock perfectly, so it looks very nice. Appreciate the spot for the pro controller. Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Mounting cables to the wall would secure the dock better but all in all",
      "text": "The dock doesn't fasten into the mount but more sits in it. When my young son removes the console from the dock it slides forward on the mount. Mounting cables to the wall would secure the dock better but all in all, I am pleased with this as I feel it protects the dock and console better than having the dock sliding around on the media center surface.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Duvall",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "This Switch holder was super easy to put together (some minimal assembly required) and ...",
      "text": "This Switch holder was super easy to put together (some minimal assembly required) and very easy to mount. It keeps the kids Switch on teh wall, away for the cats!",
      "rating": 5.0,
      "verified": true,
      "author": "William Englefield",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Amazing",
      "text": "These are amazing. So simple yet so function. Thank you so much for making this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Elkif",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Four Stars",
      "text": "This mount appears sturdy and should support the device if mounted safely to a stud. Excellent customer service.",
      "rating": 4.0,
      "verified": true,
      "author": "Wade",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Five Stars",
      "text": "Great mount for the price, lots of area for controllers and accessories. Extremely happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "jonathan gaige",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Five Stars",
      "text": "Easy to put together the and the quality is good is not flimsy",
      "rating": 5.0,
      "verified": true,
      "author": "Relik_",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Won’t fit behind my wall mounted tv.",
      "text": "Sticks out too far for the tv mount to sit flush. Would be fine if that’s not important to you.",
      "rating": 3.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Go with a name brand version",
      "text": "This thing has 1 job and doesn't do it. The wall mount doesnt hold the switch to the wall the switch is loose and will fall for sure no instructions to refer to. Although seems simple enough put the screws in the wall and slide the swit h into the holder.",
      "rating": 1.0,
      "verified": true,
      "author": "Damionus",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Keeps my Switch safe from little hands.",
      "text": "The bracket does what I bought it for, it keeps my two year old from pulling my Nintendo Switch to the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180430
    }
  ],
  "product_meta": {
    "title": "Wall Mount Bracket for Nintendo Switch",
    "description": "Package Contents:\n1*Wall Mount Bracket\n1*English Manual\n5*Screws\n2*Bolts\n3*nuts",
    "rating": 4.6,
    "feature_bullets": [
      "Specially designed for Nintendo Switch.",
      "Take advantage of unused wall space.Store Nintendo Switch Docking Station and game controllers on walls or other vertical surfaces.",
      "Our mount prevents damage by keeping the Nintendo Switch Dock and game controllers secure to the wall and out of danger.",
      "Simple setup. Install on wall using included screw.",
      "One-year limited warranty.If any product issue, please contact us , we will try to satisfy your every needs."
    ],
    "specifications": {
      "Brand": "J&TOP",
      "Hardware Platform": "Nintendo Switch, Nintendo switch",
      "Item Weight": "1 pounds",
      "Product Dimensions": "6.8 x 4.6 x 4.3 inches",
      "Item Dimensions  LxWxH": "6.8 x 4.6 x 4.3 inches",
      "Color": "Black",
      "Manufacturer": "J&TOP",
      "ASIN": "B073RZB85J",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 6, 2017",
      "Customer Reviews": "4.6 out of 5 stars20 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#42,729 in Video Games"
    },
    "categories": [
      "Accessories",
      "Mounts, Brackets & Stands",
      "Video Games",
      "Electronics",
      "Nintendo Switch"
    ],
    "price": 19.99
  }
}