{
  "website_summaries": [
    {
      "verdict": "Thick seat padding and extra-large tool pockets are big pluses for this sturdy bench.",
      "pros": [
        "Excellent locking capability keeps this kneeler bench sturdy and reliable",
        "Two weather-resistant tool bags have wider pockets to accommodate more items",
        "The bench padding is thicker, and its overall width makes for a comfortable time"
      ],
      "cons": [
        "The plastic support between the seat and kneeling pads is weaker than expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This product is brilliant!",
      "text": "I bought a kneeler a few weeks ago because I have knee problems and thought it might make it easier to garden. My husband started using it immediately, and told me to buy two more, he was confiscating the first one. I bought a 2nd for myself for gardening, and finally got to use it, for the first time I can get down on my knees and easily get back up with his product. He was right. I'll be ordering a 3rd one for indoor use! I'm so excited to be able to get up and down easily. I'll be buying them for gifts for friends as well.",
      "rating": 5.0,
      "verified": true,
      "author": "write again",
      "helpful_votes": 185,
      "publication_date": 20190404
    },
    {
      "title": "Kneeler: A back saver!",
      "text": "The Tom Care Kneeler/Seat conversion garden appliance is a back saver in one instance, and a highly sturdy implement to get into, and up from, a kneeling position. Thus it is a perfect solution for those with bad knees owing to the ease of getting down on one's knees and then rising back to a standing position! The ability to convert to a seat is simple: just turn it upside down! As an aside, the tool bag that comes with it is useful and can be used when kneeling or sitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 154,
      "publication_date": 20190412
    },
    {
      "title": "Nice Product",
      "text": "I bought it for my 85 year old mom who LOVES to garden. She loves the bench. Giving her the ability to tend to her flowers in the garden is like saying \"Flowers to the Living\": She does not want flowers when she is dead and can't appreciate them . The Garden kneeling/sitting bench is part of helping her enjoy her flowers, her garden and her life. Quality was fine and it met the need. Thank you !",
      "rating": 5.0,
      "verified": true,
      "author": "Life is Good",
      "helpful_votes": 167,
      "publication_date": 20180331
    },
    {
      "title": "A miracle tool to assist old backs and legs.",
      "text": "This is the perfect tool for old legs and backs. The stool is very sturdy and useful to assist returning to a standing position when using rhe sitting stool and even when used as a knelling stool. Tool pouch also useful for containing your hand tools at your side that saves time and energy by reducing need to get up and down to get tools. A great buy compared to other like products. Delivery very prompt, quality good and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "grummy",
      "helpful_votes": 154,
      "publication_date": 20180716
    },
    {
      "title": "Works great.",
      "text": "These works great! I was able to do twice as much weeding as normal. I turn it upside down to use so I am closer to the weeds .Something soft to put my knees on or just sit on and handles to easily push myself up. Wish I had bought this a long time ago. Very sturdy, strong and I love that it folds for easy staorage. Also, no assembly required. You can use it right out of the box",
      "rating": 5.0,
      "verified": true,
      "author": "Pixie",
      "helpful_votes": 161,
      "publication_date": 20180404
    },
    {
      "title": "Amazing for kneeling!  Gives you the grips to get up.",
      "text": "This is just an amazing product! My husband and I use it mostly outside, gardening. So, we turn it upside down, and use it as a kneeler. It gives us the support we need to get up from weeding, planting, etc. Pretty comfortable on the knees, too! I'd highly recommend this product. Actually, I never have used it as a seat (as shown in picture!). Got two this year, and after 2 years of continuous work, the kneeler pad started to disintegrate. I did affix something else to it for another year. Had I taken care of it and returned it to the gardening shed after every use, the foam kneeler pad wouldn't have become so 'weathered' from the seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Pammie J in Barrington",
      "helpful_votes": 154,
      "publication_date": 20180208
    },
    {
      "title": "A real back and knee saver!",
      "text": "These are great. After using mine for about a year, I've since purchased for a neighbor and two friends. Saves my knees, my clothing and my back. And I use it in stool position to paint and sand furniture. Can't do without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 106,
      "publication_date": 20180316
    },
    {
      "title": "Design Weakness",
      "text": "The plastic grid supporting the pads broke after less than a week of use and the screws holding the grid broke off from the plastic grid.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 92,
      "publication_date": 20190516
    },
    {
      "title": "Perfect solution to working low to the ground",
      "text": "Appreciate being able to kneel without knee pain...and then to be able to rise to my feet without assistance. UPDATE ... The second time I went to use this, while in kneeling position, as I was getting up, I felt something snap under my left knee and the cushion drop about 2 inches. I am awaiting reply after sending the description and then a photo of the broken screw mounts in the hard plastic divider between the top and bottom cushions. Hoping they will replace... poor selection of material.. I weigh 220 lbs. I ended up replacing the broken plastic divider with a wooden one. The company should do the same",
      "rating": 1.0,
      "verified": true,
      "author": "JerryL",
      "helpful_votes": 22,
      "publication_date": 20190610
    },
    {
      "title": "broken already",
      "text": "I bought this in July and use a few times in August Now it is broken see the attached picture. The kneeling pad attachment to the side rail was broken.",
      "rating": 1.0,
      "verified": true,
      "author": "mili hsueh",
      "helpful_votes": 134,
      "publication_date": 20180902
    },
    {
      "title": "The bench is not comfortable to use.",
      "text": "The garden bench seat is too high for me to sit on and comfortably bend over to plant—I’m 5’3. I ended up using the kneeling option. The bench is not cushioned and too hard to kneel for very long. The bench is sturdy, seems well made though the seat is narrow. Therefore i would not recommend it for some users. All in all, only OK!",
      "rating": 3.0,
      "verified": true,
      "author": "Donna Kirkpatrick",
      "helpful_votes": 15,
      "publication_date": 20180918
    },
    {
      "title": "330 lb weight limit for this bench is not accurate.",
      "text": "It is easy to fold, store, transport. Comfortable to use. Unfortunately, it is not sturdy. It is rated to support 330 lbs. I am a good-sized man and certainly weigh much less than 330 lbs. The hard plastic frame supporting the cushions broke after one afternoon of use. If you’re a petite 110 lb female, this might be the perfect product. If you’re anywhere near 200 lbs, find another product.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Sensintaffar",
      "helpful_votes": 11,
      "publication_date": 20190705
    },
    {
      "title": "After a year",
      "text": "Purchased last June. Cushions began to detach and sag a couple months ago and today it is unusable. I too loved it at first but long term it is a disappointment. UPDATE: changed stars after contacting the company. They honored the warranty and sent me a new one. Anything can fail, but they stand behind the product and were quick to replace the one that broke.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 10,
      "publication_date": 20190615
    },
    {
      "title": "The plastic that holds the kneeling pads on broke the third time I used it",
      "text": "The plastic that holds the kneeling pads on broke the third time I used it and the return window has already closed. Piece of junk needs to go in the trash now what a waste. \"Update\" I must say the company provides great customer service. As a result of my review they contacted me and told me they were sending another Kneeler to me. No charge! I like that very much. It does not, however, change the fact that the first one broke as easily as it did, Maybe I'm just to heavy at 215 lbs. Perhaps they should publish a weight rating for the kneeling feature, sitting on it seems to be no problem.",
      "rating": 3.0,
      "verified": true,
      "author": "John Nelson",
      "helpful_votes": 7,
      "publication_date": 20190815
    },
    {
      "title": "Missing parts",
      "text": "I didn't need to use the bench right away so my window for return has passed. Overall, it is a nice bench but it was not completely assembled. The screws on one side were missing which allowed the seat to push through when I sat on it. I had an old similar bench which this was a replacement for so I used screws from it to correct the assembly.",
      "rating": 3.0,
      "verified": true,
      "author": "G. Johnson",
      "helpful_votes": 7,
      "publication_date": 20190518
    },
    {
      "title": "Uncomfortable",
      "text": "Returned product - kneeler & seat too narrow & very hard. Not comfortable! Sorry",
      "rating": 1.0,
      "verified": true,
      "author": "Nan",
      "helpful_votes": 11,
      "publication_date": 20190425
    },
    {
      "title": "Under that Sturdy look is PLASTIC. I do not recommend.",
      "text": "At first I was going to give this a good review, however today my 145lb Stepson was kneeling on this on level ground and it broke. Under the pad is nothing but plastic. The plastic snapped. This was only the third or fourth time it had been used. I WAS planning on ordering another one as a gift, but definitely will not now.",
      "rating": 2.0,
      "verified": true,
      "author": "B Coop",
      "helpful_votes": 7,
      "publication_date": 20190618
    },
    {
      "title": ". . . not just for gardening",
      "text": "Just what I needed. This was suggested to me by a friend when I said how hard it is for me to get up and down now, and I can't kneel or crawl on the floor. I use it around the house. Worked great when I was painting base board at a rental property. I think it's going to come in handy for lots of things besides gardening.",
      "rating": 5.0,
      "verified": true,
      "author": "FamilyOfBigfoots",
      "helpful_votes": 10,
      "publication_date": 20180305
    },
    {
      "title": "Flimsy",
      "text": "Kind of flimsy, I’m only 110 pounds, my left side shaking while I held two sides to stand up. I doubt whether or not it can tolerate my father in law’s 180 pounds.",
      "rating": 1.0,
      "verified": true,
      "author": "Chee Ray",
      "helpful_votes": 8,
      "publication_date": 20190616
    },
    {
      "title": "A must have for every gardener!",
      "text": "Great garden bench. Very sturdy and allows me to sit and stand with ease. Exactly what I needed to make my gardening easier. I would have given my rating a 5 star if it were not for the plastic chemical smell from the material used on the bench. I am hoping that in time, the smell will disappear and that the smell is only because it is new.",
      "rating": 4.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 8,
      "publication_date": 20180601
    },
    {
      "title": "Insufficient Design",
      "text": "I purchased this kneeler bench in July 2019. After occasional use, I went to kneel on it and the plastic substrate that is sandwiched between the two foam pads broke. I do not think it is designed sufficiently to accommodate the act of kneeling. I did like the sides that allow me to get up easier from a kneeling position, but I cannot recommend the product for kneeling. Update: I was sent a replacement bench by the seller. Much impressed with this seller. I have not used the new bench yet.",
      "rating": 2.0,
      "verified": true,
      "author": "N. Scott Brown",
      "helpful_votes": 4,
      "publication_date": 20190926
    },
    {
      "title": "A disappointment!",
      "text": "I found this product very unstable. When I sat on it the first time, I obviously did not carefully place my bottom, because I fell backwards when the stool tipped over. The legs are rounded and the center of gravity is very minimal. I am 170 pounds but not obese...the seat is narrow. Also....kneeling....when I tried to use the legs, to raise my body when in the kneeling position, it rocked....again....unstable. I was excited about this garden work bench as a result of other’s reviews and have been hugely disappointed!!",
      "rating": 2.0,
      "verified": true,
      "author": "Charles S. Rust",
      "helpful_votes": 3,
      "publication_date": 20200417
    },
    {
      "title": "Great for people needing a little support.  We all get old but can't give up gardening!",
      "text": "It is a great tool for my garden. Have been wobbly as of late and this is perfect for sitting. I will use it forever, Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Saveur4ever",
      "helpful_votes": 11,
      "publication_date": 20171103
    },
    {
      "title": "Good support when getting up from the kneeling position",
      "text": "Weeding, planting anything you need to kneel for, this Garden Kneeler is perfect. The main feature are the handles on the side. It makes it so much easier to get up and saves me pressure on my knees and back. Love it. It folds pretty flat so it's easy to store. My husband, (200 lbs) is hesitant to use it because he feels that the handles on the sides are too loose and a little shaky and are going to give way to any added pressure. He's always telling me to be careful when getting up. I keep telling him they're supposed to have a little \"give\" !! I'm just hoping that's the case. But I love it!!",
      "rating": 4.0,
      "verified": true,
      "author": "Barbs T",
      "helpful_votes": 4,
      "publication_date": 20190419
    },
    {
      "title": "Doesnt hold up for larger users.",
      "text": "Disappointed. My husband is using his for only 2nd time and it has broken. He's large, but under the max weight. It is a great idea, but needs to hold up for larger folks as advertised. Bought one for my brother too, hope his does better.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah Sims",
      "helpful_votes": 5,
      "publication_date": 20190713
    },
    {
      "title": "Sturdy, but only a slight problem....",
      "text": "I have been waiting to get the kneeler/bench and it arrived! I am thrilled. I just had knee surgery and can't kneel. SOOOOO I've been waiting to get this product. I love it. I garden from the time the snow melts in the spring to Christmas. It's sturdy. Holds my weight easily. Folds up well. However, the pockets keep coming off. The velcro one is better than the other. The velcro hold it on well. The other pocket just sits on the metal handle. Even with it full of water, sunscreen, tools, it easily falls off. I purchased the green one. Nice color not neon green or dark green. Just green. All in all, a good buy. Fix the pocket",
      "rating": 4.0,
      "verified": true,
      "author": "kathleen",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Tips easily when I lean forward",
      "text": "Seat is too narrow. Too tall. Tips easily when I lean forward.",
      "rating": 1.0,
      "verified": true,
      "author": "Judith Bayles",
      "helpful_votes": 10,
      "publication_date": 20180423
    },
    {
      "title": "I am 4’10” and I have bad knees. The kneeler was too low on the ...",
      "text": "I am 4’10” and I have bad knees. The kneeler was too low on the kneeler side and when turned to seat, too high for me to work in the garden",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20180420
    },
    {
      "title": "Not stable",
      "text": "This was wobbly right out of the box. It also slides on a hard floor surface. Returning it for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Diana L Brown",
      "helpful_votes": 6,
      "publication_date": 20190420
    },
    {
      "title": "Works well",
      "text": "After back surgery, it was difficult to get up and down easily in the garden. This seat makes it possible for me to do fine hand weeding by kneeling or sitting on the chair. The handles are sturdy and give me all the support I need to get back up. I looked at several different brands of garden stools, and one reason I chose this one is because it weighs less than most, which makes it easier to move, but is still extremely sturdy. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gen",
      "helpful_votes": 2,
      "publication_date": 20190421
    },
    {
      "title": "Well designed and well made",
      "text": "This is a well designed, well made quality garden bench. A little pricy but worth it. Folds and unfolds easily. The storage pocket is very handy. Comes fully assembled. Very sturdy except when using it to assist in getting up from the kneeling position - it wobbles just a little. Some sort of horizontal stabilizer bar would take care of that. I am very pleased with it overall and would highly reccommend to any outdoor gardener, especially seniors!",
      "rating": 4.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 3,
      "publication_date": 20181202
    },
    {
      "title": "Cushion Support is Plastic",
      "text": "5/31/19 Update: TomCare did make it right and sent me a new one. Hope it lasts longer than the 1st. 3rd time I knelt on it the plastic broke. May be rated for 330 lb, but when you kneel on it all the weight is on the 1st knee to contact the cushion. POP! That was it. I weigh 240 lb.",
      "rating": 3.0,
      "verified": true,
      "author": "William Knuerr",
      "helpful_votes": 5,
      "publication_date": 20190520
    },
    {
      "title": "This is an amazing product.  Life changing!",
      "text": "This garden kneeler is amazing and has made a huge difference for both me and my husband. I actually bought one for each of us. We both have bad knees and this allows us to get up from a kneeling or sitting position with ease. The sponge pad is comfortable to kneel on as well. I even used it when I was bathing and grooming our very large dog. He requires lots of brushing and leaning over is tiring after a while. This allows me to sit or kneel while grooming him. A friend was complaining about how difficult it is for her to garden because of her knees, so I sent her one. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "bruce sentas",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Extremely satisfied",
      "text": "This is one of my best buys I've made in a long time. I am 76 years old and it is difficult for me to get off the floor once I've gone down on my knees. This has been a wonderful device. I use it all over the house, not just for outdoor gardening. Every time I have to go down on my knees, this goes with me. It folds/unfolds easily and stores in small space. I would recommend it and would definitely purchase it again!!",
      "rating": 5.0,
      "verified": true,
      "author": "P. B. Moore",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Before warned this product is not sturdy or worth any amount of money",
      "text": "Do not buy this item well it worked great for the three weekends my husband used it today he went and used it in one of the bars that hold the pad broke. He is not a heavy man there’s no other reason then poor Quality for this to have happened before warrant",
      "rating": 1.0,
      "verified": true,
      "author": "Ishanala",
      "helpful_votes": 2,
      "publication_date": 20200603
    },
    {
      "title": "Seems sturdy & well-made",
      "text": "Always hesitant to recommend something like this until I’ve seen how well it holds up during the season, but so far so good. Came well-packaged and is sturdy & comfortable with a pad that works well for sitting or kneeling and a double pouch that easily stores my tools. I’m keeping it unfolded in my mud room so it doubles as a bench to sit on to put or or take off my garden shoes. Very pleased so far!",
      "rating": 4.0,
      "verified": true,
      "author": "Ann B",
      "helpful_votes": 4,
      "publication_date": 20180606
    },
    {
      "title": "Tomcare kneeler seat",
      "text": "This kneeler is great. The padding t kneel on is very thick and comfortable. I love the fact you open the box and infold and ready to go. I bought it primarily for gardening, once I kneel down I can't get up well, the handles are such a help. I recently took it when I went fishing and used it to sit on, because it folds up, it hardly took no room in my car. It's wonderful!!",
      "rating": 5.0,
      "verified": true,
      "author": "grammagree",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "I Couldn't Garden Without It",
      "text": "I recently had some very invasive surgery which resulted in me being quite sedentary for a couple of months. As a result, I lost a lot of strength in my legs. Because of this device, I am able to get down to weed and have the hand rails to use to help me get up or I can flip it over and sit to do other gardening tasks. The plus is I can get my gardening done while also getting exercise which will help me to recover. I am sure I will be using it even when I regain strength since it is so handy.",
      "rating": 5.0,
      "verified": true,
      "author": "David Fuller",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Good garden “helper”",
      "text": "Vanity caused me to delay making this purchase. Yup. Well, I regret this a good deal after using this kneeler. I have bad lower back and arthritis. While this kneeler will not solve my issues, use will allow me to work in my garden safely. My only issue and it could be my knees, pad for kneeling is a bit firm and thin. This is not a deal breaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Gabby's Dad",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Helps an old man work on his knees in the yard",
      "text": "My wife and I are so pleased with this purchase. There are many identical options on Amazon, and we paid a little more to avoid the long lead-time to ship from overseas, but it's still a great value. I'm a big man (~250 lbs), and I can use it as a bench. The magic is when you flip the device over and use it as a \"kneeler.\" If you have bad knees like I do, the extensions that were the legs before you flipped it become a braces to help you stand up using your arms.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael D. Carpenter",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "The kneeling section really needs to be reinforced someone is going to get hurt",
      "text": "The kneeler is Madewell except when I first knelt on it I heard a crack two of the screws popped out of the wood where the pads are. I put some longer screws in because the wood actually split. If you can make that centerpiece for the kneeling pads from heavy duty plastic that would be a lot better. I hate to write negative things but just needs attention before someone gets hurt I hope you take my criticism seriously but all in all it's a pretty good product thank you for listening. Don",
      "rating": 3.0,
      "verified": true,
      "author": "Donald Panarello",
      "helpful_votes": 3,
      "publication_date": 20190523
    },
    {
      "title": "Difficult to fold",
      "text": "Difficult for a little old lady to fold, and the tool holder doesn't stay on when folding. Not so bad that I'll return it, but I wish I'd bought something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Lily Rose",
      "helpful_votes": 3,
      "publication_date": 20191107
    },
    {
      "title": "Best purchase ever...",
      "text": "I now have three of these....but two are in the house to use. I have two bad knees and can not stand very long..so I have one in the garage and one in the house......and one outside of course. I walk with a cane so basically one handed...I can easily carry the garden bench where I need it and study so not to tip over and two handles to help push me up when I get up. One of the best ideas I ever had to have three of them for my handicapped needs.",
      "rating": 5.0,
      "verified": true,
      "author": "bonniejack",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "May not be good if you have a bad back.",
      "text": "I got this on the suggestion from an acquaintance who had back surgery. Allow you to kneel or sit instead of stand and bend or squat or kneel on ground. My only problem is that the bench is too heavy to avoid pain when carrying, at least for me. Plus one has to bend to fold or unfold. Kind of defeats the purpose. But if back pain is not an issue, I'm sure it would be very serviceable.",
      "rating": 3.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 3,
      "publication_date": 20190923
    },
    {
      "title": "Surprisingly Sturdy",
      "text": "What a shock...this feels heavy and sturdy!! It is not a bench that's going to snap or buckle with regular use! I do a lot of gardening and yard work. After trying this out I have only one negative. I wish it was shorter by 8\" or so. It's kinda hard to bend over continually to work on the ground. Handles are great for pushing up to a standing position but it's hard to keep bending over so far from its height from the ground.",
      "rating": 5.0,
      "verified": true,
      "author": "CatJones",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Best thing for those that need to protect their knees!",
      "text": "Purchased this for doing gardening and putting in wood floors and trim. I just tore three tendons on my right knee and I was feeling it, this helps me slowly lower myself to be on my knees and then get up with ease. The cushion is very comfortable and it helps a lot. Getting up is also easier with the handles. I also use it to weed by sitting on the seat and the height is perfect and it feel sturdy as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasi",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Slips on smooth surface and not cushy at all",
      "text": "The kneeler slipped away from me as I was standing up!! Should have rubber feet or something. Also, the foam is very stiff and not cushiony at all...had to add another pad to it.",
      "rating": 2.0,
      "verified": true,
      "author": "Carol K.",
      "helpful_votes": 4,
      "publication_date": 20180805
    },
    {
      "title": "Just what an older gardener needs",
      "text": "Waited way too long to get one of these kneeling pads with handles. Have stiff hips and joints so getting up from plain kneeling pad required something near by to grab and any pole or handle I could reach. Hate to say this changed my life, but the very first day I weeded the entire garden in 45 minutes without strain or getting stuck on the ground. This seems pretty sturdy, time will tell. Also selected this brand with 2 pocket handle pouch, more useful than the 3 pocket pouch, actually can hold my tools.",
      "rating": 5.0,
      "verified": true,
      "author": "D Wilson",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Great Design and Quality Construction",
      "text": "Following knee surgery, I purchased this garden kneeler to continue working in my garden. The product proved to be even better than I had hoped. The seat and knee pad areas are perfect, wide enough to be stable, but narrow enough to easily place it in tight areas of the garden. The padding is comfortable, yet durable, and the side pouch makes it easy to keep tools nearby. It folds up very easily, allowing for minimal storage space. All construction materials are solid, so I imagine this will last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby K",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Handy dandy",
      "text": "When you feel to old to bend over, this is a handy chair/kneeler for the garden, garage, auto, wherever you have to get down for a while to work. It's a small seating bench and flips over to be a kneeling bench. The arms help me struggle to get upright again. I bought this one for my wife to do garden work - never saw one before - and now I see many times I'll want to use it. I'm around 230, seems sturdy enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Craig",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "The only negative thing i can say is that the pad is very stiff and not comfortable. She is using another pad over the one ...",
      "text": "This was a gift for my 80 year old mom and she loves it. The only negative thing i can say is that the pad is very stiff and not comfortable. She is using another pad over the one on the seater",
      "rating": 3.0,
      "verified": true,
      "author": "Gayle Anderson",
      "helpful_votes": 7,
      "publication_date": 20180424
    },
    {
      "title": "Gotta Order a Couple More of These",
      "text": "This \"gadget\" has become so very useful around our home and garden... My wife and I are in our 70's and getting up and down is frequently a challenge...Whether used as a \"seat\" outside or a \"kneeler\" either inside or outside, this stool makes getting up and getting down easy and comfortable... The tool bag is simply a nice added feature... The padding is adequate in either position... The \"arms\" for the kneeling configuration are plenty strong enough to allow holding and pulling to stand up... May have to order another one or two of the darned things to keep them nearby and handy wherever we are at home...",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Merritt",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Not impressed",
      "text": "So after all the time I had to wait for this to get here and reading the reviews...not really impressed with this product very pricey and is not very sturdy for a heavy person when you sit on it it wobbles you have to make sure it’s on even ground and when I’m gardening that’s not always the case. I would say they need to bring down the price on this product I do not recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "Oden AK",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "I had to have one",
      "text": "I originally bought one of these for my mother. She loved it. She used it inside her house to get to the bottom shelves of cabinets, in addition to using it outside to work in her flowerbeds. After seeing how much easier and more comfortable it made working, I bought one for me. Believe it or not, but at age 66 I have a little trouble getting up off the ground. Now I can look forward to weeding and planting flowers. My knees are saying, \"thank you\".",
      "rating": 5.0,
      "verified": true,
      "author": "G. M. Waid",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "My wife love this for garden weeding",
      "text": "We are older but we still grow a vegetable garden. After my wife had a shoulder replacementand since, she has trouble getting up and down in the garden. This little device provided almost a perfect solution. She can be seen regularly carrying it around the yard. To fold it, you have to pinch the bars in and my wife has trouble with the heavy springs, especially with her repaired arm",
      "rating": 5.0,
      "verified": true,
      "author": "J. Seelye",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Sturdy and Versatile",
      "text": "Very nicely made stool with solid and sturdy hardware. Nothing flimsy about this stool. We use it for all sorts of chores including kneeling on it to wash our dog in the bathtub. It's also very helpful as a stool in working on projects around the house, like replacing hinges, as its just the right height. Very useful and study and collapses to flat easily.",
      "rating": 5.0,
      "verified": true,
      "author": "glistening name",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Helpful Garden Tool",
      "text": "I have a lot of problems with mobility. It is especially difficult, even painful, for me to get up from a kneeling position. I had a knee pad I'd been using when I garden, but I had nothing to hold onto in order to help me get up. So this foldable stool has the two secure sides to help me lift myself up. Being collapsible makes it easy to store. The tool bag is great for holding the tools I need for a particular project. Would purchase it again and recommend to anyone who has trouble getting up after kneeling in the garden.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda B. Wampler",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Nice bench but, the replacement did not come with tool bag.",
      "text": "I think it would be a good bench but, the side will not lock in due to being welded up crooked. May have just gotten a bad one. Update— I sent the first one back and received the replacement to and it works great. This will be most useful for us! No tool bag! Disappointed about that.",
      "rating": 3.0,
      "verified": true,
      "author": "Phillip Wilbourn",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Wasn't sure.",
      "text": "I wasn't sure about ordering this but if it turned out it would be worth it to me. I received it and have been using it briefly and it is just what I needed. I like to pittle in my flower garden and this is ideal. I can get on my knees and pull weeds etc. without pain in my knees now. Also as a stool I can use it to wash the wheels of my vehicles. I am well pleased with this product. It was just what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Atis K. Palmer",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Looks to be just what I need",
      "text": "The four stars are because I have not had the opportunity to use the Garden Kneeler yet. However, based on it's appearance and folding and unfolding it, this looks to be exactly what I need. The pocket tool holder is a nice touch, too. I tried kneeling on it for a minute or two and it seemed to be comfortable. Of course, I will be using it for longer than that when I am gardening. But all signs point to this being a very good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn Russell",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Great for Gardeners",
      "text": "I always hated working in my flower beds because of the soreness I would feel from kneeling and bending close to the ground. On the advice of my sister, who is a consummate gardener and proud owner of this product, I purchased this particular brand. It is fantastic and makes working in the flower beds so much easier. It is well made and quite sturdy. Glad I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Super easy to use, super sturdy, easily storeable.",
      "text": "I bought a garden kneeler like this one some time ago, but my daughter co-opted it, and I really needed one for myself. So glad I did, it saves a ton of bending and strain on my back! The bonus detachable storage pocket is perfect for carrying garden tools and my cell phone, too. I love it! So lightweight to carry from plot to plot, very quick and easy to unfold and refold, very small profile for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Wheatheart",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Very handy",
      "text": "I'm old and stiff but I still have plants and fish (and cars) that require I kneel or lie down. This is comfortable, much better than kneeling on dirt or concrete, and in my case, if I lie down, I can't get back up without a prop. This works very well to boost myself up with. I'd be happier if it were a bit more heavy-duty, but these days there's no such thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Roberts",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Slipery and Flimsy",
      "text": "I would not use this on any solid surface such as wood or concrete. The bare metal painted feet have no anti slip covering and slid out while kneeling on a stone block. Very limited as to the terrain it can be used on.",
      "rating": 1.0,
      "verified": true,
      "author": "Rodney Henderson",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great sturdy kneeler.",
      "text": "This is a replacement bench for one we have had for years that wore out. I am in my seventies and could not weed for hours in the flower gardens without it. It is sturdy, a comfortable place to kneel, and the height of the handle, and weight of the bench make it easy to get up and down repeatedly. Our yard man and my husband like it, too, for kneeling to paint decks, etc. This great kneeler makes me able to keep working in the yard, which I love.",
      "rating": 5.0,
      "verified": true,
      "author": "M. W.",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Nothing negative.",
      "text": "I like everything about it. I was slow to catch on to how it is folded for storage because I did not read the directions. However, now, it is simple. I have only used it as a kneeling device, not a sitting device, but I am using it for the reason I ordered it. Getting up and down in my garden or in my house when I am painting is difficult because of a knee injury. With the Garden Kneeler, I have no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Amo",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Overpriced",
      "text": "When I saw this garden bench I was very pleased, but the next day I saw one similar for only $10.00. My ten dollar bench is just as nice for a lot less money.",
      "rating": 1.0,
      "verified": true,
      "author": "jo n.",
      "helpful_votes": 4,
      "publication_date": 20190710
    },
    {
      "title": "Great for people with bad knees or balance problems.",
      "text": "I use this seat/kneeler inside & out. My right knee has bone chips so I can't kneel on a hard surface without pain. This has enough padding to be comfortable. I used the seat this week while I rewired my tv/internet system. Just the right height. And it folds up so small I just slip it next to the fridge.",
      "rating": 5.0,
      "verified": true,
      "author": "Marne Burke",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Sturdy and well made!",
      "text": "I really like this kneeler garden bench. It is very versatile and well made. It is light enough to carry around the garden and is helpful when I use it kneeling because it has the handles I can use to pull myself up. The bench is well made and the cushion is thick. Very handy garden helper!",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Saves my knees.",
      "text": "This bench/knee protector is wonderful. Not only can I no longer kneel on my “aged” knees without pain but I have a hard time getting up if I do. The sides provide the perfect lift I need to get up and used as a bench, I don’t need to kneel. I refuse to give up gardening and this product allows me to continue without pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Made in China😬",
      "text": "This kneeler will help me outside working in my yard. I’m not sure how sturdy it, is seems a little wobbly even for my 135 lb body. I would not buy it again since it’s made in China😬",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "I’m using it inside too!",
      "text": "I’ve been wanting a seat/kneeler for the garden, and decided to get it now so I can use it inside. I had a knee replacement and can’t kneel anymore. I’m planning to use this now to help when I’m cleaning the floor and shower. It seems very sturdy, and the tool bag is a great size and seems well-made. I’m very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Trouble getting up from the floor? This is for you!",
      "text": "I am 72 and overweight. I now have trouble getting up from the floor and kneeling to do garden work. Recently I had trouble with our Comcast box and spent several minutes sitting on this stool working on the box, if I had had to stoop for that long it would not have been fixed. Its light weight and folds easily. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Smith",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Great Invention!",
      "text": "This garden bench is great! I can now work in my garden more comfortably. Having the sides to help when going from kneeling to standing helps immensely. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Star Girl",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Wonderful for gardening.",
      "text": "A year ago my husband shattered his femur (thigh bone) in pieces. Two surgeries later he is finally back to working in the garden again with help from this bench. Mainly he uses it to kneel on h then has something to help him get up to standing again. It has been such a blessing.",
      "rating": 5.0,
      "verified": true,
      "author": "lindase",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Excellent quality garden kneeler",
      "text": "I had considered a garden kneeler almost all summer, but never got around to ordering it. This one came up with a price drop in my Lists, so I ordered it. It is extremely Sturdy and exactly what I wanted for my gardening. It is well made in every respect. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "MSUMindy",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Great Invention if You Work In Your Garden",
      "text": "If you’re old like me this makes it easier to get up after pulling weeds. I only gave it a 4 for sturdiness because my wife rocked back too far while the kneeler was in the high position. She toppled to the ground and warped the unit. I can’t close it now, but that doesn’t matter because we can still use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan D.",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Easy to store",
      "text": "The garden stool works as intended. I can get up and down by using the handles. I thought I might have trouble bending over my knees while sitting but that is not the case. I like the fact the it folds for easy storage. I might have to use some WD 40 since one side is a little harder to close for me since I have Arthritis. I love the fact that it came with a tool bag that hangs on either side.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee B",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Helpful, Sturdy",
      "text": "Bought this to help get old-bones down/up from gardening chores. Easy to unfold & re-fold. Seems quite sturdy, and will update if does not hold up with more use. Kneeling pads are pretty comfortable, and not afraid to put full weight on handles to help get up. Fairly expensive, but think the quality construction will be worth extra cost.",
      "rating": 4.0,
      "verified": true,
      "author": "OlTex",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "I love this Kneeler Seat",
      "text": "I am almost 70 years old, and this is such a blessing to me. it is easy to fold and unfold, and I can sit on it like a seat, but what is best is that I can kneel out in the rocks and dirt working in the yard, and still have a sturdy stand that helps me stand back up! It changes my ability to do the things I need to do, and I love it! I weigh 250 pounds and it works GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Great for those who struggle getting up from a kneeling position.",
      "text": "My father who is in his late 80’s struggles getting up when he works in his yard. This bench is lightweight, easy to flip from one side to the other and he can easily pull himself up to standing with this bench. The smile on his face first time he used it was priceless.",
      "rating": 5.0,
      "verified": true,
      "author": "emily",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Great Father's Day present",
      "text": "I was afraid it wouldn't get here in time for Father's Day but it did in the nick of time. Delivery took about two weeks. My husband loved it and used it right away. Love how it folds up and does take much room to store. My husband especially loved that it helped him get up and down to the kneeling position. Great value. Also came with the two tool pouches.",
      "rating": 5.0,
      "verified": true,
      "author": "V. J. Albert",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "My knees thanked me!",
      "text": "So easy to fit into a tight spot in my garden! Love the pockets to keep my gloves and tools at hand. My knees love the comfortable pad and the sturdy handles make standing so much easier and safer. The kneeler can be turned over and it becomes a seat. This feature is handy for garden work that can’t be done comfortably from a kneeling or bending while standing position.",
      "rating": 5.0,
      "verified": true,
      "author": "Loyal Reader",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "My Mom Loves It",
      "text": "I purchased this for my 80yr old mother who wanted something better for weeding her garden. She told me to buy the cheapest one. Instead, I bought her the one with the best set of reviews. It was a great choice. First, all she had to do to set it up was unfold it. Wonderful! She can move it around easily and has the stability and cushioning she was looking. No regrets. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Wolff",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Good Product for a Senior Woman",
      "text": "I have been struggling with pain in my legs when getting up and down, so when I saw the TomCare garden bench I was excited to try it. The ordering experience was perfect, receiving the bench in two days. I have been using the TomCare bench both as a kneeler and a seat, and it has helped me to be able to work longer with less pain. It is so easy for me to fold up and put it away with my other tools. I am looking forward to using your product daily as I have many beds to clean up before the edging begins. Thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Ohio",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Excellent Handy Versatile Unit!",
      "text": "Excellent garden seat. Easy to move around, lightweight and portable. Folds up small to hang up out of the way or move from location to location. Very comfortable sturdy foam seat that doubles as a knee pad. Good organizer pouch for garden tools for either side of the unit. Great kneeling pad for Digging soil. With proper care this unit should last a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "bvision",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Nice garden working bench",
      "text": "I like that this is light weight and easy to move from place to place. I like that it can be used as a kneeler (with handles to help me get up!) The seat is a bit high for me when sitting, but it is comfortable. The spring release device for closing the stool flat are hard for me to use, so I just leave it open all the time.",
      "rating": 4.0,
      "verified": true,
      "author": "N.C. reader",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "A must have for gardeners....",
      "text": "If you like to garden, this is one very handy bench. I love it. It also hold all my garden tools. Everyone on my block wants one! I weight 140 and holds my weight just fine. You can use it as a bench or turn it over and I kneel on it for picking weeds.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Wiltgen",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Good for us old coots",
      "text": "I can get down OK but getting up is a chore. Really like this unit, I use it around the house when I have to get down on the ground or working on something near the floor. The padded kneeling platform is great. A bit pricy but it makes chores easier.",
      "rating": 5.0,
      "verified": true,
      "author": "On the Island",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Very hard and uncomfortable.",
      "text": "Seat is very hard to sit on. When you turn it over to use as a kneeler it is like kneeling on the sidewalk. Very uncomfortable. I would not recommend this. Looking for something else",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200423
    },
    {
      "title": "Unit is sturdy and easy to use however knee pad too hard",
      "text": "I thought the foam pad was too hard for my knees. Unit is sturdy and easy to use, however the pad could be softer",
      "rating": 3.0,
      "verified": true,
      "author": "Dhoward",
      "helpful_votes": 2,
      "publication_date": 20190414
    },
    {
      "title": "GARDENING US A BREEZE",
      "text": "The cushion is soft. You can kneel on it. You can sit on it. you can turn it around and sit as a regular seat. it has convenient places to haul yourself up and down and it has a wonderful set of pockets to store the gardening tools. I LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "youbebest",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "A back and knee saver",
      "text": "This little bench is so helpful. I was killing my back and knees trying to keep those pesky weeds out of my many flower beds. I use the sitting option much more than the kneeler side. The pockets are handy to keep small garden tools in. It was a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "JNJ Hogie",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Perfect for anyone who has problems with stopping or kneeling while gardening or doing home repairs!",
      "text": "I have health problems that make it impossible for me to kneel or bend over and stoop for extended periods. This product makes it possible for me to work my raised bed gardens and do home repairs and projects. I am 6' 2\" and 250 lbs. and this stool supports me perfectly. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Klug",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Great garden bench/stool",
      "text": "So easy to set up and fold away. Perfect for sitting next to raised beds or kneeling when working on the ground. Sturdy, well made, love the two side pockets for tools. Worth the price. Delivery quick and no having to put it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Williams",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Fabulous product!",
      "text": "I bought this kneeler garden bench to replace an old, much more expensive one. I am happy to say that this one is sturdy and very well made. I particularly love the sleeve attached to one side that I use for garden utensils, my cell phone, water bottle, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Educated Consumer",
      "helpful_votes": 2,
      "publication_date": 20180701
    },
    {
      "title": "Definitely a good buy.",
      "text": "I got this for my husband, in his 70s, to use when gardening. He uses it both ways, kneeling and sitting, he said the sitting position is just at the right height. He loves it, uses it constantly. It folds down for easy storing. Definitely a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth A Moore",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great for sitting or kneeling",
      "text": "This seat/kneeler is perfect for working in the garden. It is also great as a seat for camping trips. I have trouble getting up off the floor and this helps me. In the tent when I want to stand I use the kneeler to push myself uo. It is great for a sturdy seat for fishing as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired and Traveling",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Sturdy & Easy to use",
      "text": "My mom wanted this for waiting in lines while shopping, running errands, etc. It’s easy to use, folds nicely, it’s sturdy & fairly easy to carry. It’s too big to travel with except in the car, but it would be good to leave in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Melly",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "I highly recommend it.terrific Product",
      "text": "This is a wonderful product. I had become an able to garden because of my arthritis. But with this device, I can get up and down easily as I plant and weed. It is sturdy, versatile and easy to move around as you are gardening. I highly recommend it. One flaw: I left it out in the rain, and the metal rusted and two small spots.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20190423
    }
  ],
  "product_meta": {
    "title": "TomCare Garden Kneeler Seat Garden Bench Garden Stools Foldable Stool with Tool Bag Pouch EVA Foam Pad Outdoor Portable Kneeler for Gardening(Large-21.65\" x 10.62\" x 18.89\",Green)",
    "description": "Color:GreenDescription: Why choose us? Do you feel pain after a long time kneeling or stopping? Is it easy to get clothes dirty when working in the garden? Do you want have a seat after a long time working outdoor? Then why not choose us? Easy to Carry and Use Our kneeler is easy to carry outside, with the foam cushion and light weight, you can reduce the pain and pressure when working outside. The height of our kneeler is designed to protect your clothes from dirt and grass. It is also a multi-functional kneeler, you can also use it as a seat, when you are tired you can have a rest with it. Specification: Product Dimensions: 21. 65\" x 10. 62\" x 18. 89\"(unfolded)23. 63\" x 10. 62\" x 5. 51\"(folded)Product weight: 2. 6kg/ 5. 73lbsMaterial: Steel pipe, EVA, plastic Package Includes: 1 x Garden Kneeler/Seat1x Tool Pouch1 x Instruction",
    "rating": 4.7,
    "feature_bullets": [
      "A Multi-functional Kneeler: It is not only a kneeler but also a seat, you can use it as a kneeler when weeding and also can use it as a seat when fishing.",
      "Two Convenient Tool Bags: One large tool bag has 4 pockets, and another small tool bag has 3 pockets, it is very convenient to keep your tools outdoor.And you can also take it down anytime, it's easy to clean.",
      "Easy to Store: With portable and foldable stool, light-weight, our kneeler is easy to storage, and it will not take up too much your space",
      "Durable and High Quality Material: we use foam-padded cushion and durable stool, the foam cushion can make you more comfortable after a long time stopping and avoid possible injuries. The max weight is 330.69lbs.",
      "Warranty: The warranty period for this item is one year. If you have any issue with it, you can feel free to contact with us."
    ],
    "specifications": {
      "Product Dimensions": "23.1 x 11.5 x 5.4 inches",
      "Item Weight": "5.7 pounds",
      "Manufacturer": "TomCare",
      "ASIN": "B073ZBKN1Y",
      "Item model number": "E-2005",
      "Customer Reviews": "4.7 out of 5 stars2,270 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#4,878 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Gloves & Protective Gear",
      "Gardening & Lawn Care",
      "Workseats"
    ],
    "price": 45.99
  }
}