{
  "website_summaries": [
    {
      "verdict": "Aside from a few quirks – some common to this type of toy – this playset tops the list for its ample space and numerous play possibilities that include 2 tunnels.",
      "pros": [
        "It's easy to assemble the 5 components that come with this exciting toy, including the 2 tunnels, 2 tents, and basketball pit",
        "Constructed with protective mesh and padding for added protection",
        "Reliable customer service – money back guarantee"
      ],
      "cons": [
        "Metal wires could pop through the material if they break",
        "Takes up a lot of space",
        "Some sets had components that weren't attachable due to defects",
        "Balls must be purchased separately"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "One happy little boy!",
      "text": "This thing is AMAZING!! I was a little hesitant because kids can be so rough on things, but this is very sturdy and well put together. I'm not concerned at all after feeling the material and looking at the seams. It was super easy to set up. I bought it for my nephew that lives with me and he is having a blast. Already asking if he can sleep in it. Wish I would have saved this for Christmas because it's going to be hard to top this gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Halverson",
      "helpful_votes": 11,
      "publication_date": 20170919
    },
    {
      "title": "Super disappointed.",
      "text": "The box arrived half opened and the tunnels didn’t match up with where it was supposed to get hooked up to the little play tents. I tried to twist the tunnels to make it fit but it just wouldn’t fit right. Super disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica E.",
      "helpful_votes": 13,
      "publication_date": 20180120
    },
    {
      "title": "Kids loved it!",
      "text": "I bought it for my nephew and he absolutely loves it! My sister also babysits a lot of kids and they all love it as well. The material is good for the price and we think it will hold up for awhile. We also bought 200 balls to go along with it and it definitely wasn’t enough, I would recommend 3-400.",
      "rating": 5.0,
      "verified": true,
      "author": "Bumblebee",
      "helpful_votes": 9,
      "publication_date": 20180106
    },
    {
      "title": "Disappointed but the kids do enjoy what they can put together",
      "text": "For all that is happening right not with limits to where to take the kids this is a fun distraction. Problem I have is with one of sections of the playhouse/ballpit. In my case cube section is not stitched correctly and therefore does not form a cube but more of a warped diamond I cannot pull apart to complete there tunnel experience. I don't necessary wish to return item but in not sure how to get a non defective replacement part. I'd hate to have to take from kids to return but item is incomplete.... :(",
      "rating": 2.0,
      "verified": true,
      "author": "Agent23tv",
      "helpful_votes": 2,
      "publication_date": 20200326
    },
    {
      "title": "Fun for kids, but the stitching is not worth the price",
      "text": "I was looking for a jungle gym to keep my 18-month-year-old son active while I'm working from home. The gym was easy to set up and folds up into a compact carry case, which was included. Each piece ties together with a small string attached. The great part is that my son absolutely loves his new indoor jungle gym. Total use so far = 1 18-month-year-old played for a total of 2-3 hours. Biggest Issue = A large rip at one of the seams only after 2-3 hours of play.",
      "rating": 1.0,
      "verified": true,
      "author": "rfisler",
      "helpful_votes": 2,
      "publication_date": 20200322
    },
    {
      "title": "22 mo old loved it",
      "text": "Got this for my soon to be 2yr old grandson.... he absolutely loved it when first received.. I purchased separately balls for the “pit” area... that is one of my negatives. Wish openings where a little higher as the balls do not stay in. I have this indoor so may be different if staked down outside, but the pieces don’t stay together well. After several uses the one side/corner of pit at opening always seems to get pushed in not sure how to “fix” to stop from having to readjust after he gets in.... so overall if you can handle picking up balls constantly... it’s worth it",
      "rating": 4.0,
      "verified": true,
      "author": "Sherikg",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "My son loves it but there are advertising issues.",
      "text": "Let me start off with the fact that this does not come with any Balls. No balls for the play pit and no balls for the dart board. The photos show that balls do come with it. I am ordering some balls for the play bit but I dont even know where to find the ones for the dart board. So not happy about that. It is cute, easy to assemble and my 1yo son is really liking it. I would have bought a cheaper one, that is similar, if I knew it didn't come with balls. The other one clearly labeled that it didn't come with balls. So the price was justified.",
      "rating": 4.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Best purchase in a while, just wish it was sturdier",
      "text": "Got this for my 2 year old for Christmas and she hasn't stopped playing with it. It got a hole the very first day we set it up, but she's continued to play with it anyway. She likes to crawl through the tunnels, and play with the little target, but the ball pit is definitely her favorite part. It's a great buy if you have a small child - great way to burn off energy, and lightweight and easy to move and rearrange to fit your house.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Love it but",
      "text": "Dont think but if your child is an intensive user and very active this type of playyard will not last long. Only my complain is the tube knotting extensions are not enough 2 each sides are very less it needs to be four at least. I will sew my own. Also middle connection unit doesnt have closed part or can be closed we use badsheet for it. Also I wish they should have a ripstop nylon version and double knitting expensive version which might last longer.",
      "rating": 5.0,
      "verified": true,
      "author": "ONDER",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Manufacturer Defect, cannot connect the parts.",
      "text": "This seems to be a great ball pit but there is a manufacturing defect which doesn’t allow the tunnel to attach to the play cube. The connectors don’t align making it impossible to attach and I have tried to contact company which says is Satisfaction Guaranteed and a 6 month warranty but have been unable- there is only a form to fill out on their website, no number to call or email. I am disappointed as it was purchased for an upcoming birthday party. Will update review if this issue ever gets fixed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20180206
    },
    {
      "title": "Barely useable.",
      "text": "Not sure who was at fault, but the item arrived damaged with parts missing. I had it shipped to my daughter's house and only part of the tunnel was useable. Regardless of who was at fault, it doesn't speak much to the durability of the product. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Mykids'dad",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "DANGEROUS/ NOT DURABLE",
      "text": "UPSET !!! Wire came out after few uses and the ties wripped that hold It together !! My child has only used it a few time since Christmas 2019. Now I can’t even return it. I’m so unhappy and disgusted after all the money I paid!!! Wire is coming out and the ties has wripped that hold it together. NOT DURABLE",
      "rating": 1.0,
      "verified": true,
      "author": "MamaBear",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "PIECES DONT STAY CONNECTED!",
      "text": "The tents do not connect easily at all! They disconnect very very easily allowing all of the play balls out on the floor, very disappointed because this was a gift for my child and they couldn’t enjoy it :(",
      "rating": 1.0,
      "verified": true,
      "author": "Alexandria",
      "helpful_votes": 3,
      "publication_date": 20190206
    },
    {
      "title": "DO NOT BUY",
      "text": "What a major disappointment! They said \"SUPERIOR CONSTRUCTION – UNRIVALED GUARANTEE ★ TRY THIS RISK FREE for 30 days. We guarantee your 1, 2, 3, 4, 5, 6, 7, or 8 year old girls and boys, along with your cats and dogs\" my 2yr old playing with it for 30 minutes and it tore almost instantly. Terrible advertisement!!! My 8 yr old couldn't fit in this if he tried. We didn't let him try btw. It doesn't stay open and folds in on itself. The tunnels are too small for my 2yr old!! I will be returning this! Again, PLEASE AVOID THIS WASTE OF MONEY!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "WOW MOM ITS LIKE WE HAVE OUR OWN MCDONALDS PLAY PLACE",
      "text": "Straight from my kids mouth, WOW MOM ITS LIKE WE HAVE OUR OWN MCDONALDS PLAY PLACE! I've already ordered some balls for the ball pit, they can't wait for those to come in. My kids were super happy with this purchase and it has been hours of fun since it was delivered.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Cox",
      "helpful_votes": 2,
      "publication_date": 20170821
    },
    {
      "title": "So far so good! I'll update later...",
      "text": "I have just received the order and from the looks of everything... So far so good! Everything was in packaging, wrapped and safe. I did not try it out yet with my daughter because it's supposed to be a surprise gifted to her on her birthday ! I can't wait to see what the future holds for this plaything lol. I'll update in that moment.",
      "rating": 4.0,
      "verified": true,
      "author": "BlackBear101",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "We filled the ball pit with a bag of 400 balls and it's the perfect amount. Nice and lightweight",
      "text": "I set this up today and my kids have already played in it for several hours. They are having a blast! We put it in our garage so we have an indoor playground for the winter. We filled the ball pit with a bag of 400 balls and it's the perfect amount. Nice and lightweight, easy to set up or pack away.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 2,
      "publication_date": 20171212
    },
    {
      "title": "Amazingly quick set up- hours of fun- and just as quick pack up!",
      "text": "5 piece playhouse that you can use as individual sections or put together for a large playing area. It is unbelievable how easily and quickly this gym sets up and how equally quickly it packs back up. The gym fits easily into a thin carrying case. I bought 2 different ones so that my grandchildren have one at home and one at my house. We don't have balls yet so it is just an open play space. We plan to buy the balls but right now it is just as fun without them.",
      "rating": 5.0,
      "verified": true,
      "author": "mom of five",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Love it!",
      "text": "I love these play tents! Perfect fun for a day inside, you can just pop it up wherever you have space, throw some toys and balls in the tents and tubes, and the kids play ALL DAY! I love that it sets up in seconds and when you're ready to reclaim your living space you just fold it up and stick it behind the couch (I'm not clever enough to fold it back to put it back in the bag, and they're flat so the couch works best for us!) The boys love the tent with the holes on the side, they try to throw things through the holes to each other inside. Absolutely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Great playhouse, our kid loves it",
      "text": "While we've only had this for a bit of time (I'll update my review if our opinion changes after extended use), this is a great playhouse that works well with a set of balls.The only thing I would improve at this point is more color options. The standard primary colors palette works for most kids, but I'd love to see something that pushes what kids products could be by using more modern, home-friendly color palettes (mustard, light grey, brown, and dull rose for example). I can't really dog this product for not doing this, but it's the one thing I truly would have preferred so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad Hodson",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Its ok i guess",
      "text": "Well, its been a week, i like to give a little time to see what the product is all about before i give a review & sadly this oroduct hasnt held up to 3 young ones. This is supposed to be good for kiddios & for the most part, its fine. Sadly there has already been some tearing as shown in photos. But the rest has been ok so far. Anymore & i think itll drop the rating. I had high hopes for this, but it hasnt been super great. The connections between tunnels isnt so great & its just not well built obviously.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Brand new but awesome so far!",
      "text": "My kids love this 5-piece set! We bought 800 balls and it seems to be the perfect amount. There is so much to do. My kids range from 2 all the way to 8 years old and they all find something to enjoy about it. I am a little concerned about durability. The material is thinner than I thought it would be but the warranty seems pretty good, so hopefully there won't be any problems!",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah J",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great product!",
      "text": "The playset is wonderful! My baby boy loved it of course (he's 15 months) but one of the best features of the item is the ease of it's set-up and tear-down. The fact that it can be stored in the relatively small (supplied) storage pouch is also amazing. It does take a little finesse to collapse some of the components but after looking like an idiot for a few minutes just give in and use the included instructions and you'll get it. Great product! I also recommend the \"non-crush\" balls that you have to order separately (unfortunately). The are super soft and very hard to permanently distort.",
      "rating": 5.0,
      "verified": true,
      "author": "AK Hamilton",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Nice quality fun playhouse for baby",
      "text": "My baby is only 8 months so we've only used the tunnel so far for her to crawl through. But I look forward to her playing with the whole set. She's already got a big smile every time she looks at the tent or tunnel. It'll be so much fun! Everything seems to be sturdy made and pretty easy to fold. It came with a round pouch to stow everything and I found that to be very handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuan Li",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Even our cats like it!",
      "text": "My 14 month old son and our 3 cats have enjoyed this product for about a month now. We purchased a 500 pack of balls and it fills the ball pit well. I do wish the tunnels fastened more firmly to the rest of the structures. It's a simple hook and loop so it's easy for the balls (and the baby) to escape between them. I'm 5'9 and about 160 pounds and I can belly crawl through the tunnel after him.",
      "rating": 4.0,
      "verified": true,
      "author": "Dustin C.",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Good for inside but not outside",
      "text": "playing outside and the wind blows it over all the time. Hard to put back in the package for storage. Not worth the money. Kids didn't like it very well.",
      "rating": 1.0,
      "verified": true,
      "author": "Connie Wininger",
      "helpful_votes": 3,
      "publication_date": 20180612
    },
    {
      "title": "A little flimsy but you get what you pay for in this instance.",
      "text": "A bit flimsy but worth the money. We have the ball section in one room and the pyramid section in another. The tunnels don't fit that well into the connectors and in one end the string to tie don't line up. But the kid loves that ball pit (we bought 400 and that fills it up nicely) so not too bothered about not having the tunnels connected. And again, for the price don't expect more.",
      "rating": 4.0,
      "verified": true,
      "author": "AnneH",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "The kid loves it",
      "text": "Got this for my 2 year old's birthday, and so far he really loves it. We got 200 balls, which looks like an astonishingly little amount, but works well for his age. It basically covers the floor of the ball pit area, but things cant get hidden underneath, and it will be better for cleanliness for now. As he gets older, we may consider adding more balls. So far no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great Toy for Children",
      "text": "Easy to set up/assemble and to take down/fold. My son loves it! It took him a little bit to get used to the ball pit, but he loves playing in it now. You have to buy balls separately, which wasn’t ideal. The more the merrier - we bought 400 and it looks like 100. The reason I gave 4 stars is because the item arrived with what looks like black ink on most of the pieces and it doesn’t come off with cleaners. However, Amazon did assist me with this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Cb ",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great toy for your 3-5 year old to exert their energy!",
      "text": "With the current situation and a lot of parents are working from home and kids are not in school, I highly recommend buying this product so the kids can be occupied by themselves. It also allows them to use up their energy so they can sleep easier. Love the colors and easy to store and fold. I wish it was a tiny bit more durable though...but overall, very happy. I recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Fitcious",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "The kids found this first on Christmas and the videos ...",
      "text": "The kids found this first on Christmas and the videos we took were priceless. It is well worth the money. Be sure to add extra balls. 3 bags works well. Add a bounce house for a complete circus.",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 3,
      "publication_date": 20180125
    },
    {
      "title": "My son will love it!",
      "text": "The only thing that annoyed me about this is that it didn't come with the 5 velcro balls that were supposed to be included. At the price it is, I expect everything it's supposed to come with to be included in the package. We did get a $5 rebate, so maybe that's supposed to cover the missing velcro balls. Great product otherwise!",
      "rating": 4.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Need adult sized tunnels",
      "text": "I wish the tunnels where bigger so I can more easily join my kiddo. It would be way more fun for adults to join their kids. We need bigger tunnels! Family fun is such a blessing from God let's encourage it as much as we can. Also the wires on the bottom hurt my knees when I crawl through. Foam covering the wire would probably help!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremiah ",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Huge!",
      "text": "Got this mostly for the ball pit part. We don’t really have space for the rest. The ball pit and tunnel are pretty cool. I sort of wish the area where the tunnel area connects had better Velcro. I also wish there were 4 ties instead of two to connect the tunnel. My son loves the ball pit. It took about 650 balls to fill it adequately.",
      "rating": 4.0,
      "verified": true,
      "author": "Maya",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Attachments different on the tents so the tunnels are scrunched.",
      "text": "All in all we liked these tents and tunnels. My daughter just received hers for her bday so I’m not sure on the wear and tear of it yet. I did however receive a 6 months free no questions asked warranty for replacement if something does happen which I like. The one thing I didn’t like was the way the tunnels attach. The attachments are on the sides of one tent and up and down on the other. So you pretty much have to twist the tunnels for them to attach to 2 tents. Which scrunches up the tunnels a bunch. If these were the same on all I would have rated it higher.",
      "rating": 3.0,
      "verified": true,
      "author": "teresa green",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Needs better durability.",
      "text": "The only thing I wished was different were the ties. I'd prefer velcro instead. The ties don't hold it together too well. I have to keep adjusting it with the tunnels, especially when your child is back and forth traveling through them. The material started to rip from the tugging, which is why I prefer velcro. I plan to buy velcro to make the durability better.. It also has the straps on the outside for stakes to use in ground for outdoors, but no stakes included. Another thing you'll have to buy if you plan to use outdoors.. Other than that, its a great product. My son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Tovar",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Very disappointed!! Will be throwing away as soon as ...",
      "text": "Very flimsy!! If I hadn't thrown away the bag it was packed in I would have sent it back the next day. Doesn't stay together well and all the balls come out where the tunnels attach because it doesn't stay together. Very disappointed!! Will be throwing away as soon as I find an alternative.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy Patterson",
      "helpful_votes": 5,
      "publication_date": 20180126
    },
    {
      "title": "Granddaughter loved it",
      "text": "My 18 mo old granddaughter loved this although it was not the easiest thing in th world to keep put together, love how it breaks down but it is rather cheeply made. took us forever to figure what piece hooks on what piece. But again my baby loves this so much",
      "rating": 3.0,
      "verified": true,
      "author": "Christine Gitchel",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "My best purchase of the year far!",
      "text": "I bought this for my toddler grandson's birthday and he's played with it nearly every day since we took it out of the package. I love that it's easy to put up and take down. Because we're limited on space, some days we just put up parts of it, but that keeps it interesting for him. It's holding up well so far. The only complaint I have is the way the tunnels attach to the other structures- he gets frustrated with the gaps that occur during play because they just attach with two tie points. He wants me to come tuck the tunnel back inside the opening to the other structure.",
      "rating": 4.0,
      "verified": true,
      "author": "rosalie r peterson",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Unbiased Product Review",
      "text": "On the whole, there is fun to be had for children who use it. However, this toy has little to no structural rigidity. It is flimsy fabric held together by flimsy strips of metal. If your child leans against any part of it it will not support their weight and they will absolutely fall over and the playpen will collapse. The tunnels do not connect securely and are held together by small strings connected to the ends of each individual piece that you have to tie together. If you are watching your children while they play then they should be quite alright and enjoy themselves.",
      "rating": 3.0,
      "verified": true,
      "author": "Brendon",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Great Product",
      "text": "Great product, Kids loved it. Only issues to consider is be careful when folding away if you don’t follow the directions you’ll tear the fabric. Starting to see a small tear around the hoop so not happy about that, it’s only been 1 day. I’m a little worried about the durability with this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Good play item to have while parks/playgrounds closed..",
      "text": "I used this for my 8mos old bc we've been kind of closed in due to covid 19. It gives her something to do and use in doors or out. She loves the tunnels and hiding and playing peekaboo in it. Its very easy to put up. I do think that one improvement could be to use velcrow to hold the pieces together it may make taking it apart to put up quicker than having to untie the tie pieces that hold say the tunnel to the tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Simmons",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Well !?!?!",
      "text": "My grand Kids loved it while it lasted, it DID NOT Come With the RIGHT PIECES so we could never really put it gether wright. Ours came with 2 ball pits and not tint, which meant they had not way to enter into the toy with out climbing over.",
      "rating": 3.0,
      "verified": true,
      "author": "Aimee Acker",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Easy to set up",
      "text": "Our 18 month and 3 year old grandsons enjoyed this playhouse. I felt it was a good value for what we got. I think they will enjoy this toy for a few years yet. Not as easy to put away as it is to set up! We manage to get it back in the bag though. For as big as it is, it goes in a small bag to store away.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim R. Annear",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "A Blast",
      "text": "Identical to picture. Product was big and colorful. My son had lots of fun playing in his ball pit and climbing through the tunnels. I wish it was more sturdy where the tunnels connect as they kept coming out. They wouldn't stay put with just the tie downs.",
      "rating": 4.0,
      "verified": true,
      "author": "BabyGyrlK",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "BEST PLAYTIME EVER FOR MY GRANDSON",
      "text": "Due to the amount of room it takes, we put the tunnel and ball pit in our living room. This gives a break when we are watching our movie of the week. He will play in there for at least a half-hour just \"swooshing\" the balls around like he is in the pool. Then of course, the balls start flying out of the pit. This resolved by putting buckets in the pit. He will fill up the buckets and empty them and do it over and over again. Just a side note. His two aunts also got in the pit with in. They are both small in stature (one is in college and one is in high school).",
      "rating": 5.0,
      "verified": true,
      "author": "gegonzalez77",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Easy to fold and store",
      "text": "My kids don't love it as much as I'd hoped but it's nice when company comes over or when we have kids parties. It takes up a lot of room but there are quite a few things the kids are able to do with it. It's easy to fold and takes up little to no space to store which is really nice. The fabric does tend to tear where you're supposed to join each piece together. Overall I am satisfied with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Connor Powers",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great play for a great price",
      "text": "I bought this for my grandson's second birthday. He smiled and laughed all the way through and around these well-made pop up tent/tunnels/attachments. He pretty much ignored the other toys he received for his birthday. He and his friends are having so much fun! The components are well-covered with strong materials, and even the mesh part seems strong. I can tell this will be an often used play \"structure\" and a long lasting value. Great to use together, apart, outside, or inside. Kids can really use their imagination. Love it!!! My own boys had something similar when they were young, and we got many years of use out of them.",
      "rating": 5.0,
      "verified": true,
      "author": "DMS",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "In-Home ChuckECheese... Social Distancing Playtime!",
      "text": "Set up took less than 5 mins, just pop and go. My husband spent more time rearranging to find out which way he wanted it to look, than it did to put together. Can't wait until our little one comes into the room and sees it. Love this item!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Robles",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "LOVE IT",
      "text": "This jungle gym playset was for my Grandson and he loved it. His parents don't allow the kids to play in jungle gym in public areas due to germs and viruses. It's well done and a lot of colors and fun tunnels for him to enjoy and keep him occupied while mom gets other things done. Well done to the company. THANK YOU",
      "rating": 5.0,
      "verified": true,
      "author": "Bettyboop ",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "My Grandson loved this tunnel playhouse",
      "text": "My Grandson loved this tunnel playhouse, we bought a pack of 400 balls to go with it. Hours of fun. The nice thing about it is that it's great for all ages and every winter when you are in the house with your kids , they have something to do",
      "rating": 5.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Perfect toddler hideout",
      "text": "My 14-month old son has taken a liking to tents & hideouts. Purchased this tent as well as some of their balls & it has been the biggest hit with not only him, but his older siblings as well. It takes up space, balls go flying everywhere, but it is absolutely worth it seeing how much fun they are having together. Their little laughs and screams of enjoyment are priceless!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "It's nice that you can use each piece on it's own ...",
      "text": "18 month old loves it (and cats too)! It's nice that you can use each piece on it's own and don't have to have everything out at once. We usually have the ball pit out at all times and the other pieces here and there. Good quality, except for the bag which I'm worried will rip one of these days around the zipper. Quick setup and put away.",
      "rating": 5.0,
      "verified": true,
      "author": "A Smith",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Great play house!",
      "text": "This playset is fantastic. It takes up a LOT of space, but my toddler loves it. Beware, though...if your spouse is like mine, she may lie in wait to bombard you with the balls (not included- purchase separately) from the ball pit.",
      "rating": 5.0,
      "verified": true,
      "author": "Miz",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Cheaply made",
      "text": "It shipped quickly enough, but honestly, I was a bit disappointed in the quality. I knew it would be canvas, (we have another, older tube) but it feels rather cheaply made. Our other one, which was bought used, a few years ago, is thicker and better made. This new set had a rip within 4 days of setting it up, and the kids hadn't even had a chance to play more than once. That said, it's plenty big enough, and the kids do love it! I just wish it would've been thicker fabric!",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa Thurman",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "This tent is great! It’s so much more spacious than expected",
      "text": "This tent is great! It’s so much more spacious than expected! My 1.5 year old absolutely loves it. We can use 1 piece at a time inside, or assemble the full playhouse in the backyard. It’s extremely easy to assemble and take down, and it collapses into one small bag for easy storage.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Super happy with this ball pit",
      "text": "Not perfect, but definitely perfect for the price! We got this for our son's 1st first birthday and got 400 balls and it works well. He's still afraid of it, but the kids a bit older than him at his party had a blast! The walls aren't super strong which can be good and bad, but overall I would definitely recommend this and we're super happy with the purchase. It is quite big! So make sure you have the space for it. It folds up easily, but we always leave the ball pit up as we need some place to store the balls.",
      "rating": 5.0,
      "verified": true,
      "author": "Jevin Wallander",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Easy to move and set up anywhere!",
      "text": "Easy to store! Easy to set up! The child loves it. Good quality material sturdy.so many fun things they can do with the tunnels and different ball pits. It's like taking them to Chuck Cheese but they're at home inside... or outside! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Pettigrew",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Easy Assembly",
      "text": "Product is extremely easy to assemble. Comes with a variety of options. Colors are vivid. However, the durability is not as expected. Within minutes of kiddos playing, the seam to the teepee tore.",
      "rating": 3.0,
      "verified": true,
      "author": "Tamika S.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Simple easy big; like some of us.",
      "text": "Big enough for 2 toddlers to play comfortablly. Each section is about 3' x 3' with the ball bit about a foot bigger. Seems sturdy enough. Don't expect it to hold a babies weight on the walls though. The whole thing will take up your living room or play room. About 8' x 8'. The connections between the pieces could be better than a simple plastic string.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly Lopez",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "and they all LOVE these. We do not always have it out",
      "text": "My grandsons are aged 7 down to 18 months, and they all LOVE these. We do not always have it out, aqs it depends on how much mess I want to tolerate, and how much room I can devote to toys. But if we want to get a lot of other things accomplished, this toy will keep them busy for quite some time!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra S. Long",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Cheap price for cheap product. Get what you pay for",
      "text": "Cheap connectors. I ended up making my own Velcro connectors. Other then that product was exactly as described in description. If you want durable ones then go spend some more money somewhere else.",
      "rating": 4.0,
      "verified": true,
      "author": "logan",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great product and fun for kids!",
      "text": "My 18-month old loves this! It takes a few packages of balls to fill the pit, we put 400 balls in and is enough for now. I wish there were either more ties to keep the tunnels attached to the other pieces, or zippers, but overall a really fun product!!",
      "rating": 4.0,
      "verified": true,
      "author": "Lysa S.",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Kid aMaze!",
      "text": "10 month old jumped right in and started giggling his way around. I only tested it a minute with him, but it worked as expected. The tunnels are obviously not sealed, but attached at one anchor high and low. But, I'm sure this won't affect his play.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason B.",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "almost poked my eye out... not really ...",
      "text": "almost poked my eye out... not really but i could've. extremely unsafe. one of the metals rods mustve snapped and tore through the fabric. this was just as i was un boxing the product. i got a quick return from amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "C.Bello",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "My son loves it!",
      "text": "This is really a great size for my son to play in! Many toys appear smaller than they are and this was not the case with this. He loves to climb through the tunnels!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori S Crowley",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Birthday party pleaser",
      "text": "My review is really more of a 3.5 star review. I bought this solely for keeping the toddlers entertained at my son's first birthday. The older kids 3-5 seemed to really enjoy the ball pit. My only real complaint is that the tunnels connect by tie string at 2 places (the top and the bottom of each side), so on the side where the ball bit connects to the tunnel, the balls actually find themselves coming out of the sides. (Side note: balls do not come with the purchase of this playhouse).",
      "rating": 3.0,
      "verified": true,
      "author": "Angela C",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Good deal!",
      "text": "This thing was awesome for my little. I will say that I was NEVER able to get it folded back up right, and the pieces tended to come apart easier than I'd like.. But ultimately my girl loved it, and it stood up to the weather her and the dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory Scott",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "I'd buy again",
      "text": "It's durable enough to handle my two boys. It pops right back up to shape every time they climbover it. And it's much bigger then I expected. I wish it had a different way to attach the pieces though. It's a tie string, which works great but, with a strong enough tug it comes undone since you don't wanna knot it if your like me and take it down daily. I like it though.",
      "rating": 4.0,
      "verified": true,
      "author": "samantha smith",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Cheap but my kid still loves it",
      "text": "With just two little stings attaching the tunnels to the tents they come apart quite a lot even with my little 18 month old daughter in it. It’s a little smaller than the comparable ones other friends have gotten their kids too. But, my kid loves it and it’s held up well to her playing in it every day.",
      "rating": 4.0,
      "verified": true,
      "author": "thebarzeen",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "YES",
      "text": "So i bought this as a Christmas gift for my 2 nieces, & they absolutely loved it. It's big, easy to fold and super fun for the little ones. Only thing about this product is that it doesn't come with enough balls, but I'm sure you can find a deal on here somewhere. This thing is awesome. Get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "TONS OF FUN!!!!",
      "text": "My 18 month old LOVES it. Even my 9 year old wants to play in it. Pretty easy to put together. Its huge so make sure you got a big empty space. 10/10 recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Celeste Hegmann",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "The best ball pit and tunnel set ever!",
      "text": "This is AWESOME! Both my 9 year old and my 18 month old love this! They played with it for hours and hours. It was super easy to set up and super easy to put away! It is very large and fills up my entire living room but the more the merrier! The quality is great and it is easy to wipe clean with a wipe.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti Ryan",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "I’m certain my grandson will have lots of fun with it",
      "text": "I received this yesterday and had to open it up and take it out. I’m certain my grandson will have lots of fun with it. But.... no way will I ever get it back in that little bag. I can get the sections flat but can’t twist them back into a little circle. Now I know why it came in such a large box. Lol I bought 200 balls and it looks like I should get 200 more. The basketball area is pretty big.",
      "rating": 4.0,
      "verified": true,
      "author": "pattrick murray poston",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Fun!",
      "text": "Framework is a bit on the thin side, but it's holding up quite well. I recommend purchasing several hundred balls. :)",
      "rating": 4.0,
      "verified": true,
      "author": "13107Mama",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "Hours of fun, decent quality!",
      "text": "Hours of endless fun for my kids thats easy to set up in just a couple minutes. The only frustrating part is that there is only a tie to attach the tunnels to the tents and ball pit at the top and bottom of the tunnels so they move around when the kids crawl through them. This could be easily improved with four ties, so there is two on the sides too. The other tough part is folding the tents, but once you get the hand of it it’s not bad. Overall not a bad purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Tori",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Colorful fun",
      "text": "My granddaughters, age 5, they absolutely loved it; spent hours playing in this gift I got for them during the Thanksgiving weekend!! Even their huge beautiful dog Buddy (a black lab) crawled in with them",
      "rating": 5.0,
      "verified": true,
      "author": "Yvette Gallardo",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Well built and easy to set up and take down.",
      "text": "I bought this for my 2 year old grandson to keep at my house. The best part about this product is that it folds up and you can put away after they leave. It takes up a lot of room so I usually only set up one tunnel and the tent (unless other children come over). This is a great play set for hours of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Sanders",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Perfect! Literally the best ever!",
      "text": "Its been a year almost and we still have this its still all together nothings torn or ripped this thing is super durable. I have 3 kids and tons of little cousins and nieces and nephews and they all play in this all the time. Best ball pit tent set ever!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Cheap and no balls included.",
      "text": "This should come with some balls geez. Also there’s no way you’re getting any of this back into the travel case thing after you open it. Also I would not recommend buying this for outdoor use, as it is just cheap enough to rip like crazy even in grass. Fun for super imaginative little ones indoors.",
      "rating": 3.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "fun",
      "text": "Our twin boys loved it. Very easy to assemble. The only thing I would change is the way the tunnels connect. It is slightly starting to tear at a couple of the spots where you have to tie and connect. Other than that. We registered for the warranty obviously! They love it",
      "rating": 5.0,
      "verified": true,
      "author": "Lynette  Stephens",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Nice toy",
      "text": "My two year old is a little rough on things. Overall a pretty decent toy but I don’t expect to last for that long. The tunnels don’t connect to the tents that well so they come off regularly",
      "rating": 3.0,
      "verified": true,
      "author": "A HH",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Easy to set up",
      "text": "Easy to set up. Little difficult to put back in bag but not crazy hard to do. Has been durable for 2 months so far with a one year old and five year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B. Lewkowitz",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Be careful opening it",
      "text": "I didn't like the way it sort of popped open. Make sure there are no little kids standing near. After assembly, however, my grandchildren love playing in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Evans",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Not fun or safe",
      "text": "Sections do not connect, sections come apart easily and the whole thing collapses easily. We returned bc within 5 mins we had a minor emergency .",
      "rating": 1.0,
      "verified": true,
      "author": "Jen Knowlden",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Great for older infant/toddlers!",
      "text": "This was a great last minute idea for an infant/toddler party at the house since the rain cancelled things at the park!! We initially had things set up in the garage with a padded mat under, but my kids have not wanted to stop playing so it’s set up in my living room. Only con is I wish the ball pit walls didn’t so easily collapse when pulled down. Other than that I’d recommend this product!!",
      "rating": 4.0,
      "verified": true,
      "author": "Rhonda Mercadel",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Designed in America. Made in China. Quality Controlled...Nowhere.",
      "text": "Like others have stated, seems the latest batch of these from China have the connectors for the main cube not aligning with the tunnels. I would not purchase until this is fixed. Also my ball pit portion had a small tear in the material. Will be returning this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Thang Nguyen",
      "helpful_votes": 3,
      "publication_date": 20180225
    },
    {
      "title": "Granddaughter loves it!",
      "text": "We got this to keep at our house when our granddaughter comes to visit. She loves crawling through it and peeking at us when she is in one of the tubes. Lots of fun indoors and out!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonPrimeShopper",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Best purchase ever!",
      "text": "Best purchase ever!! I bought this for my almost 8month old and he loves it! We had to buy to bags of balls, I’d even suggest buying 3 or 4 just to make it more full. The cats love it too. It’s a lot of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith & Ashley Y",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "So amazing! So easy to put together and put away",
      "text": "So amazing! So easy to put together and put away. My toddler loves it even without balls. She carries the tents around herself to place where she wants them. Will be a great travel accessory to go to friend's houses.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Keep getting the wrong tent!!!",
      "text": "This is the second time I’ve ordered this hoping to get the one that is pictured on Amazon. The picture attached is the one I keep getting. I don’t want this one. Please fix your picture on Amazon because it is very misleading. Completely disappointed!!! I looked at a ton of different tents for my son and this is the one I chose and I can’t seem to get it. Will be returning AGAIN!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer A. Falco",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Son and friends of all ages absolutely love this. Would buy again",
      "text": "Son and friends of all ages absolutely love this. Would buy again. One note, the wires are not padded, but one-year-old doesn't seem to mind.",
      "rating": 4.0,
      "verified": true,
      "author": "JEFFZZZ",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "My 1 year old LOVES this thing!",
      "text": "Easy to put together and my kid loves it! Such a great form of entertainment to keep him occupied for longer than 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Sechrist",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great, inexpensive ball pit/ play tunnel system for small child",
      "text": "For the price, this is a great value for a smaller child (maximum of small 6 or 7 year old). Its super easy to set up & take down. I do wish the tunnels were a little bit larger diameter & that there were 4 connection points, vs the 2 it came with for more stability (velcro would be a great option for that, rather than short ties). Our 5 year old was ecstatic when he walked outside and found it in the yard.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great playhouse",
      "text": "The playhouse is Awesome. I highly reccomend this playhouse. My 1 year old absolutely loves it. He tries to stand up inside if the tunnels. He plays in a few pieces at a time. The 5 pieces together is big and takes up most of his play area. Bigger kids fit and can play as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Charleen Gregory",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Best Christmas gift and teachable \"clean up\" moments",
      "text": "My son lovessss it. Only downside is you have to tie the pieces together which leaves gaps on the sides. Someone say helloooooo balls all over the floor every time he leaves the ball pit to go into a tunnel. But if you don't mind cleaning them up this is perfect for you. Love that you can break it down or use the entire thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Martika",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "a Christmas hit!",
      "text": "I thought my husband was crazy when he picked this out for our 1 year old for Christmas! OMG, she LOVES it....its the 1st thing she heads for in the morning and the last thing she plays with before bed! The only down side is it, its large for a living room but great for a toy room/basement! I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "It had cut places in the material before it was ever used.",
      "text": "I bought this for 2/3 year olds to play in at a party. Opened it up and there are 2 cuts in the material! The ties do not line up. I had to use it so I patched the slits and taped it so it would stay together. I wanted my money back but had nothing else to use because I only ordered this for the kids. What can you do?",
      "rating": 1.0,
      "verified": true,
      "author": "Patty Lamb",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Easy to assemble",
      "text": "This is my second time ordering this product... very easy to put together and take apart. The only downfall of this is that it can rip easily as the kids crawl through the tunnels. It's only connect via a string that you tie. Not very strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Shay C",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great Playset.",
      "text": "My 14 month old grandson enjoys playing with it. He will be able to use it for many years. The entire playset was overwhelming, so we are only using one tunnel, the ballroom and the triangular play tent. I was concerned about being able to fold up the unused parts, but was successful after watching a YouTube video. I think my cats enjoy the play set more than my grandson. It’s their new favorite place to sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200825
    }
  ],
  "product_meta": {
    "title": "Playz 5pc Kids Playhouse Jungle Gym Ball Pit with Dart Board & 5 Velcro Balls - Fold Up Pop Up Tents, Tunnels & Basketball Pit Play Center for Boys, Girls, Baby, Toddlers w/ Travel Zipper Storage Bag",
    "description": "Playz - The #1 leading manufacturer in children's play tents. – Based in the USA\n\nLet your kid’s imagination run wild with this perfect 5pc adventure play tent set. They will occupy themselves for hours at a time jumping, crawling, & playing hide-and-seek while creating memories that they will cherish forever.\n\nWhat’s Inside the Package?\n\n‣ 1 x Triangular Play Tent + Dartboard Game: 38” Height – 43” Diagonal Base Width - $25 VALUE!\n‣ 1 x Square Play Tent: 31” Height – 38” Diagonal Base Width - $20 VALUE!\n‣ 2 x Tunnel: 44” Length – 19” Diameter - $30 VALUE!\n‣ 1 x Ball Pit w/ Hoop: 18” Base Height – 32” Hoop Height – 48” Width - $25 VALUE!\n‣ 1 x Lightweight, Compact Zipper Carrying Case – 20” Width - $10 VALUE!\n‣ 1 x $5 Mail In Rebate - $5 VALUE!\n‣ 1 x Instructions\n‣ 1 x 1 Year Warranty Extension Form\n\nTOTAL VALUE OF $115!\nYou will be making a wise financial choice by choosing our product.\nYou will rest at ease knowing your kids are playing in a safe environment that is tested to be free of LEAD, LATEX, PHTHALATES, & BPA.\nYou will give the kids an extremely fun toy that will keep them occupied for hours.\nYou can now listen to a few extra hours of joy & laughter everyday while giving yourself some time to relax. Lets face it, being a parent or babysitter is not easy!\n\nWe truly care about customer service & want to deliver a great overall experience. Buy from us now to enjoy a 100% Money Back Guarantee!",
    "rating": 4.4,
    "feature_bullets": [
      "★ SAFETY FIRST - URGENT & IMPORTANT ★ Playz is the *ONLY* play tent COMPANY to craft our baby toys with superior triple secured ends (clip, tape and heat gun sealed PVC tube) so the SPRINGS WON’T COME LOOSE and SEVERELY INJURE your child. *** Exceeds all USA CPSC toy safety and BABY CERTIFIED safety guidelines ***",
      "★ RATED #1 KIDS FAVORITE TOY! ★ PARENTS LOVE how this premium maze of unique tents and tunnels keeps kids soaking up the fresh air (and off devices) as an OUTDOOR playground obstacle course or happily playing INSIDE as they slam dunk balls into multiple basketball hoops, then catch them from the BALL RETURN. (Holds 200 to 1000 ball pit balls, not included). SEE- THRU WINDOWS make it easy to relax and watch while baby plays.",
      "★ BOREDOM PROOF ★ SO MANY WAYS TO PLAY & COMBINE: Piles of forgotten indoor toys cluttering up your home? You’ll love how long this indoor outdoor toys set entertains. Teepee tent with 5 mesh net holes and a velcro dartboard game keeps kids busy imagining and inventing games for years. 4-way access connectable cube tent allows imaginative combinations that keep busy hands boredom free for hours.",
      "★ GREAT FOR TRAVELING with BABIES, TODDLERS & KIDS ★ Zipper closable ball pit DOUBLES AS a PACK AND PLAY for use at parties, picnics, BBQs, parks, playgrounds, day care, school, carnivals, sleepovers or while you work and pay. INNOVATIVE EASY-TRAVEL DESIGN POPS Open, CLOSES FLAT, then ZIPS into its convenient travel carrier so it’s easy to take along anywhere.",
      "★ SUPERIOR CONSTRUCTION – UNRIVALED GUARANTEE ★ TRY THIS RISK FREE for 30 days. We guarantee your 1, 2, 3, 4, 5, 6, 7, or 8 year old girls and boys, along with your cats and dogs, will absolutely love it or your money back. 6 month replacement warranty (1 year with registration)."
    ],
    "specifications": {
      "Package Dimensions": "19.5 x 19 x 2 inches",
      "Item Weight": "3 pounds",
      "ASIN": "B073PTVDCQ",
      "Manufacturer recommended age": "3 months and up",
      "Best Sellers Rank": "#3,687 in Toys & Games",
      "Customer Reviews": "4.4 out of 5 stars1,685 ratings4.4 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "3 months and up",
      "Manufacturer": "Playz"
    },
    "categories": [
      "Toys & Games",
      "Play Tents & Tunnels",
      "Sports & Outdoor Play"
    ],
    "price": 59.95
  }
}