{
  "website_summaries": [
    {
      "verdict": "Small, powerful, and budget-priced, the Lasko delivers the most value for the least amount of money.",
      "pros": [
        "Adjustable thermostat",
        "Four power settings",
        "Cool-touch housing and other valuable safety features"
      ],
      "cons": [
        "No tip-over shutoff switch"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "IT CAUGHT ON FIRE",
      "text": "I woke up in the middle of the night to the smell of smoke and looked over and the heater had caught on fire. I quickly disconnected it but the fire had caused damage to the heater. If I hadn’t woken up i don’t know what could’ve happedZ I DO NOT RECOMMEND THIS PRODUCT.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 70,
      "publication_date": 20180219
    },
    {
      "title": "Becomes a dud after a few uses.",
      "text": "I loved this heater when my office was freezing due to excessive uncontrollable AC in the building. I used a handful of times, no more than 5-6 times this summer for no more than 20 minutes at a time. I even bought a second one for my new office space. Now that it’s chilly Fall, and I’m working in a new building, the Super doesn’t want to turn on heat early so I figured my little heater would come through once again. But nope, it smelled like burnt wires once I turned it on. As if it was overheated and fried. Waste of money and I’m cold, even more disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Janessa Mondestin",
      "helpful_votes": 18,
      "publication_date": 20190924
    },
    {
      "title": "No tip over switch!",
      "text": "No tip over switch and the \"convenient handle\" is too shallow to get a good grip on it when moving - I can barely get the fingertips into the slot. This compounded with the fact that the unit is heavy towards the front means that when you try to move it, it tends to slip off your fingertips. Not a good, especially if the unit is hot at the time! Most importantly, this unit DOES NOT HAVE A TIP OVER SWITCH! It is important to note that some states require space heaters with tip over function when used in the work place and public buildings. I will be returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Twain",
      "helpful_votes": 10,
      "publication_date": 20180930
    },
    {
      "title": "Hardest working heater in the galaxy",
      "text": "I love this little heater!! I work at a little desk in a warehouse (with no heat) in Wyoming so you know it gets cold! This little heater I've used on average 5 days a week for about 8-10 hrs every day. (Sometimes I've accidentally left it on overnight!) This little heater just won't quit and had served me well for the last six months. The consistent use hasn't fazed it one bit as it still works like a dream. Not too loud so it's easy for me to ignore. I definitely recommend!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Atropa Belladonna",
      "helpful_votes": 2,
      "publication_date": 20200217
    },
    {
      "title": "Great little space heater",
      "text": "This little space heater works great. I used it for a couple of months as the primary heat source for a 320 sqft studio. Even on days where the temperature would drop below zero this thing on medium would keep the heat above 68. it's nice because you can turn it on the low setting at night and it still keeps the room temperature at around 62.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathanielt",
      "helpful_votes": 4,
      "publication_date": 20190209
    },
    {
      "title": "Perfect heater for RV camping!",
      "text": "This was a replacement for the same model that served me for 6 years. I dropped it and messed up the fan. Anyway, I have used this in my camper. Just this week, I tried out this new one in Kerrville. One night the temperature went down to 23 degrees during the night. This little heater kept my 25 foot trailer at a constant 70 degrees. It could have gone warmer, but I kept it at about the third mark. I would recommend this to anyone who is looking for a good heat source, whether as the primary source, or to enhance what you have in place already.",
      "rating": 5.0,
      "verified": true,
      "author": "Knownasjim",
      "helpful_votes": 4,
      "publication_date": 20180124
    },
    {
      "title": "Heater functions well.",
      "text": "I bought this heater for my grow tent. I am located in a northern state and therefore have to begin growing my more sensitive garden plants, such as tomatoes and peppers, inside and then plant them in mid to late May in my garden plot. I start them in my basement which is a bit cool this time of year. My plants are responding quite favorably to the heat they are now receiving thanks to this heater. Starting my plants without the heat, which I have done in the past, leads to much slower seed sprout and plant development. I am happy with this heater.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Thermostat does NOT work.  NO SAFETY shut-off for tip overs!!",
      "text": "The “thermostat is non-existent!! The know is there, but it does not change the output of heat. It’s either off or on High. I turned it from high on thermostat to the 3rd dot up from off. No change in heat output. Also, the fan output from high to low stayed the same. Would be ok to heat a bathroom for a quick shower, but not for clinate control for any length of time. After reading reviews that said the safety feature did not work I intentionally knocked it over to confirm one way or the other. It DID NOT shut off when tipped over!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Wrestling mom",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Dynamite little heater!",
      "text": "I was using a very expensive brand, but the size was a bit to big, so replaced with this dynamite little Lasko Heater! Not only is it a bit smaller, it is more powerful ....if needed (very versatile) I love the way it shuts itself off once it has reached your desired temperature, and it will start itself back up if temperature drops...even just a little! Quiet...? So quiet, I think it must be off!. If you pick it up to move it, it shuts itself off, and then will come back on once it is stable! I am so impressed and thrilled at myself for reading great reviews , and making the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Birdy",
      "helpful_votes": 2,
      "publication_date": 20171212
    },
    {
      "title": "Perfect to keep under desk at work",
      "text": "I’ve had this heater now for about a month. I use it under my desk for work, and I am loving it so far! It hasn’t had any issues, and I love that you can adjust the thermostat to exactly where you want it to be. It turns off when the room has reached the temperature of your liking, and turns back on when it needs to heat the room back up. It has two settings for the fan, but I do wish it had one more lighter setting. The only other thing that I don’t like about it is that it does not trip if tipped over, so be careful.",
      "rating": 4.0,
      "verified": true,
      "author": "alli",
      "helpful_votes": 2,
      "publication_date": 20181029
    },
    {
      "title": "One of my best purchases ever",
      "text": "I’ve had this for five years now and I’ve never had an issue with it. It really came in handy of late as it has been unusually cold here in the sunshine state. This little buddy is small but POWERFUL I ran it for about 5 days last month, usually over night and noticed no changes to my power bill, so it is also energy efficient. Even in my living room, a considerable space, it ramps up the temperature within minutes. I highly recommend this if it gets cold in your area. However if them temperature habitually drops below 0 Celsius or 30 Fahrenheit, I’d recommend something bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "sntrada",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Compact but amazing",
      "text": "I bought this space heater to place under my work desk as the building I work in isn't the greatest insulated place ever. It definitely helps warm up an area fast and fairly silent which is great as I work with clients and the phone a lot. Took this home after I swapped to a different office and used it in our basement during a friendsgiving potluck, basement was absolutely freezing before this was turn on and within a few hours, I had to remove my sweater because it was so warm even after turning off the heater. Definitely worth your money, do not hesitate to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "MUST HAVE IN A COLD OFFICE",
      "text": "This item is a must have in a very cold office. The office that I work for is cold all of the time, I was getting sick every other week. One day I decided to purchase this space heater, it was the best decision I EVER MADE. It is well built, you can control the fan speed and heat with the knobs on the top. I keep it under my desk all day long and it keeps me warm. I was concerned when I read some reviews where people said it caught on fire, but I'm glad I went ahead and purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Small and powerful",
      "text": "I had a second thought initially when bought it is so small in size and wasn't sure will it cover my whole bedroom, fortunately, it is awesome at its works and it's still running smoothly for two winters without any issues so far. And I liked the safety feature it has to turn off automatically if it is not standing still or if you kicked it down while sleeping as it has a small switch underneath the device to control the heat flow.",
      "rating": 5.0,
      "verified": true,
      "author": "Suresh",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Works great!",
      "text": "We live in a 108 year old historic home which basically means that IF we have insulation, it’s newspaper. While we do have mild winters, the house can become quite cold. I use this item mainly in the master bathroom which was built over part of the porch many years ago- it can get quite chilly in there while I do not run this item full time as I can’t expect it to keep up with the cold and lack of insulation, it’s a perfect size for the space and keeps us warm when we get out of the shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan L",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Me no likey!",
      "text": "I don't particularly like this heater. I had the silver one for many, many years! At least 5 years. I keep it underneath my desk at work. And this \"newer\" heater is ridiculous! It's too hot! I know people may think that's good for a heater but something is wrong. It throws TOO much heat and I have the heat marker at less than half. It feels almost like it's going to burn my skin off. When this one goes. I shall not be replacing with another Lasko.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Edwards",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Good Heater, Not Quiet as Advertised",
      "text": "I returned this device. As a heater for small rooms this is a great device. The temperature switch works and it goes on and off as it needs to. However, it's not so good if want to carry on normal conversation. It is way too loud for a home office which was my use case. When I work from home my office is in the basement and I need the space heater. This was way too loud and distracting to have it run while I was on calls with co-workers or trying to listen to training. Additionally there is no tip-over failsafe switch to turn of the heater if it tips.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve M.",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Compact, quiet, efficient",
      "text": "Chose this product on account of reviews, and will concur that it is relatively quiet (no more than an a fan) and it efficiently warmed up the seating area of my small living room space (8ft h x 12 ft w x 17ft l, with couch being in the first 12ft l). It has a small footprint so whether on the floor or elevated on a book shelf, it will generate the warmth needed. I tend to prefer cooler, even on a foggy night, but plan to have it running in the background with company.",
      "rating": 5.0,
      "verified": true,
      "author": "teena",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "I didn't notice a drastic difference in temperature but I think it did a better job at circulating the heat more quickly",
      "text": "Very decent space heater. My bedroom is a converted sunroom, and the heating does not circulate well in our apartment. It's not a huge space, about 150 square feet. It does take a while for the whole room to heat up, so typically I just aim the heater towards me so that I'm getting the bulk of the heat. I've mostly used it on the low setting but on an especially cold day recently I used the high setting. I didn't notice a drastic difference in temperature but I think it did a better job at circulating the heat more quickly. Overall, it was certainly a worthwhile purchase and I no longer have to wear my winter clothes indoors!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Noisy and there's no way around it",
      "text": "The settings on this are 0, \"fan\", 1 and 2. The fan simply works as a fan, and then there's absolutely no difference between 1 and 2. It's noisy enough for you to wake up in the night when it turns back on. I wouldn't recommend it. I think there are other options out there. This is like having a hair dryer on...",
      "rating": 2.0,
      "verified": true,
      "author": "Nic & Juan",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Great product, just wish it had more safety features",
      "text": "Perfect for what I was looking for! Low cost, quiet, heats up the room nicely! I waited to write a review because I was worried it wouldn’t last long but it’s been holding up for about a year now with no issues! Just wish it had a timer setting or a safety setting (auto-off), so I wouldn’t have to worry about leaving the room with it remained on.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Despotovich",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Love it!",
      "text": "I live in a small apartment with a roommate (which of course causes temperature disputes). This space heater is perfect for me to plug in beside my room or in the living space. I often use in the bathroom in the morning when I am bathing or getting ready. It is powerful and can heat up an area quickly. I love the many setting options to get to your desired temperature. Totally recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie Whittington",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "I bought a spare because I like these so much.",
      "text": "I don't have to run my furnace and save so much money using these little heaters. I have never had to run the heaters at full blast, low setting (1) and heat dial at second dot really keeps my feet and legs warm plus takes off the chill in the whole room. I live in Northern California.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great Heater, saves money",
      "text": "This heater is a must for winter months. It usually makes a room nice and toasty. Are use daily for the bathroom before I take a shower to make it nice and warm. This cuts down on the heating bills because you don’t have to turn up the heat for the entire house. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "A year later, still hot",
      "text": "I bought this in Dec of 2017. I work exclusively from home, and my home office is in our basement where it gets pretty chilly in the winter. During that time, I've had this little heater running at max heat for eight hours a day, and it's still going strong over a year later. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus D.",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Loud fan noise and won't turn off",
      "text": "Maybe I received a defective heater. I bought this based on the good reviews but the fan started making a grating noise within a week of use. And you have to unplug it to turn it off as the plug gets hot.",
      "rating": 1.0,
      "verified": true,
      "author": "avidreader",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Best space heater I've ever had",
      "text": "This is so superior to any other space heater I've owned. I have two in some average sized bedrooms, and the temp regulation is amazing. I never have to mess with the heater, turn it off, unplug, etc. unlike so many other heaters I've had. I highly recommend this for any smaller space.",
      "rating": 5.0,
      "verified": true,
      "author": "Connor Maser",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Love this thing - Had to get my own after my parents' has chugged along for over 10 years",
      "text": "This is a great heater. Good heat output and simple controls. I use it in my bathroom every morning to heat the mirror / room while I shower to keep the mirror from fogging. I've had mine for about 5 months now, but my parents have been using theirs for well over 10 years for the same purpose and it's still running strong. Can't go wrong with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Gerik Bensing",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "quiet but doesn't turn off",
      "text": "I like this heater in my office because it works well in the winter. I do not like how there isn't a safety feature if it falls over and how it doesn't seem to turn off when it gets super hot. I never turn the dial past halfway but it never kicks off.",
      "rating": 3.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "This little heater does the trick!",
      "text": "Perfect for my office needs! The controls in our building dictate that my office be frigid in order for other areas of our office to be comfortable. This little guy takes the chill out of the air and thus tolerable working conditions. The safety features are an added perk and give me peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Home Place",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great for heat and white noise!",
      "text": "Great desk heater for under and on top of your desk. It gets very warm, and stays that way. Also, it does cut off on the heat setting once it reaches its ideal temperature, but, I’ve learned to turn on the fan setting so this can stay on all day at my desk. I use it for white noise to block out my coworkers chit chatting all day around me as well. 😃",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany G.",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Its alright",
      "text": "Super strong the first few weeks but its definitely not the kind pf product you want to keep for following seasons. the heat out put and strength of the fan inside go down sharply after a few weeks of use. also has no safety features im sure that's probably an issue as well",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "No safety switch if tipped over to shut off.",
      "text": "The high fan speed is not felt at about 3 to 4 feet away. I bought this one to replace my old ceramic space heater that I have had for years. I was hoping the Lasko brand would be a good deal for the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Keith Herring",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "Heats up a small room very fast",
      "text": "I really like this heater. It heats up a small room very fast. Plastic material. I have accidentally knocked it down a few times and no issues to the body of the product or the inside components.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Very, very warm!",
      "text": "This works great! My boyfriend has been constantly using it, and of course, his cat loves it too. It warms his whole room and it's going to be used almost all winter. His favorite feature is \"auto on\". There's really nothing about the product to not enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 2,
      "publication_date": 20180118
    },
    {
      "title": "Broken",
      "text": "Received the heater, and the first time we plugged it in it started smoking/steaming. We were not sure if that was normal or not. We turned it on again and waited for it to heat up, after 15 minutes of waiting, and nothing happening, we checked the back to see if we could open it and the fan in the back had completely broken off taking the screws with it, so we couldn't even get the back off. Maybe it was broken in transit, but the back looked melted, so it seems to be badly designed. We are returning it, would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180828
    },
    {
      "title": "Good heat",
      "text": "I’m very happy with this heater. I didn’t like the comments that mentioned it was dangerous and could cause a fire but I can now say after using at work in my truck it works great to jump into a comfortable truck cab. I was careful at the beginning and used the low settings and gradually upped the temperature settings till finally it has my confidence that the center council is not getting hot and isn’t a fire hazard. I’m sure this is not recommended by the manufacturer and fire safety standards for everyone else. I’m happy with the heater.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Device failed after 5 months",
      "text": "I used this device in the bathroom for those chilly mornings. Started cutting out / shutting down after about 4 months of use @ approximately 20 minutes a day. Finally, in the 5th month of use it would not come on at all...into the garbage it went.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Great for an office!",
      "text": "I bought this when I was working in an office because it felt like working in the Arctic. It wasn't allowed, and we frequently blew fuses because a few of us had them, but it was so nice to have something warm. Easy to use, compact, and didn't have that weird smell some heaters can have. I'll probably break it out in the winter again!",
      "rating": 5.0,
      "verified": true,
      "author": "Taryn Hefner",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great little space heater for the office",
      "text": "The seasons skipped straight through fall and into winter and it is FREEZING in my office. I ordered this little space heater in a state of frozen panic after perusing a few options and have been totally happy! My office is about 200 sq feet and I turn it on right when I get in. Even on a low or medium setting it warms the space up in about 10 minutes. I'm super pleased with my purchase and it seems to be plugging along nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "MarMar",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Good, but --",
      "text": "I really like this space heater, but it does NOT turn off when it falls over which I thought was a standard these days given the risk of fire hazards. Front vent gets hot too, and I find I have to often chase the cat away from sitting directly in front of it. Pretty good, though. Keeps my feet warm and I'm using less propane to heat my home.",
      "rating": 4.0,
      "verified": true,
      "author": "CassandraTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Good, not perfect, small heater for the price.",
      "text": "Heat output is fine. I use it exclusively in the low heat setting and it warms my small space quite efficiently. The thermos could be more finely tuned. Let’s the room get a bit too hot before it turns off, and cool before it comes on. Beware: there is no sensor to make it turn off if the thing tips over.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Butterfield",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "The Little Heater That Beats the Big Ones",
      "text": "Don't let the size fool you . The amount of heat that this small machine produces instantly is amazing. It produces so much heat I often have to turn it off . It proves that much bigger heaters don't have to be so large .Amazing !",
      "rating": 5.0,
      "verified": true,
      "author": "VB",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Lasko Model CD09250",
      "text": "My room ($900/month, San Mateo, CA) measures approximately 10X10, and this unit is more than enough. My room is nice & toasty. Additionally, I am using the lower power wattage setting, which is set @ 1. 2 represents 1500 watts. Unit is fairly quiet. On the side of the unit are instructions on how to reset the device if it shuts down. I'm very satisfied with the performance from this Lasko heater.",
      "rating": 5.0,
      "verified": true,
      "author": "Zoticus",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Heat output",
      "text": "Had to stay in a 22\" travel trailer in Nome, Am all summer. Temp was from 38 to 55 degrees all summer. Kept us toasty warm. Thermostat worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S Fay",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Great little heater",
      "text": "Used the item this weekend, seems to be a nice little heater. We used the heater in our RV, our normal trailer heater is so loud that you have to turn up the tv to overcome the noise. This unit make little noise and cranks out the heat. The only concern is theres no auto shutoff if you knock it over, so place the heater in a area that it wont be disturbed while sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Doesn’t last very long",
      "text": "Got this heater at the end of October. It was very good up until January. The past few weeks it has not been working efficiently and has not been warming up my room at all. I was satisfied in the beginning but have become disappointed to see that it was only good for 2 months...",
      "rating": 2.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Immediately Started Smoking",
      "text": "The first thing this heater did was just start slowly giving off smoke. The products fan was not turning and everything just seemed to be very unsafe.",
      "rating": 1.0,
      "verified": true,
      "author": "Collin R.",
      "helpful_votes": 2,
      "publication_date": 20190820
    },
    {
      "title": "GREAT!",
      "text": "I work in a freezing office and this helps the my side of the office to stay at regular temperature. Also, not loud at all and has excellent temperature control",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Rguez",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Heats only on High.",
      "text": "Although you can adjust the amount of heat...the fan only runs on high...even though it has a high/low option.",
      "rating": 3.0,
      "verified": true,
      "author": "Rik",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good little heater BUT no safety shut off",
      "text": "I've had other space heaters from Lasko but this is the first that doesn't have a tip-over safety shut off. Works well but must always be sure to unplug it when not in use.",
      "rating": 3.0,
      "verified": true,
      "author": "P. English",
      "helpful_votes": 2,
      "publication_date": 20181012
    },
    {
      "title": "it makes Heat -perfect for my bathroom in the winter",
      "text": "the store never has the products i want and need. Amazon. does. it arrives at the door in about 2 days. the products are less expensive than at the store. i stock up. Great product.Fast shipping. Great value. Great Deal !",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Hardy",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Perfect product for my purpose",
      "text": "A lot of reviews say it quit working or didn't work but so far so good for us . Been using it for about 2 months , heats the bathrooms perfectly when it is really cold.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mills",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Great for the price",
      "text": "Multiple heat settings, good price, and good air movement. Seems VERY hot on all settings and next to no safety features. Great buy though all in all, there's a reason it's so popular. Edit: I use this in my laundry room to keep pipes from freezing on really cold weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "WASTELAND RAVENTop Contributor: Board Games",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Good little heater",
      "text": "This little heater was smaller than I expected it to be, but puts out good heat. My office at work (~10x20) is freezing. I put this under my desk and I'm warm as toast. Lots of setting to reduce heat if I get too warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Di",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great, small heater",
      "text": "I got this heater and it's great! It's small but powerful. It's super quiet and doesn't take up a lot of room. The only thing I don't really understand is they say in the manual when you set the temperature it will turn on and off automatically. Though, I haven't been able to get this to work. Mine just stays on or off. The directions on this were not clear. I'll keep trying though!",
      "rating": 4.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Works perfectly!",
      "text": "Probably one of my favorite purchases on Amazon. This heater works great, I love the thermostat feature. I can leave this on while I'm out and come back to a perfectly cozy bedroom! Has really helped with the winter nights.",
      "rating": 5.0,
      "verified": true,
      "author": "christian j jimenez",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Throws a lot of heat!!!",
      "text": "We bought this to heat up an unheated addition to our home, because our plants weren’t happy. This little heater has made a big improvement. We can’t believe the amount of heat it throws.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle C",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Surprisingly Good for a Small Device",
      "text": "As the headline states, this little device is surprisingly strong! I get more heat output from this than I do a device 2x as large that I use to use! Its small, very 'strong?', and overall a great heater. I will buy more for other rooms soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Seth Rydberg",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "and the delta in temp between floors can get pretty drastic. Also",
      "text": "We got this because we live in a split level, and the delta in temp between floors can get pretty drastic. Also, we had some frozen pipes that we needed to thaw out, so this was preferable to grabbing my wife's hair dryer every time I needed it. Pumps out some decent heat for such a small unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "It won't stop running when it's upside down.",
      "text": "Until yesterday, I would have given this space heater a 4 or 5 star review. Yesterday evening, the cats were running around being rambunctious, and knocked it over while it was running. Despite being upside down, it did not stop running. It doesn't feel nearly as safe as it did two days ago.",
      "rating": 2.0,
      "verified": true,
      "author": "Nunna U Bizniz",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Fast heat. Works well.",
      "text": "Heating a 20' camper works great. Small, seems reliable. 750w low maintains 65 degrees after 5 minutes of 1500w high.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Works",
      "text": "Nice compact unit. The red light can lead you to believe it’s still on. Quiet and warm as toast. Please don’t plug this thing into a power strip.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlyse M. Evans",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Perfect size",
      "text": "I work in a medical facility and it’s so terribly cold. I wear 3 sweaters and t doesn’t help so I read the reviews and decided on this heater for me dean. Takes up little space and works great!!!! Very warm I only keep the temperature on halfway and it’s perfect. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Irina ",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Perfect!!",
      "text": "These things are awesome!! We use them on our sunporch in the winter to help keep our indoor garden warm. They work very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaye Biggs",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Loving it!!!!",
      "text": "I love my new heater, it has several temperature settings. I use it under my desk at work and it keeps me warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Collins",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Small and powerful",
      "text": "I use this little fella to heat my room, it works great. Not meant for larger spaces, but it is so powerful that I use it on the living room too.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Guevara",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Left it on overnight and nothing happened.!",
      "text": "I have been using this heater in my office for almost 3 months now. I was afraid about Forgetting to turn it off in some evening and get into trouble. I tried not to but I did forgot to turn off one evening and that was Friday. Lol I work in a research lab and went to lab on Sunday afternoon to take some printouts. Nothing happened.!! The quality is prefect and it keep turning off once it reaches beyond the adjusted temperature.!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharaj P.",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Very quiet.  Very happy!",
      "text": "This is the quietest heater I own - and it is perfect for my RV, where floor space is important.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveO",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great little heater",
      "text": "Great little header, kicks out a lot of heat. Just be mindful that the fan and heating unit are dust magnets. Use some compressed air through the front and back grills to clear it out.",
      "rating": 5.0,
      "verified": true,
      "author": "SirGlenn",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "So much better than the last one I purchased on Amazon.",
      "text": "Much better at warming my \"man cave\" then the last one. Faster warm up and much quieter. Definitely a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopping Guru",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Perfect, powerful, durable",
      "text": "Love these heaters! I rebuy the same heater over and over again. I use mines daily because I keep my house cold but I like my feet and legs to stay warm. This heater lasts a couple years before the knobs just stop turning. I also have kids that knock it over and accidently kick it, but it still works so it can take a beating! 5starz",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Harvey",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Good, with one UX flaw.",
      "text": "This is a good heater. It has one flaw: The red light tells you only that the heater is plugged in, not that it is turned on. I prefer to leave the heater plugged in and switch it off when not in use. The light doesn’t tell me if I forgot to switch it off.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Leonhard",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Awesome desk heater",
      "text": "Perfect little desk heater! Love this product- have had it for over a year with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Klug",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Obsessed with these little Heat Source!",
      "text": "Got this for our second bedroom in a basement apartment that always get sooooooooo cold. I bought it for my husband who has to wear a jacket in that room and slippers. I bought him this heater and he LOVES it. Uses it to warm up the room and his feet. I use it to warm up my feet as well when I am getting cold and it gets warm super fast. LOVE THIS product and is super easy to store and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis DeLange",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "great value for money and space saver",
      "text": "After years on having my 1st one, it broke. tried a differant brand and it didnt work out so returned it and went back to my roots :) great affordable heater !",
      "rating": 5.0,
      "verified": true,
      "author": "evangeline guerrero",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Great product!!!",
      "text": "I usually don’t write any reviews but this item deserves one!!! This is a great buy!! We have use it all winter!! It is small but it heats up my entire room. We usually leave it on at night and off during the day. I have been waiting for it to break down, because it is only meant for small spaces. My room is 28 feet long x 18 feet wide with high ceilings. The heater still works perfectly fine and we are warm and toasty. Absolutely awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos G. Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "weak fan",
      "text": "the heat output is great, the problem is the fan output. The fan doesn't blow very hard.",
      "rating": 4.0,
      "verified": true,
      "author": "moto-x",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Died too young.",
      "text": "We've had good luck with smaller Lasko heaters at work, so I gave this one a try. It was a very nice heater - until the fan failed after 45 days. Update: Was able to get the fan to work again just by prodding it with a screwdriver. A month later, still going strong, so I've upgraded the rating from 2 stars to 4.",
      "rating": 4.0,
      "verified": true,
      "author": "rghcfi",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "My wife wanted this to warm up the room in ...",
      "text": "My wife wanted this to warm up the room in our basement apartment; I am surprised at how quickly this things starts working! after only a few minutes you can feel this thing doing it's job well. It's fairly quiet (at least it seems so to me), and gets the job done without killing the power bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Lemonslices",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Compact Lil Dude",
      "text": "Turns off automatically. Great for small rooms! Not so great in open spaces but it is a small heater so that’s expected. Great heat output on the first setting. I havent needed to try the second yet. And the fan works well!",
      "rating": 5.0,
      "verified": true,
      "author": "Imani Murph",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Compact and durable. Works great.",
      "text": "This is a great little heater. I bought it for my tool box at work. It doesn't use too much power and puts out a good amount of heat. I use it to heat up my soup and keep my hands warm on cold days. It's compact and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "NYC fitter",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "I no longer have to wear a winter jacket in my office!",
      "text": "This little guy heats up my entire 10' x 10' office in minutes. I very much prefer having this heater instead of having to wear a jacket at my desk to stay warm. Being able to adjust the temperature is a great feature so it only kicks on when the temp drops below a certain degree.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Parke",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "nice little heater for small space",
      "text": "Bought this for under our RV to help with water lines, RV was skirted and 2\" foam enclosure just around the water tank but heater was too small for that. It would work fine in the RV bathroom which is very small.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Farley",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Excellent heating in a small package",
      "text": "This thing puts out the heat! I was not expecting it to be so powerful. I use it to heat my home office which is quite cold in the morning. It is a small space. I have it plugged into a power strip with a few other things. I haven't seen any of the issues some others had with frying the outlet. I haven't had to turn the fan speed or temperature up to the max though. I have it sitting on a table top. I'm not sure if I'd feel comfortable setting it right on the high pile carpet in the room, but that's probably just me being paranoid.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Goodwin",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "it works!",
      "text": "this product does the job. it warms up my average sized room in 10 minutes. Its also pretty quiet, and I like that it is ceramic and not plastic.. has less of a weird smell",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Small but Mighty",
      "text": "I love this little heater. It puts out a lot of heat for such a small unit. It takes up very little room and is never in the way. Now that the weather is turning cold, it is great when my legs and feet feel cold and I need to just be able to take the chill off for a while. This is a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Barb",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great heater for cottages",
      "text": "Use to warm the cottage in northern Ontario on cold spring and fall days. Perfect for that!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann King",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Great heat out put",
      "text": "Front gets really hot to the touch but warms the room. Just keep out of kids reaxh",
      "rating": 4.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Im not trying to get preggers I'm just competitive.",
      "text": "I put this under my desk at work. Does wonders for my sperm count.",
      "rating": 5.0,
      "verified": true,
      "author": "Wizard But",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "posted dimensions are wrong",
      "text": "the heater works as advertised. The controls are on the top which is good if you have the heater on the floor. It is quiet. the actual depth is 5.2, not 3.7. And the actual width is 7.2, not 5.7. The height is correct at 9 inches",
      "rating": 4.0,
      "verified": true,
      "author": "Philip G.",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great little heater",
      "text": "I’ve had this heater for a year. It may be small but it is mighty. Today the winds are howling but I am warm and toasty inside at my desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Given as a gift, he loved it!",
      "text": "This thing heats up super fast and gets very hot, so be careful to not leave it on with being attended to. It also had a weird smell at first, which went away with time",
      "rating": 5.0,
      "verified": true,
      "author": "Lday13",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Compact and Very Effective",
      "text": "This thing was a life saver while traveling in a camper in the winter. Kept me warm at night without fail! One minor issue but not enough to push to 4 stars is the fact that the heat setting #1 only kicks in when you have the heat set higher. It won't work on a lower setting, for some reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "works great",
      "text": "I get cold during the day and this is great to have at home in the wake of COVID telework",
      "rating": 5.0,
      "verified": true,
      "author": "Sharayah",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "It rattles",
      "text": "It heats just fine, but something rattles when it is running. I’m concerned that eventually whatever it is will rattle loose and will stop working. This was the second heater I purchased. Was tired of returning things, so I kept it. We will see.",
      "rating": 3.0,
      "verified": true,
      "author": "Holly B.",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Nice but way too loud for the office.",
      "text": "Very nice for my office except it is extremely loud.",
      "rating": 3.0,
      "verified": true,
      "author": "sparkygal",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "too loud",
      "text": "The heater puts out a good amount of heat, but it much too loud for me. It doesn't matter what fan setting you use, the sound level is the same.",
      "rating": 2.0,
      "verified": true,
      "author": "babyboomerkid",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Partially still working",
      "text": "I’ve had it for about 6 months. The fan part stopped working already. I use it for white noise unless I need the heat. The heater part still works.",
      "rating": 4.0,
      "verified": true,
      "author": "reading",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Does not last",
      "text": "I bought this a few months ago and it’s now making funny noises and smells like it’s about to burst into flames. The last space heater I had lasted more than 2 years before dying and never had these noise or scent issues. Do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "ajlastl",
      "helpful_votes": 0,
      "publication_date": 20171219
    }
  ],
  "product_meta": {
    "title": "Lasko Ceramic Adjustable Thermostat Tabletop or Under-Desk Heater, Black CD09250",
    "description": "This compact space heater from Lasko brings 1500 watts of comforting warmth to your room. A classic design in silver with easy to use manual controls and built-in safety features, plus adjustable thermostat for personalized comfort.\n\nadditional features include: \n\n * 3 quiet settings\n * 1500 watts of comforting warmth\n * ceramic heat adds quick warmth with fan-powered delivery\n * Built-in carry handle",
    "rating": 4.5,
    "feature_bullets": [
      "3 quiet settings - including high heat, low heat, and fan only make this electric space heater ideal for warming up an area in your home or home office. Combined with an adjustable thermostat This personal space heater is great from small areas.",
      "Adjustable thermostat - allows you to adjust the heater's 1500 watt ceramic heating element. With 11 different temperature settings you're sure to find a comfortable setting. Simply turn the dial to the heat setting you desire and enjoy comforting heat.",
      "Convenient carry handle - makes it easy to move the space heater. Thanks to the heater's compact Size and convenient carry handle you can easily move the heater from the kitchen, to the bedroom, or under the desk.",
      "Built-in safety features - overheat protection ensures the space heater does not overheat even if left on for an extended amount of time. The space heater also features a cool-touch exterior. This allows the the space heater's body to stay cool even when it's on high.",
      "Fully assembled - allows you to take the heater out of the box and have it working it minutes. Simply plug the heater into a wall outlet, select your desired heat and thermostat settings, and enjoy the warmth from your new Lasko space heater."
    ],
    "specifications": {
      "Product Dimensions": "5.7 x 3.7 x 9 inches",
      "Item Weight": "3.5 pounds",
      "Manufacturer": "Lasko",
      "ASIN": "B0735MVY4Y",
      "Item model number": "CD09250",
      "Customer Reviews": "4.5 out of 5 stars1,448 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#57,958 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Heating Method": "Ceramic, Fan_&_forced_air",
      "Is Assembly Required?": "No",
      "Warranty Description": "3 year limited.",
      "Batteries Required": "No",
      "Included Components": "Heater^user manual"
    },
    "categories": [
      "Home & Kitchen",
      "Heating, Cooling & Air Quality",
      "Space Heaters"
    ],
    "price": 31.2
  }
}