{
  "website_summaries": [
    {
      "verdict": "An ergonomic design that makes your Switch feel like a traditional handheld console.",
      "pros": [
        "The organic design of this thin TPU case makes it quite comfortable to hold",
        "This case doesn't add much bulk while still offering decent protection",
        "Includes access to all ports, including the kick stand",
        "Comes in 4 colors"
      ],
      "cons": [
        "The case is a bit thick around the shoulder buttons, making them difficult to press"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The perfect way to make hand-held gaming on the switch a comfortable experience.",
      "pros": [
        "The stunning matte finish makes this molded plastic case even easier to grip",
        "Multiple colors are available",
        "Cutouts in the case make it compatible with the switch stand",
        "You can now play for longer without your hands cramping up",
        "The material is thin but sturdy, keeping the switch slim, but protected",
        "The case snaps on tightly, but is simple to remove"
      ],
      "cons": [
        "Case has to be removed to fit switch back on the dock"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Originally disappointed. Incredibly pleased.",
      "text": "When I first received this I was slightly disappointed. It seemed very flimsy. However, once placed on the device it feels amazing. I only ever use my switch in handheld mode. This makes it feel like a true handheld console and takes away the flimsy feeling the joycons had. I hope that someday they come out with more colors for it. Keep in mind, this won't fit in the dock with the case on. However, it's easy to remove the case. Again, I can't stress enough that this is primarily for people like myself who only use the switch in portable mode.",
      "rating": 5.0,
      "verified": true,
      "author": "AndyRay",
      "helpful_votes": 31,
      "publication_date": 20171223
    },
    {
      "title": "Tried a few switch cases, this is the best.",
      "text": "I tried several cases for the switch trying to find one that was comfortable and more like holding controller grips while in portable mode. This one is the best of the bunch. If you find the switch uncomfortable in portable and are looking for something with more to hold onto, get this guy. The quality is also higher than the others I tried. The mold feels nicer, and the grips actually have a nice texture on them that makes them feel more like controller grips. For the price, can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Lockjaw",
      "helpful_votes": 48,
      "publication_date": 20171221
    },
    {
      "title": "YES THIS!",
      "text": "This thing's awesome. I have 3 little kids who like to take the Nintendo Switch all around the house, we've had a few drops and this thing keeps it from any real damage. I recommend purchasing a Glass screen protector to provide further protection. It adds some weight and bulk but feels comfortable to hold. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Married With Children",
      "helpful_votes": 44,
      "publication_date": 20190410
    },
    {
      "title": "Excellent grip",
      "text": "This product is the perfect accessory to start your gaming. The grip is thick enough for people who have small to medium hands to hold the game with ease. No slippage and no hand pain results from the use of this product. Keeps the controls steady in comparison to simply having them loose. Has the rest of the wholes uncovered for easier access to the memory card as well as the NFC/internet. I haven't attempted to remove it yet,but so far so good. Edit: I just noticed that it has air vents so that the console doesn't overheat while playing with this on hand held mode.",
      "rating": 5.0,
      "verified": true,
      "author": "Tachinator",
      "helpful_votes": 37,
      "publication_date": 20190328
    },
    {
      "title": "Great case that allows for a sturdy and secure grip without feeling bulky",
      "text": "Feels very smooth and sturdy, doesn't give you that feeling like it'll slip out of your hand if you don't kung-fu deathgrip it the entire time you play on your Switch. Will allow your Switch to fit inside of an ORZLY carrying case which is a plus for me since my daughter always wants to take this on the go. The added humps at the bottoms of the joy-con areas give the Switch a much more comfortable feel also when playing handheld mode. Highly recommended, I can't play without this case on now, Switch by itself feels too flimsy and light, but this case makes it JUST right.",
      "rating": 5.0,
      "verified": true,
      "author": "Emanuel",
      "helpful_votes": 35,
      "publication_date": 20190916
    },
    {
      "title": "Hand cramps, meant for small hands. I recommend another case for larger hands. Read review.",
      "text": "This is better than a naked switch, but honestly my hands started cramping after 30 mins of use. I don't have large hand at all but these are really small. I actually had to return this one and get the Orzly Comfort Grip Case for Nintendo Switch. The Orzly Comfort Grip Case for Nintendo Switch is definitely better for medium to large size hands. I don't feel cramping in my ring and pinky fingers anymore after using the Orzly case.",
      "rating": 3.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 3,
      "publication_date": 20180701
    },
    {
      "title": "Great solid design for handheld play",
      "text": "Pros: - Nice ergonomic grips. Not too small, not too big. Still fits in my carrying case. - Simple, solid quality design. - Nice matte black design. - All ports easily accessible. - Easy to put on and take off. Cons: - More expensive than it should be, for as simple as the design is. Other: - It would actually fit in the dock if the grips were not wide, but I prefer the wide grips for handheld mode. The case is easy to remove to put the Switch in the dock. - The material isn't very 'grippy' like rubber, but it's not a problem. Overall score: 4/5, above average.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Blocks L and R buttons",
      "text": "I wanted to like this case but I can only use it for a couple of games. Unfortunately the case’s lip blocks the L and R buttons and makes it difficult to push these buttons with ease, as if you arent paying attention all you’re doing is pushing down on the case lip and not the button itself. So this is fine when playing games that don’t have any time sensitive button inputs like RPGs (Octopath traveler for example), there is no way I can play Deadcells or Smash Ultimate with this case.",
      "rating": 2.0,
      "verified": true,
      "author": "Akirax187",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Best Switch Case so far",
      "text": "It's not as sturdy as it looks, and the type of material used to make the case is easily affected by outside forces. The case will get marks on it so easily, and it can bend more than it should because i think that it should be sturdy enough so that if my baby kid plays with it, he doesn't leave it all tangled up. For the price, it's decent, but i will say this...it is my most favorable case that i have gotten for the Switch.",
      "rating": 3.0,
      "verified": true,
      "author": "Bashier Abdin",
      "helpful_votes": 2,
      "publication_date": 20180601
    },
    {
      "title": "Worth every penny!",
      "text": "Recently bought our 5 year old a Nintendo switch and knew immediately we’d need a case for it. I’m very pleased with this case. It fits so snug but is easy to remove. Very comfortable in your hand. It helps with the grip when holding the device. You do have to remove it to dock it but it’s super easy. Worth every single penny!!!!! I also bought him a carrying case for it and it fits in it perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Mapp",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Five Stars",
      "text": "Excellent fittig and high quality feel. Yes, the grips are perfectly fit for my hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Wong Chun Wah",
      "helpful_votes": 56,
      "publication_date": 20171226
    },
    {
      "title": "It just doesn't do it's job",
      "text": "As a cover to protect against scratches this thing is fine. But as an ergonomic aid it's pretty terrible. The grips come in at just under 3 cm thick. This adds a little extra comfort to the device, but not nearly enough. I have pretty small hands, and I still get rather uncomfortable using this thing. If you want just a little added thickness then this case will work fine for you, if you actually want comfort while playing then look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Tedd",
      "helpful_votes": 2,
      "publication_date": 20180129
    },
    {
      "title": "Best Purchase Yet!",
      "text": "This is a great case, not big or bulky and makes the switch feel better as a whole. The extra grip on the back makes handheld mode a lot more comfortable. It has made my switch feel a lot less fragile and it I think it looks great. While it is a little snug it still fits in the official Nintendo Switch Game Traveler Case, which is great! Definitely one of my best purchases for the Switch yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Brinson",
      "helpful_votes": 35,
      "publication_date": 20171017
    },
    {
      "title": "perfect for my playstyle",
      "text": "This case is great--quality material, fits snug, guards my Switch well, and looks good. It even provides extra support to hold my unit by one of the side controllers, which is awesome--I love holding it that way. I read a lot of reviews, and while I see what people are talking about w/r/t things like the case being close to the RT/LT shoulders I don't have any issue w/it. I've got plenty of clearance. And I'd rather just use a separate guard/case for when I've got it docked (I use it in handheld mode most of time, I admit), because I really like this one for handheld mode...I feel like it needs to be this thick for protection.",
      "rating": 5.0,
      "verified": true,
      "author": "mr3",
      "helpful_votes": 35,
      "publication_date": 20180610
    },
    {
      "title": "Good, not great",
      "text": "Here're my thoughts: Pros: Perfect snug fit, \"snaps\" in place easily, and makes the switch feel more like one solid piece as opposed to three pieces interconnected (I really like that). Cons: It is NOT rugged at all. It may feel rubber, but if you drop it, the switch gets the full impact. Also, because of the back-plate coverage, the heat dissipation doesn't seem to be as good as usual.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Nice protection! With mods.",
      "text": "This product is nice because it adds much needed stability to our Nintendo Switch. Also the comfort grip makes game time less stressful on the hands. I do wish they would update the design to remove the plastic near the L-button and R-button. Some games require the heavy use of these buttons and the plastic gets in the way. (like Fortnite) I've cut off these pieces with an exact night and then used a match to melt/smooth the sharp edges.",
      "rating": 4.0,
      "verified": true,
      "author": "Star Mom 212",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Would not recommend.",
      "text": "If you plan on taking the joycons on and off I dont recommend this at all. It goes on easy but taking it off is really hard. And I almost have to bend the joycons back to pull the case off. If you dont have some type of insurance on your console I dont recommend this case. Also green color was not vibrant. More faded. The case is harder than it is soft.",
      "rating": 1.0,
      "verified": true,
      "author": "Dv",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "Hold onto the switch better!",
      "text": "Product is as advertised. It is very easy to fit the cover over the switch, all the holes are in the correct spots & it definitely adds better grip and feel to the overall hand held unit. It helps keep the sides more stable too. It's very pink, like Pepto or bubble gum. Totally worth it. It fits in the carrying case no problem with the cover on it too.",
      "rating": 5.0,
      "verified": true,
      "author": "KD Hews",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "If you play your switch in hand held... Get this.",
      "text": "Honestly.. if you play your switch in hand held mode more than docked... Get this grip. Material feels good in hands, provides protection, and it curves into the palms perfectly. I have carpal tunnel and could only play for 30 minutes before cramping without this grip case... With it I can make it 3 hours. I honestly think it's one of the most useful assesories I have ever bought.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Dougherty",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Blocks WiFi and Buttons",
      "text": "It is practically impossible to connect to WiFi and or a personal hotspot with this case, presumably because the material is too thick. Furthermore, the design is pretty flawed as it covers up way too much of the top buttons, making using them very difficult. I suppose the case is good if you’re not playing online, and or don’t need to use the top buttons, but if you need to do either of those things I would suggest looking elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Seal",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Improves handling but difficult to remove",
      "text": "The case improves the sturdiness of switch in hand held mode. The joint between the joycon and the screen has lesser stress reducing the risk of loosening. It also makes the switch easy to hold. Case cannot fit the switch dock so i have to remove the case everytime I dock my switch. My only problem is that it is difficult to remove the case making me wonder if it will scratch my joycon in the long run. I have been using this product for a year, so far i am satisfied with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Walter T",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Not what I was expecting",
      "text": "Although this case feels fairly durable and it's extremely simple to attach, I purchased this based on other reviews that it had a grippy rubbery feel to it. Unfortunately in my opinion this is not the case. It's definitely a step above the somewhat slippery original Switch plastic but I was expecting a much grippier feel.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Chung",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Very comfortable!",
      "text": "I might be the only person on earth who preferred the controller shape of the Wii U's handheld over the switch! The thin body and non-ergonomic shape of the switch makes my hands cramp up from playing after a while. This attachment makes it feel more like it's meant to fit in your hand, very comfortable. Took off one star because it doesn't fit in the stand with the grip on, and I wish it did so I wasn't continually taking it on and off to charge it. But taking it off isn't difficult at least.",
      "rating": 4.0,
      "verified": true,
      "author": "Miss Ali",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Just right!",
      "text": "Love it! Switch fits just right and although it was a little odd (least for me) for about an hour getting used to using the bumpers and triggers, adapted quickly enough to where I don't know why I didn't have this right when I purchased my Switch. Great feel, flexible (just enough give), and though I find it a little funny there are small openings for you to release the joy-cons, they're wrapped by the case itself so guessing it was just easier to leave the mold like that when making the case. Whatever it may be, great great case!",
      "rating": 5.0,
      "verified": true,
      "author": "Auricom",
      "helpful_votes": 33,
      "publication_date": 20180615
    },
    {
      "title": "Would not recommend",
      "text": "I wanted to like this grip case, but it just didn't work well for me. It is difficult to take off without fear of putting too much strain on the triggers of the joy cons and the grip handles are just not full enough. Finally, the whole grip case moves and creaks while in use. It doesn't come across as quality in my eyes. I purchased the satisfye grip after this purchase and I absolutely love it. Check that out instead.",
      "rating": 2.0,
      "verified": true,
      "author": "TFO",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Decent Switch Case",
      "text": "This is just a decent case. I do like the handles and I think it provides protection for my switch, but there is one thing I really don't like about it. The edges near the L and R buttons are way too close and make it hard to press those buttons etc. It seriously is annoying. If those edges were probably a few millimeters farther away from those buttons so they were easier to press I would give this case 5 stars. Also, it may just annoy me so you might not even notice it. But I would recommend getting a different case. The Mumba case is really nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Danny D",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Bye bye hand cramps!",
      "text": "Fit like a glove over my Nintendo Switch and made it much easier to game for long periods of time without getting hand cramps! It's not bulky, but doesn't feel cheap, either. Very easy to remove the cover when you want to dock the system and play on a TV instead. It takes a bit to get used to feeling for the Left and Right buttons on the Joy Con's instead of pressing the lip of the case, but that just comes with getting used to the case. Would recommend to keep your Switch safe and allow for a more ergonomically correct experience!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "It’s Good",
      "text": "It’s really nice, we like it a lot. It’s made from a tough rubber and feels quality. Goes on and off fairly easy just be careful and take your time especially when taking it off. It does make the L and R buttons a little more difficult to push but it’s more just getting used to than it is a hinderance. The extra palm pad is nice and gives a lot more solid feel and better depth when gripping. All around it’s very durable and it looks really cool too.",
      "rating": 4.0,
      "verified": true,
      "author": "Haas",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Too small and overpriced",
      "text": "This case is really tight on the switch, so putting it on or taking it off puts your joycons' interlocking plastic at risk. The case is thin, so i wouldn't imagine this to protect my switch from anything but scratches and other negligible cosmetic thing like that. If i had very little standards and this was priced at less than/ equal to around 9$ i still wouldnt buy it",
      "rating": 1.0,
      "verified": true,
      "author": "rAnK",
      "helpful_votes": 3,
      "publication_date": 20190129
    },
    {
      "title": "Must Have Case!",
      "text": "LOVE THIS CASE! I have tried many others and nothing compares. If you have a joycon the doesn't lock and you can not fix it because the screws don't come out, this case is for you! It holds the joycons in unlike all of the other cases I've seen and had. The case is comfortable and sturdy without adding bulk. If you use your switch as a handheld all of the time you must purchase this case. Now only if they had it in Purple, Metalic and/or Glitter LOL 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "About what you pay for it",
      "text": "It's great, fits well and feels like it protects my switch. With two downsides. The edges are so stiff I worry I'm going to damage the connections to my joycons trying to get it off. And, you cant leave it on while the switch is on the dock, it won't connect. Since the dock charges faster than any cord, this is really inconvenient.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Doesn't fit the switch snugly",
      "text": "The case doesn't fit snugly around my switch. It lifts off the bottom of the switch right around where the usb c port is. Also, the top right and left corners interfere with the R and L buttons. Which is like case-building 101: don't block the buttons. I do like the material, though, and I appreciate the nubs. Since the case is flexible, I suspect that mine just got smashed during shipment somewhere. Will probably try to exchange.",
      "rating": 3.0,
      "verified": true,
      "author": "Ricky Rick",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "If you get cramped hands, this is the case you need.",
      "text": "I always hated how much my hands would cramp up while playing in portable mode so I looked up a few cases and bought this. I'm honestly surprised I haven't got one sooner. I would recommend this to anyone who has cramped hands or even just want some extra grip. The design is sleek and I can tell it feels durable. It doesn't fit into the dock while the case is on but it was never advertised to do so (just wanted to mention it in case you wanted to). You'd be crazy not to buy this if you're love gaming in handheld. Also shipped super fast.",
      "rating": 5.0,
      "verified": true,
      "author": "gpw",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Solid Case",
      "text": "I am really enjoying this case. The overall thickness makes holding the switch a more comfortable experience for me. I use it every time I undock the switch. Removing the case takes a little effort. The whole process could be a little easier, but at least you know the case won’t fall off on its own. My biggest gripe, like most, is the molding that runs around the shoulder bumpers. It’s a bit intrusive when you’re playing games that require you to constantly use the L and R shoulder buttons. I can definitely see myself buying newer models of this case.",
      "rating": 4.0,
      "verified": true,
      "author": "FL00D",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Great Case and Feel for On-The-Go Switch Players",
      "text": "Very good case to have if you want to protect your Switch on-the-go. I would not recommend this case if you plan to dock it frequently. The material is rather stiff and not very pliable to take off repeatedly. If you get the dongle style dock replacement, this may be the case for you. Definitely recommend this for anyone using it more frequently out of the dock.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Chow",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Does not fit",
      "text": "Was so excited to get this case for my new switch but was disappointed as it does not fit the switch very well. The plastic hits the top left and right buttons. I thought I saw somewhere on here that it would fit in the doc with the case on but I guess I was mistaken. There is no way for the switch to be docked with this case on.",
      "rating": 2.0,
      "verified": true,
      "author": "Pippy",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Go ahead and buy it!",
      "text": "This is an amazing case for the Switch, especially for the price. Fits nicely. Adds additional support across the entire Switch while holding it with one hand on one side, which gives you a little peace of mind about the joycon connections. Slips on and off easily for docking. Feels really good in your hands. Light. Still fits in travel cases easily. Would most definitely buy this again and would suggest you go ahead and purchase it now.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Perfect for handheld preferred players",
      "text": "This bad boy has gone through so many bus rides, long drives, and times over at a friends house. Here's the key things about it: - Case is easy to put on and take off - Feels great on the hands - No button is hard to reach - Fantastic quality I love this thing. It's saved so much strain on my hands compared to the past way, and still fits in my original case. It compliments the handheld player perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Shandon",
      "helpful_votes": 32,
      "publication_date": 20180720
    },
    {
      "title": "GREAT DESIGN BUT WATCH THE COLORS",
      "text": "The case is well designed and works as stated. The cutouts matched perfectly with the Switch and the girls in the back help to stop your hands from cramping if you are an adult. My only complaint and hence three stars was that the case is PINK and not plum. I mean vibrate link and no way close to plum or even red.",
      "rating": 3.0,
      "verified": true,
      "author": "Llamo",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great fit on Switch first gen",
      "text": "The case is smooth and provides a great grip. Not sure if it was redesigned but there is no need to cut or trim edges on Top buttons as other reviewers insisted. It WILL NOT fit in the dock, though most other cases do not, however, it is relatively easy to take off/put on. Going to see if they make one for the lite.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexx28",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Nice grip case for the switch",
      "text": "This case has worked out perfect. No it is not dockable but I barely play on the tv and use it mainly as a handheld. This case has made it much easier to play for longer sessions. The only thing I dislike is the casing around the L +R triggers it is bigger then the buttons and feels weird when going to hit them. I cut the casing around them and it is perfect now. Case still holds onto the case the exact same. I can only see it being an issues if dropped on the corner there since it’s missing now but I don’t plan on that happening.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh C",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "With this case my Switch is more comfortable to hold and feels more secure in my hands ...",
      "text": "With this case my Switch is more comfortable to hold and feels more secure in my hands with its ergonomic grip design. The surface has a slight grippy feel but not too much where it feels sticky. It does add a bit more weight but it’s very minor and what do you expect since you are attaching a case to the unit. I also managed to fit my Switch w/ case into my blue carrying case from Gamestop which was a nice surprise! What’s also cool is the case pops in and out pretty easily if you need to dock the Switch. Now I can play my Switch in handheld mode without worrying about carpal tunnel. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy Lo",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Great Price & Quality",
      "text": "Delivery took a week, packaging was proper, fitment on the switch was perfect, it removes easily and fits in the Deluxe traveling Nintendo case with out putting to much pressure on the switch. Plus the price is unbeatable this case is worth the investment especially for long portable play times it helps increase the comfort.",
      "rating": 4.0,
      "verified": true,
      "author": "Briz",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Like your weird cousins, this thing feels slightly off..",
      "text": "It's a hunk of plastic that holds your switch..there isn't much too it to review. Plastic is solid. Hand grooves on back feel about the right size. The only thing I have an issue with is the holes for the triggers doesnt quite fit. It almost feels like the case was made juuuuussstt a bit too small...not enough to hinder buttons...but enough that you notice. Good buy though.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen R. Miller",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Overall works really well",
      "text": "This arrived on time and as pictured. It has worked great for the first few months we have had it. The only complaint is it is a little hard to get on and off, which is annoying for charging and playing on the TV. It has provided protection when being dropped or banged around by are active child.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Try it, you’ll like it!!!",
      "text": "I love how my Switch feels in my hands now with my new case. Before I always felt like it was going to slip out of my hands. The contours give it a better grip. It fits great and gives you access to the ports and stand. The only down is that you must remove the case to dock the Switch. This is not a deal breaker for me, I mostly play handheld. Totally worth the money for me. The case comes in matte black...I added the decal.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine C.",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "It serves its purpose",
      "text": "Pros: The switch fits perfectly It’s easy to take the switch in and out It makes the console easier to hold for long periods of time Cons My case warped a bit in the shipping process. The thin piece of plastic along the top and bottom are wavy, so when I pop the switch in, I don’t get a crisp line across the top and bottom face of the switch. It cheapens the look of the console. When I’m engrossed in a game, I don’t notice too much. For the price it’s not worth exchanging. But not worth 5 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Good Solid Case",
      "text": "This case has held up well. I've had it for almost a year now and it is still in great condition. It is easy to remove when we want to use the dock, and easy to put back on when we want to use it handheld. With 3 kids, I insist they do it and my 7 & 9 year can easily take the case on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "good case",
      "text": "bought this mainly because one of my controllers on my switch no longer fully locks into place and frequently slides out during gameplay, which is annoying because it interrupts with the message to fix the controllers. The case does a good job at keeping it from sliding out and its pretty comfortable, not too bulky, and feels nice to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "saraha",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Great quality but can’t put in the cradle",
      "text": "I love this case except for one thing. It doesnt fit on the charger with it. It’s somewhat difficult to get off but you want that when your carrying it around. But when you have to take it off to put it in the cradle it becomes annoying and Im worried Im going to break the switch.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica follin",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Great product it fits the switch and its not a ...",
      "text": "Great product it fits the switch and its not a hassle to insert the switch into the case or take it out. It also has slots for the vents the kick stand the only complaint is that you can't dock it while its in the case but its not a big deal. I also recommend getting skullnco joy con thumb caps to add more flare to your switch.",
      "rating": 5.0,
      "verified": true,
      "author": "DAMON PARNELL",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Good jawn",
      "text": "If you have an active child who likes to take their switch with them then this may be a solid choice. The switch stays in the case for protection from falls during handheld play or storage. My son absolutely loves it. He has dropped the device once in the case but it is still 100% functional.",
      "rating": 5.0,
      "verified": true,
      "author": "lewis",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Doesn't fit well",
      "text": "This is a cheap rubber-like material and the one I got had damage markings on one side and did not fit the switch well at all. It is extremely loose and easily comes off the switch and the little strips of plastic on the top block the L and R buttons. This wouldn't be an issue if the case actually fit the switch properly but it's warped completely and absolutely useless. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Maneesh",
      "helpful_votes": 2,
      "publication_date": 20181011
    },
    {
      "title": "blue gets dirty pretty easily",
      "text": "overall I like this a lot. its very protective and I feel like if I dropped my switch it would still be in good shape. easy to hold and easy to carry around. the only thing is that the blue gets dirty pretty quickly and I tried using Clorox wipes and it still wouldn't come off. its not a big deal but now the color is not as vibrant and the stains are pretty dark.",
      "rating": 4.0,
      "verified": true,
      "author": "Sophia Hamada",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "good grip",
      "text": "It makes the Switch a lot more comfortable in handheld mode and reduces joy-con rattle with the way it wraps around the system and controllers. It's not hard to get on and off, but it's not instant either...takes a little finagling. Overall a pretty good grip, but keep in mind you'll have to remove it every time you want to dock (or get yourself a cheap usb-c male to usb-c female cable so you can connect the system to the dock without removing the cover).",
      "rating": 4.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "As decribed",
      "text": "It's a case, fits perfectly, bonus-it prevents my son from accidentally removing controllers during play. We have a screen protector on too so not sure if it would prevent glass from breaking. You have to take the case off to put in the box that let's you play on a tv so that kind of sucks as my son can't get the case off.",
      "rating": 4.0,
      "verified": true,
      "author": "Gene",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Good switch case.",
      "text": "Unfortunately you cant use the switch charging cradle to charge but it's easy to attach/detach the case from the switch good grip feeling around hands and it's a snugly fit. All ports are easily accessible also. I dont want to test the fall protection of it because I'd rather not test my luck. I'm sure if it falls flat on the screen it might mess up the joysticks or worse.",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Awesome Case for the Money!",
      "text": "I love this product! It’s perfect for those people who want a protective case on the go, but easy enough to slide on and off to put the Switch back in its dock for home play. I use my Switch connected to my HDTV 90% of the time and this case doesn’t disappoint. It’s not a super tight fit, but just snug enough to use with a tempered glass screen protector. Best $12 you can spend! And the company really does care, they followed up with me about half a dozen times. I also like the matte rubber they used, nice feel to it and fits good in your hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Marasco",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Exactly what I was looking for",
      "text": "I wanted something that helped the Switch feel more like home in my large hands. This definitely helped me. I like how easy it is to get the Switch in and out. I have not dropped it yet, but it appears to protect the switch very well. The case also allows access to all ports and functions of the Switch. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "jbfreels",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Doesn’t fit travel case",
      "text": "Bought this it’s really good quality and it’s easy to hold, the major issue I have is that it doesn’t fit most travel cases for the switch. I primarily bought the switch for my wife since we travel a lot and this is something fun to do when it rains but don’t like the fact that if I want to bring it it has to be packed separately other than that it’s nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexander J Endo",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Make it better for large size hands",
      "text": "I have rather big hands (slightly above average) and when I play the switch in handheld mode as is my hands start to hurt. This grip makes more comfortable to play for longer periods and all buttons work fine. If you find issues with the L or R buttons you cam just cut off the small plastic piece to get more clear access.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Mosquera",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Just what I was looking for.",
      "text": "Just what I was looking for! My 3.5 year old is the main user of our Switch and to say he can be rough is an understatement. I wanted a case with antishock protection since he will sometimes throw it down if he gets frustrated and one that keeps the joycons in place. This case does exactly that. It’s also slim and light weight. My only “complaint” is I have to take it off to charge it on the dock, but that’s not even a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannorah",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Do it.",
      "text": "I first bought a switch and I was like holy $#%& what did I do. So hard to play with large hands. This thing is a life saver. My only wish is the company would make a grip of the same quality with a battery pack built in. This thing is comfortable enough to drain your battery out without cramping your hands. Some people are saying you cant hit buttons. I see no issue. All standard features remain, you must only take this off to dock.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle P. Duffy",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Nearly perfect case",
      "text": "Almost perfect. It beefs up my switch for my big hands and projects it nicely from any accidental impacts. The only thing holding it back from a perfect 5 is that it doesn't fit in the dock. It's incredibly close though. Version 2 could easily be slimmed down just enough to fit in the dock without having to be removed.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick Terrell",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Not a cheap tpu case!",
      "text": "When I first purchased this case, I assumed it was just another flimsy TPU case but I like that it had ergonomic grips on the back so I decided to purchase anyways. However, when I received this case I was blown away by how sturdy this thing. It's definitely of high quality and makes your switch feel heavy duty while still being lightweight. I would 100% recommend this case to anyone looking to add some protection to their switch. I also want to add that I have 2 different carrying cases and my switch with this case fits in both of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Julion",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Thumbs Up",
      "text": "Nice case, easy to remove and re-apply. Case with screen protector (sold separately) is too thick to fit into standard switch dock station. That is the only reason why I remove this case. Very nice, mildly flexible material. This case prevents my hands from cramping up while playing switch in portable mode. This case does not block any holes/ function of the switch itself. Case does not interfere with pressing buttons. Exactly what i was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Ottomatic23",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Must-have ergonomic upgrade!",
      "text": "I don’t write many reviews, as other Amazon users are quite good at summation of their experiences with products, and my additions feel superfluous. However, I’ve found that this is an essential item for switch users that don’t have the hands of a small child. If you don’t have tiny baby hands, and do own a switch, this is a must purchase. Period.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Good product - not for my hands",
      "text": "The product feels very nice in my hands. It's been dropped a couple times in the case and the Switch has been fine. I have slightly bigger hands (I'm pretty skinny, but you could say I have piano playing fingers (I'm not a piano player)) so the grips on the back really aren't that helpful. If they either had adjustable grips or bigger grips, I'd be much happier. Reason for the -1 star is for adjustability. I'm happy with the quality of the product, not terribly happy with the size of it. But again that's not really their fault.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy Loeffler",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Good case, but will not fit in dock",
      "text": "Good case, but will not fit in dock. It makes the switch more comfortable to hold, but you need to remove it if you want to dock the switch. I am careful enough with things, that I'd much rather be able to quickly dock the switch than mess with putting this case on and taking it off repeatedly. Unfortunately I'll be returning it. But it is nice, and it fits well in cases designed for the switch.",
      "rating": 4.0,
      "verified": true,
      "author": "DownToEarth",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Sturdy!",
      "text": "Loved this for my switch!!!!! It was sturdy and felt like it would protect it from falls. Just got wish it came with a protective cover for the screen or something or a way to easily remove if I wanted to take out or switch out the controllers for new ones or if I wanted to play it on the TV",
      "rating": 4.0,
      "verified": true,
      "author": "Marie B.",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "No more hand cramps.",
      "text": "This has saved the Switch for me. I often play on planes and just at home in bed. Some days you need the handheld experience. The form factor of the Switch makes it hard to hold for long periods of time. This case really helps relieve the hand strain. I would recommend to people who play on the go more than not.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonah Willis",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Can’t dock, can barely use L and R buttons, damages joy cons",
      "text": "The case seems to work as in it’ll definitely prevent it from being scratched and causing damage if it didn’t have a case. Here’s the problem.... The case barely allows you to press the L and R buttons.. This is extremely annoying. It allows grips around the joy cons so tightly that it will definitely cause damage to them over time when you have to remove the case which brings me to my next point. You HAVE to remove the case in order to place the system on its dock. I will be returning these and looking elsewhere for a case.",
      "rating": 2.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Well Used For Over A Year And Still Holding Up Just Fine",
      "text": "I usually like to review a product only after it has withstood the test of time. I'd give this 6 stars if I could. Bought it for the hubby in November 2017. It makes the switch feel sturdier. It pops off easily and is easy to clean. Although we do keep the switch in a carry case as well for extra protection when not in use. Will definitely repurchase once I get my own switch as well as a replacement for him too!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Aron",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "I expcted this case to be much more sturdy that it was",
      "text": "I expcted this case to be much more sturdy that it was. It does protect the game but it has to be removed prior to docking the system which makes it a little inconvienent. Overall it does serve it purpose. The Switch is still intact and that is saying a lot when I have a 6 year old child.",
      "rating": 3.0,
      "verified": true,
      "author": "Ebsworld_2000",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Get this if your hands cramp up fast.",
      "text": "My god this thing is amazing, I always had my hands cramp up when holding the switch without something to position my hands comfortably, but this does so much justice I can play for hours in and not get cramped up when I’m playing in bed. Get this you won’t regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Agx12",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Great for those with large hands.",
      "text": "I like my Switch, but lets be honest here the ergonomics are terrible, especially for those with larger than average hands. This thing does a lot to solve that. Without it I could only play for about 30 minutes before my right hand would start cramping. With it I managed to play for an entire 3 hour plane ride plus about a half hour before getting on. It also just barley fits in the case that came with my Mario Odyssey bundle so nice plus. Also does a good job protecting the back of the Switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Collin",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "It was just ok. It was replaced",
      "text": "As far as protection goes it will probably do its job ok compared to other products on the market but for handheld gaming it just doesnt do much. The slight grip knobs dont really do anything and is just about the same as if it were off. If you're looking for protection id prob rate it a 3-4 but for hand held gaming its a solid 1-2.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Brewer",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Good, but could be better!",
      "text": "It’s very good for holding in hands. Provided better grip and feel. I didn’t like that it could not dock Switch with it on and also the case made it hard to press the L and R buttons. I had to cut the little plastic the passed threw those buttons.",
      "rating": 3.0,
      "verified": true,
      "author": "Mario Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "So so",
      "text": "Fits the switch great, shock absorbant. Just don’t like how it’s a bit too loose and comes off easy, it doesn’t fit in the dock to be charged. My kids just take it off anyway and never put it back on because it doesn’t fit the dock to charge",
      "rating": 3.0,
      "verified": true,
      "author": "SNikki",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Material feels good too. Really the only issue I have is ...",
      "text": "Massive comfort improvement over using the switch naked. Material feels good too. Really the only issue I have is sometimes when taking it off it can kind of snag on the left and right bumpers. I'm always really careful with taking off those corners cause I don't want to yank anything. Obviously a budget option, but works for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell Goldenberg",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Makes the switch more comfortable in \"adult\" hands...but no travel case will fit",
      "text": "I am an older gamer and this grip is great and making the switch more comfortable to hold in my \"adult\" hands. The only problem I have now is that I can't fit my switch with the grip in either of my switch cases. Got to find a portable case that will fit my switch with the grip on, as I don't want to have to take it off every time I put it away.",
      "rating": 4.0,
      "verified": true,
      "author": "GeEkStEr",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "It's easy to take on and off and has a very ...",
      "text": "This thing is honestly a life- (and hand-) saver. It fits just about as perfectly as I could have wanted. It's easy to take on and off and has a very durable and professional feel to it. No complaints at all. I played until my battery died last night in handheld mode for the first time since buying my Switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Hen :)",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Great addition if you easily drop items",
      "text": "So happy we found this! We have kept the switch on its stand and only used it with the TV for the past 6 months. My 8 year old is a \"butterfingers\" and many toys have met their demise at his hands. We got this for his birthday so he can finally use the switch the way it is meant to and he is so excited! It is sturdy and easily pops on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "Am3233",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Great protective case! Hands not numb anymore.",
      "text": "Really like this protective case. It makes a world of difference while playing on my Nintendo Switch. My hands don’t get numb anymore after playing for a while. My only complaint is that it’s very hard to remove once it’s on.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Good product",
      "text": "Great as a grip for your Nintendo switch. Definitely feels easy to hold in your hands especially for adults. It's a good quality material and it will protect the back side from some scratches etc. If dropped tho it won't protect it to much but that's with anything really. The only thing I didn't like was the rubber piece that goes around the top L1 and R1 triggers. It doesn't really get in the way of pressing it but does at the same time",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Rotella",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Great for clumsy kids, keeps the controllers attached.",
      "text": "My 6yr old was constantly dropping his Nintendo. We are one the 3rd set of joy con controllers. The first two popped off too many times and broke. They aren’t cheap! This keeps them on and he can still use all the buttons. Just wish it fit in the charging dock!",
      "rating": 5.0,
      "verified": true,
      "author": "pcantu",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "It broke my console.... hard to remove.",
      "text": "It doesn’t fit in dock with case on, and due to how rigid the case is my child cracked the rear panel of the switch itself. Now it’s too late to return this case & I need to go thru Nintendo to fix the console. Don’t recommend. It’s costing me $99. I’m really angry.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Perfect for on the go and fits in carrying cases",
      "text": "Once we got our Nintendo switch I realized quickly I felt most comfortable my son using a case while we played it on the go. The switch will not fit in the TV dock with the case or fit snuggly with controllers removed which I don’t think would be possible with ANY case. Our switch does fit in our carrying case with this on it which is a definite plus. We were looking for something not bulky and easy and this was it.",
      "rating": 5.0,
      "verified": true,
      "author": "victoria",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "This case has a good feel when holding it and still allows you to ...",
      "text": "I bought the product to protect it from my game obsessed 3 year old. This case has a good feel when holding it and still allows you to access all the buttons during game play. My favorite feature of this product is how the eject buttons for the joy sticks are kind of difficult to access for my 3 year old. However, if you are one to detach your joysticks alot you might want to reconsider this case. Other than that great product for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Fits great !",
      "text": "Fits my sons Switch perfectly. The only negative would be you have to take it on and off when placing it on the console. This is not a design flaw by any means, just an FYI. It would actually be nice if the Switch console would accommodate the protective cover. :)",
      "rating": 4.0,
      "verified": true,
      "author": "CJsmom",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Not bad, I wish there was a way to test them all out",
      "text": "I read extensive reviews and decided to pay a little more for this case. I was really hoping it would be a softer rubber textured case, but it's more like my phone case being a more rigid and plastic feel. My daughter likes it, though being that the switch is more heavier than my phone, I feel that dropping it on hard surfaces, especially stairs, would leave some sort of damage. It does still fit in the zipper case though but I don't no if u could put anything else in there.",
      "rating": 4.0,
      "verified": true,
      "author": "NICK M",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Big hands? This works!",
      "text": "i am a 35 year old man child in NYC and i hang out in front of the Nintendo store and challenge anyone and everyone to a game of mariokart! Don’t even get me started where i will lurk when smash bros comes out!? Local high schools? Bryant park? Central park? I will ride my boosted board to the nearest power outlet and smash everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Ju_soo_crazy",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Partially blocks the L and R triggers",
      "text": "Not very comfortable to hold. The top part near the L and R triggers is partially blocked. I had to bend them out of the way, but they flex back into position. If I can get a refund, I would. Otherwise I'm going to cut the plastic off at the triggers and call it \"good enough.\"",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel C.",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Great for on the go gamers",
      "text": "Great for extended playing on the go. I try to use my switch as a console but as more games come out or that Interest me that are hand held based I found it was time to get something like this. I was not disappointed with what this product delivered, easy to use and feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff pritchard",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Good grip for handheld gaming",
      "text": "Made of hard plastic but flexible enough to easily get over the Switch corners and take back out. Not the squishy rubber gel. Haven't dropped the Switch yet so don't have experience with the case's protection. Really like the protruding grips on the back that make handheld gaming a lot more comfortable. The Switch has a little bit of weight so both me and my kids find it easier to hold onto (versus the flat back of the Switch & Joy-Cons).",
      "rating": 5.0,
      "verified": true,
      "author": "D. McCoy",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Fantastic value! Grab one for switch gifts to protect your investment!",
      "text": "Easy to hold, snug fit, easy to remove and put on. This case fits in my sos, switch case just fine (the zippered protective case that also holds extra games). My only complaint is that it needs to be removed to dock the switch for charging and television play. Great purchase overall to help protect my investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenni Lesmann",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Does not fit properly",
      "text": "The case holds the left button down and eventually broke the left controller. Just get something from GameStop. That’s what I did and I’m a lot happier with the new case I got. Amazon won’t do anything if it breaks your Nintendo Switch. You’ll just get apologies and excuses.",
      "rating": 1.0,
      "verified": true,
      "author": "aaron kinsley",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great for handheld only; risky for switching between handheld and console",
      "text": "The case definitely makes handheld gaming easier and keeps hand cramps at bay for far longer than playing without it. It doesn't fit in the standard switch dock while on, and it can be really hard to remove the case when you want to switch back to docked playing. I go back and forth a lot and I've found that my red controller wiggles slightly when attached to my switch now because it puts a lot of pressure on those joints when you take this case off.",
      "rating": 3.0,
      "verified": true,
      "author": "VeeDubs",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "This case feels really good. It hard enough to not feel like silicone",
      "text": "This case feels really good. It hard enough to not feel like silicone, but soft enough to easily remove the switch from it. Very comfortable, and makes handheld play a lot easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Real life mechanic.",
      "helpful_votes": 2,
      "publication_date": 20171122
    },
    {
      "title": "Simple, half thought design",
      "text": "The case hold over the the R and L buttons. Any computerise player would be crippled by this. Plus the power and volume buttons are more difficult to press. There could have been shielded buttons to allow easier press but instead are just left open in the spacing of the case. Not recommended, unfortunately.",
      "rating": 2.0,
      "verified": true,
      "author": "Terik Brown",
      "helpful_votes": 0,
      "publication_date": 20190310
    }
  ],
  "product_meta": {
    "title": "JETech Protective Case for Nintendo Switch 2017, Grip Cover with Shock-Absorption and Anti-Scratch Design (Black)",
    "rating": 4.6,
    "feature_bullets": [
      "Specifically designed for Nintendo Switch 2017",
      "Made with flexible TPU to offer Full Protection all around the device and protect your device from everyday bumps, scratches, dust and fingerprints",
      "Ergonomic Case can give you a comfortable experience and easy to grip",
      "Access to all the controls and features without taking your Nintendo Switch out of the case",
      "Super sturdy and Easy to Carry; Customer service from JETech"
    ],
    "specifications": {
      "ASIN": "B07457V4XJ",
      "Customer Reviews": "4.6 out of 5 stars6,294 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#971 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Package Dimensions": "12.99 x 7.48 x 1.5 inches; 3.88 Ounces",
      "Binding": "Electronics",
      "Rated": "Everyone",
      "Item model number": "3610-",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "3.88 ounces",
      "Manufacturer": "JETech",
      "Date First Available": "March 24, 2017"
    },
    "categories": [
      "Cases & Storage",
      "Nintendo Switch",
      "Accessories",
      "Video Games"
    ],
    "price": 14.99
  }
}