{
  "website_summaries": [
    {
      "verdict": "Choose this briefcase if you want a style that stands out and offers notable interior and exterior protection. However, keep in mind that the locks can be frustrating.",
      "pros": [
        "Distances itself from competitors on our shortlist for the aluminum construction that holds up well to heavy wear and has modern good looks",
        "Corners have rubber coatings for added exterior protection, and lined interior and strap add protection for a laptop",
        "Decent price"
      ],
      "cons": [
        "Dual combination locks are touchy and prone to malfunctioning"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Really nice case",
      "text": "I read the few reviews on here before purchasing. I felt I needed to counteract the \"not as rugged as it looks\" review. I do not feel this way at all. With the way it looks and similar items I've seen in the past, I expected some loose rivets and such, but this had none. This is a really nice case and I feel the value of it is far more than what I paid. Also, my surface pro 4 fits beautifully in here.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 22,
      "publication_date": 20171026
    },
    {
      "title": "Poor Man's Haliburton",
      "text": "I had been using the same Targus laptop case since 2000, it was a soft-sided case that held up well for 4 laptops. I decided to retire it and order a hard-sided case for more protection from bumps in the rugged break room and coffee shop scene. I looked at zero-haliburton, but I just couldn't do the price. So I pulled the trigger on this one and it seems pretty sturdy, so cheers to 17+ years with this poor man's halibuton case :)",
      "rating": 5.0,
      "verified": true,
      "author": "Nolan M",
      "helpful_votes": 18,
      "publication_date": 20171202
    },
    {
      "title": "Just fine EXCEPT THE SMELL",
      "text": "Just received the briefcase, was exactly as described and what I needed. Looks great. Only one problem: THE HORRENDOUS STENCH. There was a strong noxious chemical odor upon opening the briefcase which made me wonder if I was breathing in something very toxic. I have it sitting open on a desk right now in hopes that it will air out before I need it. Alpine Swiss, AIR YOUR BRIEFCASES OUT before you send them to customers! Or air out the raw materials you use. Or something. Because making your customers wonder if they are inhaling poisonous fumes is bad business. Otherwise, the briefcase appears perfectly fine and as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Dodd",
      "helpful_votes": 4,
      "publication_date": 20190731
    },
    {
      "title": "A case for fraud",
      "text": "The case is attractive, slim and appeared to do the job, BUT for only 4 months. On a business trip, on an airplane flight, the locking closure just fell off: both rivets that hold the hasp just gave out. I was left with the cantents of my case all over the airline floor. The product is cheaply manufactured, cheap materials, and I advise DO NOT BUY the product, and do not purchase any product from Alpine Swuss.",
      "rating": 1.0,
      "verified": true,
      "author": "Frenchiedoc",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "far everything is good. The only bad thing is it's slightly smaller ...",
      "text": "I bought this as a gift. So, far everything is good. The only bad thing is it's slightly smaller than what they said.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 5,
      "publication_date": 20180110
    },
    {
      "title": "Great case, except for the handle. Get's noticed.",
      "text": "It looks great and people constantly admire it. I wish it had hinges to keep it propped open (minor annoyance) and a larger zippered pocket inside. The big issue is the cheap black plastic handle insert. I noticed right away that it was probably going to break. I've had it just over a year now and it has broken off, leaving just the metal exterior handle. The metal edges are sharp and it's painful to carry. I need to replace the handle, repair it somehow, or get a new briefcase. Bad design and bad manufacturing.",
      "rating": 2.0,
      "verified": true,
      "author": "Saxby Hendrickson",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "junk , broke after 1 use",
      "text": "Very disappointed, Appeared to be a good case, but after using it only 1 time . One of the locking latches came off the case. And it cant be put back on, because the screws dont have an impression for a tool to tighten the screws back in",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Nice case.",
      "text": "This is a nice case. I am rough on cases because of my job, so it needs to be well built. Also I was surprised at how nice the inside was. Time will tell how this case will hold up, but I like it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Judson",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "excellent product, so happy I purchased it",
      "text": "I am enjoying using this case, very durable and surprisingly lightweight considering all the material I have in it for the fire police meetings. Well worth the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Osterstuck",
      "helpful_votes": 2,
      "publication_date": 20180630
    },
    {
      "title": "Cheaply made, stay away.",
      "text": "Cheaply made, everything falls apart. Sellers will drag their feet to refund money making excuses. Stay away.",
      "rating": 1.0,
      "verified": true,
      "author": "Vova",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Excellent",
      "text": "Really good, exactly as pictured. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bar",
      "helpful_votes": 5,
      "publication_date": 20171110
    },
    {
      "title": "Okay but rather expensive for the quality.",
      "text": "Exterior same as old brief case, interior definitely somehow smaller. No hinge locks or linkage to keep you from opening it up too far.",
      "rating": 3.0,
      "verified": true,
      "author": "Rusty Shackelford",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Won’t open",
      "text": "My son had this on his Christmas list and was was so excited to receive it for Christmas! Unfortunately only one side will open! Please help! He’s unable to use it and it’s brand new.",
      "rating": 1.0,
      "verified": true,
      "author": "Ness",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Really secure",
      "text": "Love everything about this case. Beautiful style and design. Get a lot of compliments on it. Combo locks work great. Really solid. Would buy again. Get this.",
      "rating": 5.0,
      "verified": true,
      "author": "purplecat",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Horrible. Avoid at all costs.",
      "text": "The lock broke less than 2 months after purchase. I had to destroy the case in order to get my stuff out. Guess what the case is made of underneath the exterior? Cardboard. Ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew D DeVos",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Less than satisfying",
      "text": "The outside metal had two distinct imperfections in it. I attempted to clean them but they were deeply embedded in the \"pebble\" structure of the outside metal. I was unable to see the imperfections until Imhad rmoved the case from the wrappings.",
      "rating": 3.0,
      "verified": true,
      "author": "honest customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Good item, not checked for defects",
      "text": "One of the pockets was not sewn well which is a real disappointment, according to amazon only way to resolve is returning and waiting to get the refund then ordering another one and hoping it is better. Other than that its a good item.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeanky",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Attache Case",
      "text": "Seems very well made use it every day,time will tell",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Alum satchel",
      "text": "I just wish it was a tad bit bigger but overall a great work companion!! Stores and protects my paperwork just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "John D. Floyd",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Good briefcase, but cheap locks!",
      "text": "Overall, this is a very nice briefcase, the only beef I have with it is that the locking mechanism seems a little on the cheap side. They could have used something a little more \"polished\"! Just seems like the roller numbers are sort of cheaply made.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "great value",
      "text": "I have had this case for 6 months. I have found it to be well made and has held up very well",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Davis",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "The case is built well and I am happy with the functionality of the briefcase.",
      "text": "The briefcase is well built and so far has done the job it was built for, the one problem is that the hinges rattle while I’m driving to jobs, which can be annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "James Ellis",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Good backpack alternative",
      "text": "Robust case. Goes anywhere, except probably public schools, due to locks.",
      "rating": 5.0,
      "verified": true,
      "author": "MisterB",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Highly recommended",
      "text": "This was a gift. He was delighted with the fittings and pockets. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppy",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Happy purchaser!!!",
      "text": "This was everything that I was looking for to protect my laptop and other work equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Perkins",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "making this case useless if you care about whats inside",
      "text": "One of the lock combinations doesn't work, making this case useless if you care about whats inside. Also the sides in the interior are sticky and the finish is really cheap. I would pay $5 tops for this, and I'm not exaggerating.",
      "rating": 1.0,
      "verified": true,
      "author": "lina",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Ordered it on a Saturday and got it on a Sunday and it hasn’t broke yet",
      "text": "Ordered it on a Saturday and got it on a Sunday and it hasn’t broke yet",
      "rating": 5.0,
      "verified": true,
      "author": "billybobby100",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "I like it very much my alpine suit attachecase .",
      "text": "I just use to put my import documents when I have meeting with my client and I really like it.",
      "rating": 5.0,
      "verified": true,
      "author": "glicerio cando",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Small dent in the side of the case on the ...",
      "text": "Small dent in the side of the case on the edge and the bracket that holds the handle on was mounted completely crooked sent it back awaiting refund",
      "rating": 1.0,
      "verified": true,
      "author": "Mr.Weaver",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Lock messes up too easy",
      "text": "Locked combination lock and would not unlock and had to pry open. VERY dissatisfied",
      "rating": 1.0,
      "verified": true,
      "author": "SC74",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "quality over quantity",
      "text": "My laptop is perfect for this beast, as I spent over a grand on my laptop.....",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Not quite exactly the way the picture showed. Missing ...",
      "text": "Not quite exactly the way the picture showed. Missing the interior strap that holds the laptop in place but it serves the purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Very cheap low quality",
      "text": "The case looks nice on first glance but all of the locks were crooked. The locks are a joke and are super easy to break into and upon further inspection of the case it is not very secure in general. The metal easily bends and gets scratched. The locks were not able to set and could easily be broken. Would not recommend. I am not a very picky person but this is just low quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 3,
      "publication_date": 20180209
    },
    {
      "title": "One lock is not functioning properly. Also a dent ...",
      "text": "One lock is not functioning properly. Also a dent along the edge. I'll contact them directly before returning it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jordan Ray",
      "helpful_votes": 2,
      "publication_date": 20171126
    },
    {
      "title": "Great briefcase",
      "text": "Needed secure briefcase to take documents back and forth. Works perfectly for that!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171012
    }
  ],
  "product_meta": {
    "title": "Alpine Swiss Aluminum Attache Case Padded Laptop Briefcase Combo Lock Hard Sided",
    "rating": 4.3,
    "feature_bullets": [
      "TSA APPROVED CARRY ON SIZE – Exterior measurements: 18\" L x 13\" W x 4\" H TSA approved as a carry-on to bring in flight. Interior Measurements: 17\" L x 12\" W x 3\" H. Weight: 5 lbs.",
      "SECURE COMBINATION LOCKS - Two easy to set and change combination locks. Can be individually set to two different sets of 3 digits each.",
      "LAPTOP STRAP – Fully lined interior with elegant faux leather trim. Features a padded bottom with a secure strap to hold laptop in place.",
      "ORGANIZED – Interior accessory organizer includes expanding file divider pocket which measures 8\" x 14.25\", snap button pouch, zippered pouch, 3 pen slots, and 2 card slots.",
      "DURABLE QUALITY – Aluminum hard sided rugged textured exterior is stylish and durable. Reinforced corner construction and rubber base corners protect case from wear and tear. Sleek silver hardware adds a polished finishing touch to this design. Comes with 1 year manufacturer’s warranty from Alpine Swiss."
    ],
    "specifications": {
      "Package Dimensions": "18.5 x 14.5 x 4.3 inches",
      "Item Weight": "5 pounds",
      "Department": "Mens",
      "Manufacturer": "Alpine Swiss",
      "ASIN": "B074RH6SNB",
      "Item model number": "By Alpine Swiss",
      "Customer Reviews": "4.3 out of 5 stars116 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#82 in Laptop Briefcases"
    },
    "categories": [
      "Computers & Accessories",
      "Bags, Cases & Sleeves",
      "Electronics",
      "Laptop Accessories",
      "Briefcases",
      "All Departments"
    ],
    "price": 69.99
  }
}