{
  "website_summaries": [
    {
      "verdict": "Worth considering for backpackers and hikers who navigate rough terrain, but they may be too tall and stiff for those who like to take long hikes.",
      "pros": [
        "Backpackers love these tough hiking boots for there superior support and durable construction",
        "Soles offer excellent traction and grip",
        "Updated 4D 3 boots are as well-made as previous design"
      ],
      "cons": [
        "If you don't like a tall boot, you may find this pair a bit uncomfortable",
        "Material is stiff during the break-in period"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best I have owned",
      "text": "I LOVE these boots. They are extremely comfortable, very supportive, and most definitely waterproof! We do a lot of waterfall hunting, so a lot of creek crossings, and frequent muddy conditions. I also tend to roll my ankles, so need a higher boot, these fit the bill. Almost went up in size, but took a chance and they fit great (other brands I have had to go up to two sizes larger!). Will be buying more when these wear out!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Gordon",
      "helpful_votes": 22,
      "publication_date": 20190615
    },
    {
      "title": "Fits well and very supportive. May run small depending ...",
      "text": "Fits well and very supportive. May run small depending on which socks you use. If you are using wool hiking socks, go a half size up to account for the sock and swelling at the end of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Fung",
      "helpful_votes": 10,
      "publication_date": 20180807
    },
    {
      "title": "Comfy boot",
      "text": "Love these boots! Fits perfectly and are very comfortable. Boot strings stay tied and great ankle support. Oh...and it’s the best looking boot I’ve ever owned❤️. Feet stay warm in the snow and great traction when it’s wet and muddy. When standing most of the day while wearing the boot my feet do not get sore and tired as they do with my duty boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Williams",
      "helpful_votes": 8,
      "publication_date": 20190127
    },
    {
      "title": "Buy smaller than your normal size!",
      "text": "Great boots, but buy a whole size or 1.5 sizes smaller than your normal women’s US size. They can be laced down to fit a low-volume foot, and have a narrow heel pocket. I am glad I found these, as most manufacturers of outdoor gear don’t make anything that remotely fits a women’s 6 (note: I bought the 5 in these!) that is sufficiently narrow to keep my foot from sliding around.",
      "rating": 5.0,
      "verified": true,
      "author": "seattle_seattle",
      "helpful_votes": 5,
      "publication_date": 20180914
    },
    {
      "title": "Love the feel of these boots!",
      "text": "I love how cushy and comfortable these are! I just got them and did a test hike of 2 miles. No complaints except for they were hot. I was hoping for cooler since they're not winter hiking boots. It was 80°f though. I was wearing a lite weight sock. They are heavier than my Salomon winter hiking boots. I dont mind that too much because I figure I gained a more stable boot and there's more cushion as well. I did appreciate those benefits on my hike. The price is worth it I believe! Cant really comment on their durability yet. Will update if I have issues later on.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Out of the box comfort; great for bunions",
      "text": "WOW! Absolutely love these boots - I wore them for the first time on an 11 mile hike, multiple water crossings, +/I2600ft in elevation gains/descent and they were awesome. No blisters, great ankle support, actually waterPROOF, and very roomy toe box. I started developing a bunion on one of my feet and these are so comfortable. I’ve had the Merrill MOAB boots for several years and these blow them out of the water. I did order half a size up due to the bunion and intent to wear thick hiking socks and it was a great decision. I’m completely sold on Salomans from here on out.",
      "rating": 5.0,
      "verified": true,
      "author": "DL Miller",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Light, sturdy, comfortable",
      "text": "Had a last minute hiking trip to June Lake, CA and decided to get these since they already had good reviews. My shoe size ranges from 7 1/2 to 8; I got a size 7 1/2 in these and they were extremely comfortable and had space. They are stylish and comfy, I even saw another girl wearing the same exact shoes on my trip and we both immediately stated how light and comfortable they were. 10/10 recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Paulina Aguilar",
      "helpful_votes": 2,
      "publication_date": 20200811
    },
    {
      "title": "Salomon Quest 4d 3",
      "text": "This is a Christmas present for my wife. The reason for the 5 stars is because I have the Mens version and they're great. They have excellent ankle support and a sturdy sole for jagged rocks. Most of all they're comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181129
    },
    {
      "title": "LOVE",
      "text": "These are great. They fit perfectly and are so sturdy and comfortable. They didn't need to be broken in at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaiti",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "The hiking boot for Mount Everest.",
      "text": "Bought my second pair of Salomon Quest's 4d Gtx boots. I liked it so much that I bought 1 more pair for my wife. Super comfortable and tenacious grip. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Quoizimodo",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Excellent Hiking Boot.",
      "text": "Very comfortable for hiking right out of the box. Bought them for steep Alpine hiking so bought 1/2 sizes larger to protect my toes. Great fit for wide foot and excellent ankle support. Very breathable and water proof.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Parks",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "I'm not exactly the size, they're bigger",
      "text": "I went with them to Peru, but they left me half a bigger number, I'm 7/2 and I've always had it, I'll have to buy another smaller half number",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Great comfort.",
      "text": "I got these boots yesterday and hiked almost 3 miles in them today. I am older and have developed some arthritis in my big toes. These boots have plenty of room in the toe box and good ankle support. They have good traction on steep, rocky hills, too. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "deevmom",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Plastic shoestring hook broken right out of the box.",
      "text": "I wanted to love this boot but when it arrived, one of the shoestring hooks was broken. It is apparently made of plastic (bad choice). The boot was a bit stiff & heavy & though it was touted as having a wide toe bed, it could have been wider for more comfort. Of course I had to return it. I’ll have to continue my search for a great women’s hiking boot.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann Carol",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "UNBELIEVABLE COMFORT!",
      "text": "I absolutely LOVE these boots!!! What a concept!!! I have always worn great hiking boots... or so I thought, until these AMAZING ones!! I have had three surgeries due to Morten’s Neuroma and infection... I cannot express more what it means to me to FINALLY be back to hiking three times a week!!! LOVE ONE STEP AT A TIME!!",
      "rating": 5.0,
      "verified": true,
      "author": "leslieAnn Davidson",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Foundational footwear.",
      "text": "Sturdy, light, beautiful. Wife loves them too much via not wanting to get them dirty by wearing them. I tried.",
      "rating": 5.0,
      "verified": true,
      "author": "james sauve",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Amazing boots",
      "text": "I love this boots, I took them for a spin over the weekend, they don't feel heavy, but they are sturdy. Great style!",
      "rating": 5.0,
      "verified": true,
      "author": "kel",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great boot",
      "text": "This is my 4th pair of these boots. No breakin required. I where them 6 days a week, 10-14 hours a day. Hiking, delivering the mail in rural Wyoming. Nothing negative to say about this boot. Its winner!!",
      "rating": 5.0,
      "verified": true,
      "author": "MEGAN",
      "helpful_votes": 2,
      "publication_date": 20190615
    },
    {
      "title": "Excellent product!!!",
      "text": "Excellent boots!! Light weight, very comfortable, great design and color, protects well the ankle for going up and down hill.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 2,
      "publication_date": 20180731
    },
    {
      "title": "The rubber loosened a bit after the first time",
      "text": "I used the boots once and a piece of the rubber from the forward tip was loosened a bit. I'm worried that the glue does not last.",
      "rating": 3.0,
      "verified": true,
      "author": "Diana Quintero",
      "helpful_votes": 3,
      "publication_date": 20181206
    },
    {
      "title": "Ultra light weight and comfy",
      "text": "Super comfortable, first time used hiked 20 km with no blisters or discomfort, it was a cooler weather around 70ish the ventilation was ok, liked the grip of the sole",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Good shoe. Replace liners for comfort.",
      "text": "Good fit. There is not much cushion, so removing the original liner and adding a shoe insert helps.",
      "rating": 4.0,
      "verified": true,
      "author": "keepsblessingme",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Toe box is slightly narrow",
      "text": "Loved the look and the feel but unfortunately will be returning because I feel like I would benefit from wearing a wider size especially if planning to wear two pears of socks",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190504
    },
    {
      "title": "No break in time",
      "text": "I wore them around the house for a couple of hours and the next day hiked 10 miles. No blisters, my feet were comfortable. I did have sweaty feet but I believe it was due to my socks. I will buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Imelda",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Great comfort",
      "text": "Love the comfort, first time out NO blisters!! Took two years to find the right boots! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kath",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Fit/Comfort",
      "text": "First hike this past weekend, 4 miles with slushy snow patches. Given a foot surgery issue, with my inserts, they worked well given no break-in period. Kept my feet warm and dry. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie B.",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Like a ski boot",
      "text": "Very stiff and uncomfortable. Felt like a snowboard boot not a hiker. Felt like I was locked in and there was no flexibility. Returned for full refund, that was A+",
      "rating": 2.0,
      "verified": true,
      "author": "Yvette",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Love them!",
      "text": "These fit great, are lightweight, seem durable, etc. The only thing I would change is make the laces slightly longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Robertson",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Best hiking shoe ever",
      "text": "Very comfortable, didnt really have to break them in, not too heavy and great when crossing streams feet dont get wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina L. McGilvery",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Five Stars",
      "text": "Love these boots! Put them on and went hiking. Didn't need to break in at all.",
      "rating": 5.0,
      "verified": true,
      "author": "JB2009",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "Comfortable and fashionable",
      "text": "I have a lot of issues on my feet and this boots is just perfect and comfortable. I have no regret. I really recommend It.",
      "rating": 5.0,
      "verified": true,
      "author": "Simone de Medeiros",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Great customer service.",
      "text": "The ad was the truth I love them for hiking and walking I get compliments every time I wear them.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina Armani",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "These are perfect!",
      "text": "When I first ordered these, I ordered size 7.5 as I assumed I should purchase my normal shoe size. WRONG! I needed a full size down, which I quickly received. Once I had the right size, I was in heaven! These are the crem de la crem of boots. Went on a 6 mile hike and it was wearing clouds. And they are perfectly waterproof, as I discovered when I stepped ankle deep into a puddle. I wasn’t sure about spending this much for a pair of hiking boots, but I am certainly glad I did!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201101
    },
    {
      "title": "Best purchase for hiking boots!",
      "text": "I was hesitant to purchase them because of the price and the bulky look. However after using them for one hike I couldn’t be happier with my decision to get them! They are light on my feet and support my ankles! I will be using them to hike the Inca Trail this summer. I absolutely LOVE them!",
      "rating": 5.0,
      "verified": false,
      "author": "Kristen E. Sigler",
      "helpful_votes": 3,
      "publication_date": 20200222
    },
    {
      "title": "Not for me",
      "text": "Boot sole is very stiff. Zero flex. Not being able to roll my foot causes pain in the balls of my feet, and they're also very loud. Returning, trying another brand. Purchased on husbands prime account, so this probably won't be \"verified.\"",
      "rating": 1.0,
      "verified": false,
      "author": "Aili",
      "helpful_votes": 3,
      "publication_date": 20190612
    },
    {
      "title": "Did not fit my foot.",
      "text": "Shoe was heavier than expected and caused foot pain in my outer foot. The toe box was wide enough for my toes which was great but they just didn't work for my feet.",
      "rating": 3.0,
      "verified": false,
      "author": "NB",
      "helpful_votes": 0,
      "publication_date": 20200817
    }
  ],
  "product_meta": {
    "title": "Salomon Women's Quest 4d 3 GTX W Backpacking",
    "description": "Quest 4D 3 gtx women is all about walking comfort, with technologies to reduce fatigue over the duration of your treks. Light and cushioned with running shoe adapted technology, yet supportive enough for backpacking, this boot helps you get to the next camp site with happier feet.\n\nSalomon was born in 1947 in the heart of the French Alps and the birthplace of modern alpinism. Driven by a passion for skiing and design innovation, Francois Salomon and his son George designed and perfected much of the first modern ski equipment. During the following 60 years, Salomon's commitment to innovative design and passion for mountain sports created a vast range of revolutionary new concepts in boots, skis and apparel and brought innovative solutions to footwear, apparel and equipment for hiking, adventure racing, mountaineering and trail running. Through performance-driven design, Salomon enhances mountain sports by converting new ideas into action and expanding the limits of possibility.",
    "rating": 4.7,
    "feature_bullets": [
      "100% Synthetic",
      "Imported",
      "Rubber sole",
      "Shaft measures approximately 6\" from arch",
      "WATERPROOF BACKPACKING SHOES: Designed for maximum traction on mixed terrain, the Quest 4D 3 hiking boot features our 4D Advanced Chassis to help guide the foot & reduce fatigue, even on the roughest terrain.",
      "ANY PATH YOUR WAY: Light & cushioned with running shoe adapted technology, yet supportive enough for backpacking, the Quest 4D waterproof hiking boot helps you get to the next camp site with happier feet.",
      "ADVENTURE AWAITS: Whether you love a local day hike or hitting the trails for a multi-day adventure, Salomon makes innovative hiking & backpacking shoes & boots for men & women to help you go the distance.",
      "TIME TO PLAY: Whether you are into trail running, hiking, backpacking, or mountaineering, Salomon has shoes & gear for kids, men & women to help you conquer a new distance, personal record, or event!",
      "SINCE 1947 Salomon has used our passion for outdoor sports & innovation to create progressive gear. Our road & trail running shoes, hiking sneakers, boots, & water shoes help make any path your own."
    ],
    "categories": [
      "Backpacking Boots",
      "Women",
      "Shoes",
      "Outdoor",
      "Clothing, Shoes & Jewelry",
      "Hiking & Trekking"
    ],
    "price": 172.5,
    "specifications": {}
  }
}