{
  "website_summaries": [
    {
      "verdict": "This Garmin watch offers impressive styling and numerous practical fitness tracking capabilities for a mid-range price. Great for working out and wearing every day.",
      "pros": [
        "An updated version of one of Garmin's most popular tracking watches that offers an attractive new design",
        "Syncs easily to a smartphone, which is convenient for receiving important notifications",
        "Tracks metrics for runners and is useful for monitoring other athletics such as swimming, cycling, and more",
        "Reliable GPS"
      ],
      "cons": [
        "Battery life isn't the best",
        "Some metrics aren't very accurate, such as heart rate and sleep tracking",
        "Sounds good when it plays music, but it has been known to lose/delete files for no apparent reason"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice watch",
      "text": "I don't like wearing a watch but this one has been extremely comfortable. Battery life depends on what your doing but for me several days before I notice it needs charged. I've turned off things I didn't need and I lock the screen so that my shirt sleeve or water in the shower hitting it doesn't start bringing up menus. HR accuracy is better if you change the data recording to every second. It is very programmable and I use it to record bike rides, walking and weight workouts. The Garmin Connect app is really nice and it also works great as a watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20200701
    },
    {
      "title": "The worst product EVER",
      "text": "Ok, I bought two of these expensive devices. One for me & one for my husband. Let's talk features.... - Sleep analysis? Worthless because of its inaccuracy. - Customer Support? They send out messages letting you know it's not available because there are too many problems. - Phone app? Hasn't connected in over a week and they tell you not to bother to call because there are too many problems as reported by users so they are not providing phone support. - Exercise data? Not accurate. -Intensity minutes? Not accurate. - Steps? Not accurate. - Battery? Pathetic. Timekeeping? Seems to work as a watch...but that feature wasn't even important to me! Please RUN from this product.",
      "rating": 1.0,
      "verified": true,
      "author": "E.VanHoutte",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "I love this smart watch!!",
      "text": "This is my second Garmin watch. The first one was lost a few years ago. Setup of the Vivoactive 3 was simple - no manual needed. Tracking my sleep has been great. Tracking my daily run has been great. Receiving alerts about texts\\emails has been great. Why did I wait so long to buy this! I've needed something like this for years. My friend has an Apple Watch. As i understand it, Apple watch only pairs with iPhone - how lame is that! Plus, we were hiking a mountain together and is Apple Watch ran out of power. In contrast, I didn't need to charge the Vivoactive for nearly a week! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "nwman97",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Cloudy look of the watch face.",
      "text": "I heard good things about this product... I bought this to replace my Fitbit thinking this might work better for swimming. I only wear it today and I am very DISAPPOINTED ! Battery full charged this morning and by 9 hrs of my work shift, battery already drain to 30%. The CLOUDINESS of the watch bother me the most. If anyone understand about the gray scale, this watch is more than black/white. Then the battery is the second issue. I don't recommend this product to anyone. Looks nice, but not worth it ...",
      "rating": 1.0,
      "verified": true,
      "author": "ml",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Nice watch, except the hrm.",
      "text": "Well if you don't care about the heart rate monitor then get it. I set my watch down on my bed to do something and when i went to grab it again it i noticed the heart rate was reading 77 bpm!?!! I can't trust this to be anything legit at all now and that was the reason i bought it.",
      "rating": 2.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 2,
      "publication_date": 20191209
    },
    {
      "title": "Erratic Heart Rate",
      "text": "Heart rate zone training nearly impossible with this watch. Running on a flat surface at a even pace I'll get reading varying by 80 bpm. 110 bpm drops to 65 for several minutes with no change in pace the recovers to 100 over a 5 minute period. Near the end of my run bpm jumps to 144 and stays there even after I complete my run! I have several other fitness watches which I have used for years and have never experienced this level of inconsistency. The main reason I tried this Garmin watch is for the software that can calculate VO2 Max but the results I get are a joke, garbage in garbage out.",
      "rating": 1.0,
      "verified": true,
      "author": "John Olszewski",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Face way too sensitive",
      "text": "I have had this watch for 8 months. While this watch offers a lot, I don't use it that often. The face has a hair trigger touchscreen. There are times I go to look at the time and the entire face has changed without me knowing. Because of this, I am forced to keep it locked which is awful. I will go to look at the time and there is giant lock in th middle of the screen blocking the time. I can honestly say that I really don't like this watch. Having all the options is great but loses it usability when you have to keep the screen locked at all times.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristy",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Definite must buy",
      "text": "I’m a watch collector who also likes to be active. Generally I go with G-Shock or one of my higher end watches when I’m out and about then change to my previous fitness watch while at the gym. Eventually I decided that I wanted a more functional, everyday watch and figured I’d some shopping. I find this one on sale and I’m so glad that I bought it. With all of the after market accessories, including link bands, I wear this 24/7 now and haven’t even touched any of my higher end watches in weeks. The app is so user friendly and has so many functions, way more than I was expecting.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaiah Ratey",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Much better than a Fitbit",
      "text": "Replaced a very buggy Fitbit Charge 3 with this watch. The screen is great, the tracking is accurate, and so far the watch does exactly what I expect. Very happy with the purchase. Do yourself a favor and look at Garmin before you jump into the Fitbit world.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg P",
      "helpful_votes": 2,
      "publication_date": 20191203
    },
    {
      "title": "Fitness Device with Advanced Capabilities at a Low Price Point",
      "text": "Love the design and feel of this device. Not too heavy, but very robust. Navigation options are handy, with the virtual slide bar on the side of the device being surprisingly effective and helpful. Garmin Connect app is very useful and has plenty of options for parameter tracking. Long battery life and great immersion resistance. Many band options are available. This has spurred me to be more active. It has advanced features that allow you to track many activity types and customize your workout plans. The \"coach\" in the app is also very helpful for creating plans and executing them. Will guide you with navigation, but does not have mapping on the device. Great device for the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ Gallman",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "GPS comes up short",
      "text": "After the first couple of mountain bike rides the GPS is tracking about 10% less than two apps on my phone. The heart rate is also running low compared to a chest strap monitor but I was not expecting it to be accurate on a mountain bike ride when I don't like adjusting the strap tight enough to keep it tight to my wrist. The touch screen response is good and navigating through the pages of apps responds quickly however the overall default layout is not as convenient or intuitive as I would like. If I get more accurate GPS tracking with more uses comparing it to other devices I'll update my rating.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazonman",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Going to spend a lot of time charging...",
      "text": "Had a couple Garmin watches prior and liked them so I picked one up just after release. Worked great. GPS connected quickly, was accurate, HR monitor was good...8 months later it wouldn't hold a charge longer than 2 days, even with all sensors turned off. Garmin, to their credit, got a replacement out to me in 3 days. Battery life has been lousy. Prior watch could go a week (with wrist HR turned on) before charging. Now it's 3 days, max. I love the watch, I hate not being able to use it.",
      "rating": 2.0,
      "verified": true,
      "author": "rowari",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Solid Garmin product worth your consideration.",
      "text": "I like the Vivoactive 3 much better than the 2. The 3 stays connected to my Android phone without fussing with it like was necessary with the Vivoactive 2. I've been using Garmin products for decades and have always found them to hit the sweet spot between quality, performance, and price. I enjoy the expanded watch face options and will probably keep this one as long as it lasts.",
      "rating": 5.0,
      "verified": true,
      "author": "TechyNerd",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Not too impressive - need Alexa",
      "text": "Initially I love this watch and it seems great for running. However, there is so many options/features on this watch and I can't figure out how to limit or select only certain notifications. I either get all or none and my wife complains about me not responding to her wife, lol. She has the Versa 2 and it's actually pretty cool. It works with Alexa so it can set reminders, alarms, and add things to shopping list + much more. Although pretty cool, I like the look of this Garmin watch better; maybe because it looks more manly.",
      "rating": 4.0,
      "verified": true,
      "author": "Jade A.",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Quality all around watch",
      "text": "I use the watch for running and daily notifications to monitor incoming calls/texts for work. Helps to not have my phone on me at all times. Battery life lasts about 3 full days with all my notifications & running usage. Band is a higher quality than the Vivo 1 watch I had. The touch screen face is quite sensitive and once in a while after sitting with my arms crossed I will accidentally scroll screens or activate a screen. Any accidental changes are easily undone.",
      "rating": 4.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Extremely inaccurate in every aspect",
      "text": "The only thing I really like about this watch is that it tells time. I don’t really trust any of the readings. The step counter is ridiculously off along with the stair counter. I have left it sitting on a table and it has counted thousands of steps and multiple flights of stairs. I have compared the distance it has tracked while running with my iPhone 8 and it is usually off by 1 or 2 miles. Also the mobile app is complete garbage. The app disconnects from my watch daily and deletes all of the apps I have downloaded. In the end I would definitely not recommend this watch to anyone.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Love this watch",
      "text": "I had a Garmin Forerunner 25 for about 4 years. I really enjoyed it. But, I started having issues with it syncing with my phone, etc. I did quite a bit of research and decided to go with this Garmin Vivoactive 3. It's much lighter and more comfortable that the Garmin Forerunner 25. The functionality is much more extensive on the Vivoactive 3. I have used it on the treadmill, which hasn't been real accurate. It was under by about .25 mile. I also used it for a walk and that seemed pretty accurate. I am looking forward to using it while golfing and swimming.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea P",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "The perfect gift",
      "text": "Bought this for my husband for an early Father's Day gift and he loves it. The only complaint he has is the watch doesn't show notifications for text messages. We have checked forums and Garmin's page and nothing has worked. It's not enough to make the watch any less useful or likeable though. His other smartwatch had the same issues and he used it for years. This watch is a lot more accurate on steps and has a lot more features than his previous one. He's very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz J.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Works well, accuracy is so-so compared to my EKG HR monitor",
      "text": "Love the looks of this Garmin, purchased it when it was on sale for Prime Day. Works well, tracks steps pretty well, though as all wrist monitors the HR is way off compared to my EKG (Polar) HR monitor, but most know that. Easy to use, little lacking on apps but does what I want it to. Downloading apps and watch faces can be a pain as you have to be plugged in as they won't sync through bluetooth. Probably would go with a Polar Ignite or something else if I had to pay full price.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "GREAT Upgrade for My Previous Vivoactive",
      "text": "I upgraded to the Vivoactive from an original Vivoactive, and I couldn't be happier. The interface is simple and intuitive. I love that I can choose to wear it with the button on the left instead of the right. Though I use it mostly for running, I find the smartwatch features helpful and very functional. The Garmin Connect app that supports this watch is nearly as important as the watch itself. It's one of the main reasons I stayed with the Garmin family of products.",
      "rating": 5.0,
      "verified": true,
      "author": "David Baker",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Get it!",
      "text": "Love this thing. I switched from a Fitbit because I wanted ANT+ tech to connect with gym equipment and external accessories. I haven’t been disappointed! The interface is a bit tricky to learn, but once you get it, it’s a wonderful daily wear. I use it for climbing (under a sweatband), biking, walking, hiking, running, sleeping, and general health insights. I have a neurological condition that affects my HR and this thing is a life saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Krebs",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Police officer approved",
      "text": "I wear this watch every day as a police officer to track my steps/workout. Heart monitor is a little wonky when it comes to weigh lifting and the wrist is moving around, but that is the unfortunate thing about any wrist based HR monitor. Sometimes have to reconnect to phone for notifications. Battery life lasts around a week and watch is very durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew H.",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "It is so-so at best given what I paid for this",
      "text": "I have to continually reset the watch because the step counter disappears. The watch face changes all the time and the only time the watch tries to measure my stress is when I am in the shower and I don’t want to stop my shower for this. If the issues had started in the return period, I would have returned it, but it waited until after that time before malfunctioning. I was considering this and the Fitbit, but bot this on the treasure truck. I ha e decided to be more selective on Treasure Truck items since it appears they are items that don’t move well or not recommended. Battery life is fair at best.",
      "rating": 2.0,
      "verified": true,
      "author": "judy goldsmith",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Poor battery life",
      "text": "Made this purchase as an upgrade for the vivoactive HR. I really like the looks and the comfort. Heart rate sensor is flat unlike the vivoactive HR. GPS is nice. Custom watch faces are nice. Not great for weight lifting tracking as far as heart rate. About the same as vivoactive HR.I don't personally need to count every rep and every set on a tracker. Takes your focus away from the exercise. Battery lasts me right over 3 days.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Could be more accurate, but satisfied",
      "text": "I have been wearing my vivoactive3 for about a week now. Pros: The deisgn and how it wears is very comfortable Battery life is great after 4 days I was at 41% that was leaving the brightness at 30%. Ive used gps twice and it was very accurate Cons: Sleep tracker is inaccurate Stair tracker accuracy is off This is the first smart watch ive had in a while. Overall i am pleased with the product!",
      "rating": 4.0,
      "verified": true,
      "author": "Wesphal Smith",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Inaccurate HR 98% of the time..",
      "text": "Love this watch except the HR feature. Just did burpees and my HR measures 80, I can feel my heart thumping... compared this to my chest strap HR monitor. It was off peetty much the whole time. Very disappointed in this bc I like to track calories burned vs consumed, this is so inaccurate. Very disappointed... Great for simple messaging features, I like the appearance, and it's a good watch... all of which is why I haven't returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda Duda",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great entry-level Smartwatch",
      "text": "I couldn't decide between purchasing this Garmin or an Apple Watch series 3 which were the same price. Decided to purchase the Garmin b/c I prefer round watch faces and a longer battery life. So far I do not regret this purchase! I use it primarily for telling time and tracking the stats on my outdoor runs. It's fantastic. I also like the text notification features so that I can tell who's texting me from glancing at my wrist vs. checking my phone.",
      "rating": 5.0,
      "verified": true,
      "author": "SpeedyTrojan",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Excellent watch!",
      "text": "This watch has been great! So far I've only been using it while running, but the GPS and other data has proven to be very accurate so far. I'm not anticipating any problems with tracking for cycling, walking, etc. Very lightweight and comfortable. Bands are super easy to change out if you want to purchase additional colors. As an avid runner currently training for a half marathon, I highly recommend this watch!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Perfect for fitness watch",
      "text": "Love this watch for what I use it for......tracking hiking and walks. Love the Garmin pay. It works well also. I had purchased a Samsung Galaxy Watch. It was better in working with my phone but I dont send complicated texts through my watch. I can still see the texts and email notifications on my watch and that is all I need. Garmin is less complicated and easier to access the fitness apps. Samsung not so much. Wish I would have gotten the music version but am extremely happy with this one. Graphics are not as snazzy as the samsung but the battery life is much better. I get a week per charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 2,
      "publication_date": 20190206
    },
    {
      "title": "10/10 Would Recommend",
      "text": "Purchased mainly because I wanted to easily track steps and heart rate and does exactly that with high accuracy. Not sure that the sleep tracking is on point but still gives you a good snapshot of sleep habits without having to visit a sleep study lab. The Garmin Connect App is easy to use and there are many options for watch faces, widgets, and data fields in the Connect IQ app. Battery life is awesome. Very satisfied with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianne ",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I like this watch",
      "text": "I like this watch. Firmware updates have improved battery life and features such as the stress monitor. My only complaint is that the black \"gunmetal\" scratches easily. I have had my watch 3 months. The screen is fine, but the bezel is pretty scratched up. I'm using a black sharpie to cover them up. If I were to buy it again, I would go with stainless steel. I would have saved a bit of money and I think it would have less visible scratches.",
      "rating": 4.0,
      "verified": true,
      "author": "ASF",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "One of my favorite new toys, glad I upgraded",
      "text": "Love it so far. Accuracy seems to be about as good as it can get, and it doesn’t record nearly as many false steps as my old Garmin (that thing would record over 1000 steps just driving down a dirt road!). Only negatives so far are that the band isn’t quite right - one notch is too tight, next one is just a bit too big - and it will sometimes start activities by itself. Not huge deals but mildly annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Leah Murphy",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Watch is slow to connect to GPS signal",
      "text": "Great watch, features, interface, and app, but the watch takes several minutes while \"Waiting for GPS\" before it finds a signal at the beginning of a run or ride. The issues is isolated to this watch, as my son's GPS watch and Garmin Edge lock onto GPS instantly (within a few seconds) from the same locations. The battery life is better than expected, and though the watch doesn't have audible tones or alarms, the vibrate feature is quite strong.",
      "rating": 4.0,
      "verified": true,
      "author": "M. L. Firm",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "HR sensor is inaccurate and fails to read consistently, but features are great",
      "text": "I'll be returning my unit since it's probably defective. The HR sensor reads 15 to 20 above actual as measured manually and by my Polar chest strap. I did the recommended hard reset of the watch but to no avail. However, I'll probably get a replacement this one, hoping it's not defective because the features and app and tracking are all without peer. I used to have a Samsung watch, and while that is a better smartwatch that's easier to use, Garmin has far better running and exercise tracking while still having good smartwatch functions like notifications and such.",
      "rating": 2.0,
      "verified": true,
      "author": "johnnyjjj",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Easy setup, nice!",
      "text": "First experience with a wrist worn gps. I've been running for 4 years and have always used my phone and map my run app. I bought the garmin during amazon prime day. It's easy to setup, easy to use, it syncs to my Samsung phone and syncs my workouts to map my run so I can continue tracking my workouts there too since I have 4 years of data there. I'm sold, great tool run,bike,swim and much more.",
      "rating": 5.0,
      "verified": true,
      "author": "kungfujoe",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Good for workouts, unreliable for heart rate",
      "text": "I liked the Vivoactive because of how easy it was to use and the different activity options. If you’re looking for an accurate step counter, this watch is not it. When the watch shakes to tell you to move, the steps will increase due to the vibration. I didn’t keep track of my steps, but it was something I noticed. The heart rate monitor also stopped working for me after a couple months. I tried re-setting the watch and the heart rate monitor still doesn’t work.",
      "rating": 3.0,
      "verified": true,
      "author": "Lady Dovahkiin",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Love the Golf functionality - but watch feels cheap",
      "text": "Watch case already has scratched after just a month. Gunmetal finish is cheap. Band is cheap. I love the golf features which is what pushed this watch from 3 to 4 stars. Do not pay retail price for this watch. User interface very clunky. If Fitbit had GPS, that is what I would use. I am not spending $500 on an iWatch so Garmin wins out on price alone.",
      "rating": 4.0,
      "verified": true,
      "author": "JonathanD",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "This watch is great!",
      "text": "I had a fitbit versa which was absolutely worthless compared to Garmin vívoactive 3. It's easy to use, has better battery life and changing apps and watch faces isn't an annoying chore. I was just looking for a functional smartwatch to track steps and my strength training workouts. Forget about Fitbit. Try this watch!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Maikeru",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "I expected more",
      "text": "Honestly the sensors on this thing are complete garbage. The step tracking is far from accurate, heart rate monitor is off as much as 40 bpm sometimes, and when conparing to gps run tracking on my phone it's off as much as .5 miles in a 6 mile run sometimes, on a distance i know to be exactly 6 miles. Handy for a general idea of things, but don't expect any real accuracy. First smart/fitness watch I've ever had and I'm pretty underwhelmed after 5 months +/- of use.",
      "rating": 3.0,
      "verified": true,
      "author": "Hepennypacker",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "yoga) and I love my watch",
      "text": "I do a variety of sports (swim, bike, run, hike, SUP, yoga) and I love my watch. It looks more like a normal watch then previous models. Works well for keeping my laps in the pool. GPS works great for hikes/runs/bikes. Alerts me when I have a text/email/meeting. I do feel for the price, you have to want information on your activities more than anything else. If you want a step counter than I would get a Fitbit. If you want something that works great with your phone, you'll need an apple or samsumg watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney B",
      "helpful_votes": 2,
      "publication_date": 20180503
    },
    {
      "title": "Durable, reliable, fast charging, sharp looking",
      "text": "Exactly as described. Bought it as a Christmas present for my electrician fiance so he can wear it to work. Months later no scratches on it (he went through watches like crazy before) and this way when someone is calling or sending him a message and he is on a ladder or in a not so safe place he can see it on his watch instead of trying to fumble aeound for his phone. Plua he can send quick reply texts from the watch face. I havw the vivo active hr and am very jealous that he has this one! GREAT PRODUCT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Snyder",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Great watch",
      "text": "I was looking for a “smart” watch and was comparing several different ones out there. I decided on the Active 3 because of the multitude of workout features, being able to receive messages and other notifications and the price. It is a great watch and I enjoy it. The battery life is not great but it charges quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Hilltopper2k5",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Gotta Get a Garmin!",
      "text": "I LOVE this watch! Having used the Vivofit for nearly 2 years, I was already a Garmin fan. I had been debating a running watch for some time and researching all makes/models, including those with smart watch features. This watch is the best of both worlds. I love the notifications, the activity tracker, and the sleek style. I'm still learning all the bells & whistles of what this thing can do, but it has not disappointed so far. It's a perfect starter watch for anyone wanting to jazz up (and keep tabs on) a fitness routine, while getting a few smart watch benefits. Go Garmin!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather J",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Look no further for best activities tracker!",
      "text": "Love all the functionality and it is much more stylish with all the faces you can switch out! That in itself creates fun and practical uses combined! I use it for hiking biking and running! Challenges keep you motivated and the vo2 sensor helps track your level of fit! Best Buy for buck!",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Wilson",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Love the watch but had to return to Garmin soon after getting it",
      "text": "I love the Garmin Vivoactive3.!GPS connects quickly for running, it has great accuracy, and lots of great features. However, after about a month of owning it, it was not recording elevation and it seems the altitude sensor was not working. The Garmin customer service people helped me out and did some tests on it with me, but it turns out it needs to be replaced. They gave me directions for how to send it back to them and they are sending me a new one.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "What I like about it water proof and it looks like a ...",
      "text": "So far with no gps use the watch last 6-7 days without a charge. What I like about it water proof and it looks like a watch. Has a lot of functions. Seems to be fairly accurate. For the person just looking for HR, calls, and steps this much does much more and you might be better off with something similar. Interface and app is pretty good but not as easy as Fitbit",
      "rating": 4.0,
      "verified": true,
      "author": "nards444",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Nice watch",
      "text": "Bought my husband this watch for Christmas. He LOVES it. It has SOOO many different things on it. It's a very nice watch. The only thing he said bothered him about it was how big it is. His old one was smaller and square so this one felt weird on his wrist. He said its so big it almost stops him from bending his wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "mellymel",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "I have been very very happy with this watch",
      "text": "I have been very very happy with this watch. It is great multi sport watch with GPS for marathon training. It also does not look like a running watch, and I feel comfortable wearing it with most things. The battery does not last as long as I had expected, but I can live with that.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180502
    },
    {
      "title": "Read the abilities of it before you buy",
      "text": "So far all the watch does all day long is connect and disconnect so it vibrates on my wrist and it bugs me! Has no speaker so if I get a phone call I still have to get my phone out.. only has like 6 preset response messages.. if it weren't for those I would like it alot more.. but for the cost what do you expect",
      "rating": 3.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "A good smart watch",
      "text": "I'm pretty active. I wanted a reasonably priced smart watch that could track my steps and had an accurate GPS to use for my runs. This works great. Updating watch faces could be a little more simple. But that's the only issue I have with this watch. Its a good watch and I recommend to anyone looking for a reasonably priced smart watch.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Just Okay",
      "text": "Functionality wise..the watch is OK for what i use it for. I don't have any interface issues as other people describe. At least nothing in the 6 months I've had it Screen is terrible as far as i am concerned. My Son's 40 dollar watch has way better screen and color quality than this Garmin. Any watch face i downloaded looks like crap. Colors are washed off and look ugly. To the point where i will get rid of it soon. And no, my watch is not defective. I compared it to other people's and it looks the same. I guess others aren't as concerned about display quality. To me it's a deal breaker.",
      "rating": 3.0,
      "verified": true,
      "author": "Jonas",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Hi-tech hubby's fave watch",
      "text": "My husband LOVES this watch. There is even an Army watch face for him! He loves changing the watch faces and the text feature on the watch is awesome... you can read the whole text AND respond! He mostly uses the text feature, heart rate monitoring during workouts, step tracking, and sleep tracking... and telling time of course! LOL. No glitches and no problems!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Williams",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Good for general use, but not reliably accurate",
      "text": "Upgraded with this watch from the older model Vivoactive watch. This newer model has a few more bells and whistles, but its accuracy for indoor training is not better than the older model. The heart rate measuring function seems better, but the stair climbing function is completely wack-o. The stress measurement seems unreliable as well, but generally OK. Bottom line, I like the watch, but I do not expect accuracy from its measurements, so it is fine for me. I especially like the email and phone call prompts and messages. Very handy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Happy with this purchase!",
      "text": "The app requires iOS 11 or higher. You can use the heart rate, stress, and activity monitors without the app. Love the gps tracking while I take a long walk with my daughter, we enjoy getting home and looking at the map of our walk. The sleep tracking with the app is pretty impressive. I’ve been wearing this while bathing my kiddos and in the shower and have no problems with water.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth H.",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "So far I like it",
      "text": "I've had this less than week and so far I like it. It's hard to find any information on how to appropriate track all types of workouts. It's all very broad, which is similar to all smartwatches. The first two days my watch kept restarting to install things. Battery life has lasted 4 1/2 days so far. About 20% is used each day.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "With the app it is a great package for me worth the price compared to others ...",
      "text": "Got everything i wanted in this. Im a runner and also i use it 24/7. With the app it is a great package for me worth the price compared to others in the market. I am using it with differet bands and it goes well. With a gun metal aluminum band it goes well with the office attire as well. The lower resolution of the display is good for battery saving. It takes a shower to charge it. Only once in a while it would skip a night without recording my sleep. It just skip the whole night.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Great watch",
      "text": "Love this watch , use it for many things, I’ve had other fitness trackers and smart watches while it may not track some things as well as other brands but it does a phenomenal job, battery is great and has a lot of aftermarket stuff to maximize usage and customization as well as lots of different settings in the connect app",
      "rating": 5.0,
      "verified": true,
      "author": "Eric ",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Good tracker",
      "text": "This watch does good tracking but has a short battery life. Three days is about all I get from it. I only use GPS for about 45-60 minutes a day. The sleep tracking shows a very different results from my old Vivoactive HR watch.",
      "rating": 4.0,
      "verified": true,
      "author": "Zip Hunter Dad",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "HR is accurate as long as you hardly move and RHR is crap and sleep measurements are crap.....",
      "text": "This product is light, holds a good battery life and has some O.K. features. My biggest gripe is that if you are doing any active movements; basketball, CF, HIT, ect it is absolutely terrible in measuring your HR. I would have returned it, but took to long to make this decision. A lesser beef is the sleep function. If you become sedimentary; reading a book or watching a movie, and it is close to your bed time it decides that you are asleep. Overall, not impressed.",
      "rating": 1.0,
      "verified": true,
      "author": "Improving",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Huge issues with altimeter accuracy (a common problem)",
      "text": "Four months into ownership, the altimeter started acting crazy. I'd go 2-3 thousand steps around the office and it would claim I've climbed 40+ stairs. My bike ride climbs would be inflated 4x relative to what Google and Strava would suggest. The atmospheric altimeter is a common problem for the model and makes an otherwise decent watch useless. I would advise against buying any Garmin watch with an atmospheric altimeter as a result of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kiril K. Kolev",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great purchase, no issues with use.",
      "text": "Honestly haven’t had any issues. I’ve had it for four months now and everything works great. After playin around on the watch, you get the hang of it and it is great to use. Since technology is hit or miss sometimes, I did get the extended protection plan and extra Glass screen covers for accidents.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole C",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Very good value, but died young",
      "text": "I really liked mine while it lasted. It had a good feature set, battery life, and it seemed quite accurate. Sadly, the accelerometer died when I'd owned it for just 9 months. Working with Garmin to get a replacement now.",
      "rating": 3.0,
      "verified": true,
      "author": "MarkPaine",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Worth the upgrade",
      "text": "I uaed a vivofit he plus for about 3 years. Wanted to upgrade to a nicer watch and I'm glad I did. Battery could last a little longer but it does charge fast. Step count is pretty close but the heart rate is sometimes off. Over all it was worth the o Upgrade",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Preferred over my Garmin HR.",
      "text": "Garmin HR broke, had to pick up a new watch. Prefer this one over the Garmin HR now. Had to change straps and put button to left--kept hitting the button on outside face during normal daily routines and operation. Shut off backlight so I don't see it come on anymore if it does.",
      "rating": 4.0,
      "verified": true,
      "author": "Derek Brousseau",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "This is a great watch! Looks really nice unlike many fitness watches ...",
      "text": "This is a great watch! Looks really nice unlike many fitness watches may not be quite enough for the most hard core of fitness enthusiasts, but plenty for everyone else. GPS is awesome, battery life great too. Tons of sports built in. I use it mostly for hiking, biking and golf. Nice also that you can get messages, answer or decline calls, track sleep, and I use the vibration to wake up every morning. Great too that you can easily change bands and watch faces to dress up the watch for evening's out. All of that and it's waterproof! Best overall value for the price out there in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Schinkel",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Very functional fitness watch.",
      "text": "This is what I was looking for. Easy to use user interface, quick access to fitness functions and doesn't look like an electronic gadget like a lot of the others. It's also the size of a typical men's watch.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Weber",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Altitude and heart rate readings are way off",
      "text": "The altitude reading are completely whack. At first it was all over the place. Reporting 500m elevation on a flat 5km run. Then some software update completely zero'ed out the altitude metering readings so it just reported 0m elevation on all runs. The heart rate monitor is also all over the place. Sometimes when I'm really exerting myself it reports a heart rate as low as my resting heart rate.",
      "rating": 2.0,
      "verified": true,
      "author": "Jansen",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great watch, bad wristband",
      "text": "I like everything that the watch itself can do, from running, to cycling, to rowing. It tracks all of my sports pretty well. I don't entirely trust the wrist HR monitor, but I have a chest strap for when I have a serious interest in accurate HR monitoring. My one real issue with this is the wristband. I get rashes from it and have to change wrists/take breaks from wearing the band constantly. I'll probably just get a replacement band eventually, with a different material. It's just frustrating, and slightly concerning given that I have no other allergies to anything.",
      "rating": 4.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "4.5 - Little room for disappointment",
      "text": "It's not 5 stars because there is no perfect Smartwatch out there, but, this one comes close. I moved up from the Vivoactive HR and haven't regretted it. I'm not in the Apple club, so that watch was not an option. I wish the on-wrist heart monitoring was better, but the technology just hasn't been able to match wearing a chest strap.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Ransom",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Great Features, Poor Battery Life",
      "text": "I use it mostly for hiking, back country skiing, golf, and have yet to use it surfing. Battery life is not great if you use it for tracking an activity, which is the point of the watch. I could care less about the text updates and stair flight widgets. Good news is you can turn those off. I wish that I could choose back country skiing as an option on my watch versus having to go into Garmin Connect and change the information or use Strava through my phone. All in all I love the watch but was looking for something I could customize my activities a little more.",
      "rating": 4.0,
      "verified": true,
      "author": "Theodore ",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Fantastic Surprise",
      "text": "My purchase was really due to the deal on Prime Day and the fact that I was training for a marathon but I have been fully surprised with this watch. Originally I did not expect to wear it everyday however that changed after the first week when I saw how it tracked your intensity for the week as well as your steps each day. An incredible piece of software for the budget-friendly athlete who is looking to track performance over time and the app syncs very well with the watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Rubbish!!!",
      "text": "It sucked for working out... It wasn't tracking my heart rate and steps properly, therefore it wasn't tracking my calorie burn properly either.. I called both Amazon and Garmin. Garmin did some trouble shooting...it seem to work for a couple of days...then it started doing the same shit all over again.. I had to return it!!!! Had it for almost a month...and it started acting up almost immediately after buying it.... And that was my second vivoactive in 6 weeks!!! Wish I could give it a zero/no star for working out... IJS!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa McFarlane",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "This is a nifty little watch",
      "text": "I love the GPS tracking - thats why I bought it. The distance on a hike does drift up some when standing still, but I understand that because of the way GPS works, and is expected on a \"consumer\" level GPS device. The app on my iphone and PC work very well, user friendly, and fun to use. I like my watch a lot, and would purchase it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "DO NOT BUY; Cheapest, buggiest POS I've ever owned",
      "text": "Screen quality below average. On top of that, any apps downloaded from their cryptic store would not work on device. Tried firmware update, factory reset, nothing would work. Looking at their forums, and the volume of issues Garmin has with its watches convinced me to never purchase anything from them again.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrei Voicu",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Wrist HR is garbage",
      "text": "I wanted to like this watch. It's smaller than some other models and good looking on my wrist. But I got it for training purposes and the wrist heart rate monitor is garbage! During exercise, whether that's swinging kettle bells or running the HR jumps all over the place. One second I'm at 68 BPM while running and the next I'm up to 130 and then back down to 80. It's really frustrating. If you're looking for a watch and you need accurate HR data I would look somewhere else.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Good, with flaws",
      "text": "I want to like this watch. It is nicely styled, but it has some flaws. It keeps losing connectivity with my watch and has to be re-synched. It also just seems to lose settings, like weather, or notifications and has to be reset. Finally, the touch screen is overly sensitive and will change screens and settings without being touched by my finger. I’ve had to lock the screen to keep this from happening when swimming.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary Warson",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Replaced 3yr old Garmin Vivo",
      "text": "Replaced 3yr old Garmin Vivo with this unit, nice watch for monitoring all activities and heartrate. Makes an excellent watch also. Looks good with any attire due to color. Nice slim profile..",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Jackson",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "I love this watch",
      "text": "I upgraded from the Vivoactive HR 2. I love this watch ! It is very light and comfortable on the wrist. I use it primarily for running, biking and stair climbing. It's a nice strip up from the 2.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike ",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "If you have large wrists, but another band!",
      "text": "While the Vivoactive 3 is smaller the 20mm band does not seem a good size and should be 22mm. Also the band that comes with the watch will not fit those with larger wrists so you might as well buy a larger band. I returned mine, disappointed with the band.",
      "rating": 2.0,
      "verified": true,
      "author": "Greg in Jax FL",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Garmin Vívoactive 3",
      "text": "I'm really pleased with this watch/GPS device. The information displays can be changed to a variety of preferences, it tracks my activities well and the Garmin Connect app provides a wide range of data feedback. I purchased this primarily for running activities, but have found myself using it for tracking mountain bike rides, skiing, walking, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "sev",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Good purchase, with minor issues",
      "text": "Decent watch for the money paid. I love using it for running as well as being able to make my own workouts. Only complaint is that it’s not super accurate for other workouts - I.e. HIIT training, Pilates and strength yoga. Also it’s spazzed out on me a couple of times, even though I’ve only had it a few months.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "A bad rash from the strap",
      "text": "My husband loved this watch but he got a very bad rash on his wrist, he tried the other wrist same problem plus never had a problem with watches with rubber straps before. He called customer service but got the run a round and to make matters worse we can't return the watch to Amazon as the 30 day warranty expired. , tried the other wrist same problem. He called customer service and they",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda Cannon",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Failing to track run",
      "text": "I've bought this watch a year ago. I'm expecting it to be able to track a standard run. However, the watch will stop GPS tracks after a while and give you wrong pace and distance. It is a basic feature, so it is a huge disappointment and makes it useless. I already had one exchanged and the new one got the same issue. Customer support is helpless.",
      "rating": 1.0,
      "verified": true,
      "author": "Bl4ckc4t",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "The perfect fitness watch",
      "text": "I love this watch! I wear it every day. I love that I’m able to customize it to all of my favorite activities. I also love the gps function and I love how easy it is to manage the app. The watch is delicate enough to be worn for a smaller wrist and not have it be too big and bulky that it gets in the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Riahtesch",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "easier to operate",
      "text": "my wife has always liked garmin products. this item looks good but is kind of difficult and frustrating to use. we will keep trying.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Basic model... For this price.. can be better",
      "text": "I liked this ... basic model... no color dosplay... works good... But my Friend bought Garmin sports model for 50$ in some offer.... which broke my heart...",
      "rating": 4.0,
      "verified": true,
      "author": "Su",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great overall fitness watch. Needs some heart rate tracking inprovement.",
      "text": "Its pretty good. The golf tracking is amazing. The heart rate tracking sucks. Even shaving my arm under the sensors didnt help. Did a ton of research and just never works right. Mybheart rate registers 156 on the treadmill sensors running at 6.0 for 5 min and the watch says 90 bpm. Dont think so. The sleep tracks pretty good though. Matches the apple watch. Wore both. One on each arm. The Apple Watch def tracks heart rate better.",
      "rating": 5.0,
      "verified": true,
      "author": "EricOn10",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Good fitness device, not so great watch faces",
      "text": "As far as fitness watches go this has been a good investment. The only negative I'd say is that the watch face options really arent very good, especially for the price of the watch.",
      "rating": 3.0,
      "verified": true,
      "author": "John K.",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "I had the last iteration of this watch and this ...",
      "text": "I had the last iteration of this watch and this is a big improvement. The only negative is the scroll is too sensitive. A shirt sleeve will change the face or function on you. I keep mine locked most of the time especially when sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson Ehrlich",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Good Watch",
      "text": "So far so good. This is a good watch and so far it has not let me down. I owned an older version of a Garmin product and really like it and their app. This newer version is just as good as the old one, with more bells and whistles. I really like this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "I love the fit and look of the watch",
      "text": "I just upgraded from a Vivoactive HR 2 to a Vivoactive HR 3. Overall, I love the fit and look of the watch. Features all seem to be working great. I run, do other cardio and some strength training with the watch. My only concern is that the 'gunmetal' coating around the watch face began to wear off after about 5 days of use. Garmin does not cover this wear in their one year warranty! Amazon was able to help me with a replacement. We'll see how it works out!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great watch",
      "text": "Everything else it does is a bonus. This thing only comes off when I take showers. The battery will easily last me 4 days and it charges in under 40 minutes. I'm not sure how accurate the heart rate monitor is but it is nice to have a baseline.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisha",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Horrible battery life.",
      "text": "This has been the most frustrating piece of electronic equipment I have ever owned. Battery life only last two days. I have researched and did all the troubleshooting that my research indicated. And still, the battery only last two days. I have turned off every feature this watch has, and the battery still dies after two days. I have downloaded the most recent update as well. I’m at the end of my rope and I’m about to send this watch back.",
      "rating": 1.0,
      "verified": true,
      "author": "Tresa Milite",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Reliable, user friendly and clear watch face.",
      "text": "I use the product mainly for running and swimming and it’s accurate and reliable. The display is clear and easy to read. There is a lot of interesting data concerning health that I didn’t expect and very happy to see such things as stress level, VO2 Max etc. it helps make keeping fit and healthy an interesting and enjoyable hobby!! Can’t be bad!! 😁",
      "rating": 5.0,
      "verified": true,
      "author": "David Cooper",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Nice Garmin",
      "text": "Great watch, I use it to play golf, bike and tenis and work perfect, just need to know how to manage battery so could last longer. The only thing for me is that the original band is a little small but Ive already found great bands on amazon. I used to have a Fitbit and like this more than my fitbit, although the fitbit is better for measuring sleep and steps.",
      "rating": 4.0,
      "verified": true,
      "author": "Estuardo Erales",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Love it!",
      "text": "Love this item. Was using a fitbit for years until the charge 3 came out and they were less than helpful with the defective item. Bought this garmin as a replacement and have not been disappointed. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "slsst48",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Best fitness watch out there!",
      "text": "Great fitness watch for just about anyone! Fits great without being too bulky like a lot of fitness watches. Garmin makes a solid watch that looks good with nice clothes all the way down to my cycling get up. Highly recommend for folks that like to track their fitness stats. GPS connection helps track routes as well for cyclists and runners.",
      "rating": 5.0,
      "verified": true,
      "author": "Biquey",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Does all the basic things very very well",
      "text": "I wish they were a little more to the analytics that the Garmin app provides. But all in all great watch . Good GPS for running in biking. Good for swim lap counting.",
      "rating": 4.0,
      "verified": true,
      "author": "Arman398472",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Too complicated",
      "text": "I returned it because we couldn't figure out how to use it. I have an apple watch and this was for my husband. It's crap and def you get what you pay for which is $150. I am used to the apple watch which doesn't look like analog and so simplistic. Just spend the extra money and get something that actually works.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Odenthal",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Great all around smart watch",
      "text": "Great gift for the hubby who loved to work out and play sports and keep active. I gave it to my hubby for Xmas and he is completely in love with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200112
    }
  ],
  "product_meta": {
    "title": "Garmin vívoactive 3, GPS Smartwatch Contactless Payments Built-In Sports Apps, Black/Slate",
    "description": "Pattern Name:Single| Style:Standard| Color:Black with SlateNote - To extend the life of the battery: reduce the backlight timeout, reduce the backlight brightness, turn off Bluetooth wireless technology when you are not using connected features, turn off activity tracking, limit the smartphone notifications the device displays, stop broadcasting heart rate data to paired Garmin devices and turn off wrist-based heart rate monitoring. From playing to paying, vasoactive 3 is the smartwatch for your active life. Make mobile payments with ease, right from your watch, and with more than 15 preloaded sports apps - you can choose how you like to get fit. Built-in GPS lets you record the distance, pace, location and more for your outdoor activities. Physical size - 43.4 x 43.4 x 11.7 mm. Fits wrists with a circumference of 127-204 mm. Display size - 1.2 inch (30.4mm) diameter",
    "rating": 4.4,
    "feature_bullets": [
      "More than 15 pre loaded GPS and indoor sports apps, including yoga, running, swimming and more; Lens material: chemically strengthened glass, bezel material: stainless steel, case material: fiber reinforced polymer with stainless steel rear cover",
      "Monitor your fitness level with VO2 max and fitness made estimates, plus keep an eye on how you handle stress; Fits wrists with a circumference of 127 to 204 millimeter",
      "Get connected features such as smart notifications, automatic uploads to Garmin Connect, LiveTrack and more when paired with a compatible smartphone",
      "Battery life: up to 7 days in smartwatch mode; 13 hours in GPS mode; Connectivity Bluetooth Smart and ANT plus. Smartphone compatibility iPhone, Android. Display size:1.2 inch diameter",
      "Garmin Pay contact less payment solution lets you pay for purchases with your watch (available for supported cards from participating banks)",
      "Personalize your watch with thousands of free watch faces, apps and widgets from our Connect IQ store.; Memory/History : 7 timed activities, 14 days of activity tracking data"
    ],
    "specifications": {
      "Product Dimensions": "1.7 x 0.5 x 1.7 inches",
      "Item Weight": "1.44 ounces",
      "ASIN": "B074K9HNXD",
      "Item model number": "010-01769-11",
      "Batteries": "1 CR2 batteries required.",
      "Customer Reviews": "4.4 out of 5 stars1,916 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#1,509 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "GPS",
      "GPS": "True",
      "Other display features": "Wireless",
      "Colour": "Black with Slate",
      "Included Components": "Documentation, Vivoactive 3, Charging/data cable",
      "Department": "Unisex-adult",
      "Manufacturer": "Garmin",
      "Date First Available": "August 31, 2017"
    },
    "categories": [
      "Electronics",
      "Wearable Technology",
      "Smartwatches",
      "All Departments"
    ],
    "price": 162.07
  }
}