{
  "website_summaries": [
    {
      "verdict": "Charge and listen at the same time with this unique MFi-certified Apple adapter.",
      "pros": [
        "Two-in-one functionality allows you to charge and listen simultaneously through a single Lighting port",
        "It features an authentic MFi certification, meaning it's been designed to meet Apple specifications",
        "The sound quality is great, and it supports remote control and microphone inputs from MFi headphones"
      ],
      "cons": [
        "This adapter is larger than others, so it may be uncomfortable to carry in a pocket"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Junk",
      "text": "So it’s guaranteed to work with iPhone? I think not. Yet another piece of junk. For $35, I expect it to work.",
      "rating": 1.0,
      "verified": true,
      "author": "zyggistardust",
      "helpful_votes": 168,
      "publication_date": 20180914
    },
    {
      "title": "RUN JUST AS FAST AS YOU CAN FROM THIS GARBAGE",
      "text": "Absolutely junk! It worked fine for about 6 weeks and then quit working for the to talk on phone calls and then within another week it quit all together. Keep your money. You have 30 days to return it and it dies 2 weeks later. I can't believe that Amazon will sell junk like this. Added on February 12, 2018. Belkin did send me a replacement which lasted a whole 4 months and died the same way. So, still 1 star and RUN JUST AS FAST AS YOU CAN.",
      "rating": 1.0,
      "verified": true,
      "author": "David in Georgia",
      "helpful_votes": 126,
      "publication_date": 20170714
    },
    {
      "title": "Not what they should be for this price.",
      "text": "Expensive and stopped working reliably a few months after buying. Wouldn't have minded if they were no-brand crap that I bought for $10, but if memory serves, I paid close to $40 for a Belkin brand, Apple-certified product for my wife and found out a few months later that it had stopped working. Felt ripped off and disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Sexton",
      "helpful_votes": 66,
      "publication_date": 20180724
    },
    {
      "title": "Worked great...",
      "text": "Worked great for 2 months, then died. Highly disappointed, and I'm outside Amazon's return window.",
      "rating": 1.0,
      "verified": true,
      "author": "Batman",
      "helpful_votes": 174,
      "publication_date": 20170403
    },
    {
      "title": "Lasted 4 hours",
      "text": "This thing worked great for about 4 hours. After that I started getting interference through the speakers whenever I plugged in the charging cable. The audio sounded great when I wasnt charging. Basically making the thing useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 43,
      "publication_date": 20181029
    },
    {
      "title": "worked for 6 months",
      "text": "It worked perfectly for about six months. I used it every night when going to bed, plugged the phone in for charging and listened to a TV show with earbuds while my wife slept. Recently it started losing connection with the earbuds, any slight movement and connection is lost causing the show to pause. In order to get it to work again I have to disconnect the earbud, play the show through the speakers (which disturbs her sleep) then plug them in again, only to lose connection when trying to set it all down. For $40 I wished it lasted at least a year.",
      "rating": 2.0,
      "verified": true,
      "author": "W. Gordon",
      "helpful_votes": 49,
      "publication_date": 20170330
    },
    {
      "title": "Lasted less than 3 months",
      "text": "Bought this product because I was tired of replacing the cheap ones every month. I decided to just spend more up front & expected it to last! It's been less than 3 months & it's not working anymore. I could've just spent less buying cheap ones every month! Super bummed about this, I was really excited to get a quality product!",
      "rating": 1.0,
      "verified": true,
      "author": "Kelli Donna",
      "helpful_votes": 28,
      "publication_date": 20190505
    },
    {
      "title": "It just doesn't work as intended.",
      "text": "This thing sucks. I purchased two of these, one for myself and one for my wife. We use our iPhones as our naviagators in our cars, but we only have AUX jacks in our cars. This thing seemed like the solution we needed since GPS eats up iPhone batteries. Nope, any slight movement, the audio drops out or it stops charging. This happens on both our units. So if you want to switch the song on your phone, or check the map, you are risking the connection to your audio system dropping out. It looked like a great product, and Belkin is usually good on products, but this was just a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Tadros86",
      "helpful_votes": 38,
      "publication_date": 20170603
    },
    {
      "title": "Does not last",
      "text": "Very disappointed. Surprised at the poor quality, given my previous positive experiences with Belkin. This worked great for 6 months, and then the sound stopped. Suggests cheap manufacturing and a dilution of a formerly reputable brand. Update: I'm a glutton for punishment, so I tried a second of these Rockstars. This one failed within a couple of weeks, so at least I can return it to Amazon. I'm very disappointed in Belkin; they used to have a good reputation for making good reliable products. But no more. If this poorly-made but slickly-produced adapter is representative of Belkin corporate culture, then they have outsourced quality. I'll avoid Belkin products in the future based on my miserable experience with this adapter.",
      "rating": 1.0,
      "verified": true,
      "author": "ID2002",
      "helpful_votes": 18,
      "publication_date": 20181205
    },
    {
      "title": "Bulky and not good",
      "text": "It works. But it's bulky and occasionally the audio will cut out randomly. I know it works better then the less reputable brands on here...and I'm glad I got it. I just wish is was smaller and more reliable. Edit: I've had this for less than three months and it's already broken. It's too big to just hold your phone with it and the cord connecting it is too Flimsy. I wish I could get my money back or a better replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "A.Treat",
      "helpful_votes": 21,
      "publication_date": 20170627
    },
    {
      "title": "Worse than the knock-offs",
      "text": "This thing was awesome for about 30 seconds. Then a static pulse sounds came on and although I could alter that static somewhat (higher pitch, lower pitch, etc) by unplugging and replugging things, I couldn't get it to go away. I tried a different set of headphones (Apple) and then this adapter didn't work at all. I don't even get the \"may not be compatible\" message that some of the non-Apple certified generate after a couple minutes. So...while I was hoping this device would be the answer to the glaring design oversight on the iPhone, I seem to be one of the unlucky ones for whom this device doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "JAJ",
      "helpful_votes": 9,
      "publication_date": 20190403
    },
    {
      "title": "One Star",
      "text": "Worked fine for exactly four months then it would only charge - no audio. Terrible quality!",
      "rating": 1.0,
      "verified": true,
      "author": "Carlisle Percival",
      "helpful_votes": 23,
      "publication_date": 20170420
    },
    {
      "title": "Lasted 6 weeks",
      "text": "Lasted 6 weeks and then crapped out. Doesn't work any longer. I'm giving it 2 stars because when it did work it worked, but the length of time it lasted for $40 is rediculous.",
      "rating": 2.0,
      "verified": true,
      "author": "Becky-NY",
      "helpful_votes": 21,
      "publication_date": 20170321
    },
    {
      "title": "Does not work with iPad pro",
      "text": "Does not work with my iPad pro, does not divert sound to headphones. Belkin SPECIFICALLY CLAIMED it would work with the iPad pro in the questions section, despite the fact that this is clearly not true. Sending back. Wasted time. I have used Belkin products extensively over the years, but something seems to have changed here, and I will look elsewhere in the future.",
      "rating": 1.0,
      "verified": true,
      "author": "A. R. Price",
      "helpful_votes": 8,
      "publication_date": 20200211
    },
    {
      "title": "Only worked for 5 months, buy cheaper version",
      "text": "I purchased this product as Belkinis a name I normally trust in electronics and peripherals. I was sorely disappointed in this products durability. I used it to charge and listen and out of the box it worked just fine. The problem is that the 3.5mm jack stopped working by November 2018. It was purchased at the end of June 2018. Basically I got 5 months use out of this product. I paid the $33 price tag instead of buying a cheaper knockoff because I expected it to last. Going forward I will buy the cheaper version and even if I buy 2 a year I am still ahead of the game. Belkin, you disappoint with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Perry Levenson",
      "helpful_votes": 9,
      "publication_date": 20190405
    },
    {
      "title": "iPad Does Not Work",
      "text": "Received for iPad Pro. iPad does not recognize the device or the headphones plugged into it. No mic, or headphone, or earbud functionality. iPad playback is all through the iPad speakers and mic through iPad mic.",
      "rating": 1.0,
      "verified": true,
      "author": "am",
      "helpful_votes": 8,
      "publication_date": 20200114
    },
    {
      "title": "Turned Out Dissapointing",
      "text": "I only used it for a few weeks before it stopped working. The smallest movement will cause music to pause or play through the speakers. It’s like it doesn’t register the lightning chord at all. It is either faulty or the inner wires are so delicate, normal wear and tear have caused disruption in the current. Really dissapointed in the product for the cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Meredith Yager",
      "helpful_votes": 12,
      "publication_date": 20180420
    },
    {
      "title": "I like to listen to earphones while I sleep",
      "text": "I have owned two of these. I got the first right after buying an iPhone 7. I like to listen to earphones while I sleep, and don't want to drain the battery. The first one failed after a month or so. That is, it the earphones failed intermittently when plugged into the charger and the iPhone reverted to its external speakers. It did this when the charger was moved. I bought another, but It failed after 6 months; same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "JFS3",
      "helpful_votes": 13,
      "publication_date": 20170914
    },
    {
      "title": "Works - but not for long",
      "text": "UPDATE- I’m back to buy my third. They’ve lasted less than 6 months EACH with gentle use. Hate Apple doesn’t have means to charge and listen to earbuds except through 3rd party seller. Company should replace this since this is my third time buying the short lived item.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 9,
      "publication_date": 20180702
    },
    {
      "title": "Terrible product. Stopped working after three months.",
      "text": "Three months in and it's not working anymore. It is apple-approved, no popups which I thought was great, until it stopped working. Return window is only one month FYI.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Addison",
      "helpful_votes": 13,
      "publication_date": 20180419
    },
    {
      "title": "Defective product we are forced to need!!",
      "text": "Had to pay for and replace this item four times. There is a defect in its design where the wire casing gets loose and then the wire can bend. This is the Apple official splitter. You would think they’d have quality checked and ensured this would not happen before forcing people to need this accessory. If I could give zero stars, I would. Bad form!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Deb P.",
      "helpful_votes": 9,
      "publication_date": 20180615
    },
    {
      "title": "Frustratingly disconnects spontaneously and won't charge.",
      "text": "It constantly connects and disconnects, even if it is not moving. I have it on my office desk, and I have to check it constantly to make sure it is charging. I just re-read some of the reviews, and I realized that this is a known issue. I would have hoped that Belkin would have solved the issue by now. I am outside of the return window, so I have basically lost $40. I just noticed that there are other brands out there with 4+ star reviews at half the price,",
      "rating": 1.0,
      "verified": true,
      "author": "CM477",
      "helpful_votes": 9,
      "publication_date": 20170627
    },
    {
      "title": "Belkin doesn't know their own products",
      "text": "I specifically asked Belkin if this was compatible with my OnePlus 6T phone. They replied that it is compatible if it's usb-c. I received this today and the box is very clear that it's compatible with only 5 brands. Mine is not listed. Tried it anyway. Nope, it won't charge. I have been trying to find an adapter that is compatible with my phone to no avail. I give up. They don't make them for my phone. It's really shocking that in today's day and age, I can't find a simple adapter for my phone. Very disappointed. Back it goes.",
      "rating": 1.0,
      "verified": true,
      "author": "Sabrina Lamoreaux",
      "helpful_votes": 2,
      "publication_date": 20200618
    },
    {
      "title": "Seems legit so far",
      "text": "I purchased a “used like new” version of this item for 10 bucks less than retail. So far seems legit and works great. Pros: audio is clear, no static, popping, or crackle. Appears to be genuine belkin product. Cons: none really as of yet. On first plug in to phone, iPhone said unlock to use device. Hasn’t asked again since the initial plug in. So not really a con, just a heads up. Rated 4 stars due to the high retail price, will upgrade to 5 stars if this adapter continues to work properly. Will update with any changes.",
      "rating": 4.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 4,
      "publication_date": 20190611
    },
    {
      "title": "Bings audibly when wiggled.",
      "text": "This does the job. The earphones work great while the phone also charges. However, there is a big negative in that if the phone wiggles, the phone makes bing noises, like that bing it makes when the charger is first attached. This is a drag at night because others hear it. On the previous iPhones, 4 and 5S, if the headphone was in the headphone jack, any sound from attaching the charger was silenced. With this adapter, it’s not silenced. Again, if attached, the bing sound occurs every time the phone wiggles. Troublesome during the night.",
      "rating": 3.0,
      "verified": true,
      "author": "KTZ",
      "helpful_votes": 3,
      "publication_date": 20190415
    },
    {
      "title": "Belkin customer service is amazing. Unfortunately",
      "text": "First and foremost, Belkin customer service is amazing. Unfortunately, the item experienced problems after it was in use for a little over 60 days (the headphone input stopped working) but Belkin handled it like pros and I got a replacement in less than a week. Although it was disappointing that there was a problem in the first place, knowing that Belkin stands behind its merchandise makes all the difference. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "RagingRockstar",
      "helpful_votes": 7,
      "publication_date": 20180322
    },
    {
      "title": "meh",
      "text": "Pros: - Allows you to charge your phone and use your headphones at the same time - Works with headphones with 3 button controls and a mic - No static, hiss, or pops while listening to music or on a phone call Cons: - Bulky, a hassle to carry around for daily listening - Poor sound quality. The mids and highs are boosted and the bass is muted. Had I known that the sound quality was this bad, I would have bought a separate DAC. - Background noise is picked up by headphone mic Durability is TBD. Unfortunately there aren't any other better options on the market... But if you find one, lemme know!",
      "rating": 3.0,
      "verified": true,
      "author": "amazon fan",
      "helpful_votes": 3,
      "publication_date": 20191205
    },
    {
      "title": "Not happy.",
      "text": "We got this on January 7, 2018. It is now February 20, 2018 and it has stopped working. The audio does not come out of my earphones, it comes right out of the phone. This is an issue when I want to charge my phone while listening to something in the car over the sound jack. It's also an issue when I want to listen to something when my husband is sleeping. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Dwight Eichelberger",
      "helpful_votes": 10,
      "publication_date": 20180220
    },
    {
      "title": "I just got electrocuted by this thing!",
      "text": "I heard it like static, then it shot out sparks, then my ears started getting hit with little bits of electrical currents, sharp and fast. I threw it off and unplugged it. It's black inside. I had it connected to a USB-C LG Ultrafine port using a genuine Apple cable and Apple headphones. Holy heck that was scary! Belkin used to amazing. I have nothing but issues with them lately and this is beyond anything I've ever experienced with a tech product.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric David Greenspan",
      "helpful_votes": 3,
      "publication_date": 20190211
    },
    {
      "title": "Low volume and distortion. Avoid.",
      "text": "Substantially lowered the volume level where I had to turn the volume max on the phone and the car. On a regular aux cable my phone volume was on half and plenty loud. Having the phone's volume set so high caused distortion. Also, overpriced for something that barely worked. Only went with this adapter because it's one of the only name brand options. Returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20200322
    },
    {
      "title": "Piece of Junk",
      "text": "At the cost of nearly $40, this item is not at all worth the purchase. It was delivered on August 19, 2017 and failed - absolutely stopped working November 26, about eight weeks past the Amazon return window. Now I'm stuck with an expensive accessory (no thanks to Apple - but that's another rant) that is absolutely worthless. I treat my electronic items with care, so this item has not been dropped, twisted or abused in any way. I only use it with my bedside charger. My advice - don't purchase it. Or better yet, don't purchase Apple products without a headphone jack. Piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Nanci Holston",
      "helpful_votes": 7,
      "publication_date": 20171127
    },
    {
      "title": "Good product, very well made.",
      "text": "Love Belkin made products for Apple - they mostly work seamlessly and are well made. I saw this exact product at Target shortly after I bought it on Amazon, and surprisingly it was cheaper on Amazon (often not the case anymore...). There is no reduction in sound quality while using both ports. The slack of the cord is very itstiff, however, which took me by surprise, but I’m guessing that makes it more durable and will last longer. Highly recommend. Worth the higher price, imo. The others I looked at on amazon were cheaper but I like that Belkin and apple have worked together and I think that means they work better together overall. That’s just my opinion though.",
      "rating": 5.0,
      "verified": true,
      "author": "zachary lowe",
      "helpful_votes": 2,
      "publication_date": 20190127
    },
    {
      "title": "just as advertised",
      "text": "just as advertised. i bought one of these for my girlfriend about 2 years ago and it has served her well, but has recently started acting up. i suppose 2 years is a reasonable amount of time for a charging adapter to last when used in a vehicle almost daily for work commutes. anyway, needing to replace this cable i was surprised to see that it's $10 cheaper than they were 2 years ago. i don't see any reason this one won't last another 2 years.",
      "rating": 5.0,
      "verified": true,
      "author": "FAAR",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Product doesn't not work properly after 3 months",
      "text": "I purchased this product in December of last year. It worked great in my car for the majority of the time. Then all of a sudden I start hearing static. A week later the sound is barely audible over the massive amounts of static and weird noises the device creates when my aux cord is plugged in. For the price I paid, I expected to have a working product for at least a year if not more. This is unacceptable especially considering this is an Apple approved device",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Xavier",
      "helpful_votes": 3,
      "publication_date": 20190415
    },
    {
      "title": "Works great",
      "text": "I purchased another type of this and it didn't work at all so I was skeptical. This works like a dream. I have an older car that doesn't have blue tooth so I still have to plug my phone in to listen to audio-books and with the new iPhone changes not being able to listen and charge was an issue. This adapter has changed everything. I haven't had it for long so I can't really rate the durability yet, but so far so good. I am loving it.",
      "rating": 5.0,
      "verified": true,
      "author": "Boundless Book Reviews Sara",
      "helpful_votes": 3,
      "publication_date": 20181019
    },
    {
      "title": "Does not work! No audio.",
      "text": "Just got this today. It’s garbage. It doesn’t pass any audio. Sound still comes out of my iPad Pro’s speakers when plugged in.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Eric",
      "helpful_votes": 5,
      "publication_date": 20191016
    },
    {
      "title": "Finally! Can charge, and play music in my car at the same time!",
      "text": "Have been looking for a solution since Apple saw fit to remove the headphone jack from the iPhone. I refuse to use Bluetooth audio because it sounds horrible in my experience. Tried several other charge plus aux lightning adapters but none worked reliably. This is my setup- - short lightning cable and short aux cable plugged into BELKIN adapter and into my car aux port and usb power adapter (this all hides in my cars center console) -Belkin adapter plugged into a lightning extension cable (female to male cable) So I only have one cable coming out of my center console to my iPhone! Not elegant by any means, but Apple forced my hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris McGee",
      "helpful_votes": 4,
      "publication_date": 20180706
    },
    {
      "title": "Completely disgraceful. Avoid this completely.",
      "text": "Tested on a Note 10+. Absolutely wish I could award this zero stars. These simply did not work. I had two of them. First one failed within four days. was given a replacement and the second one failed within ONE DAY. This dongle cannot hold a charge. It frequently flickers from Charing to not charging. It's not my charger either. Without the dongle my charger holds a charge just fine and I even made sure to buy a brand new cable to make sure it wasn't my end. This thing is utter garbage and should be avoided like the plague. Get your act together, Belkin.",
      "rating": 1.0,
      "verified": true,
      "author": "Faisal Pk",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Don’t bother with the cheap knock offs.",
      "text": "I’ve gone through six or seven of the cheap ones and an additional six for my husband. The cheap ones work for about a week and need to be returned. Finally we just laid down the money and got the belkin and after a couple months they’re still going strong with no problems at all. It’s worth the extra money to not have to hassle with returning the knock offs.",
      "rating": 5.0,
      "verified": true,
      "author": "Flannel Rattlesnake",
      "helpful_votes": 2,
      "publication_date": 20191016
    },
    {
      "title": "Phone cuts in and out",
      "text": "I returned the first one because I kept getting the little tone like it would go from not charging to charging. The second one does the same thing. Now when I'm on a call I'm told my voice cuts in and out. I wish Apple had never removed the headphone jack to require this in the first place!",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 7,
      "publication_date": 20180702
    },
    {
      "title": "Good product",
      "text": "This is my 2nd dongle. It’s great!! I used the first one until it literally fell apart. I ordered this one to replace it and I love it. I can charge my phone and still use my aux. great for long road trips. We have an older radio that only get ones station at work. Sometimes I plug it in to my phone so we can have a change with Pandora. It’s great I can hook up my charger and we have music all day and my phone is fully charged as well. Great buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Less Than Two Weeks and it is Shorting Out",
      "text": "I have had this item for less than two weeks and it is shorting out.",
      "rating": 1.0,
      "verified": true,
      "author": "Dirk Gently",
      "helpful_votes": 10,
      "publication_date": 20170629
    },
    {
      "title": "Works as advertised.",
      "text": "So far so good. it works well, sounds good and my phone charges at the same time. I use it in my truck which does not have bluetooth so that I can keep the phone charged while i listen to music and use the navigation. Hopefully this lasts better than the cheaper versions I have owned before.",
      "rating": 4.0,
      "verified": true,
      "author": "David Moore",
      "helpful_votes": 5,
      "publication_date": 20171229
    },
    {
      "title": "It worked great for awhile",
      "text": "It worked for awhile great! So I bought another one. Unfortunately neither has lasted even a year. It is not very durable and now says accessory not supported and will not charge while talking on headphones. I was hoping with a more well known brand it would be better. I am going to reach out to their warranty dept and will update this if they are able to fix the problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs. B",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Update. Fixed. No Audio on iPad Pro 11",
      "text": "Update. I saw a fix for the no audio issue on iPad Pro. Shut the iPad down, plug in the adapter with only the audio jack connected, start up the iPad completely and then plug in the power. Worked perfectly for me after doing this.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Corman",
      "helpful_votes": 4,
      "publication_date": 20200207
    },
    {
      "title": "Worked perfectly for almost 4 months....",
      "text": "But then, out of no where, my iPhone said it did not support this accessory. I think the wiring came loose, but I only use this on my commute so it makes me question the overall quality of the build. Especially for the price. I was really happy with this unit (aside from the bulkiness) until it stopped working completely.",
      "rating": 1.0,
      "verified": true,
      "author": "Roberto Ramos",
      "helpful_votes": 6,
      "publication_date": 20180818
    },
    {
      "title": "It doesn’t charge phones.",
      "text": "I was very disappointed when I tried using this product. I read tons of reviews on a bunch of the cheaper audio/chargers and decided to go with this one because the cheap ones seemed sketchy. This one is made for Apple, so I thought it would be worth the money. WRONG. It plays the audio fine, but doesn’t charge the phone. It doesn’t even hold the charge where it was. I got this so I could listen to music on long car rides without my phone battery dying. No such luck. Definitely returning. Don’t waste your time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190505
    },
    {
      "title": "It Works!!",
      "text": "In always skeptical of these splitters. They all usually have a bad rep. I’m also a more hands on kindof guy and I like to see/test before I buy. My girlfriends mom has one of these and I gave it a try and it worked great!! It has an amazing build quality. I even tried my iPad charger brick (which supplies more power) with the adapter and it handles it well! I would recommend this product for anyone interested in getting a splitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Fettik",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "Not very durable or worth the price",
      "text": "We bought this item in April, it is now October and it is having connectivity issues. We thought that since we went with a \"reputable\" brand that we wouldn't have this problem so early on, but alas the issue persists. They only give you thirty days to return it so I guess we'll stick to buying another brand because something so short lived will definitely not work for us. Only six months of use is not worth the premium price they charge for this item. I would suggest spending your money elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Best splitter I’ve ever owned",
      "text": "After buying cheaper splitters that always broke in a week or 2 , because we all want quality for less but when it comes to this item just spend the money and get this one that works amazingly. I held off writing this review because I wanted to see if it would break but it hasn’t happened so defiantly worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "its unfortunate apple iPhone design requires you to need this ...",
      "text": "its unfortunate apple iPhone design requires you to need this kind of dongle. dongle itself works well - allows for charging of phone while i have a head set on. While apple vision is for everything to be wireless, the pain of keeping things charged outweighs the wireless benefit for headphones in my opinion - headphones and AirPods both have limited battery life. I use this dongle in the car so I can make business and family calls, and keep phone charged while I am on long commute to/from work...",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 3,
      "publication_date": 20171126
    },
    {
      "title": "No problems",
      "text": "I finally spent the extra money for a Belkin. I've gone through about 4 various brands of the cheap adapters. They either fail to charge or the audio line fails. They also, occasionally give you the non compatible warning. The Belkin has been working fine, with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "PH",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Just as unreliable as the cheap knockoffs.",
      "text": "After a bad experience with an off-brand power+audio lightning adaptor I gave up and bought this: sure it’s expensive, but it’s MFI ceritified and is the product Apple recommends for the purpose. It’ll be worth the cost, right? Hah. After barely three months, it stopped passing power through the lightning port. And amazon/belkin won’t take a return or exchange. So that’s a nice paperweight I’ve bought.",
      "rating": 1.0,
      "verified": true,
      "author": "Nathan M.",
      "helpful_votes": 5,
      "publication_date": 20180203
    },
    {
      "title": "Not worth the money",
      "text": "The product did not charge while playing music through the phone in my car. OR if it was charging the music wouldn’t play. It was very disappointing considering the price.",
      "rating": 1.0,
      "verified": true,
      "author": "Murph",
      "helpful_votes": 3,
      "publication_date": 20190428
    },
    {
      "title": "Sturdy and reliable",
      "text": "This works as good as expected. Charging while having the ability to listen to audible on my long commute, I am very pleased. I drive an older model Volvo convertible, and it does not have Bluetooth so this adapter is a must for me. Sturdy and reliable, I’m very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "craig lorom",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Feels like an Apple product and works like one too.",
      "text": "I had bought two different cheapo adapters that should have done the same thing as this. They felt like junk, and in fact, they were junk - plugging head phones in didn't stop the sound from coming out the speaker. This Belkin item looks and feels like an Apple product. In fact, when you ask in the Apple store, they don't have an Apple version of this, and they recommend the Belkin version. It works perfectly. It's worth spending the extra money. In fact, in my opinion, you have no choice if you want one that works.",
      "rating": 5.0,
      "verified": true,
      "author": "Virtuallw",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Belkin always creates a nice product. I bought another brand to begin with ...",
      "text": "Worked as expected. No error messages on the phone for compatibility. Belkin always creates a nice product. I bought another brand to begin with and should have known better. Errors with it. Next time I wait for the Belkin to come out.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Floyd",
      "helpful_votes": 5,
      "publication_date": 20170927
    },
    {
      "title": "Grrrrr",
      "text": "Well it worked long enough for my return time to run out. Now I'm getting the typical accessory message from my iPhone. And it just automatically goes from playing music on the aux to sound coming from the phone. And the charger is kind of on and off.",
      "rating": 2.0,
      "verified": true,
      "author": "Gel",
      "helpful_votes": 6,
      "publication_date": 20170422
    },
    {
      "title": "Don't waste your money",
      "text": "The concept of this is great but it's a complete waste of money. It charges at a snail's pace, when it even works to charge. Half the time I think it's charging and I look only to realize it hasn't been charging the entire time. It does seem to work with the headphones but when I work from home and need to charge and make calls at the same time, this is not the product that will work for that.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Ciner",
      "helpful_votes": 4,
      "publication_date": 20170425
    },
    {
      "title": "The first one broke...and the second one broke, too",
      "text": "After a couple of months of use the sound stopped working periodically, presumably because the wiring inside the cable was breaking. A week or two later it stopped working altogether. I ordered a second adapter and the exact same thing happened again. I'm not particularly hard on devices and adapters...I think it's just not made well enough to stand up to daily use. Not really acceptable for an accessory that's this expensive. Sound quality was good while it lasted.",
      "rating": 2.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Now I can listen to podcasts in my old car",
      "text": "I drive an older car, 2009 Hyundai Sonata. With my iPhone 6S Plus, I used an adapter connected to the headphone jack to listen to my music and my podcasts. A separate charging jack allowed me to connect the phone to my car charger. Recently got an iPhone 11, but there is no headphone jack. This adapter helps me listen to my music and podcasts while driving and charge my phone. Great solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Pittsburgher",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "And at first it worked great, but now a few months later the audio ...",
      "text": "I bought a few of these to replace other brands ones that didn't work at all. And at first it worked great, but now a few months later the audio jack is starting to have severe static, just like all the other brands I tried. And the belkin was much more expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonah L. Walker",
      "helpful_votes": 3,
      "publication_date": 20180622
    },
    {
      "title": "My go to!!",
      "text": "This is by far one of my best purchases! After I upgraded to the X over two years ago I bought this and have used it countless times and each time without fail someone asks me about how long it has lasted me or what that is. Never had an issue even though I’ve used it for so long across multiple devices. I’m so glad I spent a bit more for the belkin one instead of the splitting ones or an off brand I would have to replace many times. Definitely a good buy and an amazing helper while traveling!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Stops working after 6 months",
      "text": "I’ve had this adapter about 6 months. It gets minimal wear as I only use it at the office, probably 1-2 hours a week. It has stopped working. I would not recommend this to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Jae Oahu",
      "helpful_votes": 6,
      "publication_date": 20180713
    },
    {
      "title": "Same issues as others are having",
      "text": "I seem to be having the same issue as other negative reviews here: the power/audio cuts out if the adapter is wiggled or phone is moved just ever so slightly. Another wiggle and it comes back. Keep in mind, it's not like the adapter's cable is being bent 90 degrees or anything. Just a slight nudge and it loses the connection. I've come to not trust the adapter when using it with my EarPods for business calls and want my phone to stay charged. Unfortunately, this is exactly why I bought the adapter.",
      "rating": 2.0,
      "verified": true,
      "author": "broys",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Does not live up to the price",
      "text": "I have bought this product 2 years ago and invested some more money on purpose thinking that I would get a durable product. Unfortunately it just broke and I don’t want to buy it again since I have had problems with it during these two years. It would not work sometimes and I would have to play around with it. So I would not recommend buying this item.",
      "rating": 2.0,
      "verified": true,
      "author": "Geraldo",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Finally I can drive, listen and charge at the same time",
      "text": "Bought the Iphone 7 after my 6 fell and cracked on the airport entrance. Spent a year plus alternating between Spotify playing and charging since the other splitters didn't work. This one came out, I decided to cough up and give it a try too. It works great. I can play on my 2006 Prius using the 3.5 mm cable and I can charge at the same time. 1 out of 10 times I need to plug and replug and it works. 9 out of 10 times works immediately. #byebyeradiocommercials",
      "rating": 5.0,
      "verified": true,
      "author": "Saar Harel",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Just what I needed",
      "text": "This little thing is just what I need to charge and listen to my music and way cheaper than airbuds. It’s a hair bulky and I would suggest an improvement would be to remove the cording and just have the little dongle. Overall it gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Baxter",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Belkin quality you’d expect",
      "text": "Exactly like you see in picture. The cord is think & sturdy, nothing flimsy here. The sound is clear, no static or crackling. A little expensive, but considering what the knockoffs have to offer, and the quality that Belkin delivers, I don’t think it’s that bad. It’s just too bad that Apple took away the separate ear jack from their iPhones.",
      "rating": 5.0,
      "verified": true,
      "author": "pea dee",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Consistently reliable!",
      "text": "This is more expensive than no-name versions but it works consistently and reliably. I don’t use a Bluetooth so needed the audio jack and need to keep the phone charged on long trips, both for listening to books and music AND to use my GPS system. The no name versions would cut out, usually at the worst moments. There are times when you get what you pay for, and for reliability, this is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Book reader",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Honestly extremely helpful",
      "text": "Bought this after I bought another one, and it didn’t work, and I was really excited for it. Belkin is an extremely dependable company, great customer service, and extremely durable products. I always knew this, so I ordered it with its price no problem. When it came in the mail I was super excited because I’m in a long distance relationship with a girl in Australia. It helps with us being able to video cal and be able to actually properly hear her and charge my phone at the same time. Would I buy it again, a million times over yes.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Zabukovec",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "\"Worked\", in a loose sense",
      "text": "I was so excited to use this product, as I was looking for a convenient way to both charge my phone and plug in my car's aux cord (I have a 2010 Toyota Sienna). When I connected to the aux cord port, the music played, but there was an annoying high-pitched whine coming from my speakers that would not stop. The product seemed well-built, but the whining was too much to handle. Returned, and purchased a wireless charger that connected to my car's air vent.",
      "rating": 2.0,
      "verified": true,
      "author": "Rocket Man",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Junk refurbish!",
      "text": "This refurbished Belkin charge port had the wrong plug in the box! Instead of headphone and charger outs it had two charger outs. I needed the audio/charge out like stated on the box. It was also cracked at the housing of the plug in. This shouldn't have been resold even if it was in the correct box. Clearly worn out.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacalyn Schultz",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "We've had 2 in the Family both lasted just over 3 months",
      "text": "The connecting cable that connects the ends is the weak link. I use it while going to sleep. After a while (3 months) it (both) developed a kink in the cable where it connects to the phone. Going with \"Ponoto Splitter Compatible for iPhone 7/8 Plus, Listen to Music Phone Call Charging at The Sametime-Yellow/Black\" to see if \"solid\" design and developer certified is any better.",
      "rating": 2.0,
      "verified": true,
      "author": "Larry Creel",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Doesn't work when cold",
      "text": "I use the Belking audio adaptor for my car so I can listen to my iPhone while charging it at the same time. (I don't understand what was wrong with the old audio jack.) When the temperature is in the teens or below, the Belkin audio adapter will cut out. The only solution is to warm it up. I found the quickest way is to hold it in my bare hand. My hand will be freezing cold after but it works. Otherwise this is a good product. Wish it was perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Jones",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Love it",
      "text": "Had a Belkin, loved it. Needed a 2nd adapter so I tried a cheaper off-brand. Ended up throwing it away and just ordering another Belkin. I should have known better. I keep a couple at home, but I also keep one at church so that when I'm down there working on things, I can run my iPhone music through the sound system. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Delecia",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Waste of $",
      "text": "Used 4 times before it stopped working. Convenient for the seller it’s after the 30 day window.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon B",
      "helpful_votes": 2,
      "publication_date": 20191103
    },
    {
      "title": "Extremely overpriced but have gotten some use out of it",
      "text": "This should be $15 tops even if it worked perfectly. I've gotten some use out of it but it seems to be on it's way out after 6 months of light use (I take care of my things), the lightning port plug has started cracking and there have always been issues with the charging cutting out unexpectedly from day 1. I don't know of another option, that's the only reason I think anyone has for buying this.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike R",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Durability 0",
      "text": "I bought this product on April 28, now it doesn't work. Belkin is a good brand but not at this time. Soooo bad!",
      "rating": 1.0,
      "verified": true,
      "author": "Ismar Carino",
      "helpful_votes": 2,
      "publication_date": 20200625
    },
    {
      "title": "Works with your iPhone (unlike other brands)",
      "text": "This works with my iPhone XR. I tried other versions and the sound quality was very bad or it iPhone would not recognize the device.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Mills",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "It actually works!",
      "text": "I bought this same adapter by a different manufacturer on eBay, and when I plugged a headset into it, I couldn't hear anything, nor could anyone hear me. I saw that Apple uses Belkin, and when I saw this offered for less than what it is on Amazon, I went for it. And guess what - it works with regular headphones, it works with headsets. It just works.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney Henning",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Doesn’t last",
      "text": "Broke after almost 2 years of occasional usage. Failure symptoms: Audio doesn’t reliably work despite being plugged in. When it does work any slight bumping or movement of the connector will cause audio to stop working through the adaptor. Frequency of the problem increased over time. Always kept it on my desk. Never mishandled or bent the wire. Yet it didn’t last long enough for something that costs this much.",
      "rating": 2.0,
      "verified": true,
      "author": "ma",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Second time purchased - both broke within a year",
      "text": "What a lame product. If their build quality cant last 12 months for $35 that's pathetic. Second time it has broken. And they are pain to deal with re returns. Apple needs to choose its partners better.",
      "rating": 1.0,
      "verified": true,
      "author": "CSL",
      "helpful_votes": 2,
      "publication_date": 20191105
    },
    {
      "title": "Difficult to connect to phone with cover on.",
      "text": "It's a bit awkward, but it works. If you have a really rigid phone cover, it might not insert into the phone. The white part connected to the male insert is hard and thicker than Apple-branded chargers. I found this out the hard way, but my cover is flexible, so I was able to make it work.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 4,
      "publication_date": 20171102
    },
    {
      "title": "Broke after 4 months",
      "text": "Really disappointed in this product. It broke after only 4 months of use and no longer allows me to charge my phone while playing music.",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 8,
      "publication_date": 20170426
    },
    {
      "title": "Stopped working after a couple of months",
      "text": "Worked fine for the first couple of months. Then said “this accessory may not be supported”. No longer charges or allows headphone use. Guess I’m better off biting the bullet and spending more on official Apple accessories.",
      "rating": 1.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Good adapter",
      "text": "It works really well, but I took one star away because that connecting cable is extremely flimsy and is already starting to wear a little. Edit to 5: Belkin was quick to respond to try to find a resolution to my problem. That quick action and great customer service makes their product and company get that last star. Good job, Belkin!",
      "rating": 5.0,
      "verified": true,
      "author": "Teen04",
      "helpful_votes": 3,
      "publication_date": 20170518
    },
    {
      "title": "Rediculous Price but it works.",
      "text": "Didn't want to pay as much as I did but also didn't want to have to buy a new one every couple of months. Seems to be holding up so far. I Use it every night so I can charge my phone while falling asleep listening to pod cast. Lets face it the one star review should go to Apple for designing a phone with only one port. Why would you do that? Throw away functionality to be sleek? Or sell more dongals and wireless headphones?",
      "rating": 4.0,
      "verified": true,
      "author": "Susan Dierberger",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great product!",
      "text": "This product is very durable and works perfectly. I’ve had it for almost a year and I have no complaints. I’m not sure how those other reviews claim that it can be easily destroyed... they were most likely way too rough and careless.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Perfect",
      "text": "I've never had a bad product from Belkin. This is no different. With working from home and using my iPhone all day with a headset I found myself running out of battery. This allows me to plug in the charger and headset at the same time with no issues. It's the perfect solution for today's situation.",
      "rating": 5.0,
      "verified": true,
      "author": "don pearson",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Can’t be thrifty on this particular device. Spend the cash.",
      "text": "This is a functioning piece of equipment, and unfortunately you do have to pay in the $25 - $35 price range for this particular thing you need. I bought two other splitters that were like $9 - $15 because I’m “thrifty” ... not a good idea. They either don’t work outright, or the charging + audio functions sound staticky, or only one of the two intended functions work at a time. Belkin is where it’s at, you can’t get around the price on this one. In fact I think this is featured on Apple’s website.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach Cross",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "When it worked, it was fine, but it died after a month!",
      "text": "When you pay $40 for a connector, you expect it to last more then a month. It lasted a month and then it quit charging. I tried it again and neither plug works. Usually Belkin is pretty good, but worst money I've spent in a while. Buy the $10 off brand connector so if it dies you aren't out all the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna W.",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Overpriced, but it does what it is supposed to",
      "text": "As many of the other reviews have stated...it just works. Amazing how many faulty options there are out there. I tried several and ended up returning them as they stopped working within 5 minutes. This one works exactly as it should and is a quality product, both in functionality and build. It is way overpriced for what it is...but, it does deliver. If you are tired of dealing with crappy splitters, go with this one and you won't have to continue hunting.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 3,
      "publication_date": 20171201
    },
    {
      "title": "I want full refund for this product",
      "text": "It's ridiculous how cheap they make some of this stuff. After about a year, it was dead after normal use. It's like they're trying to make it as cheap and ineffective as possible, so you need to buy, buy, buy, without any care to resourcefulness, ethics, and energy. How wasteful. Who do I contact for a full refund?",
      "rating": 1.0,
      "verified": true,
      "author": "Jane Smith",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Compatible with iphone7",
      "text": "I tried several after market adapters and none of them worked properly. iPhone 7 had product not compatible warning pop up with all of them except this one. This is the one you can buy from Apple store so it is fully compatible. It’s a lot more than the after market but worth it for the functionality.",
      "rating": 5.0,
      "verified": true,
      "author": "SDubGold",
      "helpful_votes": 2,
      "publication_date": 20180121
    },
    {
      "title": "2 days only.",
      "text": "After 2 days of purchase I started getting an error message, Two freaking days only, I have to unplug it now and then plug it back in, at first I thought no way, 2 days! maybe it was my phone but NO it is the Damn thing...I still have about 3 weeks to keep on working with it, if not I’m returning it and never gain. Ps: I like Belkin product I owe 2 charging pads and they work fine but this one....did I mention the 2 days???? Also if you get a call you will need to unplug it so the caller can hear you.",
      "rating": 1.0,
      "verified": true,
      "author": "Bonjour68",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Doesn't last more than 6 months",
      "text": "This is definitely not worth $35 dollars. It uses the same rubber cover for the wiring as Apple charging cables do, and they always end up bunching up and ripping open after a short while. This is exactly what happened here. It began to bunch up after 3 months, ripped open at 5, and stopped allowing a charge through after 6. Another piece of over-priced garbage than comes from Apple and other \"Made for iPhone\" products. I've only ever used an iPhone, and I won't be buying another. The enormous amount of cheap cables that break after a few months you need to run them is ridiculous .",
      "rating": 2.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Works Perfectly!",
      "text": "I tried 3 other brands, all at a much lower cost. Every one of them caused buzzing through the speakers, and greatly reduced volume. Spend the extra money and get this one, that works just like it should! Like they say, you get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "David Henchman",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Belkin FTW!",
      "text": "i've owned another cheap knockoff one like this adapter and it doesnt work well. Only works when it wants to and this one works all the time as it does and there is no feedback when you are using the charger and the aux plug at the same time. great adapter!",
      "rating": 5.0,
      "verified": true,
      "author": "Pao Vue",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "DON’T BUY IT ! ! ! You will regret",
      "text": "This adapter looks durable at first glance but fails after two months of use at home. DON’T buy Belkin products!!! I thought Apple’s partner company would do well in quality control. I was wrong. Belkin is making poor quality stuff and selling them at high prices.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcus",
      "helpful_votes": 0,
      "publication_date": 20200318
    }
  ],
  "product_meta": {
    "title": "Belkin F8J212btWHT 3.5mm Audio + Charge Rockstar (iPhone Aux Adapter, iPhone Charging Adapter for iPhone 11, 11 Pro, 11 Pro Max, XS, XS Max, XR, 8, 8 Plus and More)",
    "description": "Style:3.5mm Audio + Charge| Pattern Name:LightningThe 3.5 mm Audio + Charge Rockstar makes it possible to listen to audio through a 3.5 mm headphone jack, while charging your iPhone XS, XS Max, XR, X, 8/8 Plus or 7/7 Plus. Connect your 3.5 mm headphones, speakers, or aux cable to enjoy music or talk hands free, while you charge. Use the 3.5 mm rock star at home, at work, in the car, or on the go.",
    "rating": 4.2,
    "feature_bullets": [
      "Designed for iPhone XS, XS Max, XR, X, 8/8 Plus, 7/7 Plus (iPhone models without aux input/headphone jack)",
      "Dual functionality: This device allows you to listen to music, watch videos, use audio navigation, or take calls while still charging your phone at maximum speed",
      "Uncompromised audio quality: The 3.5 millimeter Audio + Charge RockStar is certified to meet Apple specifications, and uniquely designed to ensure clear and crisp audio; Supports remote control and microphone from MFi certified 3.5 millimeter headphones",
      "Charge and sync: Supports syncing to transfer music and photos to and from MacBook; Audio quality: The 3.5 millimeter Audio + Charge RockStar is certified to meet Apple specifications, and uniquely designed to ensure clear and crisp audio; Supports remote control and microphone from MFi certified 3.5 millimeter headphones",
      "“Made For iPhone” MFi certification means this accessory has been designed to connect specifically to iPhone, and has been certified to meet Apple specifications"
    ],
    "specifications": {
      "Product Dimensions": "4.54 x 1.4 x 0.36 inches",
      "Item Weight": "0.48 ounces",
      "ASIN": "B074WDWVX1",
      "Item model number": "F8J212btWHT",
      "Customer Reviews": "4.2 out of 5 stars4,821 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#2,706 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Additional Features": "Microphone",
      "Other display features": "Wireless",
      "Colour": "White",
      "Included Components": "Belkin 3.5mm Audio + Charge Rockstar, iPhone Aux Adapter/iPhone Charging Adapter for iPhone XS, XS Max, XR, 8/8 Plus and more",
      "Department": "1",
      "Manufacturer": "Belkin Inc.",
      "Date First Available": "September 8, 2017"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Accessories",
      "Cables & Adapters",
      "All Departments"
    ],
    "price": ""
  }
}