{
  "website_summaries": [
    {
      "verdict": "An inexpensive table and chairs that fits into a modern design scheme. The glass table top gives the illusion of open space in a crowded room.",
      "pros": [
        "Easy assembly",
        "Low price for a glass table",
        "Glass table is easy to clean and care for"
      ],
      "cons": [
        "Small table size for this many chairs",
        "Chair backs are uncomfortable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very nice.",
      "text": "For the money this is a nice little table and chair set. Much smaller than I thought compared to the picture. I've attached a picture with 4 place mats to give you an idea of the size. Perfect for 4 adults. I put the other two chairs away for later use. 6 adults on this table would be cramped. Super simple to put together. Seems sturdy. Finish is good as well as the glass top. I took one star off because I thought it would seat 6. I think it looks great for a small little table.",
      "rating": 4.0,
      "verified": true,
      "author": "Chip Scratchley",
      "helpful_votes": 35,
      "publication_date": 20181002
    },
    {
      "title": "TABLE LOOKS GREAT IN MY DINING AREA !!!!",
      "text": "This table exceeded my expectations in many ways. It took less than 40 minutes to put together, the quality is much nicer than what I thought for the price i paid for it, it is very sturdy (both table and chairs), and the the size is perfect for my dining area. Definitely recommend for those that are on a budget and still want a nice looking, strong table.",
      "rating": 5.0,
      "verified": true,
      "author": "Chen Wei Lin",
      "helpful_votes": 17,
      "publication_date": 20180911
    },
    {
      "title": "Love it !!",
      "text": "Love the everything about this dining room table and chairs, but I'm a bit sad one of them came broken, please email me so I can get a replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Juliana Jimenez",
      "helpful_votes": 15,
      "publication_date": 20190511
    },
    {
      "title": "Comes with missing parts and it is impossible to get help",
      "text": "One of the chairs came missing 2 of the end caps for the legs. It is impossible to reach any type of customer care or email anyone for help. Really sad because the wife really like the set, just one of the chairs is unuseable.",
      "rating": 1.0,
      "verified": true,
      "author": "RWells",
      "helpful_votes": 10,
      "publication_date": 20181206
    },
    {
      "title": "NOT EVEN WORTH $5 A CHAIR BUYER BEWARE",
      "text": "\"what u liked and disliked?\".. Hmm . Nothing.. I HATE EVERY THING ABOUT THIS ITEM! IT'S VERY CHEAPLY MADE. I thought I'd surprise my mother with some \"nice new chairs\" for the kitchen .. Oh booooooyyy.. WHAT A DISAPPOINTMENT.. I'm embarrassed, to say the least.. Now it's gunna be a huge ordeal to return these.. I'm just going to have to chalk it up as a loss",
      "rating": 1.0,
      "verified": true,
      "author": "Jmantis",
      "helpful_votes": 7,
      "publication_date": 20190528
    },
    {
      "title": "Good buy!",
      "text": "This is a great product for the price it was easy to put together and looks very nice and seems sturdy It came quickly and undamaged. The only problem I have with this table and chairs is that two of the six chairs are wobbly after putting them together they wobble less as you sit in them so I'm hoping it corrects itself. The other four of the chairs sit perfectly so im not upset about it.",
      "rating": 4.0,
      "verified": true,
      "author": "kevin",
      "helpful_votes": 6,
      "publication_date": 20190423
    },
    {
      "title": "Not Very Sturdy..",
      "text": "I've had these chairs for almost 2yrs now and they were pretty easy to assemble. But they ARE NOT STURDY at all. They have been pretty wobbly since day one of having them. The screws are always coming loose and today the one of my chairs actually broke. The metal detached from where the leg and seat meet. So now im down a chair. I mean they looked pretty good but overall they just arent really worth the price in my opinion. But hey thats just my opinion tho!",
      "rating": 3.0,
      "verified": true,
      "author": "Angela M",
      "helpful_votes": 3,
      "publication_date": 20191128
    },
    {
      "title": "I really love this table",
      "text": "I really love this table. The assembly was easy and it is pretty light weight but very elegant with out spending a fortune. My only feedback would be better pads for the bottom of the legs. The ones it came with came off pretty quickly but those are easy to replace so no big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "MountainKat",
      "helpful_votes": 9,
      "publication_date": 20180414
    },
    {
      "title": "Took me about 3 hours to put together, nice table but cheap chairs",
      "text": "Easy to assemble and took me about 3 hours to put together by myself. Almost stripped a couple screws but that's a good thing that there were extra screws included. The table is sturdy and I like the glass top which makes it look modern and high-end. The chairs on the other hand are cheap looking with skinny legs, but they have enough cushion to make it comfortable. I might have to screw the chair tighter though because the back of the seats are coming loose, again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharol Yn",
      "helpful_votes": 2,
      "publication_date": 20200210
    },
    {
      "title": "Nice chairs!",
      "text": "Did not ship the table, only the chairs. But provided a partial refund. Nice chairs!",
      "rating": 5.0,
      "verified": true,
      "author": "Igor S.",
      "helpful_votes": 9,
      "publication_date": 20180418
    },
    {
      "title": "Rubber chair feet break off almost immediately",
      "text": "Well designed set, went together easily, looks good for the price. But then the rubber feet on the chairs began to come off. I wondered why they had included a set of small, circular \"self adhesive furniture pads\" in the box. They are obviously as a result of this major defect, and a pitiful solution, especially because there is nothing for the pads to stick to. Absolutely worthless. This would seem like a minor problem, however the bare metal feet cut right into the carpet or scratch the hard flooring that they sit on. VERY disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "John G.",
      "helpful_votes": 4,
      "publication_date": 20181221
    },
    {
      "title": "Cheap cheap cheap. Stay away!",
      "text": "Cheap cheap cheap. Do not purchase this. I've had it for 2 months and 3 chairs are broken already. Very flimsy. Nails just fall out on the floor from the chairs.",
      "rating": 1.0,
      "verified": true,
      "author": "We're The Millers",
      "helpful_votes": 3,
      "publication_date": 20190707
    },
    {
      "title": "Amazon's Customer Service Team is Top-Notch",
      "text": "Ms. Jennie G. developed solution to replacing manufactures missing chair hardware ~week...at no extra cost to me... her supervisor approved solution same-day and actually took time to speak with me. Table is very sturdy with very nice thick heavy glass top...no problems as all table hardware came in same box as table, took ~35 minutes to assemble. Chairs are sturdy and easy to assemble, just follow instructions to not tighten screws until after chair is loosely assembled, balanced and pieces are aligned. Each takes about 8 minutes to assemble using lessons learned from first assembly. A cordless drill makes it even faster. Tom p.s. Ms Jennie G. the boxes are ready for pickup. Thank you again, Tom D.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "I ordered this for my office kitchenette, does the ...",
      "text": "I ordered this for my office kitchenette, does the job but definitely can’t fit 6 people without legs touching.",
      "rating": 4.0,
      "verified": true,
      "author": "jojo",
      "helpful_votes": 4,
      "publication_date": 20180228
    },
    {
      "title": "Good quality table for the price",
      "text": "Good quality table for the price... the chairs are a bit flimsy.. fits perfectly in my living room since my space is limited.",
      "rating": 5.0,
      "verified": true,
      "author": "tambazine l.",
      "helpful_votes": 3,
      "publication_date": 20171229
    },
    {
      "title": "Gorgeous",
      "text": "Easy to assemble. At first, it seems a bit flimsy, but seems to be plenty sturdy. We use it for meetings and such. It looks gorgeous, unfortunately glass easily is smudged and finger printed, so cleaning is a nuisance, but that's not the table's fault.",
      "rating": 5.0,
      "verified": true,
      "author": "CaptainCraboo",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Good for the price.",
      "text": "I don't understand people who write bad reviews on this. A table and 6 chairs for $300, what do you expect it to be? But a table for a $1000 if you want it to be perfect. So, arrived on time, damage/bends on legs, had trouble making it stable but it worked out. Overall looks nice, just what i wanted. For the price it's a great little table.",
      "rating": 4.0,
      "verified": true,
      "author": "Viktoriia",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Would’ve been great chairs if they’d arrived with all the parts...",
      "text": "These would’ve been great chairs, if they hadn’t shipped them in the cheapest, flimsiest box I’ve ever seen. After the first one was ripped open and missing all its screws and some cross pieces, we reached out for a replacement. Took a week, box arrived ripped open worse than before and STILL MISSING PIECES. Not worth the hassle. We’ve been waiting without chairs in our new place for over two weeks because of this fiasco. They weren’t the nicest chairs around, but they would have suited us really well.",
      "rating": 2.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "The only good thing was they allowed a refund",
      "text": "The chairs wouldn’t assemble. After seeing this I requested a return and didn’t even bother opening the box that the table came in. Thankfully I was able to return it. I’ll go to a brick and mortar from now on when it comes to furniture.",
      "rating": 1.0,
      "verified": true,
      "author": "Pen Fanatic",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Five Stars",
      "text": "Love this table. Very good looking and as compare to its price,very good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr mehrbod",
      "helpful_votes": 3,
      "publication_date": 20171214
    },
    {
      "title": "Good price",
      "text": "Great chairs, but once I was able to assemble them, I found that one of the chairs seats had a tear in it! By the time of the assembly, it was too late to return! Otherwise, they’re great!",
      "rating": 4.0,
      "verified": true,
      "author": "Danette Lariosa",
      "helpful_votes": 2,
      "publication_date": 20190518
    },
    {
      "title": "Cheap assembly but i love them",
      "text": "These are awesome and perfect size for the area i got them for but the screws fall out of the bottoms. Its just cheap wood underneath cushion. I finally super glued the screws in and theyve stayed in for alot longer. But otherwise i love them easy to clean too",
      "rating": 1.0,
      "verified": true,
      "author": "S.votava",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "This was not a good choice. I'm disappointed",
      "text": "I was very disappointed. All the holes were not aligned to fit the screws. The legs are wobbly. I bought 6 chairs and I can't even use them so they're just sitting in my apartment. I'm so disappointed 😞 I wish I could exchange them for a different more stronger set of chairs. Never again would I buy that type of chair. The legs are uneven and not strong. I'm very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda ",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Pleasantly Surprised!",
      "text": "These chairs exceeded my expectations. Considering how reasonably priced they were i didn’t have high hopes but they are great!!! Easy to put together and look exactly as pictured!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Monaco",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Way to small and really bad quality",
      "text": "Just want to say. Don’t waist ur money for this crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Joerg Kosteyn",
      "helpful_votes": 2,
      "publication_date": 20181114
    },
    {
      "title": "Received exactly what was pictured",
      "text": "I love how sleek and minimalistic this dining set is. It was perfect for us in our apartment. All the parts were in the packages and the instructions were not difficult to follow. It took approximately 2 hours to assemble with 2 people. I found some imperfections that I wasn't too thrilled about. One of the seats had what seemed to be a child's \"artwork\" or swirls. It was very faint but absolutely visible. Also, a minor peeled area on the glass since it does have some sort of tint to the glass.",
      "rating": 4.0,
      "verified": true,
      "author": "Mariana ",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Do not buy! No way to contact seller",
      "text": "These are children’s chairs . The seat has no holes to screw on the chair. Junk how can you attach the seat to the chair with no holes for screws. Ruined holiday measurements are way off tiny little weak children’s chair do not buy!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Christine De Nobile",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Love it",
      "text": "Love it. Very small so I bought two and put them together and I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Espy",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Missing Legs on one chair",
      "text": "One chair did not come with the legs. I’ve messaged a few times with no response. I need these legs!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "annette lilly",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "missing the whole table",
      "text": "I ordered the set with table and chairs. It just came in. I have the chairs and no table at all and I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kayla Mullins",
      "helpful_votes": 2,
      "publication_date": 20190521
    },
    {
      "title": "I was doubtful, now a best choice made lol",
      "text": "Very nice and durable, you can’t beat the price! My family loves it and my husband is a tall guy and he loves it. The black glass is dope, and it matches my silver, black, glitter scheme as well. We have 5kids and it’s taking the attacks of them without a scratch or bend, PERFECTLY, I definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Tayvi",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Easy to assemble. Minimal design",
      "text": "Good product. Chairs not stable and not straight when assembled. Good value for the money. Minimal design. Easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Flimsy!",
      "text": "I never write bad reviews, but I have to here. These chairs are very flimsy. Most of the holes for attaching the bolts are slightly too large, causing the bolts to be impossible to tighten. Also, the seats attach to the frames with four little screws directly into the pressboard, which strips easily while the screws are barely tightened. After barely any use, these chairs are all rickety and wobbly. Also, there is no back support. I deeply regret this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Chicagoan",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Small table",
      "text": "Much smaller than what I thought ! Six chairs can fit four people because the table size.",
      "rating": 2.0,
      "verified": true,
      "author": "Mandy chen",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Not what I thought they would be",
      "text": "The look is great but it is not sturdy enough for heavy people. If you have boys that like to lean back on your chairs - this is not for you.",
      "rating": 3.0,
      "verified": true,
      "author": "wiseman07",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Good product for the $$$",
      "text": "This comes in 2 boxes. I received one box but not the second one. I contacted support and once I got to Andrew he was great and sent me out a whole new set. Both boxes came this time so I just returned the one that was the duplicate....and UPS picked it up from my door. The set was quick and easy to put together....the only complaint I have is that not all of the chairs are level.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Clark",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Chairs won't support big people",
      "text": "Only buy if you never plan on having someone over 180 lbs sitting on these. They absolutely will not last and the second a heavy-set person sits on any of them they will buckle.",
      "rating": 1.0,
      "verified": true,
      "author": "nikk wong",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great value",
      "text": "Looks great and easy to put together. Only downside is it's very small.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Stittleburg",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Waste of money",
      "text": "This item is not sturdy and a waste of money. If I could I would go back and get something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheryl Ellis",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Nice table. Chairs so so",
      "text": "Sturdy table. One chair was ripped. Chairs are ok. Not perfectly stable. Table barely fits 6 chairs but great value for $$",
      "rating": 4.0,
      "verified": true,
      "author": "penelope beckles",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Good for small space",
      "text": "The table is nice but it is much smaller in real life. It is great for a small space. I also did not like assembling the seat cushions because we had to force the holes which is unsafe and required more time.",
      "rating": 4.0,
      "verified": true,
      "author": "Loveleen Sharma",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Won’t last forever only a quick fix",
      "text": "Very cheap not sturdy but you get you what you pay for. For the price if your just looking for some Chairs to get you buy for a little bit can’t go wrong.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Don’t waste your money",
      "text": "It doesn’t cone with instructions. The screws don’t fit. There’s no whole to attach seat to chair. Hope you have a handyman around smh",
      "rating": 2.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 2,
      "publication_date": 20190401
    },
    {
      "title": "Bang for your buck.",
      "text": "table feels very sturdy, but the chairs feel very flimsy and wobbly.. little spendy for what it is.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Affordable and durable",
      "text": "Its easy to assemble. The quality of the chair isnt that good compare to the table. But overall, still good for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Kenjo Malh",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "How you take care of it...",
      "text": "A gift. It was said that it was very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene Collington",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Nice",
      "text": "Nice chairs for the price. These arent long lasting chairs but my kids are adults now and don't tear up furniture like they used to lol. Looks great with my glass table",
      "rating": 5.0,
      "verified": true,
      "author": "Teeaya",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Lightweight and comfortable",
      "text": "We have a small table and they were the perfect size. They are lightweight and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Burke",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Unsafe",
      "text": "These are unsafe my child fell trying to get on one after it was fully assembled all 4 screws poped out of the seat part there really isnt anything for the screws to grab on to",
      "rating": 1.0,
      "verified": true,
      "author": "candice johnson",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Missing Piece",
      "text": "This item had 5 right legs and 3 left instead of 4 and 4. I need another piece for the left side. I don’t want to return everything and replace it all since I’ve already put together the other 3 chairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Atallah Elias",
      "helpful_votes": 2,
      "publication_date": 20190519
    },
    {
      "title": "Unsatisfied",
      "text": "Even tho all legs were the same , had to keep trying new legs to Make sure the holes matched .. 4 chairs end Up together wit no problem .. 1 chair has a extra piece of metal so I couldn’t use one of the screws & the 6th chair I couldn’t out together at all because the holes on the chair and the legs didn’t line up. Very disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "Brittani",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Overall, really nice!",
      "text": "I thought the overall outcome of the dining set was beautiful. The only 2 negative things I would say are: 1) the Allen wrenches they give strip very easily(so it took forever to put together) but good thing they give you one for every chair and 2) I think for $300 it could have been a little bit bigger. Other than that, I love it. It fits my children comfortably enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Morgan",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Good value but not the best quality",
      "text": "Chairs are great for the money. But they aren’t the sturdiest and shake a lot after some time.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave K",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Packaging was horrible. Chairs are OK",
      "text": "The packaging was horrible! Actually had to return it and get a new set because there was a gapping hole where I think some of the items fell through. The second time around the box was still tore up but at least we had all the parts. The chairs are sturdy but not very comfortable. A good price for the quality.",
      "rating": 2.0,
      "verified": true,
      "author": "tran83",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Need a Phillips screw driver",
      "text": "Let me start off by saying I was really skeptical about buying these chairs because the reviews weren’t that great but honey let me tell you,These were replacement chairs and they are beautiful, I bought 6 of them it took my about 1 hour to assemble them all on my own(my husband was so proud) it was a piece of cake.",
      "rating": 5.0,
      "verified": true,
      "author": "Ayanna",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Ok but not great",
      "text": "Doesn’t really fit 6 comfortably but works for 4. Arrived with some nicks and scratches but overall pleased enough for the price but wouldn’t recommend",
      "rating": 3.0,
      "verified": true,
      "author": "Kate M.",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Be patient with assembly and make it work!",
      "text": "I appreciate this item in a way most can understand. Assembly was critical to assure sturdiness. Only one thing i was unhappy about was one chair had 2 same side legs wgich means i was unable to completely assemble one chair. I did however assemble anyway and i am satisfied with the result.",
      "rating": 4.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Not durable at all",
      "text": "Chairs look great and aren't too hard to assemble. Problem is the screws come loose so often. It doesn't matter how much you tighten them for some reason. Lately, some chairs can't even be tightened anymore because the socket has busted. So it just keeps spinning no matter what.",
      "rating": 1.0,
      "verified": true,
      "author": "James Mejia",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Not happy",
      "text": "No sturdy and not comfortable to sit on. The directions were crap.",
      "rating": 3.0,
      "verified": true,
      "author": "Lovely_100",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Wonderful",
      "text": "Cute chairs.. very modern looking.. not bad for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Toothpick legs",
      "text": "I knew when I purchased these that they wouldn’t be the best quality. So I can’t complain but the legs of these chairs are like toothpicks.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good price for quality",
      "text": "Got to me very quickly, very easy to assemble. not very sturdy. Very light weight. Good quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "This set gives mild headache",
      "text": "We received 1 part of the 2 boxes that comes with this 7 piece set. Because Amazon/ups uses only one tracking number for both boxes, nobody can tell me the status of the dinning table part of the set, which is frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "Gil_Alexander",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "also one side of my table was bent other than that everything is awesome and worth buying",
      "text": "only 4 stars because a bar from one of my chairs that connect the legs is missing, also one side of my table was bent other than that everything is awesome and worth buying.",
      "rating": 4.0,
      "verified": true,
      "author": "Radijah Chase ",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Poor chairs quality",
      "text": "Chairs Quality is not good. In few weeks, damaged and getting unuseful.",
      "rating": 2.0,
      "verified": true,
      "author": "Urve",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Nice but cheap",
      "text": "Super easy to out together but the screws keep coming out so the chairs get a little wobbly.",
      "rating": 3.0,
      "verified": true,
      "author": "brianna adams",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Dont do it",
      "text": "I was disappointed in how flimsy this product was. I'd ask for a refund if I didnt have to go through the crap of taking it all back apart to ship.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany Cummings",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Nice but small",
      "text": "So nice but so tiny! This is not calls for 6 chairs, i gotta buy a whole different larger table now",
      "rating": 4.0,
      "verified": true,
      "author": "London ",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Low quality product",
      "text": "Customer service sucks, initiated the return and item have never been picked up.. I strongly advice that dont order this",
      "rating": 1.0,
      "verified": true,
      "author": "Sadaf",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Maybe",
      "text": "We don’t use our table much but the chairs are not sturdy and are wobbly. They are very pretty after you figure out how to put them together it’s easy",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle Ratcliffe ",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "A nice starter dinette set",
      "text": "I like the dinette set, however I don't think it's worth the amount of money I paid for it. The table is really smaller then it looks in the picture, but it does fit the six chairs that came with it. I also like that the set was easy to put together. All in all it's a nice starter set.",
      "rating": 3.0,
      "verified": true,
      "author": "Yalanda Booth",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Cheap but good for a dining table",
      "text": "As a dining table, the quality was okay for the price. I like the stylish chairs in particular.",
      "rating": 4.0,
      "verified": true,
      "author": "Minxiang Zeng",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Too small, too weak.",
      "text": "It will not stick to the bottom part, I've done everything I could, and it's for babies",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Just what I wanted!",
      "text": "Love it! Very easy to put together and I am happy I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "MARIA",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Cool comfortable leather",
      "text": "The chairs are soft and comfortable to sit in. The tabs that come with it don't stay on the feet of the chair. It's still an awesome set.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Expensive and table missing",
      "text": "It expensive and doesn’t have a table. eBay is selling the items with a table included for cheap price. And you have no return policy. I tried to cancel my order after an hour of purchase, I wasn’t able to do it.",
      "rating": 1.0,
      "verified": true,
      "author": "jeanpy",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Missing parts",
      "text": "Missing parts. Ordered the table and chairs first and only received table. Now have ordered just the chairs and the chairs showed up with 2 missing back rests, no instructions and no hardware.",
      "rating": 1.0,
      "verified": true,
      "author": "amanda sutton",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Be careful what you order and from who!",
      "text": "Not Happy! My chair legs are all scratched up on arrival. My box was totally beat up. Not purchase anything again.",
      "rating": 1.0,
      "verified": true,
      "author": "Felicia",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Quality",
      "text": "Things look good. Definitely build for light use. Have had these for a few month and they look fine. The leather feels good but a small for larger people.",
      "rating": 5.0,
      "verified": true,
      "author": "Onipup ",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Five Stars",
      "text": "It is great and did take few hours to get all together.",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene C Anderson",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "You get what you pay for!",
      "text": "They are not real sturdy and the pads for the feel don't stay on.",
      "rating": 3.0,
      "verified": true,
      "author": "Mary Murray",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Dissatisfied",
      "text": "The chairs were too small and they wanted to charge me 100 dollars to ship back I only paid a little over a hundred dollars for them I’m disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "ashley guidry",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Okay for the price",
      "text": "The set is okay for the price...the table is very small for 6 chairs and the chair weight limit is 184lbs which is very low other than that it was easy to put together and decent for the price .",
      "rating": 3.0,
      "verified": true,
      "author": "Trinka Hudson",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Cracked glass",
      "text": "Upon assembling the set, I noticed that the glass table had a crack near one of the corners. Since I have 3 small ones, I don't know if I should use it just in case it does crack more.",
      "rating": 3.0,
      "verified": true,
      "author": "Kabou vang",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Great table..weak chairs",
      "text": "The chairs aren’t sturdy at all😩 I bought the table just July. I have only had the table for 6 months and the screws have already fallen out in the chairs. The table is great but not the chairs.",
      "rating": 2.0,
      "verified": true,
      "author": "Maryann E.",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Cheap product not worth the money",
      "text": "The product looks good but is made very cheaply. All the hardware keeps loosening up and keeps falling out. It's so you you get what you pay for and I got garbage. Dont buy it!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "loved the table, not so much the chairs. Very cheaply made.",
      "text": "Chairs brakes very easily. Need better chairs, but the table is great. That's why I gave it 4 & not 5 starts.",
      "rating": 4.0,
      "verified": true,
      "author": "xzoticpinky",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Do not buy this product!!!",
      "text": "Please do not buy this product !!! The table was missing and i did a replacement order the same thing happened again ...",
      "rating": 1.0,
      "verified": true,
      "author": "muzit",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Not worth the money, not even half of it. Really disappointed  :(",
      "text": "The quality is extremely poor, the construction weak. I got missing part the first two times and the third time finally they were able to put everything in there.",
      "rating": 1.0,
      "verified": true,
      "author": "Timea Szabo",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "No Screws and Tools",
      "text": "I have read many reviews that the table came with missing parts and it happened to me. The 6 chairs came with 0 screws and tools to assemble them. Totally unacceptable.",
      "rating": 1.0,
      "verified": true,
      "author": "David Abi Diwan",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Please don’t buy this.",
      "text": "This table is crap. The chairs fall apart one week after you put them together. Please don’t buy this crap!!",
      "rating": 1.0,
      "verified": true,
      "author": "Steven Kamenski",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Inexpensive and very nice dinning set",
      "text": "Very nice and fancy looking I really like it!! The table is just right but hope it’s a little bit wider but it’s ok. Worth the price. Easy to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "Cristeanne aQ",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "The design of chair is wrong it’s not even flat on the floor.",
      "text": "It is poor quality. It has too many scratches on the glass and also on the chairs. I really recommend to not buy at all.",
      "rating": 1.0,
      "verified": true,
      "author": "hosam",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great deal",
      "text": "I got wonderful deal...I really liked the chairs and very easy to build...delivery on time...I do recommend this product to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Rabia",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Literally don’t expect to much.",
      "text": "I almost loved, these chairs but unfortunately the legs were backwards and not only that one chair was literally sliced down the middle. Bad thing about it I’ve already assembled it 😣",
      "rating": 3.0,
      "verified": true,
      "author": "Norma",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Its okay",
      "text": "Table pretty small, and chairs were kinda annoying to build. You gotta unloose screws a bunch of times for the chairs to be flat on the floor",
      "rating": 4.0,
      "verified": true,
      "author": "Jackie Perez",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Not Like Product Description.",
      "text": "Chairs Are Not As Described. They Are Scratched Up, Material Is Very Cheap. Not Easy To Assemble Because The Holes Are Not Even.",
      "rating": 2.0,
      "verified": true,
      "author": "Mz L.",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Comfort",
      "text": "Amazing package. Actually a nice deal. Can’t think of any a particular con for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Naren",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "So beautiful",
      "text": "Wonderful, a week and a half to deliver, but arrived all right, wonderful table and chairs, it was a great purchase. thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Daiana",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Package",
      "text": "Nevermind neighbors signed for my package but wasn't instructed to do so. But I have my package. Well let you know if anything is missing or broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Leona Morrison",
      "helpful_votes": 0,
      "publication_date": 20191206
    }
  ],
  "product_meta": {
    "title": "IDS Online 7 Pieces Modern Glass Dining Table Set Faxu Leather With 6 Chairs Black.",
    "description": "Style Name:Set of 6 + 1 tableColor: Black | size: 7pcs #MLM-17429-6} the 7-piece dining set includes a glass topped table and six comfortable chairs. Both the table and chair frames are constructed of rust-resistant, heavy-duty steel and have been powder coated to increase their life spans. This dining table set features an ultra-modern design that will help blend in with any decor. Product size: table-51.18\" * 27.56\" * 29.53\"/130cm * 70cm * 75cm chair-16.5\" * 20.5\" * 37.8\"/42cm * 52cm *96 cm table-8mm tempered white glass top; chair-white PVC cover; metal frame with white powder coated color; white stitching; package includes: 1 x dining set friendly reminder: we are a USA based company- ready to provide you excellent quality products ! we will do our utmost best to provide excellent customer service to you. If there are any issues, please Contact us and give us a chance to resolve any issues as soon as possible before you make the decision to leave a negative review. If you are satisfied with your purchase, please take a moment to leave a positive review. Your satisfaction is our #1 priority! customer service: 1-855-437-7467",
    "rating": 3.7,
    "feature_bullets": [
      "Black Leather",
      "· The perfect design for your home: mixing a contemporary design with Classic comfort, This dining table Set will look great in your kitchen or dining room.",
      "· Class & elegance intertwined: the glass Top table is bound to add a certain amount of elegance to your home that you and your guests will absolutely love.",
      "· heavy duty Construction: built with metal legs and a powder coated frame, this table and chairs Dining Set is Designed for long-lasting, everyday use.",
      "· A complete dining set: with every order, you will get one table (51. 18\" 27. 56\" 29. 53\") and 6 chairs (16. 5\" 20. 5\" 37. 8\") that will be the perfect addition to your Casual dining space.",
      "· 100% risk-free PURCHASE: NOT entirely satisfied with your new dining table Set? Get in touch with US within 30 days and claim your Full refund!",
      "A perfect addition to your Casual dining space, Glass Top dining Set will add elegance to your home",
      "Color: Black Glass Top, Black powder coated frame, Black PVC cover",
      "Metal legs and frame with powder coated color to increase their life spans"
    ],
    "specifications": {
      "Product Dimensions": "52 x 28 x 30 inches",
      "Item Weight": "4.7 ounces",
      "Manufacturer": "IDS online",
      "ASIN": "B074JBHS31",
      "Item model number": "MLM-17429-6-BK",
      "Customer Reviews": "3.7 out of 5 stars365 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#202,322 in Home & Kitchen",
      "Fabric Type": "Black Leather",
      "Form Factor": "Upholstered",
      "Is Assembly Required?": "Yes",
      "Number of Pieces": "7",
      "Batteries Required": "No",
      "Included Components": "1 Table and 6 Chairs"
    },
    "categories": [
      "Home & Kitchen",
      "Kitchen & Dining Room Furniture",
      "Furniture",
      "Table & Chair Sets"
    ],
    "price": 369.99
  }
}