{
  "website_summaries": [
    {
      "verdict": "Who needs a built-in DVD player, when this affordable, versatile, and simple tablet mount will effortlessly keep anyone in the back seat entertained throughout your next road trip?",
      "pros": [
        "Fits most headrests",
        "Will hold 4.7 to 10.5 inch sized tablets",
        "Available in black or red",
        "Easy to install",
        "Wide rotation angles for convenient viewing",
        "Leaves room for headphone and power jacks"
      ],
      "cons": [
        "If the twin bars supporting your car’s headrest are less than 4.9 inches or wider than 5.9 inches apart from each other, this device is not for you"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "5 Stars-Minimalist Design, Huge Performance, Great Price",
      "text": "Finally, a universal car mount for our iPad, Switch, and iPhone that is of minimalist design and huge performance...at an incredibly low price. Easier to mount and use than it is to turn on the iPad itself - easy! Fit our ‘18 Range Rover Sport perfectly. 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Masterson",
      "helpful_votes": 65,
      "publication_date": 20180316
    },
    {
      "title": "I love love love it!",
      "text": "I love that it’s portable so I can take it when we’re in his grandma’s van. I wanted something higher that way he’d stop clicking stuff with his little toes. It’s so durable and I hope it last long because I love it so far. Only thing is the grip isn’t the best. Doesn’t move around but I thought it’d be a bit tighter. Still, it’s perfect! Get it! You won’t regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "samlovee23 ",
      "helpful_votes": 38,
      "publication_date": 20181128
    },
    {
      "title": "Great!",
      "text": "This headrest mount is really great!! We have a galaxy tab E, and it fits really perfect! Love that I can swivel it to aim it for my daughter since her car seat is in the middle. Holds the tablet up really good! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.Nelson",
      "helpful_votes": 30,
      "publication_date": 20180525
    },
    {
      "title": "Worth every penny!",
      "text": "I got this for our 2017 Dodge Journey. I needed something that would hold my son’s tablet while on trips. This thing was a perfect fit for our Amazon’s Kid Tablet as well as my other tablets. I would definitely recommend this! It’s Hassle free, easy to install and set up!",
      "rating": 5.0,
      "verified": true,
      "author": "Katlyn H.",
      "helpful_votes": 25,
      "publication_date": 20181018
    },
    {
      "title": "Perfect for kid's Kindle Fire",
      "text": "I love it. I was looking for something to hold my grandson's Kindle Fire while he's in the car. It's perfect. Easily attaches to the headrest without ugly straps and actually holds the tablet in place during bumpy rides. I can easily remove the tablet and/or the mount if I don't need them or move it around the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 40,
      "publication_date": 20180406
    },
    {
      "title": "It works",
      "text": "I have a '17 4runner and it fits the arms of the headrest. The anchor arms are flexible so easy to install. It holds our 10' fire tablet no problem. Both sides of the base (the part that holds the tablet) flexes out. The tablet doesn't vibrate while driving either, which is nice. The only down side is when I rotate the holder vertical it pushes into my leather seat. (Which is just annoying to me) So when we don't use it we just take it off, or rotate it to it's original position and it solves that.",
      "rating": 4.0,
      "verified": true,
      "author": "Bri",
      "helpful_votes": 12,
      "publication_date": 20181202
    },
    {
      "title": "Perfect tablet holder, sturdy, easy to use.",
      "text": "This is exactly what we needed. Easy to put together, though no instructions. You have to unscrew the collar off the back of the holder, slide it onto the piece that connects, then tighten it down. Holds our old Samsung Tab2 in a defender style case just fine, which is heavy. Spring is very tough, tablet doesn't fall out even on bumpy roads. Easy to install, honestly unless you have multiple devices you'll only need one because it goes between vehicles so easily. It also works great as a stand for the tablet on a table or desk. I've told other parents about it. Thanks for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "JBoydTop Contributor: Baby",
      "helpful_votes": 15,
      "publication_date": 20180613
    },
    {
      "title": "excellent product for a great price",
      "text": "Initially purchased to mount on the headrest in the backseat, as to face in opposite direction, relative to a child carseat. however it did not fit! When collapsed it was about 1/4\" too long. I tried to maneuver it perhaps, did not fit. So, to avoid a return I installed on the back of my headrest, for any passengers. It has Been road tested. so now I gave it 5 stars. it holds in any position(s). even after children smack it. also has the least amount of vibration and shake. Would not dismount, unless I disengaged it. excellent product for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Zilla",
      "helpful_votes": 17,
      "publication_date": 20180223
    },
    {
      "title": "Very convenient",
      "text": "I love this tablet / phone holder. I connected 2 IPads to my hotspot. Each iPad as their own wireless headphones for the kids. 3 hour road trip to Orlando was GREAT. Kept them entertained & quite. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Yennaayy",
      "helpful_votes": 19,
      "publication_date": 20180510
    },
    {
      "title": "Fits perfect!",
      "text": "This fits my 2015 yukon perfect and holds an ipad mini. Just what i wanted!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 16,
      "publication_date": 20181213
    },
    {
      "title": "Amazing!",
      "text": "These are perfect for road trips, they are very easy to snap on your seat it literally takes seconds. I used it for an iPad Pro 9.7, a Nintendo Switch and even on my 10.5 inch iPad",
      "rating": 5.0,
      "verified": true,
      "author": "shady350",
      "helpful_votes": 21,
      "publication_date": 20171007
    },
    {
      "title": "Simple and easy to use invention that just makes your life easier",
      "text": "Simple and easy to use invention that just makes your life easier. I just got a new car and that brought me to this item, because my dealer tried to sell me a $2,000 option for 2 screens on the back of my 2 front seats. I just thought to myself.... YOU CRAZY! Got home and purchased this right away. Now my son can enjoy is \"Rescue Bots\" and \"Word Party\" with ease!",
      "rating": 5.0,
      "verified": true,
      "author": "Moja",
      "helpful_votes": 16,
      "publication_date": 20180214
    },
    {
      "title": "It Works",
      "text": "Pros: Sturdy when adjusted properly; minimal bulk, tablet doesn’t move too much and allows my daughter to watch videos just fine. Cons: Some cases may be a little to hold on to than others. Note: We have an Amazon Fire for kids and the bulk of the big “bubble type” case causes it to hold ok, without anyone bothering it though. IMO, use the mount sans case. Note 2: To install this in my 2016 Chevy Traverse, I had to take out the head rest entirely, slide the bracket on, then re-install the head rest. I like this because it’s led to the mount’s sturdiness.",
      "rating": 5.0,
      "verified": true,
      "author": "MUSAX",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Helps with safe driving during commutes",
      "text": "I have little ones and we constantly have to commute up to an hour one way. I let them use their tablets during this time and sometimes they have a little snack or just want to adjust in their seats and holding the tablet and balancing what they want to do was becoming a pain and dangerous while driving. I installed these holders and they saved the day. My kids can be hands free and don't have to bother their necks looking down, they have the comfort of just relaxing and watching their favorite shows without worry of the tablet falling on the floor or juggling toys and tablet and whatnot. Love these.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Cheaply made",
      "text": "Changed rating from one star to three due to customer service and responsiveness of company . I received a replacement that was much better than original i ordered . This was my review prior ZHorrible product . Bought for My kids for our road trip and took me forever to install. Once installed almost impossible to remove . Came with limited flexibility and my 11 year olds couldn’t attach or Remove their iPads which caused such an inconvenience when I was the driver having to assist them . Would not recommend",
      "rating": 3.0,
      "verified": true,
      "author": "Ruruu",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Secure and easy to install and use",
      "text": "We used this to hold an iPhone and iPad during road trips. It works great, is very easy to install/remove, small for storage when not in use, and can rotate easily to accommodate the different devices. It’s also very secure. The devices never slipped or moved while in the mount. The springs to mount this on the headrest are very strong and it might difficult for some to mount (children, arthritic hands, etc.). Putting the device in is much easier, but I don’t think a young child could do it by themselves. This is overall a great solution if you want to use a device in your car for backseat passengers.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Martiniere",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Life saver with a toddler! A+. Highly recommended for parents with kids!",
      "text": "This item has been a lifesaver for a 1yr old who just turned 2 with keeping her busy and distracted. We bought it based on the reviews and we weren't the least bit disappointed. We have been using this product now for about 6-7 mos and safe to say, this item is still as good as when we first got it. Its attached to the headrest on the drivers side seat and is mainly used to hold up my wife's iphone to play videos. The installation was easy. Thanks tryone. Great product. Highly recommended!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaivi George",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Easy to install, does what it says",
      "text": "This does the job. However, the one thing is, it doesn’t stick out far enough to clear the head rest in my husband’s truck (Ford F-350). The padding is thicker so I have to have the headrest up a click in order to be able to tilt the mount. If I put the headrest where I want (all the way down), the the mount tilts down and that’s it because it pushes on the top of the phone. I guess I wish it extended out too. But, it does what it says. Super easy to install.",
      "rating": 4.0,
      "verified": true,
      "author": "Angie P.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Works on front seats, not on back seats",
      "text": "Unfortunately this won't work as I hoped but I'll keep it for future use. Right now my son is rear-facing in his car seat so I need this to attach to the headrest of the back seat. It doesn't work on our Chevy Silverado or GMC Terrain. It does work on the back of the driver and passenger seats so I'll keep it for when he's forward facing. It was easy to install and seems like it will work great, I just wish I could use it the way I intended.",
      "rating": 4.0,
      "verified": true,
      "author": "CaitM",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Very good. Tried with iPad 2 and nintendo switch",
      "text": "Very good. Tried with iPad 2 and nintendo switch. Fits perfect. May need to take headrest off for certain cars so this thing goes on securely. back right hinge retracts, left doesnt. see photos.",
      "rating": 5.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 43,
      "publication_date": 20170912
    },
    {
      "title": "Good product, sturdy, and allows for adjustment of headrest when attached",
      "text": "Can’t get easier than this to hold an iPad or other tablet in the backseat of your car for the kids to watch movies on a long road trip. Just make sure your headrests have adjustable posts, so you can attach the holder. They worked perfectly in our 2016 Kia Sorrento. It’s nice once you attach, you can still adjust the headrest up and down to the right level for driver and front passenger. The ball connector holds the angle you set the tablet at, and is very sturdy. Worked perfectly for our iPad mini and our iPad Air 2, even in cases. Very sturdy design.",
      "rating": 5.0,
      "verified": true,
      "author": "Gin",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "If you have kids BUY THIS!",
      "text": "Bought two of these for my kiddos. I drive a 2014 Traverse and they didn't fit. With a little ingenuity I was able to make it work. Instead of the bar sitting between the headrest supports I slid it completely through. Anyway they work like a charm. The openings on the side allow for charger and headphones to plug through for a phone. I have an 8\"tablet, a Switch, and a 7\" Amazon Fire with the super bulky kids case and they all fit great. Definitely recommend. My boys LOVE them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Love this  👌🏾",
      "text": "I’m so glad I stumbled upon this. I needed something for my daughter who sits in a wheelchair in the minivan. She watches download videos on her kindle. At first I didn’t tighten it enough and it faced itself down. Once I tightened it I turned it towards her and it didn’t move once. Assembly is easy. Putting it onto the headrest was easy as well. Clipping my kindle fire 7 into it was perfect. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "kee",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Perfect solution but does not fit all vehicles.",
      "text": "Pros: easy to install & it works well! It’s easy to adjust to the needed eye level. First my iPhone & iPad mini easily. I love that I can use it interchangeably. Cons: Does not work in a Subaru! The headrest is too narrow, making it impossible to it in! :( Works perfectly well in an Audi. Would have been a 5 star review if worked for both vehicles. Assuming that is not the only vehicle it does not work with.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrey Tereshchenko",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Fits Amazon Fire 8",
      "text": "Bought this for my 6 year old as we found him staring down at his kindle for hours while traveling long distances this past summer and didn't want him get neck cramps. It fits the Fire 8 kids edition (with the blue foam pad on it) perfectly and holds and adjusts perfectly for him. Fully adjustable and fit the headrest on both a 2016 Yukon and 2019 GMC Terrain without issue. Throw this in with a pair of headsets and you have the perfect quiet child on a long road-trip!",
      "rating": 5.0,
      "verified": true,
      "author": "Ekbruster",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Perfect little device",
      "text": "We were on a road trip to visit my Sister-in-law and I turned to see my son attempting to play his switch all hunched over - I ordered this and it was at my Sister-in-law’s house the next day and I snapped it together and installed it a day later for our trip back- he LOVED it . Super easy to install (just squeeze and put into place ) and hold’s his switch still while we are driving . Perfect device.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle ",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Not good product",
      "text": "The dollar tree has a better one for $1.00 And they have black or white, this one is horrible, my tablet shakes and it keeps sliding down my headrest post Junk I",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191214
    },
    {
      "title": "Perfect For Any Trip",
      "text": "The car mount is a great feature for anyone who has kids. I use it for them mainly. It is easy to install to the headrest and can still charge. It does not work on my rear seat head rests, I was intending to use it for my son who sits rear facing. If you're headrest bars are exposed than it should work, mine are covered by the front of the headrest cushion. It still works for the front seats. If I really wanted I could flip my rear headrest and it should work. The spring mechanism that slides in seems fragile but it has not broke or anything like that. I will be getting a 2nd mount soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Him & Her",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Perfect for movies on a road trip!!",
      "text": "Got this for my kiddo in order for them to more easily watch their favorite shows during a long road trip! I was worried the holder was more for tablets but pictured they're using their iPhone 8+ in it! Ordered some window shade screens from Amazon too to help with glare. It was SUPER easy for them to install on their own. I can't comment on durability or sturdiness yet as we haven't used it more than a few hours yet. Will try to remember to come back in a few months to update whether we've had any issues. In the meantime, we likey!",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "i can't believe i waited so long!",
      "text": "I'm so glad i finally got one! this product is convenient in that there are no straps for the kids to grab and pull at, it sits nice and tight between the bars and i have been able to use it with both my tablet (samsung tab s2) and my phone (galaxy s9) with no issues whatsoever. i used it for my kids to watch a movie during our 10 hour drive. Highly highly recommend so that your kids or whoever are not staring down with their necks bent the whole time. so worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "ONana",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Fabulous - one glitch",
      "text": "I love this - for the price, it is so simplistic, easy to use, sturdy and works great! The only thing I would let people know is that in my Sienna the headrest is about 2\" in front of the back of the seat and so the swivel doesn't really work - only straight view. I did ask them if the arm could be extended but they explained that it would lose sturdiness. So, it is not great for two kids to watch one iPad - however, that is no big deal considering the quality and price. It's a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Great Design",
      "text": "This replaces an older hanging iPad mount who’s strap had broken. We like this mount as it’s more secure and doesn’t swing with the movements of the car. It’s also at a more favorable level if your child has motion sickness issues allowing them to maintain a better peripheral view of the landscape around them while watching a movie during those long car rides. In other words, this last trip there was no puking from our 7 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin & Alissa",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Fits 2017 Silverado",
      "text": "Fits the headrest in my 2017 Silverado. Holds variety of it tablets/phone. With the larger tablet, Samsung S2, even with the back really tight(adjustment knob for the plate), It kinda feels it could give way after a couple of bounces. Got this to use for our long trip coming up, it will get tested it and will update if it holds up. For the price, this is a good deal. The tension to hold it between the headrest past is pretty strong.",
      "rating": 4.0,
      "verified": true,
      "author": "Islasian4life",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "We like it.",
      "text": "We have a Honda CRV and like this for traveling with the kiddos. We have two of these. On long car rides it does a good job holding up the Nintendo Switch, iPad or kindle. It mounts to the headrest easily and stays upright. It doesn't mount to rear headrests though so we end up just pushing it between the headrest and the seat for my youngest son. It stays like that too so it's great. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Soden",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Pay attention to how far it can expand/retract",
      "text": "This is a great product! I didn’t measure before I bought it and unfortunately it doesn’t fit in my headrest. I needed it to be a little bit smaller. Since I was using this for a road trip I just tied it securely to the headrest and it held my IPad just fine. It also works well for my phone. Just pay attention to minimum and maximum width! Measure before you purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Affordable backseat entertainment!",
      "text": "This plus a $50 tablet with Netflix capabilities makes car rides for my 12 month old son bearable! I’ve always been very against screen time and still don’t love it at this age.. but I figure it’s better than screaming his head off or being depressed from never leaving the house! 😬 The grip is strong enough (with rubber pads) that I’m not at all concerned about it coming loose and hitting my child. It actually takes 2 hands or serious mom skills to release the tablet. It’s been a lifesaver!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki Luna",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Exactly what I needed",
      "text": "This thing is great! I bought 2. Going on long trips, I wanted the kids to be able to mount their devices like a builtin entertainment system. Th They snapped right into place on the headrest posts so that they were at a good height. They were able to hold an iPhone, iPad mini, and a Nintendo Switch (not at the same time, obviously).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Excellent product",
      "text": "This was incredibly easy to install. A 2 year old could do it in seconds. The swivel is so smooth to move around and stays in place. The only thing about it is that the smallest fit does not fit most headrest posts on backseat headrests. Because those are tighter together on most vehicles. That being said, I was able to force it on with taking the headrest off and gliding it up and then squeezing the posts back in. It took a bit off effort but it's on there. A little extra space would have been nice. Otherwise definitely a 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy A. Sheppard",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Good product, but doesn't fit a Tahoe",
      "text": "This was a good overall product, but I had to return because it doesn't fit my vehicle's headrest. I have a 2012 Chevy Tahoe and as you can see in the attached picture, it isn't long enough to hold onto the headrest. It DOES fit in my husband's Silverado, but we don't use his truck often.",
      "rating": 4.0,
      "verified": true,
      "author": "Booknerd28Top Contributor: Baby",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "Not what I thought",
      "text": "Doesn’t fit. The part that holds the phone or tablet is very short. Unless your headrest goes up really high I would not suggest this product. The idea of it is good, it just needs some modification or different model for headrests that don’t go up that high.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Fit my 2020 Toyota Highlander",
      "text": "This fit my Toyota Highlander, but to install it I had to remove the headrest completely first. The metal bars of the headrest were just a little too close together for me to install this without doing so. But it works well. Even fits our full size iPad when we mount it in the horizontal position.",
      "rating": 5.0,
      "verified": true,
      "author": "AMT",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Won’t hold tablet with case.",
      "text": "I was a bit disappointed as other users mentioned they were able to secure their tablet even with a case on. Unfortunately I don’t feel that it holds it securely enough and would more than likely cause the tablet to fall off the mount and hit my child. We’ve opted to use it without the protective case and it works pretty well.",
      "rating": 4.0,
      "verified": true,
      "author": "Marty Z.",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "It’s awesome!",
      "text": "I bought this to put my iPad in for my kids to watch in the car. Both my kids are still in rear facing car seats so I was worried about them being able to touch or kick the iPad. This mount is extremely sturdy and doesn’t even bounce on our dirt road. I was so impressed that I bought a second one for when my oldest graduates to a front facing car seat. Then I’ll have an iPad and a kindle for the kiddos to watch movies. Love it. It’s an affordable option to watch movies in the car if you already own an iPad or kindle.",
      "rating": 5.0,
      "verified": true,
      "author": "RanDee",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Best product",
      "text": "Literally the best thing I’ve ever purchased for my car. This was so easy to install and the best part is it rotates because at first I didn’t think it would fit my iPad which is pretty large and then I have to turn it and it was able to fit just fine I’m seriously in love with this! I bought two of them by accident before I even tried it out and I’m so glad I did because i was able to install one in my car and the other in my mothers car",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Best $10 I ever spent!",
      "text": "I have been looking for a great headrest mount for my 2 kids for a long time. I considered the factory universal mounts from GM which were $100 or more. I’m so glad I found these for only $10!! I bought 2 and they work great. I have a 9.7 iPad and iPad mini and they both fit great and hold while driving. Most importantly my kids stay quiet and entertained the whole drive! I would recommend these to anyone looking for mounts. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "No name",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Easily bumped off the headrest",
      "text": "While the idea is great, instal takes about 5 seconds and it holds our 8 inch wifi tablet without adjusting, it is easily bumped off the headrest. It works for it's purpose, but if you have a kid that wants to interact with the device, have a smaller backseat or have to manipulate the device in any way, it pops off pretty easy. That's both a good or bad thing, if you have a smaller child that doesn't care or a toddler that likes to use their feet on the back of your chair (this kicking the device off the stand). It's worth the buy for a long road trip.",
      "rating": 3.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "What a great idea",
      "text": "I just went on a 14 hour trip with my family and these came in super handy. They fit the Fire HD 10 tablet and it was sturdy the entire trip. I purchased some for my other 2 vehicles so that no matter what car we are in we will be prepared for watching videos. This also did come in handy when my son wanted to play on his Nintendo Switch. The versatility was a great selling point.",
      "rating": 5.0,
      "verified": true,
      "author": "michael w",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Good without case for tablet.",
      "text": "This product seems to work well. I purchased it to hold my son's tablet in our van on road trips. With the case on the tablet it seems to present a challenge but with it off it seems to work fine and hold the table in place. It clamps onto the headrest securely. It literally took less than 10 seconds to install. Once my other child is old enough, I'm sure I'll be buying one for her as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Kete",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Good holder, but we prefer the adjustable model",
      "text": "This is a good phone/tablet holder for the backseat of a car. Tryone makes a deluxe model that is adjustable & can extend toward you. We prefer that model compared to this one, but this one is good for the price. Just be prepared to do everything for the kids in the backseat; because they may not be able to reach it like the adjustable/extendable model.",
      "rating": 5.0,
      "verified": true,
      "author": "RFM",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Did not fit in my traverse but found another way to install",
      "text": "It did not fit the two metal bars in my Chevrolet Traverse headrest, however, I was able to get the handle to sit behind the bars and the mount in front of the bars and push the headrest down so it’s still secure. You should definitely do more testing & possibly come up with smaller handle hooks to adjust to different variations for cars. Still was able to use it, just not with standard installation",
      "rating": 4.0,
      "verified": true,
      "author": "Sabine",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Exactly what I needed",
      "text": "Great way to keep the kids from growing a hunchback from constantly looking down on long car rides. This mount fit everything we threw at it. If your tablet doesn't fit while the mount is horizontal, try turning the mount 90deg and try it when it is vertical. Once I figured out that trick, all was good.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin K",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Buy this!!!!!",
      "text": "These are amazing!!! We got two for our new explorer so the boys wouldn’t look down at their iPads and get carsick. This is so much better than the one with the strap that goes around the headrest as it doesn’t cut into it.! Very size versatile. We plugged an iPhone 8 Plus into it, an iPhone 10, amazon fire, and iPad and they all fit",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda R",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Simple to use for a great price!",
      "text": "I bought this for my son so that i could put my phone on display. He loves the Cocomelon nursey videos on Youtube. Since we hardly watch tv at home i bought this so that it could give him something to watch and enjoy on our car rides. It swivels side to side and up and down. It was easy to assemble and place on headrest. He loves it. I love that he can have something to entertain him. All in all i am pleased with the product, price, and assembly!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Just What We Needed",
      "text": "This product is just what we needed for long car rides with our 1 year old. Once he gets cranky in the car only Blues Clues will settle him. This product holds my iPhone 8 Plus as well as our tablet. It has a tight fit; doesn't fall or shake (and I drive a big pick up truck that doesn't always have the most smooth ride). I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Didn't work for my backsest headrest.",
      "text": "Initially bought to use for the rear headrest on the car so our daughter could watch cartoons on the tablet... however the head rest does not go up high enough to give the mount enough room to tilt so its pretty much useless untill she faces forward in her car seat and we can attach it to the back of the front head rest.",
      "rating": 3.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "the kindles are so heavy they tilt down too much for a kid to comfortably watch a movie",
      "text": "This won't fit in a headrest on a Dodge Ram truck. Also, the kindles are so heavy they tilt down too much for a kid to comfortably watch a movie.",
      "rating": 1.0,
      "verified": true,
      "author": "carissa",
      "helpful_votes": 5,
      "publication_date": 20180126
    },
    {
      "title": "Worked well in the car!",
      "text": "We used this for a very long car trip. Worked great with the iPad. My husband didn’t have any trouble attaching it to the head rest and neither of us had any problems getting the iPad in or out. We would purchase again. The only suggestion I would make would be including an attachment or separate piece that would allow you to suction onto the windshield or something to hold your phone. We won’t get much use out of this product because we don’t take road trips often and use the iPad in the car. If it offered another function it would be even better!",
      "rating": 5.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "goes on easily, the iPad mini fits just fine and my ...",
      "text": "Fits the headrest well, goes on easily, the iPad mini fits just fine and my son can watch movies with it in front of him instead of on his lap. Overall I'm very satisfied with the product and would purchase again if I needed to. It seems pretty sturdy and as long as my kid takes good care of it, I don't for-see needing another any time soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20171229
    },
    {
      "title": "Super easy to use",
      "text": "When I got the box in the mail it seemed from the exterior (that has the install instruction depicted on it) that it was going to be hard to install with lots of parts. But I was really pleasantly surprised when I opened it and there was two parts - both spring loaded and idiot proof. Super easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Sukeforth ",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Why didn’t I buy this earlier?",
      "text": "Fits a fire 8 really well. Would fit an iPhone of any size we’ll too. Wish I’d bought it sooner because it keeps the kids from having a tablet in their lap where they go into dark holes of YouTube clicking new buttons every thirty seconds. With this, they can’t reach it well so they just watch what we put on..",
      "rating": 5.0,
      "verified": true,
      "author": "J-Mac",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Makes car rides easier!",
      "text": "I've had the mount for about a week and so far so good. My 12 month old is content during car rides now. Something to drink, something to snack on, and a good movie to watch while you sit back and relax...what more could you ask for? I used a 10inch Samsung tablet and because of the way my headrest tilts forward slightly I can't rotate the mount. With this size tablet, the mount is stretched to the limit when in use but so far no issues. I'll update if anything changes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "IT JUST WORKS...",
      "text": "This simple tablet holder also doubles for smart phones if you rotate it 90 degrees. The spring loaded legs make it easy to pop in or out. It has been a life saver with the 3 year old on long trips. While it is not advertised for it I have also used it to hang light clothes or a jacket on and it seems to be holding up just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Works as advertised!",
      "text": "Purchased this product so i could play my Nintendo Switch during long drives between states. Installation is super easy, so i can move it between cars. It works exceptionally well as it can adjust size for a Switch, a phone, or an ipad. Sometimes we put movies on the ipad for the kids. The product is sturdy and doesn't move or tilt even after holding an ipad for long hours or over bumpy roads.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Not expensive but sturdy",
      "text": "I got this for my 9 year old so he could use his switch in the car, especially on the longer trips that we go on, without him having to cramp his neck looking down. It will also work with his fire 10 tablet so he can watch the YouTube videos he likes or music videos. He can also use it for his 2DS. Plenty of uses that will make both of us happy. Our next trip is July 18th so we have not even used it in the car yet but he has used it around the house as a stand. Worth every penny already! Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Cunningham",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great product",
      "text": "Overall, this was a great product at a great price. It was easy to put together, easy to install in the vehicle, and easy to put the iPad in it. The device held my iPad well. It did not seem to bounce and shake going down the road. The one draw back was that it seemed to tilt down some and I could not get it tight enough to stay tilted up.",
      "rating": 4.0,
      "verified": true,
      "author": "ARGirl86",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Sturdy Product but maybe not worth the price.",
      "text": "I bought 4 for a car trip with my family for the kids and they work great for the most part and were easy to install. They have under constant use for about 2 weeks and nothing has broken, the only complaint would be the massive logo that they make you look at and it doesn’t support the more bulky cases.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Worked ok, Might not wor on some vehicles.",
      "text": "I have a Ram truck and these worked great for a long trip. However, the only way I could install them was by removing the headrest and collapsing the bar; then sliding the part onto the headrest arms. The unit would not collapse small enough to simply click in.",
      "rating": 4.0,
      "verified": true,
      "author": "D.",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Not my favorite but it works",
      "text": "Be careful if your headrest is on the smaller side, it is a struggle to install it. I would like it to be easier to fit my phone/iPad but the spring really pushes back on you. I don’t love this mount but it does it’s job and I trust it to hold my device and not fall on my baby mid ride",
      "rating": 3.0,
      "verified": true,
      "author": "Erin Engelhart",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Very study",
      "text": "This is super handy for my toddler when in long trips for him to watch or listen to music as he is still on the car seat reverse facing. The only downside to this that it did not fit in my parents car- they have an infiniti Qx80 suv and the headrest for whatever reason is too far away and we could not use it on their car.",
      "rating": 5.0,
      "verified": true,
      "author": "yesse olivas",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Reduces the hunched over posture. Great product, easy to install",
      "text": "My 8 year old used this on our last road trips and we absolutely love it! I love that he’s not hunched over looking down at his screen. I don’t recommend for children who are still in harness car seats as they won’t be able to reach the screen and you’ll need to change the shows for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Twin Mama ",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "I got, \"TVs in the headrest\" (almost)...lol...",
      "text": "Cool device that gives your vehicle that, \"TV in the headrest\" look without the cost or excessive installation material. Only negative is that I purchased a second pair without realizing that the second row headrest were too narrow for installation, definitely something to consider when purchasing...",
      "rating": 4.0,
      "verified": true,
      "author": "DocBolo",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Worth it, careful with your case.",
      "text": "Definitely worth getting for those long car rides. I've never liked my son breaking his neck look down at a tablet in his lap. We have it mounted in a '17 Explorer and it fits well, doesn't fit in my '17 Ram. Holds our iPad well with a slim case. Beware if you have \"thicker\" cases on your phone/tablet, as it may not fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Perkins",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "I was expecting cheap china quality given the price, ...",
      "text": "I was expecting cheap china quality given the price, but this product held up really well! Used it on a 3800 mile road trip with two little kids ages 2 and 4. Definitely money well spent and we will continue to use this on road trips. In hind sight, I would have purchased two of these, as the rotational ability is limited, so only the person directly in front of it can see the iPad screen. So if you have two kids in the back, you will need two of these for sure. I would still give it five stars even with that con.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great product",
      "text": "Bought for my daughter who likes to watch videos while we are on the road, it's helped so much now that she can put her phone in the holder and not have to constantly look down. Fits on the post of the headrest and adjust easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Shonda Cruz",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Life Saver",
      "text": "We love everything about this Phone Holder. It is really a life saver. If we ever want to drive more than 1 hour with our baby, we will need this holder for sure to play some of her favorite cartoons; otherwise, she will cancel the trip :) It takes just two seconds to install it. It is also very easy and quick to put the phone on it. You can also tilt and adjust the angle as you wish. We have been using this product for two months and everything has been perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Soner",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Ok, but could use improvement",
      "text": "Doesn’t work well if an iPad is in a protective case. The clips are not large enough to clip around the case. Also the holder is pretty shallow so depending on the thickness and shape of your seat or headrests it may not work well with a tablet",
      "rating": 2.0,
      "verified": true,
      "author": "George P Burdell",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Measure distance between metal bars on headrest first, but GREAT product!",
      "text": "We use this for my kids tablets so they aren't getting car sick by looking down in the car. Very solid, easy to put on headrest, and very adjustable. Recommend! Just make sure you measure distance between metal posts on headrest first. It was too wide to attach to our Outback's headrest the traditional way, but i could do it by sliding it off the seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Worth every penny, easy setup, great price",
      "text": "Easy to install, sturdy once installed. I use this nearly every day, to secure my daughters Android tablet in my car. This one actually holds the tablet, and doesn't let go of it like several others I've tried. Buying another one for my brother in law. Would buy this a third time if the need arises.",
      "rating": 5.0,
      "verified": true,
      "author": "Boosted_Cajun",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Helpful and useful!",
      "text": "Absolutely love this thing! It’s a lifesaver so my child can stop throwing the tablet or can play with his toys while watching the movie. Great for car trips! I watch my movie all the time in the backseat! Very sturdy .",
      "rating": 5.0,
      "verified": true,
      "author": "Mkg",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Stops The Tears",
      "text": "When I have to run errands with my grandson I would give him my cell phone to watch his favorite nursery rhyme songs. But listening to his cries of discontent I bought this great headrest car mount. It's great for a cell phone but the springs don't adjust wide enough to put in a tablet horizontally but it will fit vertically.",
      "rating": 5.0,
      "verified": true,
      "author": "Walkitout",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Sturdy Little Mount",
      "text": "I was a little skeptical at first because this is very small and seemed a little flimsy. I was wrong. We just used it on our 800+ mile trip for our kids and it held up the whole time. I like that it has holes on the side of the mount which allows you to charge your device or plug it into the car speakers. Great buy and device!",
      "rating": 5.0,
      "verified": true,
      "author": "Biff McGregor",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Only works on front headrests",
      "text": "This product has worked fairly well for our needs. My only complaint is that it only fits on the front headrests of our car, and not on the rear headrests due to the bars being closer on the rear. It only retracts from one side, so it’s a fairly limited range of movement that it has. We originally bought it to mount an iPad between our two rear facing kids in the backseat, but it didn’t fit on the back seat headrests. We ended up just having to wedge it under a headrest, but it still held up the iPad so in the end it did the job, just not as well as I would have liked.",
      "rating": 4.0,
      "verified": true,
      "author": "Travis Bates",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Just what I was looking for",
      "text": "Great product! I love this. It’s better than what I was using before. It was super easy to install. It fits my daughter iPad and my iPhone XR. I also love that it’s flat and sleek and now my daughter cannot reach it with her feet to kick the iPad.",
      "rating": 5.0,
      "verified": true,
      "author": "TheresaB25",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Not quite deep enough",
      "text": "This is a solid product. It does it's job, but the overall depth isn't enough to get past the back of my headrest. Maybe it is just my vehicle, 4runner, but it needs about another inch from the crossbar. Other than this issue it is a solid product.",
      "rating": 3.0,
      "verified": true,
      "author": "The Crow Flies Straight",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Careful around older kids?",
      "text": "Honestly I found myself not getting much use out of it but it felt sturdy enough wen I did. My brother not paying attention getting in the car too fast broke it clean which I think means it honestly isn’t sturdy enough so I would get another option or no option next time.",
      "rating": 3.0,
      "verified": true,
      "author": "Frank Fernandez",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "A must have for the kids",
      "text": "This product overall is a must have. I purchased two of these to have the kids entertained while on road trips. I would give it a 5 star but the clipping part that hooks up to the car doesn’t close quite enough to fit all vehicles. On my wife’s suv it works just fine, but in my car it doesn’t clip on securely. But overall this a great and sturdy product.",
      "rating": 4.0,
      "verified": true,
      "author": "Pancho",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Fits Kids kindle fires",
      "text": "Took a road trip with my daughters and after playing and watching game/movies on their Kindle, after an hour or so their necks would get crampy. I realized it’s because they kept looking down. So I came on amazon and looked up head rest mounts. I was a little hesitant when ordering afraid it would fit the kindles but These work perfect for my them.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Just what we needed",
      "text": "Easy to install and secure enough to hold either the cell or a tablet. Being able to install quickly and move between cars is a plus. Also being able to remove it so it is out of sight out of mind is an added bonus",
      "rating": 5.0,
      "verified": true,
      "author": "JWP",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Easy to use and great for trips",
      "text": "Definitely a necessity for long car rides for the kiddos. Clips on very easily and doesn't raise my head rest too high which is a plus for me. Helps keep the kids entertained when they get antsy and mskes it easier to use while charging so the charging port doesn't accidentally get bent.",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer d",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Buy it!!! All around GREAT!",
      "text": "It's just as stated and worked GREAT for our road trip from CA to TX to keep our little ones occupied. Easy enough for a 6 and 8 year old to put their tablets in and out by themselves. Would absolutely recommend and buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Life Saver!",
      "text": "This phone/tablet mount has been a lifesaver in car rides with my toddler! Very easy to install and move between cars, you literally just pull it off. My iPad fits easily but without the protective case. Not a deal breaker though. Would def recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Juarez",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great tablet/phone mount for the back of a car seat",
      "text": "I recently purchased this for a cross-country road trip for which I knew my toddler would need some entertainment. It worked exceptionally well. It held an iPhone and an iPad Mini securely without any issues. It was stable, didn't bounce or shift around, but was easy to adjust when needed. I really have no complaints, it worked very well for my needs and I anticipate it will last, as it seems to be well-built.",
      "rating": 5.0,
      "verified": true,
      "author": "Another Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Not universal, does not fit.",
      "text": "Not universal, didn't fit in my 2016 Ford Escape or my parents 2019 chevy truck. Unfortunately bought it too early before our trip and didnt try it out beforehand so now I cant return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Carli",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great for road trip. Works with multiple devices",
      "text": "The mount fit our iPad mini and Nintendo switch. Sooo helpful for a solo road trip with 4 kids. My kids were thrilled to have this in the car. Would recommend to others. I love that it clipped into the headrest so easy!!",
      "rating": 5.0,
      "verified": true,
      "author": "pennepacker",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Great sturdy product! Kids love it!",
      "text": "My kids love that they are able to put their iPads or phone on it so easily and be able to watch hands feee. I love that it’s able to easily rotate 360degrees and easily to install. One thing I would like to point out: it does NOT fit the bigger iPads. It does fits a iPad MINI w/ case though.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "A must for child travel!!",
      "text": "This thing has made my commuting life with a toddler amazing! There is no installation, it literally slides open and hooks onto the metal rods that hold up your headrest. It holds my iPhone or our iPad perfectly. It slides open evenly from both sides and you can spin it to horizontal or vertical while it’s installed. I LOVE it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Wright",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Product device doesn’t fit the standard Nissan Altima",
      "text": "Disappointed to buy this only to see that the measurements are not accurate to fit in my car. The device does not fit the headrest in my Nissan Altima. Disappointing to pay the money and not have the device work.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Measurements in description are wrong",
      "text": "Seems like a good product, but the measurements in the description are wrong. It says when collapsed, its 4.2 inches, it should say 5 inches. This means it wont work on my vehicle as It doesnt go small enough to fit between the headrest posts.",
      "rating": 2.0,
      "verified": true,
      "author": "m",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Build quality is great and worked out well for ipad pro and ipad air.",
      "text": "Amazing first impression. Build quality is something that I worried about - it is really good. Nice build and looks like it will last. Value for money and installation was a breeze. Kids already enjoyed it for a ride of 30 mins and everything worked well. The stand/mount is firm and didnt budge for any bumps in the road. We use the mounts for iPad pro 9inch model and ipad air 2 regular size. Both fit in well. Bought two of them for two kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Santosh",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Nice but mines not sturdy",
      "text": "The color is nice, easy to install, but for some reason the one I had is not sturdy, no matter how tight I tighten the screw. It is very slim and fit nicely to the back of the head rest, it could be difficult to reach if your second row has extra leg room; it is a nice item, but maybe just my bad luck had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Bing Yiu",
      "helpful_votes": 0,
      "publication_date": 20190307
    }
  ],
  "product_meta": {
    "title": "Car Headrest Mount, Tryone Tablet Headrest Holder Compatible with Smartphones/Tablets/Switch 4.7\"-10.5\", Headrest Posts Width 4.9in-5.9in(Black)",
    "rating": 4.6,
    "feature_bullets": [
      "【Convenient Design】One-handed installation and release within 2 seconds.",
      "【Compatibility of the headrest】The distance between two metal posts on your headrest should be 4.9in-5.9in.",
      "【Compatibility of the device】Compatible with smartphones/ tablets/ Switch 4.7\"-10.5\". It is the screen diagonal measurement, not the width.",
      "【Adjustability】Multi-angle rotation to adjust for the best viewing angle.",
      "【Statement】Whenever there is any quality problem you meet from our product, we will take responsibility and solve it to your satisfaction immediately."
    ],
    "specifications": {
      "Package Dimensions": "7.5 x 3.8 x 2 inches",
      "Item Weight": "4.8 ounces",
      "ASIN": "B074YYYNJ5",
      "Item model number": "TO-23",
      "Customer Reviews": "4.6 out of 5 stars3,178 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#4 in Tablet Mounts",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 28, 2017",
      "Manufacturer": "Tryone Direct"
    },
    "categories": [
      "Tablet Accessories",
      "Computers & Accessories",
      "Electronics",
      "Mounts"
    ],
    "price": 12.89
  }
}