{
  "website_summaries": [
    {
      "verdict": "A bold, casual style with an extra touch of flair.",
      "pros": [
        "Old-school, distressed look",
        "Comfortable enough for all-day wear",
        "Vegan-friendly pieced fabric upper with grommets",
        "Comes in a variety of colors",
        "Contrasting lining, lightly cushioned fabric footbed",
        "Rubber outsole"
      ],
      "cons": [
        "Little arch support",
        "Not as easy to slip on as other styles"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very cute but you need a shoe horn to get them on",
      "text": "I was going to return these, I HAAAAAATTTE returning items. The way they are designed makes it extremely difficult to get my foot inside. I was actually sweating trying not to destroy the heel . As I wear them around the house they seem to be loosening up. So of course now I cannot return them if I wanted to. Poor stitching. If they last a month I’ll be surprised. Blowfish used to be my favorite brand. I don’t know what happened to them. Very cute shoes though. Brought back memories of trying to put shoes on Barbies as a kid. Weird , odd design.",
      "rating": 2.0,
      "verified": true,
      "author": "Royce's mom",
      "helpful_votes": 54,
      "publication_date": 20180404
    },
    {
      "title": "Cute, comfortable shoe",
      "text": "These shoes are awesome. They fit great and I ordered my regular size, size 8. They are probably some of the more comfortable shoes I own. Buy them cause they are really cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Hall",
      "helpful_votes": 50,
      "publication_date": 20170913
    },
    {
      "title": "Simply love them. Comfortable and hip",
      "text": "Simply love them. Comfortable and hip. Doesn’t matter what shoe I order from blowfish this size is always consistent. Often when I transition from flats to wedges there may be some Size variations. For example, I’m normally a 8 and Nike tennis shoes. But a 9 Jessica Simpson or west nine heels. I own five pair of blowfish and every single one is an 8 1/2 and they all fit perfectly. They’re all holding up well despite one pair being five years old. Definitely a brand I trust.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Green",
      "helpful_votes": 40,
      "publication_date": 20171128
    },
    {
      "title": "Especially appropriate for Election Year",
      "text": "I’m a huge fan of Americana decor, apparel and shoes. I’m very proud to be an American. These shoes fit the bill AND my feet😊 Slip-ons are my favorite as I have a bad back. The colors are exactly as pictured. Comfortable and fashionable.They are frayed around every seam. I like this look very much. I’ll be wearing these a lot..Election year and every time I feel patriotic and that’s every day. GOD BLESS AMERICA!!️🇺🇸🙏🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 17,
      "publication_date": 20200604
    },
    {
      "title": "CUTE AND LOOKS REALLY COOL!",
      "text": "I LOVE this shoe. It is my second pair of Blowfish Malibu \"sneaker-type\" shoes. The first pair was a high-top zip-up canvas in a washed grey and they are wonderful, also. The blue color of this shoe looks like well-worn jeans, which is a really good clear color (not muddy-looking). Slips on, no laces, looks adorable, especially with pants that are ankle length or shorter. The fit is perfect length-wise (6 1/2) and is of a sufficient width that I was able to wear the medium width when I usually take a wide. CUTE, CUTE, CUTE!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 31,
      "publication_date": 20171018
    },
    {
      "title": "Love these!",
      "text": "I recently purchased a blue pair that I absolutely love so I had to get another pair. I am an 8.5-9 in sneakers depending on the brand. If you get these DON'T BE DISCOURAGED if they are tight to get on!! They will stretch!! My blue pair was stretchy where the lace area is and not tight like this pair was, so getting this pair on was a challenge for me as I have big/ wide feet, but after getting them on and wearing them a few times, they easily slip on & off and haven't lost their comfort.... I will definitely be buying more colors!",
      "rating": 5.0,
      "verified": true,
      "author": "DaniDizzle",
      "helpful_votes": 12,
      "publication_date": 20190827
    },
    {
      "title": "Comfortable & stylish",
      "text": "I have several pair of these and love them all. My foot is slim, not narrow. Normally need a well built arch support or feet will hurt. Not so in these. I feel like they are loose and very comfortable, however not so loose that they come off while walking or cause blisters from rubbing up and down. I normally wear a 7.5 and order this size every time even though I say next time I'm going to size down but then think why? These are great! (If you like a snug just right fit I suggest half size down). But they are perfect to just slip on and off when you want quickly. Recommend every color!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "BamiRose",
      "helpful_votes": 7,
      "publication_date": 20190817
    },
    {
      "title": "Very slippery bottom",
      "text": "Mixed feeling. When I opened the box, I loved them immediately. Then when I put them on, I let that those hurt my insteps a bit. I am hoping the shoes stretch out some day because I would like to keep them. Also, the soles are very slippery almost anywhere. (Converse did not have such issues) I hope no one (Including myself) would not have an accident because of these slippery shoes!! Be aware!!",
      "rating": 3.0,
      "verified": true,
      "author": "bucksbunny-22",
      "helpful_votes": 6,
      "publication_date": 20191002
    },
    {
      "title": "Great, comfortable sneakers!!",
      "text": "I purchased these in the deep plum hipster smoke color. They are a deeper purple than shown on my monitor which was great because I wanted something just a bit darker. These are not a true royal purple, however. They are somewhere in between - very pretty. I already owned these shoes in white, so I knew they would fit true to size & be really comfortable. I would definitely recommend them to anyone wanting comfortable, but fashionable sneakers. The price is excellent as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 7,
      "publication_date": 20190101
    },
    {
      "title": "but a little disappointed.",
      "text": "I ordered this pair of shoes to replace some Rocket Dogs that I used to walk my dogs. My dog walking shoes always take a beating, so I didn't want to order anything too expensive. These are ok for walking the dogs and wearing shorter distances, but I would've returned them if I wanted this as a fashion shoe. The toe box is pointed and feels a little narrow. Plus, they come up higher on the ankle than I was expecting and have very little ventilation. Ok, for what I'm using them for, but a little disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "April Darley",
      "helpful_votes": 8,
      "publication_date": 20180820
    },
    {
      "title": "My wife wrote this review --- OMG - I love these shoes so much",
      "text": "My wife wrote this review --- OMG - I love these shoes so much. I can't say enough great things about them. I hadn't heard of the company but wanted some rose gold shoes that would go with anything. Inside they look more gold and outside more pink. I highly recommend them and will buy more from this company in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 9,
      "publication_date": 20180403
    },
    {
      "title": "The chic sneak.",
      "text": "I walk a lot and I hate shoelaces so these are perfect casual sneaker. Sporty but yet feminine. These look great with all my genes, capris and shorts. I've got them in every color available. Had to buy from Amazon and another supplier to get them all! Fit like a glove! They have great support for a slip-on. The tongue does come up a little high, so I use a shoehorn if I'm in a rush to get going. Comfortable enough to wear them all day. Great for taking long walks with my dog!!! Love, love, love these!",
      "rating": 5.0,
      "verified": true,
      "author": "Dolores",
      "helpful_votes": 8,
      "publication_date": 20171026
    },
    {
      "title": "Love my new Blowfish Play shoes!",
      "text": "I have had my Blowfish Play shoes for 2 months now. I am a busy mom and usually wear them around 12+ hours a day. They are so cute and comfortable. I wear a size 9 and they are just right. Since they don't have laces, the first couple of times I put them on it was a little snug just getting my foot in the shoe, but once it was on they felt so good. Now they slip in easier. They seem to be pretty durable. I teach all day and go to the football game and come home and they still look and feel great!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy D",
      "helpful_votes": 8,
      "publication_date": 20171008
    },
    {
      "title": "Perfect shoes",
      "text": "I love these sneakers. This is my second pair and I plan on buying more. I have had foot pain and plantar fasciitis for years. I stand all day and I have had no pain with these shoes on. I’ve also gone for works in them and still no pain. I highly recommend giving them a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Trax",
      "helpful_votes": 3,
      "publication_date": 20191104
    },
    {
      "title": "Returned wrong size",
      "text": "My niece loved the look of the shoe, but they ran too small. I returned them, took a long time for the package to get back to MFG. Then I was charged from my refund for the return \"Less Outbound Shipping Label: $9.95 and Less Amazon Return Label: $5.95\" . Be careful who you buy through Amazon from I guess. I ended up ordering a larger pair through another provider, but I ordered 1 size up and hope they fit UPDATE: Purchased a size up and they fit!! My niece loves them so everything ended good.",
      "rating": 3.0,
      "verified": true,
      "author": "Hi ",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Fit as expected",
      "text": "Good purchase, especially for the price. The shoe fits as expected. I typically wear a 6.5-7; I ordered a 7. Without socks (the no show socks are ok), the heel slips a little but not bad. They are not too tight in the toe and the side of the sole does not come up too high in the toe. I ordered the dirty grey color and love it. I have not worn the shoes for a long time but am happy so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca Hendricks",
      "helpful_votes": 2,
      "publication_date": 20190326
    },
    {
      "title": "My Happy Birthday shoes!  Love them!",
      "text": "These match my type dye dress that I bought at a 4th of July frestival and are comfortable (not as cushy as Skechers). They start being easier to get your foot in as you wear them several times. Fashion shoes not for a day walking around Disneyland. I bought my true shoe size 7.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 2,
      "publication_date": 20200601
    },
    {
      "title": "Cute shoes!",
      "text": "Love these cute shoes despite the fact that they are a little tough to get on. You have to really shove your foot to the end and then work the back up on your heel. That sometimes causes some of the inside material to bunch up, so you have to work on that to get it smooth again. I am sure the more I wear them the more they will give/stretch and it will be easier. Once on they are comfortable (not much support, so very similar to converse), but great casual day shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "So So",
      "text": "From a third party seller, they arrived on time. Fit felt good in my home, felt wider than converse but after wearing them in public for less than hour I got multiple blisters. Main problem being that not even 10 minutes into wearing them outside the insole began to move and drove me crazy! Contacted seller for a return request right before I wrote this review, will update as time goes on. Whether they are help or not. Rating on shoes- 2/5 (I’m extremely picky, not for wide feet) Rating on shipping- 5/5 (on time not damaged) Rating on customer service- TBD",
      "rating": 2.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Super cute",
      "text": "These adorable shoes are awesome! They go well with everything - leggings, jeans, kahkis, etc. I wear them to work as a teacher, and they are comfortable for standing all day. I don't think I'd wear them for a trek downtown, but otherwise, they are great. They do loosen up, so a bit tight at first, but as I wear them in, they get better. I get lots of compliments from my students on them :)",
      "rating": 5.0,
      "verified": true,
      "author": "Shoppin in Wisconsin",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Read my review.",
      "text": "When I first got these shoes I was excited they were cute they fit and they were stylish. I wore these shoes for less than 30 minutes and I got blisters on both pinky toes and blisters on the bottom of my feet! Not only am I upset but days later I am still in pain. I’ll never order these again! And I don’t recommend anyone to purchase these!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "Flower sneakers make my toes giggle",
      "text": "I giggle when I look at my toes now that I have my flower sneakers. Purchased to make me smile, these shoes haven't let me down. The size and fit are as expected and the arch support, while not lush, is adequate for all day wear. The white canvas background won't be for everyone as the do show dirt, but the trade off is acceptable to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Very comfortable",
      "text": "If you want shoes that make you feel nearly barefoot, Blowfish is the way to go! I have several pairs in different styles, and I love them all. These do not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "VLP",
      "helpful_votes": 3,
      "publication_date": 20181231
    },
    {
      "title": "Love these shoes.",
      "text": "These are so cute!! If you are on the fence about these go for it! You won't be disappointed. I wear a 7.5-8 so i ordered an 8 and it fits perfect. Not to tight. Does not rub anywhere. A lot of shoes o purchase rub my right pinky toe but these thankfully don't. I did put a little extra insole as i like lots of cushion. I love tie-dye and these are perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Kresin",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Buyer beware! Might not be what you ordered. *UPDATE BELOW*",
      "text": "Buyer beware. My wife loves this brand of shoes and her white ones have seen better days so I ordered the white smoke pair as a surprise. However, what I got was The white Cozumel style that isn’t all white but has the red and blue stripe around the sole of the shoe. I guess they don’t think it’s important to make sure the customer receives what they paid for. Oh well. She said it’s too much hassle to send back so she will keep them. *UPDATE* SHOES ARE THE MOST UNCOMFORTABLE, BLISTER INDUCING FOOTWEAR SHE HAS EVER WORN AND NOW SIT AT THE BOTTOM OF THE SHOE RACK TO NEVER BE WORN AGAIN. SUCH A WASTE.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Rix",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Just as pictured!  Cute!",
      "text": "I had this same pair in white so I knew I needed a size 8. I normally where a 7.5 in some shoes and 8 in others like these,Rocket Dog, and Nike. These are super cute and are the color of that in the picture. I love these shoes they are super easy to put on and are very comfortable. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Irvine",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Very cute but narrow",
      "text": "Ok ...so I’m going to be fair because I have a strange situation with shoes. I really wanted to love this shoe because it is so cute, but I was in a car accident a few years ago and it left my right foot severely swollen and incapable of finding a shoe that fits properly. With that being said this shoe is extremely narrow in my opinion despite having a bad ankle. So it is super cute and made for those who have skinny feet. Wish I could wear them. 😭😭😭",
      "rating": 4.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Not comfortable",
      "text": "I bought this product in place of my converse. Which was awesome. I saw all the reviews of how comfortable it is, and cute! I admit it is cute, but comfort is a stretch for me anyway. Toe box was too tight, not enough support for arch and I don’t have flat feet. Love the color.",
      "rating": 2.0,
      "verified": true,
      "author": "G STANLEY",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Super grungy and retro",
      "text": "These were super uncomfortable for the first 3 days. And magically on day 4, I can wear them no problem. I do use no show socks, shoes seem a little narrow in toe box area, but it’s fine. I’ve worn for hours and even a short hike with little to no discomfort. Will buy again in another color.",
      "rating": 5.0,
      "verified": true,
      "author": "HLBEskimo",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "I look sooo cool!",
      "text": "I am not a \"tennie\" person...give me stiletto's and strap-ies please. BUT, there comes a time and if it is now, I'm sticking with Blowfish. This is the second pair I've purchased on Amazon. They're true to size, \"in\", comfy and I realize you don't have to look like a tacky old lady when wearing flat shoes. Yay for Blowfish and thanks Amazon! (Not sure I would want to walk a mile in your shoes, but cute and comfy are just what I am looking for!!) jb",
      "rating": 4.0,
      "verified": true,
      "author": "Julie B.",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "As expected after reading reviews.",
      "text": "Love these shoes. Once you get them on, which is a struggle unless you use a shoe horn, they are very comfortable. Hint, do not try with socks unless your socks are real thin. Barefoot is the easiest to get these on, again with a shoe horn. I am hoping after several wears they will stretch enough to not need a shoe horn.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Bowie",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "My favorite shoes. I need these in every style.",
      "text": "I have a grey pair of these and I LOVE them. I’m so happy I found them on amazon and in red too!! These are very comfortable and light, Easy to slip on and off, and The perfect day/beach shoe. I’m an 8.5/9 so I ordered the 8.5 and they fit perfectly! I’ve put my grey ones through the ringer over the years and they’re still in great shape. And they go with everything!! I don’t recommend wearing them in weather below 45°, your feet will be very cold! It’s a very breathable shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Lex",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Perfectly playful floral shoe",
      "text": "I purchased a 6.5 in Off-white Flowerfest Print and they fit perfect. The floral pattern was beautiful, however I couldn't give it a full 5 stars because of the seam work, as it was flawed in some parts. Though the overall fringed look makes the minor defects blend in. The shoe has a playful casual look, and are exactly what I was looking for. The floral design has roses and butterflies. With such a wide range of colors on the pattern, the shoes will go with a lot of outfits.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany H",
      "helpful_votes": 3,
      "publication_date": 20190207
    },
    {
      "title": "Darling!",
      "text": "I have a wide foot with shorter toes and fit a 7.5W or 8M in every shoe I've ever ordered. The 8 fit as expected and look cute as can be. I've only worn them around the house so cannot attest to a full day in them but assume it will be like any other canvas shoe I've owned. I really like the distressed style and expect to be trimming threads here and there for the life of the shoe and the reasonable price makes it all worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "SD Dominik",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "LOVE",
      "text": "These shoes are adorable! They are more blush colored in person than they are in the picture, but I liked the real color even better. I had an off-brand black pair that I really loved and I decided to get the real thing. Plus, they’re super comfortable. I wasn’t disappointed :) Let me add, I have narrow feet and these definitely fit narrow feet better. If you have a wider foot, I would recommend going 1/2 a size or a full size up. Anyone who wants these should definitely just get them. It’s worth it! Update: I brought it down to four stars because the customer service wasn’t great, kinda disappointing :(",
      "rating": 4.0,
      "verified": true,
      "author": "Leyla Thomas",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Awesome shoes and Price! No “Shoehorn” Needed",
      "text": "Some reviews people wrote say they had to use a “shoehorn”, my personal experience! I had no problem putting the shoes on, opening of shoe, I did not find extra narrow, there are elastic bands inside the shoe, I don’t have an exceptionally wide foot or an exceptionally skinny foot, they fit perfect I love the shoes so much I bought two more pairs! Can’t wait until they have the white ones available in my size so I can buy them as well!!",
      "rating": 5.0,
      "verified": true,
      "author": "BRBLEE",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Great shoes",
      "text": "I already had a pair that were red and blue with white stars, so I knew they fit. I love them. They don't have a lot of arch support. They are comfortable to me, as I have wide feet up front, narrow heals. I have no issues. They are cute. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "ZoeyB.",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great fun shoes !",
      "text": "I love these! The are a little tight to put on but are fine once they are on. True to size. Comfortable but not for working out or long walks because there isn’t much arch support. Still fun to wear and I would definitely recommend them to anyone!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Aycock",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Just buy them!",
      "text": "I was going back and forth about purchasing these because the ones I wanted were not available for prime. I decided to go ahead and order them because I already had them in white and knew the quality would be worth the wait. I ordered on Friday afternoon and they arrived Monday at 11:00 am without Prime!! They are absolutely adorable and I’m glad I decided to purchase! Size is TTS but if you wear thin socks you COULD 1/2 size down but I don’t think it would matter either way!",
      "rating": 5.0,
      "verified": true,
      "author": "Meggie",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Perfect fit",
      "text": "I have small yet wide feet therefore new shoes are literally a pain to break in. But these fit perfectly and comfortably right out of the box. The canvas is soft and thick so I think I’ll get years of wear out of them. I ordered a 6 1/2 which is usually what I wear except for boots, my wide feet always need a 7 in boots for some reason.",
      "rating": 5.0,
      "verified": true,
      "author": "stilllookin",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Potential fall risk, slippery soles",
      "text": "I like tye dye alot so i really love these shoes. However i must warn especially if you are older there is a fall risk. The soles are very slippery on slick surfaces such as linoleum. Im 62 and i almost fell in my kitchen. I thought perhaps there was something on the floor like water or something else but there wasn't. Just the soles are slippery. They dont look like they would be but they are. So walk with care or find another shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Timothy A Heyne and Catherine Heyne",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Damaged  but too late to exchange",
      "text": "I ordered these adorable shoes over a month ago. I had knee surgery on 9/19, so today was the first time I went to put on my shoes. The right shoe is defective in where the back of it on the inside is as if it was not manufactured right. There is absolutely no way I can wear these shoes. They are in perfect condition, you can tell they have never been worn, and I have no way to do anything about it but throw my money down the drain. In this case, I wish I would have bought from a local store as I know they would have worked with me on it.",
      "rating": 1.0,
      "verified": true,
      "author": "Madison Lavenz",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Sad to return these....",
      "text": "I LOVE these shoes. I ordered the red/white/blue ones and they are so cute, and seem comfy, but they are too small. I am normally an 8.5/9 depending on the shoe, and my other pair of Blowfish shoes are 9's (comfortably), so I ordered a 9 but they were too small. :( I thought maybe I could make them work as the 9.5 is out of stock, but even just walking around in my closet for a minute squished my toes. I hope to find them somewhere in a 9.5. They are definitely a challenge to get on as well.",
      "rating": 3.0,
      "verified": true,
      "author": "sunshine",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Can't get them on",
      "text": "I am returning them. 1 review said they were narrow width which my feet are. Loved the look. However, I couldn't get them on, even with a shoehorn. The opening to insert foot was too short. This was mentioned by another reviewer. The problem seemed to be the heel area has no backing so it collapses quite easily. I would have kept them if I could have gotten them on.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Cute sneakers",
      "text": "These sneakers are so cute! As said in other reviews, I need a shoe horn to put on so I don't ruin the backs but that's ok. Once they're on, they feel good. I have a bunion on one foot so that one felt a bit too tight but I've kept wearing them for a couple days and they're stretching to feel better. I'm glad I got my usual size of 7 instead of sizing up; my heels would've slipped if I did. I may get the grey ones next😁",
      "rating": 5.0,
      "verified": true,
      "author": "B Butts",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Small and narrow",
      "text": "So this is the second pair of blowfish brand shoes I've tried and these are just not worth it in my opinion. This brand runs small. These are very narrow. I don't usually have trouble with any shoes really but this brand something is off.",
      "rating": 1.0,
      "verified": true,
      "author": "Carmen G",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Pretty color but...",
      "text": "First the color is pretty - I ordered the deep plum. However I’m glad I didn’t pay more than what I did. I just received yesterday and put these on to wear today for the 3 hrs I work at elementary school - not even 2 hrs in them and the rubber is already showing signs of pulling away from the material of the shoe 😏 and the “distressed” frays on the shoe are really coming off - I’m hoping the fabric doesn’t fray so much I get holes!?!? This is the first of this brand I’ve tried and was doing so off recommendation of others. Not sure how these will hold up...",
      "rating": 2.0,
      "verified": true,
      "author": "whoiam2day",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Pleased",
      "text": "VERY cute shoes. Comfort is just decent but I tend to add inserts to my shoes anyway. Fit is true to size but might be snug for some and possibly even more snug with inserts. Though this size works OK me bc I usually wear thin socks, I wouldn’t mind having gone half a size up in case I ever wore thick socks. These shoes go with everything❣️ Buying more in other colors/patterns!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Gables",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Super comfy and cute!",
      "text": "The first time my order arrived I received a white shoe. However, I was quickly sent the correct shoes as a replacement. I wore them yesterday and love them. I am on my feet 90% of the day and they are very comfortable. I already own the red buffalo check tennis shoes so I knew the cheetah/ leopard color would be great, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimkbs",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Fun \"kicko",
      "text": "Comfortable and fits well. I usually wear a 8 or 8.5 in athletic shoes. Needed these in 7.5. I have 3 other pairs and really do like this brand. Fun prints. Easy to slip on. Bottom may seem a bit slippery at first but scuff them up a bit and they will be fine. I have thrown them in wash too and air dry come out great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "These. Are. Awesome.",
      "text": "Y’all, Blowfish Malibu sneaks are awesome. This is my third pair. I love ‘em. They slip on easily but aren’t loose. I have pretty bad arthritis so tying shoelaces is a no-go. I can wear these all day and my back doesn’t hurt. For realz. Lots of color/design options, too. I get compliments ever time I wear a pair. No joke. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassidy",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "No support",
      "text": "I had to send these shoes back because they offered no support - and I mean none. Also, the tips of the shoes on the bottom were extremely slippery on bare floors. The toe was snug but the shoe was wide for my foot.",
      "rating": 2.0,
      "verified": true,
      "author": "Leigh Cherie",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Super cute shoes!!!",
      "text": "Really cute shoes! They were out of stock and I signed up for a email when they came back in stock in my size I received an email about a week later to notify me that they were in stock. I bought immediately because I am a proud American. They fit great and look fantastic. Thanks Blowfish for the red, white, and blue!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "mountaingirl",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Well Made, but seem to run small",
      "text": "These sneakers are very well made, look great and feel comfortable over all, except they seem to run a bit small. I have fairly narrow, small feet and had to return these as there wasn't enough room in the toe of the sneaker. Very disappointed, as they were otherwise perfect and I wished I could keep them.",
      "rating": 3.0,
      "verified": true,
      "author": "K. J. Waters",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "SUPER COOL LOOKING SHOES!",
      "text": "This shoe fits perfect. True to size, actually a little roomier than I expected. I was initially a little hesitant because some people said they were hard to get on. This was not the case at all , you can put them on with ease and the hole is in no way too small, if it were bigger they would gap and wouldn't stay on your feet. All in all , I am in love with these shoes. I purchased the tye dyed and a pair of white too. Can't wait to go sport them around 💕",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri M.",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Comfort cute",
      "text": "These are so cute and the color is fantastic. They do seem to run large, I have a wide foot and I could have ordered a size smaller, but they still fit ok and are so comfortable. I had another pair and couldn't remember the size I purchased and no label with size on my pair. I ordered my usual but should have ordered smaller.",
      "rating": 5.0,
      "verified": true,
      "author": "shoe horse",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Glad I ordered them !",
      "text": "I usually Can’t order shoes online because I have very odd size feet. Toms are the only shoe I can get a guaranteed fit. I looked at the reviews on how the sizing runs, and ordered an 8 1/2 and it fits perfect I wear an 8 1/2 there’s a little room left to wiggle to wear thicker socks. I think they’re perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Go up 1/2 size",
      "text": "So cute, I got the tie dye. I went up a 1/2 size & were a perfect fit. I wore them immediately & was able to wear without socks. I typically wear an 8 & according to reviews I decided to buy half size larger. So glad I did. I have a semi wide foot. Maybe if you had a thin foot you won’t need to go up in size??",
      "rating": 4.0,
      "verified": true,
      "author": "Canya62",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Cute but uncomfortable",
      "text": "These shoes are so cute but after only wearing them for about an hour, my pinky toe was raw. I had no show socks on but they didn’t help with comfort at all. I have very average feet...not wide or narrow. Such a shame because they are cute.",
      "rating": 3.0,
      "verified": true,
      "author": "Stacy from AZ",
      "helpful_votes": 2,
      "publication_date": 20180128
    },
    {
      "title": "Great colors no arch support runs wide",
      "text": "No arch support buy exact size or half size down. Don’t size up at all. I did & had to return them to famous footwear & order them off of here to get the size I needed. Color & design as described on site. I have the red & American flag both are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lper1234@",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Cute but tight",
      "text": "Super cute! I agree with another review though, they are hard to get on. The heel has no flex and makes it tough to pull up.",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa",
      "helpful_votes": 2,
      "publication_date": 20190917
    },
    {
      "title": "Love blowfish but..",
      "text": "Love blowfish shoes. However I couldn't get my foot in the shoe. I know I didnt order narrow I have wide feet So I was super shocked and disappointed that they didn't fit. Worried to buy any others.",
      "rating": 2.0,
      "verified": true,
      "author": "deana",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Love these shoes. Super cute",
      "text": "These shoes are so cute! I also purchased rustoleum boot and shoe spray to protect them from stains. I read it was better than scotch guard. So far so good! I normally wear an 8.5 so that’s what I got and I’d say they fit true to size. They’re really cute and comfortable. No blisters. I also wore the low no show socks with them. Highly recommend those too.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison Kanak",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Super cute but not comfy",
      "text": "These are really cute shoes but not very comfy. Don’t wear if you’re going to do a lot of walking. But they are really cute on.",
      "rating": 3.0,
      "verified": true,
      "author": "heather lantz",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Fun Look",
      "text": "These looked great with all my skinny jeans. The only down-side to mention, is the soles are not too grippy. I'm always in a hurry and made a fast move and slid on the carpet a bit. But now that I know that is the case, I'll adjust. Very comfy. the wide elastic band hidden inside the shoe over the top of my foot helps the shoe adjust to my width and hugs my foot very comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "463-STANG",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Size of Shoe",
      "text": "I believe these run 1/2 size too small so if you normally wear a e.g. size 9, I would suggest you order a 9.5. This is my opinion of all Blowfish shoes especially if you always wear socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobbi",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Awesome!!",
      "text": "Love, Love, Love!! As advertised, fits perfectly, love the look and the feel of the shoe. There is even room for my orthotics!",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanna M. Icenogle",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Cute shoe but zero tred on bottom",
      "text": "My friend had these and they were really cute. They hurt my feet after awhile so I dont wear them too often but I really like the style of them. I don't like that they dont have any traction on the bottom of the shoe. There is zero tred so you have to be careful. I really wish they would have made these a little better because it's a good looking shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Jill Small",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Cute",
      "text": "These are really cute sneakers. They go great with jeans or leggings and I like that they are easy to slip on. Overall pretty comfortable. I can wear these all day on a typical day but I probably wouldn't recommend wearing these if you are walking long distances or on your feet for long periods of time as the insoles aren't super padded",
      "rating": 5.0,
      "verified": true,
      "author": "Samsgma",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Adorable slip on shoe.  Comfortable.",
      "text": "These shoes are so cute. I had to take a chance. I wear an 11 wide and these shoes came in 11, but no wide choices. This shoe fits, the width will be satisfactory I hope. Reviewers said they stretch some, so I banking on it. Very cute and trendy. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristee",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Order a size up!",
      "text": "I wear a size 9 however the ones they sent were entirely too small. A size 10 fits perfect and they are just adorable!!",
      "rating": 5.0,
      "verified": true,
      "author": "GirlBoss",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Not comfortable just cute",
      "text": "I didn’t realize that blowfish Malibu were not like my previous pair. Good shoes, but look for sand bottoms or it’s just another pair of shoes. If I’d had known they wouldn’t be as comfortable a d I could have just bought a converse I wouldn’t remake this purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "TAC",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Love This Shoe!!",
      "text": "Great alternative to Chucks for my too wide feet!! I have 5 pairs, two prints, three solids! They are my “staples”!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Trahan",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Total score!",
      "text": "These shoes are SUPER CUTE and very comfortable. I was about to buy them from an online boutique and pay $10 more for them when I came across them here on Amazon. Honestly, I love them so much they would have been well worth the extra money at the boutique, but who doesn't appreciate a good deal!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Nice shoe it'd be GREAT if stitching was not so rough in the inside",
      "text": "I love the look the color only thing that could be improved is when not wearing socks the way the inner shoe was sewn really irritates your feet. It's OK ( just ok) if socks are worn. But it's basically a summer shoe therefore socks shouldn't have to be worn",
      "rating": 4.0,
      "verified": true,
      "author": "Gail Rauso",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "So comfy",
      "text": "I absolutely love these shoes put them On Soon as they arrived and wore them to a birthday party for 4 hours and they were sooo comfortable! The colors are so vivid ! The price was great much lower than I found in stores! Now need them in more patterns and colors ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle G",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Many compliments !",
      "text": "My son is joining the Army and I wanted patriotic shoes to wear this summer. These are the absolute best. So cute and very comfy !",
      "rating": 4.0,
      "verified": true,
      "author": "ADKmom",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Runs wide",
      "text": "I really wanted to keep these super cute slip on shoes, however they fit too wide. The toe fit perfect, I tried even thicker socks, but it still did not fit, they kept slipping on my heels. I love the slip on sneakers, however I had to send them back.",
      "rating": 4.0,
      "verified": true,
      "author": "Sweetie Pie",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Happy Feet!",
      "text": "The Perfect sporty, trendy, no lace up little shoe that had a lot of compliments coming my way.. At age 75 I probably should be wearing old lady shoes.. NOT this hip granny! I feel happy in my blowfish sneakers & am happy to show them off! Love to wear on the airplane & in lines ... because they go with everything & make me feel happy! ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Thelma Cabrera",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Will be my go to sneaker!",
      "text": "Due to other reviews, I first ordered a size 8 and had to return for 7.5 which fits and feels perfect. I have a narrow foot and these sneakers feel wonderful. I do not need a shoehorn. The toe feels wider for more comfort but does not look wide. I’m flat footed and these feel perfect with my arch and help with support. Wish I could find in denim!",
      "rating": 5.0,
      "verified": true,
      "author": "Sls",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great Addition To My Shoe Collection!",
      "text": "I love the style of this shoe! The red is a true red shade as shown. It is comfortable and I will get a lot of mileage. I will probably add an insole because I have had foot issues in the past but this shoe is more comfortable than expected and it is such a great style!",
      "rating": 5.0,
      "verified": true,
      "author": "Jewel M",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Patriotic",
      "text": "I ordered these sneakers because I thought they were cute and patriotic. They're just not a good fit for me. They feel and look clunky on my feet. Wider than the average B width and totally flat arch. If I hadn't thrown the box away, I would return them.",
      "rating": 3.0,
      "verified": true,
      "author": "oregon girl",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Awesome shoe",
      "text": "I love blowfish shoes. I have several pairs. They are so comfortable with or without socks. Never a blister. Breaks in easily. The canvas ones I throw in washer when they get dirty. Just bought black and gray checked flannel ones for fall.",
      "rating": 5.0,
      "verified": true,
      "author": "Debster",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "My new fave 👟 size up if you have a wide foot!",
      "text": "I LOVE these shoes. I have always been a big fan of converse and these fit just like them. Definitely worth the purchase. I would not recommend these to anyone with a wide foot they are very narrow towards the toes so if you just have to have them and your feet are wide you will need to size up. Great buy😊",
      "rating": 5.0,
      "verified": true,
      "author": "Court:)",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Blowfish’s awesome shoes",
      "text": "Absolutely LOVE my Blowfish’s sneakers. They are so comfortable and unique! My daughter loved them so much she ordered a pair too! This is the second pair, different kind, but finally found tennis that are not only unique but so very comphy. Yay 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Davidson",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Very comfortable!",
      "text": "These shoes are so comfortable. i ordered two pairs in different colors. They fit just as I expected. They look great with leggings and jeans, and I wear them with dressier pants to work on a casual day. I would recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "roarmstr",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Great Shoe!",
      "text": "Perfect walk-about shoe! Super cute and comfy as is, though it’s not a bad idea to add a little cushion insert. I have two pairs now, the navy and sparrow, and the only issue so far is the that fabric of my navy pair (only 1 year old) has torn at the toe. I still love them and am hoping to find a not too noticeable fix. I wear these everywhere, except when all-day walking (like Disneyland).",
      "rating": 4.0,
      "verified": true,
      "author": "CKR",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "WAY TOO SMALL!",
      "text": "I ordered a size 11. They arrive and I couldn’t get my foot in. So the 11 was about a 9 in reality. So sad. I absolutely loved the color",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Love These",
      "text": "I love love these shoes, so comfy, slip on and go, cute with dresses, jeans, shorts and cropped pants. I ordered a pair and as soon as I got them and wore for a day I came home and ordered another pair in a different color.",
      "rating": 5.0,
      "verified": true,
      "author": "RiverRunRusticWoodCrafts",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Comfortable shoes",
      "text": "These shoes are so comfortable, you can wear them with everything. The colors are exactly as shown. I bought two pairs and if there are more color options, I’d definitely buy more. I recommend them without any hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Havlin-Cryer",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Perfect shoe",
      "text": "I'm wearing these only in the house so I don't track in bleh... and I can't stand slippers when I'm awake and actually doing awake things. I got them since they're easy to slip on and off, with my constant running around, from inside to outside. I'll probably get another pair for outside use, and will try not to mix them up :D",
      "rating": 5.0,
      "verified": true,
      "author": "michele haines",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "My go to.",
      "text": "I bought a pair of Blowfish last year and I found them on my feel ALL THE TIME. These were the same type but a little different style so I decided to try and I was not disappointed. They have a little larger toe box so my smaller bunion is happy. I can wear them all day and they are really adorable. I've actually thrown a pair in the washer to clean them up and they come out terrific. Love this brand and will buy another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "DisneyDana",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "beware of slippery soles",
      "text": "I wear 6 1/2, they are roomy enough, just got them, but as one review stated, they are slippery on the soles, They are fair weather shoes, for sure. They are cute. Watch your step. My living in wet country would get my attention faster on this subject.",
      "rating": 4.0,
      "verified": true,
      "author": "Sunnyside Up",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Super comfy and cute",
      "text": "This is super light and comfortable not to mention cute. All my co-workers are ordering a few pairs and we are talking about making it a company uniform. It’s very cute and can be worn with dresses, pants, shorts making it a very versatile piece",
      "rating": 5.0,
      "verified": true,
      "author": "Adriana Dionisio",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "True to size , slightly wider",
      "text": "I was looking for a slightly wider fit than converse, I have just acquired bunions so I have to take that into consideration..... that being said I absolutely love these shoes and the ease of taking them off and putting them on! Ready to order another pair in a different color!",
      "rating": 5.0,
      "verified": true,
      "author": "Dodie",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "My favorite shoes!!!",
      "text": "I LOVE these shoes! They are my favorite. They do rub a blister on my little toe but I always put a bandaid on it and problem solved. I wear a size 7 or 7 1/2 so I ordered a size 7 and they do not slip up and down.",
      "rating": 5.0,
      "verified": true,
      "author": "Tisha McMurray",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Love the shoes...but run big.",
      "text": "The shoes were very comfortable and I loved the look! My only complaint is that they don't come in a smaller size than a 6...if they do, I couldn't find them. I normally wear a size 6 shoe but these run a little big and I had to wear no show socks to make them fit better and not slide up and down when I walk. A 5.5 would have been the perfect fit. I compare the sizing of these shoes to that of converse.",
      "rating": 4.0,
      "verified": true,
      "author": "clbjwb",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "I love them!",
      "text": "Very comfy! Great color! I bought some other blowfish shoes and had to have more!",
      "rating": 5.0,
      "verified": true,
      "author": "Boltzia",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "They’re best sellers and sell out fast!",
      "text": "I love these shoes, mainly use them for walking and not working out. I have to use orthotic inserts, they fit right over the original insole. Having ordered several versions I can wear different ones vs wearing the same ones all the time. Very affordable price....if you see a pair you like that’s in your size order them because they do sell fast. 😀",
      "rating": 5.0,
      "verified": true,
      "author": "jourma",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "I love Blowfish shoes!",
      "text": "I actually have seven pairs of blowfish shoes. I have sensitive feet from running and only wear shoes with good soles and support, these shoes are so conferrable and they fit perfect for people with wider feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20201022
    }
  ],
  "product_meta": {
    "title": "Blowfish Malibu Women's Play Sneaker",
    "description": "Eyelet detail\n\nBlowfish.cool shoes for cool girls! A fresh line of young contemporary shoes brought to you by designers who travel the world for inspiration and forward trends to bring happiness and cool looks to your feet. One pair and you'll be hooked. Just give the line a try and see. Not only fun, but comfy too. Thanks for fishing!",
    "rating": 4.7,
    "feature_bullets": [
      "100% Manmade",
      "Synthetic sole",
      "Manmade",
      "Imported",
      "Synthetic sole",
      "Shaft measures approximately low-top from arch",
      "Pull on"
    ],
    "categories": [
      "Women",
      "Shoes",
      "Fashion Sneakers",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 29.95,
    "specifications": {}
  }
}