{
  "website_summaries": [
    {
      "verdict": "A sleek countertop washer that's compact, quiet, and efficient.",
      "pros": [
        "This machine is very quiet, and looks nice",
        "It has an easy to operate control panel, boasts a useful spray arm to aid in cleaning, and has a nice eco-mode to save water",
        "Setup and installation are quick, and instructions are straightforward"
      ],
      "cons": [
        "The interior dimensions of the dishwasher and the rack are limiting, so standard sized plates may not fit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A practical, easy-to-use appliance that is a great space-saver. Although it isn't practical for anyone with frequent, large loads of dishes to wash, it's still a good value.",
      "pros": [
        "Very portable, as it can fit on a countertop",
        "Small footprint makes it perfect for very small kitchens and RVs",
        "Easy to setup and operate",
        "quiet and attractive"
      ],
      "cons": [
        "Not the best choice for families, as it can only fit 6 place settings",
        "Doesn't have a dry cycle"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Goo washer",
      "text": "Great little dishwasher, fit on the counter,took about 3 min. to hook up no complaints",
      "rating": 5.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 36,
      "publication_date": 20170920
    },
    {
      "title": "Great purchase if you dislike doing dishes!",
      "text": "We are really pleased with this dishwasher. It runs quietly and does a great job cleaning the dishes. It's easy to connect to our kitchen sink with the universal adapter we also bought on Amazon. Had to pay extra to get it sent to our remote location in Alaska, but it was worth it. We found that liquid dishwasher soap works best. Some powder packets did not dissolve as expected even when cut in half, but we later figured out it may have been the packets not the dishwasher at fault. We were hoping it would fit on the counter under the cupboards but it was an inch too tall.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 25,
      "publication_date": 20171204
    },
    {
      "title": "Be careful: “normal-sized” dinner plates & glasses don’t fit",
      "text": "Maybe I missed this in the details - but the interior dimensions of the dishwasher and the rack design are quite limiting. The dinner plates I use everyday are too big for the dishwasher as are the juice glasses I usually use. Not the end of the world and I do like the overall size of the dishwasher. But in hindsight, I would have preferred a dishwasher that’s just as compact as this model but is better designed on the inside to accommodate my plates.",
      "rating": 2.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 16,
      "publication_date": 20180610
    },
    {
      "title": "love this washer",
      "text": "love this washer, it is very quiet. can not hear it in the other room running ,unless it is draining. does an excellent job cleaning. just follow the instruction and you will be 100% happy. I also bought the stainless roll around kitchen cart for it , fit perfect, like the other reviews showed,Seville Classics Stainless Steel Professional Kitchen Cart Cutting Table , great match",
      "rating": 5.0,
      "verified": true,
      "author": "Ron H",
      "helpful_votes": 10,
      "publication_date": 20180129
    },
    {
      "title": "Cleans dishes and pots and pans efficiently",
      "text": "This machine is awesome. It has several settings, giving me loads of choices, It is guiet and it does an extremely good job of cleaning dishes,as well as pots and pans. This counter top dishwasher exceeds all my expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 12,
      "publication_date": 20180131
    },
    {
      "title": "I love my counter dish washer",
      "text": "I love my counter dish washer, got my order fast and never thought that a counter dish washer would work for me . I have a small kitchen and I am sorry I didn't get one sooner. Thank you Amazon !",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 11,
      "publication_date": 20171222
    },
    {
      "title": "The fitting does fit standard sinks.",
      "text": "I like that it is small but not so small it is not useful. Larger dinner plates present a challenge if you want to fill it up as they can be too tall, but you just angle them to fit. You have to rinse off the food before you run them through. Overall so far I really like this dishwasher. It not a full size dishwasher, so don’t expect it preform like one. Also make sure you tighten up the hoses fittings before you use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Linkoakshield",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "But it works great for what we are using it for",
      "text": "This was for our office. Figuring out the connector to attach it to the facet took a couple of tries. And it is a little bigger than we expected. But it works great for what we are using it for.",
      "rating": 5.0,
      "verified": true,
      "author": "J. rollins",
      "helpful_votes": 3,
      "publication_date": 20180220
    },
    {
      "title": "Great buy!",
      "text": "I have an apartment without a dishwasher and had been searching through reviews of countertop dishwashers before settling on buying this one. I’m glad I did! It’s basic and can easily be moved between a lower cabinet and the counter to wash dishes. I would suggest using a wrench to tighten the back waterlines. I made the mistake of only using my hands for the first use and ended up having water all over my kitchen. Horrible USER ERROR. I’d suggest this to anyone looking to buy a small dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariel Bouser",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Very nice machine eco mode cleans the load of dishes in ...",
      "text": "Very nice machine eco mode cleans the load of dishes in about 1.5 hours and only uses 3 gallons of water to do it it uses standard dishwasher detergent",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180402
    },
    {
      "title": "Should come with optional stand",
      "text": "Doesn’t fit on my counters (only 12” high cabinets) so I have the pleasure of trying to DIY a rolly kitchen cart (price of this washer and shipping it left me broke) so I can use it again. Only used it once because it’s so heavy it broke the metal cart I had it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Runs like a top",
      "text": "VERY well packed. All parts needed included in box. Runs like a top. No leaks!",
      "rating": 5.0,
      "verified": true,
      "author": "William P. Burke",
      "helpful_votes": 3,
      "publication_date": 20180212
    },
    {
      "title": "I would recommend!!!",
      "text": "Doesn't fit under my current cabinets. Cleans well. But I prewash by hand. I've had it for 6 months and no issues that are bad.. measure your space. Non of these are real small. But this one works great.",
      "rating": 4.0,
      "verified": true,
      "author": "private",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Compact and effective!",
      "text": "Been wary of buying countertop dishwashers for years, but finally decided to try one for my apartment. Was not disappointed! Came packaged extremely well with no damage. Took 15 minutes to unbox and setup. Will wash just about anything you put in it!",
      "rating": 5.0,
      "verified": true,
      "author": "Blake Myers",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Easily hooks up to faucet and does a great job ...",
      "text": "Been looking to get one of these for several years. Definitely worth it. Easily hooks up to faucet and does a great job of washing dishes.",
      "rating": 5.0,
      "verified": true,
      "author": "David A.",
      "helpful_votes": 3,
      "publication_date": 20180308
    },
    {
      "title": "Sketchy AF possibly dangerous",
      "text": "It was decent for a bit but then proceeded to completely sketch out on us. Random lights all over the place. Acting possessed. Drawing crazy random amounts of power that made my lights flicker and fear for our safety. We used it as instructed for less than one year and it completely sketched out on us. Now our support window is closed and there’s nothing I can do but post this review. Avoid this brand. It’s basically a fake dishwasher.",
      "rating": 1.0,
      "verified": true,
      "author": "ill.Gates",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "... skeptical about buying one of these but it works great for one person in a small apartment like",
      "text": "I was a little skeptical about buying one of these but it works great for one person in a small apartment like me",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Works great",
      "text": "I have this dishwasher a lil over a year now. I use it one or two times a day and it has no issues, cleans very effectively.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbey S.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Saved my mind",
      "text": "I love it and it might end up allowing me time. It could have come with some clearer attachment instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Sullivan",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Love :3",
      "text": "I love this so much! I have a small kitchen and I'm lazy so dishes add up quick. Now I can do a load every few days and keep my kitchen clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Worth the money",
      "text": "So much nicer than hand washing, not as noisy as my ex-wife. Mine makes very little noise, no more than a full size washer. My casserole dishes fit in, and my large pizza pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Works great so far!! Love it!",
      "text": "Haven't had any issues with this dishwasher! Its only been about a week having it but it works extremely well and the countdown is really helpful to know when it will be done.",
      "rating": 5.0,
      "verified": true,
      "author": "meggy",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Don’t think twice! Must buy it!!!",
      "text": "Must buy!!! I live in a small apartment in NY and always wanted a dishwasher. Great investment perfect size and doesn’t take up too much space perfect for a small kitchen or studio apartment don’t think twice! I am so happy and already recommended it to a couple of friends. Trust me it’s worth it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nataly Alarcon",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Very convenient and easy for small places.",
      "text": "The actual noise the machine makes isn’t bad. The water when it rushes out of the hose is what’s loud. We have a shallow metal sink which makes it louder.",
      "rating": 4.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great!",
      "text": "Great dishwasher. What I have to find next is an airaiter that will fit on the faucet when it isn't connected",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Forbes",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Five Stars",
      "text": "I love this product. Only down fall cant use that facuet when running but i am ok.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane McNair",
      "helpful_votes": 2,
      "publication_date": 20180124
    },
    {
      "title": "Very Good!",
      "text": "Considering that it is a compact countertop dishwasher it is easy to load and it always gets the dishes nice and clean. And the cycle gets hot enough to kill germs and bacteria!",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun P.",
      "helpful_votes": 0,
      "publication_date": 20201114
    },
    {
      "title": "So far so good, but it is only a couple of months ...",
      "text": "This is the first dishwasher that I have had, so there is nothing to compare it to. Received this as a gift. The unit gets dishes much cleaner than I could do by hand. Default settings takes 90 minutes. Sometimes it is tough to get the door on the compartment holding the soap pod to seal properly. So far so good, but it is only a couple of months old.",
      "rating": 4.0,
      "verified": false,
      "author": "James G. Alexander",
      "helpful_votes": 4,
      "publication_date": 20180226
    },
    {
      "title": "Avoid!",
      "text": "Bought this 7 months ago; don't buy. It does not clean dishes at all, and regular sized dinner plates only got if you put them at such an angle where only 2 can fit.",
      "rating": 1.0,
      "verified": false,
      "author": "Haley Latture",
      "helpful_votes": 0,
      "publication_date": 20190724
    }
  ],
  "product_meta": {
    "title": "Ivation Portable Dishwasher – Countertop Small Compact Dishwasher for Apartment, Condo, RV, Office & Other Small Kitchens – 6 Place Setting Capacity – White",
    "description": "Superior spray power in compact countertop form!\n\nThe dishwasher is a permanent fixture in today’s modern home. But what if you’re confined to a tiny apartment, or just need a temporary machine to wash and dry a few dishes? With this Countertop Dishwasher from Ivation, there’s no commitment necessary! Enjoy compact convenience and an exceptionally powerful clean for all your pots, pans, plates, glasses and cutlery with this portable pint-sized unit. Measuring only 17” high, the dishwasher sits atop your counter and hooks into most standard faucets via the included hose adapter. The spacious stainless steel interior with rolling caddy lets you organize up to 6 place settings in a single wash. Integrated rinse aid and detergent dispensers, touch button control panel and 6 program cycles also provide unmatched ease of operation. So stop tiring yourself with the thankless chore of washing by hand—and add a Countertop Dishwasher to your cart today!\n\nWhat You Get\n\n\n\n * 1 x Countertop Dishwasher by Ivation\n   \n * 1 x faucet adapter hose and connection\n   \n * 1 x drain hose and connection\n   \n * Dependable cleaning with no direct plumbing necessary\n   \n * Full-size dishwashing power in a truly portable package!\n\nSpecs & Details\n\n\n\n * Measures 17” x 21.5” x 20”\n   \n * Water pressure: 0.04-1.0MPa\n   \n * Exterior: white\n   \n * Interior: stainless steel\n   \n * Capacity: 6 place settings\n   \n * 6 wash cycles [Heavy, Normal, Eco, Glass, Speed & Rinse]\n\nHow to Enjoy\n\n\n\n * Carefully follow instructions for installing the drain and inlet hoses\n   \n * Load the rack and basket with dishes, cutlery or lightly soiled pans\n   \n * Fill the detergent and rinse aid compartments with your desired product\n   \n * Use the easy buttons and display to program the perfect cycle setting\n   \n * Every so often, remove the filter, rinse and remove any existing residue\n   \n * Enjoy sparkling clean dishware in any space-strapped kitchen!",
    "rating": 3.8,
    "feature_bullets": [
      "CONVENIENT COUNTERTOP DISHWASHER – Dishwashing Unit Temporarily Connects to Sink Via Faucet Adapter to Deliver Full-Sized Power in Small, Portable Package",
      "AMAZING COMPACT DESIGN – Spacious Cavity Fits [6] Standard Place Settings for Apartment or Office; Includes Sliding Dish Rack, Cup Shelf & Silverware Basket",
      "HEAVY DUTY PERFORMANCE – Durable Stainless Steel Interior, Spray Arm Deliver Many Years of Powerful, Dependable Washing; Safe for Temperatures Up to 148°F",
      "USER FRIENDLY CONTROLS – Features Simple Touch Button Operation, Automatic Detergent & Rinse Agent Dispensers & 6 Unique Wash Cycles of Varying Strengths",
      "PERFECTLY DISCREET DIMENSIONS – Measures 17” x 21.5” x 20” for Placement on Counter or Between Cabinets; Great for Condo, Dorm, RV & Other Small Kitchens"
    ],
    "specifications": {
      "Brand Name": "Ivation",
      "Item Weight": "49.9 pounds",
      "Package Dimensions": "25.98 x 24.02 x 22.99 inches",
      "Is Discontinued By Manufacturer": "No",
      "Capacity": "6 Place Settings",
      "Part Number": "IVADWCTWT",
      "Form Factor": "Built-In",
      "Color": "White",
      "Option Cycles": "6",
      "Material Type": "Stainless Steel",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B074Q2DGVQ",
      "Customer Reviews": "3.8 out of 5 stars53 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#2,430 in Appliances",
      "Date First Available": "August 10, 2017"
    },
    "categories": [
      "Appliances",
      "Countertop Dishwashers",
      "Dishwashers"
    ],
    "price": ""
  }
}