{
  "website_summaries": [
    {
      "verdict": "The best protective Microsoft Surface case to choose for the most amount of protection without extra weight or bulk.",
      "pros": [
        "Large cover is made of polycarbonate plastic for great drop and scratch protection without much added bulk",
        "Individual pieces detach separately for custom layouts or mixing and matching of different covers and colors if desired"
      ],
      "cons": [
        "Case plastic can bend and flex during normal use or when carrying the laptop around by hand or in a bag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not for Surface Laptop 3 Aluminum",
      "text": "The top cover fits fine, but the bottom is not close on the new all aluminum Surface Laptop 3. It looks like it is designed to grab the originals at the transition from the bottom to the Alcantara top, but on the aluminum it's a bit below the top and there is nothing to grab. I am keeping it as protecting the top is better than not at all, but they need to look at the bottom piece for the new laptops.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles Nicholson",
      "helpful_votes": 5,
      "publication_date": 20191031
    },
    {
      "title": "Great idea, bad execution.",
      "text": "I was really excited to receive this! I ordered the black one and when it came to my disappointment you cannot see the Microsoft logo as shown in the images. There is a slightly less opaque square where the logo would be, but is still not really visible.. Also, it is very simple to clip on and fairly easy to clip off though it did immediately start to push and misshape the edge of the alcantara material on the keyboard. I removed it and would not recommend. Pretty disappointing.. Please comment on any case recommendations that will still keep the integrity of the laptop.",
      "rating": 3.0,
      "verified": true,
      "author": "@alinacryystal",
      "helpful_votes": 7,
      "publication_date": 20180316
    },
    {
      "title": "Does *NOT* fit surface laptop 3",
      "text": "Despite specifically stating in the item title that this fits a Surface Laptop 3, it doesn't. The clips on the back of the bottom piece are not large enough to reach the edges of the laptop. The plastic is clearly sized to fit my 13.5\", it's not like they sent a 15\" piece, it just does not match the device's size. In addition to the bottom piece not fitting, I bought a matte black cover but only the bottom piece is matte black. the top was a shiny, smoked, translucent piece. Hard to put a positive spin on this product. It's terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen A. Means",
      "helpful_votes": 3,
      "publication_date": 20191216
    },
    {
      "title": "Fits the Microsoft Surface Laptop perfectly. The shell case ...",
      "text": "Fits the Microsoft Surface Laptop perfectly. The shell case is not transparent. The bottom shell has lift tabs built in to raise the keyboard a little.",
      "rating": 5.0,
      "verified": true,
      "author": "Mother of '2 kids and 2 dogs'",
      "helpful_votes": 5,
      "publication_date": 20180123
    },
    {
      "title": "Perfect case.",
      "text": "The cover was perfect for my surface laptop 2! It was easy to install; I started with the bottom case, snapped in the back side first and then the front. I took the time to wipe my laptop down to make sure it’s clean. I also texted out the charging cable and it works just fine. (note that my charging cable is the updated version which is the 64 Watt, not the original charging cable). I like the monochrome look of black on black, so this is exactly what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "nikolao-hazara",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Cheapens the great look of the Surface Laptop",
      "text": "I just bought my Surface laptop and I wanted to protect it from scratches, and since the choices for protective covers are very limited for this laptop I purchased this cover. I cannot speak about the other colors, but the black REALLY cheapens to laptops look. You cannot see the Windows logo on the lid as it shows in the photos in the description. I didn't have any issues connecting the docking station cable as described in other reviews. If it was selling for $10, maybe I would have given it a better rating, but it is NOT worth $25.",
      "rating": 3.0,
      "verified": true,
      "author": "Henry F. Blackburn Jr.",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "DO NOT buy this if you have the Surface Laptop 3 with the Metal Case",
      "text": "When I bought this, the manufacturer had not stated that it was not compatible with the metal Surface Laptop 3, so I bought one. It arrived recently. I put the top part on, the one designed for the screen, and it fit correctly. However, the bottom part is not thick enough for the laptop. It is not able to snap on to the body. The plastic it is made of feels cheap and of a bad quality. I will see if I am able to return this, but do not buy this if you have the model with the metal body.",
      "rating": 1.0,
      "verified": true,
      "author": "Maria G. Retana",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Kinda cheap but really good",
      "text": "It’s a great case for the price, however, I bought it specifically to block my stickers in the office place (not very professional to have a sticker bombed laptop in a meeting haha) and it’s actually transparent so I had to put a piece of construction paper behind it to really black it out and looks great. Fits really snug and looks seemless on my laptop, does pinch some of the alacantara on my surface a little but for the money it’s a great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey B. Yapp",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Could potentially damage your device",
      "text": "It is the only case avalible for laptop surface so I take a chance. The case fit nicely BUT at four corners where the claims secure to the laptop, it ruined the fabric need the cover. I had to file down extra material at the claims to ensure it not damage my laptop.",
      "rating": 2.0,
      "verified": true,
      "author": "thomas pham",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Room for little Improvement",
      "text": "Bought this case for my girlfriend and she loves it; her one and only complaint was that you can't see the windows logo. I would definitely recommend protecting your investment with this case sense you don't have that many options when it comes to Surface products. Personally I'm a Macbook user and theres always a plethora of options, I wish I could say the same for Surface products. Until other companies start steping up this is a good case to buy, I wish they had a soft matte black option because I know thats such a popular color especially with us college people. Anyways I hope I was able to be of some assistance.",
      "rating": 4.0,
      "verified": true,
      "author": "cam817",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "It’s okay but the color might not be on point",
      "text": "I honestly just needed a case to protect my laptop bc it’s been getting scratched on the outside and this is the only one I found on here all though I don’t really like it that much. I thought the windows sign was going to show through. I got black btw. And I thought it was going to be like a more satin finish like the picture but it’s plastic. But I just needed it to protect the outside of my screen.",
      "rating": 3.0,
      "verified": true,
      "author": "Neyda Portoviejo",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Bottom DOES NOT FIT Surface Laptop 3",
      "text": "The case itself is beautiful and sturdy. The top fits really well and looks slick. However, the bottom piece absolutely does not fit. The hooks and corners aren't tall enough to secure onto the laptop. It was not a huge deal for myself, I really wanted the top shell only to protect the surface from scratching, so I'm not too concerned about it and will use it for now until I find a better solution. If you are looking for a shell for the top and bottom, do not purchase this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Damaging",
      "text": "I loved it but it damages the top left of keyboard side It’s hurting the laptop",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Jurado",
      "helpful_votes": 5,
      "publication_date": 20180817
    },
    {
      "title": "Great cover",
      "text": "Needed a shell cover for my work laptop to protect it from scratches. Microsoft silver laptops can easily be scratched so this cover is a must have. It was easy to install. I got the black cover and it looks very good and professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Lightening",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "DOES NOT FIT SURFACE LAPTOP 3!",
      "text": "I have a surface laptop 3 in metal without the Alcantara fabric. The bottom half of this case does not click into place because it is too small it doesnt reach over the edge. Because of this the bottom piece pops off/falls off constantly. If you look at other reviews you can see how the little plastic pieces fold over the edge to hold it in place, compared to the gap that is present in my pictures.",
      "rating": 1.0,
      "verified": true,
      "author": "Kehley",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Decent case, but be aware of the Alcantara...",
      "text": "I needed a case to protect my Microsoft Surface laptop that I use for work. Surprisingly, there weren't many options on Amazon, but having used iPearl for previously Macbooks, I decided to go for it. Case is sleek and durable, good for the price. My only complaints are, 1. As mentioned in previous review, the case doesn't quite go over the Alcantara unless you are really maticulous about putting it on, and 2. The bottom, even with the silicon pads, is a little slippery on my desk. Otherwise, this is a great case and overall, I recommend it to anyone with a Surface laptop which needs a little extra protection.",
      "rating": 4.0,
      "verified": true,
      "author": "allimac",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Not recommended",
      "text": "Not a great fit, just falls off and really needs to be better designed, I would not recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Larry Singer",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Doesn't fit correctly",
      "text": "Product does not fit correctly on my Surface Laptop 2. The bottom part pushes on and folds in the soft keyboard materials on the back corners. I contacted them, and the only advice was to put clear tape on the corners before attaching it. Yeah, that didn't work. The more times I attempt to attach this, the more cosmetic damage is done to the laptop. I will be returning for sure.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew Garvey",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Top half good, Bottom too tight",
      "text": "The top half fits perfectly; the bottom half, however, was difficult to put on and it was a bit too snug. The tabs to keep the bottom half in place were too tight and I couldn’t manage to get the bottom half on without it pushing up the Alcantara. Decided to keep it anyways, so I’m only using the top half. Probably could sand down the tabs on the bottom a bit so as not to damage the Alcantara.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Don’t buy it for Surface laptop 3 13.5”",
      "text": "This case not for surface laptop 3 13.5” I bought it for my son and it wasn’t fit. False description by seller. Killed my valuable time. These kind of seller should get permission to sell items in Amazon. I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Bhuchung Bista",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Does not fit new 2019 Surface Laptop 3",
      "text": "So disappointed that this doesn’t fit my new laptop. The top piece fits perfectly fine, but the bottom piece won’t get into the laptop on the top right corner. So disappointed will be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Mim423",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Damage my surface keyboard corners",
      "text": "The product looks nice but when placing it on my surface 2 keyboard, it squeezed in the texture of the keyboard surface. basically damage it. I don't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunshinester",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Works great!",
      "text": "Finding a hard shell cover for Microsoft Surface Laptop was not easy. Reviews were mixed and Microsoft didn’t offer one in the store. Tried this one and so far so good. Taking care when putting on the device will avoid the damage to keyboard others have mentioned.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hales",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Not the same product, do not order",
      "text": "This Amazon page says it's for a Surface device, but the pamphlet that came in the package only says Surface 1 and 2. Combined with the fact that the case that came isnt as pictured (no microsoft logo on the outside) and it didnt fit right (I couldn't even get the bottom half on...), very very suspicious. I'm returning and would not recommend ordering, even just to take a chance on it.",
      "rating": 1.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "NOT matte",
      "text": "It’s a little flimsy but I don’t mind. I just wanted it to prevent scratches on my laptop. However, the biggest flaw with this is that it is NOT matte like in the photo. The top is a SHINY and REFLECTIVE material which I actually hate. Was really looking forward to a sleek matte look. Not sure if they sent me the wrong one but it is not as advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "L.Mart",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Don’t buy!",
      "text": "DO NOT buy this shell. It doesn’t fit my bottom up-left corner. I tried both slide it up and clip-it-on, neither fits. THE WORST THING IS, the bottom cover is too tied, and it ruined in my laptop leather during installation. See pictures and please avoid this product.",
      "rating": 1.0,
      "verified": true,
      "author": "dunn",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great",
      "text": "I've had it for over a year, going strong on two. It's saved me from drops and deep scratches onto the aluminum. One drawback however is the plastic lip that may lift up the alcantara if you're not very careful. A workaround is to get fine grit sandpaper and shave a bit of that off. Great for price however",
      "rating": 4.0,
      "verified": true,
      "author": "Mclovin",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Terrible Fit. Doesn't Stay on.",
      "text": "I really wanted this to work to keep my Surface laptop protected. I was surprised how few options there were on Amazon. Unfortunately this one does not work well at all. The part that goes on the back of the monitor is fine. But the bottom piece does not fit well at all. It doesn't click on and stay in place. It is always ready to fall off. Super bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "Dan n Kim",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Sturdy and slim",
      "text": "Snaps right onto my laptop, it has extra kickstands on the bottom to elevate the laptop, a bonus if I ever need to use it. I wish it had more of a grip to the bottom, but otherwise a great product",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca O.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Perfect for the Surface Laptop",
      "text": "Using this to protect my Surface Laptop. Purchased the black case. Does what it is supposed to. Excellent item, as described. Happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "GARNDO",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Nice, handsome, lightweight cover.",
      "text": "I've had this for a month. It's sturdy but light, thin, not heavy duty. So far it's protecting my laptop from scratches and dirt. The little feet require a sharp fingernail to deploy when retracted. They are also lightweight.",
      "rating": 4.0,
      "verified": true,
      "author": "Ha1r",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Wish it was better made",
      "text": "This product snapped and broke within a weak. Was only held with a rubber band. Had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Maria Harrison",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Exceeded Expectations",
      "text": "Amazing cover. There are not many covers for the surface laptops but this is more than I expected. Nice and sturdy. Well packaged. No longer have to worry about scratches.",
      "rating": 5.0,
      "verified": true,
      "author": "Saad Javed",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Not matte",
      "text": "It shows that this case is matte but it is not. It is glossy.",
      "rating": 2.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "ummm??",
      "text": "This product is not what its advertised as. The bottom part does not stick to the laptop, It will fall off. I just kept it because I will not be carrying this laptop out now but if you are looking for a case that you can attach an dtake it out with you. THIS IS NOT IT.",
      "rating": 2.0,
      "verified": true,
      "author": "misba.gani",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Doesn't fit",
      "text": "The top piece fits ok but the bottom part DOES NOT FIT. The front somewhat lines up but the back doesn't fit at all. Going to look for something else.",
      "rating": 2.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Just ok",
      "text": "Some pieces not cut with close enough tolerance. Screen protection piece hard to install correctly. Looks good on the outside. Provides only protection against scratching.",
      "rating": 3.0,
      "verified": true,
      "author": "scott connors",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Good value",
      "text": "Lightweight, yet sturdy material. I also really enjoy using the little kickstands for more comfort when typing. I would recommend to someone that has the surface 2 laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilly",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Gets the job done",
      "text": "I mainly bought this because my laptop had an unbearable feel on the back that reminded me of nails on a chalk board or a fork directly on glass, bought this mainly for the texture and it's great. Snaps on easy and the support legs help with ventilation if you're in a tight hot spot.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan wilson",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Cheap looking",
      "text": "Wish it showed the Microsoft emblem on the outside more. Not sure how much it will protect my laptop so I carry it in a cushioned carrier just in case.",
      "rating": 2.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Not built well",
      "text": "It destroyed the edges of my laptop (the case pinched the fabric so hard it started to come off). Not built for this laptop.",
      "rating": 1.0,
      "verified": true,
      "author": "Nell Turner",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "False Advertising - You can’t see your windows logo on the front",
      "text": "I have a burgundy surface laptop and decided to buy the black case for a change and it is not what I expected. In the picture it shows you that you will be able to see the windows logo on the front and you can not. You can not see the logo at all. Diappointed. Kept it because it’s the only case out here.",
      "rating": 3.0,
      "verified": true,
      "author": "SGV ",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Professional and Sturdy",
      "text": "It came very fast and was exactly as described. As a college student in a graphic design program it’s very professional looking and keeps the laptop safe while still making it easy to hold when drawing on the screen for classes.",
      "rating": 5.0,
      "verified": true,
      "author": "Scw",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "DON'T DO IT",
      "text": "Bottom piece doesn't stay on. It will almost clip in but won't hold, and. you risk dropping your computer. Top and bottom do not match either. Ordered the black.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent Gosnell",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "BROKEN PRODUCTS",
      "text": "This is my SECOND ORDER that has a broken corner. You can see in the photo that one corner is perfectly fine and the other is broken off. i emailed iperal and they have done nothing about this and still haven't found a solution beside blaming shipping. I highly don't recommend this garbage!",
      "rating": 1.0,
      "verified": true,
      "author": "Brian ",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Fits like a glove",
      "text": "I thought the cover had a matte finish much like the previous one I purchased...it did not & I would prefer a matte finish to a gloss finish",
      "rating": 5.0,
      "verified": true,
      "author": "ron giles",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Incredibly cheap for the price",
      "text": "I could buy a case of this quality for $5 from other sellers.",
      "rating": 1.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Very slim and fits perfectly but...",
      "text": "I like that it’s slick in size however it really only offers protection against scratches. It does not protect the laptop from falls",
      "rating": 3.0,
      "verified": true,
      "author": "Margarita Abdo",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Fit",
      "text": "The cover looks nice except the bottom part doesn't quite fit. I had to put two sided tape to keep the bottom part in place or else it comes off. The top fits perfectly and its nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Terrible product",
      "text": "This is a deplorable product. It doesn't fit the machine. I wrote to the seller weeks ago but received no response. Selling a bad product is one thing. Not being responsive is even worse. Don't buy it!",
      "rating": 1.0,
      "verified": true,
      "author": "Sohail Hasan",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Husband who is an IT professional would recommend the product",
      "text": "Husband who is an IT professional would recommend the product. It functions as intended and fits the surface laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "Smokin54",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Not so great",
      "text": "Very cheap looking cover, I have used for 2 days and removed. Little bulky too",
      "rating": 3.0,
      "verified": true,
      "author": "rMiami",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "The bottom piece did not fit as it should have",
      "text": "The top fit great, but the bottom piece did not fit as it should have.",
      "rating": 1.0,
      "verified": true,
      "author": "Madison Garrett",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Bottom portion doesn't connect",
      "text": "I have the Surface 3 laptop and the bottom portion does not align. The top portion does fit perfectly!",
      "rating": 2.0,
      "verified": true,
      "author": "shawnta young",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Below the expectations",
      "text": "Its shiny.... and all fingerprints stay on it right away and hard to keep spotless...",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Berengut",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "It looks really nice and it is really protective",
      "text": "It is my second day now using my surface laptop with the ipearl hard case. It looks really nice and it is really protective. It doesn't add that much of thickness to the laptop. But I was somehow disappointed after finding out the windows logo doesn't show off through the black case as displayed on the pictures. Apart from that it is a really nice case though.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruno Axel Kamere",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "The bottom doesn't clip well",
      "text": "This is a big disappointment! was very excited to get this but when i do, i found out that the bottom doesn't clip on right. Would not hold on to this item very long. hoping to find a better item soon so i can replace this one i have.",
      "rating": 2.0,
      "verified": true,
      "author": "Rio",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Not as advertised",
      "text": "what i end up getting was a black glossy cover. The pictures show something very different from what i got..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Do not buy",
      "text": "Not fitted properly because it does stay and doesn’t allow you to open and close computer smoothly",
      "rating": 1.0,
      "verified": true,
      "author": "ashley b.",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "scratchy!",
      "text": "it arrived on time. it was bit scratched up though which is why i have three stars... i mean i covered the case in stickers so it doesn’t really matter but if you’re expecting a nice clean case, this probably isn’t it",
      "rating": 3.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Durable!",
      "text": "I forget it is even there. It truly dresses up and doesn't hide your laptop. Easy to clean, just a damp cloth wipe down. I have dropped my laptop twice, expecting this to have at least crack...nope! High quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Surface Laptop 2 compatible",
      "text": "This is a good cover for my surface laptop 2. Windows sign gets kind of hidden",
      "rating": 5.0,
      "verified": true,
      "author": "Ishaq",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "It would be a cool case.....",
      "text": "If my bottom half fit. It does not stay snapped on laptop and falls off easily. The top fits and snapped on perfect. I guess you get what you pay for.....",
      "rating": 3.0,
      "verified": true,
      "author": "Darren Maestas",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Great item! Arrived on time and as expected",
      "text": "Great item! Arrived on time and as expected. Great Seller!",
      "rating": 5.0,
      "verified": true,
      "author": "G McDaniel",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Did not fit my Surface Laptop 3",
      "text": "It looks pretty ugly; there's a non-clear border around the opaque center. For me, it failed to even fit properly onto my laptop (Surface laptop 3) as it was listed.",
      "rating": 1.0,
      "verified": true,
      "author": "Alan Tong",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Strong and Sleek",
      "text": "Not bulky, but strong. no complaints two weeks in. Does not affect computer use at all. got the black, which is pretty cool looking, and with my black laptop, is hardly noticeable. Shipped fast internationally.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Durable, difficult to put on",
      "text": "The case does its job well. It was difficult to put onto the lower half of my laptop, though, it peeled up the fabric in some places. It does not seem to impede the cooling.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Good case",
      "text": "The only drawback is that it scratches super easy, otherwise, it is a great case!",
      "rating": 4.0,
      "verified": true,
      "author": "Haylie Byler",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "DOES NOT FIT",
      "text": "This is advertised to fit the surface laptop 3 BUT IT DOES NOT",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Five Stars",
      "text": "Provides great protection for my surface laptop. Will probably buy another in a different color.",
      "rating": 5.0,
      "verified": true,
      "author": "iTech_bloop",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Perfect fit for the 2nd generation of Microsoft Surface Laptop!",
      "text": "I’m so satisfied for purchasing this product! It’s a perfect fit for my Microsoft Surface Laptop 2!",
      "rating": 5.0,
      "verified": true,
      "author": "Gunther00243",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Really loved the product!",
      "text": "I don't usually write reviews but this was the best laptop cover I have come across so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Muhammad Ahad Butt",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Seriously???",
      "text": "Cover doesn’t fit, Scratches the laptop, difficult to remove, waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Great sleek case!",
      "text": "I was a little skeptical, but for the price the case is great. It fits perfectly. I have no problem connecting the charger with the case on.",
      "rating": 5.0,
      "verified": true,
      "author": "Yaslin Saravia",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Rips coverings",
      "text": "Don’t buy rips the Alcatera fabric at the holding edges on a brand new $1200 SL2 thanks",
      "rating": 1.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Not my favorite",
      "text": "Can't actually see the logo and it smudges easily. But it does the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Adrian",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Good choice",
      "text": "The cover was true to size. Installation was quick and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Sturdy",
      "text": "Its stong i like how its easy to put on",
      "rating": 5.0,
      "verified": true,
      "author": "jose chavez",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Do not buy! Damaged Alcantar and not transparent!",
      "text": "The case damaged my Alcantar leather on my Laptop and it does not show the Microsoft logo in the back as shown in the picture. Highly disappointed. Would buy another case, if there were more on the market.",
      "rating": 3.0,
      "verified": true,
      "author": "Juan Reyna",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Slightly too tight",
      "text": "Will use until a better product comes out. This case is slightly too small and squeezes the fabric on the keyboard as others have mentioned.",
      "rating": 3.0,
      "verified": true,
      "author": "Sonia Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "The bottom cover",
      "text": "One corner wouldn't even fit on my laptop, but instead would push the fabric keyboard damaging the keyboard. It came defective for all I know. You can't even see the Microsoft logo like in the pictures advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Eddy Goulart",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "ok. but some flaws",
      "text": "rubber feet on back are missing. case is too close to usb port so some things don’t plug in well",
      "rating": 3.0,
      "verified": true,
      "author": "Benny Mao",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Bottom half doesn’t fit",
      "text": "The bottom part keeps coming off, it doesn’t fit properly at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruan",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Excellent",
      "text": "Easy installation. Feel very secure protecting my device with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "SUWOOP",
      "text": "I’ve had this for 2 months. I thought it would break easily but hasn’t.",
      "rating": 5.0,
      "verified": true,
      "author": "Makaveli",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Does the job I was looking for",
      "text": "Not really made to protect but great for just keeping your laptop covered and clean",
      "rating": 4.0,
      "verified": true,
      "author": "Michel rittenour",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Expected better",
      "text": "I expected the product to be better than the one I received. It's flimsy and doesn't feel like it's protecting my laptop. A bit disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Not a good one!",
      "text": "It doesn’t fit. It kept falling off from one side.",
      "rating": 1.0,
      "verified": true,
      "author": "Tasnimul Sakib",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Doesn’t fit correctly, had to adjust",
      "text": "Didn’t fit properly, had to file down edged to make sure it didn’t like the felt",
      "rating": 3.0,
      "verified": true,
      "author": "Marianna Sauceda",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Defective bottom cover",
      "text": "Top fit perfect but the bottom case came defective and will not fit",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Wrong cover",
      "text": "Bad service, the cover was not for Microsoft surface laptop. Not worth any star",
      "rating": 1.0,
      "verified": true,
      "author": "Maryam",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Lightweight and durable",
      "text": "I use this to keep avoid my laptop from breaking since I take my laptop practically everywhere with me. Very light and practical.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela Navarro",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Unbelievable",
      "text": "The case was already broken when it arrived to my house.",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Just what the description says",
      "text": "Just what I was expecting.. Sleek, good material and fairly light.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug Dell",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Five Stars",
      "text": "the case is perfect just the way i imagined it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Good fit, not the best material",
      "text": "It fits nicely, which is a huge plus considering there aren't that many cases for the Surface Laptop out there. However, the black case is a lot more opaque than what I was expecting in that you can't even see the Microsoft logo like the product image shows. It also shows smudges and fingerprints quite easily. When I open my computer, I have to open from the sides, otherwise the case starts to lift off the computer. The little legs are a nice touch, but I would've preferred a more transparent case that doesn't have to be cleaned every few days.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "Not what’s shown",
      "text": "It was not what was pictured. The plastic looks very cheap and the window to show the windows logo is 100% not see through like shown. There’s also a border that makes it different from the picture advertised. Definitely not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "christopher ortega",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Two Stars",
      "text": "It is more brown that gray, you can barely use the Microsoft logo.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180321
    }
  ],
  "product_meta": {
    "title": "iPearl mCover Hard Shell Case for 13.5-inch Microsoft Surface Laptop (3/2 / 1) Computer (NOT Compatible with Surface Book and Tablet) (Black)",
    "rating": 3.7,
    "specifications": {
      "Product Dimensions": "12.23 x 8.89 x 0.67 inches",
      "Item Weight": "8.4 ounces",
      "Manufacturer": "iPearl Inc, USA",
      "ASIN": "B074P8QNX9",
      "Item model number": "mCover-MS-SurfaceLaptop13-Black",
      "Customer Reviews": "3.7 out of 5 stars365 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#440 in Laptop Hard Shell Cases",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 8, 2017"
    },
    "categories": [
      "Computers & Accessories",
      "Hard Shell Cases",
      "Bags, Cases & Sleeves",
      "Electronics",
      "Laptop Accessories",
      "All Departments"
    ],
    "price": 24.95
  }
}