{
  "website_summaries": [
    {
      "verdict": "A lightweight, shock-absorbent glove that provides both protection and comfort. This glove is built to last.",
      "pros": [
        "This glove comes in a number of different cuts and styles, so you can pick one that fits your specific needs",
        "Comfortable, without feeling too large or bulky",
        "We love how these gloves are able to take more aggressive use while showing little to no wear and tear"
      ],
      "cons": [
        "While the glove is comfortable once it's on your hand, we did find it difficult to put on because the wrist is quite small"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good snug fit gloves for a mature Goal keeper but poor quality",
      "text": "These gloves fit well as described and the finger savers are great to have a protection against injuries. It started out as a great glove for my goalkeeper son, who needed it to used it 3 times a week for games through the season. He loved the grip and and fit of the glove but the glove lasted him less than four weeks even though he used another pair as practice glove. Turns out very costly if one has to buy this every less than a month.",
      "rating": 3.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Excellent durability and grip, when properly cared for",
      "text": "These are my gloves after about 25 games. I probably used them on half turf, half grass. The durability is fantastic, and they're still have tons of grip. I can still palm balls with both hands, and can handle any shot that comes my way. My guess is that the people giving bad reviews don't know how to properly care for gloves and don't realize that they need to be wet when used. If you know what you're doing, these gloves will last quite a while. I will probably buy the new blackout colorway next.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen G.",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "For is great, and they are grippy",
      "text": "My daughter loves these gloves! Very grippy, and are holding up OK. She uses them for practice and games, and will get one season out of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Unmatched customer service!",
      "text": "I received the product and was very impressed with the quality. The initial set fit a little too snug and reached out to Tyler regarding the fit. He promptly responded, addressed the issue, and sent out a new set. Promptly the new set arrived and fit perfectly. The customer service I received is unmatched. I train many goalies, and will always turn them to this product. I look forward to doing business in the future as you now have a loyal customer. Thanks again.",
      "rating": 5.0,
      "verified": true,
      "author": "Omar V. ",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Lasted about a high school soccer season",
      "text": "They are not super sticky and need to be moistened. They are super comfortable but wear off really fast (which is not unexpected).",
      "rating": 4.0,
      "verified": true,
      "author": "Bluevanilladonkey",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "I will highly recommend Renegade GK.",
      "text": "The customer service was top notch. Tyler went waaaay beyond normal service to make sure I was completely satisfied with my order. He definitely proved to me that Renegade GK is totally focused on customer service. I will use them again and recommend them to all of the goalies in our traveling league. quality gloves and awesome service, can't beat that.",
      "rating": 5.0,
      "verified": true,
      "author": "soccer dad",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "So far working very nicely. they grip well",
      "text": "Fast shipping. So far working very nicely. they grip well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Comfortable, great quality gloves",
      "text": "The material is high quality, the grip is good, and the finger guard is sturdy. My friend and I use Renegade gloves and we recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great quality glove",
      "text": "Great quality glove. Great price. My daughter loves them. Customer service is top notch and they stand by their product and the customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Solid gloves",
      "text": "I had a never played keeper before, but these gloves helped me make sick saves instantly. Plus, great gloves at a great price. _SAVE_ yourself some money & slip on these bad boys.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel C.",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Goalie gloves",
      "text": "They feel great and look great. Fits like a true goalie glove.It wraps around the hand",
      "rating": 4.0,
      "verified": true,
      "author": "ken deakins",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Great Gloves!!!",
      "text": "Excellent glove's.Quality is great.No need to spend top dollar on a major brand GK gloves when this are the same if not better",
      "rating": 5.0,
      "verified": true,
      "author": "Juan C Hernandez",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "The grip is great, fingersaves are flexible and comfortable",
      "text": "I just bought them couple weeks ago, so I've only had a chance to use them twice, but so far no complains. The grip is great, fingersaves are flexible and comfortable. The strap is really strong, takes some force to open it. The quality is first class, they look nice too. Overall I love the gloves. I feel like they do run a little small - I've been buying size 9 from different manufacturers for a long time and this is the first glove that fits very tight on my hand, so I might consider getting a size 10 next time I buy them.",
      "rating": 5.0,
      "verified": false,
      "author": "Szymon Zaleski",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Great fit and surface- really like the touch on the ...",
      "text": "Have recently used these gloves in training. Great fit and surface- really like the touch on the gloves and would highly recommend them!",
      "rating": 4.0,
      "verified": false,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20171019
    }
  ],
  "product_meta": {
    "title": "Renegade GK Fury Goalie Gloves with Microbe-Guard (Sizes 7-11, 7 Styles, Level 4) Pro-Tek Fingersaves & 4+3MM Giga Grip | High Performance Pro-Level Goalkeeper Glove | Based in The USA",
    "rating": 4.7,
    "feature_bullets": [
      "TRUSTED BY PLAYERS & THE PROS: RGK gloves are designed to perform and built to last. Renegade GK is the official GK glove of both the NPSL and WPSL, which are the largest professional soccer leagues in the U.S. As of March 2020, the Fury series also had more than 429 Reviews averaging 4.5 Stars across all models and sizes. Note: Reviews are no longer aggregated by product.",
      "SUPERB GRIP PERFORMANCE & CONTROL: All Fury gloves use high-performance German Giga Grip pro-level latex. This plus other upgrades like the 180° thumb wrap and pre-arched palm instantly improve grip, ball control, and yes, confidence.",
      "LEADING SAFETY PROTECTION: Unlike most fingersaves, our removable Pro-Tek Pros will not bend backwards. 4+3MM composite latex on the palm and backhand provide extra impact protection, while the 8CM neoprene cuff and 3MM 360° Duratek strap give excellent wrist support.",
      "SUPERIOR VALUE & COMFORT: We've tried to pack as much value into every RGK glove regardless of play level, while ensuring that they are comfortable. The Fury’s 6D Super Mesh body ensures great breathability while the unique nylon strap puller makes them easy to put on.",
      "100% SATISFACTION GUARANTEED: We’re not happy, unless you’re happy. We stand behind the quality our gloves. If you are not 100% satisfied with your RGK gloves, just contact us. Give us a chance to make it right; you won’t be disappointed"
    ],
    "specifications": {
      "Date First Available": "May 18, 2020",
      "Manufacturer": "Renegade GK",
      "ASIN": "B088SXSYMZ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Soccer",
      "Player Equipment",
      "Sports & Outdoors",
      "Team Sports",
      "Sports & Fitness",
      "Goalkeeper Gloves"
    ],
    "price": 55.99
  }
}