{
  "website_summaries": [
    {
      "verdict": "A 14-piece kit that feels good and offers a number of safety features, including an auto shutoff.",
      "pros": [
        "The 60-watt, 110-volt soldering iron is adjustable from 200 to 450 degrees Celsius",
        "Kit has 14 pieces in all and includes a solder sucker, pump for desoldering, various tips, and a stand",
        "Comes with a carrying case",
        "Good quality for the price",
        "Comfortable to work with",
        "Auto shutoff",
        "Fast heating and cooling"
      ],
      "cons": [
        "Instructions on how to use everything are very limited",
        "Temperature knob on the iron is small",
        "Some reports that the iron doesn't work well and fails quickly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I only used the soldering iron once and it did just fine. Beyond that I can not say",
      "text": "I gave this 5 stars because of the value, you get a lot for the money. I only used the soldering iron once and it did just fine. Beyond that I can not say. I do not know how long this item will last but first impression is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyle J. Coren",
      "helpful_votes": 29,
      "publication_date": 20180619
    },
    {
      "title": "Great Set",
      "text": "Very complete collection. Everything fits wonderfully in the case with space left over for additions. The soldering iron is very comfortable to work with. It heats up quickly and the temperature control checks well with my infrared thermometer. Everything you need and nothing you don't.",
      "rating": 5.0,
      "verified": true,
      "author": "Ole Rellik",
      "helpful_votes": 34,
      "publication_date": 20180505
    },
    {
      "title": "Got exactly what I wanted",
      "text": "Works great so far with no complaints. Have used it to solder some LED lighting I hardwired into my car and used it to repair a Lyft/Uber sign that was flickering. Even used to dabble in pyrography when I'm bored. So far it's done the job I expected it to and completed the jobs I bought it for. The wood burning and pyrography is just a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Cruz Crew",
      "helpful_votes": 31,
      "publication_date": 20180427
    },
    {
      "title": "Great bargain",
      "text": "Great bargain for the price. Decent quality, I have an expensive desk top unit but needed something mobile that was easy to use and at a low cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Pancake Robot",
      "helpful_votes": 32,
      "publication_date": 20180614
    },
    {
      "title": "Amazing tool! Love it",
      "text": "This is a very nice set! It comes with lots of accesories that fit all in the very convenient case. The quality of the product is very high, I love how versatile and easy to use it is. It is safe thanks to all the ways you can use it, and easy to keep together without losing parts. For the price is the best set you can get, in my opinion, it is a very good investment. Great tool",
      "rating": 5.0,
      "verified": true,
      "author": "J. & P. St. J.",
      "helpful_votes": 36,
      "publication_date": 20170814
    },
    {
      "title": "Soldering is now a lot more fun.",
      "text": "For a beginner like me it was perfect.The solder has 2% flux in it. previously I was adding flux before this. the case is nice because I can keep my 2.75 cheater bi-focals used for soldering in it.",
      "rating": 5.0,
      "verified": true,
      "author": "The BWS in Ohio.",
      "helpful_votes": 22,
      "publication_date": 20180513
    },
    {
      "title": "I have been wanting a kit like this for awhile and I'm so glad I finally ...",
      "text": "I have been wanting a kit like this for awhile and I'm so glad I finally gave in and got one. I love it, it's so easy to use and it has all the tools that you could possibly need. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "maria collado",
      "helpful_votes": 28,
      "publication_date": 20180421
    },
    {
      "title": "A good soldering kit for the novice or pro.",
      "text": "I ordered this soldering kit and it arrives quite promptly. The kit came with its own sturdy carrying case with elastic holders for all the pieces. The quality of the parts are really good and don't feel cheap at all. The kit comes with everything anyone would need for basic soldering needs around the house, for projects and more. You get a soldering iron, a stand, desoldering pump, 5 soldering tips, tin wire, tweezers, wire stripper cutter and of course the case. If your a novice or an expert, this kit won't disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "JESSICA FAROOQUI",
      "helpful_votes": 31,
      "publication_date": 20170903
    },
    {
      "title": "Worked great.",
      "text": "So it came with many accessories. It was a great kit over all. I was soldering an LED light for my xbox one. I ended up using the accessories I didnt think I'd need. Super great for a starter kit. And the ability to adjust the temperature is really nice. I'm not working on any big projects so I dont need mine too hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro Flores",
      "helpful_votes": 21,
      "publication_date": 20180623
    },
    {
      "title": "Died before I finished tinning it - AVOID.",
      "text": "Only worked for 2-3 minutes before it died and nothing i did could get it back on. didn’t have time to solder a single joint. The rest of the stuff in the package screams low quality, but that’s to be expected for the price. Again THIS SOLDERING IRON DIED AFTER 2 MINUTES!",
      "rating": 1.0,
      "verified": true,
      "author": "Zachary Paden",
      "helpful_votes": 6,
      "publication_date": 20180921
    },
    {
      "title": "EXCELLECT",
      "text": "I just received this kit today and used it on a project I was working on. I really can't say enough good things about it, in fact there is not one thing missing from the kit that you would need in order to use it once you get it. Great product, two thumbs up and five stars",
      "rating": 5.0,
      "verified": true,
      "author": "topmacka",
      "helpful_votes": 9,
      "publication_date": 20180505
    },
    {
      "title": "Great value.",
      "text": "I bought this soldering iron for making battery connectors for my Lipo batteries. So far, no issues. The iron heats up quickly and most importantly, does the job. I can melt the solder to make my connection fairly quickly. The kit comes with multiple iron head tips for different jobs. It also comes with a suction for removing solder, and some solder as well. And one more thing comes with the kit, a wire stripper, is not the best for stripping wires, but it does the job. For the price, it's a great value. It sees like a high quality iron. It also has adjustable setting for adjusting the wattage on the iron.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis A Cortez",
      "helpful_votes": 2,
      "publication_date": 20180819
    },
    {
      "title": "You get what you pay for",
      "text": "I should have known that $10 was too good to be true. This thing is cheap and flimsy. The base isn't heavy enough to stay put. The handle gets very hot. Pay the extra money for some quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Nightshift",
      "helpful_votes": 4,
      "publication_date": 20180724
    },
    {
      "title": "Everything you need",
      "text": "Ok well I have not used this yet as I had bought it to use in the future. However even without experiencing the kit I can say that I chose this kit over others because it had the best & fullest kit of extras and various essentials that I had not seen in any of the other kits all making similar claims. Plus it priced right in the middle range of the other kits. Whilst definitely offering more in the box to make sure yr not caught out without something essential that wasn’t included with a lesser kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Orlando Gloom",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "There willing to help customer",
      "text": "The quality appears to be very nice there customer service is excellent the way they reach out to help you in anyway",
      "rating": 5.0,
      "verified": true,
      "author": "HANDY",
      "helpful_votes": 6,
      "publication_date": 20180225
    },
    {
      "title": "Not worth a fraction of what is being charged.",
      "text": "Worked for about 30 seconds and then died. Will not heat up anymore and honestly based upon visual inspection, I dont think any amount of work will be worth it to make this cheap piece of crap work.",
      "rating": 1.0,
      "verified": true,
      "author": "Peacepipe",
      "helpful_votes": 4,
      "publication_date": 20181116
    },
    {
      "title": "Nice for the Price",
      "text": "A good, low-cost kit for electronics and hobby use. The iron is adjustable for temperature, but the dial is tiny and hard to read. It heats quickly and works well. Five different-size tips are handy for a variety of tasks. I was working on a dimmer switch and had no difficulty. The two-piece stand holds well, if loosely. The kit with tweezers, sucker and other bits is a good value. Instructions are vague, but how hard is it to operate a soldering iron? I could not open the web site to register it, but it's a throw-away item. The zippered bag has elastic hold-downs and is secure to stow easily. It arrived quickly and works as advertised. Reliability remains unknown.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "From a 13-year-old's persective",
      "text": "This was a gift for a 13 year old who loves to make things. (As in, built himself a computer, and one for his younger brother; has his own 3-D printer.) Here are his comments after using this soldering kit for about two weeks. 1. The temperature dial is useful. 2. The soldering iron does not heat really high, but will still do most jobs. 3. The wire stripper is garbage. Make sure you have a real wire stripper. 4. Other than the wire stripper, it has everything I need.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Geis",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Sufficient",
      "text": "The overall product was superb. The quality of the product however is lacking, it is similar to a cheap electronics kit you can find from a Chinese market but with less variety. The soldering iron’s grip feels like cheap plastic and the stand doesn’t really fit the soldering iron. In essence, this is something to buy if you need to do some quick soldering if you don’t have the tools, or if you are just getting started. It gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack Lin",
      "helpful_votes": 2,
      "publication_date": 20181019
    },
    {
      "title": "Good buy.",
      "text": "Very complete soldering kit. I bought it for my grandson and it is perfect. The only thing I will add is a separate container of flux.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 6,
      "publication_date": 20180611
    },
    {
      "title": "Doesn't get hot enough",
      "text": "Didn't get hot enough to solder so I purchased a blow torch instead",
      "rating": 1.0,
      "verified": true,
      "author": "Tye Vancartier",
      "helpful_votes": 4,
      "publication_date": 20180824
    },
    {
      "title": "Excellent and Complete Set",
      "text": "Perfect kit. Exactly what I was looking for for jewelry designing and repairing. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Parachute",
      "helpful_votes": 7,
      "publication_date": 20180114
    },
    {
      "title": "Great kit for a great price",
      "text": "I purchased this kit for a single project, since I knew that my 40+ year old soldering iron was too big and clumsy to do the delicate work of soldering in a tight place to attach new leads to a computer power supply. WOW! Was I amazed at how quickly the iron heated up, and how I was able to get the right heat at the tip exactly where I wanted it. The other components in the kit work well too. The stand is perfect, and I didn't think that I would need the other small tools, but they came in handy. All in a nice case to keep it organized. And all for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Reality Check",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great Kit - Minor Flaws",
      "text": "Good product for the price! The only complaint I have is that the solder iron holder is a little large so the iron has a tendency to slide down and touch the work surface. Also, the stand is fairly small, which makes the stability of it questionable when the iron is in the holder on the stand. Other than this minuet complaints, the iron itself is great! I also like the solder sucker and other tools it comes with. This is the best set for the money!",
      "rating": 4.0,
      "verified": true,
      "author": "Jp Miller",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Pretty good kit",
      "text": "I do find the writing on the temp control knob to be quite small and difficult to read, but now that I know which direction to turn the dial, it's all good. Minus one star because most of the stuff it came with was just ok, but a few items were very useful--the angled tweezers, for example. I don't see myself ever using the solder sucker thing, but I'm not working on chip boards, just guitars.",
      "rating": 4.0,
      "verified": true,
      "author": "Marissa Cook",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Nice kit, but....",
      "text": "It's a good kit, but the iron will not tin. The solder sent with it is pure crap. I used my Kester 63/37, which is much better quality. The iron tip is just horrible.",
      "rating": 3.0,
      "verified": true,
      "author": "Kenneth Knerr",
      "helpful_votes": 2,
      "publication_date": 20180708
    },
    {
      "title": "Could not pass over 19.7 watt!!!",
      "text": "Absolutely disaster. Could not melt well and destroyed my board. It is not able to pass 19.7 watt which you can see on my picture. Never buy this stuf from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181219
    },
    {
      "title": "Pretty much useless",
      "text": "The tip was so corroded that it was impossible to tin right out of the box. The iron itself can't heat up enough to melt the solder. It was worth the money to learn NOT to buy cheap garbage when you need a decent tool.",
      "rating": 2.0,
      "verified": true,
      "author": "MedicUSAR",
      "helpful_votes": 2,
      "publication_date": 20180817
    },
    {
      "title": "Great kit, works great, everything you need...",
      "text": "The kit has every thing you nee to do fine work, item shipped very fast. I needed a good iron, I have been working on a power supply and needed a iron that heats up fast and can have a temperature adjustment. I do lots of electronic repairs and at times have to use a lower temp, and it works great. The kit has every thing you need all in one case. I would recommend this kit to anybody that works on electronic repair or hobby work....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Save yourself a bad experience!",
      "text": "Absolutely garbage! First of all the thing came with some of the parts already been used. The biggest issue however is that it only worked for about 5 minutes!",
      "rating": 1.0,
      "verified": true,
      "author": "bobb saw",
      "helpful_votes": 7,
      "publication_date": 20180623
    },
    {
      "title": "Great value and function combined",
      "text": "I don’t do tons of soldering projects, but my 30 year old soldering gear was due for replacement. Love this kit and that it has its own case. Finally had a project today doing some automotive radio harness assembly and the gun worked well. The stand could be just a bit more tip resistant but it did work and I quickly adjusted to it. I would buy this kit again without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Grumpy in Maine",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "I use this all the time, and it works great!",
      "text": "I use this kit often. It works great for soldering my drone when I need to replace motors or other things. I wish it had come with a copper mesh solder cleaner and some tinning compound. Mine did not come with the wire cutters, strippers and multimeter in the picture, but I ordered this over a year ago and perhaps the listing has changed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Rice",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great kit if it comes with everything.",
      "text": "Love the product but didnt come with all the accessories. Just got the soldering iron kit. I assume these other items were added after I purchased mine as my brother was asking about buying the same one I have. I did not get a multimeter or cutters or anything besides the soldering kit items.",
      "rating": 3.0,
      "verified": true,
      "author": "Shaw",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great product and great price",
      "text": "I use the soldering iron for minor electronic and electrical work at home. The five different tips that came with it gives me a lot of flexibitity for different projects. It also came with a beautiful carrying case and it came with all accessories I needed. I'm very pleased with the performance. It heats up pretty fast so I get most done quickly. I couldn't be happier with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel A. Abraham",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Get this",
      "text": "With the daus where you could go to the local shop and get a quality soldering kit gone to the way side, i was excited to get this kit. The soldering iron is top notch and the adjustable heat setting is perfect for a wide range of solder types. The kit includes everything you need for doing repairs or STEM projects. When you add in that for the same price at the local big box store, you only get the iron and its not temp adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "Don J",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Gift to father that was stolen and later found at my house",
      "text": "After a few uses the heat adjustment knob came off. A drop of super glue fixed the issue Over all great kit for small projects and things around the house. Price was great and so far it has been a very good tool around the house. I have so far blow up an amplifier, burnt a hole in some laundry, melted a few other things and burnt my self a few times but that is 100%user fail and not to blame on Amazon or the iron. Overall I have enjoyed the kit and can tell a huge difference in it from my old 20w iron.",
      "rating": 4.0,
      "verified": true,
      "author": "Daddy",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Stay away",
      "text": "Total garbage. You don’t get anything that is shown in the picture. Avoid like the plague.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark the shark",
      "helpful_votes": 4,
      "publication_date": 20180802
    },
    {
      "title": "Great mobile kit for low price",
      "text": "this thing will hold up for on the go quick fixes, I use it for my quadcopter when I’m out in the field. Small and convenient case and very cheap for what you get. I wouldn’t use this as my main iron but some might be able to. The tips are not the best at transferring heat. When setting to 425 degrees Celsius, the middle of the tips glow red but the end is only aroun 300 degrees or so.",
      "rating": 4.0,
      "verified": true,
      "author": "jon",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Every piece of the kit is good quality and useful",
      "text": "My soldering tools have been missing since our last move and I needed to make a small change to a USB power cable so that a light would dim in the dark bedroom while being bright and beautiful in the daylight. I wanted a one stop shopping trip to solder and maybe make changes and resolder. This kit does it all with room to spare, works great and includes whats needed. The most significant thing is that none of the small pieces in the kit are junk like I have found in other similar kits. It does the job if you know what you are doing and I think it would help you learn if you are a novice.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Looney",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great buy!!!",
      "text": "My bf taught me how to soder and I wanted a kit for my own to practice and he gave his professional approval on this kit. It's very nice and lite it's not heavy like his which I like but it works the same. It gets the job done for my little projects like my led costumes that I have repaired. And my microphone cords that I repair myself instead of buying new ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Faye Hill",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Great little kit",
      "text": "I love that it can easily be packed up and put away. Everything in the kit is of much better quality than expected. One note - the temperature adjustment on it is very small and easy to overlook. Now that I know it's there it's not a problem but the first time I plugged it in I waited and waited for it to get hot enough before I realized I just needed to turn it up! Overall I'm very happy with it and would recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "J Budda",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "A Great Tool at a Value Price",
      "text": "I needed a new soldering iron to change some components on a board in a controller. The irons I had were too hot for the application. I choose this iron because it was the right wattage and you can control the temperature. I liked the kit and the soldering hints. Component switch went great and I saved a lot of $.Very nice accessory package.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas H. Alwine",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Excellent quality",
      "text": "Well made, soldering kit works great. Adjustable temp for small electronics. Nice case will make a good addition to my tool kit. I am amazed at the quality and selection of additional items in the kit from extra tips for different jobs to the holding stand. I would highly recommend this kit to anyone experienced and novice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Nice, small and organized.  I like it",
      "text": "This is my first soldering kit, so I am not an expert. I like the case, it organizes everything nicely, and I like how small it is. I soldered for the first time with it, and I like it very much. My item didn't work afterward, so I'm not sure if I did it right. I need to do some research, but it really seems to be a nice kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Dewick",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Great product for the price",
      "text": "I love this soldering pencil. I bought it to add electronics to my boat and its the perfect size to accomplish that. It heats up very quickly and performs nicely. All the other pieces are an added bonus. The only criticism I have is that the temp dial knob is almost unreadable, but I realized that as increased the temp the light indicator got brighter which is how I now determine my temperature setting.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary G",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Handy collection of tools for soldering",
      "text": "I received the kit a few days ago and now I've had a chance to use it a little. I'm rewiring the electronics (replacing pickups, pots, etc.) for an electric guitar, and so far tis kit has everything I need both to take apart/clean up old connections and to solder new ones. Everything came in working order and seems well made, and even though I didn't ask for assistance, the seller has been very attentive and asked how he could improve my experience with the product and his company — a nice touch. With a good-quality yet very affordable kit like this, you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "lorenzo garcia",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Looks good",
      "text": "I haven't used it yet. Good little kit however. My old iron hasn't died completely but I can't seem to find tips. This has lots of tips and easy to find more. I might buy more just to have on hand. If this iron last as long as the last one....15 years....then it will be a great investment.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff C.",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Great kit! Heats up fast!",
      "text": "Either ama or the seller arent allowing video reviews which is ashamed. I prepared one showing how fast this thing heats up, but whatever. Heats up in 30 seconds and goes from 200c to 450c.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael H. Pettit",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Soldering iron can’t get hot enough",
      "text": "This seemed like a good kit. But ultimately the soldering iron wouldn’t get hot enough to “properly” melt the solder.i tried axing flux and no differenence I ended up ordering a different soldering iron that could properly melt the solder and used all the extra stuff that came in the kit",
      "rating": 2.0,
      "verified": true,
      "author": "Douglas T.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Seems good",
      "text": "Needed to solder a burnt wire on the trigger of a DeWalt impact driver, having very little experience of wire soldering, I did it in matter of 15 minutes, This soldering kit seemed the best one for the money,I used the solder that came with the kit and it worked fine,the soldering gun seemed to of good quality, I however would have liked of the temperature dail was in f° and not c° . as other reviews stated kit had plenty of storage. How long the soldering gun will last is unknown, For the money I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "personal customer service and a high quality product",
      "text": "I had bought this soldering kit for my son for Christmas. Upon purchasing I shortly received a thoughtful email from the seller -Magneto Tools- expressing his gratitude for us completing the order and insisting that if we needed any help with the product to let him know. Also attached in the email was a very detailed PDF explaining different soldering tips and techniques. The product itself is very high quality and comes in a very high quality case. The heat adjustment was what caused me to lean towards this kit and it did not disappoint. Overall I was very satisfied with the personal customer service he provided us.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Wallace",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Wow ... Says it Best!",
      "text": "The soldering iron and kit are just fabulous. High quality. All of my needs in soldering are met with this kit. I am new to working with stained glass - and this soldering iron kit has given me a 'good taste' of the stained glass hobby. I hope the kit will serve me for many years ... and, if it eventually does wear out, I'll be happy to buy from SR Quality Products again. Why mess with success?!? Please note: I realize I can only get better in my soldering techniques. Two days ago was my first use of a soldering iron. Tomorrow ... the world(?)",
      "rating": 5.0,
      "verified": true,
      "author": "bailey01",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Excellent Handy Kit",
      "text": "Just the job for the electronics hobbyist. Has all you need to \"grab and go\". Nice selection of 'bits' for the Iron. Took me a few tries to find the best setting for the Thermostat but at least it has one! Luxury compared to the days of my youth.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe The Engineer",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Love this great soldering iron set!",
      "text": "After ordering and returning 2 X-Tronic soldering irons which didn’t work properly I decided to purchase this set which was less than 1/3 the price and came with a plethora of accessories and a case. After using it for a few days to solder electronics and circuit boards, I can say without a doubt that it’s a great soldering iron and a terrific value for money. You will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Salvatore Ricca",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "kinda goodish",
      "text": "the item arrived in time and had all the stuff in it, it was really great, but after a few uses the iron didn't heat up and it's not working since. I haven't been using it much (twice a month) and I have kept it inside the case. I've tried turning the heat adjuster up which came out when I adjusted it back to minimum, I'm kinda disappointed. The kit is cool but the soldering iron isn't durable at all (at least not the product I've received, maybe it's just a faulty one).",
      "rating": 3.0,
      "verified": true,
      "author": "Rohiro",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Great for small jobs, maybe more",
      "text": "It worked for me. I don't have anything to compare it to, but I successfully used it to replace the capacitors on my flat screen TV. The extra tips helped, because I had a very small area to work with.",
      "rating": 4.0,
      "verified": true,
      "author": "Sunrise S.",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great delivery time!",
      "text": "Talk about great quality for the price! This was a Christmas gift for my daughter who has a store for genuine stones and handcrafted jewelry! She absolutely loves this and is now watching the tutorial. She is amazed at all this kit can do for her business. Thank you so much! M",
      "rating": 5.0,
      "verified": true,
      "author": "Mary A. Torres",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "good value. for items that I do not need ...",
      "text": "nicce set, good value. for items that I do not need the high end items for I go to harbor freight. but I thought this looked good and since I was ordering a few things that were needed along with this item i thought let's see if it is as advertised. and am very happy with the price, quality, shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "doberman",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "DOA",
      "text": "Had to return item for refund as would not heat up. ordered a different brand and works great.",
      "rating": 1.0,
      "verified": true,
      "author": "Cohiba smoker",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Good Product, Seller will SPAM your email.",
      "text": "Soldering iron works good, included solder isn’t the best quality, as to be expected. However, when you buy from this seller, your email address is auto signed up to their mailing list, and they spam your email a lot. I’ve received five emails within the past week and a half alone, with their last email asking me to write a review, so here I am warning future customers.",
      "rating": 3.0,
      "verified": true,
      "author": "Brendan G",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "You cannot register for warranty because the domain does not exist",
      "text": "Its a decent product for the money but this company seems to be out of business and the warranty is not able to be redeemed. I had tried to contact via the help email and get a response that the domain does not exist. but all in all, a $16 kit I did not expect to much support.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul D.",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great kit for the hobbyist/user, plus super price and selection!!",
      "text": "Wow, you really cant beat what you get for your money on this kit. Pretty much everything and then some for the household hobbyist/user. I use mine on my guitars/basses. Nice tips, great warm up time, happy with purchase. Would def recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "silverfox",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Nice kit. Good value.",
      "text": "Used this to solder wires(12-18gauge) on construction equipment, when soldering is a must. Excellent little kit here, especially considering the price. I like being able to keep all the pieces together thanks to the zipper pouch.",
      "rating": 5.0,
      "verified": true,
      "author": "CJM515",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Low quailty item",
      "text": "All the parts in this kit are very low quailty, the sponge is about 2 mm thick, the soldering iron does not sit in the stand well at all. The soldering iron has no off position as plugged in is on. Not worth the purchase I will be returning this item.",
      "rating": 1.0,
      "verified": true,
      "author": "K M.",
      "helpful_votes": 2,
      "publication_date": 20180925
    },
    {
      "title": "Good Purchase",
      "text": "If you are looking for a cheap soldering iron, than this is a wonderful choice. It's handy for a lot of things, but it is still a cheap iron and will only take you so far. The kit is pretty handy, but I would avoid using the included solder as I had some issues with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaleb Blankenship",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "It works great for me",
      "text": "I had to replace xbox 360 controller thumb sticks after years of use. Never soldered in my life before so I looked up some videos. Seemed easy enough, but was a bit challenging getting the solder with the pump. It is only liquid for a moment and pressing the button at the right moment was frustrating. Once I got a few it became easier but could still cause distress. Ended up replacing 4 thumb sticks because I had such a great time.",
      "rating": 5.0,
      "verified": true,
      "author": "kannabil",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Soldering outfit",
      "text": "Thank you for such a compact and useful soldering kit. I will be using this self-contained kit for motorcycle wiring projects in the very near future. The price will allow me to send one to my son in the State of Maryland so I can work on his motorcycle later this year. Thanks again.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Grace",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "It kinda gets the job done",
      "text": "I need flux yet to make it work better however I did a temperature test and the dial showing 450 degrees F is actually 408. Enough to melt the solder with some pressure applied but not enough to make the transition very fluid. Worth the price if you can handle that fact.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruk ryce",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Best value, would recommend for anyone",
      "text": "Best value, would recommend for anyone. you get a lot of bang for your buck, the extra tips in this package are sold elsewhere for $7. it seems this seller really put a lot of effort in compiling this starter kit and making it affordable. Feels well made and everything working as expected so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamer",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "The Assortment",
      "text": "Everything I needed was there. I had to solder a 10 wire plug next to the windshield of my jeep and this had all the tools I needed to do the job. That, plus the fast delivery was a lifesaver. btw- I fixed my jeep!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Simpson",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Works great--good heating and tips",
      "text": "Worked great, good heating, nice tips for getting in places. I used this only briefly, so I don't know how well the tiny temperature control would last over time.",
      "rating": 5.0,
      "verified": true,
      "author": "David Spector",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great kit",
      "text": "I only needed the soldering iron but I this was around the same price as the cheap one I got at Ace that crapped out instantly, so I figured id give it a shot. So far ive been very happy with it, the multimeter has a back lit screen which is awesome. Had it for about 4 months now, used relativley frequently, and no issues so far. The stand for the soldering iron is a little light so be wary of it tipping, but I just taped some nickles to the bottom and it works great",
      "rating": 5.0,
      "verified": true,
      "author": "Wes Hallstead",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "This kit had everything I needed",
      "text": "I liked how it had things I didn't think I needed until after I got it and then those things like the suction desolderer thing and extra wire came in clutch. The case is well made and includes everything I needed. There are things I will be upgrading in the future like the wire stripper but it gets the job done for the time being.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared S.",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "It didn’t work well for me",
      "text": "This product worked 4 times. I maintained it as recommended, yet I’m stuck with this product. Many people here love it, that’s why I bought it. I suspect they have some lemons and a good company makes it right.",
      "rating": 1.0,
      "verified": true,
      "author": "Acquisitions Inc",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Worked great.",
      "text": "Good product and price. Tweezers were especially helpful holding small things in place while sodering. I wished the suction had a metal tip. I accidentally touched it to the soldering tip and it melted while trying to remove old solder. But, I was able to fix my child’s Nintendo 3DS with it. Caution, I had the setting too hot at one point and the tip of the iron started to bend from the heat.",
      "rating": 5.0,
      "verified": true,
      "author": "T Hui",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Product comes as described",
      "text": "Soldering Kit was as it was described and pictured. Bought for son-in-law who needed it for soldering jobs around the house, particularly a mending job for a bird feeder stand that I accidentally broke when I was trying to put into the ground. Very pleased with item especially the short time it took to arrive at my house.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Brown",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Niice Set",
      "text": "Haven't had a chance to fire it up yet. Everything was in the case and as described. The instruction link to the PDF file is a nice touch (basics of soldering information). For a hobbyist {like me} this is a good set. It's all I need to get a good start and will be handy for the occasional home repair. Going to use this to wire controls for a guitar.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert A Haffner",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Best I’ve owned",
      "text": "I was very skeptical at first to buy. So many in the past have been junk. This is the best I have owned. I should buy two or so more just to have in other places I go.",
      "rating": 5.0,
      "verified": true,
      "author": "Kg",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Really nice!",
      "text": "This was exactly what I needed, the price is VERY right, and it comes with lots of things that I no longer have to run into \"oh, I also need a...\" and then buy something else! Works well and seems well made! Thank you for making this!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher L. Stave",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "A great and balanced assortment.",
      "text": "The soldering iron works like a charm and a majority of the items included are nice, like the tweezers or the wire stripper. I cannot say the soldering iron holder is up to par, but it holds the soldering iron and sponge relatively well.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Already breaking",
      "text": "I have had it maybe a week. Think I took the voltage and ohms on some things seems to work ok, not sure how accurate it is tho.. solder gun is iffy. Not sure if I'd buy again but it's already breaking. I was walking with it in my hand and the positive lead tester just fell, here's a pic",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Astounding Soldering Kit !",
      "text": "For the price this is a great find ! For those of us who solder on a regular basis, one of the biggest problems was the inability to selecy the proper temperature for the material being soldered. That is not a problem with this iron. That is a huge plus along with the extras that they include in their kit. I am quite pleased !",
      "rating": 5.0,
      "verified": true,
      "author": "William Bailey",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Awesome Soldering Kit",
      "text": "Very happy with the soldering iron kit. It comes in a nice zippered case to keep everything together. I soldered a loose connection in a circuit board as soon as i received it. Heated up fast and melted the solder quickly, even on the lowest temp setting and cooled off quickly after i unplugged it. Extremely happy with my purchase after the first use, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Great kit especially for the price",
      "text": "Kit can as described. Everything appears to be in good working condition. Haven't used the soldering iron yet but will in a few days.",
      "rating": 5.0,
      "verified": true,
      "author": "S_Henley",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Everything I needed at an unbeatable price...",
      "text": "I needed to desolder and replace two MCZ3001D chips in my Sony Wega Trinitron because it stopped turning on. Although I had no prior experience performing any complex electronic repairs, this kit had everything I needed at an unbeatable price. Purchasing everything separately not only would have been a hassle, but it would have cost a great deal more. I couldn't possibly be more pleased with the combination of quality and value in this kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Outstanding Product",
      "text": "I was looking for a soldering iron to teach with and found this product to be perfect for everday job and projects. It works as advertised and it's a good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Outlaw",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "two dollar soldering iron lasted about 15minutes.",
      "text": "you get what you pay for... get a proper soldering gun if you need something that actually melts the solder provided in the kit! i've already posted one negative review for this item... which must have been refused/deleted if i'm still getting these messages asking me to do so... if i get another request, i'm going to get nasty.",
      "rating": 1.0,
      "verified": true,
      "author": "Alfred Clayton Spears JR",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "One nice soldering kit",
      "text": "The first thing I used this for was to repair the speaker wires in my truck. It tinned them nicely. I didn't have my lighter with me to heat shrink the tubes so I turned the heat to the lowest setting and touched the shrink tubes and presto. The main reason for buying this kit was to aid in my solar panel accessories. I'm sure it will prove itself capable.",
      "rating": 5.0,
      "verified": true,
      "author": "Norm Roberts",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Excellent Product",
      "text": "I bought this kit to repair some cords chewed by our pet rabbit and am a novice at soldering. Kit was well laid out, tools were very useful, quality was high. Glad I bought it and look forward to using it the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "O\u007fut of the 6 solder irons i have,This one is the best",
      "text": "I needed a variable watt solder iron to solder 30 tesla lith-ion batteries for an e-bike project and being able to ajust the power to solder made the difference.Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "tim clark",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "After adding some extra pieces, it is real nice.",
      "text": "It maybe me but I feel like it may have been missing a piece. The metal stand that holds the wire coil holder needed another nut to hold it together. No big deal I have tons of them but it was odd. Additionally the stand itself is really light and is easily knocked over. I will have to find a better mounting solution than letting it sit on my work table.",
      "rating": 4.0,
      "verified": true,
      "author": "weston lee",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Good Value",
      "text": "I'm was impressed with the completeness and the additional parts that was in the zipper care. Zipper case? Very unusual for a soldering iron, but this kit is portable. Works as stated.",
      "rating": 5.0,
      "verified": true,
      "author": "gf",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Good cheap tool",
      "text": "Great product for the type in value. Recommend if you’re using this as a hobby or occasional repair. Make sure you buy cleaning compound and flux for cleaning and install.",
      "rating": 5.0,
      "verified": true,
      "author": "Cold Iron Axe",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Very Versatile",
      "text": "Can do a lot of different things (small jobs). Very easy to use. Have wanted one for a long time but was nervous to use it. First try was a success. Happy I chose this item. Worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna D.",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "It gets the job done.  Love the case.",
      "text": "This kit has been my outdoor/garage work horse for my automobile/motorcycle/trailer projects, and repairs. The case is great to add extra wiring, in-line fuses, solder, other tools you might use for electrical projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter S.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Pretty good, but you pay what you get",
      "text": "The product was delivered quickly and package was intact. When I opened it, the product was not what I expected. The exterior of the iron looked like it was hastily assembled. Since I am new to the world of soldering, it didn't bother me and it did test great. Overall, underwhelming when seeing it for the first time. However, it did operate decently and, combined with the low cost, makes a good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Works good at all temps",
      "text": "This unit works very well i have used it on 3 things using temps high and low .it keeps temps just at least it did for me",
      "rating": 5.0,
      "verified": true,
      "author": "frank",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Works Great",
      "text": "Fantastic Soldering Kit. Good consistent temp, everything a good basic kit could come with is there. Good hand feel, and a nice case. very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarrod C.",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Great little soldering kit !!!",
      "text": "Great product but didn't care for the Iron Holder it's a little flimsy but really satisfied with the product. Great value !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin H",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Complete Kit for R/C Hobby Soldering",
      "text": "The kit has everything I need to support my radio control airplane hobby. The high heat (60W) setting supplies sufficient heat to splice connectors on higher gauge battery wires.",
      "rating": 5.0,
      "verified": true,
      "author": "JimmyGee",
      "helpful_votes": 0,
      "publication_date": 20180830
    }
  ],
  "product_meta": {
    "title": "Magneto’s Soldering Iron Kit, Updated Soldering Gun Kit Best for Electric, Jewellery & Welding Work – Digital Multimeter, Screwdiver, Soldering Iron Holder (28pcs Set) Best Gift",
    "rating": 4.5,
    "feature_bullets": [
      "【All-Inclusive Kit】 – This durable, high-quality kit contains a soldering iron and soldering wire, a solder sucker, pump for desoldering, a selection of soldering tips, a self-cleaning sponge stand, and much more – making it the perfect choice for all of your at-home soldering needs!",
      "【Powerful Tools With Adjustable Temperature】 – This versatile soldering iron uses patented ceramic-core induction technology, providing the heat and power you need for even the largest soldering jobs. And with a working voltage of 110v to 220v, and a temperature control providing adjustments from 200° to 450°C, you’ll have the control you need for a perfect solder – every time!",
      "【Advanced Heat Dissipation Technology】 – With a smart design, large venting holes, and a durable heating element, this soldering iron dissipates heat quickly – and cools down in a flash. This makes our soldering iron safe, dependable, and provides a longer lifespan, compared to competing products!",
      "【Convenient Transport With Included Carrying Case】 – Our well-made carrying case provides you with the perfect way to transport your soldering iron and all of its accessories. Never be without your iron again – take it with you, and ensure that it gets to its destination in one piece!",
      "【Safe, Environmentally-Friendly Design】 – Our soldering iron is made of only the most high-quality materials, and contains no toxic or polluting elements, and has been certified by agencies including the FCC, CE, and ROHS."
    ],
    "specifications": {
      "Manufacturer": "Smile tools",
      "Part Number": "A13",
      "Item Weight": "1.95 pounds",
      "Package Dimensions": "11.6 x 6.6 x 2.9 inches",
      "Is Discontinued By Manufacturer": "No",
      "Color": "White",
      "Material": "Plastic",
      "Power Source": "Battery Powered",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0744P55YR",
      "Customer Reviews": "4.5 out of 5 stars783 ratings4.5 out of 5 stars",
      "Date First Available": "October 16, 2016"
    },
    "categories": [
      "Soldering Guns & Irons",
      "Soldering & Brazing Equipment",
      "Irons",
      "Tools & Home Improvement",
      "Welding & Soldering"
    ],
    "price": ""
  }
}