{
  "website_summaries": [
    {
      "verdict": "Features, style, craftsmanship: this recliner tops the pack for all it provides in a classic, versatile style.",
      "pros": [
        "Basic yet attractive with durable fabric",
        "Power operation with the touch of a button",
        "Handy built-in USB charging port",
        "Easy to assemble and supportive for both large and small people"
      ],
      "cons": [
        "Cushioning on the seat and back is somewhat stiff",
        "May have a strange odor upon arrival"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "GREAT VALUE AND REALLY NICE CHAIR",
      "text": "This is a great chair! I was very skeptical because of the low price but took a chance and ordered two of them. We got them both put together in under 5 minutes. The motor is super silent and the color is a nicer color than shown in the pic. It's not gray-ish at all, a very lovely soft taupe. The material is nice and they lay almost perfectly flat for optimum geezer napping. Neither of us are small people and these chairs are ample in size. I am hard to please and I am very pleased with these chairs and the price rocks (although the chairs don't).",
      "rating": 5.0,
      "verified": true,
      "author": "Rob and Glo Carroll",
      "helpful_votes": 79,
      "publication_date": 20171228
    },
    {
      "title": "Great chair for the elderly too!",
      "text": "Great recliner! Got this for my 90 year old grandfather after he complained his current chair is too stiff and hurts his legs to manually push down the leg lift. When it arrived... after it took a max of 10 minutes to put it together... he said.. “this chair is beautiful. It’s very comfy and reclines all the way back with the push of a button.. I could go to sleep in this chair if I wanted.” When you get to be that age.. very few things matter in life. He isn’t that mobile... so a good recliner is very important. His reaction to his Christmas gift made me very happy. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "achiever73",
      "helpful_votes": 70,
      "publication_date": 20171208
    },
    {
      "title": "Best item I've ever bought off of amazon",
      "text": "Best item I've ever bought off of amazon. Easy to put together and perfect size. My husband who is over 6ft and over 200 lbs fits in it perfectly and loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 54,
      "publication_date": 20171206
    },
    {
      "title": "Very true.....",
      "text": "Came fast, easy to assemble, quiet . But,footrest only comes up 3/4 And no where to rest your feet,so your legs are straight out and angled down... not very comfortable for reclining too long . Good for the money ,but leg rest should've come all way up.",
      "rating": 2.0,
      "verified": true,
      "author": "G F Davis",
      "helpful_votes": 29,
      "publication_date": 20180120
    },
    {
      "title": "Do not take the risk",
      "text": "I was skeptical in ordering this as I was afraid the motor would break. But after reading all the great reviews I took a chance and orderd this chair. The chair itself is very comfy the one time I sat in it. I literally just got this chair yesterday took it out of the box assembled it sat in it one time reclined it and the motor stopped working. It's now stuck in the reclined position. I'm taking my Saturday trying to repackage this item and send it back. Not my plan for the weekend when I was hoping to be enjoying my new recliner.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole Cobb",
      "helpful_votes": 17,
      "publication_date": 20180317
    },
    {
      "title": "Delivered on time and the chair is so comfortable. Indeed it is a \"cloud\" chair",
      "text": "This was everything it said it was! Delivered on time and the chair is so comfortable. Indeed it is a \"cloud\" chair.The power button is up high on the right side of the chair so you don't have to bend over to power it up or down. Material is beautiful and took about 2 minutes to put it all together! Price was exceptional!!!! Been shopping at varies furniture stores and nothing can beat it or my Prime Free Shipping!!!",
      "rating": 5.0,
      "verified": true,
      "author": "reds",
      "helpful_votes": 8,
      "publication_date": 20180117
    },
    {
      "title": "For the price this chair is great. Looks good",
      "text": "For the price this chair is great. Looks good. If you expecting a $750 lazy boy for under 200 bucks you may be disappointed. If your 6’2 and 300lbs this chair is not for you. 5’11 or smaller is just right. USB power cable works great. Power recliner works great. Color is great and its comfortable for my kids gaming room",
      "rating": 5.0,
      "verified": true,
      "author": "Floridaman",
      "helpful_votes": 8,
      "publication_date": 20180109
    },
    {
      "title": "Chair is uncomfortable, especially if you want to recline ...",
      "text": "Chair is uncomfortable, especially if you want to recline and take a nap. Not enough head support. When recliner there is no padding for your elbows. They rest on a hard, uncomfortable surface. I'm 5'2\" and my ankles hit the edge of chair when in a recliner sitting or fully recliner position! If you don't need an electric chair don't buy as it takes forever to return to a sitting position. If I could I'd give this chair zero stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy Lewandowski",
      "helpful_votes": 6,
      "publication_date": 20180328
    },
    {
      "title": "+ The chair is of good size, which was a chief concern",
      "text": "+ The chair is of good size, which was a chief concern. I'm tired of not getting proper head support, even though I'm only 6-1, but this worked well. + It's also very comfortable. - The \"power\" function worked exactly once, so I was able to get the leg supporter out. Now, no matter what, I hear the engine churn and nothing happens. It is in a permanent position of having the legs out. - As with any chair, it's too big of a hassle to return.",
      "rating": 2.0,
      "verified": true,
      "author": "Jerry Falwell III",
      "helpful_votes": 8,
      "publication_date": 20180513
    },
    {
      "title": "The chair is fairly comfortable. However",
      "text": "I ordered this chair in December 2017. The chair is fairly comfortable. However, the chair I received has a short, which resulted in electric shock for anyone who used it. When plugging the chair into the wall, the plug shot sparks across my den. This could have easily caused a fire in my house and could have harmed anyone near the chair. I am incredibly disappointed that Amazon would sell such a poor quality and potentially dangerous product. I am sending the chair back, though it is very difficult to get it back inside the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 31,
      "publication_date": 20180123
    },
    {
      "title": "Disappointed.",
      "text": "Disappointed in this purchase. The chair is not comfortable at all. The power recliner does work well however it doesn't recline fully as advertised. The footrest doesn't come up far enough and it doesn't lay all the way back ad seen in the photo. For the price I paid I would have expected better. The armrests have already started to loose there cushioning. The fabric is made well and the construction is solid but I still couldn't recommend this chair. Please note, there will be assembly required but it is not difficult.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Byrnside",
      "helpful_votes": 6,
      "publication_date": 20180503
    },
    {
      "title": "Extremely poor delivery!",
      "text": "Time will tell. This chair was left outside in pouring rain by the delivery company. The box was soaking wet so of course the recliner was wet as well when removed from the box. Since this recliner has an electronic component, I cannot be sure there will be no issues from this being allowed to get wet upon delivery. Thing is, although I was not home at the time of delivery, have a large outbuilding behind my house. Mail and ups have been placed in that building many times before, but not this time. Not a happy customer, especially if we have issues down the road due to this product getting wet.",
      "rating": 1.0,
      "verified": true,
      "author": "a prat",
      "helpful_votes": 4,
      "publication_date": 20180908
    },
    {
      "title": "Great chair for 3 months",
      "text": "I bought this chair, it looked great, very comfortable. But after 3 months the motor went out, and the chair was stuck in a halfway up position. I tried contacting Amazon to check the so called warranty. I was sent on to warranty but they said the warranty posted was not for this chair. so I contacted Amazon again and got no resolution. So I was stuck with a chair that didn't recline or even go down flat. I have since pulled out the piece that connected it to the motor, and am able to use it. Needless to say, I will not be making any large purchases from Amazon in the future.",
      "rating": 2.0,
      "verified": true,
      "author": "Felisha Walker",
      "helpful_votes": 3,
      "publication_date": 20180824
    },
    {
      "title": "Great.",
      "text": "Relatively easy to put together. It's actually wider than it looks in the photos, which makes it very roomy and comfortable. Fabric seems good quality and hopefully will be stain resistant. Smooth motor action without jerking or lagging. Nice neutral color that should go with almost any decor. And very comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "SMO",
      "helpful_votes": 5,
      "publication_date": 20180206
    },
    {
      "title": "YOU'RE STUCK IN IT WHEN PLUG QUITS WORKING OR POWER GOES OUT!",
      "text": "Cheap, lightweight chair which is hard to assemble! My electric plug quit while I was in it with leg extended & I couldn't safely climb out&the leg will not manually push down!(Also realize if the power goes out, you're stuck!) I've since found out in the better type recliners there is a backup safety battery so you could lower the leg. Not safe for seniors or anyone who cannot gymastically maneuver out of the chair should they be stuck with leg part up!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "LuvReading",
      "helpful_votes": 3,
      "publication_date": 20181202
    },
    {
      "title": "So far so good. I bought it when it was $199",
      "text": "So far so good. I bought it when it was $199. I wouldn’t hesitate to buy again at that price! It’s a nice compact but comfortable recliner. I’m 5’10 and 220 lbs, and it’s perfect for me. I can rest my head sitting straight up, and it’s nice and comfy all the way reclined. I can’t beleive there are negative reviews on this based on assembly or price. Under $250 this chair is a steal, and simple to assemble!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin P",
      "helpful_votes": 4,
      "publication_date": 20180206
    },
    {
      "title": "DO NOT BUY",
      "text": "This chair is garbage after a week of use. (Had it for 6 months only used for a week it's been assembled and unused). All of the interior metal is shot. The lower part no longer comes out all the way, nor does it close all the way. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "CarJo",
      "helpful_votes": 4,
      "publication_date": 20180520
    },
    {
      "title": "Good buy",
      "text": "My husband lived it. It reclines back like he likes it and it's firm. He is 6\" and weighs over 200 lbs and it very comfortable for him. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Noemi",
      "helpful_votes": 7,
      "publication_date": 20171219
    },
    {
      "title": "Best sleep ever!",
      "text": "I was disappointed by the gap that appears when the chair is fully reclined (see photo). But fortunately, I remedied the problem with the use of the pillow I had been using and under my legs on my former chair. The chair is perfect for my use. I like it so much, I ordered another one for my bedroom to replace my twin bed! I sleep like on a cloud. I get the best sleep ever. Of course, I’m only 4’10” and 97 lbs, so I can’t say it will as great for others. This 82 yr old is delighted, for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma Jean",
      "helpful_votes": 4,
      "publication_date": 20180902
    },
    {
      "title": "Comfort",
      "text": "Fedex arrived with the chair and the driver was excellent in getting to my door. The chair is outstanding, fits perfect and works great. We just love it so much. And the electric foot riser is outstanding. Lies very flat if you want it to. We are so happy with it and will buy again. Got at our home within three days. Outstanding shipping. Thank you so much. Frankie Vollano, Illinois.",
      "rating": 5.0,
      "verified": true,
      "author": "frankie e vollano",
      "helpful_votes": 2,
      "publication_date": 20180321
    },
    {
      "title": "Got a good discount too",
      "text": "I had purchased a different chair, but it was too tall (I'm 5'0\"). I purchased this based on reviews. Got a good discount too. I especially love the USB port on the side of the chair and the fact that you push buttons to go back and forth rather than having a remote dangling.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Bloomer",
      "helpful_votes": 3,
      "publication_date": 20180227
    },
    {
      "title": "my wife loves this",
      "text": "and so do i - it is a bit slow, but who cares - not like i need to get up in 3 seconds. It is comfortable and looks easy to clean. got it on a sale day, arrived a few days later and the guy from fedex even rolled it inside for me. put it together in 10 minutes and i can hear the wife snoring already.",
      "rating": 5.0,
      "verified": true,
      "author": "drumbone",
      "helpful_votes": 4,
      "publication_date": 20180206
    },
    {
      "title": "These won't work for long",
      "text": "I can't give this chair a good review because every single one of these stopped working correctly shortly after purchasing them. I refunded and replaced two of them and the same thing happened. The chargers completely stopped working within a couple of weeks. I still own three, and that's only because after choosing to replace them, the time to refund was past. I should have returned them.",
      "rating": 1.0,
      "verified": true,
      "author": "Toni Tails",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Uncomfortable",
      "text": "05/18/'18 : The chair arrived today and it is very small and the back does not support your head. It leans back at an angle and is uncomfortable to sit in without raising the footrest. I am 5'8\" and my entire foot is completely off the footrest when reclined. I am trying to get use to it or I will have to return it. The good part of the chair is it is very soft and did not have any bad odor as some reviews stated.",
      "rating": 2.0,
      "verified": true,
      "author": "M. B.",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Poor quality",
      "text": "I bought this for my wife and she uses it everyday and doesn’t complain,but I use it and I don’t like it because when I recline it my feet hangs over the edge and I am only 5’ 8” but the real problem is the back of it when use recline it about 75% to 100% there’s a big gap between the seat and back and the cushion doesn’t have enough filling so a board digs into my back causing pain. I don’t know if it supposed to change like that or it’s defective. I would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Glen Davis _",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Good look and easy to assemble",
      "text": "Has four steps to put it together. Back and sides slide in to assemble. Looks good. USB works great for charging phone or tablet. Foot rest raises without moving back, or you can recline almost flat.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey & Victoria Schaefer",
      "helpful_votes": 3,
      "publication_date": 20180131
    },
    {
      "title": "Very comfortable",
      "text": "The chair is comfortable. The motor runs smoothly and quietly. The color is a light to medium beige. I'm not very tall and my feet hang off the end. I really like the USB port for recharging my phone and other devices. The chair is still fairly new to me. If there is a problem later I'll post an update. For now I'm happy with my purchase. The armrests are very soft and squishy as if they may need a little more stuffing.",
      "rating": 5.0,
      "verified": true,
      "author": "lala",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Best price & beautiful fabric!  Deliver right up to your door!  Easy assembly too!",
      "text": "Love this beautiful electric recliner! I use it everyday! I am not a senior! I am in my 40’s and this recliner is made for all ages. Don’t wait to be a senior to use this recliner! It’s awesome & the other reviewers were correct about the assembly...it took me about 20 minutes and it was easy too! Read the simple instructions! So easy. The pieces just click into place if you align them up correctly. The price on Amazon can’t be beat! I have it in my bedroom! I love this chair! Best price on the market for an electric chair! Buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Alohakalelee",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Beautiful, comfortable, good quality, and reasonable.",
      "text": "Ordered 2 chairs on 12/2/18, received through UPS on 12/10/18. It took about an hour to unpack both chairs, put in place, and put together. I am 6' 2\" and the chair is so comfortable. My wife could not use our original recliner. Too hard to use the lever. The electric is so easy to use. Wife loves it. There is a chemical odor which has decreased after one day and I expect to be gone after a week.",
      "rating": 5.0,
      "verified": true,
      "author": "regjane",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Very Comfortable & Great Support",
      "text": "Very comfortable. Love having footrest up without chair reclining. Keep pressing button and chair fully reclines. Great back support. Fantastic having USB charging port with control buttons.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180108
    },
    {
      "title": "not the best chair but for the price it's great",
      "text": "not the best chair but for the price it's great. only had it few days but working great got it because just had major back surgery helps alot",
      "rating": 4.0,
      "verified": true,
      "author": "sanbob69",
      "helpful_votes": 3,
      "publication_date": 20171227
    },
    {
      "title": "Better than a furniture store",
      "text": "Rarely do i write a review but this is great, so good i bought two. Been looking off n on for two years for replacements for my 25 year old Berclines. Worn out. Just wanted plain electric recliner no rocker. Hard to find around here and then thought of Amazon. Sceptical of furniture on line i ordered one, and when it came, ordered the other. Couldn't be happier and half the cost of a furniture store.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "I want my money back my chair broke",
      "text": "It is nice for the price if you need a power chair. It doesn't have much padding and the foot rest does not come up as much a higher end chairs. What I do like about it is it is short enough for my 5' short self. My feet touch the ground as I sit up straight update5/14/19 this chair is toast. the foot rest is broken on the left side. the padding is flat. the material has not held up at all. It looks like it is a hard 10 years old and not been kept up!",
      "rating": 1.0,
      "verified": true,
      "author": "judy",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Wrecked recliner",
      "text": "The assembly of the chair was confusing although only a few parts. I have owned it less than a year and it is already wore out. I am around 200lbs and am the primary user. The seat portion feels like the support is gone. The seat dips down on one side. The foot stool portion has also gone crooked.",
      "rating": 1.0,
      "verified": true,
      "author": "Blackdoghoxie",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "This chair is very comfortable. It assembled easily",
      "text": "This chair is very comfortable. It assembled easily, and the reclining motor is very quiet. I bought 2 of these, one for my husband and 1 for me. He is much heavier than I, and the cushions have squashed down some on his. The material resists stains. I have 2 cats, and one of them has a toenail that does not retract. He likes to sit on the arm of the chair and that toenail has caused multiple \"pulls\" in the material. For the money, this chair is a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "R. S. Seefeldt",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "We are ordering our second one, Great Chair!",
      "text": "We loved our first one so much that we are ordering our second chair! Our guests fight over who gets to use it! There is no bad smell to it as one reviewer had, I'm sure he did but we never had a smell to it at all nor it it flatten out and we have some hefty friends and are not lightweights ourselves! Very comfy, easy to put together, quiet and a good bargain compared to other chairs.",
      "rating": 5.0,
      "verified": true,
      "author": "DLNY",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "odor was awful",
      "text": "The smell was unbearable. It smelled like something had died inside of it. Had to send it back.",
      "rating": 1.0,
      "verified": true,
      "author": "GoldieLox",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "Is an okay chair for the price",
      "text": "Not too impressed. My wife is 5'7\" and plus sized. We thought it would be a good fit for her, but it is not. The armrests are really low. The seat is tight on her hips. She can't lean her head back comfortably and watch tv, but gets a nice view of the ceiling. And when the chair is reclined the end of the footrest hits her midcalf. It was easy to set up and the power part works. Might return it and get a chair that can be tried out first.",
      "rating": 3.0,
      "verified": true,
      "author": "AndrewZ",
      "helpful_votes": 2,
      "publication_date": 20180222
    },
    {
      "title": "Is this chair defected ??",
      "text": "It's a lovely chair, to look at...not very comfortable and it did not go together ...one arm does not go all the way down...there's quite a gap...and of course it sits with that side out. How does a 72 year old lady send it back ?? I will except it as is, but would not recomend buying this unless your 21 and strong !!",
      "rating": 2.0,
      "verified": true,
      "author": "Judy Larsen",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Like it",
      "text": "Just got the chair yesterday, so can't speak to its longevity. However, it was very easy to piece together upon arrival. I had it assembled before I was able to find the instructions, just takes about 5 minutes. It's comfortable in the upright position and can be reclined to any position from there. Footrest comes up before the back reclines, so you have options. I fell asleep accidently in it for several hours and woke without any back pains. Happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180607
    },
    {
      "title": "Easy setup no tools - bit light weight but for the price better than expected",
      "text": "Arrived quickly - easy easy setup - just slide it together no tools. It is very light weight though and moves around easy. Hey - price is right and for this price it's better than expected. I'm 5'10'' 200 lbs - works great for me.",
      "rating": 5.0,
      "verified": true,
      "author": "SkyBlue",
      "helpful_votes": 2,
      "publication_date": 20180210
    },
    {
      "title": "Five Stars",
      "text": "Perfect size color and price. Shipped fast went together in moments smooth operation port was a great idea.",
      "rating": 5.0,
      "verified": true,
      "author": "modelcarfans",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "Great buy!",
      "text": "The best value chair I’ve ever owned. I bought this for after my c section and it saved my life. So comfortable, so easy to put together and such a good value buy! I was highly impressed and everyone that I’ve shown it too loves it as well. Might buy one just to have outside of the nursery. I’m honestly confused by some of the reviews I read that really trashed this chair because I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gian",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Excellent value",
      "text": "We bought one. Liked it so much, we bought a second, for our lanai. So comfortable!! I spent 8 days in hospital following major abdominal surgery, and slept in this chair for the first ten days until I could get comfortable in my bed. Compared to other recliners we have owned: BY FAR THE BEST BANG FOR THE BUCK!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "dick",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Half of a chair",
      "text": "No stars came with no back only half a chair. Not very happy",
      "rating": 1.0,
      "verified": true,
      "author": "Venus",
      "helpful_votes": 4,
      "publication_date": 20180421
    },
    {
      "title": "sits comfortably,",
      "text": "the chair sits really comfortably, but unfortunately the lift mechanism broke the same day. no returns, my Daughter had picked out an as is offer chair, it was all she could afford.",
      "rating": 1.0,
      "verified": true,
      "author": "Shirley D Jones",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Perfect for a woman..",
      "text": "Nice chair... this is a great chair for a woman.. a man might find it too small. Doesn't rock just reclines.I'm 5' 8\" and feel that the recline could a little longer for my legs.. Anyone taller than me would most likely find this too short for them.The USB port is amazing <3 The is my favorite thing about this chair!",
      "rating": 4.0,
      "verified": true,
      "author": "J.Lock",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Tough to assemble, otherwise great.",
      "text": "Sliding the back into place is fine, but the back itself has sides that clip on and it's a small pain to get the pieces to slide into each other as the sides are puffy and you have to get it just right or it won't go. Once that is done though, it's a lovely piece of furniture.",
      "rating": 4.0,
      "verified": true,
      "author": "George Hess",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "So big And comfy!!!! Doesn’t smell!",
      "text": "This recliner is so awesome! It’s roomy and comfortable and everyone loves it!!!!! It also moves slowly which is good for my elderly mom because it doesn’t scare her! A breeze to put together! No man envolved!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Momzilla11Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Great for the price.",
      "text": "Bought this for my husband. He loves it. There is a small piece between the arm rest and the back that is rather hard with no cushion. I'm assuming this gap is to allow the chair's movement without getting fabric caught up. It's not a big deal, but he likes to lean on one side and it bothers him if his arm slips off the cushion into this area.",
      "rating": 4.0,
      "verified": true,
      "author": "arsallotTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "The Best for Less",
      "text": "This chair is everything I wanted and more. Good fabric and easily assembled. The controls are simple easily reached and works smoothly. The jack for phone charging is just icing on the cake.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacklyn Rowe",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Comfortable and easy.",
      "text": "Very comfortable. The button to recline is very easy to reach. It's not like a regular recliner where you can just push the foot rest down and your done. You do have to wait for the footrest to lower before you get up.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Recliner",
      "text": "I love my chair! Very comfortable, I can curl up and read and I have even taken a nap in it. My den is kind of small and it fits perfect and color is perfect too. Had to put it to gather, had to put back on and very easy to do. I have hardwood floors and it slips some when I sit down. Looking for a small rug to go under it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley W.",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Power Recliner",
      "text": "Very nice power recliner for price. We bought two and they are a match.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Hitch",
      "helpful_votes": 4,
      "publication_date": 20180126
    },
    {
      "title": "Great Chairs",
      "text": "These chairs are great. We purchased these as a replacement in our 5th wheel and they were perfect. Soft, comfortable and just the right size. They are almost to comfortable, we have started taking naps in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Hemenway",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "I need a new plug that attaches to the chair this one stopped working now I cant recline",
      "text": "I love this chair it has my phone charging now. I love Amazon delivers right to your door I'm 71 and Hubby has dealt with Cancer for 10 years but I was able to set up an I love it so much gonna save and get me one. No more straining on my my back with 4 ruptured disk just push a button love love it. Buy u.one u won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "L. benton",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "It was packed beautifully very simple to put together like 5 minutes if ...",
      "text": "It was packed beautifully very simple to put together like 5 minutes if that very comfortable I just received it but I love it and I'm a big guy as well 5'11 240 lbs in sitting position you cannot rest your head back like you could in a car but once your reclining say goodnight . I purchased 2 of them glad I turn my 3rd bedroom into a tv room for the grandkids when they visit and well a space for me as well",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette Sajous",
      "helpful_votes": 2,
      "publication_date": 20171223
    },
    {
      "title": "Great durability and true to color",
      "text": "I bought it two years ago and it's still looks and works as new. I would say though if you're taller than 5'8, it might be too small and also if you're a bigger person. I use it everyday. The ratio price to quality is great. I wasn't expecting it would last this long for the price you pay. I got it in taupe and is true to color. It was VERY easy to assemble. I'm a woman, not used to assemble furniture myself, and it took me about 5 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Perfect for 5'10\" man",
      "text": "Bought for Hubby who is 5'20\", weight 230 lbs. Put it together without any problems. Footrest extends to correct area. Neck area is also at the correct area...hubby has neck pain and most recliners pushes his neck forward. Dogs love it... wish it came in dog proof material.",
      "rating": 5.0,
      "verified": true,
      "author": "nvwikiwiki",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Great for the 1st  6  mouths than then  :(",
      "text": "2nd review After eight months stopped working electric recline the chair no longer comfortable after only using periodically heaviest weight was 175 pounds very disappointed did not buy extended Warrantee Big mistake !",
      "rating": 1.0,
      "verified": true,
      "author": "CTR",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Works good so far",
      "text": "I have only had this a few months and so far it works well for me. No more buttons or levers that wear out so you have to throw it out. I like to recline after a hard days work and I surely don't want to struggle trying to get the right position. I will update this if anything goes wrong with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Suderbooter",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Good value, but not lasting comfort",
      "text": "Good value for those on budget. Usb charger and power recline useful. Seriously needs more padding in arms and seat as the insufficient volume compresses after months of use and eventually your elbows are hitting wood under fabric.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher Jones",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Extremely pleased!",
      "text": "I have been anxious about ordering a chair from Amazon. When it arrived my 90 year old husband and and I(age 88) put it together Without a problem. It is a great chair, well padded and study. I was told the chair would arrive on Friday. Today Tuesday at 8:15 AM It arrived which I found amazing at holiday time. Kudos to all-Amazon, the maker of the chair, and the delivery service! Could not be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia C. Montcrieff",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Not the best but not the worst",
      "text": "Not the best but not the worst. Angle is wrong while reclining. Sitching is starting to come apart. You get what you pay for in this recliner",
      "rating": 3.0,
      "verified": true,
      "author": "David Gunsaullus",
      "helpful_votes": 2,
      "publication_date": 20180406
    },
    {
      "title": "Amazing recliner for an awesome price",
      "text": "Amazing recliner for an awesome price!! It’s a win win!!! Bought this for an upcoming surgery and this exceeded my expectations. Great quality. You definitely won’t be disappointed!!! Love mine!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "Five Stars",
      "text": "Very well made good looking chair for the price. Happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180124
    },
    {
      "title": "Assembly was easy. Love the material",
      "text": "Arrived early. Assembly was easy. Love the material. A very comfortable recliner. The push buttons on the top side of the chair are much more convenient than searching for a remote. The only problem with the chair is it feels “tippy” when my dad leans to the side to answer the phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Sylvia",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Great quality and comfy",
      "text": "Great quality, very comfortable. Nice fabric, versatile color. Love the power recline and how it reclines out and forward versus back which allows the recliner to sit up against wall in tight spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Lacy",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "As described. Had trouble connecting the back as the ...",
      "text": "As described. Had trouble connecting the back as the metal connector on the chair was bent.",
      "rating": 3.0,
      "verified": true,
      "author": "chloegirl",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Great chair.",
      "text": "Very nice comfy chair. Can sleep in without any aches or pains. Easy power positioning and convenient USB device power/charging. Soft plush. Abundant padding",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel R. Cassidy",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Where is the power cord plug?",
      "text": "Can’t find the power cord plug. Am unable to pull it out from under the backing. Would appreciate a prompt answer",
      "rating": 1.0,
      "verified": true,
      "author": "Helen G.",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Unpleasant odor",
      "text": "Item arrived quickly and color was a pretty taupe. However the cushions were very soft with no support. Plus there was a strange odor which clung to clothes if you sat in the chair. Couldn't wait to get it out of the house.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy A.",
      "helpful_votes": 2,
      "publication_date": 20181015
    },
    {
      "title": "THE RECLINER IS NOT COMFORTABLE.",
      "text": "The foot rest does not raise to a complete vertical level, leaving the legs to dangle downward. In full recline, there is no padding on either the arm where the elbows rest making it uncomfortable. The head rest pushes forward,causing pressure n the neck. The chair is a disappointment",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "You must know before you buy!",
      "text": "I like the easy to the way it raises. They chair has problems with declining in that it catches and pops loose. The chair also tips to the right meaning that sitting makes you tip to the right. I will put a 3/4\" board under the right side to raise that side of chair.",
      "rating": 2.0,
      "verified": true,
      "author": "John J Williams",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Recliner Chair",
      "text": "Very comfortable. My neighbor had to put it together for me. It was a little more work than we thought it would be. Love the color. I have acid reflux and it feels wonderful sitting in it. I have already fallen asleep in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Elmo san diego",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Power Recliner Motor Failed After 4 Months",
      "text": "This is a very comfortable recliner. After using it a few times a day for 4 months, the linear actuator motor wont actuate because a (very cheap grade of) nylon gear inside failed and was chewed up by the METAL worm gear.",
      "rating": 2.0,
      "verified": true,
      "author": "Gus Viera",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Awesome!! Love the recliner very cozy",
      "text": "Awesome! ! Love the recliner very cozy! I give this chair a five star review. Fast delivery I highly recommend it. Love my purchase *****",
      "rating": 5.0,
      "verified": true,
      "author": "Sol",
      "helpful_votes": 3,
      "publication_date": 20171224
    },
    {
      "title": "works great, could be a tad bit bigger",
      "text": "Just as ordered, works great, could be a tad bit bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "Hazel Barhorst",
      "helpful_votes": 2,
      "publication_date": 20171219
    },
    {
      "title": "Great power recliner!",
      "text": "Fast, safe shipping, item as described. Not a huge chair, fits this senior lady just fine. Love the power feature. Nice and comfortable. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri P",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Great chair",
      "text": "This item is better than most of the chairs that i saw in the name brand stores at an affordable price",
      "rating": 5.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Just perfect!",
      "text": "Got this for my mother in law. Her knees can't take the jolt of traditional recliner foot rests popping out and aren't strong enough to push them back in. This is perfect for her. It came incredibly fast (THANKS!) and looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "KMA",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "comfortable",
      "text": "the chair has served it's purpose. We moved and the cord is damaged how do I order parts?",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lou Morris",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Reclines great and good product",
      "text": "Great products. The arm rest are short. When reclined your elbows does not rest on arm rest.",
      "rating": 4.0,
      "verified": true,
      "author": "Emil E. Turk",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Needs assembly.",
      "text": "Very awkward to put together. Once put together, it works fine. Would be an improvement if it came assembled.",
      "rating": 3.0,
      "verified": true,
      "author": "Joan L. Harp",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Not worth the money",
      "text": "Very flimsy material very fragile wood frame on the arms Chair came with left arm support broken instead of re packaging the chair I desired to fix it myself I would not recommend this product to anyone",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. Paul A. Allegra",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Very Small!",
      "text": "Very small recliner. I'm 5'8\" and my legs hang off end. Does not hold up at all. The material is sagging off . I do not recommend!",
      "rating": 1.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Dont purchase furniture online",
      "text": "I learned if it's to good to be true, it's not good, $217.00 with free shipping WOW! What a deal. Not! Was garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Chester",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "It is comfortable, stable",
      "text": "Just had back surgery and my son got this chair.... It is comfortable, stable, for those who needs stability, sturdy electronic button easy movements fantastic chair.... Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Ferrer",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Space saving",
      "text": "Bought 2 of these chairs, they are narrow, but I knew that. Comfortable to sit in and recline, but not as comfortable as a real lazyboy. Good chair for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "truthseeker",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "This chair has a very nice lumbar support",
      "text": "This chair is the most conf chair I've ever had, in all of my 63 years. My spine is a mess from my neck down, I've got post-laminectomy syndrome from that failed surgery, and rsdiculopathy, cervical spinal stenosis, as well as lumbar stenosis. This chair has a very nice lumbar support, not too soft, not too hard. Choosing this one is the best decision I've ever made.",
      "rating": 5.0,
      "verified": true,
      "author": "Tana",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Five Stars",
      "text": "Very comfortable, ease of assembly and the power function works great",
      "rating": 5.0,
      "verified": true,
      "author": "Mark S",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Support bar digs into back",
      "text": "Initially, we liked the the look and feel of the chair, however, when it was put together and my husband sat in it and reclined the support bar was digging into his back. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin A",
      "helpful_votes": 9,
      "publication_date": 20180210
    },
    {
      "title": "will look bad in a few years im sure but oh well ...",
      "text": "Me and my wife use this chair, will look bad in a few years im sure but oh well its the lazy persons chair. A Favorite at our homw",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Very nice color.",
      "text": "I love this chair ,so comfortable and looks so nice ,for me the automatic feature works great ,and such a great price .Thank you .",
      "rating": 4.0,
      "verified": true,
      "author": "Rosie",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "The fabric has worn away quickly.",
      "text": "Still use it, the leg lifts and chair work and still is properly made and together.",
      "rating": 2.0,
      "verified": true,
      "author": "Dahmen P.",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Great chair at a great price",
      "text": "This truly was a great buy. I like everything about it, including the excellent price. I feared the quality might not be there, but I simply have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Don't buy",
      "text": "Chair has already broken down after two months of use and is typically only used for two hours a day.",
      "rating": 1.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Very comfortable",
      "text": "Very comfortable. Love the color. My husband put it together in no time. Easy to follow directions. We are very pleased with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lietje",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Love this chair",
      "text": "Love this chair , didn't go wrong buying it !! If something happens to it I will be replacing with the same brand !!",
      "rating": 5.0,
      "verified": true,
      "author": "barbara l baines",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Great deal",
      "text": "Bought this for my mom and she loves it. It is easy to assemble and it is a great price",
      "rating": 5.0,
      "verified": true,
      "author": "Danie C",
      "helpful_votes": 0,
      "publication_date": 20181113
    }
  ],
  "product_meta": {
    "title": "Lifestyle Power Recliner Fabric, Taupe",
    "description": "Color:TaupeThe Cloud fabric power recliner brings fresh design to its comfort story. Generous padding and individually wrapped coil seating are tailored in a clean treatment of soft and durable fabric. Expert seaming creates smooth lines, offering a clean yet still casual appeal. The Cloud recliner also features power recline with a full chaise for complete leg support, as well as a USB charging port integrated into the switch.",
    "rating": 4,
    "feature_bullets": [
      "Power Recliner",
      "Heavy duty and plush fabric",
      "USB Plug on Activation Switch",
      "Wallsaver mechanism",
      "Layflat Premium Mechanism"
    ],
    "specifications": {
      "Item Weight": "77 pounds",
      "Product Dimensions": "39 x 40.5 x 40 inches",
      "Item model number": "U1294Z",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B074F3KRCR",
      "Customer Reviews": "4.0 out of 5 stars297 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#757,352 in Home & Kitchen",
      "Date First Available": "July 31, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Living Room Furniture",
      "Furniture",
      "Chairs"
    ],
    "price": ""
  }
}