{
  "website_summaries": [
    {
      "verdict": "The Zvox SB380 offers one-box convenience and excels at making dialog clearer, but some cheaper 'bars sound better.",
      "pros": [
        "The Zvox SB380 offers excellent build quality and a relatively easy setup process",
        "Dialog sounds clearer than most competitors with or without its AccuVoice feature"
      ],
      "cons": [
        "No Bluetooth",
        "Competing sound bars are more dynamic and cost less money"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 6.0,
        "Sound": 7.0,
        "Value": 7.0
      },
      "publication_date": 20170925,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this sound bar",
      "text": "I love this sound bar. My husband is very hard of hearing even with hearing aids. He was constantly asking me \"what did they say?\" (on the tv). Since receiving the sound bar he hasn't asked once. The quality of the sound is great. You don't have to be hard of hearing to buy this product - the sound is great - I don't find the little speakers that come with tv to be enough.",
      "rating": 5.0,
      "verified": true,
      "author": "KATHEEN GARCIA",
      "helpful_votes": 37,
      "publication_date": 20171229
    },
    {
      "title": "no comparison",
      "text": "Great sound, particularly for those a little hard of hearing. Really easy to set up. This is our second ZVox product. We were so happy with the first we didn't look at any others when we decided to buy one for a different tv. Also, customer service, if you ever need them are the BEST!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Cahill",
      "helpful_votes": 39,
      "publication_date": 20170818
    },
    {
      "title": "What a waste of money!!",
      "text": "This is an updated review from the end of 2017 when I first used the product. It stopped working four months after installation. Phone support helped get it going again. In August 2018 it stopped working again. After much time with phone support , I could not get it working again. It seems there is a problem with the optical output. New cable didn't work. Analog cable worked somewhat, but I don't have analog inputs on my smart TV. It costs money to have it shipped and repaired which may or may not work. So I'm ditching it. Should have known that a sixty day return policy wouldn't work well. Live and learn!!",
      "rating": 2.0,
      "verified": true,
      "author": "F. Poder",
      "helpful_votes": 23,
      "publication_date": 20171017
    },
    {
      "title": "Can't hear dialog on TV ? Buy  this !",
      "text": "The product works, does exactly what it said it would do. I hear about 90% of what I was missing. I could turn the voice up to 6 but it starts to sound artificial. Sound quality is very good, it's not a 2.1 or 5.1 surround sound but it's better then the TV speakers. Depending on how you configure it, you can (un)compress the music to match whatever your watching. If you are constantly asking \"what did they say ?\" this is your product !",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 3,
      "publication_date": 20200624
    },
    {
      "title": "Does really improve ability to understand dialog, but Base is weak for Music programs.",
      "text": "Find that with lowest setting on Accuvoice, and all other settings for max sound quality, the sound quality for music is a little tinny and the base/low frequency is a little weak. The 6 settings for the Accuvoice, though do help improve the ability to understand dialog when the TV producers seem to need excessive so called background music to go along with the dialog. The ability to change easily from 1 (lowest) through to 6 (highest) to enhance dialog without changing any of the other settings is a real advantage. Will need more experience using it to better evaluate.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Summers",
      "helpful_votes": 4,
      "publication_date": 20200612
    },
    {
      "title": "So far, So good",
      "text": "Bought two of these on sale for $160 each. Gave one to my parents. We all think they work great! We've turned off the TV speakers completely and the sound through these is really crystal clear. My folks had an older/smaller ZVOX, that this replaced and the difference in clarity is quite noticeable. The only drawback in my opinion, is it's quite lacking in BASS...but I didn't buy them to be a rumbling stereo system. For voices, they are GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "DWR",
      "helpful_votes": 2,
      "publication_date": 20200724
    },
    {
      "title": "Does what we needed it to do",
      "text": "The only reason I dropped one star is it won't connect to ARC HDMI & if you connect to digital port, you have to train the remote. Otherwise, it does everything it says it does as far as leveling the sound and bringing voice forward. We had gotten so tired of watching a movie & having to increase volume to hear dialogue & then turn it down because the sound track is so loud.",
      "rating": 4.0,
      "verified": true,
      "author": "WAB",
      "helpful_votes": 4,
      "publication_date": 20200620
    },
    {
      "title": "Built in subwoofer and no Bluetooth",
      "text": "I had two criteria, a built in subwoofer and no Bluetooth and the Xbox SB 380 fit both. My previous sound bar was connected with an optical audio cable. We live in an apartment building and the soundbar somehow connected to Bluetooth signal. After that it would automatically switch to the Bluetooth signal and never stay on the cable input. The Zvox was easy to hook up, the sound is good and I can use my TV remote for volume control. Also, I don't have to find a place for a separate subwoofer box. So far I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam the Villager",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great surround sound in a compact package",
      "text": "We added an SB380 to a HD tv with typically weak built in speakers. This TV is in a medium sized bedroom, so a surround sound system with large separate speakers wouldn't fit well. The SB380 provides quality sound comparable to a separate surround sound system, with bright highs and solid bass. The built in surround sound gives a dimensional listening experience in any room, while taking up comparatively little space. This is my fourth ZVOX product over the years and I have never been disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "David Burns",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "I am fully satisfied with this product",
      "text": "I am fully satisfied with this product. I can hear the dialogue so much better and clearer. It was easy to install but I did have to call the service line for help. The rep was very helpful and within a few minutes I had it up and working. Excellent product",
      "rating": 5.0,
      "verified": true,
      "author": "whayne m. hougland",
      "helpful_votes": 5,
      "publication_date": 20171003
    },
    {
      "title": "Great Sound Bar, but some setup problems.",
      "text": "Overall, the sound bar works fine. The only problem is training to the desired remote. After training it to the TV, things seemed fine. Then the Mute signal started showing up on the TV. I again went thru the setup procedure for the remote and it worked (for a short time) then back to before. The sound bar really works fine except for this glitch. I have not contacted ZVOX about this, but will do so soon. The sound bar itself is a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "RRob",
      "helpful_votes": 3,
      "publication_date": 20180519
    },
    {
      "title": "We are very pleased with the ZVOXSB380 Sound Bar",
      "text": "We are very pleased with the ZVOXSB380 Sound Bar. We previously bought a different model that had been returned and after a few days it developed a background buzzing sound from one of the speakers. We returned it and received a credit promptly. We can hear everything clearly and I would recommend the ZVOXSB380 and give it 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 8,
      "publication_date": 20180101
    },
    {
      "title": "Nice soundbar and superb customer support.",
      "text": "Very solid sound bar. Was upgrading from an older LG. Plugged the optical from TV to new soundbar but no audio. Called ZVOX customer support and was immediately connected to a rep who walked me some troubleshooting. Turned out problem was in the Samsung TV output. It had 4 different options of optical output. Really pleased that company provided this support.",
      "rating": 5.0,
      "verified": true,
      "author": "William R. Petrie Jr.",
      "helpful_votes": 3,
      "publication_date": 20200603
    },
    {
      "title": "Clarity of dialogue with tradeoffs",
      "text": "Nice build quality Easy setup Solves the dialogue issue But there are trade offs: Dialogue is clear. However, when you adjust it for \"AccuVoice\", the fullness of sound is somewhat defeated. If clarity of dialogue is your total concern, this will deliver. But the sound itself is just OK. My wife was not impressed. So back it goes.",
      "rating": 3.0,
      "verified": true,
      "author": "Bobobon",
      "helpful_votes": 3,
      "publication_date": 20190104
    },
    {
      "title": "Easy to install. Sounds great.",
      "text": "My TV has speakers on the bottom. They point straight down. All sound is therefor muffled, can't make out voices. The SB380 is attached to the front of the platform my tv is sitting on, so the sound comes straight at me.The setup was easy. It hangs on two screws connected to the SB380. Just follow the instructions in a one-step-at-time fashion. I recommend that the volume number for the tv be synchronized with the volume number of the SB380, once the tv remote is made to control the SB380 as per instructions. This makes things easier and makes sense. Music sounds very listenable now, and voices can be easily understood.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeri",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Superb sound quality in an attractive, easy-to-install package.",
      "text": "My wife and I have had difficulty with understanding speech from recorded videos, so I looked at various options . . . new speakers, upgrading the amplifier (a Denon), etc. My searches narrowed to a soundbar and there are a lot of options available. I'm certainly pleased that I found this ZVOX soundbar. It does an excellent job of providing the high frequencies important to recorded speech. It has two options for connecting the sound bar to the TV or amplifier; connecting it was a snap. The only less optimum feature is the remote, which has to be pointed very precisely.",
      "rating": 5.0,
      "verified": true,
      "author": "Coolmaker",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Take the chance if you can afford.",
      "text": "Was skeptical, but it does improve the voice clarity. I lost some hearing in the military, but never wanted to wear an aid. This has helped a great deal. There are three settings for standard play. The first is if you want to hear voices clearer, the second is \" normal\" , The third gives you full sound with bass. Then if the need arises you can press accuvoice on the remote and it brings out the spoken word more. I has a very full sound in a average to larger room. I would highly recommend. Yes it costs more. and I debated, but was well worth it for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Davekeywester",
      "helpful_votes": 3,
      "publication_date": 20180801
    },
    {
      "title": "Clear Hearing",
      "text": "Great, a little hard at hearing especially the upper cycles - this is great without my hearing aids, very easy set up less than 45 minutes total - smart TV so go to your TV to add ZVOX, then to cable remote - insert code and you are off to hearing great sound Very happy I purchased - sound bar from major company and it offered no help even sometimes made sound worse. Now I can view my History and Discovery channels understanding what they are saying with background sound back were it belongs in the background Great Buy",
      "rating": 5.0,
      "verified": true,
      "author": "t-travler",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Disappointed..",
      "text": "This just didn't work for me...the sound was \"tinny\" no matter how I adjusted the bass/treble, the remote did not work that well and just too many adjustments to deal with. I gave it a fair trial, but after two weeks it was time to send it back as I just got too frustrated with this sound bar. It had some good reviews , but just did not fit my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Captain",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Great sound bar",
      "text": "With so many choices these days for sound bars it was a difficult decision which bar to purchase. I really needed something that will provide good voice quality as my TV speakers just aren’t of any voice quality. Size wise had some restrictions given my built in cabinet where the TV is positioned. This ZVOX SB 380 is simply perfect for what I needed. You have 4 sound settings and I choose to use the one recommenced for voice quality. I can now hear everything perfectly with minimum volume setting. This is a well built sound bar and performs better than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Moto Moto",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "This is a great sound bar",
      "text": "I have trouble hearing dialogue and i can use the sound bar to just raise the voices without raising the overall program volume. If you are looking for a great sound bar i recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin B de Lacy",
      "helpful_votes": 2,
      "publication_date": 20200723
    },
    {
      "title": "Broke!",
      "text": "It worked great at first. But now it doesn't work at all. No sound and the controls on the remote and on the unit do nothing. I can't even turn it off. I have to unplug it. When I plug it back in, the front illuminates \"On\", but no sound and no controls work. Of course, in able to return it for repairs, it must be in the original box which I don't have. I wasted $300.00 on this thing!!!",
      "rating": 1.0,
      "verified": true,
      "author": "G. Wheatley",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "We've tried multiple sound bars in the past that claimed to make the the dialog better and ended up returning all of them because they ...",
      "text": "This is exactly what I was looking for!! My wife has a difficult time hearing the dialog during movies or TV shows and the ZVOX makes everything crystal clear. We've tried multiple sound bars in the past that claimed to make the the dialog better and ended up returning all of them because they didn't work as advertised. The ZVOX definitely meetst our needs and I can't recommend it enough. Great sound bar!",
      "rating": 5.0,
      "verified": true,
      "author": "John P",
      "helpful_votes": 2,
      "publication_date": 20171231
    },
    {
      "title": "Great Audio",
      "text": "I purchased this sound bar after hearing a commercial on TV I think. Husband is hard of hearing (very). The advertisement said that this sound bar accentuated voices, and de-accentuated background sounds and noises. We say it does what it says it does. No \"What did he say?\" requests, no blank looks when I laugh or scoff because he actually heard the words. This will be a great boon to us going forward, thank you, thank you. I suppose most people could install this themselves. I hired a person to do it for me. He used the optic cable not the annalog cable and said that would also make a difference. We are very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Grethel",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Great sound",
      "text": "However, there were problems with the sound quitting. Called the company and they (we) resolved right away. They also led me step by step on how to control volume with my Verizon remote... Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A Dineen",
      "helpful_votes": 2,
      "publication_date": 20200522
    },
    {
      "title": "What a find",
      "text": "This sound bar is remarkable. I no longer need closed captioning for many of the shows. The voice adjustment is great. Minimum for music, up a level or two for most tv shows, and maximum for British shows. Dialog is clear and concise. Also the customer support is A+. Had a problem with the unit cutting in and out. Made a phone call and within three minutes I was connected to a REAL person. He walked we through the problem and found it was a setting that needed to be changed. I highly recommend this sound bar.",
      "rating": 5.0,
      "verified": true,
      "author": "jerry forster",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "hard of hearing this is it!!",
      "text": "I am a 73 year old man and a little hard of hearing. I bought a bose 5 about a year ago because of the voice button. however I found no decrenable difference between the regular setting and the voice control and didn't put out the needed volume. I just ordered a ZVOX SB380 which was designed with the hard of hearing in mind, and there is a world of difference between the two. the voice control is very effective and it is much louder then the bose 5.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W. Stowers",
      "helpful_votes": 2,
      "publication_date": 20181229
    },
    {
      "title": "Able to hear the dialogue all the time now.",
      "text": "This was a family Christmas gift for our dad. He absolutely loves it! . He says, he can hear tv/movies best in years! This is top quality. My husband and I are thinking about getting one, as well as, some other family/friends.",
      "rating": 5.0,
      "verified": true,
      "author": "amber hooten",
      "helpful_votes": 4,
      "publication_date": 20171224
    },
    {
      "title": "So far I am very pleased with this sound bar",
      "text": "So far I am very pleased with this sound bar, it is my first, so I have nothing to compare it to, except my surround sound system has a self powers woofer and doesn't pick up what this one does, my second 5 star would go to support, they answered promptly, never waited for over a couple of minutes or answered when I called, I gave them the info on the equipment I had and they told me how I could hook it up for best results. Don",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 2,
      "publication_date": 20180109
    },
    {
      "title": "Great sound for a great price.",
      "text": "My wife and I love this soundbar. It has every feature we wanted: volume controlled going from program to commercial, a setting for vocal accuracy that really works, 3 settings for surround sound, and a subwoofer that doesn't overpower the room. I bought this to replace a Bose Solo which was OK but the vocal sound quality with the ZVOX is much, much better. All I can say is my wife walked into the room for the first time and said \"WOW!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Scurfie",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Good sound and excellent Zvox support",
      "text": "Myself and my lady immediately notice how good the sound was. I have a full surround system but when watching broadcast television I didn't want to turn my AVR on, hence purchasing the Zvox SB380. The reason for not 5 stars is a few days before the 30 day trial the unit kept turning off. Now Tech support from Zvox was quick to respond and offered tips to get it from turning off, I thought we had it but within an hour it started to shut off. Amazon has sent me a replacement, I hope the replacement works longer than 1 month.",
      "rating": 3.0,
      "verified": true,
      "author": "Just a Guy",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Thanks ZYVOX for a great product!",
      "text": "I purchased this for my mom, who has hearing loss. Installation was very easy, even though I’m not technically inclined. Only one cable was required for connection to her tv. Really unbelievable how much this sound bar is able to clear up the voices on the tv. She has turned the tv volume down, but hears much more of the dialogue. Would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya G.",
      "helpful_votes": 2,
      "publication_date": 20180117
    },
    {
      "title": "It works for me",
      "text": "I have borderline hearing. I'm fine in a quiet place, but loud background noise makes it impossible for me to understand what is being said. Mumbling actors on TV are the same. If I can, I turn on the subtitles. This soundbar allows me to hear almost everything without looking at the subtitles. It also allows me to turn down the volume so that others in the room are not overwhelmed by the sound.",
      "rating": 5.0,
      "verified": true,
      "author": "retired1",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Excellent Sound Bar",
      "text": "This might not be the choice for an audiophile, but if you want to hear dialogue it's the sound bar to get. It does what ZVOX says: it clarifies sound and allows you to hear the dialogue without loss of the accompanying background sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron M",
      "helpful_votes": 2,
      "publication_date": 20200308
    },
    {
      "title": "Crystal Clear voices at half the volume in all modes. Awesome sound bar",
      "text": "I've been using the Soundbar for a week now and I admit I was hesitant to spend this much on a bar without Bluetooth. It came with all the cables necessary the customer service was very very good on programming it to work with my Dish Network remote. The sound and clearness of speech even in surround sound modes is perfect and very satisfying without even using the special settings. The output leveling for commercials is excellent. For me, this is truly a five-star purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "John L.",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Clears up speech",
      "text": "Really helps out with hearing speech. Now I can watch English programs without subtitles.",
      "rating": 5.0,
      "verified": true,
      "author": "victor j chriest",
      "helpful_votes": 2,
      "publication_date": 20200629
    },
    {
      "title": "Excellent Clarity",
      "text": "Love the Accuvoice as my wife can hear clearly without her hearing aid. It seems to attenuate the Bass without making it sound tiny. For a simple, well designed sound bar without a Woofer. this is excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart Perry",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great Sound, Control could use some more work",
      "text": "Great sound, much better than my previous sound bar. It does not connect with your remote control like other sound bars do, so it doesn't turn off and on with your TV remote. Volume is also not controlled with the TV remote.",
      "rating": 4.0,
      "verified": true,
      "author": "KGJ",
      "helpful_votes": 2,
      "publication_date": 20200616
    },
    {
      "title": "Finally - - - clear dialogue",
      "text": "I guess I’m starting to loose various tones in my hearing as I was having a lot of trouble following plot lines due to missing dialogue in tv shows and movies that I was watching. I read about the ZVOX sound bar and decided it was time to try it. Wow, does it work!! The sound bar has not only enhanced my ability to hear the dialogue but it improves every facet of sound emanating from my TV.",
      "rating": 5.0,
      "verified": true,
      "author": "m105",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Very happy with my purchase.",
      "text": "If you’re having trouble hearing people talk on your TV then this is the sound bar for you. I used to wear bluetooth headphones so I could hear my tv then did some research on a speech improving sound bar. After much research I came across this and purchased it. From the moment I installed it I could hear voices crisper and clearer plus the overall sound is outstanding. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Works",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Works as advertised. Much clearer audio!",
      "text": "Does a TERRIFIC job of producing crisp, clear audio as advertised. The best test was listening to the TV series \"Shetland\". The characters accents are very strong, and with my hearing, the voices were too muffled to enjoy the detective show, so I gave up on it. Now with the SB380, I can watch \"Shetland\" again, and I am able to distinguish \"most\" of the dialogue. All TV shows have clearer audio now, making them more enjoyable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Fuzzy Sound on My Favorite Channels",
      "text": "I bought this product to help me hear voices on TV better. While it works on some stations, it gives fuzzy sound on the channels I watch most frequently. If you've ever used a CB radio, and the signal from the person you're speaking with breaks up, it's like that. Not a total waste because some channels sound OK, but not the great speaker I thought it would be.",
      "rating": 3.0,
      "verified": true,
      "author": "TDBishop",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Poor return policy.",
      "text": "After 56 days it stopped working, Free returns for 30 days from purchase. It will cost me $30 for a return box plus $90 for returns. In the trash it will go.",
      "rating": 2.0,
      "verified": true,
      "author": "Rdon",
      "helpful_votes": 4,
      "publication_date": 20200319
    },
    {
      "title": "died",
      "text": "Does what it says. Died just after return period ended",
      "rating": 1.0,
      "verified": true,
      "author": "Landis Rogers",
      "helpful_votes": 4,
      "publication_date": 20200222
    },
    {
      "title": "We Can HEAR!",
      "text": "Honestly, for years, my husband and I have been using head phones when we put on a DVD. As we have become older and hearing less, there were so many movies that we watched and missed half of the dialogue, particularly British movies or PBS shows. In desperation, we just purchased this ZVOX sound bar. Wow, we actually heard all the dialogue last night of the animated movie \"Ferdinand.\" We are amazed at the clear sound, and recommend it highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Gbirch",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Finally...",
      "text": "You can hear dialogue and have equalization between channels! I use to have to use subtitles on Netflix. I have had 2 other Sound Bars that did nothing, Sony and Samsung with Subs, junk!",
      "rating": 5.0,
      "verified": true,
      "author": "bacobits",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Not so great!",
      "text": "As stated it was easy to set up and easy to get the remote to work with my Comcast remote. Although I did have one question for their customer service that for whatever reason was never answered properly. Saying that, Once set up I never noticed any big difference between the sound of their unit and the sound from my Sony Bravia. It also doe not automatically adjust to the different sound levels of ads or other stations. After, using it for over a month, I doubt if I would have purchased it, knowing what I know now.",
      "rating": 3.0,
      "verified": true,
      "author": "D. W. - Houston",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Great sound bar - big improvement to our TV viewing",
      "text": "This sound bar has made such a difference in our television watching. We've complained for a long time about how the background music on a lot of tv shows is so loud that it makes it difficult to hear the actor's voices. Well, since we've had this unit, we have had absolutely no issue with that. We can hear the actors very well, even the British ones that have been even harder for us to understand. I would definitely recommend this product to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Penni KnappTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Heading Every Word",
      "text": "I have been using the Zvox 380 sound bar for two.seems and it is working very well. I can understand all spoken words in movies now without asking my wife what was said. I would recommend the sound bar to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister B.",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Five Stars",
      "text": "love it, really clarifies soulnd, good sound quality, definitly need to use the optical cable, without it the sound is slighly delayed and the qaulity is not as good",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Brookshire",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "Very very pleased",
      "text": "I wear hearing aids and have sever tinitus. Previously to hear and understand my Samsung tv I had to crank the volume way up even wearing my hearing aids. The worst show is a”The Man in the High Castle”. Could never understand a word due to pour sound voice recording. I can hear everything now and at a reasonable volume. High Castle is not as clear as everything else but at least I can understand the voice now. Thank you for a great sound bar!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Great Sound",
      "text": "I am really happy with this sound bar. I have profound hearing lose. I can understand most dialogue without closed captions on now. The AccuVoice feature levels the sound and minimizes back ground noise. The sound is the best of several sound bars I've owned in the past. The feature that impresses me is the Output Leveling. The commercials are the same volume as the programs. I used to quickly hit the mute when commercials came on. The advertisers would be better off not increasing the volume, because we just mute them anyway. Great sound bar!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Smock",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Movie Sound is excellent",
      "text": "We had an older sound bar on our large screen Sony. Couldn't hear all the words on movies, like the Game of Thrones, very well. This sound bar is a significant improvement.",
      "rating": 4.0,
      "verified": true,
      "author": "Mikey",
      "helpful_votes": 2,
      "publication_date": 20190422
    },
    {
      "title": "Solution for age-impaired hearing",
      "text": "Only had it a week but i\"m a believer. I can hear and understand my TV far better than before.",
      "rating": 5.0,
      "verified": true,
      "author": "James C. Schneider",
      "helpful_votes": 4,
      "publication_date": 20171209
    },
    {
      "title": "Not suitable for hearing impaired.",
      "text": "Thought this item had a headphone jack (it doesn't). I've bought 3 items from Zevox (a soundbase 400 series, AV200/205, and SB380) Only the less expensive AV200/205 has a headphone output. I wear hearing aids (high frequency loss) and using headphones improves speech quality plus separate volume control so that you do not have to blast out your non-hearing impaired partner! Do not buy this item (SB3800 IF YOU INTEND/ OR WISH TO USE HEADPHONES)!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer, Jane",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Waste of money, a lot of aggravation installing.",
      "text": "Not much to like. Slight increase in volume. Like hissing sound? Plenty of that and increases when volume turned up. Had mine since early May. No better and less sound out of it.",
      "rating": 1.0,
      "verified": true,
      "author": "Ron Rhodes",
      "helpful_votes": 3,
      "publication_date": 20180829
    },
    {
      "title": "I hear speech and words much better,  well worth it.",
      "text": "Voices are much crisper and words are heard with more clarity. Bass is a little \"tinny\" but I'm enjoying the sound quality improvement.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "can finally understand the words.",
      "text": "so far am very happy with the zvox sb380.can actually understand the words being spoken.lost the ability to hear well at a young age after serving in the Army.Have gotten top of the line hearing aids from the VA but they are merely amplifiers.The accu-voice does help with clarity with.very little background clutter.",
      "rating": 5.0,
      "verified": true,
      "author": "larryps",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great product",
      "text": "This sound bar is excellent. Great sound. Had to disable sound on my tv so now I have to use the included remote to mute and adjust volume.",
      "rating": 5.0,
      "verified": true,
      "author": "Gene",
      "helpful_votes": 4,
      "publication_date": 20171115
    },
    {
      "title": "Good quality",
      "text": "Works well for someone that’s hard of hearing. I tried both the 200 and the 380 side by side. The sound was a lot better on the 380 so I sent the 200 back. Save yourself time, just order the 380. Very pleased. I have tinnitus and am hard of hearing. 66 years old",
      "rating": 5.0,
      "verified": true,
      "author": "Bobo",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Good Buy",
      "text": "Very satisfied with this sound bar. The clarity of voices was immediately noticeable. I have had trouble understanding dialogue when watching tv or movies. This made a huge difference. Don’t expect theater quality surround sound but the quality is better than just the tv speakers. It easily paired to my cable provider remote Set up was pretty easy. I did have 2 minor issues after set up but after an email to ZVOX support and a response within an hour on a Sunday they had the problem diagnose and provided a solution",
      "rating": 5.0,
      "verified": true,
      "author": "Alan M.",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Product lives up to description",
      "text": "We can hear the dialogue very clearly and no longer need to use subtitles. This is just as it was promised to be. Looks stylish as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Laney B",
      "helpful_votes": 3,
      "publication_date": 20171207
    },
    {
      "title": "Didn't last 90 days!",
      "text": "I bought this on June 12th. It is now August 6th and it's DEAD. Won't power on and last night it was cycling thru all the settings on the front. A high priced electronic speaker and the return window was 30 days?! Nonsense",
      "rating": 1.0,
      "verified": true,
      "author": "Carole Meyer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Wow what a great device!!",
      "text": "Both my wife wear hearing aids and were struggling hearing the dialog on most TV shows. The day we installed this unit a new world was opened for us. We can't believe the outstanding performance of this unit and would highly recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D. Mcbride",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Really nice soundbar!",
      "text": "We purchased this soundbar to replace another one in our bedroom that (1) had an awful remote and (2) my husband had a hard time with hearing dialogue. We liked this soundbar so much we purchased another one (somewhat more features) for the living room. Very happy with this and recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sybil E.",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Easy to hook up and use but maybe not “elderly compatible”",
      "text": "Wished there was a hard switch to keep voice enhancement turned on. I purchased this for an elderly gentleman with hearing issues. He loves it but still cranks up his sound for voices as he continually (accidentally) turns the voice part off. Was easy to install and sync with remotes.",
      "rating": 4.0,
      "verified": true,
      "author": "David M. Smith",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "great sound",
      "text": "bought this sound bar based on reviews. i have trouble hearing dialect over the background music. this product helps immensely. i also like the feature that keeps commercial volume same as show i am watching. all aspects of the sound are excellent GREAT PRODUCT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MikeyT",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Aclu-Voice is great",
      "text": "I love the Accu-voice feature, it really makes a difference. So many movies have the sound track of songs much louder than the people talking that it is often difficult to hear what is being said. This sound bar fixes the problem.",
      "rating": 5.0,
      "verified": true,
      "author": "GKuch",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Outstanding Sound Bar",
      "text": "This sound bar is a little more expensive than a similar LG or Vizio, but the sound quality is amazing. I was pleasantly surprised at the bass response considering there's not a dedicated subwoofer. Overall, it's an excellent addition and a major upgrade over TV speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "R. S. Holland",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "ZVOX Sound Bar is great!",
      "text": "The ZVOX Sound Bar is everything it promises! Our old sound bar just wasn't getting shows loud enough or clear enough, especially for DVD's. This one totally solved the problem with clear, easy to understand quality volume. It was especially impressive for the price. It is taller than our last one was but still sits fine in front of our 55 inch TV. The amazing part was that the installation REALLY was as easy as they say, and we had no problem programming our main remote to control the sound bar. I just wish we had found it sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "trisha",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Best sound bar I ever owned",
      "text": "This is my 3rd sound bar and by far the best. I have a Bose Solo 5 and Bose sound system that are trash next to this one. Sound is loud and clear when needed, first sound bar where I didn't have to go to full volume ( about 1/2 way is good ) just hear some low volume movies.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "I was looking for a sound bar that enhanced voices ...",
      "text": "I was looking for a sound bar that enhanced voices because I found that I kept turning the tv louder and louder. This sound bar makes a HUGE difference. I can hear all of the dialogue on every show!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20171209
    },
    {
      "title": "I can hear them talking!",
      "text": "I can hear the people talking so much better on the television! If there is singing or a chorus segment it does seem difficult to hear since it tones those down, but I think I just need to mess with settings in those situations. Truly, worth it to be able to hear the people speaking and not have the background so loud.",
      "rating": 5.0,
      "verified": true,
      "author": "Malia Glotzbach",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Great sound quality.",
      "text": "The sound bar has improved the sound from my Vizio TV so much that I can now understand almost 100% of what people are saying. Before getting the sound bar I had to use captions to figure out what was being said. One problem I had installing it was attaching the digital sound cable to my tv, it is a vertical connection and the cable simply would not hold in the hole provided on the tv. I had to tape the cable to the tv in order to get it to hold. I don't know if this is the fault of the tv (new tv) or the cable.",
      "rating": 5.0,
      "verified": true,
      "author": "zeereader",
      "helpful_votes": 9,
      "publication_date": 20171209
    },
    {
      "title": "Solves a problem",
      "text": "I have good hearing, but I still find it hard to hear dialogue in many current movie and TV soundtracks. The ZVOX solves this problem. No more guessing about the speech. I replaced a more expensive sound bar with this one. Thanks ZVOX!",
      "rating": 5.0,
      "verified": true,
      "author": "George Muse",
      "helpful_votes": 3,
      "publication_date": 20171217
    },
    {
      "title": "They LOVE it. (Their neighbors no longer can hear their ...",
      "text": "Ordered this Sound Bar for my elderly parents because of its ratings for bringing out voices from the back ground on TV. They LOVE it. (Their neighbors no longer can hear their TV.) The sound is excellent. And the 'learning' feature of the sound bar made pairing to their remote very easy. We ordered the \"used\" product... but you would not know it by the way it looks. I could not find any flaws in it... looks and works great. I would definitely recommend this product and ZVOX.",
      "rating": 5.0,
      "verified": true,
      "author": "PS",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Love the output leveling",
      "text": "This unit has great sound, looks good and is super easy to hook-up and set-up. They very best feature though, is the output leveling feature. Both my wife and I have long been tired of having to mute almost every ad that appeared on the set do to the sudden increase in volume that they achieve. No more! Thanks to our ZVOX unit that annoyance has gone away. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Idosh",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "excellent sound",
      "text": "Husband was having difficult time hearing the television. He has a slight hearing impairment. This sound bar enabled him to hear perfectly. He says it has really made a tremendous difference. Also I enjoy listening to music on Amazon prime on our television. The sound is greatly improved now.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Jackson",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Doesn't solve all sound problems",
      "text": "I have to use a mix of the tv speakers & the sound bar to get acceptable sound(to me). sound bar alone is tinny sounding. It's not an end all to the lousy movie & show dialogue. Interesting that commercials are pretty clear and I don't like watching those.",
      "rating": 4.0,
      "verified": true,
      "author": "James B.",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Very difficult to make adjustments to the sound with the buttons on the controller. I’m 76",
      "text": "I use hearing aids and was unable to adjust the speaker so that I could continuously hear the Sound output well. I ended up at the doctor and didn’t get this off in time. I seriously wanted this to work and tried hard to make it work for me. It just didn’t. Sorry",
      "rating": 3.0,
      "verified": true,
      "author": "JKRas",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "listing enjoyment improved",
      "text": "The various setting on the sound bar enabled us to adjust the clarity and volume to fit our needs. A good product for those of us that have a little difficulty hearing.",
      "rating": 5.0,
      "verified": true,
      "author": "LDR",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great sound - does what it says it does!",
      "text": "So far, we love it. It's only been a week, but we've had no issues. Purchased this model as the lesser model had consistent \"crackling\" and non-functioning reviews. We can hear the dialogue clearly - and the commercials don't blast us out of the seat anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Looks and sounds great! Most challenging part of installation is trying to ...",
      "text": "We can finally understand the dialogue of old movies, and sitcoms that tend to overwhelm dialogue with background laughter tracks etc. Looks and sounds great! Most challenging part of installation is trying to pair your current remote.. have not been successful yet... but will continue to try to set it up. The remote that comes with the unit works great.. but would love to only have to work with one controller.",
      "rating": 5.0,
      "verified": true,
      "author": "David D.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Mom Can Hear The Dialog!!!",
      "text": "Finally a product that does what is advertised. Not sure that this will work for every circumstance, but for my Mom it is a miracle. She is thrilled to be able to sit in a room with others and hear what they hear. It did perform as advertised for my Mom. Our entire family thanks you!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Zanchi",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Amazing clarity of this sound bar. Where has it been for all these years !",
      "text": "I can not believe the clarity of this sound bar. I thought I was going deaf until I replaced another widely recognized sound bar with this one. Every word, sound, note is easily recognized, no more straining or replaying to get something we missed. Thank you !!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Keane",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "The sound is Great. 3 levels of Surround Sound settings",
      "text": "I've been looking for this sound bar for (3) three years. The sound is Great. 3 levels of Surround Sound settings. Adjusts sound between commercials and programs also stations, so you don't. Adjust your bass and treble your way. Face it front, up or wall mount. Program it for other remote controls.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Green",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Brings out the dialogue!",
      "text": "Extremely pleased with this soundbar for dialogue. I suffer from hearing loss in the frequency range of human voice. I needed something to help me enjoy TV watching without blowing my younger wife's eardrums. 🤪. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark C.",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Five Stars",
      "text": "Great volume and quality. Bought this for the AccuVoice and it does not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20171206
    },
    {
      "title": "Very Good",
      "text": "I have only had the product for a couple of weeks and also had to go out of town. I haven't had time to set up the remote but the sound bar was very easy to install. I bought this for my husband who is hearing impaired, he can hear voices much better and though I have no trouble with my hearing, I like the clarity of the sound and we don't have to turn the volume up as much.",
      "rating": 5.0,
      "verified": true,
      "author": "jim. e.",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Excellent audio addition!",
      "text": "Great flexible audio and able to utilize 3 positions, I'm hard of hearing and the AccuVoice 6 level voice enhancement program gives me general TV, and news to movie and music video watching clarity, and the subwoofer and virtual surround sound are great for a package this small!😁",
      "rating": 5.0,
      "verified": true,
      "author": "David Gustafson",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Top quality sound bar!",
      "text": "This is the best sound bar we have found. My husband had a hard time understanding some of the dialogue during certain programs, the sound bar took care of that problem. He called customer service with help hooking the sound bar to DIRECTV. The person was very helpful and knew just what to do. We are very happy with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "JoAnn",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Can hear voices clearly.",
      "text": "I wear hearing aids and missed a lot of conversations and music. This sound bar lets me enjoy watching TV again. Haven't had time to watch DVD or VHS yet, but think that this will solve my problems of the past. Am very happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Gail Carman",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Accu voice perfection.",
      "text": "This is my second zvox for another room and it is even better than the current one. The 6 level accu voice has been a definite plus vs the original single level on the current one. For anyone thinking about this I would definitely recommend it. A very happy 50+ years young.",
      "rating": 5.0,
      "verified": true,
      "author": "McSunley LLC",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great quality",
      "text": "We bought this sound bar for someone in the family who was starting to have trouble hearing. We all love it! It makes the conversations in movies so clear and it has great sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Purchased this for my husband who refuses to wear his ...",
      "text": "Purchased this for my husband who refuses to wear his hearing aids. He used to ask \"what did they say?\" all during movies. Once this sound bar was up and working he could hear every word. THANK YOU!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Great Sound",
      "text": "Good surround sound, treble and base adjustments, easy to install. In the voice mode, it sounds a little tinny, but overall, sounds good. For my LG TV, I had to select the digital out sound before I heard anything, this was not mentioned in the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "James T.",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Great even sound",
      "text": "Getting a little hard of hearing, and this helps even the sound without the music blaring over the conversations.",
      "rating": 5.0,
      "verified": true,
      "author": "Rheta",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "GOOD SOUNDING BAR",
      "text": "GOOD SOUND - NICE SIZE AND EASY INSTALL - WHATS NOT TO LIKE. THANKS",
      "rating": 5.0,
      "verified": true,
      "author": "Elge S. Spalding",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Good sound, but...",
      "text": "Remote works great. Looks and quality cant be beat in my opinion. However if you have terrible hearing, this might not be the ultimate product. I haven't found that one however. But it works pretty well.",
      "rating": 4.0,
      "verified": true,
      "author": "Ace Morgan",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Looking forward to years of enjoyment ahead listening to this Amazing Sound Bar",
      "text": "ZVOX SB380 Exceeded my expectations by a long shot! Ease of installation coupled with knowledge ( & Patience!) of customer support group made for a stress-free set-up! Looking forward to years of enjoyment ahead listening to this Amazing Sound Bar...... THANKS, ZVOX!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20180724
    }
  ],
  "product_meta": {
    "title": "ZVOX SB380 Aluminum Sound Bar TV Speaker with AccuVoice Dialogue Boost, Built-in Subwoofer - 30-Day Home Trial",
    "rating": 4.5,
    "feature_bullets": [
      "Room-filling 3D sound from a single, slim (3.3”) aluminum cabinet.",
      "Six levels of AccuVoice boost using our patented hearing aid technology. Each new level delivers stronger dialogue emphasis, while minimizing the non-vocal parts of the soundtrack. The results are remarkable. Voices are clear and easy to understand, even at extremely low volumes. You'll hear every word, even on poorly mixed programs or British programs.",
      "Built-in subwoofer uses digital algorithms to create great bass without an external cabinet.",
      "Multiple inputs make it simple to add a multi-zone streaming audio receiver.",
      "Output Leveling tames loud commercials."
    ],
    "specifications": {
      "Product Dimensions": "35.5 x 3.3 x 5.7 inches",
      "Item Weight": "9.8 pounds",
      "Manufacturer": "ZVOX Audio",
      "ASIN": "B0744N8TNQ",
      "Item model number": "SB380",
      "Customer Reviews": "4.5 out of 5 stars404 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#4,913 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 21, 2017"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Sound Bars",
      "Speakers"
    ],
    "price": 199.0
  }
}