{
  "website_summaries": [
    {
      "verdict": "Minimizes waste and is Bluetooth capable and ready to generate ice with a nostalgic, chewy texture.",
      "pros": [
        "Resourceful in its ability to re-purpose melted ice into new nuggets",
        "Customers note the ice has a familiar taste that will remind you of a popular drive-in",
        "We love that the unit is self-contained"
      ],
      "cons": [
        "Can be a bit noisy for some, but not all customers report this product is loud"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "For chewable pellet ice addicts the Firstbuild Opal Nugget Ice is a dream come true, but regular shoppers should pass on this pricey specialty appliance.",
      "pros": [
        "The Opal Nugget Ice makes lots of chewable ice right on your countertop, and it doesn't need a dedicated water line"
      ],
      "cons": [
        "While it costs much less than luxury ice makers, the Opal Nugget Ice is still expensive",
        "It needs regular cleaning, it's loud, and can't store the ice for extended time periods"
      ],
      "aspects": {
        "Features": 8.0,
        "Design": 7.0,
        "Performance": 9.0,
        "Usability": 8.0
      },
      "publication_date": 20161119,
      "rating": 8.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Second opal to fail with the same issue within a ...",
      "text": "Second opal to fail with the same issue within a month. Blue light illuminated telling me to add water, and the device is full of water. Same mode of failure on both devices. Opal is refusing to honor warranty",
      "rating": 1.0,
      "verified": true,
      "author": "The_Grinch",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Broke in Less Than a Month!! :(",
      "text": "Purchased for my Mom for Christmas and it has already stopped working! I cannot believe it! I will be trying to get it replaced. We will see what happens.",
      "rating": 1.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "don't think Id buy again",
      "text": "We got ours In November and it has already stopped working. I have contacted extended warrenty folks and it's still under original manf. warrerity, so they won't do anything. Sent messages to the manufacturer and no answer, none. I chatted with amazon and they say it's too long for a return, however the girl said they'd make a exception and let me return it, but she sent me a return for the filter I bought with it!!! Crazy people, I will never buy a big ticket priced thing like this again !!",
      "rating": 1.0,
      "verified": true,
      "author": "Beverly's",
      "helpful_votes": 748,
      "publication_date": 20180120
    },
    {
      "title": "This is awesome, we love the ice and the machine",
      "text": "This is awesome, we love the ice and the machine! It is about 5 weeks old and it has been making some very very loud noises, so I have called first build customer service 5 times and left messages and they never return phone calls! It is a shame because I love the product but if they can't even talk to me I guess I will have to return it. Poor customer support is not a good way to keep your customers happy, I have been bragging to everyone about how awesome it is, I just hope my friends haven't ordered one . I will be embarrassed if they do.",
      "rating": 1.0,
      "verified": true,
      "author": "BOBBY SCHIEFELBEIN",
      "helpful_votes": 419,
      "publication_date": 20180116
    },
    {
      "title": "Never made any ice",
      "text": "So excited for this to arrive and sorely disappointed when it defrosted all night. Never made any ice. after reading the single star reviews, i am returning and not even going to try and get a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "AJY",
      "helpful_votes": 97,
      "publication_date": 20180410
    },
    {
      "title": "Defective Unit",
      "text": "I've had the machine running for 24 hours and it is making horrendous squealing noises and it has to be unplugged. I give this product 0 stars. $549. I hope I am able to get a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin T.",
      "helpful_votes": 120,
      "publication_date": 20171211
    },
    {
      "title": "Wont Make Ice after 2nd Use!",
      "text": "Just received my Opal Nugget Ice Maker and it worked perfectly the first time i used it. Now it wont make any ice at all! Thank god I have the standard 1 year warranty and purchased the 3 year extended warranty. I was afraid this would happen. Going to have to call Opal to see WTF is going on....",
      "rating": 1.0,
      "verified": true,
      "author": "Eric P.",
      "helpful_votes": 52,
      "publication_date": 20180715
    },
    {
      "title": "Save your money",
      "text": "The first one I bought had the water pump go out after two weeks. Upon returning for a new second unit. Immediately after starting it up, it shot water everywhere on my counter. I tried twice and both were junk. Plus they are heavy and not easy to return. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 43,
      "publication_date": 20180610
    },
    {
      "title": "2017 on dec 14 2017 started making a horrible noise and quit making ice of course no returns ...",
      "text": "received ice maker on oct 26,2017 on dec 14 2017 started making a horrible noise and quit making ice of course no returns after nov 26 2017 very convenient would not recommend this product to anyone",
      "rating": 1.0,
      "verified": true,
      "author": "Paula Rice",
      "helpful_votes": 105,
      "publication_date": 20171218
    },
    {
      "title": "Excellent Product",
      "text": "Excellent product. Works great making that delicious ice. The packaging was the best I have ever seen. I Instructions were accurate and easy to follow. Once cleaned and sterilized it began making ice just fine strongly recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul V. Oconnell",
      "helpful_votes": 150,
      "publication_date": 20170920
    },
    {
      "title": "Worked great..while it worked.  Very disappointed with FirstBuild. BEWARE!",
      "text": "I bought this unit in April 2018. In November 2018, the water pump stopped working. Because I bought this through Warehouse Deals, FirstBuild informed me that the product is no longer under warranty and will not be replacing it. Less than a years worth of use, $500 out the window. While this worked, it was great. I'm beyond disappointed with the customer service on this front and cannot in good faith recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela James",
      "helpful_votes": 25,
      "publication_date": 20181120
    },
    {
      "title": "This is the best ice ever",
      "text": "This is the best ice ever! We love Sonic ice and it is just what we were hoping it would be! Highly recommend getting one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Franklin",
      "helpful_votes": 46,
      "publication_date": 20170930
    },
    {
      "title": "Nine Months and Still Works Great",
      "text": "I've had this for 9 months and STILL love it!! Still works great and everyone in my family always grabs a scoop or two for their cup when they drop by. It's a hit!!! Update: I've now had this for 18 months and still works great!!! I only use bottled water (1 gal jugs from Walmart) in it. Works so fantastic that I just bought a second one for my sister. I highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 51,
      "publication_date": 20171116
    },
    {
      "title": "Opal Nugget Ice Non-Maker",
      "text": "I read all the reviews and was really excited to receive this ice maker. Unfortunately it never produced enough ice to fill one glass in a 24 hour even though I followed all instructions included, I also watched youtube videos, and went to the website for troubleshooting tips. It continuously poured water in the tray without producing ice. Back to square one trying to find a good counter-top ice maker that produces smaller ice to eat.",
      "rating": 1.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 67,
      "publication_date": 20171027
    },
    {
      "title": "Opal Does Not Work.",
      "text": "OK, if and when this machine works it makes great ice. Bought the first one in May, this year. It did not work at all. IB sent a replacement. It worked up until yesterday (June 28). I have emailed customer service and waiting for their response. I would not recommend this machine to anyone. For $500.00 it should work. I'm really afraid I'm going to be out all my money. If you read the reviews they have many, many machines that do not work. I can only say, buy at your own risk and don't be surprised when it does not work. See this photo I took this morning. No additional ice is being made sense yesterday.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike White",
      "helpful_votes": 27,
      "publication_date": 20180628
    },
    {
      "title": "Still working but some loud unholy sounds being made",
      "text": "Have had this for about 6 months now. Still working but it's making some really odd sounds. Loud and very annoying. this only happens while it's starting to freeze water. Once frozen and producing ice it stops that sound. I clean regularly about ever 10 days. Regular filter city water. Take a look/ listen at the attached video. Goes on for about 15 minutes and then it will stop. I do enjoy the ice but I don't think I would purchase again for this price.",
      "rating": 2.0,
      "verified": true,
      "author": "Dodds",
      "helpful_votes": 10,
      "publication_date": 20190330
    },
    {
      "title": "Great ice - but making a extreme loud noise randomly",
      "text": "I tried to find a link to contact seller but could not find one. We purchased this ice maker on Jan 18, 2018 and been great but past few months ( and a lot more regularly) the unit makes ice great but it randomly starts this god awful sour in the video above. It’s pound enough to wake my child up. Or not even able to have a conversation near it. BUT when it works like normal and not making this extreme loud noise it is a great machine. I’m hoping I’m a able to talk with the seller on this to see what can be causing this and a fix for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike H.",
      "helpful_votes": 13,
      "publication_date": 20181019
    },
    {
      "title": "Best ice now at home",
      "text": "10 years ago when my kids were born and spent time in the NICU, I got addicted to the 'hospital' ice they had. I would choose restaurants based on their ice. Now I have it at home. I'm really happy with this. Would buy again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "David Bock",
      "helpful_votes": 13,
      "publication_date": 20171024
    },
    {
      "title": "Whale song every night",
      "text": "We really wanted to love this appliance; bought it on the recommendation from a friend. Like others have said, the nugget ice is great, the machine, well, frankly, it sucks. It’s constantly confused and cycling through different motions, sounds like it’s in pain, and makes horrible noises every night. Melts the ice, remakes it, leaks on our counter, sings the song that should only be heard by whales. On the product recommendation: we defrosted, cleaned it, emptied it, bought the filter. Nothing has helped. This product needs to go back to the drawing board, and unfortunately, ours has to go to the landfill.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy W.",
      "helpful_votes": 8,
      "publication_date": 20190316
    },
    {
      "title": "My husband is still in love with it",
      "text": "We just received our ice maker and it came a day early. My husband is an ice chewer and after 10 minutes it was making ice. I think he loves me all over again!! He is so excited, no more trips to WaWa's every day. Hopefully, it keep working strong. I will keep you posted! Shirley We have had this ice machine for over a month and run it daily. My husband is still in love with it. We have had not a single problem with it. For ice chewers this machine is a must buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley McGaffagan",
      "helpful_votes": 10,
      "publication_date": 20171130
    },
    {
      "title": "CANT RETURN!!! Heads up!",
      "text": "SO far we like the product, what we don’t like is that this item on prime and NOT returnable due to hazardous reasons. That’s hugely concerning!! We ordered to see it and try it in person, but found a more cost efficient one that worked with our space. When we went to go return it, it was NOT RETURNABLE!!! Know before you buy! In 15+ years of being a prime member, this has never happened. Now we’re out $520 after taxes on this thing. For an ICE MAKER 🤦🏻‍♀️",
      "rating": 2.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 9,
      "publication_date": 20190607
    },
    {
      "title": "So good I have 2!",
      "text": "I actually own two of these. I have had the first for 2 years. I got tired of moving it back and forth to our RV when we travel so I bought a second one 4 months ago. The older one is now in the RV full time. It is very important to use distilled water only. Our second one started making noises after about a month. But the kids were putting spring water and filtered water from the refrigerator in it. A good cleaning with vinegar with a 24 hour vinegar treatment then nothing but distilled water and we have had no issues. I do would definitely buy as gain and recommend to friends and family!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 10,
      "publication_date": 20181117
    },
    {
      "title": "Stopped working completely within 3 weeks of purchase, replacement ...",
      "text": "Stopped working completely within 3 weeks of purchase, replacement has now stopped working within 2 months. No contact information other than an e-mail address. Absolute JUNK",
      "rating": 1.0,
      "verified": true,
      "author": "KRemo",
      "helpful_votes": 20,
      "publication_date": 20180403
    },
    {
      "title": "Defective out of the box",
      "text": "We followed the setup instructions (cleaned it 1st) and it started making ice. Later in the afternoon my wife came home to this noise (see attached video). She unplugged it and let it reset. When she plugged it back in, the pump never stopped running. It would continually shoot out water onto the ice. Based on others recent reviews and our own experience, we’re going to go with a different machine, which is a bummer because I really wanted this type of ice!",
      "rating": 1.0,
      "verified": true,
      "author": "chris thorn",
      "helpful_votes": 6,
      "publication_date": 20190805
    },
    {
      "title": "Loved this ice maker until it stopped working",
      "text": "Loved this ice maker until it stopped working. I have only had it a little over 2 months. It says it’s full when it has no ice, and then stops running. For this price it is not worth it!",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Schust",
      "helpful_votes": 19,
      "publication_date": 20180503
    },
    {
      "title": "This ice machine is a piece of junk",
      "text": "The first ice maker that was shipped to us worked great for a few weeks and then stopped making ice. Although the pump would run, it would not pull water out of the tank. After working through a tech support process with Opal that lasted well over a week, Opal sent us a new machine. As with the first machine, the second machine worked great for a few weeks and then stopped working. Don't waste your time or money on this ice maker. Although the ice was great, the machine is an unreliable piece of junk. We ultimately had to return the machine to Amazon for a return of the purchase price.",
      "rating": 1.0,
      "verified": true,
      "author": "LD New Orleans",
      "helpful_votes": 6,
      "publication_date": 20190602
    },
    {
      "title": "Don’t waste your money",
      "text": "Don’t waste your money. We bought 2 of them cause our first one was out of warranty by a month or so. They won’t help you after the 12 months. Then they won’t sell you parts to fix it. So if it breaks then you are screwed. So our brand new one is about 2 weeks old. It’s 4 times louder than the one that only lasted 13-14 months. It also takes twice as long to actually make ice.",
      "rating": 1.0,
      "verified": true,
      "author": "Pruitts jams ",
      "helpful_votes": 6,
      "publication_date": 20190503
    },
    {
      "title": "Don’t waste your money",
      "text": "We bought ours a year & a half ago. So although we got a little more use out of it than others, it has completely stopped making ice. This is the second time we’ve had this issue but we’re able to clean it & get it back up & going. We ONLY use purified water purchased at the stores. We’ve cleaned it multiple times. For the price, I’d have rather bought six $100 ice machines & had better luck. I do not recommend this machine.",
      "rating": 1.0,
      "verified": true,
      "author": "Boymom2",
      "helpful_votes": 4,
      "publication_date": 20200414
    },
    {
      "title": "I hate this thing!",
      "text": "I had no idea there was no return for this item or I wouldn’t have tried it. It’s horrible. So slow making ice and it melts while you wait. It’s huge and hot. The nuggets are so small they melt as soon as your drink touches it. So I wait 2 hours to get enough ice for 2 drinks and then the ice melts right away. So disappointed. Then it’s not refrigerated so I try to hurry and transfer it to the freezer but it melts so much that when it goes in the freezer it clumps together. Awful product.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 6,
      "publication_date": 20190925
    },
    {
      "title": "We would consider this a lemon!",
      "text": "We purchased this unit as a Christmas gift for our family. We have teenagers and we love iced cold drinks. It worked beautifully in January and February. However, we haven't been able to use it consistently since March. The indicator light shows that the bin is full and won't make ice. We tried cleaning the unit with vinegar as suggested and it worked for two or three days. Then the light came back on and we had the same problem. We tried cleaning again and again and again to no avail. So far we've submitted three separate on-line warranty claims to FirstBuild with no success. We cannot get a hold of the company and are entirely frustrated!",
      "rating": 1.0,
      "verified": true,
      "author": "DMSlagSkal",
      "helpful_votes": 3,
      "publication_date": 20190420
    },
    {
      "title": "We really love the ice but for the price you think it ...",
      "text": "After having this item for 3 months it is making a very loud squeeling sound. I thought maybe the pump was not getting water and wiped the inlet out. This didn't help. We did the cleaning about 3 weeks ago and do it usually once monthly to keep it in top shape. We really love the ice but for the price you think it would last longer than this before showing bad signs",
      "rating": 2.0,
      "verified": true,
      "author": "ricky",
      "helpful_votes": 7,
      "publication_date": 20180612
    },
    {
      "title": "Warning ****don't buy",
      "text": "After reading other reviews. Negative reviews I still gave it chance an bought this ice nuggets machine ...boy I should have listened to the words coming out of my mouth It arrived. Unpack followed all instructions And NO ICE ...NOT WAITING I CALL Amazon They refund my Money. Asked me not to send it back ...what does this tell you...listen to me Don't Buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "vincent jung",
      "helpful_votes": 6,
      "publication_date": 20190621
    },
    {
      "title": "Colossal waste of time",
      "text": "I anticipated the greatness of this ice maker. Needless to say the hassle it took to get Amazon to deliver it aside, setting it up - cleaning it and then the pump not working was displeasing to say the least. I get so tired of me being the only person who gets the defective product you know? LOL I realize I'm not. But honestly I really wanted this to work. The pump isn't moving the water at all. So now I have to pack up the 50 lb. box with the wood inserts and arrange to get it picked up. Again what was my headline?? A colossal waste of time - thank you very much.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim Greene",
      "helpful_votes": 3,
      "publication_date": 20190605
    },
    {
      "title": "Very disappointed! Leaks all over. Seller won’t help",
      "text": "Bought this “dream” sonic like ice maker for my wife. It seemed to be great at first then after about a month it started leaking out of the back right corner. Read some reviews and looked for tech support. Seemed to be a common problem. Told me to put a towel under the front of the machine. That didn’t work. We can’t figure out why it is leaking. Contacted seller and they have been no help! Very dissatisfied. Would happy return it. Yes it makes sonic ice but the constant leaking has ruined our kitchen hard wood floors. Support is TERRIBLE!",
      "rating": 1.0,
      "verified": true,
      "author": "Adam T.",
      "helpful_votes": 4,
      "publication_date": 20190609
    },
    {
      "title": "Great ice",
      "text": "See video....update: this is over a year later and we still love this ice machine. We bought an icebucket for our freezer so that we don't have to run it all the time. Just fill the bucket and we are good for a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 6,
      "publication_date": 20181228
    },
    {
      "title": "Good while it lasted. Unfortunately there is bad support.",
      "text": "This product was good while it lasted. Only problem is that it lasted less than one year before failing. Customer support is polite but inept. My unit was replaced after trouble shooting. Only problem is that it was replaced with an older non working unit. Now I am being told that their policy has changed and they won’t replace the “new” older unit at all. Instead, they will ship me a box to send the old unit in and repair that and send it back to me. We have been without the use of the product for over two months. This is too expensive of a product to be this unreliable. So disappointing that product support is so bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel Gonzalez",
      "helpful_votes": 2,
      "publication_date": 20191125
    },
    {
      "title": "Very Disappointed In The Ice Maker And Insurance Company",
      "text": "I bought this from Amazon on September 4, 2019. Set it up and it worked great until two days ago (April 7, 2020). It took a month to get it replaced. Here it is two months later and June 18, 2020, the unit just quit. Started making growling noises and like it was chopping up nails. I cleaned the two litter sensors in the top. Still would not make ice. I am so disappointed in this unit. I am also disappointed that the insurance company is sending me old used units that already had this problem by someone else. I would not recommend you buy this Opal unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy Reckart",
      "helpful_votes": 2,
      "publication_date": 20200410
    },
    {
      "title": "Ice is great, service bad",
      "text": "I loved this Sonic sized ice. It lasted almost 3 years before I had to use my extended warranty. That was a nightmare. Went through Assurant who gave me the run around for about a month, then my warranty ran out. So if you buy this, I recommend an extended warranty BUT not by Assurant.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 3,
      "publication_date": 20191018
    },
    {
      "title": "Good ice maker",
      "text": "This product worked great, no issues, for about 15 months. Then the blue ring came on telling me that it needed water added. It was full of water. I did the troubleshooting and it still acted like it was out of water. Troubleshooting taught me that the pump was blown and I needed to contact the company for help. Good luck with that! After a few weeks of no reply they did finally email me back. They are sending me a new unit now so let’s hope that this one will work longer than the first one.",
      "rating": 4.0,
      "verified": true,
      "author": "Buddy G.",
      "helpful_votes": 2,
      "publication_date": 20190301
    },
    {
      "title": "Second time - Blue light of death error -",
      "text": "Blue light saying water empty, even though it's not. Worked for 2 weeks amazingly well and now broken. Replacing to try one more time because I loved it when it was working. UPDATE :Brand new unit arrived today. Broken from the start! Didn't even make one piece of ice (yes, I followed all the setup directions to the T). Such a shame because those first two weeks after receiving the first unit and this did work, it was amazing!",
      "rating": 1.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 4,
      "publication_date": 20190301
    },
    {
      "title": "Great!!",
      "text": "Bought it for my wife who loves Sonic ice. She is 100% satisfied. Great product. Little noisey but we make batches of ice and keep in freezer so we don’t need to keep it running.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 7,
      "publication_date": 20171104
    },
    {
      "title": "nothing but a joke",
      "text": "This machine we were SO EXCITED FOR! But from the very beginning it didn't work. To loud and a screeching noise, didn't make ice, bought the specific cleaning kit, customer service, etc Still doesn't work. I have gotten the run around from customer service even before the year warrenty was up and never sent a replacement. Spent over $500 ON IT! Ridculous! I want one that works! Update. Purchased their cleaning kit, went through all of what they say and it still doesnt work a year later. I want a replacement or refund!!",
      "rating": 1.0,
      "verified": true,
      "author": "Aimee",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "Broke after 1 1/2 years",
      "text": "It was an amazing little machine. Noisy at times and a pain in the butt to clean but we really enjoyed the ice. Sunday morning we came into kitchen with water all over the counter. This product only has a 1 year warranty. A very expensive machine for it to not last very long. We took off back thinking a fitting/gasket needed changed. It was actually in the main unit that would cost a lot to fix. Cheaper to buy a new machine.",
      "rating": 3.0,
      "verified": true,
      "author": "chickengirl6",
      "helpful_votes": 2,
      "publication_date": 20200630
    },
    {
      "title": "This product was good but...",
      "text": "You should also only add distilled water to ensure the life of your Opal. This is our second Opal. We have such hard water that the first Opal gave out. Now we have a water distiller and it has made a world of difference. It's worth the extra cost.  Don't throw away a huge investment. Do yourself a favor and order a distiller.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sanchez",
      "helpful_votes": 2,
      "publication_date": 20190809
    },
    {
      "title": "PLEASE save your money!",
      "text": "I received this as a Christmas gift and it stopped producing ice within a couple weeks. Luckily, and thankfully, Amazon worked with us and replaced the unit. The noise didn't bother me. I truly don't think it was too loud. However, even using distilled water, filters, weekly cleanings, and not running it 24 hours a day, it didn't last long. Apparently from the other reviews, I'm \"lucky\" it lasted this long. Spending a small fortune on an ice maker was something I wasn't too happy about...but it became invaluable to me because I eat so much ice. 7 months and two machines later...not worth it. Unless you have money to throw away.",
      "rating": 1.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "$450 w/o the filter - why? Ice is chewable.",
      "text": "It IS NOISY and it takes LONGER than an hour for a pound of ice. BUT, the ice IS SOFT. I can't say that I'd buy it again b/c of the price compared to how slow & noisy. AND VERY DISPLEASED THAT THE FILTER DID NOT COME WITH THIS $450 MACHINE! PS - your FAQ webpage - STINKS! No help!",
      "rating": 3.0,
      "verified": true,
      "author": "J Slagle",
      "helpful_votes": 3,
      "publication_date": 20190710
    },
    {
      "title": "I should have listened to the bad reviews",
      "text": "Two months. That’s all it lasted. I cleaned it every two weeks and used only distilled water. It looks brand new still but no longer cools or freezes ice. It blows hot air. Really hot air, to the point where I unplugged it. I have contacted the company, they are sending a refurbished machine out by the sound of it. Which I'm not thrilled about. Update: the refurbished machine they sent me lasted exactly another three months. I baby this machine and follow directions to a T. Regular cleanings and distilled water only. This product is delicious but seriously flawed.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Fase",
      "helpful_votes": 2,
      "publication_date": 20200311
    },
    {
      "title": "Quit working after 3 months",
      "text": "Really did like this icemaker at first because the ice was great. Took good care of it, gently used it maybe once a week. It quit working after 3 months and should be under warranty. The company who makes these will only allow an email to claim a warranty problem. Uggg. No response at all two weeks later. Very expensive to quit working.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan B.",
      "helpful_votes": 4,
      "publication_date": 20190630
    },
    {
      "title": "Loved it till now!",
      "text": "It was great till I realized it was leaking over my hard wood floors and now I have to replace them from all the water!",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Dillingham ",
      "helpful_votes": 6,
      "publication_date": 20180705
    },
    {
      "title": "HORRIBLE customer support, only lasted 8 weeks.",
      "text": "When it worked the ice was great... when it worked. It lasted 8 weeks and despite using soft filtered water and weekly cleanings. It failed within 8 weeks. I had the unfortunate experience interfacing with Keith from the FirstBuild Support Team (the manufacturer) over email. He evidently has no idea what he is doing and told me to ensure the tank was full of water (duh) and I never heard from him again despite countless emails. Waste of money and waste of time. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Goldwasser",
      "helpful_votes": 2,
      "publication_date": 20181102
    },
    {
      "title": "Happy so far",
      "text": "Can be loud at times...still working through what the different sounds mean. Have had for ~2-3 mos... love it so far. I’m very picky about ice machines. This is easy to clean (most important) and makes great ice. It’s a year later...still working as intended. I love it. Loud at times. We live in a small house so it can be heard late at night making ice, or it’s low on water, etc. The noises might bother some but the alternate is great ice so we take the good with the annoying at times. :)",
      "rating": 5.0,
      "verified": true,
      "author": "JKC",
      "helpful_votes": 2,
      "publication_date": 20191123
    },
    {
      "title": "Makes pellet ice very quickly and sits on your countertop",
      "text": "Best purchase ever! I love my Opal ice maker! I used to go to Sonic to buy bags of ice but not anymore. I even bag my ice in ziploc bags for my RV so I can gave my Opal ice with me camping. It even has a built in night light so you can see in it at night to get ice without having to turn on all the lights. There is also a rinsing mode so you can clean it and flush the lines and drain it. My only complaint is that it can be noisy sometimes when it us making ice. It sounds like the motor is grinding and making clicking noises.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelia Drew",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "I would highly recommend not buying this product",
      "text": "When I received my Opal Nugget Ice Maker, I promptly followed the instructions to begin making ice. Of course, it didn't work. I followed the instructions carefully and alas - no ice. This product is supposed to be high end among counter top ice makers. But it's as shoddy as so many other cheap electronic products. I would highly recommend not buying this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent Ortolani",
      "helpful_votes": 6,
      "publication_date": 20180702
    },
    {
      "title": "Worked Great for 6 months",
      "text": "This worked fantastic for 6 months, then it stopped producing ice. Opal honored their warranty and sent out a new unit. We had only every run bottled water through the machine, and cleaned it weekly. The first troubleshooting technique suggested was cleaning to remove mineral deposits. Their documentation suggested that bottle water might not be sufficient, and it may need to use only distilled water. We are now only running distilled water through the ice maker, so as to prevent a recurrence of whatever caused the first failure.",
      "rating": 3.0,
      "verified": true,
      "author": "Mom of 6",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "What might have been.",
      "text": "Worked great for about a week. Then the blue light came on indicating it was out of water and it won't change despite filling with water, cleaning, resetting, turning off/on, etc. Support requires that you jump through hoops including sending them a pic of your receipt. Umm, BTW, how do you get a receipt from Amazon?",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Turner",
      "helpful_votes": 3,
      "publication_date": 20190815
    },
    {
      "title": "BEST ICE EVER ... TOO BAD MACHINE BREAKS DOWN",
      "text": "Unfortunately, my experience with the Opal ice maker is the same as reported by some others here. The ice made by the Opal Nugget Ice machine is wonderful. However, after just less than three months, the pump has stopped working. After reading how disappointed others have been in FirstBuild response to this all-too-common problem, I can only recommend that you not purchase this machine until you can be sure they have addressed the pump issue. When I can be sure their machine problems have been overcome, I will purchase this again -- we will miss the ice until then.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 3,
      "publication_date": 20190302
    },
    {
      "title": "Noisy.  Loudest thing in my house",
      "text": "Bought in December. Still working well in April. Makes awesome nugget ice fairly quickly. However, this thing is LOUD. When its running, i keep thinking its the neighbor mowing his grass. Even louder when it runs out of water. If quiet is your thing... skip this.",
      "rating": 3.0,
      "verified": true,
      "author": "John Pavlik",
      "helpful_votes": 3,
      "publication_date": 20200415
    },
    {
      "title": "Mold and no real warranty",
      "text": "BAD WARRANTY: MOLD developed in tubing less than a year into ownership. Customer service suggested bleach/water cleaning and bottle/pipe cleaner. None of the latter are long enough and thin enough and the former did not touch it. I do not understand how a company that makes food products cannot either provide tools nor replacement, nor care frankly, for this. The ice was great - maintenance is a tad cumbersome - but warranty is a joke. I'm fuming that they can't care less about TOXIC conditions.",
      "rating": 1.0,
      "verified": true,
      "author": "JM Allen 7",
      "helpful_votes": 3,
      "publication_date": 20190626
    },
    {
      "title": "Awesome!",
      "text": "I have had many so called portable ice machines, they last a year or two at best. I have only had this one for a few months. First, I recommend getting the square deal warranty. And the side tank! Side tank makes it so much easier to add water! As far as performance so far, it has been awesome! And makes everyone's favorite ice! We call it \"sonic ice\" but is chewable nugget ice. Bin capacity is perfect for bagging some up and putting in freezer for bigger demand times. Get 3 pound ice bags, each bin fills one. Hope you enjoy as much as I do!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven D.",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Worst product!",
      "text": "Bought this ice maker in 2019 and it worked fine until July 2020 when it stopped producing ice. This is the 2nd unit that we have owned and have cleaned and flushed it following the instructions. This is the worst product that I have ever used even though I liked the ice that it made the unit does not last long, this one lasted less than a year and for the price that I paid I will never recommend this machine to anyone especially after having bought 2 of these in less than 3 years.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael2014",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Still waiting on amazon to make it right.",
      "text": "Great product, crappy customer service from maker. After just over six months the device stopped working. I contacted amazon and the customer service girl was great but wanted me to reach out to the maker first as it was still under warranty. Unfortunately, I have not heard back from them. I contacted amazon again and the guy I spoke to was AWFUL. Totally unhelpful. I’m still trying but for now the machine is collecting dust on top of my fridge. When it did work it was great. Super bummed about the guy I spoke with at amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "LoveMariah",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "DO NOT Waste your time and money on this ice maker.....",
      "text": "I don't write very many reviews as I don't have many problems with the items I buy. This ice maker is the exception. Right out of the box this thing was so noisy I couldn't hold a conversation in the same room. I think it was a cooling fan that was rubbing or the bearings were bad, it was loud! I will read reviews from now on, it appears most of these ice makers have similar problems. It's a great concept but the quality is lacking. I'm going back to the one hundred dollar ice maker.",
      "rating": 1.0,
      "verified": true,
      "author": "Skip",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Very high maintenance.",
      "text": "This product is way too expensive to require such high maintenance. It requires cleaning once a week when used daily. When we requested a return and refund, we were denied because of the timing. A huge waste of almost $600!!! It takes a couple months to realize how high maintenance this product is, and by that time the company won’t refund you. So if you’re looking for an ice machine that simply produces ice, this is not your machine.",
      "rating": 1.0,
      "verified": true,
      "author": "BSBTL",
      "helpful_votes": 4,
      "publication_date": 20181222
    },
    {
      "title": "Love the ice, but quit working less than a month after I bought it.",
      "text": "I bought this on October 19th, today is November 17th and it has already quit working. We have loved the yummy ice but for $500 this thing should work for years. Amazon is sending me out a new one, but geez, such a pain to have to mail the old one back and set up another one.😡 To Be continued......",
      "rating": 1.0,
      "verified": true,
      "author": "Janet S",
      "helpful_votes": 4,
      "publication_date": 20181117
    },
    {
      "title": "Refuting bad customer reviews regarding Support Systems",
      "text": "I ordered this ice maker and was overjoyed with it for the 3 months that it worked. Then it stopped. I sent an email to support but didn't get any answer. THEN I found a phone number for support. That was 5 days ago. I can't tell you how wonderful the 2 gentlemen that I talked to (Tyler & Cole) were. They registered my product, got me through the reporting process and have issued a replacement to be sent to me. They were friendly and easy to work with. I couldn't be happier with the replacement process. Thank you very much First Build.",
      "rating": 5.0,
      "verified": true,
      "author": "sue",
      "helpful_votes": 2,
      "publication_date": 20190417
    },
    {
      "title": "Good luck",
      "text": "I loved this product when it worked. I’m about to be on my fourth unit in four months. Two haven’t worked out if the box. One worked for a couple of months. Hopefully fourth time is a charm. For the price tag on this, I expect more.",
      "rating": 1.0,
      "verified": true,
      "author": "amanda barker",
      "helpful_votes": 3,
      "publication_date": 20200417
    },
    {
      "title": "Great ice, excellent function",
      "text": "Fast, chewable \"Sonic\" ice. Cleaning and set up with Quick guide was much simpler than other reviews indicated. Fast as promised. Doesn't run continuously, only when bin goes below a certain level. The ice melts into the water resrrvoir and is recycled, so always fresh and loose in bin. Quite a bit louder than I hoped; we keep it in the utility room. I also wish there were a way to pour in the water without removing the bin. However, it survived mailing to my home in the BVI, so I have high hopes for durability.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Nuckols",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Poor QA.  Ours arrived with a broken pump",
      "text": "On paper, this should be the ice maker to buy. However, as others have pointed out in previous reviews, you can't trust the reliability of the hardware itself. Ours arrived with a broken pump, meaning it wouldn't suck any water out of the resevoir into the condensor to turn it into ice. And, for wahtever reason, this item is one that when you try to return it to Amazon, they try claiming it's not eligible for any sort of return. Meaning Amazon is selling 300 dollar paperweights.",
      "rating": 1.0,
      "verified": true,
      "author": "Chef Vader",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Worse purchase ever!!",
      "text": "We got a third one after hours on the phone with the people who cover the warranty. The third one worked for a day and started making a horrible noise. More hours on the phone. This is the worse purchase ever. I wish we could just return it for a refund and get a machine that works. The rating doesn’t work with zero stars which is the only reason I gave one star.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly K. Dungan",
      "helpful_votes": 3,
      "publication_date": 20200416
    },
    {
      "title": "Makes the perfect size ice WHEN it works.",
      "text": "Machine worked well for about 12 months. Then a few days past the warranty period ended the water pump went out. Ive been trying to find replacement parts but not had any luck. I called the factory but couldn't get through to anyone. Sent out an email but haven't heard back. Unfortunately at this point its a big heavy paper weight that cost me nearly $600. I would not buy again due to the fact that the repair parts are impossible to get.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr Oregon",
      "helpful_votes": 3,
      "publication_date": 20190102
    },
    {
      "title": "Quality in doubt...customer support is not...it just isn't",
      "text": "I am really having misgivings about this product. After 3 months, it quit. Told it needed cleaning and to purchase cleaning kit....$30. Then wait 18 hours soaking ice chute. Still no go. Then test its temp...warm, hot, cold, or room temp. Now need my credit card to send refurbished unit and return label etc. Amazon provides a month return and then very little; save for a call screener to get you in touch with manufacturer. Not pleased,at all. Consider the cost before considering the purchase",
      "rating": 1.0,
      "verified": true,
      "author": "DenGig",
      "helpful_votes": 2,
      "publication_date": 20191023
    },
    {
      "title": "DO NOT BUY!!! Expensive Chinese made junk!!",
      "text": "Lasted 6 months then just like other reviewers said, the blue “low water” light came on when it was full of water. After reading others experiences with poor customer service, I took the machine apart myself. I am a licensed electrician, and after testing I discovered one of the relays on the circuit board was arcing and there was no power to the water pump or the condensing coil fan. Made from cheap Chinese components. Please learn from the experiences of others and DO NOT BUY THIS MACHINE!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 2,
      "publication_date": 20190217
    },
    {
      "title": "Only lasts a week",
      "text": "Started out great it made lots of great tasting ice for 8 days. It stopped making ice and needed repairs in less than two weeks. If it worked it would be a very good product, I'm very disappointed in this very expensive product . This is a follow up. After purging the machine it starting working again. Its really loud when making ice. Im hoping it will continue to work. I will let u know more as time goes on.",
      "rating": 1.0,
      "verified": true,
      "author": "valerie packer",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "Started making noise within first month!",
      "text": "Didn’t even make it a month before it started making a horrible noise every few seconds. Cant keep it plugged in anywhere in the house near people.... it’s that loud. It’s now useless unless we plug it in to the garage, and who the hell wants to go to the garage every time they pour a drink for ice? NO response or help from customer support, emailed multiple times. If you buy this and get a dud you're on your own. In hindsight I'd avoid this purchase like the plague.... as badly as I wanted this to work and the company to support it, they won't. Such a shame.",
      "rating": 1.0,
      "verified": true,
      "author": "CJ14559",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Too expensive to not work",
      "text": "The ice machine either less than a year. It was always hot on the side where the air flow came out which we found out later is not normal we contacted the company and they wanted up to pay $175 just to look at it. For what we paid for the machine in the first place, that is a ridiculous price. The customer service was little to no help. Do not buy this!",
      "rating": 2.0,
      "verified": true,
      "author": "jarred b pittman",
      "helpful_votes": 3,
      "publication_date": 20200416
    },
    {
      "title": "1st One I Received Didn't Work",
      "text": "I was so looking forward to getting this machine, but after hours of it just running water I realized it wasn't going to make any ice. I contacted Amazon who directed me to contact Firstbuild. Within a day of contacting them, they had a new machine on the way to me with a label to ship the broken one back to them. I've had the new one for 4 days now and so far so good. I will update this review if anything changes.",
      "rating": 4.0,
      "verified": true,
      "author": "Olives Mom",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "Big price tag, bigger issues",
      "text": "This machine checked all my boxes, nugget ice, small enough for our tiny kitchen, quiet. BUT we’ve had our SECOND machine for less than 2 weeks with the same issue. Rotating blue light, means fill with water- well basin is full and it’s not working. I’ve received a replacement from the company within the first 15 days of owning the machine and now 15 days with the new one and I’m having the same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Taryn Gaona",
      "helpful_votes": 3,
      "publication_date": 20191001
    },
    {
      "title": "NOT SOFT SONIC ICE",
      "text": "This machine makes very hard crystal clear ice, Not aerated soft Sonic style at all. I don't know if my machine is defective because it is slow to fill the bin so maybe freezing for too long??? I contacted support and Linda who is a 1st build support team member, told told me not to use the phone app and watch a youtube video on how to unpack and setup up the machine. WHAT A JOKE... I tried both with and without but there was no difference. I think you can break a tooth trying to chew this ice. SAVE YOUR MONEY, THIS IS NOT SONIC ICE AND CUSTOMER SUPPORT ONLY SAYS WATCH A YOUTUBE VIDEO",
      "rating": 1.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Honest Review! New Update. After a problem.",
      "text": "Great ice when it works. This machine was very temperamental and has some kind of malfunction weekly! Now it does not work at all. Stopped making ice completely. Contacted support and also did all the troubleshooting protocols and it still will not produce ice. Due to working during pandemic the ice maker was last on my list of things to take care of, So I dropped the ball. I finally had some time to attempt contacting customer support and within a couple of calls and one last try at trouble shooting they are sending a replacement with only one day of warranty left. Have to commend the customer service and their willingness to make things right. Kudos!",
      "rating": 4.0,
      "verified": true,
      "author": "RTH",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Makes the LOUDEST noises",
      "text": "We just bought this ice machine and were so excited to use it! It works fine, but makes the loudest noises! We have a 5.000 sq ft house and the ice machine in the kitchen on the first floor woke our whole family, several times during the night, who were sleeping up in bedrooms with closed doors on the second floor. Our dog even became agitated from the noise. So now we plug it in, make ice, put the ice in a zip lock bag in the freezer and unplug it! Ridiculous for a $400 machine! Save your money. This machine is not worth it! The noises will drive you insane!",
      "rating": 1.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 2,
      "publication_date": 20191014
    },
    {
      "title": "Third Machine - Broke within Week",
      "text": "I love the ice. The first unit lasted about 6 months, the second unit - 3 months, and the last unit lasted not even a week. They've replaced the unit each time without any hassle but bottom line it starts making major amounts of noise, the controls stops working properly, and it stops making ice. The third replacement unit was worse than any others in terms its operation. We received our fourth replacement unit and it currently working great! As I said -absolutely love the ice. I'll keep you posted!",
      "rating": 3.0,
      "verified": true,
      "author": "Cathy Cilek",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "Warning!  This item is not returnable to Amazon for any reason.",
      "text": "My Opal ice maker made ice painfully slow for a while and then stopped working altogether after just 3 weeks. Amazon will not accept returns for this product as it is considered hazardous because it contains refigerant. I am left dealing with the manufacturers warranty and a non-responsive manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. BeanCounter",
      "helpful_votes": 3,
      "publication_date": 20190824
    },
    {
      "title": "Better than expected performance",
      "text": "I was a little scared away by some of the reviews, but this has been a pretty great purchase. It is loud, but it makes lots of ice that everybody loves. Using gallon jugs of purified water from the store, I haven't had the problems of clogging others have experienced. I would recommend using only filtered or purified water, since I can understand how the lines could easily become clogged.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Thigpen",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "So far so good",
      "text": "I just set this up, cleaned it, we went to he movies, and came back with ice waiting for us. I will use their cleaner so I don’t use bleach. I put in filtered water from the fridge and used their filter as well so the ice is crisp and clean. I will be adding the reservoir tomorrow. Edit: definitely get the reservoir and the tasteless cleaner they sell. Every month or so, clean the unit. We’ve found that machine noises are minimized when keeping the reservoir at least half full. We also use the filter they sell. We fill our reservoir from our fridge which has a filter as well. The ice has a perfect taste.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Good While it lasted",
      "text": "Bought this on Amazon late October 2017. My wife and I loved this little ice maker. Recently started squealing very loudly. It had been cleaned every other month with their prescribed cleaner. Reported the issue to First Build a week ago. They are very slow to respond. I have to call them to get them to respond to my email requests. I followed their other prescribed method of cleaning with undiluted white vinegar 2x. Result is still the same. The squeaking is just as loud as before. They have yet to resolve or offer any remedy. Just be a aware, while you may love this product, its durability and customer support are both very suspect.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan C Mathews",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "Won’t last!!",
      "text": "Would not waste a penny on this machine. We bought it and followed ALL directions. We cleaned it regularly, used the filter and used filtered water. It worked for two months and then quit pulling water up. Finally got through to customer service with one build. With providing a $300 deposit, they sent us a new unit. After following all set-up instructions again, it didn’t work. I called amazon and told them what happened. They gave me all of my money back and told me to keep the unit or throw it out. Whatever I wanted to do! Short version: amazon customer service is great. Product is junk!",
      "rating": 1.0,
      "verified": true,
      "author": "David E. Myers",
      "helpful_votes": 3,
      "publication_date": 20190316
    },
    {
      "title": "it doesn't make as much ice as it says it ...",
      "text": "it doesn't make as much ice as it says it will and it takes hours and hours to even fill the small canister. the second time using it, its making a loud squealing noise and I was hoping it was going to go away but 3rd time using it its doing the same. We had to put it in another room because its so loud. It was a gift to my husband and disappointing. I have been trying to get it returned but it's been frustrating and others seem to have the same problem..",
      "rating": 1.0,
      "verified": true,
      "author": "Hummingbird",
      "helpful_votes": 4,
      "publication_date": 20180705
    },
    {
      "title": "Loved it until it stopped working - completely!",
      "text": "I bought an opal ice maker on Feb 7, 2018. Didn't work, so returned and got another at no additional cost. I LOVE the ice. The ice is PERFECT for someone who likes to chew on soft ice all day. Yesterday, after cleaning the machine as directed (I clean it at least once/month) it stopped working. I've tried unplugging an replugging and toggling the ice/clean switch dozens of times. NOTHIING! Trying to find another brand whose reviews indicate more reliability. UPDATE: found a you tube on how to clean ice chute and it’s working again😊. You can search you tube for Opal First Build (built?) to find lots of good maintenance info....including to use distilled water.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "WILL NOT HONOR WARRANTY",
      "text": "Tore up after 2 months. Very expensive. Will not honor warranty because only receipt I have is from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "ray g evans",
      "helpful_votes": 5,
      "publication_date": 20190706
    },
    {
      "title": "Irritating noise and water leaking everywhere!",
      "text": "Love the ice! Groaning noises and water leaking all over my cabinets and floors from inside the machine! This thing cost me over $500 and I’m afraid it’s a fire hazard and will damage my house with the leaking water coming from the inside. OPAL: Money back or a new machine. Please!! I’m begging you! This is worse than absurd!",
      "rating": 1.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 4,
      "publication_date": 20180918
    },
    {
      "title": "For Me, It's Not Quite Sonic Ice, but still GREAT!",
      "text": "Makes the nugget ice quickly. More frozen than the nugget ice that Sonic actually produces. Theirs is very crush-able, while the Opal machine I purchased keeps the nuggets hard. Mine must be set to keep the ice more cold. That stated... I love this machine! I use nothing but Sparkletts bottled water to fill it. I do wish, however, that there was an instant/auto fill option instead of manually filling every other day. It would be easy to add on for the company making it. If they do, I would most likely purchase that as well. This is a great machine so far. Hopefully it will last a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt Kuhn",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "DO NOT BUY.  You will be sad",
      "text": "It's with deep sadness that our beloved ice machine also stopped working after 3 weeks of beautiful ice. I thought we would be different and maybe it wouldn't stop working like other reviewers had said. I thought we could take very good care of it and we would be different and have a long life with Opal. My wife literally wept as we realized this ice machine just....died. We are so sad and please read this review. It really does stop working even with OCD care and preparation",
      "rating": 1.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Ice is sooooo good",
      "text": "Read the reviews and had to think about this purchase. Well I am glad I made the purchase. Very happy and have great ice. Been using it for over a month pretty steady and no issues at all. Just to let you know this is a heavy ice make and that is nice since I do not want it moved around. Noise level is in my opinion nothing more that expected. I am sitting next to it as I write this and yes there is a fan sound but no louder that my dishwasher. I think this was a good purchase and love. Has a nice style and makes great ice",
      "rating": 5.0,
      "verified": true,
      "author": "kathleenga",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "HUMONGOUS DISAPPOINTMENT/NEVER AGAIN",
      "text": "I purchased this in May 2018. Initially, I was quite pleased, though the ice was never as small as Sonic ice. But it failed to work by Christmas of last year and it just sits on my countertop taking up space. I’m beyond disappointed. $500 down the drain. With that kind of a failed investment, I’ll not box it up or put it in the trash because my husband is furious that it failed. This company needs to remove it from the market until they get it right. I’m back to buying Sonic ice at $2.50 per bag, two bags a week!",
      "rating": 1.0,
      "verified": true,
      "author": "PattyAnne",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "only lasts a month after the 1 year warranty.",
      "text": "unfortunately my experience is that my device stopped making ice within a month of the warranty expiring. If you do the math I paid a lot of money per cube. If support helped I could give a better review.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob Smith",
      "helpful_votes": 2,
      "publication_date": 20200420
    },
    {
      "title": "This straight up doesn't make ice",
      "text": "I was troubled by earlier reviews suggesting poor reliability but was so in love with the idea of pebble ice I decided to chance it. The machine worked for 8 days, before inexplicably quitting. I'm trying to contact Opal now. I'll update this review to let you know how this works out. Meantime, don't bother buying. This is a great idea with poor execution.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff C.",
      "helpful_votes": 2,
      "publication_date": 20190227
    },
    {
      "title": "Not a reliable product!",
      "text": "Wonderful product...for 2 months. Now does not make ice nor does the water get cold. Should have listened to the online reviews of this ice maker before purchase! Now I have to go thru the whole warranty thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray C.",
      "helpful_votes": 4,
      "publication_date": 20190707
    },
    {
      "title": "So far so good",
      "text": "My wife has been dying for one of these since they were released. Picked it up during one of Amazon's after christmas flash sale which took the price down to a palatable level. It works well and the ice is awesome, just like Sonic, etc. A few small gripes in that it seems like the pump attempts to run for an extended period once the tank empties before it prompts to fill water....one can only wonder how that affects the pump's lifespan. Quality is great overall and it's one of the best packaged items I've bought in a long time (actual plywood reinforcement in the box). Hoping that the lifespan is more than what some have reported.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Our favorite purchase!",
      "text": "One of the best things I have ever bought on Amazon. The ice is super yummy just the right shape and size for chewing. If you like pellet style ice this will five you satisfaction.super easy to use my 11 year old can clean and fill it with ease. My only complaint is I wish it had a larger capacity as my family inhales ice and we always want more, luckily it makes it fairly quickly but if they made a bigger one we would buy it in a minute and my husband would take this to his office. I have two friends who bought one after trying ours. You won’t regret this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Cristin",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "LOVE the Ice....  HATE the Noise!",
      "text": "I would buy it again... and we absolutely LOVE the ice. It's perfect chewable ice. However - the machine makes a horrible squealing noise while it's making ice. (Almost sounds like the ice is Screaming. LOL) It isn't continuous... it happens about every 10 to 15 seconds. We have the machine in our kitchen - so the only time we really hear it is if we are hanging out in the kitchen or dining room. It's really annoying. But the ice this machine creates makes it totally worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa S Hewitt",
      "helpful_votes": 0,
      "publication_date": 20190331
    }
  ],
  "product_meta": {
    "title": "Opal Countertop Nugget Ice Maker",
    "description": "You’re familiar with “the good ice.” Those soft, yet crunchy nuggets - almost like tiny snowballs that float in your favorite beverage. It’s the ice that determines which gas station you stop at, or which restaurant you go to, because you never forget where you can find it. It’s the only ice that’s ever excited anyone enough to shout across a crowded room, “Yes! They have the good ice here!” Finally, you can have the good ice anytime you want it, with The Opal. Unlike other nugget ice-makers that start at $2,000 - $3,000, the Opal is the affordable “good ice” maker for your home that you’ve always dreamed of.",
    "rating": 4.1,
    "feature_bullets": [
      "COUNTERTOP SIZE - With its elegant design, the Opal will wow your guests before they even try the delicious ice it makes. Measures at 15.5 x 10.5 x 17.2 inches - The perfect size for any countertop in your home. Installation Clearance - 3 inches, sides and back",
      "QUICK AND POWERFUL - Within only 20 minutes, you?ll be enjoying soft, crunchy ice, just like the ice you love from your favorite restaurant. The Opal produces 24 lbs of ice per day, and the bin holds 3 lbs at a time",
      "SMART - The Opal is bluetooth equipped, so you can set up your ice making schedule from the convenience of your phone using the free FirstBuild app. It senses when the bin is full of ice, so it won't overfill",
      "Water Quality - Use potable water only, 12 gpg (205 ppm) or less mineral hardness",
      "Operating Temperature - 55°F - 90°F",
      "WARRANTY - All Opals purchased directly from FirstBuild or authorized resellers have a limited 1-year parts and labor warranty",
      "PORTABLE - No water hookup required, just plug it into any 120v grounded (standard) electrical outlet and fill the reservoir with water. As ice melts, the water returns to the reservoir, where it will simply be made back into more ice. Reservoir Capacity - 2.5 quarts"
    ],
    "specifications": {
      "Brand Name": "FirstBuild",
      "Model Info": "Opal01",
      "Item Weight": "44 pounds",
      "Product Dimensions": "15.5 x 10.5 x 17.25 inches",
      "Item model number": "Opal01",
      "Is Discontinued By Manufacturer": "No",
      "Capacity": "3 Pounds",
      "Installation Type": "Counter Top",
      "Part Number": "Opal01",
      "Form Factor": "Stand Alone",
      "Color": "Stainless Steel Wrap with Black Accents",
      "Voltage": "120 Volts",
      "Connector Type": "Portable ice maker; self contained",
      "Door Material Type": "Plastic",
      "Material Type": "Stainless Steel, Plastic",
      "Included Components": "Opal Icemaker, Ice Bin, Ice Scoop, and Drip Tray",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0751KDVTP",
      "Customer Reviews": "4.1 out of 5 stars2,715 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#337 in Appliances",
      "Date First Available": "August 22, 2017"
    },
    "categories": [
      "Appliances",
      "Refrigerators, Freezers & Ice Makers",
      "Ice Makers"
    ],
    "price": ""
  }
}