{
  "website_summaries": [
    {
      "verdict": "Fashionable gloves that are great for kids who spend a bit of time outdoors in the winter. However, these are not designed for lengthy wear in the bitter cold or snow.",
      "pros": [
        "Stylish and extremely comfortable to wear",
        "Cool snowflake design on acrylic knit material",
        "Warmer than gloves made of similar materials, as they are lined with wool"
      ],
      "cons": [
        "Though they have touchscreen fingers, it's still a bit difficult to use them on some screens",
        "Not waterproof"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Soft and thick",
      "text": "I bought these for a low-income school class we sponsor at work. I wanted the kids to have some thick, warm gloves for the Cincinnati winters, but didn't have a huge amount of money, and these were great. I loved the colors--they'd match a lot of the kids' coats--and they are really thick and warm. 2 of the pairs I received had holes in them, but Amazon was nice enough to send out a few replacement pairs so I was able to give some extras to their teacher in case someone lost theirs. These are really nice gloves for this price; I would definitely buy a pair for myself, too.",
      "rating": 5.0,
      "verified": true,
      "author": "rlynd",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Soft, fluffy, ok warm, and mostly work for texting.",
      "text": "Soft, fluffy and ok warm. They are stretchy and do fit my very small hands. They do work on my phone's touchscreen, but they aren't great at it and aren't super specific about touching small letters to type. I sometimes have to repeat gestures or presses multiple times. They also aren't really as warm as I was hoping. But they are definitely a good step up from my previous kids stretch/magic texting gloves. It's not easy for petite adult women with little hands to find decent texting gloves that fit, work, are fairly warm and aren't really expensive. These fit the bill. I wish they had more colors for my nieces.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Vicino",
      "helpful_votes": 2,
      "publication_date": 20180329
    },
    {
      "title": "Son loves them",
      "text": "My son has been losing gloves left and right this winter. I needed to get him a pair that was warm and durably but not overly expensive. For the price these are great. He said they are nice and warm, even while playing in the snow at school. I was worried the snowflake on them would make them to girly for him, but he assured me they are manly looking also. Can not beat the price for warm winter gloves.",
      "rating": 5.0,
      "verified": true,
      "author": "Daphne B.",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Nice gloves, Not Useful For Electronics",
      "text": "They keep your hands warm. They don't work for the electronic devices. Yes, we followed the instructions and made sure fingertips were in the ends. So..as gloves...they work. As gloves with electronic usefulness, not so much.",
      "rating": 3.0,
      "verified": true,
      "author": "Maggie Black",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "My 8 year old granddaughter refuses to wear waterproof winter ...",
      "text": "My 8 year old granddaughter refuses to wear waterproof winter gloves. She loves these however and they're much warmer than the thinner gloves she was wearing. I'm buying two more pair in case these get lost!",
      "rating": 5.0,
      "verified": true,
      "author": "lfhandran",
      "helpful_votes": 3,
      "publication_date": 20180106
    },
    {
      "title": "Don’t work",
      "text": "The tech fingertips don’t work at all! I’m a woman with small hands and ordered these kids gloves. I fill out the length of the fingertips perfectly, except they don’t work! Warm and soft, though.",
      "rating": 2.0,
      "verified": true,
      "author": "NX",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Gloves unravel at alarming rate",
      "text": "These gloves were a perfect fit. Very excited for my purchase. They kept my hands very warm but the second time I wore them they started unravelling. Started at fingertip , then cuff then another fingertip. While they 'looked' finely crafted turns out they weren't made well at all and fast deterioration was the result. I won't purchase from mfgr. again.",
      "rating": 2.0,
      "verified": true,
      "author": "DebiDoW",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Good Quality Gloves",
      "text": "Purchased for my daughter for running. They are very thick, but a little too thick for our winter climate. Will they be used? Yes, maybe not so much for running though. Well made and will keep your hands toasty.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Small but thick",
      "text": "Thicker than I was expecting. Bought it for my average sized 10 year old son and it was too small. But it fit my very petite 9 year old daughter nicely.",
      "rating": 3.0,
      "verified": true,
      "author": "Cruisinmama",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "... for my 7 year old son and they are great, you can feel the difference as soon as ...",
      "text": "I bought them for my 7 year old son and they are great, you can feel the difference as soon as you put them on the warmth just hits your hands, I am seriously considering buying some for myself specially because you can still use your phone without taking off your gloves on those super cold days.",
      "rating": 5.0,
      "verified": true,
      "author": "vivian f mekhael",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Warm gloves, touchscreen fingertips feature usually work",
      "text": "Great fit and kept her hands \"nice and warm\" when we went to visit family in 30 degree weather. Only negative is while the fingertips work on the phones/tablets it usually takes a couple attempts for the devices to recognize the touch.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Heavy knit gloves",
      "text": "I bought these as a gift for a child I do not know. The gloves are attractive and seemed heavy and warm. I was happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Soft and warm",
      "text": "These were so warm. Really loved them until my puppy managed to jump up and grab one out of the mitten bin and destroyed it. Only four stars because they're quite big for a kid (I'm a grown woman. Do I have the hands of a 7 year old or do kids have huge hands?) and the touchscreen capability was a little wonky.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Oneal",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great for small adult female!",
      "text": "I'm an adult woman with small hands and gloves are always too big for me so I tried these and they're perfect and so warm. I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Westbrook",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great for kids who won’t wear big gloves or mittens",
      "text": "My son won’t wear big gloves or mittens these are great he loves them I have bought two pairs so far great price too and size was perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie Gordon",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Very warm. They were a St. Nick gift ...",
      "text": "Very warm. They were a St. Nick gift for my 9 year old. He says that they DO allow him to use his phone with them on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171211
    },
    {
      "title": "Great quality",
      "text": "Thicker gloves, but my kiddo could still use her hands great. They dont soak through quickly in the snow.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Warm gloves for skating",
      "text": "My figure skater has had cold hands while on ice. After trying number of different gloves, LETHMIK seems to be doing the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellina V. Liptsen",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Well made but......",
      "text": "Perfect for my short fingers ( that's why I order a kids size)plus are well made and keep my fingers warm. To type on the cellular phone is not acute enough that's why I gave it 4 stars",
      "rating": 4.0,
      "verified": true,
      "author": "Sincerely Mory",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "My daughter loves these!",
      "text": "My daughter has LOVED wearing these outside for recess. They are comfortable for her during the cold, chilly mornings and breezy afternoons in the fall. I'm not sure how they will fair when they get wet from snow, but they have been great so far with the cold fall air.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Lenhart",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Very warm",
      "text": "My daughter loves these. They are very warm and cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Deirdre P.",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "They run smaller than expected",
      "text": "Nicely made gloves. Too bad they run smaller than expected. I had to return them.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Steinkoenig",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "This is the only pair of gloves my grandson hasn't ...",
      "text": "This is the only pair of gloves my grandson hasn't lost and he says it's because he likes them so much he makes sure he puts them in his jacket pocket when he takes them off. Fit well and keeps him warm",
      "rating": 5.0,
      "verified": true,
      "author": "kathleen a waterman",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "There was a hole in one of the finger and it looks like a knitting defect",
      "text": "While soft on the inside, There was a hole in one of the finger and it looks like a knitting defect. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Thicker glove",
      "text": "Fits my 6 and 7 year old girls great! These are a thicker little glove which is what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Five Stars",
      "text": "Love, love these. Keeps my G-son nice and warm. Abel to use his cell,",
      "rating": 5.0,
      "verified": true,
      "author": "Ingeborg Cohen",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Very warm gloves for cold but not freezing cold weather",
      "text": "Very warm! But not for freeezing cold weather.. But good. The touch works great. Satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela J. Kortright",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Fitting is great!",
      "text": "Love the size fitting. I have small hands, so this worked perfectly! Love the lining on the inside. Only concern is not sure if it will start shedding, or not be as lush after a wash.",
      "rating": 5.0,
      "verified": true,
      "author": "rash",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Nice warm gloves",
      "text": "Not waterproof, but my grandson loved them and they kept this Florida Boy's hands warm.",
      "rating": 5.0,
      "verified": true,
      "author": "C Patterson",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Low Quality",
      "text": "I don't know if it is all of them or just mine, but they got a hole with only about a month of wearing them.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Prokop",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Lethmik makes awesome stuff",
      "text": "Great warm gloves at a great price. I really like this Lethmik brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Terrible. Trash after one use.",
      "text": "These are the worst gloves! My kids wore once and now can't even get their fingers back in them. The threading has loosened inside and make the fingers clogged with threads.",
      "rating": 1.0,
      "verified": true,
      "author": "Liza Pettingill",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "These so far have been the best and have kept his hands warm",
      "text": "Got these for my son to ride his bike to school every morning. These so far have been the best and have kept his hands warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin A.",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Big",
      "text": "Way big for my 6 yo. Fits me (mom) perfect. I have very small hands. So now they’re mine.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Theede",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Not super stretchy at all",
      "text": "Were small on my 7 years olds hands without the advertised stretch. the look is nice and feel is cozy, but i had to give them away.",
      "rating": 2.0,
      "verified": true,
      "author": "Talia",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Love them. With all the arctic weather we have ...",
      "text": "Love them. With all the arctic weather we have experienced in the northeast they kept my hands warm and comfortable and were worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda DeBonis",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Loved it!",
      "text": "Very comfortable and warm.. bought it for my 10 years old daughter and fit very well, loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "M&M",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Nice and warm",
      "text": "Nice thick gloves for winter to keep warm. Good purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Skarzynski",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "One Star",
      "text": "They are way too big, the description says CHILDREN but they are even big on an adult",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Actually works for texting",
      "text": "Kids love them, and they actually work for texting (which is huge for them - or kids in general)! Will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Great warm gloves",
      "text": "Super warm and soft gloves. Love that you can text with them on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "these are large enough for a woman's hand, so ...",
      "text": "these are large enough for a woman's hand, so not really for a small child. Very, very warm and thick.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramazon",
      "helpful_votes": 0,
      "publication_date": 20180420
    }
  ],
  "product_meta": {
    "title": "LETHMIK Kids Winter Knit Gloves Children Wool Lined Warm Glove with Touchscreen Tech",
    "description": "PRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :7.3 x 4.3 x 0.6 inches; 2.08 Ounces\n * Item model number :knit gloves kids\n * Department :Boys\n * Date First Available :September 8, 2017\n * ASIN :B075G9J96V\n\n * Amazon Best Sellers Rank: #447,770 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #60 inBoys' Cold Weather Gloves \n   \n   \n\n * Customer Reviews:4.4 out of 5 stars100 ratings",
    "rating": 4.4,
    "feature_bullets": [
      "100% Finest & High Quality Acrylic and Super Warm Wool Lining Material.",
      "Imported",
      "IMPORTANT NOTE and TIP - Please NOTE that Wearing This Pair of Gloves, Please MAKE SURE to wear to the top of Each Finger, especially the 3 Touchscreen Fingers, must be filled with our fingers, so that this Touchscreen function will be Very Effective, Otherwise it might be Ineffective. Please Try to wear this gloves in the Right Way, the Touchscreen function can be Normal.",
      "LETHMIK Kids Winter Knit Gloves Children Wool Lining Warm Gloves with Touchscreen Tech; Design for Kids from 7 to 13 years old, Item Weight: 2.1 oz, very soft and comfortable winter warm knit gloves, there are 3 colors for you to choose. Hand Wash or Spot Clean Recommended! Please Try Not to Machine Wash or Brush Wash (In order to avoid Pilling).",
      "The Unique and Practical 3 Touchscreen Fingers Capability design, very Convenient and Great for Texting/Typing/Writing in cold winter; Comfortable and high quality Magic gloves material with excellent elasticity, Stretches to fit most Children's hands, Children can easily get a custom fit according to their hands. Pair off with their favorite Outfit. Let's go outdoors with LETHMIK.",
      "MIX KNIT SNOWFLAKE DESIGN & WARM WOOL LINED - The Mix knitted workmanship and Snowflake pattern design, Build a unique and stylish Knit Construction style, super soft and warm wool lining design, it will be very suitable for Fall and cold Winter, provides your kids with Warmth, Comfort and Softness. It's an excellent choice for Gifts or Your Own Kids Dressing. Buy more for your friends' kids and family.",
      "LETHMIK is not the cheapest, but it is the best. You can feel free to contact us, if you would have any questions. LETHMIK - \"let's make it\" . Scroll down to the Product Description for more detail."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.3 x 4.3 x 0.6 inches; 2.08 Ounces",
      "Item model number": "knit gloves kids",
      "Department": "Boys",
      "Date First Available": "September 8, 2017",
      "ASIN": "B075G9J96V"
    },
    "categories": [
      "Accessories",
      "Cold Weather",
      "Boys",
      "Clothing, Shoes & Jewelry",
      "Gloves"
    ],
    "price": 9.95
  }
}