{
  "website_summaries": [
    {
      "verdict": "An efficient buy for professional adults seeking the useful accessory of a phone ring as well as a reliable car mount.",
      "pros": [
        "Crafted with zinc alloy for sturdiness and silicone for ultra-friction when using the kickstand",
        "Includes a magnetic car vent mount for ease of use when driving",
        "Car mount and ring have an exceedingly effective adhesive"
      ],
      "cons": [
        "The product is not reusable, as some other models are",
        "Customers wish it was made from more durable materials"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this product",
      "text": "I would absolutely buy this product again, I love this product. I have owned it for six months without any issues. It stuck well to my plastic case, & it did not come off. Before applying the ring to my rubber/plastic case, I used rubbing alcohol to ensure it was free of any oils, etc. As a side note, if you do not have the ring placed over the magnet on the air vent holder correctly, it will fall off. I found this a user error, not a product defect.",
      "rating": 5.0,
      "verified": true,
      "author": "Ternvegas",
      "helpful_votes": 4,
      "publication_date": 20180326
    },
    {
      "title": "Dual purpose",
      "text": "Ok product. I have always used a pop socket but wanted to give this product a try. My fingers start to hurt from the metal ring after a short period of time. There is a silicone lining inside the metal ring but this doesn't help me at all. Other then it not being comfortable for my finger I love it. I am actually using it in my vehicle now as a sunglass holder. I stuck it the side of my radio and hang my glasses from it as well as loop my phone charger thru.",
      "rating": 3.0,
      "verified": true,
      "author": "MSparkles143",
      "helpful_votes": 5,
      "publication_date": 20180109
    },
    {
      "title": "Several problems",
      "text": "1. I put it on my case and it came off within several uses. I don't trust the adhesion strength on my case so I superglued it. 2. The ring is great until the strength of it becomes loose. It usually break within a year so that's pretty good. 3. The magnet is useless because it doesn't work for my car. The air vents are angled so it's impossible for me to look at my screen. 4. The magnet is not removeable so I can't do wireless charging. It's still overall great. I bought this twice and I plan on buying it again when it breaks. It's just that the adhesive glue is weak.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "LOVE IT!!",
      "text": "I did not order the spinner as most people seem to be reviewing mine is the black plate with the ring and the magnetic car vent holder. I LOVE IT!!! Love the quality and the ring. I have not used the vent holder as of now. I am sure it will hold it very well. I love that I can move the ring in any direction I want to.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 3,
      "publication_date": 20171213
    },
    {
      "title": "It doesn’t stay glued on. After few minutes comes off!!!",
      "text": "It is very elegant design, zero quality!!! I cleaned back of my iPhone X and glued it on. It came off right 3 min later. After previous experience with Pop Sockets that I could glue them on again on another device, after using already once. I tried to glue this one again, left drying and not touching overnight. In the morning it came off as soon as I touched the handle. Very disappointed because I liked the look- mat black.",
      "rating": 1.0,
      "verified": true,
      "author": "Zeinii",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Simple and Sturdy",
      "text": "I've used this one my Pixel3A for a couple of weeks now. The whole piece is a good size, and looks nice and simple, which I prefer. The adhesive works well, and I haven't felt it budge yet. Overall, the ring itself is comfortable, but I would like it to move a little easier, which I'm sure will happen with time as the joints loosen up. For the price, it's a good little convenient accessory.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Kirk",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Sturdy design and dependable magnet grip for auto use.",
      "text": "Love this product. Thought the ring itself would be metal but don't think it is. Either way, it is well made and thr magnet mechanisms are very strong. Makes me feel like I have a really grip on my new Note 8 and able to prop it up for viewing movies or viewing content without phone the phone slipping. Looking forward to using it more in the car. Just wish it had better instruction. Other than that, great! Very very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara L.",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Good Phone Ring (Best choice for comfort on your finger(s) imo)",
      "text": "Correct item was received. Decided to buy this item because it is more comfortable than other phone rings when holding against your finger for X amount of time. Adhesion works as expected and was an easy install on my Smartish Gripzilla case for an iPhone 11 pro. Note: If you want to use a wireless charger with this phone ring, it may or may not work. I have the ring installed on a case on my iPhone 11 pro and I have to take off my case to use the wireless charger since the distance between the phone and charger is too far. So try it out if you are curious.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great buy— well it was. ..",
      "text": "Love it, exactly what I was looking for and works as expected. Strong magnet works well with my dashboard mount. Have had for over a month and see no issues. Update: worked great for over 8 months. When it finally broke, I was okay with it, figured I got my money out of it. I ordered another one that didn’t last a week and is now broken. Just like others pics have shown, key ring snapped right off. I’ll be returning and updating my stars from 5 to 2.",
      "rating": 2.0,
      "verified": true,
      "author": "jamie m.",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Great ring stand/ holder for cell phone case",
      "text": "This ring stand works great, it’s stuff and not floppy, comfortable and works exactly as advertised. The glue/sticker on back does not stick to a silicone case - you will need silicone glue for a good attachment.",
      "rating": 5.0,
      "verified": true,
      "author": "LuuFamily",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "ToTAL CRAP",
      "text": "Within 1 hour the ring part fell off, they send \"instructions\" but it doesn't tell you that you don't need the extra metal plates they send, I put one of those on and it has now ruined my brand new case because it does NOT come off unless you use a knife. the picture shown has a small magnet that attaches to the cvent but it is much larger and you have to flip the ring up for it to stick. That is not in the instructions either. Thanks for wasting my money and my brand new case! AWFUL PRODUCT - better to save money and get a quality product at the dollar store",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "The key ring kick stand is good and doesn't loosen up over time",
      "text": "The magnet is strong enough to hold my phone (Galaxy S9). I was worried it would not hold up well. The key ring kick stand is good and doesn't loosen up over time. The only complaint I have is how it positions on my air vent. The phone completely covers the vent so I can't feel air coming through, and with the design, I don't have other options to move it on the vent to another position.",
      "rating": 4.0,
      "verified": true,
      "author": "SLW",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Don't Trust The Adhesive",
      "text": "I followed the instructions for the adhesive ring to the letter. It stayed on for about 5 months. But as I was holding my phone by the ring next to a pool, the adhesive gave out and my phone fell on the pool! I had to buy a new phone because of this product. 700 bucks down the drain. Don't trust it!",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa J Maxwell",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Great ring holder, love it",
      "text": "Have used several rings, this has the best feel I’ve found, and so far it’s quite tight and holding up. The addition of the rubberized lining is key to the comfortable and more secure feel of the ring, and the 3M adhesive is very strong. It attached to my hardened plastic VASS Audio enhancing case.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Michel",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Complete fail. The whole magnetic concept is just a ...",
      "text": "Complete fail. The whole magnetic concept is just a fail to begin with it. When it’s time to remove he phone from the magnet the entire piece comes off with the phone. The piece you put into the air vent is always a struggle and keeps falling off even while driving. I just completely gave up on this product al together.",
      "rating": 2.0,
      "verified": true,
      "author": "Tobi",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "It is so easy to hold my phone and not worry about my ...",
      "text": "These little rings seriously changed my life! It is so easy to hold my phone and not worry about my fingers locking up trying to hold my phone. This ring moves smoothly, and it's easy to use and install. The sticky part is very strong so I don't have to worry about it coming off. Everybody who has a smart phone needs one of these",
      "rating": 5.0,
      "verified": true,
      "author": "niki",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Very nice.",
      "text": "Gift for my mom. She was excited and says it is very comfortable for her. (Arthritis problems with hands.) She also likes having it where she can just grab it, in her vehicle. Makes things easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Solid",
      "text": "I've tried other rings and this one is much better. It's sturdy & lasts a long time. Additionally, because it is metal you can use it with magnetic phone mounts",
      "rating": 5.0,
      "verified": true,
      "author": "Kira",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Easy to handle and dash mount",
      "text": "Makes it easy to handle the phone, and the vent magnet it pretty strong and doesn't fall off. Edit: about 3 months later the swivel loosened and would not stay in place. At 7 months, the swivel fell off",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff A",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Pretty good, does exactly what it says and looks ...",
      "text": "Pretty good, does exactly what it says and looks just like the picture, I tried buying this for my bf but he has some android phone that’s curved on the back so it doesn’t really stick, but it’s perfect for my iPhone",
      "rating": 4.0,
      "verified": true,
      "author": "Alisha Levine",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "It's ok",
      "text": "The finger part is great how ever the car mount magnet is weak. Your phone falls at the slightest bump in the road.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon Adams",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "So far so good!",
      "text": "Been using this item for four months, I love it! I don’t use it as a stand as much as a safer way of holding my phone as well as using in the car, hands-free.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "One of the best holders out till today",
      "text": "Bought 3 of them. 1 for my phone and 2 for my mother. Of the 3 mine broke but that was after about 2 years of use. The glue is strong and the holder itself is quality. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Kennedy",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Perfect for Phone",
      "text": "Love being able to have my phone sit up. Holding my phone became easier after attaching this item.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Reeves",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Just a heads up",
      "text": "I love this product but all I have yo day is be careful when opening it and taking the car mount out. I cut my finger open on the magnates that come with it. I had no idea that would happen but it did. Other then me cutting myself the product works great!",
      "rating": 4.0,
      "verified": true,
      "author": "Kuki",
      "helpful_votes": 2,
      "publication_date": 20171117
    },
    {
      "title": "I just got this item and I love it. It's great as a stand with the ...",
      "text": "I just got this item and I love it. It's great as a stand with the little rubber stopper. It allows me to not drop my phone and the adhesive is strong enough to adhere 2 my phone case. The magnet strength has held my phone in place with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemarie Sapla-Bahner",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Move over fidget spinner!!!",
      "text": "I love this spinner so much it keeps me calm and now I don't always feel the need to look at phone since it keeps me busy! It's also a great stand made so sturdy and I've had it for a long time zero rust and hasn't come apart!!! I will def get another if I ever switch cases",
      "rating": 5.0,
      "verified": true,
      "author": "VampyrSlayer",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Disappointed",
      "text": "Had this product not broken two weeks into using it, I would posting a 5 star review right now. This ring felt sturdy, was low profile and conveniently easy to use to hold your phone in your hand or position it on a desk/table. However, I was literally just positioning the ring to slide my finger through, like I had done several times before, when the ring broke away from the adhesive base. Thankfully I had hold of my phone or it would have been on the ground. I’m really disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "jayrnkck",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Not compatible",
      "text": "These don't stick on my case with a crosshatching pattern, at all. These do seem to stick well on a smooth clean surface.",
      "rating": 2.0,
      "verified": true,
      "author": "Shelli Martin",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Didn’t last very long",
      "text": "Didn’t last long. Stuck to my phone for 3 weeks then fell off.",
      "rating": 2.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "I really like it. Really hold phone in place",
      "text": "I use this daily. I really like it. Really hold phone in place. The magnet is really strong and the phone stays in place. Easy install. I recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Parks",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Megnet very strong",
      "text": "Magnet holds my phone plenty good, even with large case and three credit cards. However, sometimes the piece that attaches to the phone case becomes unstuck and I have to push it back together. Have not tried the replacement glue that came with the kit, so maybe that will work better. Overall happy with purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Estes",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Secure",
      "text": "I love this thing! The glue sticks great so it doesnt slide around on the case. I like that it comes with an extra sticky piece so i could switch it to a different case!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Simple and it works",
      "text": "Simple, yet it works. Once ya have one, it hard to go without",
      "rating": 5.0,
      "verified": true,
      "author": "Zigma",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "You need this",
      "text": "This is a great multi-functional product. I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Hall",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Good magnet and holds in place",
      "text": "Good magnet and holds in place. Had this for about 2 weeks and the ring broke off of the mounting. Would have been a 5 star if that had not happened.",
      "rating": 3.0,
      "verified": true,
      "author": "Love Iowa",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Great but inconsistent adhesive",
      "text": "Life changer for my phone which isn't easy to hold in my big hands. However the adhesive comes off and I have to put it back on at times.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael J. Maloney",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Didn't even last one month",
      "text": "This product at first did the job. I had no problems with comfort. The glue held for the most part I did have it fall off once or twice after holding it for a long period of time. The key ring kick stand WILL loosen up over time. After less than a month it now swings freely with no resistance.",
      "rating": 1.0,
      "verified": true,
      "author": "Francisco Tovar",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "The first one worked great for a month and then slowly lost tension in ...",
      "text": "I have bought 2 of these and both have broke within the first 2 months of using. The first one worked great for a month and then slowly lost tension in the ring making it flop around non stop. The second one only lasted 3 weeks before the ring ripped right off.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Works great",
      "text": "Super cute and very easy to use I still think I like a pop socket better",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "a little awkward",
      "text": "maybe I'm just not used to having a ring holder when I use to have a popsocket, but this is kind of an awkward gadget to hold. I don't know where to properly place it to where I can hold it properly and not have it slip out of my hands. it's placed in the middle of my case, but if I set it lower it won't be able to keep its balance and it's again just awkward to hold.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Love ring mounts",
      "text": "Love ring mounts! I put a hook on my cubicle wall and can hang my cell phone from it.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Harrell",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Three Stars",
      "text": "it is ok, couldn't stick on my phone case very well, sometimes will fell off.",
      "rating": 3.0,
      "verified": true,
      "author": "lily",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "At first I loved it. Less then a month later the ring ...",
      "text": "At first I loved it. Less then a month later the ring has become loose and won't work as a stand. The adhesive is also loosing strength.",
      "rating": 2.0,
      "verified": true,
      "author": "Tiff and Phill",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Small but resistent",
      "text": "I love it. I have a big phone. And I had bought a bigger stand but could not hold my phone always falling off. But this holder I love it it is small but can resist more weight than others.",
      "rating": 5.0,
      "verified": true,
      "author": "Haylee Sahori",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "This works very well but I use docking station for ...",
      "text": "This works very well but I use docking station for my phone. There is no place to put the device on the back of the phone that doesn't interfere with the charging.",
      "rating": 4.0,
      "verified": true,
      "author": "reCounter",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Worked great until the stand broke",
      "text": "I am a fan of this product and have purchased multiples for me and my family, but my latest one just broke in less than 3 months of usage. The ring stand no longer works and is flimsy/loose. :(",
      "rating": 2.0,
      "verified": true,
      "author": "Q",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "AWESOME!",
      "text": "I love my ring!!!! and the magnetic holder for the car is very handy. The ring allows me to maneuver my phone without dropping it!! Best idea!",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Ring goes bad after heavy usage. Won’t stay steady but will only work to hold phone for selfies.",
      "text": "Love the ring, bought a few times When the steadiness starts to go bad after a year which makes sense after the usage and abuse. Love the thinness and the rotation of the ring from others. Always bought again.",
      "rating": 4.0,
      "verified": true,
      "author": "missy",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Loved it, for a month...",
      "text": "But yesterday it quit \"holding\", as in the ring is still there but is no longer tight and can be used as a stand! I am very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Block",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "3 Month Lifespan",
      "text": "Worked perfectly for 3 months! Then broke. Purchased another as back up. Gave it to my sister. Hers also broke after 3 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Waste",
      "text": "Its ok not too good. Does not stick good and comes out very easily. The magnet is useless. Dont waste yr money on this buy something better",
      "rating": 2.0,
      "verified": true,
      "author": "Laghima Shrestha",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Still works!",
      "text": "I ordered this a year ago and it still works! I was worried when it became a bit loose but it is fine. I bought one for my mom and she moved the ring twice to different cases and it is still working perfectly! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Great but only lasted 5 weeks",
      "text": "I really liked it until it broke 5 weeks after I got it",
      "rating": 1.0,
      "verified": true,
      "author": "Amy LJM",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Nice looking and affordable",
      "text": "I discovered today(11-17-18) that the grip on the ring portion is tight enough to grip behind a surface and prevent the device from falling. I'm sure it won't stay this way with extended use, but it's kinda cool.",
      "rating": 4.0,
      "verified": true,
      "author": "John Mynard",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "not worth",
      "text": "Pros: easy to use; adhesive is strong; attractive Cons: feels cheap; metal plate inside is too small to have a strong enough bond to a magnet; ring is flimsy but quality appears to vary because we bought 2 and the ring on one was more loose and easy to turn than the other",
      "rating": 2.0,
      "verified": true,
      "author": "Priscilla Ngo",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Works great",
      "text": "Works great. I was happy that I was able to remove it and reapply it.",
      "rating": 5.0,
      "verified": true,
      "author": "K.R. Shen",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Arrived quickly",
      "text": "Basic and cheap, does the job, don't think it will last for a long time",
      "rating": 4.0,
      "verified": true,
      "author": "Tombstone Cowboy",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Three Stars",
      "text": "Doesnt stick well. Will start to slide around and fall off at times. Not that great",
      "rating": 3.0,
      "verified": true,
      "author": "Joe L",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Doesn't stick well",
      "text": "Not very sticky. Returned for a Spigen, which I love a great deal more.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "The ring became lose after a few weeks and I ...",
      "text": "The ring became lose after a few weeks and I can no longer use it as a stand for my phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Plummer-Ladd",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Sturdy and handy",
      "text": "Easy to apply and use. Sturdy and very handy in the car. Great value for price",
      "rating": 5.0,
      "verified": true,
      "author": "Sunmoon103",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Stop looking! This is it!!",
      "text": "I've only seen popsockets and I was excited to see this nifty invention. I love it and have no problems with it rather than just getting used to having it there! It is worth it and I have bought one for my whole family and am urging my friends to switch over to the ring! Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Another sad phone ring that pops out after a month of ...",
      "text": "Another sad phone ring that pops out after a month of usage. A shame because the rubber on the ring was good for extra grip especially when you want to stand up the phone. I will let you all know when I find one that doesn't break.",
      "rating": 1.0,
      "verified": true,
      "author": "Gamakun",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "One Star",
      "text": "Only had it 2 days and the adhesive has separated from the ring holder. Not usable at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Versatile",
      "text": "Love it, works for hold, standing and clipping to my purse",
      "rating": 5.0,
      "verified": true,
      "author": "Queenjn3",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Amazing phone ring! Super sturdy",
      "text": "I’ve had this phone ring for awhile now and it is by far the best one I have used. Still sturdy and still going strong. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nat",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Holder",
      "text": "Can't beat the price! Great fit for my jeep. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "yaniret",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "It broke 😕",
      "text": "It seemed like good quality, worked really well. But after a month, the ring broke off. Since it’s a little more pricey than other similar products, you would think it’s more sturdy at least.",
      "rating": 1.0,
      "verified": true,
      "author": "Pheap",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Kickstand becomes loose",
      "text": "The first month the kickstand worked great but then became loose and I couldn't use that feature any longer. Don't know if they sell a tool to adjust the screws to make the ring tight.",
      "rating": 2.0,
      "verified": true,
      "author": "Carmina",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "I was disappointed that the adhesive to attach to your phone lasted ...",
      "text": "This was exactly what I was looking for. However, I was disappointed that the adhesive to attach to your phone lasted for approximately a day. Thankfully, they give you an extra one. After I applied the extra one I haven’t had any issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Not too sticky",
      "text": "I had to super glue the ring to my phone case. The magnet is strong and holds to my car vent.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Quality product with good price",
      "text": "I am very happy with this holder. Holding in my hand, positioning on the desk, using in the car.. in all aspects. It has good grip and is easy to use. Material feels good quality",
      "rating": 5.0,
      "verified": true,
      "author": "seya",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "One Star",
      "text": "It fell off my phone only had it one week.",
      "rating": 1.0,
      "verified": true,
      "author": "tamika",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Let down",
      "text": "So disappointed, was working great for one week until the ring broke off",
      "rating": 1.0,
      "verified": true,
      "author": "Charlotte Mikeska",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Broke just after 1 month!",
      "text": "This is a terrible product. I've had it for 1 week over a month and the ring broke off the holder. I can't return it because the return window of 1 month is over. Would not recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Dragonflymom73",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Broke within 24 hours. Sticky back does not stick ...",
      "text": "Broke within 24 hours. Sticky back does not stick!!! Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Lasted about a week before it started swiveling and not ...",
      "text": "Lasted about a week before it started swiveling and not staying in one spot. Had it not been for that it would have been I would have said 5 starts",
      "rating": 3.0,
      "verified": true,
      "author": "Hilda Huerta",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "One broke affter 1 day",
      "text": "I'm glad it comes with three because after putting on the first SO aka screen protector broke after a day",
      "rating": 1.0,
      "verified": true,
      "author": "jj jr",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Breaks within a month",
      "text": "Do not buy!! I loved this product at first but the ring part broke and so now it is too loose and I can’t stand my phone up with it. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "I got this because I wanted to use it as ...",
      "text": "I got this because I wanted to use it as a stand for when I watch movies or tv on my phone. However, after having it for three weeks it no longer is firm and doesn’t work as a stand",
      "rating": 2.0,
      "verified": true,
      "author": "Will Rogers",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Two Stars",
      "text": "Bought one. Ring started getting lose & the sticky device eventually fell off. Tape wasn't sticky enough",
      "rating": 2.0,
      "verified": true,
      "author": "Kendall",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "well made product for the price.",
      "text": "Spins 100% accurately and is re usable better than the 3m adhesive tape",
      "rating": 5.0,
      "verified": true,
      "author": "PatJustice",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Doesnt stick! Useless!",
      "text": "Plastic ring is cheap and the adhesive is weak. It’s fallen off several times despite my best efforts. Don’t waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "pretty good",
      "text": "use this everyday. hasnt failed me yet. only problem is that its gets a little loose sometimes but still works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "ananias gebreab",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Gets loose",
      "text": "I love it, but it had become loose and it doesn't hold phone as well.",
      "rating": 2.0,
      "verified": true,
      "author": "benjamin curtis",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Annoyed",
      "text": "I received this September 18th. Today is October 1st. The ring just broke from the back. My thought when ordering it, knowing issues, was that not everyone who purchased these has written about issues. My thought now...some people don't come back to review the product after it breaks. Honestly though, it's rigid, becomes uncomfortable and then it breaks. The sticker backing did release easily, from my case, after it broke though, so there's that.",
      "rating": 1.0,
      "verified": true,
      "author": "MASkinner",
      "helpful_votes": 2,
      "publication_date": 20171001
    },
    {
      "title": "Three Stars",
      "text": "Loved everything except it loosened too fast. Great idea, hope I just got a defected one!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Doesn’t stick",
      "text": "I have an iPhone X I don’t use a case and I tried both of the adhesive pads and they did not stick, I could pull the ring off with a slight tug, wish it stuck better.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonas Buttke",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Good stiff swinging hinge and strong hold and easy comfortable rotation",
      "text": "The stick wasn’t enough with my oddly shaped case, but I used super glue to make it stick better. Works great. Again, I just have a weird case with an uneven surface.",
      "rating": 5.0,
      "verified": true,
      "author": "0zwin",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "fell off 10 minutes after putting it on",
      "text": "finger ring fell off 10 minutes after putting it on, i really like the design but it isnt durable.",
      "rating": 1.0,
      "verified": true,
      "author": "squidney",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy and great quality. Fits perfectly on my palm, would recommend to anyone that needs a ring stand.",
      "rating": 5.0,
      "verified": true,
      "author": "chrisyu",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Doesn’t stick to iPhone X",
      "text": "The actual ring is ok. I thought it was metal but just a plastic. Then the adhesive kept falling off. It came with a few replacement adhesives. And none of them held to my phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Broken in 24 hours",
      "text": "The ring broke after one day!!! Not a very strong product",
      "rating": 1.0,
      "verified": true,
      "author": "april hall",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "a comfortable and soft silicone ring inside the loop",
      "text": "Finally, a comfortable and soft silicone ring inside the loop!",
      "rating": 5.0,
      "verified": true,
      "author": "Alison B.",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Great kickstand",
      "text": "The kickstand has worked great with my new phone. It stays in place however I position it and never moves.",
      "rating": 5.0,
      "verified": true,
      "author": "JennIfer A",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Two Stars",
      "text": "it's ok and does exactly what it says but now my phone is \"bulky\"",
      "rating": 2.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "A tease",
      "text": "Did not last a week, broke right away. But was great while it worked",
      "rating": 2.0,
      "verified": true,
      "author": "gina hurst",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Great product at a great price",
      "text": "Great product at a great price. Design details, color, texture, all excellent. Back up adhesive and magnet included. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "kpesh",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Loved the comfort and style but now the ring is ...",
      "text": "Loved the comfort and style but now the ring is too lose and cannot use it as a kick stand.",
      "rating": 2.0,
      "verified": true,
      "author": "Alyssa  Garcia",
      "helpful_votes": 0,
      "publication_date": 20171219
    }
  ],
  "product_meta": {
    "title": "AOPETIO Cell Phone Finger Ring Stand Holder,[1 Set] Rotation Metal Round Ring Hand Grip Kickstand, for Magnetic Car Phone Vent Mount",
    "rating": 3.8,
    "feature_bullets": [
      "【Cellphone ring holder with magnetic car mount】: Provides two uses, not only you use these combination as a vent mount but can use the ring stand separately. More safe when you driving and hands free as car air vent holder.",
      "【360-Degree Rotation】:The ring swivels 360 degrees so you can view the screen portrait or landscape, also it can 180 rotation foldable and the ring grip holder include metal help to as a car mount when you driving.",
      "【Strong Magnetic Car Mount】: Air vent car mount phone holder is a compact and very useful mounting solution that fits easily into any vent in most vehicles. Work with horizontal, vertical and round-shaped air vent. Freeing your hands from mobile devices (smartphone, GPS and portable music player).",
      "【Material】:This cellphone ring grip stand holder construction from soft silicone eslatic and the hand hold ring with zinc alloy bearing to keep rotating sturdy, the adhesive of the holder kickstand rings is surprisingly strong.",
      "【Feature】: The phone ring stand is an efficient way of preventing your phone from slipping off your hands, the ring holder as a temporary stand when you place your phone or any other electric equipment on a table or any flat surface."
    ],
    "specifications": {
      "Package Dimensions": "3.8 x 2.5 x 1.7 inches",
      "Item Weight": "1.58 ounces",
      "ASIN": "B075H7C559",
      "Item model number": "5823796668",
      "Customer Reviews": "3.8 out of 5 stars489 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#92,678 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Colour": "Black/Black",
      "Manufacturer": "Mikwear",
      "Date First Available": "October 13, 2017"
    },
    "categories": [
      "Cradles",
      "Accessories",
      "Cell Phones & Accessories",
      "Automobile Accessories",
      "All Departments"
    ],
    "price": ""
  }
}