{
  "website_summaries": [
    {
      "verdict": "Despite the low price, this jump trainer is comfortable and includes 2 pairs of resistance bands.",
      "pros": [
        "2 pairs of high-quality rubber bounce bands, a carrying bag, and everything else you need to train are included in this set",
        "The belt and ankle cuffs are comfortable",
        "Bands have 35 lb",
        "of resistance",
        "Lightweight but durable"
      ],
      "cons": [
        "Some customers reported that their resistance bands snapped after some use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Strength and Flexibility: CHECK!!",
      "text": "This set is just perfect!! I have been a competitive dancer for 15+ years and have used products/dance accessories from A-Z, and these are by far at the top of my list!!! The stretching band is durable, comfortable, and easy to use. It absolutely improves my flexibility and strength, which, in turn helps with muscle memory; extremely important in all forms of dance. The leg stretcher strengthens my core with each use! Its great! Also durable and safe..I have had no problems with it...only improvement!!! This set is ABSOLUTELY AMAZING & COMPLETELY RECOMMENDED!!",
      "rating": 5.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 10,
      "publication_date": 20180314
    },
    {
      "title": "Easy to use/comfortable",
      "text": "Loving the product. After using this for the last month, I will be purchasing additional bands to use. Only recommendation is to make the straps big enough to use around quads and ankles, not just ankles.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando Cervantes",
      "helpful_votes": 9,
      "publication_date": 20190202
    },
    {
      "title": "Very clever contraption; excellent quality",
      "text": "I got this for my daughter for Christmas. She loves it! It has been very beneficial for helping her stretch. She has used it many times in the week she has had it and it is of very good quality. The pink rubber band is very thick and even though she has long legs, my daughter still has to put a knot in the band to make it the perfect length for her legs. Usually things are too short for her long legs, so the fact that this band can accommodate her makes her very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Compton",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Not a dancer, just a stretcher",
      "text": "I bought the stretcher band and leg stretcher to improve flexibility. I'm in my mid 40's, and since having a knee then foot surgery back to back, I have lost significant flexibility on that side. This kit has helped me to get some of it back, and I continue to work on it almost daily. The band can be a bit tricky at first, but stick with it, you will see an improvement as I did.",
      "rating": 5.0,
      "verified": true,
      "author": "mars71",
      "helpful_votes": 5,
      "publication_date": 20170306
    },
    {
      "title": "Disappointed!",
      "text": "Just opened these and both ankle bands are missing the under foot straps. Also one of the red resistance bands is broken. Was looking forward to using this, but no luck. Having to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Tate",
      "helpful_votes": 3,
      "publication_date": 20190103
    },
    {
      "title": "Fantastic product!",
      "text": "I bought this for my daughter, she dances and is trying to work on her flexibility. We couldn’t be happier with this bundle! The band is fantastic, and has really made a difference in her flexibility- getting her almost to her splits in just a week of using it! The stretcher used on the door is also really good and helping my daughter with her leg extensions! My daughter relays that she loves both pieces and is more motivated to work on her stretching every day using these!",
      "rating": 5.0,
      "verified": true,
      "author": "Just1",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Happy with my purchase",
      "text": "I like the idea of having the set of the band and leg stretcher. I found very helpful the guide of suggested exercises plus other tips. I carry the band with me and use it very often; I love the color. On the other hand, I found easy to place the leg stretcher in the door. Also, I like that it comes with a bag. I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 3,
      "publication_date": 20170220
    },
    {
      "title": "Awesome Products- love the bundle",
      "text": "I love this bundle. It's reasonably priced and super great for stretching. I am an adult dancer and have been dancing for about two years now and I'm really working to get my splits so this is perfect. The leg stretcher is especially easy to use, just close the door on the top part and you're good to go! It's a little hard to angle yourself for the specific stretches so you need to make sure you have a lot of room by the door, but once you get a routine down it's no big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170418
    },
    {
      "title": "Good quality and easy to use",
      "text": "I bought this set for my daughter to help her strech! She is a figure skater and she has to strech regularly to get better. This set is very good quality and easy to use. She used it within minutes of receiving the package. Also, customer service is excellent. I received the strech guide via email the next day.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Kay",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "But for a dancer who is familiar with the practice it's fine. The actual bands and pulley system are all ...",
      "text": "The product is exactly as described. The supporting book to guide you through the exercises could use some work. It's a little basic with no instructions about how to get into the stretches or what to do once you are in the stretch. But for a dancer who is familiar with the practice it's fine. The actual bands and pulley system are all great.",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie in Alaska",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Overall seems like a good product",
      "text": "This was purchased for my son for his birthday per his request. Seems to be like a great product however, it was missing an ankle strap and he has not been able to use this to its full capability. I will be returning this but purchasing the same product to give it another try.",
      "rating": 4.0,
      "verified": true,
      "author": "Kessa Erickson",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Love it!",
      "text": "I have been looking for these 2 tools for the year but I could not find a good price and I was happy to find both in one set at a very affordable cost. I love the product as it is high quality and the included manual is very helpful. No need to go online to find exercises. A special thanks to Angela L. for also including some instructions for warm up and safety precautions.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Two times the charm",
      "text": "My daughter takes several dance classes a year and she loves these stretching bands. The movers packed her other band so when we got to Grandmas house I ordered her a new one so she could keep up with her stretches.",
      "rating": 5.0,
      "verified": true,
      "author": "SassyJin",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "seems to be a great value item for this price",
      "text": "We've just got the product today; our daughter's so much excited about it hoping to improve her flexibility during the ballet routine exercises. The item is packet in a tiny little box that was really convenient for us as we got it shipped outside the US; seems to be a great value item for this price. The attached guide provides you with a great variety of different exercises. Hope the band won't get loose in time.",
      "rating": 5.0,
      "verified": true,
      "author": "Elie",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Five Stars",
      "text": "Love it, it's excellent for basketball training. Going to buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Esteban Salinas",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "did not come as a set- missing the leg stretcher",
      "text": "Gave this as a gift and when she opened it, only the pink band was in there. The second part of the set (leg stretcher) was missing. Pretty disappointed because I was going to purchase both individually until I saw that it was a set for a cheaper price. Should have just ordered them individually 😐",
      "rating": 2.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 3,
      "publication_date": 20161227
    },
    {
      "title": "just enjoy stretching and staying in shape and flexible so I ...",
      "text": "I have many resistance bands for stretching and use them every day. I have never had ballet, just enjoy stretching and staying in shape and flexible so I don't injure myself. This is a very versatile quality product. They also provide instructions and support.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Trash",
      "text": "My son is a skinny athletic 14 year old... these broke the second day. I am not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "ladyj216",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Best products to improve flexibility!",
      "text": "We love the leg stretcher. The door anchor makes it easy and simple and we can easily improve flexibility for performance. The stretch band offers the perfect resistance for improving splits and various stretches. The guide that came with it is so helpful in stretching poses. We are so happy with these products!",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie DiLiello",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Dance!",
      "text": "Perfect for stretching for dance classes or gymnastics or whatever",
      "rating": 5.0,
      "verified": true,
      "author": "rachel",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great Bundle Deal",
      "text": "My daughter said she loves the band, she loves the durability of it and how it allows her to stretch in different ways. The thing she dislikes about the band is the smell. It has a strong rubber band \"latex\" smell that she doesn't like during use but it washes away after use. So far she has had no issues and hope it remains that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Aylia Rossi",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Killer deal.",
      "text": "I like that it comes in a bundle - it's really an unbeatable deal, plus you get instructions and a discount for other products! The band feels very solid and well made. I've just started using it and will update as I get to experience it more.",
      "rating": 5.0,
      "verified": true,
      "author": "GG8",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Love it!",
      "text": "Love the band combo with the little book of helpful stretches. Great buy! I use the Ballet band everyday and when I have extra time the door strap that give me more stretch. This band is worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi S.",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "helps alot",
      "text": "I like this product and I think that the more I use it I will increase my vertical and get faster when I used it for the first time and took it off my legs were shaking and they felt like they were on clouds... perfect workout at home if you want to have stronger legs",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Increases my ability to stretch further",
      "text": "These has improved my stretching exercises. I use them daily. The booklet is very helpful in instructing new moves. I loved that it came with its own carry bag. Makes storing them easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Sniath",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "and perfect for stretching exercises",
      "text": "The product is high quality, and perfect for stretching exercises!!! I've trieda few different ones, but no one beats this one!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizasga",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Great bundle, perfect for stretches",
      "text": "This is a great set! The resistance band is the perfect width and strength for stretching. I previously had other resistance bands but they were too wide and they did not have a connecting loop so it made it really hard to stretch. The doorknob leg stretch works great, although it does hurt your ankle if you pull too hard on the band.",
      "rating": 5.0,
      "verified": true,
      "author": "S and K",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Five Stars",
      "text": "Great quality product. My daughter says it's easy to set up and use. Loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Good idea, but bad experience",
      "text": "My son used it twice and one of the bands ripped! I appreciate the product, but I need the support of an athlete!",
      "rating": 2.0,
      "verified": true,
      "author": "Jocelyn Toon",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Looks like what I need",
      "text": "The quality of the band is very high. It looks like it will last for a long time. I have had many exercise bands that break within a week or two of use. This is nice and thick. The Flex Max works great for stretching. I love the fact that it comes with a bag to keep everything together. The door hang is a great idea as well. I'll update once I have used it for a few months.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine Chittick",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Got it for my fiance",
      "text": "I got this for my fiancé for his birthday. He was the happiest with this gift, and I got him a damn video camera. He put it on and it seemed pretty simple to set up. He’s excited to use it when its warm out",
      "rating": 5.0,
      "verified": true,
      "author": "Molly ",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Keep up the great work.",
      "text": "I'm enjoying it. I knew I'd get my money's worth. Keep up the great work.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Resistance",
      "text": "The resistance is exactly what you need for leg and core workouts, after I was done felt like I was walking on air.",
      "rating": 5.0,
      "verified": true,
      "author": "JCorz",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "it probably won’t do you any good.",
      "text": "The stretch band is EXTREMELY long. If you’re under 5’7, it probably won’t do you any good.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer miller",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Excellent product",
      "text": "I really like this product I feel like it really helps me feel light on my feet when I'm running and jumping. Also the durability of the bands are very good I have not had one snap-on me yet",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "2 great items in one compact carry bag",
      "text": "Great quality items and fast shipping. Missing instruction booklet however customer service resolved the issue immediately...would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Facts is facts...",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Perfect!",
      "text": "love the packaging and bag that came with it! perfect quality and even the small sign for her door was a pretty great no us gift! safety first!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "I am a 46 athletic built and would like to start using my vertical bounce",
      "text": "I recently purchase the vertical bounce trainer a week ago. I was excited to start working out but come to find out the waist isn't big enough to wrap around my hips. What is the biggest waist size your company carry's? I am a 46 athletic built and would like to start using my vertical bounce.",
      "rating": 3.0,
      "verified": true,
      "author": "Luis A Vegerano Jr",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "Product is too small for me",
      "text": "I received the package and the belt was to small. I am a size 38 waist size and the strap barely can wrap around my body and the foot strap is too small for my foot ( I have a size 12.5 foot so just keep that in mind )",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob M.",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "I need additional hand straps instead of two prime",
      "text": "I thought I was suppose to have two more handle strips instead of two. I am a fighter and I am training and relly like this item. I don’t want to send this in for a return or refund I just need two more addition handles strapped please.",
      "rating": 3.0,
      "verified": true,
      "author": "Shawn Jackson",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Amazing Product!",
      "text": "Everything in the package came extremely neat and well packed! It was bundled together and extremely cute! I haven't tried it out yet, but the band seems thick and the material for the flex master is made of great material. I can't wait to try it out! Amazing product so far, thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Michenelle",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "One Star",
      "text": "Terrible stitching, 5 minutes of use and the leg straps came apart.",
      "rating": 1.0,
      "verified": true,
      "author": "Nathan Boehm",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Stretching guide is lacking",
      "text": "The band was purchased for my daughter. Shipment came as specified with both the ballet band and and the leg stretcher. My only disappointment was with the stretching guide. It had no instructions, only pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy L Witherow",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great quality!!",
      "text": "Great Deal! My daughter loves this bundle! It’s great quality and make stretching enjoyable!",
      "rating": 5.0,
      "verified": true,
      "author": "DER1984",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Broke after 3 uses",
      "text": "I had an athlete (about 130 lb girl) use this 3 times and it broke. The flap that held the clip in place ripped off. Not a good product.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn Savage",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "No good for short people!",
      "text": "Not well suited for smaller people. Bands were in the most awkward place on my hips and too long, I did not feel like I was getting good resistance at all. immediately returned this item.",
      "rating": 2.0,
      "verified": true,
      "author": "ML",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Nice product",
      "text": "My daughter is very pleased with the band. She says it has definitely helped increase her flexibility.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "My daughter was so excited to get these for Christmas ...",
      "text": "My daughter was so excited to get these for Christmas! She's a gymnast and a cheerleader and is needing to work on her flexibility a bit more. She's been using them everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Juarez",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "I'm getting so flexible",
      "text": "I have really poor flexibility and now thanks to this bundle I can work on my flexibility outside of class. This also comes with a really neat guide filled with great stretches.",
      "rating": 5.0,
      "verified": true,
      "author": "Zinny Bob",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Three Stars",
      "text": "My balance is terrible and limited instructions make the stretched hard to achieve.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Hendrickx",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Great company...great product!",
      "text": "I had originally ordered this set for my daughter just before Christmas. When the package arrived I was surprised to see the wrong item wasn't shipped. Contacted them immediately and they were more than happy and willing to correct the issue. I then received the proper item and my daughter absolutely loves it. Strong and works as advertised!",
      "rating": 4.0,
      "verified": true,
      "author": "G. L.",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Not enough !",
      "text": "Save your money. Not enough tension to make it work....",
      "rating": 1.0,
      "verified": true,
      "author": "LCJ",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Have been great for them",
      "text": "My kids use it to work in their gymnastics warming routine. Have been great for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Sonja",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Works and has good training suggestions",
      "text": "Strong product and contributes to hardening the muscles very much. Would like some more cabling in the basis product, but for now the two systems included are enough",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Package never tampered with",
      "text": "I love it. I love the time frame it was shipped. Thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Isaiah",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Just a big rubber band",
      "text": "Did not come with any instructions. Have no way of knowing how to set it up or were to tie it. Guess I should let my daughter just use it and then get a lawyer since there is no way of telling if you are doing any thing correctly",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "I love it! This works so well",
      "text": "I love it! This works so well! I've used it everyday since it arrived! I suggest everyone gets it! It will be worth it! Buy it right now you won't regret it! Trust me!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni Ennis",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Defective latex band",
      "text": "We got this product on time but one of the pieces came defective.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "GREAT COMPANY",
      "text": "Great company very easy to deal with great products the kids love it",
      "rating": 5.0,
      "verified": true,
      "author": "Craigd1087",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Excellent product!",
      "text": "We absolutely love the products! We still have to try them, but my daughter is absolutely head over heels!",
      "rating": 5.0,
      "verified": true,
      "author": "Sveta",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "One Star",
      "text": "I ordered 2 set and only got the pink band who do I contact",
      "rating": 1.0,
      "verified": true,
      "author": "Yvonne Villanueva",
      "helpful_votes": 5,
      "publication_date": 20161223
    },
    {
      "title": "I like the product but no clear instructions.",
      "text": "I like both the Band and leg stretcher. Helpful for a beginner. It would have been helpful if there was proper guidance on how to use the band. The book came with the product has no instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "S0122",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Five Stars",
      "text": "Love the kit and the little booklet is very helpful. Can't wait to improve my flexibility.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecily",
      "helpful_votes": 0,
      "publication_date": 20160529
    },
    {
      "title": "The belt is too small",
      "text": "love the bands, dont like the belt is too small",
      "rating": 3.0,
      "verified": true,
      "author": "lang",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "The other stretch band is good..",
      "text": "We found the pink stetch band is not fexible or schetch much. My 11 years daughter have hard time to pull it out and she could not do it ... too hard to pull out.. i am not sure if this is what it should be.. The other stretch band is good... We hang it by the door and my daughter practice every day.",
      "rating": 3.0,
      "verified": true,
      "author": "andy071999",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Five Stars",
      "text": "Great item! Fun and easy to use and pack up.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick johnson",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "... with using a band to stretch and it is easy to use and fun",
      "text": "I am a beginner with using a band to stretch and it is easy to use and fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Lory Lacy",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "Cute and does the job! Would recommend to anyone",
      "text": "Does the trick in my objective, to improve my flexibility. I love that it comes in a cute pink color and it is 2-in-1. Awesome stuff and comes in a nifty cute packaging too.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Arandilla",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Stretch Band Strong",
      "text": "I'm so excited about my new band! I'm looking to improve my extension and can't wait to see how I progress. It's thinner (width wise) then imagined but I've seen countless ways to use it so I'm trusting it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cline, Morgan, Trew",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Nice packaging",
      "text": "This game is less than 24 hours! Looks great! Box came “sealed” with a pink tape and presentation was nice. Would make a great gift for a dancer or yogi:)",
      "rating": 5.0,
      "verified": true,
      "author": "lia Fernandez",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Useful for stretching and developing muscle through resistance training",
      "text": "Useful for stretching and developing muscle through resistance training, very helpful! Incorporated it into my usual workout very easily and I can feel the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Avalon Norling",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Great quality! comes exactly as described",
      "text": "Great quality! comes exactly as described. Also includes a small stretching guide and a online stretching guide with even more information. Love!",
      "rating": 5.0,
      "verified": true,
      "author": "Haley",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Great band!",
      "text": "You get a good stretch if yuh attach to the door.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric T. Patrick",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great",
      "text": "Amazing!!!! The only thing is that i wish it would stay on the door when its open. Other than that I helps me so much!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Five Stars",
      "text": "So much easier to stretch, I don't need a partner anymore",
      "rating": 5.0,
      "verified": true,
      "author": "christina Sweeney",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "The Original Ballet Stretch Band Works!",
      "text": "The Original Ballet Stretch Band works! Easy to use. And comes with a great illustrated instruction booklet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Terrific Bundle Value:)",
      "text": "Great products to work on extensions! I especially like the travel bag, but I wish an instruction booklet was included.",
      "rating": 4.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Not durable",
      "text": "End hooks are made of plastic and broke off after the 2nd use. Not durable at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Five Stars",
      "text": "Nice great product. I'm using it to improve my flexibility. The products arrived on time. I love the color and the bag. The band has strong resistance.",
      "rating": 5.0,
      "verified": true,
      "author": "Piggy Ballerina",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Good buy",
      "text": "My daughters received the bands to increase their stretching. They are enjoying them so far",
      "rating": 5.0,
      "verified": true,
      "author": "Molleah A. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "One Star",
      "text": "I didn't get all the peices with it. I'm missing a leg restraint so it can't be used!!!",
      "rating": 1.0,
      "verified": true,
      "author": "candace",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Great product",
      "text": "We have had it for over 4 months. It's strong and holds my daughter well. I would recommend it to anyone and she thinks it's fun so she always wants to use it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Castillo-Ludwig",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Please think about what time of year it is. ...",
      "text": "Please think about what time of year it is. I'm 74 and not into ballet. These were a gift to my 11 yr. old granddaughter who is devoted to ballet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Nothing big",
      "text": "I know they showed ways to make the band have more resistance but it's very weak there should be different strengths. Other than that very good everything came in perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Five Stars",
      "text": "Product was exactly what it describe. My daughter was very excited!!",
      "rating": 5.0,
      "verified": true,
      "author": "WAllen",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Five Stars",
      "text": "Purchased for my daughter and she loves it, especially the leg stretcher that goes over the door.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Two Stars",
      "text": "Item did not come with waistband as shown in photo. Will be returning.",
      "rating": 2.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Five Stars",
      "text": "Great product and very helpful seller, would definitely recommend to anyone looking to improve!",
      "rating": 5.0,
      "verified": true,
      "author": "rishi boodoo",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Great purchase!",
      "text": "Great purchase. Pieces came were exactly what was shown. My 11 year old is happy with her new tools!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "HEADS UP!!!",
      "text": "I bought this product for my 15yr old son so he could increase his vertical and flexibility! After ready good and bad reviews I felt this would be a great start to reaching our goals. I haven’t had the product for 15 mins and the clip that secures the band broke! Clips are not metal!!! HEADS UP... Considering how often you will be changing the bands, or just taking it on and off, over time it will break. I am disappointed in the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric Pryor",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "It is a great set for any dancer",
      "text": "My daughter loves this!!! It is a great set for any dancer!!! Couldn't be more happy with my purchase!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy L Morgan",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "My daughter loves the ballet band and the balance pro ...",
      "text": "My daughter loves the ballet band and the balance pro as to help her with the stretches at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Arrive",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Four Stars",
      "text": "I can now get a lot more range of motion than by just stretching on my own.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Five Stars",
      "text": "This kit is great. Would definitely recommend it to any age.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary C. Nescot",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "The red bands provide some resistance but the belt and ankle straps are so big that even when you tighten them down they still are lose enough to pull and be painful working out after just a minute of 2",
      "text": "I’m 5’4 160lbs and this belt just isn’t designed for short people. The black bands offer almost zero resistance for someone as short as me. The red bands provide some resistance but the belt and ankle straps are so big that even when you tighten them down they still are lose enough to pull and be painful working out after just a minute of 2. If you are going to try this make sure you weare think socks, pants and shirt to keep it from rubbing. Oh and the plastic clips on the bands dig into the back of your legs really really bad leaving a bruise of worn for more than a few minutes.",
      "rating": 2.0,
      "verified": true,
      "author": "Soccermommy3",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "The product works as expected. The only complaint I ...",
      "text": "The product works as expected. The only complaint I had is any time the door being used for stretching is opened, the Balance Pro leg stretcher falls to the floor. While the device works for all heights and ages, my 8 year old can't reach the top of the door to replace it. Maybe it's as simple as placing a thumbtack into the top of the door to hold it in position, but I'd rather not puncture the material. This is a minor issue, but it does mean that an adult has to help get it set up each time before she can begin.",
      "rating": 4.0,
      "verified": true,
      "author": "Trey Hankins",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Cheated!",
      "text": "I ordered the 2 band set and only got the pink one!",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon Bell",
      "helpful_votes": 0,
      "publication_date": 20170414
    }
  ],
  "product_meta": {
    "title": "FIGROL Vertical Bounce Trainer Leg Resistance Bands Set-Leg Strength Muscle Workout - for Basketball Football Taekwondo Yoga Boxing Explosive Power Training",
    "rating": 4.4,
    "feature_bullets": [
      "For Athletes,For Non-athletes :This product can be used for basketball, volleyball and football sports training.Also for those people who has training needs.",
      "An Updated Version:More professional,more efficient.Have great effect on improving leg strength,vertical bounce.Enhancing the leg muscle ,chest strength,speed and agility.",
      "Lightweight but Powerful:Fabric protector strong latex tube.Soft latex and rubber materials for comfort and safety use,has a lightweight.",
      "Package Included: 1 x waist belt(The largest length is 34.8Inch), 4 x bounce straps(Length:12.6Inch), 2 x ankle cuffs, 1 x carry bag,15 LBS of a band.",
      "100%Guarantee and Satisfaction!If for whatever reason You are Not Satisfied with this vertical bounce resistance bands just Return It of Purchase and we will Refund or Replace It."
    ],
    "specifications": {
      "Date First Available": "October 8, 2019",
      "Manufacturer": "FIGROL",
      "ASIN": "B07YTW135L",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Accessories",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Jumping Trainers",
      "Sports & Fitness"
    ],
    "price": 35.99
  }
}