{
  "website_summaries": [
    {
      "verdict": "Handy 2-in-1 Chromebook that works as a touchscreen tablet or as a laptop.",
      "pros": [
        "The display screen is a little small for a laptop at 10.1 inches, but it's a good size versus tablets",
        "Touchscreen and 2-in-1 capability is nice to find in this price point",
        "Offers up to 9 hours of battery life",
        "Extremely small and lightweight at just 2 pounds, which makes it very portable"
      ],
      "cons": [
        "Cost is a little high for a Chromebook, but it does have 4 GB of RAM"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The Asus Chromebook Flip C101PA is a capable and likable convertible, but you'll find yourself squinting and zooming to read its 10.1-inch screen and typing gingerly on its downsized keyboard.",
      "pros": [
        "Low price",
        "Four-mode flexibility",
        "Two USB-C ports",
        "Bright screen and crisp keyboard"
      ],
      "cons": [
        "Awfully small for adult hands and eyes",
        "Android support still in beta"
      ],
      "aspects": {},
      "publication_date": 20171220,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Tough Touchscreen Workhorse in Middle School Setting",
      "text": "I bought this little machine a year ago and put a $20 shell on it. I use it as a teacher principally for taking roll, issuing token economy points (both via touch screen), and entering grades. I lend it to trusted students to perform some of these tasks. It's been dropped a half dozen times, has a slight bend on one of the corners, and continues to function like a champ. I can drop this little computer in my bag and have to double-check that it's there, it's so small. With offline sync, I can work on my Google docs on the train as I go in and out of wifi service. The battery lasts more than all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Lee",
      "helpful_votes": 6,
      "publication_date": 20181105
    },
    {
      "title": "A great buy if you need something portable and fast!",
      "text": "I have virtually no complaints with this chromebook. It can be folded into different positions for use. It is touchscreen and has a 10 hour battery life. It has been great for doing coursework on the Microsoft office suite of apps. My only downside is the consistency of the touchscrren at times. I have tried to use it for writing notes and I often get breaks in my lines or pauses. This may be due to my stylus rather than the screen but either way, that's my one issue. A great buy overall totally worth the money! I love Asus products.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Ward",
      "helpful_votes": 4,
      "publication_date": 20190616
    },
    {
      "title": "Stay away!",
      "text": "This chromebook started having keyboard issues within 6 months of purchase. Like, press the letter Q and it types the letter A etc. Tried to reach out ASUS service center and told us to do a \"power wash\" or hard factory reset but couldn't guarantee the problem wouldn't come back. They offer zero warranty - Amazon was no help - so don't think you can return past the 30 days and get your money back. All they offered was for us to send it in for repair. Will never purchase from this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "Stef",
      "helpful_votes": 3,
      "publication_date": 20190629
    },
    {
      "title": "Don't bother.",
      "text": "Touchscreen is a joke. I've had to use it as a laptop 90% of the time I've had it. I own a MacBook Pro. I don't need another laptop. The wifi is another joke. Barely connects and the few times it does, it basically just buffers until I get frustrated and give up. This is incredibly disappointing. It looks good. But they sacrificed aesthetics for practicability. This was an absolute waste of money, time and energy. Won't be buying any more ASUS products in the future.",
      "rating": 1.0,
      "verified": true,
      "author": "Cy",
      "helpful_votes": 6,
      "publication_date": 20180916
    },
    {
      "title": "cheap chromebook",
      "text": "I was satisfied with this chromebook at first but it developed several problems that ASUS didn't correct. Screen rotation stopped working after an android upgrade. Returned to ASUS for repair but they claimed they could not reproduce the problem and did nothing. They obviously didn't even look at it. The accelerometer was probably not working. I also had had difficulty accessing my wifi gateway although could access other gateways and hotspots well. After receiving my untouched chromebook from ASUS, I asked for a replacement device but they don't replace them, only fix them.",
      "rating": 1.0,
      "verified": true,
      "author": "Rich M",
      "helpful_votes": 3,
      "publication_date": 20181124
    },
    {
      "title": "Does not last..non functioning within 3 month! Going with another brand.",
      "text": "Well, I thought this would be a god chrome book for my daughter... but the darn thing pooped out within 3 months of purchase. We purchased this on 7-17-18, and a key piped off, and the q, a, and 1 keys do not work. Cannot use. Sorry asus. Buying another brand. Oh, we also place this chrome book carefully after each use in a jell-cushioned carrying sleeve. Bummer.",
      "rating": 1.0,
      "verified": true,
      "author": "Bonnie Smith",
      "helpful_votes": 4,
      "publication_date": 20181030
    },
    {
      "title": "Not very durable.",
      "text": "Screen cracked after two months of use. Normal use no drops or bangs. Turned on and noticed screen cracked from bottom right to top center. Touch screen no longer works. Expected a lot more for the price.",
      "rating": 1.0,
      "verified": true,
      "author": "yooperjj",
      "helpful_votes": 4,
      "publication_date": 20181221
    },
    {
      "title": "I loved it so much I bought another one for my wife",
      "text": "Surpassed expectations! Super long battery life, I bought this to not have to go to my desktop and it has done just that. It had resolved my desktop, my tablet, and my laptop. It is the best laptop, tablet that I have ever had, the flip screen allow you to use it in so many different ways making so comfortable to use. Key board is great and easy to use even with my fat fingers. I loved it so much I bought another one for my wife and she loves it too...",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory J Tucknies",
      "helpful_votes": 2,
      "publication_date": 20190117
    },
    {
      "title": "I love it.",
      "text": "I mostly use this for watching netflix, or folded up like a tablet for reading ebooks. But I am prone to violent spats of philosophical research as well as the dedicated pursuit of other esoteric knowledge, and this little guy has kept pace pretty well. Instant on, insane battery life, and the beautiful form factor sold me. The addition of android apps makes this a totally viable platform for all sorts, so if this sounds like a device you would be interested in but you're on the fence don't be afraid to take the plunge.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20181213
    },
    {
      "title": "LOVE THIS LITTLE GUY",
      "text": "I love this computer so far!! I have had a learning curve, luckily I have always been a android user so the hurtle wasn't to big. I work, go to school and have been looking for work so the extent that I have had to use this little guy has been enormous over the last month! Will stay a fan of this chrome notebook and will probably buy another one when this guy poops out on me (hopefully long long time for that!) I was originally a Dell user all the time but this computer is faster and easily converts documents to a format that is compatible with this chrome book, sooooo worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Awesome little chrome book",
      "text": "I am very happy with the Asus Chromebook. I bought the 10\" and luv it. It is perfect for traveling. This is my first chromebook, now I've moved my entire life to google and so pleased with the result. Performance is good, nice metal cover, very quick response time. It is so nice to have access to all of the android apps as well. I use skype, whatsapp, and google voice, so in contact with everyone from my computer. Looking forward to trying out the bonus Linux (beta) feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey D",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Awesome little machine",
      "text": "I adore the size of this. Its fast and I can do just about anything on it. The keyboard is nicely done and just the right size. Im very happy with this. Im self employed and this really suits my needs. I love that i can flip it to tablet mode too. Not much internal space but using the chrome cloud you dont need it plus you can use a flash drive or sd card. Great price for all you get out of this. My only wish for this is that the keyboard was back lit. Other then that Im super happy!!",
      "rating": 5.0,
      "verified": true,
      "author": "BigJ&K",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "I love it. Great looking",
      "text": "I got this for my daughter for Christmas. She loves it. I love it. Great looking, really nice feel, well constructed. Great features. But I'm having an issue. My daughter alerted me to this. Sometimes when she's in chrome and scrolls to the top of the page the screen will glitch out. It goes mostly black and the image flickers wildly. Obviously something is wrong. I'm hoping I can exchange it, but I'm not sure if it's been too long. A fix would be ideal if there is one. Can't find anything on Google. I hope we can fix it because other than it's been a really big hit.",
      "rating": 3.0,
      "verified": true,
      "author": "Jonah",
      "helpful_votes": 5,
      "publication_date": 20180119
    },
    {
      "title": "Impressive",
      "text": "This is my first Chromebook and I'm really impressed. For what I do, which involves a lot of writing and collaboration with colleagues in Google apps, it works brilliantly. It looks very nice too. Switching between work and personal accounts is a breeze, battery life is very good, and the form factor (even the small keyboard) are to my liking. My only tiny complaints are that the trackpad seems to click on things involuntarily from time to time and that the screen is a fingerprint magnet.",
      "rating": 5.0,
      "verified": true,
      "author": "Senkihazireader",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Unexpectedly shuts down",
      "text": "When this is working, it's great. I use it daily for work and can say nothing negative about it, EXCEPT is unexpectedly restarts itself self times a day. It gets extremely annoying! I've reinstalled Chrome OS twice and have gone through every applicable fix I have found, but it still has the same problem. I've contacted Asus about it and they've suggested sending it away for diagnostic repair. That may be the trick, but without knowing how long that will take (or what the cost would be since I've had it close to a year), I'm not sure practical it'd be.",
      "rating": 2.0,
      "verified": true,
      "author": "Leonard Poage",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "the charger doesn't fit all the way in same as all chromebooks is highly annoying",
      "text": "I am sick of buying these chromebooks...last about a year before you can't charge the stupid things. Even the charger it comes with. I go through 3 chargers and then realize it is not the charger but it is designed terriblyand the charger has a bout a quarter inch that does not fit in :( again I have to buy a new one but trying Acer this time.",
      "rating": 3.0,
      "verified": true,
      "author": "PS",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "It has potential for a whole lot more, but well made at a great price.",
      "text": "This one is a little different then the first one (C100PA) but it is very well made. It's aluminum body and frame make it very durable. It has a USB type-c Port which is pretty good and the reason I bought it. The keyboard is small but still not to hard to work with. The mouse pad is sensitive to the touch. All in all I would say, as if right now I can recommend this Chromebook and if it holds up like the first one is a great deal. Very portable, lightweight, sleek design and sturdy. If anything changes as I use it more, I will come back and update the review.",
      "rating": 4.0,
      "verified": true,
      "author": "Tino Fuentes",
      "helpful_votes": 3,
      "publication_date": 20171203
    },
    {
      "title": "Fragile as an egg shell",
      "text": "I bought it to my wife, as she needed a light an small laptop. The first let down (not ASUS's fault) is that due to a misleading propaganda from Microsoft, althought is has a 10.1\" screen, Microsoft Office IS NOT FREE to this device). The other one is that when it fell off my bed (2 ft height) it broke its screen and now it is a $320 PAPER WEIGHT",
      "rating": 1.0,
      "verified": true,
      "author": "Leonardo K Lima",
      "helpful_votes": 2,
      "publication_date": 20190501
    },
    {
      "title": "Device arrives defective",
      "text": "Chromebook arrived but will not boot with error 'chrome os is damaged or missing'. I followed the recovery process to create a recovery USB stick and start recovery. Recovery will not start with error 'security module is missing'. Call Asus, they said to return the device, it is defective. Called Amazon, they send me to talk to Asus again. Asus said I need to talk to Amazon again. I am a ping pong ball. Make long story short, Amazon finally agreed to take back the device. That was a painful experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Roland Y.",
      "helpful_votes": 2,
      "publication_date": 20190725
    },
    {
      "title": "Wonderful, for as long as it works.",
      "text": "This slim, lightweight machine has a premium look and feel with its aluminum case and \"island\" keyboard (although the keyboard is slightly smaller than standard). The ability to bend it into a tent position makes it great for demonstrations or home video viewing. Chrome OS and Google Docs and Sheets are great, I'll never go back to Windows and Office. Sadly, I've bought two Asus Flips and each has malfuntioned, the second less than a year before failure. The first simply would not turn on anymore. My second has a keyboard with dead keys. I now need to purchase my third Chromebook in five years. I think I'll try another brand and hope for the best.",
      "rating": 2.0,
      "verified": true,
      "author": "TGW",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "5* I even bought my mom one!",
      "text": "I absolutely love mine! The only thing I wish it had similar to tablets because of the limited storage would be a micro SD slot. One thing I have to give credit to is that it was left outside and get automatic sprinklers watered it for 30 minutes, I took it inside and turned it off (Yes it was still on and running) dried it with a towel removed the back panel Stir It Up in front of a fan for 4 days and by some miracle it's still works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "AisForRebel",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Loved mine so bought another for a gift",
      "text": "I purchased the previous model in 2016 to use when my larger laptop wasn't available or wasn't convenient. I've been using it for emails, research, etc. I find this Asus perfect for my usage and really like the dual capabilities of touch screen and a keyboard. The flip is also a great option. My grandson used my Asus when he visited so I recently bought him this current 2018 model. He uses it daily for homework, emails, research, games and is thrilled with it. It's lightweight, the battery lasts as advertised and recharges quickly. For the price, it is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "GenerousGrandma",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "would recommend.",
      "text": "I rarely review, but this thing is an absolute pleasure to use. It does not feel cheap, even for the price; the keyboard is pleasant to type on, screen is clear enough, plenty of processing power for browsing. This machine is my go to couch laptop, and has replaced my dell xps 13 for everything except for when I need a machine for serious programming. I did not experience any of the manufacturing defects that others have mentioned (even though I bought it used from amazon). 10/10, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven M.",
      "helpful_votes": 2,
      "publication_date": 20180801
    },
    {
      "title": "Works Great",
      "text": "Writing this on September 10th 2018 - It still wont run Minecraft from the Play Store but that is ok because that is not why I bought it. Its works great on the web and it does everything well and didn't break the bank. Kids use them for school and some games The kids love them and 1st one (1 model lower) is now 3 years old and I am still told \"Thanks, I love my chromebook\" every few months. The 3 years of thanks from a teenage daughter for 1 Christmas present is a damn good deal and",
      "rating": 4.0,
      "verified": true,
      "author": "NO Way",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Great for schoolwork",
      "text": "I bought this for use on campus at my college, and it works well for that purpose. It is small and has a long battery life; I can have music on in the background, articles, and a word document up at the same time and still have low battery drainage. I've had it for almost a year now, and the only issue is the monitor occasionally turns itself off when I attempt to plug in the power cord or the headphone jack. Not too bad for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Karmen Freeman",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "It's okay",
      "text": "This was delivered a little later than expected. I had to follow up several times as the delivery window kept growing. In terms of chromebook, smaller than I expected, the operating system felt too constricting due to simplicity, the keyboard is too different than our work laptop so remoting in to work wouldn't work unfortunately, but it's a good solid web browser",
      "rating": 3.0,
      "verified": true,
      "author": "MUKI LOK UNG",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "weak wifi card",
      "text": "I don't know whether something is wrong with the new unit I bought this month. But the wifi card doesn't pick up, or maintain, the wifi signals easily picked up by my 3 year old low-priced Chromebook. I really like other things about it, but if all units of this model have weak wifi, I will have to just return it instead of exchanging it.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Tierney",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Honest review",
      "text": "So far so good. I needed this computer for very minimal needs so it serves its purpose and everything seems to be great with it so far. I will update if anything goes wrong in future with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Delaney ",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Great port selection! Super versatile!",
      "text": "I love this little Chromebook! i wanted to get the bigger 12in with the m5 chip but it lacked a usb A port for backwards compatibility! this is small, portable and has an excellent battery life! the 2 type c ports and the A port make this thing super versatile! wish the 12in had the same connectivity.",
      "rating": 5.0,
      "verified": true,
      "author": "boycrazyboy",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "So easy to transport!",
      "text": "If you are looking for a small Chromebook to carry around, this is about as good as it gets. The keyboard is smallish but easy to type on. The screen has way more black borders than it needs to have for a notebook, however when using it as a tablet you'll realize that those borders are a good thing. I was initially worried about the low resolution of the screen (1280x800), but it turned out to be no problem since the screen is small. 1920x1200 would be stellar to have though. This Chromebook runs Crostini (Linux) and Android apps too to top it off. All in all still the most transportable Chromebook available with a lot of features.",
      "rating": 5.0,
      "verified": true,
      "author": "Harald Kubota",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Broke in 3 months",
      "text": "Let me start by saying I absolutely loved this Chromebook. It is fast and worked great. That is up until I had it for 3 months. Out of nowhere I plugged it in and there is a loud \"whirring\" noise coming from just to the left of the charging port. The laptop says it is charging but the battery percentage does not go up. I am sending it in for warranty work, but if this is the quality of ASUS items I will not be purchasing again.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Keyboard will not work",
      "text": "YouTube videos say the cable is not connected and to remove all the screws from the back and reconnect the cable. This is a BRAND NEW machine, and I have ablsolutely NO idea what I am doing. I will not open the back and try to fix this. I need a replacement. I really like the tablet but it won't work!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customerhhvvbnhj",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Disappointed",
      "text": "This size tablet was just what I needed. The huge problem is You Tube videos began to buffer after a few minutes. I've tried everything to get it to work. I've checked all blog fix it post. Nothing has worked. Would send it back, but way past return deadline. Better luck to you if you should decide to purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Jan Tex",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "It's what you expected and its gets the job done.",
      "text": "Looking for cheap option to get work done. This will get it done. Another the specs are a little on the light side, I thought it would be a little more snappy because it as close to a blank slate as possible. But it works for sending emails and typing docs. Plays YouTube just fine. Light weight and small and is jus all around ok. You see it for good price you wont be disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "David Jean-Baptiste",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Stopped working after 6 months :(",
      "text": "I had my last chrome book for many years and loved it. This one I have had for six months, and it is already unusable. I enjoyed using it while it was working, but last month the charger stopped charging. I Purchased a replacement and now although it says it is charging, the Chromebook will not turn on.",
      "rating": 1.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Not sure why this Chromebook was highly rated",
      "text": "I'm very disappointed in the Asus Chromebook flip that I recently purchased. It was rated in a top five review of Chromebooks that I saw for its price point but it runs extremely slow in some apps. I've tried all of the online tips to no avail. When I flip it to tablet mode, certain apps stop working and/or won't launch. Very disappointed as I was looking for something to replace my Samsung Tab A (which worked flawlessly) that acted more like a laptop. I'm going to keep looking for fixes but buyer beware of this Chromebook.",
      "rating": 2.0,
      "verified": true,
      "author": "John R.",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Worked well but nothing special for long term.",
      "text": "I bought this a while back and for about a year it worked. Then the laptop overheated and the internal CPU fried up last week. Was nice while it lasted, but it seems warranty might be good just in case for this product. Maybe I got a dud, but it was a nice item while it lasted.",
      "rating": 3.0,
      "verified": true,
      "author": "Anonymous Platypus",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "1 year in use",
      "text": "This laptop was great when I first got it, but now a year later it does not work as it used to. It glitched and went off once and when I press the back arrow, it does not work sometimes in certain places. I am currently typing my review on it. It's very light and tiny and that is the plus side of why I got this laptop. It's sad that it does not work as well as it used to, because I use this laptop everyday.",
      "rating": 3.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Cool on the outside, poopy on the inside.",
      "text": "There's a lot to love about this laptop. It's tiny and portable, the touchscreen is awesome, the refresh button on the keyboard is genius, great OS, and having a laptop and tablet in the same machine is totally rockin. Unfortunately, the guts need some work. The trackpad is really sticky. The speaker is very tinny and doesn't get very loud. The laptop gets really warm almost immediately. Apps I downloaded wouldn't work (Netflix, Google Play Music). The straw that broke the camel's back was when I opened Chrome and it couldn't load my own website, even though it was the only tab open. Also, who is using USB 2.0 these days? That port should be a USB 3.0. DUH.",
      "rating": 2.0,
      "verified": true,
      "author": "Jacki Moo",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Battery and tech support are terrible",
      "text": "Battery lasted just past the year warranty. Now I have a paperweight that Asus wont do anything about.",
      "rating": 2.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Love this Chromebook",
      "text": "Suites my needs perfectly. Only issue I've found is the screen will not rotate when a wireless USB mouse is used. This seems to be a common issue. That said, I love this product. Would I buy it again? Absolutely.",
      "rating": 5.0,
      "verified": true,
      "author": "dkh1020",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "My go to computer.",
      "text": "Most people who want to browse the web and use their favorite apps can't go wrong with this Chromebook. Gets regular updates. Runs Android apps very well. The only real downside to this computer is the number of nice Chromebooks that are being released that could be a better alternative (HP x2, I've got my eye on you) to this two-in-one.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Pasco",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Defective issues with connectors.",
      "text": "I really wish Asus would correct their faulty keyboard ribbon cable connector problem my second Asus that failed within a Year's use. Sharp looking product liked it accept for the ribbon cable connector issues.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Money saver while fitting the bill!",
      "text": "I needed something portable to take around for multiple things. It is quick, lightweight and navigates the internet quickly. I keep a one drive storage so I can access all documents and save on this computer also.",
      "rating": 5.0,
      "verified": true,
      "author": "Bayou belle",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Fragile screen",
      "text": "Screen is more fragile than other tablets. I will not be purchasing this brand again. Customer service was headache to deal with for repair. Read warranty very well before buying.",
      "rating": 2.0,
      "verified": true,
      "author": "TroyB42",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "A great fast excellent Chromebook Tablet",
      "text": "This Chromebook is fantastic ... I have it now for three months and works fast and is excellent in all aspect ... very good picture... good fo movies and everything I have to work with as Google Docs is offering all that one could miss with Microsoft word ...",
      "rating": 5.0,
      "verified": true,
      "author": "M&M",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Can't be more happy with it",
      "text": "Best laptop I have, used to have a MacBook Pro 2010 and can't be more happy, great battery, touch screen, supper fast , I can't have all my Excel documents but I have all I need with free Office for Word, Excel, etc. Get an external micro SD since you will need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus Barrera",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Chromebook doesn’t work with some printers.",
      "text": "Depending on your situation just know that chromebooks will not work with all printers as I found out, your printer has to be cloud ready ? which I discovered after purchasing my chromebook, if you don’t want to buy a new printer as well with a chromebook do some research it never dawned on me that my printer wouldn’t work with it, buyer beware.",
      "rating": 3.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Very nice computer but small",
      "text": "Got this for my wife. It operates and looks great. My wife loves it. However, for me, it is too small and would not be useful in my profession. The keyboard is small and the screen is small. But for emails and surfing the internet it is just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Very Short Life!",
      "text": "Purchased 2 in November 2018. both no longer work. They will not start up. Tried all options but no success. Will not buy again. If you do get warranty extension.",
      "rating": 2.0,
      "verified": true,
      "author": "cujobaby",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Worked fine till the screen cracked.",
      "text": "It worked better than I thought it would for the price, and I was quite pleased with it. However, after taking it out of my backpack I found a small hairline crack on the screen, barely noticeable. Had there not been a way to disable the touchscreen the chromebook would have been useless due to the touchscreen now giving random imputs everywhere. I am quite surprised the screen cracked so easily, and even more surprised that this would cause the touchscreen to nearly brick the computer. Non tech savy people would most likely just throw it out. I expected more from ASUS...",
      "rating": 2.0,
      "verified": true,
      "author": "Karen Rogers",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "I bought it as a laptop for kids, connected ...",
      "text": "I bought it as a laptop for kids, connected it to a monitor with USB-C - HDMI connector, and this set up works!! It also has a SD-card slot. I use it for 200GB SD card for cartoons and movies storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Kira Vardin",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Not good",
      "text": "My chromebook only lasted one year. It blacked out and I tried all the suggested fixes. Nothing worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Hardware Issues - Became Disposable",
      "text": "Became disposable after a line of keys stopped working. One of the keys popped off as well. $$$ to send it in and no option to purchase new keys. Customer servit, unfortunately, was there to read scripts of costs. It performed very well before this issue. We got 9 months of use.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "good quality, runs not too bad",
      "text": "ok product, good quality, runs not too bad, slightly warm on the bottom by comparing my other Chromebook C-213s, but i like the facts that it is 10 inches size and decent performance and quality. if you don't mind 11 inches size, i would recommend you buy C-213S with 32GB memory.",
      "rating": 4.0,
      "verified": true,
      "author": "Alisa Deng",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Size-performance combinaion",
      "text": "I like its size and performance as a complement to my smartphone and substitute a tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose F",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great little machine, but...",
      "text": "It seems like a great portable computer, but it lacks in processing power. If it had the same processing power as it's 12.5 inch version, it would have been perfect. I would even pay more money for it. Unfortunately, it lags when streaming videos and screen resolution could be much improved.",
      "rating": 3.0,
      "verified": true,
      "author": "Odessit",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Excellent value",
      "text": "Rockchip processor provides more than adequate performance. Screen brightness decent. Google Play shipped as Beta but seems to work well. I have loaded the MS mobile apps and they work well. Keyboard has a nice touch / travel. Trackpad just OK, but I haven't tried any sensitivity adjustments. Very pleased with my purchase. And if anyone was wondering...when you insert a microSD card, it does sit flush with the side of the chassis, although there is no \"door.\" It is \"spring-loaded\" so push in/click to insert, push in/ click to remove.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil Dorf",
      "helpful_votes": 9,
      "publication_date": 20171105
    },
    {
      "title": "Terrible",
      "text": "This is the second Asus chromebook that has bricked out on me, this time after only 2 months! Absolutely will never buy another again",
      "rating": 1.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Best bang for the buck laptop you can buy.",
      "text": "Great product! No lag. Incredible battery life. Bought this instead of a MacBook air and I have no regrets. I regularly use it as a tablet on long flights and as a PC for work.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Good for kids",
      "text": "Small, good quality. Touch pad requires a harder touch that I would like. Perfect for kids and their school work.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Amazing laptop",
      "text": "As an online student with a newborn I needed a laptop that was easy to tote around and use without having to charge it all the time. This Chromebook fits my every need perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Useless",
      "text": "I bought this product specifically for my daughter for her online school but we tried using online Microsoft teams and the computer just glitches and doesn't work. We bought this laptop and it cant even work for the reason we bought it for.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicey Hilton",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "better speaker. I still hate the search button",
      "text": "Smaller than my last Chromebook, better speaker. I still hate the search button, would prefer having a caps lock button then another redundant search method on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Retromama",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "No audio recording software available!",
      "text": "This chromebook is fast and efficient, excellent for internet browsing and watching movies, but if you're a musician and you like to record audio on the go, it's worthless. Great for everyday use like work or college, but nothing else. There's no app to use in the Play Store, free or paid, for audio. Best for this purpose is an iPad to use Garageband. That's the only reason I gave it 4/5, otherwise would be a 5/5!",
      "rating": 4.0,
      "verified": true,
      "author": "Luis Mora",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Works well",
      "text": "I like it but wish it had a lighted keypad. Feels solidly built and is speedy enough for web browsing. Also nice that android apps work with this chromebook.",
      "rating": 4.0,
      "verified": true,
      "author": "K. A.",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Four Stars",
      "text": "Like the size and weight. Not impressed with the battery life and the touch screen sensitivity isn't the greatest.",
      "rating": 4.0,
      "verified": true,
      "author": "Marlene Jaastad",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Great laptop for my daughter",
      "text": "We bought this laptop for our 11 YO daughter’s birthday. It’s perfect for her. It’s a mini version of the laptop I use to remote into work. It is just as fast as mine, touchscreen is a great option, and it does everything she needs. We are very happy with our purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "High Quality Perfect Size",
      "text": "Highly recommend. Solid high-quality feel from the metal casing, to the keyboard and touch screen, everything feels like you are getting your moneys worth. I love how small and light it is. it fits just about anywhere and is comfortable to walk around with it in hand as well. Bottom line, this is Quality compared to every other sub 11in unit that I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Chromebook",
      "text": "This Product was easy to set up a little slow to update when first started. I bought the Chrome Book for my granddaughter because her school uses them. I have to admit it operated very well and the speed is very good for what it is used for, she is very pleased. I would recomend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "So far, great little computer.",
      "text": "So far great little computer. Does just what I need. No fuss, no extra crap. Fast, streamlined.",
      "rating": 5.0,
      "verified": true,
      "author": "JulieToodles0001",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Wonderful Computer",
      "text": "Very compact, sturdy, flexible computer. Has everything and more. One of my best purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "macdoc",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Very good. Real aluminum chassis.",
      "text": "The aluminum is easy to scratch and ding but it's real aluminum. The brushed finish is a little slick making it easier to drop and sent, but the 360° hinge makes up for this. Great for college... or playing pubg mobile on a bigger screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy Megumin",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Broke in under 60 days",
      "text": "Have had this less than 60 days. Mouse and keyboard do not work. Zero repair options that don't cost 75% of unit. Cannot even find where to send it for warranty. Service sites in their website say in chaos: walking only. They are 1000's of miles away.",
      "rating": 1.0,
      "verified": true,
      "author": "Booker",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Awesome Product",
      "text": "This is a great portable Chromebook for anyone looking for a blend of an android tablet with google OS experience. The display is crisp, the keyboard is excellent for its size and its fast! I highly recommend this Chromebook for the user who wants to browse the web, check emails and stream videos.",
      "rating": 5.0,
      "verified": true,
      "author": "doctork21",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Good for kids homework",
      "text": "Slow response at times. Good for kids homework. Touchscreen fine.",
      "rating": 3.0,
      "verified": true,
      "author": "shirley todman",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "the other is about 4 years old and I have beat it up pretty good so I had a batterynot charging issue and ...",
      "text": "the second one I have purchased ...the other is about 4 years old and I have beat it up pretty good so I had a batterynot charging issue and thought it was dead but it came back to life .Now I have two",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Love it!",
      "text": "I love this product. I accidentally left mine in the car on a hot day and \"cooked it\" so I got to order a new one! It took some time for me to get the hang of this device - it isn't a PC. But the ease of use, the portability and comfort - it is a great tool!!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth S.",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "... on the screen but my daughter didn't mind and liked it.",
      "text": "It's a little slow and sometimes didn't register the touches when tap on the screen but my daughter didn't mind and liked it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "What I got was a 2015 EEE book, c201pa, so I have no idea what the flip is like.",
      "text": "I didn't get the flip chromebook, I got an EEE book from 2015 with a special dev build of chromeOS that could not be upgraded, that didn't flip, and a sticker telling me that it was a development machine written in Chinese.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Tobin",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Seems great but.....",
      "text": "This seems to be a nice chromebook. I bought for my 5 yr old daughter for her to for school. Unfortunately, I received it in \"demo mode\" and cannot find a way to take it off. I am not able to use it so I will be sending it back. =(",
      "rating": 3.0,
      "verified": true,
      "author": "I.reviewz",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "love it. compact",
      "text": "love it. compact,easy to use. light. good battery life. it replaces my old android tablet and almost all apps were available.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin A.",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Great Little Notebook",
      "text": "Does everything I ask it to do. Responsive, fast, and works great for streaming music or videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M - S  FL",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Need to replace the screen now",
      "text": "Great battery and useful but I cracked the screen and now the touchscreen doesn’t work",
      "rating": 4.0,
      "verified": true,
      "author": "j",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Bought this to be my all in one all day ...",
      "text": "Bought this to be my all in one all day portable laptop.. so far works really well but have some compatibility issues with some android apps. Further more some streaming sites are slow in chrome it keeps on buffering endlesssly. Hope there will be a fix for this soon.",
      "rating": 3.0,
      "verified": true,
      "author": "Gil Christian A. Gonzales",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Worth a look!",
      "text": "LOVE. LOVE. LOVE. Lightning fast, super intuitive & highly functional for someone who lives life at a fast pace. I literally do not have words for how much I love this Chromebook!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Stricker",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Excellent size",
      "text": "Very fast great for moving around I like this one better than a larger one that I gave my wife",
      "rating": 5.0,
      "verified": true,
      "author": "TSgt LGN",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Slight issue",
      "text": "Good product but, after having for about 2 months the charger port of the Chromebook broke and now it will not turn on or charge to be turned on. Be aware of what you're doing so this won't happen to you!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Disappointed",
      "text": "This is just a tablet with a keyboard attached. And not particularly powerful",
      "rating": 2.0,
      "verified": true,
      "author": "Frank B Auriemmo",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Works Great!",
      "text": "Works great for my needs have had it a couple months and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Best travel laptop.",
      "text": "The 10.5 inch laptop has a metal shell, excellent touch screen, and only weighs 2 pounds. I know of no better Chromebook for travel !!",
      "rating": 5.0,
      "verified": true,
      "author": "Dwight D. Hale",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Great product",
      "text": "Everything was done right but I discovered chromebooks arent for me. I dont like that you cant add documents to your desk top. I end up losing my documents a lot. But I recieved everything well and everything was in great condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Thomas",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Finally, a tablet that works smoothly.",
      "text": "I've been through a couple of real slow tablets lately. This was not one of those. It works fast, boots up fast and doesn't glitch out because of not enough memory. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "skunkdog",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Fine for web browsing and email",
      "text": "Its ok. A little small. Takes some time getting used to chrome os. Fine for web browsing and email.",
      "rating": 4.0,
      "verified": true,
      "author": "Reuben",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "IT's very light and fast !",
      "text": "Love it so much that i will be getting one for a family member....",
      "rating": 5.0,
      "verified": true,
      "author": "Abdullah Muhammad",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Good Value",
      "text": "Good unit for basic day to day use using Google platform. Good battery life, wifi connectivity, touch screen, audio. Good value for what is invested for basic internet, etc. use. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken B.",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Love my Chrome Book",
      "text": "My first Chrome book and I LOVE it. Awesome battery life, boots up in literally seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Nestell",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "User friendly",
      "text": "Perfect for my disabled, elderly uncle. Easy for him to use and the touchscreen helps him navigate easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Quiettess",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "i have this product 6 days now and so far its working very fine, only thing its way different to windows so ...",
      "text": "review dates march 15th, i have this product 6 days now and so far its working very fine, only thing its way different to windows so basically u need internet to work it.",
      "rating": 4.0,
      "verified": true,
      "author": "Keneleah O.",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Excellent buy!",
      "text": "Great Chromebook...I was worried it was too small but my teen loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne M.",
      "helpful_votes": 0,
      "publication_date": 20181127
    }
  ],
  "product_meta": {
    "title": "ASUS Chromebook Flip C101 2-In-1 Laptop- 10.1” 4-Way WXGA Touchscreen, Rockchip RK3399 Quad-Core Processor, 4GB RAM, 16GB Storage, All Metal Body, Lightweight, USB Type-C, Chrome OS- C101PA-DB02",
    "description": "Style:16GB eMMC StorageAsus C101PA-DB02 10. 1-Inch touch Chromebook Flip (2. 0GHz, 4GB memory, 16GB em, Google OS), all metal body, lightweight, USB Type-C, Google play store ready to run Android apps, touchscreen. *the actual transfer speed of USB 3. 0, 3. 1 (Gen 1 and 2), and/or Type-C will vary depending on many factors including the processing speed of the host device, file attributes and other factors related to system configuration and your operating environment.",
    "rating": 4,
    "feature_bullets": [
      "The flexible 360 degree hinge and 10. 1 inch WXGA (1280 x 800) touchscreen lets you use the C101PA in tablet, stand, or laptop mode.",
      "Lightweight at 2 pounds and . 6 inches thick with the protection of a sleek aluminum metal body and the newest USB Type-C connectivity.",
      "Work online or offline and starts up in seconds and lasts all day, thanks to a long battery life rated upto 9 hours.Built-in Bluetooth V4.0",
      "Rock chip RK3399 Quad-Core 2. 0 GHz processor for fast performance with 16GB of storage and 4GB RAM for fast and efficient performance.",
      "Chromebook runs on Chrome OS-an operating system by Google that is built for the way we live today. It comes with built-in virus protection, updates automatically, boots up in seconds and continues to stay fast over time (Internet connection is required).",
      "All the Google apps you know and love come standard on every Chromebook, which means you can edit, download, and convert Microsoft Office files in Google Docs, Sheets and slides.",
      "With the Google play store, you can access a rich library of apps, games, music, movies, TV, books, magazines, and more, All from your Chromebook. Max Memory: 4 GB",
      "Chromebooks come with built-in storage for offline access to your most important files and an additional 100GB of Google Drive space to ensure that all of your files are backed up automatically."
    ],
    "specifications": {
      "Standing screen display size": "10.1 Inches",
      "Screen Resolution": "WXGA",
      "Max Screen Resolution": "1280 x 800 Pixels",
      "Graphics Coprocessor": "ARM Mali-T860 MP4",
      "Chipset Brand": "Rockchip",
      "Card Description": "Dedicated",
      "Wireless Type": "802.11ac",
      "Number of USB 2.0 Ports": "1",
      "Number of USB 3.0 Ports": "2",
      "Average Battery Life (in hours)": "9 Hours",
      "Brand": "ASUS",
      "Series": "C101PA-DB02",
      "Item model number": "C101PA-DB02",
      "Hardware Platform": "Unknown",
      "Operating System": "Chrome OS",
      "Item Weight": "2 pounds",
      "Product Dimensions": "10.4 x 7.2 x 0.6 inches",
      "Item Dimensions  LxWxH": "10.4 x 7.2 x 0.6 inches",
      "Color": "Silver",
      "Processor Brand": "Rockchip",
      "Processor Count": "4",
      "Computer Memory Type": "Unknown",
      "Flash Memory Size": "16",
      "Hard Drive Interface": "Solid State",
      "Hard Drive Rotational Speed": "10000 RPM",
      "Power Source": "AC & Battery",
      "Voltage": "15 Volts",
      "Batteries": "1 C batteries required.",
      "ASIN": "B075KFFMZS",
      "Customer Reviews": "4.0 out of 5 stars508 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#13,371 in Computers & Accessories",
      "Date First Available": "September 7, 2017"
    },
    "categories": [
      "Computers & Accessories",
      "2 in 1 Laptops",
      "Laptops",
      "Electronics",
      "Computers & Tablets"
    ],
    "price": 259.0
  }
}