{
  "website_summaries": [
    {
      "verdict": "Quality features and performance at a budget price.",
      "pros": [
        "Excellent motion detection and night vision",
        "Offers 2-way talk feature"
      ],
      "cons": [
        "WiFi signal strength directly impacts performance"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love this camera!",
      "text": "I already had the previous model of this camera and was very happy with it. I needed another camera for baby’s bedroom and decided to purchase this model because seemed easier to mount on the wall above the crib. I couldn’t be happier with this purchase, it was easy to connect and mount to the wall. It has great range of vision and the quality of the image is outstanding. If I need more cameras I will definitely go with this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary of la O",
      "helpful_votes": 44,
      "publication_date": 20171119
    },
    {
      "title": "I am very disappointed because the reviews looked mostly good",
      "text": "Did everything according to directions. Only way to get tech support assistance is via e-mail in China. We e-mailed back and forth for a week. They just kept telling me to do what I already dis. I am very disappointed because the reviews looked mostly good. I would have had a working camera by now.",
      "rating": 1.0,
      "verified": true,
      "author": "Janell C.",
      "helpful_votes": 33,
      "publication_date": 20180105
    },
    {
      "title": "FIRE HAZARD",
      "text": "We used this as a baby monitor for a little over a year. We loved that we could use our phones/ipad instead of a traditional monitor. The quality was great during both daytime and night time. Over the last couple months I noticed the camera getting warm and started unplugging it after nap time and in the mornings. All was fine until a couple of days ago when I went to unplug the cord from the camera. The camera was so hot is started to melt! The entire thing is warped! This is a big problem! Please be cautious and check your cameras occasionally to see if they start getting overheated and get rid of them immediately!",
      "rating": 1.0,
      "verified": true,
      "author": "Briana",
      "helpful_votes": 7,
      "publication_date": 20190421
    },
    {
      "title": "Great buy!!!",
      "text": "EXCELLENT SECURITY CAMERA!!!!!!!! I’ve been trying to find a reasonably priced camera system that runs on WiFi with no monthly fee for my horse barn and this camera does not disappoint! I love it so much I ordered more for the other horse stalls and two weatherproof ones for outside! Superior clarity! Night vision could be better but it does the job for what I need the camera for!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 22,
      "publication_date": 20180202
    },
    {
      "title": "Misleading Product Description",
      "text": "I intentionally sought out the K3 non-cloud versions for compatibility purposes with my existing system. No where in this sellers product description does it mention that what they are selling are K3 Cloud cameras which is what I received. You can't add your non-cloud wansview cameras to the new new cloud app and you can't add your new cloud wansview camera to your old app. Sadly for me the substitution of a cloud based camera is not an option. This sellers product description is misleading and should be corrected before someone else has to waste time sending their products back.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 3,
      "publication_date": 20190912
    },
    {
      "title": "Received replacement - no issues",
      "text": "Updated 4/23/19: I received a replacement model and it has since been working fine. My first Wansview K3 camera worked great. Easy setup, great audio and video. When I received my second Wansview K3 I got frustrated after trying to scan the little sticker on the back. Turns out, my 2nd camera doesn’t have a QR code or DID number. So there’s actually no possible way for me to connect it to WiFi or my phone or anything. Sure it blinks when plugged in and looks real to anyone bothering to look, but that’s not what I bought it for, and that does me absolutely no good. Very disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Wallace",
      "helpful_votes": 5,
      "publication_date": 20190401
    },
    {
      "title": "unfortuanately I kept this too long and cant return it",
      "text": "I thought this device was going to be compatible with my older cameras. It's not. It has no web interface and will not work with their older app so I need two apps, one for this camera and another for my older cameras. I liked this companies products because of the compatibility and web interfaces, but now I'm questing whether to continue with their products.",
      "rating": 1.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 3,
      "publication_date": 20190622
    },
    {
      "title": "Device desription is very misleading",
      "text": "This camera appears to be nothing more than another lousy P2P camera. The description clearly states that the camera can be viewed using a PC and an android phone. It doesn't state anywhere that it HAS to be the wansview app! I want nothing to do with proprietary P2P cameras. I use only open source type cameras where I can set the IP and port and use port forwarding to view the camera using the same app and PC software I use to view all of my cameras. What a waste of time.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason N.",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "Good product, app is too intrusive",
      "text": "As a camera it works great. Easy to use app, good video quality, night vision works well. It makes me a bit nervous about privacy though. It automatically runs in the background whenever you close out the app (not at all necessary), randomly takes screenshots, etc. As a result I made sure to go in after installing and block the app's data usage and limited its permissions. I suggest you do t he same and then this is a 5-star product.",
      "rating": 3.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 4,
      "publication_date": 20180525
    },
    {
      "title": "Supports rtsp!",
      "text": "Great camera. Good night vision. Crisp image. Nice web interface. Does not force you to purchase cloud service. I record my camera's on my pc 24/7 via RTSP(Real time streaming protocol). Camera has alarm(motion) events which will trigger cellphone notifications and also do other things like email pictures or even FTP a copy of the video if an event is trigger. With the wansview cellphone app you can bring up your video any time from anywhere you have internet. These cameras are very well priced and very functional. With great customer support.",
      "rating": 5.0,
      "verified": true,
      "author": "nelson",
      "helpful_votes": 4,
      "publication_date": 20180822
    },
    {
      "title": "Prefer the Other Model.",
      "text": "There is nothing wrong with this product in-and-of-itself. It works as a good camera. But there are other models that carry a very similar price point that do so much more. Specifically, the other models can pan 180 degrees horizontally and can be installed on walls and ceilings (though I suppose doing this in the presence of other people could freak them out). Furthermore, these cameras don’t explain at what speed they stream data to your phone. Sometimes, the picture lags quite a bit, especially if you choose higher resolutions, but unless this model streams much faster images to your phone, the other models just have better features.",
      "rating": 2.0,
      "verified": true,
      "author": ":)",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Flaky wifi - returned this product",
      "text": "I returned this product. Wifi is flaky and doesn't stay stable. The blue LED, after wifi gets connected, stays stable for some time and then starts blinking and video stream stalls. Also, the new Cloud version of this product requires registration before camera can be added to the app - which is irritating. I have the non-cloud version of the same camera, bought 2 yrs back, and it still works fine with my wifi. And the related older app is more convenient to use. Disappointed with the Cloud version of this product. Returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Waste of money",
      "text": "This camera was a waste of money! It takes quite a while to setup (and it's a pain) and if I dare to close the app on my phone then I have to start the setup process all over again. It will randomly go on and offline and just seems to work poorly over all. If I can get it to work the image is nice, but I use my phone for more than just this app so not being able to go in an out of the app without doing the long painful setup process every time makes the camera worthless to me. Needless to say I'm pretty dissapointed since this product had mostly good reviews",
      "rating": 1.0,
      "verified": true,
      "author": "hadassah",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Heat generator",
      "text": "Unit was relatively easy to set up. Instruction sheet was very, very basic. Had to download the manual to answer questions on monitoring, sound, recording, etc. In use, it really did a super job of covering a wide area and provided a superb picture. Tested it for use through a window...daytime was great. Use at night produced a glare and no useful picture. The most serious flaw I found was that the unit really became extremely HOT. The vents were not covered and the unit ws placed where there was air circulation. I was not comfortable using it unattended so i returned the unit.",
      "rating": 2.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 3,
      "publication_date": 20180503
    },
    {
      "title": "cannot setup with 2 phones and 2 access points. The sonic method is unreliable",
      "text": "wansview had a setup where your phone would show a QR code, you'd show it to the camera, and it setup its wireless. It was elegant, it just worked. Instead, they went back to the sonic method where your phone tries to a be modem and blasts a painful sound that the camera microphone is supposed to pick up and use to setup the wireless. I tried it 8 times with 2 wireless access points and 2 android phones, it never worked. The camera stayed in blue flashing mode and never received anything. What a waste of time.",
      "rating": 1.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "App and Camera doesn't motion detect or record after latest update",
      "text": "Camera was good for the price before. Had a few of the older ones, and was hesitant on the newer cloud models, but tried it out. Seemed great, but after the latest update 9.1.2019, nothing records or detects motion anymore. No setting changes do anything neither. Was working great for months besides a few things, was a pretty good camera. Customer service doesn't seem to be able to do anything about the update. Worthless now. Hopefully they fix the problem.",
      "rating": 1.0,
      "verified": true,
      "author": "ps",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "It is an amazing camera for the price point it has",
      "text": "I purchased this since I already own a couple of Wansview cameras( a few K2 and the PTZ camera as well) , they all work great, I have them set up with blueiris to record and use them as security cameras, the app on the iphone is not the best looking one but it works perfectly and is super easy to use. I did have a problem with one of the cameras, the night vision was not working, but the customer service was amazing, they sent a new camera right away when they checked it was not working correctly. This new model is 1080p looks great and it is exactly the same size as the K2.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Zamarripa",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Poor picture quality and defective card slot",
      "text": "I already had an indoor security camera, different make, but I wanted to monitor additional areas so I ordered two of these. It comes with only a very minimal set-up guide and there is nothing more on the company website. Getting the camera up and running was not difficult, but there is no explanation for all the symbols on the screen and absolutely no other instructions. The picture quality is far below my expectations. Nothing like my other camera. I bought an SD card and was unable to mount it in the camera, as it would not stay in the slot. Even though the cameras are expensive, I don't think they are worth what I paid. I'm sending them back.",
      "rating": 1.0,
      "verified": true,
      "author": "dogzmom",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Great quality, great picture and easy setup!",
      "text": "I think the title says it all! I have used Wansview cameras in and around my home for a couple of years now. I keep coming back because of their ease to set up and the quality of the picture.. The K3 requires the new Cloud App and you add camera, scan bar code and you are ready to go! We bought an extra one for vacation to watch the kids when napping in the beach house. Great piece of mind to watch the kids nap on the phone app while the adults enjoyed the patio and sunset! Always bragging to my friends and most of them have left F**scam and come over to Wansview. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Motoman",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "What happened Wansview?",
      "text": "This did not connect to my wifi for me. So I ordered a replacement. Then the app wouldn't connect. Reset app, still wouldn't connect. Modified wifi password incase i included characters that couldn't be used. Still didnt work. Created new sign up for app. Still didn't work. Randomly tried an hour later, worked. The cam still wouldn't connect to my wifi. Lots of wasted time and effort. A big disappointment from the first cam which used the original app. New app sucked for me, hope it's better for you. New cam sucked for me, hope it's better for you.",
      "rating": 1.0,
      "verified": true,
      "author": "iCon",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Cloud Service",
      "text": "They updated to the cloud service you have to subscribe to and now any older wansview cameras you may have will not work on that app, so now i have several cameras that will not work on the new app and a new camera that will not work on the old app. Very disappointing as it was a good camera for the price. A heads up would have been nice. WILL NOT RECOMMEND!",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie j braxton",
      "helpful_votes": 2,
      "publication_date": 20190808
    },
    {
      "title": "Not reliable at all!",
      "text": "This camera is absolutely worthless! It takes forever to connect and if you move it or lose power you have to start all over with default settings. I usually quit after 30 minutes of trying. The camera itself is a very clear image, but connectivity is a major problem. Sending this thing back! Update: The camera has a lot of issues, but I gave them another star because of their customer service. They contacted me several times trying to resolve the problems. If they can fix the issues with this camera, I would try it again.",
      "rating": 2.0,
      "verified": true,
      "author": "Jon Barnett",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Device doesnt connect to wifi",
      "text": "Great picture and night vision quality. However this camera is difficult to setup, doesnt stay connected to the 2g network wifi, doesnt save recordings to the SD card. I've contacted tech support multiple times trying to get a solution and they keep telling to me to reboot, reinstall the device and app, change the password. The camera still doesnt connect after multiple attempts. When it was connected, I had to manually turn on the viewing feature which was a waste of time. I cant return the device because I ordered a while ago.",
      "rating": 2.0,
      "verified": true,
      "author": "Mz Lady",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Fried my WiFi & Computer",
      "text": "Not sure how but his fried my WiFi and computer. When I tried to login to the Wansview it kept telling me that the site was actually another site pretending to be wansview cloud and my personal information was at risk. This was days after I had been signing in. The same day I started getting this error signing in, my wifi quit working and my computer totally became unusable. I have no idea how this happened but I unplugged the camera and uninstalled wansview app and wifi went back to normal but computer was still unusable. Threw this in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazonlady",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Great product! Totally recommend!",
      "text": "I'm just a normal person that has never used one of these security cameras and I should say the setup was very easy. The lens is great because you can see a wide range of the area you're recording. Also, the app has great features, more than what I expected for the price I paid. I can see what my dogs are doing while I'm gone. Although I can talk to them through the app, the sound they hear is not great, but it's a not a huge deal for me. However, the audio I receive from what's live, is great! I would totally buy another one and recommend anyone to buy one.",
      "rating": 5.0,
      "verified": true,
      "author": "Yajaira",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Poor Wirless IP Camera",
      "text": "The camera heats up a lot It’s very complicated to configure to the wireless network The motion detection alerts don’t work, it only like a baby monitor, not as a surveillance or security system Te camera don’t record or take pictures when it detects movements. But the worst was Wansview support service. if you contact to say any problem with your camera, the Wansview solution is to buy a new one in Amazon and write a positive review, then you send them by mail checking this review and they will refund the ammount that you pay for the camera, this practice they call \"Test procedure\" I Think this is illegal, Amazon should take actions with this supplyers",
      "rating": 1.0,
      "verified": true,
      "author": "Alfredo Hernandez",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Best camera I’ve bought for a good price.",
      "text": "Love these little cameras! I had two other Belkin cameras previously and all I ever had with them was problems. These much more inexpensive cameras have been great over the length of time I’ve had them. The image quality, wide angle view and features on this camera made me happy I invested in a product that has been built well. I also have the battery powered camera from Wansview which helps for portability outside or in and this camera I specifically use inside to keep an eye on my kids. Currently looking to get a couple more of these cameras throughout the house and definitely one I have recommended to family.",
      "rating": 5.0,
      "verified": true,
      "author": "samuel",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Not an effective baby monitor",
      "text": "The Wansview is advertised as a \"baby monitor\", however it's not an effective way to monitor your baby. On a traditional baby monitor, the video can be turned off while the sound stays on. This way, you can leave the monitor speakers on all night and hear your child if she wakes in the middle of the night. On the Wansview, there's no way to power down just the video, while leaving the speakers on. If you want to monitor your baby through the night, you have to leave your phone on, with the video running. The app will unnecessarily drain power and may even overheat your phone.",
      "rating": 3.0,
      "verified": true,
      "author": "JV",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Simple Camera Can Still Do a Great Job",
      "text": "I bought this camera in April for my home so that our daughter can watch her new daughter with us as we keep our granddaughter for her. It worked so well and I can talk through it even when I'm away on Wifi, that I got one for my church. The camera uses a SD card that I can put in my computer. like a photo camera SD card, and I have the movement. I can see the church at night quite well and my daughter can watch us on the other one at home and hear the squeals and fun of our granddaughter.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Pittman",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Good camera, except ...",
      "text": "Good camera, except 1) motion detection sucks (might be better if you use the built-in browser-based admin pages to set up to 4 zones in the view, but I ain't downloading the free video plug-in for IE) 2) motion detected videos are way too long, so they are huge in size and I don't have time to look at or review useless footage. 3) documentation needs some work, especially regarding the browser-based admin pages. (Linksys cameras from 10 years ago had all this nailed down). On the positive side, setup is the easiest that I've seen, image quality and wifi range are excellent, the app is fast and well done (on Android) and it's a good price.",
      "rating": 2.0,
      "verified": true,
      "author": "kyboy",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Don't waste your time",
      "text": "Trust the reviews and steer clear. Ultimately we got two, being excited about the cheap price and ease of use. Turns out they go offline ALL THE TIME for no clear reason, it takes forever to get them back up on the network, if we even can, and ultimately they are just very very unreliable. It's a waste of time and money. BTW, we live in a 1200 sq foot home, so we have little interference, and there is no pattern to a specific use of other devices, network strength, etc. for why they would go down.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth BaurTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "High quality camera for the price, very easy setup",
      "text": "First of all it is very easy to setup, just follow the instruction. I did own several wifi cameras before and this can be the best ENGLISH manual ever. Wide 120 degree viewing angle work great. I also own a Wansview 720p K2 camera, and this 1080p K3 has wider viewing angle even both claim 120 degree. I did try record some video without any problem. High video quality when it has enough light sources. Decent night vision function too. Camera is compact enough for me to hide among furniture. Overall it is a high quality camera with this price. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack L.",
      "helpful_votes": 2,
      "publication_date": 20171229
    },
    {
      "title": "Great quality for price",
      "text": "Love this camera! It works so well. I’ve been using it for a few months now with little to no issues. Only issues was it quit once, but when I did a restart it was fine. No complaints. The picture quality is clear and amazing. Picks up sound almost too well. And the motion sensor is very sensitive but you can adjust the setting. It’s also very easy to position to the perfect angle. I like that I can press the speaker and talk to my baby. Can also record pics and video to share with someone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mizz87",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Cloud expensive.Easy setup and use. Looks good both day and night",
      "text": "This was easy to setup, video looks really good. App was easy to follow and camera seems sturdy and fairly small so is descrete if u find same colored background or hiding place. Only downfall is need to have memory cards or their cloud storage which can get expensive if on a budget and have several cameras. It's 70 for 3 cameras/7 day storage. 100 for 5 cams /15 days and 170 for 7 cams/30 days. U can download to phone, PC or tablet but not tried that yet...so not sure if u can do that remotely. Also not sure if u can download from memory card or if u can clear something from card remotely.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathleen trout",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Do not buy, wildly frustrating product and app",
      "text": "Do not buy the \"Cloud\" version. We have had 2 on the old app for over 2 years and they work great. We just bought a new one thinking it would be the same and it requires a completely new app. I have been struggling to get it to work properly ( made a new account, then it does not recognize it, added the new camera, then it forgot the device, and now we are unable to use it altogether due to app glitches). Very disappointed with the new cameras, buy the old versions or buy a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian ",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "GREAT CAMERA FOR THE PRICE",
      "text": "This is my second camera from Wansview . The camera is a 8.5 out of 10 . My only issue for the camera is the clearness of the 1080 I think could be a little better. Don't let me discourage you ,It is a good camera quality , just a slight issue . Sound is good and clear. Web site program you can't change the night vision on or off. Works fine on app. on my phone. I thinking of getting so exterior cameras from them in near future. I would buy this one again and their other ones.",
      "rating": 5.0,
      "verified": true,
      "author": "bill",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Worked well so far.",
      "text": "This device worked very well for 13 days and then it went offline and would not reconnect back. I tried reset but it still went offline. Now it is useless so it goes back to the 3rd party seller. UPDATE of 6/27/18 After the seller learned about my defect camera, they sent me a replacement. So far the replacement camera works fine. I appreciate sellers who stand by their product and make efforts for improvement.",
      "rating": 4.0,
      "verified": true,
      "author": "Wei",
      "helpful_votes": 2,
      "publication_date": 20180615
    },
    {
      "title": "Pleased",
      "text": "I have other Wansview wireless cameras that you can view content in the present time. However, I wanted a camera that I could view past content and this one comes with that capability. It has a SD card slot. We have two dogs and one of them is peeing in the house. And since camera records when motion is detected, I am able to see which one is guilty. And I did! I viewed the recording on the memory card. I am unwilling to pay for Cloud storage. Too expensive and not necessary for me. Cameras were not difficult to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "These are excellent cameras and a great value",
      "text": "I have several Wansview cameras used for monitoring my Apartment and my Mother In Law's house. Excellent picture, night or day. Good Sound quality, as well. These enable us to monitor Mom and her health aides from far away. Also, I can keep an eye on my street (for parking and package delivery) and the interior of my home when away. Recently, I needed assistance with the Camera and the Customer Service from Corrine was excellent. They sent me a script to fix and issue I had with the reset feature. I followed the instructions and the Camera is back working.",
      "rating": 4.0,
      "verified": true,
      "author": "TheGam",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Great indoor camera",
      "text": "I bought this camera to keep an eye on our dog during a trip and watch for the sitter to make sure the dog got fed. It works great and takes a beautiful video. The night vision functions wonderfully and transition decent. The option to talk and hear are great but lag and you can't talk and hear at the same time but not bad for a cheap security camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Blackwood",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Great camera for watching baby",
      "text": "I bought 2 cameras to use in our little boys room and for our new baby. Both cameras connect great to the app which is easy to download and set up. Only 1 phone can use the app at a time which is a little disappointing but also good because you know if someone else logged into the account. The motion detection seems a little to sensitive, for a lot of my detection recordings were of a moth flying toward the constant soft light on the camera. It does everything it’s made to do and my husband and I are very happy and use the cameras often!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. & Mrs. Carpio",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Great budget camera",
      "text": "Often the most important thing to prevent theft is a deterrent. So I ordered a few of these for that purpose alone. I was pleasantly surprised that it has a crisp image with decent settings. I use their app to look at the feed live at any time, and I save everything on a loop with ssd's. Ive checked the footage to make sure it is recording properly and it does just fine. The night vision is great if you tweak the settings right. For the price you really cant beat these. They work on my wifi a good distance from my router. Ive had them for over a year now with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Nice picture but software needs a little work.",
      "text": "Nice price and good picture. The software could use some work. Other software is available and works very well with ONVIF-COMPLIANT software. Support was very responsive to help me get the entire camera set up from recording to the SD card while also recording to my computer so I always have 2 copies of the video's. Update: I have had this camera for a few months now and I started having a connection issue but support was still very responsive and helped me get it figured out. The app still does need some work but you can use these with just about any app so that hasn't been much of an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "loco1529",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "That are great but...",
      "text": "I got 2 camaras. The set up is easy and the camara for the price is great. Reason I'm giving 2 stars is because I had to return one of them. When I was going to conect the cable to the camara it had a missing part and I had the inconvenience to have to return and I needed it right away. I ordered replacement and 2 more camaras hoping it was just a one time thing and hopefully the other come okay. Will update when I set up the rest.",
      "rating": 2.0,
      "verified": true,
      "author": "magali vazquez",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Easy, clear, motion detection, night vision",
      "text": "This camera does everything I need it to do. It records a 30 sec video upon motion detection which I can then either view on my app or download to my PC. It also has really good night vision. I never miss an action when something moves on camera. It is also on WiFi so I don't have to run a cable to the camera. The picture is very clear. I am most impressed with the clarity of the night vision. It was also very easy to setup, basically plug and play.",
      "rating": 5.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Keeps an eye on stuff for you....",
      "text": "I have two versions of these cameras. This is the non-cloud version. I can still view these cameras from anywhere on my mobile phone. I use these cameras in a variety of ways, but one way lately has been to monitor the temp and humidity in my house. So, I'm having them perform double duty for me. The app is easy to use, the configuration of the camera takes minutes and the support folks at Wansview are always helpful. If you need an inexpensive way to monitor your house, a garage door, a dog, a child.... a thermostat... this could be your answer. Thanks, Kevin. :^)",
      "rating": 5.0,
      "verified": true,
      "author": "KEVIN G",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Great second camera",
      "text": "The K3 is an excellent addition to my already installed Q3. It is smaller, lighter, and great for rooms that do not require the pan and tilt features of the Q3. Adding it to my network and Wansview app took less than 5 minutes. It was actually faster to set up than the Q3 was. The 2 way audio is excellent. It is loud and clear, which is great when you need to whisper in public while remotely telling you pet to stop misbehaving. Customer service has been great to deal with. They have instructions for setting the camera with other apps, too.",
      "rating": 5.0,
      "verified": true,
      "author": "JustnJoy",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Constantly disconnected .",
      "text": "In emails with company discovered that its wifi range was not as described . had to move it within 20 feet and yet it still constantly disconnected and I had to reboot from home often. Tried updated version and it was not better. Their tech support blamed it on my wifi yet in have many connected devices over 4 channels and zero of them ever have this problem. Would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Lemonyfresh",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Good Camera, Good Price",
      "text": "For the price, I think this is a pretty handy camera. The setup is relatively easy. I use this for monitoring my pets while I am away from the home. The image quality is very good in my opinion and it's really nice to be able to use the mobile app to see what is going on remotely. It fits my need very very well. I was looking for a good quality image for not a ton of money and this accomplishes that!",
      "rating": 5.0,
      "verified": true,
      "author": "agford4x4",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Does not work with TinyCam, BlueIris, or p2p, or Onvif, or RTSP",
      "text": "Does not work with TinyCam, blueIris, p2p, onvif, rtsp and does not work if you do not have internet. The camera has to connect to their servers before you can use it on your phone. I block this for security reasons, and it will fail to connect to the master server. Older k3 models used to work just fine with TinyCam.",
      "rating": 1.0,
      "verified": true,
      "author": "Tcabez",
      "helpful_votes": 2,
      "publication_date": 20190428
    },
    {
      "title": "It was pretty nice while it lasted...",
      "text": "I installed this in a very short amount of time, that part was cool indeed, I was impressed. Looking out my front window at the world was pretty nice, decent quality pictures, so-so video. Big lag time, over 3-4 second pauses on my very lightly loaded router/wireless connection, and now - one power failure later it's offline, and refuses to return to life. About the lifetime I've come to expect for cheap chinese widgets - I'm pretty much done with the genre. I got what I expected out of it, not overly disappointed - it's par for the course.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Perfect little camera",
      "text": "I wanted to get just a camera that I could keep an eye on our dog when we leave the house. This is the perfect little camera for doing just that. What surprised me the most was the great clear picture. Plus it was so simple to set up. Just follow the directions. The one thing the directions said was to make sure it was close to the router. I did not have to do that my router is upstairs I set it up downstairs in my living room. Love this little camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannine Dalton",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Great versatile and cheap cameras",
      "text": "I love these cameras. They work great with ivideon, most Linux apps, can broadcast RTSP feeds. They are very easy to configure and the wansview app works great. What's most impressive is the wide angle view, I place these guys in a corner of any room and I can see most of the room. They stay connected to my wifi most of the time, although they do drop out on occasion. Can't beat the price though.",
      "rating": 5.0,
      "verified": true,
      "author": "ML",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Surprisingly impressed",
      "text": "I bought this on sale and was not going to be upset at the issues I expected to encounter. But I was impressed how easy it setup and was VERY surprised that the app (available on mobile, Mac, and PC!) for managing the camera is pretty fleshed out and simple to use. UPDATE 10/2018 - Continue to be impressed with this camera. I have it recording 24/7 to the flash card and it pulls up and plays videos from it very quickly. Most units are slow or sluggish switching video to video and playback and things. This camera is snappy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex Henderson",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Great Camera but App needs work",
      "text": "The camera works great. Clear and wide angle. Night vision is good too. However, the app sometimes fails to find the camera, or it doesn't go \"online.\" If I quit the app entirely, and restart it, everything works fine. We have also been unable to successfully add additional users. Maybe that needs to be done on the home network first. Still need to try that.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Cadwalader",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "I cannot believe the setup is so easy. Only 10 minutes and everything connected",
      "text": "This is my first wireless camera. I cannot believe the setup is so easy. Only 10 minutes and everything connected. The camera has QR code which make the configuration much simpler. Once I download the app, scan it and follow a few simple steps and everything is done. The picture is crystal clear. The app has two options to view as 480 or 1080p. Really simple to switch for different mode. So far, I like it much better than my current wired system. The only thing I wish if this camera comes with a longer power cord. Other than that, I am happy with my purchase. Will update if I find anything I like or dislike later.",
      "rating": 4.0,
      "verified": true,
      "author": "DAP",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "App sucks",
      "text": "I bought this as a nanny cam for my daughters room, I have several wansview K2 cameras and thought this might be better quality. Resolution is better and image quality is better. My problem is with the app. Wansview cloud requires a subscription to store video recordings... and I'm unable to get the K3 to connect to the regular wansview app which doesnt have any issue recording on my PC. Camera is great if it would just connect to the other app....",
      "rating": 2.0,
      "verified": true,
      "author": "Kovan",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Device Caught On Fire!",
      "text": "I highly recommend that you do not all this product into your home. When it was working, it worked well. Unfortunately, after 6+ months of use, the camera began to smoke and luckily I was able to smell the smoke and unplug the device. I discovered that it burned the SD card that was inside as well. I contacted Wansview at their phone number and received no answer. I have submitted an email to them, but would likely require a different product or complete refund - do not trust this camera.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Powerful little wireless camera",
      "text": "This camera is very small with big results. I have installed it in my bedroom where my little dog stays during the day while I'm at work. The camera has a wide viewing area, I can talk to my pet, she can talk back. The sound and picture quality are very good. You can view and communicate through your cell phone by downloading the wansview app. I have also downloaded the software on my computer for even more viewing options. The customer support from Wansview is outstanding. I have purchased other cams from this company, and they respond and solve my issue by the next day. I'm very happy with the camera and the support from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Farmer",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Excellent camera for the price!",
      "text": "For the price, this is an excellent camera! I’ve had it for a few months and I love being able to keep tabs on things when at work... even if it really is just to look at my pup and lower my blood pressure! Picture is good and sound is clear. The speaker function works well. The only issue I had was WiFi set up in the bedroom camera as my router is in the living room. I managed by stretching the camera out to the hallway to angle it well enough to get a signal.",
      "rating": 5.0,
      "verified": true,
      "author": "JuliaGulia",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Easy setup, great price for small scale monitoring",
      "text": "This is a great camera for the price. It had quick and easy setup that had the camera up and running in minutes. The picture quality is good and viewing angle is acceptable. There have been firmware updates that have added some nice functionality and improved streaming as well . I was also able to quickly share the camera access with my wife with the application. Only complaint is SD card setup and functions arent 100% seamless, but manageable. Overall a great purchase and happy I decided to try it out.",
      "rating": 4.0,
      "verified": true,
      "author": "Shifty-Tips",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great quality for the price!!",
      "text": "I just set this up yesterday to view the front of my home and view is excellent. Setup was a little annoying because the book doesn’t tell you to name the camera the exact name of the camera in the following format “CAM_12345”. If you don’t the camera will not connect to your WiFi. Other than that I was able to add it to the app ( this is my second Wansview cam) so I can toggle between my indoor cam and this one. It’s great quality for the money and I recently recommended it to my Aunt who wants a camera she can view when away from home.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelbrea McCleese",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Good Camera so Far",
      "text": "At first the camera could not connect to my 2.4 GHz wifi although the description on here says it would, so my husband contacted the company and they responded to him the next day. It's working now. We use it from an inside window to monitor our car and garage area. The app is ok. Wish there was a way to rewind a recording instead of having to watch the whole video through. It records in 15 minutes increments. It gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Changed the product midstream! Wasted my time!",
      "text": "I have a fleet of Wansview cameras running BlueIris ; they switched to a “cloud” version (not the same as advertised which is not comparable with blueIris or their other software I waisted half a day!",
      "rating": 1.0,
      "verified": true,
      "author": "CHARLES E",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "Stops working after a month",
      "text": "Bought this camera on March 9th, I used it inside my home to watch my dogs while i’m away. The camera was amazing at first. Both the pictures and videos were very clear but suddenly stopped working after a month. I’ve tried plugging and unplugging, tried updating the app even deleting the app and reinstalling but continues to say camera is offline and I am unable to use. Super bummed",
      "rating": 2.0,
      "verified": true,
      "author": "heather mendoza",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "Camera was initially easy to set up and connect to wifi",
      "text": "Camera was initially easy to set up and connect to wifi. Do not purchase if sole reason is for motion detection. For me, it did not capture motion on the low and medium settings and when I set to high, it captured too much artifact/recorded when nothing is there. Then, after 3 weeks, the camera all together stopped working and would not connect to my network. Tried deleting camera and re-installing with no success. Contacted the customer support, they were always quick to respond, but were unable to solve the problem. Would not recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "CeCe",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Fine until it quits in 2 weeks",
      "text": "Mostly worked for the first two weeks we had it with occasional connection issues but then one night it just quit with no warning or reason. Resetting it, unplugging it, all the trouble shooting instructions didn't work. *Update* Was sent a 2nd camera as a replacement by the company and that one stopped working within a week of installing it. It conveniently broke in the middle of the night while my son had the stomach flu, so I couldn't check on him without waking him up. It seems to only hold up for a month or so, just long enough you can't return it for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Nelson13",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Camera works great. I recommend it.",
      "text": "I used this camera to keep an eye on my grandmother until she passed, and I now use it to keep an eye on my dog when I'm not home. The camera is great, and it even works at night thanks to the night vision. My only issue with this model is that it needs to be manually adjusted for a different angle, however, there are models that are just a tad more expensive that you can purchase that have that capability so I will not fault it for that. Overall, great price, and works just as it was advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Perez",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Uncertain",
      "text": "Don’t call for Customer Support, it’s a joke? Don’t buy additional cameras for same set up, it gives you era code! Entering same password as initially entered will not work on another set?? Call for help, 9:0” PM - 6:00 AM EST... wearied! Think I woke the young lady up, she asked soma y technical questions! Totally Confusing, I doubt if I’ll ever get the others to work! Very frustrating..",
      "rating": 1.0,
      "verified": true,
      "author": "The King",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Camera needs multiple reboots a week and currently will not connect to my internet",
      "text": "Update: I have had this camera for 8 months and it's constantly going offline and I have to reboot it. When it's working it great, when it isn't I am very frustrated. This time I have gone through multiple steps and can't seem to get it connected to the internet, which makes it useless right now. I am hoping the company will help me with this. We will see. I love this camera for use when I am out of range for my regular baby monitor.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Absolutely useless",
      "text": "Was so excited for this camera. Only to find out it is by far the worst camera I’ve come across so far. You have to keep the app open if you want to record. When I would be out and go to check on my son it would say not connected. So I would go home delete the camera and redo the set up process only to have the same issue. This is continuing to happen. The point of me getting this camera was for safety and peace of mind. Now I’m stuck with a useless camera and have to purchase another one. I want a refund and I want it now.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexandria Galante",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Easy setup, good quality, excellent for the cost, not compatible with olds wansview app",
      "text": "These cameras were extremely easy to setup. The instructions were clear and it took only a few minutes on my iPhone. The picture quality was good, including the night vision. I don't think that can be beat for the low cost. We already had the prior version of the wansview cameras that were older than the Q4. These new cameras use the \"Wansview cloud\" app. So, the only downside for these cameras is that if you already own old wansview cameras and use the \"Wansview\" app, then you will need to use 2 apps to see all your cameras.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric, Robin, & Debbie",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Perfect to monitor dog when away",
      "text": "I bought this to watch my dog when i was out of the house. It was easy to setup, easy to move from one location to the next and perfect for my needs. Day or night i can see clearly into the room and see what my dog is doing and give me comfort when I'm away that she is ok. I turned off the audio capabilities because she would get confused hearing my voice but the bi-directional audio works nicely too. I don't use it for motion sensing since I'm watching my dog and not looking for intruders.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Greenwald",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Amazing for the Price",
      "text": "I wasn't sure what to expect on a $40 camera, but I was pleasantly surprised. The app is simple and functional, and can be used even far away from home (I know some cameras require you to be hooked to the same wifi, but not this one). I think my favorite feature is definitely how well the night vision works. I use the camera to keep an eye on my dog while I'm not well and it works amazingly, even at night. Also- the camera has a really wide scope and covers a lot of area. The two-way audio also works really well, and the speaker on the camera is actually a lot louder than I expected! Overall, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabby K.",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Great little cameras",
      "text": "I have four of these. Two are the older model. I use them to keep an eye on my four small chicken houses while I’m away. We are about to put one on the goats because one is about to birth her first baby. The cameras were easy to set up and I found the iPhone app easy to use. The old cameras and new cameras are on two different apps though. Would not hesitate to purchase another.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamato5kids",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Nice little camera.",
      "text": "Really nice, for the price. It's small, but the picture is clear. There's a tiny bit of curvature to the picture. I think it's because the lens is so small, but not at all a problem for me. I was a little concerned about it only being wireless, due to where I'm putting it ( I had already run Ethernet cable to the location), but it connects to my router just fine. Set up is very easy. My usual cams require manual IP setup, but this was nearly automatic. Haven't had to contact support, so can't comment on that, but at this point, I'm satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "RSM61",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Cannot play back on computer",
      "text": "We thought it was great until something happened that we needed the clips for. pulled out the SD card and my laptop keeps saying the file is not supported by my computer. I have Windows, which was stated to be compatible with. and it's not. The only way I can record video is if I am doing at live from the app. Other than that it's a waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Lattanzi",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Worth every penny!!!",
      "text": "I love these cameras. I had a baby monitor which cost 4x the amount of one of these that broke after one year. Instead of wasting money on another baby monitor I decided to give this a shot. WORTH EVERY PENNY! The customer service is top notch. Bought a few more for the play room etc.",
      "rating": 5.0,
      "verified": true,
      "author": "wmubtyler",
      "helpful_votes": 4,
      "publication_date": 20171020
    },
    {
      "title": "Works Great",
      "text": "Love this little camera. It's perfect for if I am not at home and want to spy on the house. I love having it for peace of mind in case someone was to try and break into the home, you can talk directly through the camera through the app which is a huge plus. Need to go purchase an SD card to so I can setup the recording feature. The picture quality is pretty good for a camera. Wi-Fi cameras make me very nervous as people can hack into them. Here's to hoping no one can hack it. Great camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Dog Cam",
      "text": "We purchased this camera because we needed something with better quality to see our dog who was home. He has a lot of medical issues and he’s a baby lol so we needed to keep eye and ears on him When we leave. We are able to see him and talk to him. He’s not a fan of the camera. Like I said. Baby. But we like the extra security to see him.",
      "rating": 5.0,
      "verified": true,
      "author": "AshleyTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Not to happy with this newer version",
      "text": "I use this camera to check on elderly parents. I don't like the fact that you always have to sign in Everytime you open the app. Also can only share this camera with 3 other people. My other older wansview camera is much better.",
      "rating": 2.0,
      "verified": true,
      "author": "James L. B",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "No Software Support - No ONVIF",
      "text": "\"New Version\" does not support ONVIF, nor web-based access via IP. Can not connect to iSpy, nor the original (old) version of Wansview app. As I have multiple cameras connected via the old app, an additional camera and additional app is useless. Wansview support confirmed these findings. If you simply want a cloud camera and one-app support, this would work.",
      "rating": 2.0,
      "verified": true,
      "author": "CP",
      "helpful_votes": 2,
      "publication_date": 20190521
    },
    {
      "title": "Ended up replacing this camera with the way way way better Wyze camera",
      "text": "I had to return this camera because it would not connect to my wireless network no matter what I did and after trying so many different type of troubleshooting steps. The manual was lacking and not good. Fortunately, I purchased the Wyze camera when returning this camera. The Wyze camera was so much easier to set up on my wireless network, had a lot of features and better features for its price point.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Good picture, too slow to load, great customer service",
      "text": "This camera has a pretty good picture, but it is too slow to load when it does load and most of the time it doesn't load at all. This may be an app issue, not sure, but it renders it pretty much unusable. I would not but buy again. I wish I kept the box and everything so I could return it. Update: changed rating based on the terrific customer service. They bend over backwards to take care of you. They even initiated everything.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie N.",
      "helpful_votes": 2,
      "publication_date": 20180213
    },
    {
      "title": "Very good imaging, great support",
      "text": "This camera has great imaging capability even in the dark. Much better than other cameras I have owned. I had some difficulty getting it to connect when I first purchased it. Fortunately there is very good customer support by email and they were able to resolve the issue. The camera appears to be very high quality but like many others, my only problems have been with the app which will get corrected with new revisions.",
      "rating": 4.0,
      "verified": true,
      "author": "Lytspace",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Great product well worth the money.Still getting good results after several months;good product.",
      "text": "Received this system fast and exactly as advertised; I'm giving it 5 stars for this price, and quality. This is a Good home security camera; I have absolutely no experience with video security systems and this was incredibly easy to install and setup, took around 4 minutes. This system works as expected, it captures crystal clear images; even during the night picture quality is so, worth the money. I can use the app to connect to the camera miles away from home and watch the videos on my phone in real time. I would definitely recommend this security camera it’s simple to install, picture is high quality, and it’s affordable; it is well worth having.",
      "rating": 5.0,
      "verified": true,
      "author": "Lin",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "update:",
      "text": "update from my last review... it was working fine (4 months), still don't care for the fact that you have to open/run an app 24/7 to get any actual notifications (that's a DOWN FALL).then a few days ago I heard two a loud beeps. now it won't even connect online (it shows offline in app). tried uninstalling/re-installing-setup and nothing. update: was contacted, and they were VERY friendly and helpful. They sent me a replacement that arrived within days. Thank you :)",
      "rating": 5.0,
      "verified": true,
      "author": "Brittane Bee",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Mediocre...",
      "text": "Love the size of the camera and price. Setup and installation was easy. However, if you are using this camera and it's software to monitor a live feed from you desktop, it it mediocre at best. The software has a horrible interface and it's clunky to use as an ip camera through an internet browser. We had to find third party software to have the features we wanted in the first place. Update your software Wansview! Clean windows with options please!",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Its good for the money. Has issues.",
      "text": "The camera gave me issues trying to connect to Wi-Fi. The picture is ok at 1080p. But the frame rate is absolutely horrible in 1080p. The lag is hideous. In 480 it looks like it's in 240 resolution. It's not very good at all. There is no way it's in 480p. Frame rate gets better and smoother in 480p. Customer service is a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180121
    },
    {
      "title": "Better than expected",
      "text": "I bought this to try them and didn’t expect they was gonna be SO GOOD!!! Super easy to install. The customer support is AMAZING. They answer quick and super friendly and very helpful. I bought 4 and going to buy 1 more. I use them to monitor my kids at home while I’m at work and I can even talk to them. The audio is not that great but it gets there attention. The video quality is AWESOME for the price. I put one in the kitchen and I zoom in to check if my son turned off the stove after he cooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Parr",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "After six months use keeps losing connection.",
      "text": "I initially loved this camera. It has a good wide angle view with sharp picture. Although unorthodox (no hardwire ethernet connection necessary), the setup process worked well. However, after six months use I could no longer receive video from it. I reinitialized it and was good to go... for about two days. I can't recommend this camera because of the problems I am having.",
      "rating": 2.0,
      "verified": true,
      "author": "DutchJR",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "I adore them",
      "text": "I have multiple cameras spread around my house. I LOVE THEM! They are small , discrete , efficient, powerful, clear image, easy to install and operate. I can keep on eye on my kids and check my house and my garage 24/7. Amazing quality , very affordable, I strongly recommend the product . AAA+++",
      "rating": 5.0,
      "verified": true,
      "author": "Attila",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Wainsview has extremely satisfied customer service",
      "text": "Wainsview has extremely satisfied customer service. I ordered 2 cameras (K3). HD camera with great image/video quality simply to setup and mount easy to operate/control for the money. One of the cameras I bought had an issue with night vision that might happen with anyone. But their customer service professionally took care. All my emails returned promptly and with the information needed. I received a replacement camera in 2 days. They do really care. To sum it up I am a happy customer and will continue to order more Wainsview cameras!",
      "rating": 5.0,
      "verified": true,
      "author": "Volodymyr",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Gives me peace of mind!",
      "text": "After doing some resesrch, I decided to try this camera. I need to go to work to pay bills. My aging mother has many health issues. This gives me peace of mind to check on her through out the day. I'll be adding 3 more devices to the app in other areas of the home in the near future. Easy to install. I found pressing the WPS button on the device and on the Internet router, it connected easily. You can't go wrong with this. No monthly fees!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Valtierra",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Mini but mighty!",
      "text": "If you don't need a tilt feature, this little guy is fantastic! We own a few cameras from different brands (including a couple of Wansview ones that do tilt) but we moved and needed to add a few more to our new home, so I decided to give this guy a try. Very nice surprise! It's a small and discreet camera that offers great image quality. Can't speak for durability because I've only had it for a couple of months but the performance so far has been great. Just wish they had a discount for buying multiple units.",
      "rating": 5.0,
      "verified": true,
      "author": "B.Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Great for our new puppy!",
      "text": "I mounted this in our mud room where our new puppy sleeps in his exercise pen. This camera is so great to use when we're gone or even when we're in a different room in the house. We can see if our dog is awake from a nap, etc... I love it when I'm out running errands because if he's still sleep, I can do more shopping :) Great camera that works perfectly with my iPhone!",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Overheats and resets but does not connect",
      "text": "Purchased these cameras thinking they were the old one that can have direct ip access. These camera use the new wansview cloud app . Cameras worked fine for 4 months until they would reset and not reconnect to WiFi unless it’s unplugged. It resets at the same time every few days. Only use it as a nanny cam connected to a WiFi switch.",
      "rating": 1.0,
      "verified": true,
      "author": "J-Koneezy",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Great little camera!  Great update from Previous Generation",
      "text": "I recently added this camera to a group that I had already purchased. This one is a new generation and utilizes a much more user friendly app. Now I want to replace all of my other cameras. Unfortunately, they work on two separate apps at the moment. But so far, this camera is performing very well. Wansview has great products and I haven't had any issues with them yet!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Davidson",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "VERY NICE PRODUCT",
      "text": "Works great all these time - great color and night vision with nice wide angle viewing. When I got a little set up problem when the power was out. I email for help and the customer service response within reasonable time (even though I already solved the problem after the request). Didn't set up motion detection function. I will buy another one from them.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigkids",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great camera, great value. Love these cameras.",
      "text": "I have have been using my Wansview cameras as baby monitors for the past year, and they work great for this. One camera is in the baby’s room, the other is in the living room. When our baby is playing or sleeping, we can easily keep an eye on what baby is doing. The night vision resolution is quite good. We’ve even taken a camera with us and connected it to a battery pack and tethered it to a mobile wifi device when traveling. Super easy setup. I’ve set up other similar cameras for family and the set up wasn’t near as intuitive. I have a third camera that I use to monitor the garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Ligia P",
      "helpful_votes": 0,
      "publication_date": 20180511
    }
  ],
  "product_meta": {
    "title": "Wansview Wireless Security Camera, 1080P Home WiFi Surveillance Indoor IP Camera for Baby/Elder/Pet/Nanny Monitor with Night Vision and Two-Way Audio-K3 (White)",
    "rating": 4,
    "feature_bullets": [
      "【Easy setup with 2.4G Wi-Fi】: important tips before connection: IP/network-2.4GHz wireless(incompatible with 5GHz). if your router supports both band, please connect mobile phone with 2.4G Wi-Fi download Wansview app on your mobile phone so as to configure 2.4G Wi-Fi to Wansview 1080P camera step by step, no complicated setting needed of this wireless surveillance camera.",
      "【Mini security HD camera】: Wansview 1080P Wi-Fi camera is super slim(lengh: 60mm wide: 60mm) but comes with 8 feet power cord far enough to reach faraway power socket( no battery inside, need direct power supply). easily mount on your wall, ceiling or table. And micro SD card (max 128GB supported) for alarm video recording and playback.",
      "【Wider vision & multi-view】: remarkable view with super wide 120 Degree viewing angle, with an adjustable base, you can manually adjust the viewing angle, Use one Wansview wireless camera to capture an entire room without ever having to pan or tilt. Multi view for several home cameras monitoring at the same screen, so you won't need to switch one camera to another to check what happening for a certain camera.",
      "【Excellent day/Night vision & Crystal two-way audio】: intelligent IR CUT switch ensures clear and high quality images day and night. Four IR LEDs, night vision up to 20 feet in pitch dark. Built in mic and speaker offer you a smooth conversation with your family at anytime, anywhere with your mobile phone, tablet or PC.",
      "【Excellent compatibility and customer service】: supports remote viewing via iOS/Android mobile devices, Windows PC, and Apple Mac system.if you have any problems, please send email to service@wansview or call 3236863288 on 6 PM ~ 3 AM (PST) monday to friday. Full return & exchange service within 60 days and technical assistance."
    ],
    "specifications": {
      "Package Dimensions": "7.1 x 5.1 x 1.7 inches",
      "Item Weight": "10.2 ounces",
      "ASIN": "B075KGNB58",
      "Item model number": "K3",
      "Customer Reviews": "4.0 out of 5 stars2,454 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#1,716 in Camera & Photo",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 12, 2017",
      "Manufacturer": "Wansview"
    },
    "categories": [
      "Surveillance Cameras",
      "Video Surveillance",
      "Electronics",
      "Camera & Photo",
      "Dome Cameras"
    ],
    "price": ""
  }
}