{
  "website_summaries": [
    {
      "verdict": "Large makeup-removing cloths that are silky, not greasy, and eliminate the need for abrasive rubbing.",
      "pros": [
        "Good for sensitive skin",
        "Individually wrapped so they don't dry out",
        "TSA-approved for carry-on bags",
        "Can remove heavy, waterproof makeup without drying skin",
        "Contains vitamin E and other beneficial ingredients",
        "Biodegradable and not tested on animals"
      ],
      "cons": [
        "Some reported a strong, unpleasant scent",
        "Does not always remove waterproof makeup"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "FANTASTIC",
      "text": "I discovered LaFresh when two were left as an amenity at a hotel. I tried it and loved it! Checked Amazon, and of course, it was available! I love how these work so well to remove even heavy makeup, and leave your skin soft and refreshed. I also found I could get away with only half a sheet per use, and stretch how long these will last. I will always have them now. So glad I got them!",
      "rating": 5.0,
      "verified": true,
      "author": "CarolynCAG",
      "helpful_votes": 40,
      "publication_date": 20161012
    },
    {
      "title": "Best wipes ever-great for traavel",
      "text": "I first discovered these wipes at a B&B and was happy to find them on Amazon. These wipes are indiviually wrapped so they do not dry out like the multi packs. They are also easy to tuck in tyour gym bag or purse. I like to pack these when I travel overseas where most hotels do not have washcloths. I have sensitive skin and these wipes not only clean well, they are very gentle. As a side note- they clean mascara and eye makeup off so no residue is left on washcloth or pillow case.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen QC",
      "helpful_votes": 11,
      "publication_date": 20180202
    },
    {
      "title": "I feel bad about the extra packaging these individually wrapped wipes produce",
      "text": "I feel bad about the extra packaging these individually wrapped wipes produce, and have actively tried to not repurchase them...so far, without luck. I like these too much for my busy lifestyle. As someone who travels frequently for work, these are a lifesaver. They're also great for throwing in my gym bag. No TSA problems, no skin problems, just guilt driven micromanagement of my recycling habits. Maybe one day I'll swear off them, but for now, I'm limiting my use of them for on-the-go purposes only.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 10,
      "publication_date": 20180310
    },
    {
      "title": "Strong Fragrance and Allergic Reaction",
      "text": "I was very disappointed that I had to return this product. I loved the size and the texture of the makeup remover towelettes, but the fragrance was unpleasant, the cleansing liquid caused a stinging sensation that went on for several minutes and my eyes had an allergic reaction. If you are hyper sensitive to smells or have sensitive skin, I would suggest not getting this product, it is very strong.",
      "rating": 2.0,
      "verified": true,
      "author": "Alice & Stan",
      "helpful_votes": 9,
      "publication_date": 20161121
    },
    {
      "title": "Great for travel and for skin care when in a rush at home",
      "text": "Terrific make-up removal wipes. I use them when I travel and also for nights when I can't go through my regular skin care routine. I use them to clean off all my make-up and then just put on moisturizer and go to bed. They leave my skin feeling fresh and clean and are an inexpensive luxury. The company cares about its customers and uses safe and cruelty-free ingredients. I highly recommend this company and their products.",
      "rating": 5.0,
      "verified": true,
      "author": "GGK",
      "helpful_votes": 6,
      "publication_date": 20170521
    },
    {
      "title": "Really works",
      "text": "I’ve tried other similar products but I like this the best. Originally tried in a hotel amenity kit and liked it so much I tracked them down and bought for myself. Even when I’m not traveling I will often use at home. Especially if I want to cut short my nightly regime if I’m too tired. I don’t think I’m short changing my skin at all. Plus even though it cleans my face well, including my mascara it doesn’t dry out my skin or sting my eyes. The packets don’t seem to dry out over time either. This is a product that I choose to stand by so will write a review.",
      "rating": 5.0,
      "verified": true,
      "author": "kristin",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Leaves skin so soft!",
      "text": "Makes my skin so soft. Cleans makeup off pretty well. When I use a toner the next day, I can tell that it didn’t remove all of the bronzer on my cheeks and the mascara doesn’t come off easily. But I still love this product because my skin is really sensitive and with this I don’t break out and my skin is softer than with other face washes.",
      "rating": 5.0,
      "verified": true,
      "author": "DarcyD76",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Great to keep in your purse or to use on a trip",
      "text": "I like these make up removal wipes. I keep a couple in my purse at all times, because sometimes my day lasts longer than my make up and I tend to get mascara darkness under my eyes. A quick swipe with these wipes and the mascara comes off my lower eye quickly and easily.....then I can look fresh and awake again. These wipes are great also because they are not oily, leaving an oil slick on my face. They are natural looking but they remove the make up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Masonry500",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Very Nice.",
      "text": "These are very nice and refreshing. I first tried one at a Hilton Hotel. Liked it a lot so hunted them. What is nice about these is that because they are individually wrapped, they stay moist, unlike removers that come in a bundle package with a lid. I like them so much I sent to a friend as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca J B",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "does not remove waterproof eye makeup",
      "text": "This was described as a makeup remover but it does not remove waterproof liners or mascara very well. I till had to use my liquid remover. The scent is similar to baby wipes, pleasant. I would not purchase these again",
      "rating": 3.0,
      "verified": true,
      "author": "Mary SanDomenico",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "BEST MAKEUP REMOVING WIPES ON THE MARKET",
      "text": "These are the BEST make up removing wipes EVER!!!! I had to find a different brand once Maybelline discontinued my favorite make up removing wipe. I came across the “La Fresh” wipes at a recent hotel stay and loved them! They take off all my eye make up and don’t burn my eyes! The packaging was a bit different at the hotel but these wipes are the same and are AWESOME!!! I am so thankful to have found a great replacement wipe! They are individually packaged so they are GREAT for traveling. I HIGHLY recommend these wipes to everyone! I primarily only use these for eye make up, I do not use them to remove my face make up.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda  H.",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Awesome !",
      "text": "I first used these while staying at a hotel . These are fabulous! I tracked them down as they work so well. I love that they are individually wrapped in a sturdy packet . I keep a couple in my make up bag all the times. Great for travelling. I just love these. Takes my makeup off and leaves my face feeling amazingly soft",
      "rating": 5.0,
      "verified": true,
      "author": "Dix",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Look no further for a great make-up remover!",
      "text": "I am Brian's wife using his email. This is by far the best make-up remover and I've tried many. We give this away at an Inn I work at and decided to try it. So glad I did! The reviews said that the one's in the re-sealable bags like you buy in the store are smaller in size so I went with the individual wrapped travel wipes. You only need one to remove all of your make-up. Plus, they don't sting your eyes like others I've tried. Nice soft fragrance too. I ordered two boxes so I could get the free shipping. Being individually wrapped, they will last till I open each one. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian lee",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "Use with micellar water!",
      "text": "I just received my 2nd order of the 50 pack box and after reading reviews I made sure to count them both times and there were 50 in each box. I wear heavy makeup so I've never found a wipe that removes everything on its own so I add micellar water to each wipe which I highly recommended to fully remove all traces of makeup. These wipes don't have an overpowering odor and don't irritate my sensitive skin. Having individually wrapped wipes are so convenient too. Super fast delivery with no damage to the box.",
      "rating": 5.0,
      "verified": true,
      "author": "MICHELE MARTIN",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Love the product but misleading packaging",
      "text": "No longer comes in box as shown in product photo! Wipes are also smaller than before. Please update your product description so it’s accurate. I bought these expecting them to arrive this way. It is my third time repurchasing and it was easier to throw them under the sink in the previous packaging - it stood upright on its own, just grab and go. Now they are in plastic wrap (still individually wrapped though). I will need to throw them in a drawer somewhere instead. With that being said, I LOVE the wipes. No irritation to the eyes or face and takes off everything. Unfortunate that they are now smaller.",
      "rating": 3.0,
      "verified": true,
      "author": "Steph ",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "WOW",
      "text": "These are incredible. I have washed my face every night before bed for most of my life. Never again. No more dry itchy face after washing. These cloths take off all my makeup and leave my face feeling soft and perfectly moisturized. They also smell great. This product is a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Addict",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great wipes!",
      "text": "I LOVE these wipes! I have sensitive skin and these don't irritate my skin at all. They remove my make up, including my non-waterproof mascara. No stinging the skin or making my eyes water like some others \"national brand\" wipes do. I also love that when I travel, I can just pop them in my suitcase and I'm good to go! I can't say enough good thing about these wipes and will always have them on hand!",
      "rating": 5.0,
      "verified": true,
      "author": "eskimopiepie",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Perfect for Makeup Users",
      "text": "Love these! First introduced to these at a hotel chain. Used it, loved it. Ordered for myself. It does remove 99% of all makeup. I do wash my face afterwards. Perfect for travel and everyday use. I will continue to order these.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruindiva92",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Awesome and effective",
      "text": "These are perfect for throwing into your day bag. The individual wrapping allows for great travel use. The cloth is wonderful at getting all makeup off with ONE cloth. Some brands take a few. I would put these up on the level with MAC wipes. Very awesome and effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercedes Myers",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Nice product, good results",
      "text": "This was a courtesy product in a hotel where we stayed while traveling. I was concerned at first because it was scented, but the scent is light, and works well for me. When we got home I looked it up on line and ordered it. I use it every day and am pleased with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Odessa",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Great for sensitive skin!",
      "text": "Honestly I have way sensitive skin and the makeup wipes that say \"formulated for sensitive skin\" are trash compared to these. These wipes take off so much dirt with one wipe and aren't abrasive. I'm definitely going to buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Awesome Makeup Remover!",
      "text": "I've used these at some hotels that left them out for guests and really liked how they removed my makeup (including my waterproof mascara) and made my face feel. I'll be travelling in the states and overseas within the next few months and wanted a makeup remover that I could carry on the plane. With these being individually wrapped, they'll be PERFECT! So glad I bought them. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lo Becker",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Individually wrapped wipes avoid waste.",
      "text": "I wasted a lot of money on packaged wipes. I got a great price buying in bulk but ended up throwing so many out because they would dry up that it wasn't worth the savings in the long run. Individually wrapped wipes avoid waste and are the way to go for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne Haren",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Takes it all off",
      "text": "Found these first at a hotel while traveling. Found them on line which was cheaper than buying directly from the company. Work like a charm. Takes off mascara and all face make up. even lip stain. even though I bough these for travel I use them at home to. even started ordering on a reoccurring basis. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "RACHELLE",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Gentle and greatly effective",
      "text": "I discovered this product in a stay at a resort and I have been ordering it for 2 years . I have sensitive skin and tried everything in the stores ,even hypoallergenic wipes. These are cheaper ,convenient and gentle while removing all eye makeup etc. just great! I had to search down this company as it was not available to the public then. I highly recommend these wipes",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Byrns",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Love these!",
      "text": "I love these! They instantly remove make-up. They don’t burn my eyes or my skin. They don’t dry out my skin or cause break-outs. They are great for traveling or just a nice fresh pick-me-up before going out to dinner. I’m gladly buying the 50 pack for a second time.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Herrin",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Work great! I’ll be buying more.",
      "text": "Love these! My new favorite wipe. Not just for travel tho. I want to use them for every day. I will be looking to buy them in a larger pack for daily use too. The single are wonderful for throwing in make up bag for travel versus taking a larger package like I used to do. Clean my face so well and don’t leave residue or a weird feeling to my skin like some face wipes do.",
      "rating": 5.0,
      "verified": true,
      "author": "Product User",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Best wipes ever!",
      "text": "I love this product. The wipes are lightly scented, just barely noticeable, which I appreciate as am very sensitive to smells. They do a great job of removing makeup but don't leave my face feeling greasy or sticky. I've tried many varieties and these are my favorite by far.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer1643",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "I bought these for travel and I LOVE them. They are large enough to do your ...",
      "text": "I bought these for travel and I LOVE them. They are large enough to do your whole face and wet enough (which seems to be a problem with cleansing cloths) to remove waterproof eye makeup. The fact that they're individually packaged is a bonus because they can't dry out that. I'm all about convenience when I travel and these fit the bill perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly V.",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "LARGE, SOFT, STRONG & FRESH!",
      "text": "We discovered these makeup wipes among the complimentary toiletries at the Coventry Inn in San Francisco. My daughter is a competitive dancer and EXCLUSIVELY has La Fresh Travel Lites in her travel bag now. The material is LARGE (at least two to three times other brands), feels super SOFT (no more stiff, rough, stinky old perfume scented finger wet wipes similar to those you get at a BBQ place), yet STRONG enough to remove everything in ONE application (she use to bust out at least a half a dozen packets of other brands at one time), and they really do smell FRESH. Thank you for making this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Straight Up",
      "helpful_votes": 2,
      "publication_date": 20170424
    },
    {
      "title": "Only 49 in box instead of 50 again!",
      "text": "Only 49 in box instead of 50 again! Per other reviews, this appears to be common practice for them to rip each customer off one packet. I won't order from them again!!! The product is nothing special. It didn't remove waterproof mascara very well. I can buy better, cheaper products, with full contents, at my local Walgreens or grocery store.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Best ever",
      "text": "I used these during a hotel stay. I was so impressed !!! I ordered a box immediately and will buy from now on. Great product, and biodegradable. Also has vit E that’s good for your skin. Cleans your face with one wipe. Even my waterproof mascara. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "buttercup",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Effective product-highly recommend",
      "text": "These cloths were provided at a hotel I stayed in and I loved them. They are large so you can use different sections to get all the makeup off. I also liked that they were packed individually so that they don't dry out. I was excited to see I could purchase them online. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "kirby",
      "helpful_votes": 2,
      "publication_date": 20170115
    },
    {
      "title": "Very Handy",
      "text": "I feel guilty about using individually wrapped wipes, but there are times when having a few of these tucked in your car, in a backpack, in your purse. They are great for travel, of course, but sometimes I use them to freshen up after a long hike when a shower has to wait and I need to be less sweaty and bedraggled to attend an appointment.",
      "rating": 5.0,
      "verified": true,
      "author": "CFuller",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Works great",
      "text": "These wipes work amazing! They had samples in a hotel room I stayed at and the next day I went on amazon and purchased them. They are soft, have a decent smell and wipe off makeup very well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Won’t bye again",
      "text": "I read the other reviews—so true, they don’t give all the wipes. I was short by 3. The wipes take of my makeup pretty nice, but burns my skin and eyes. I gave most of the wipes away! I will not buy again!",
      "rating": 3.0,
      "verified": true,
      "author": "lorealp",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "THE Best Makeup Remover Facial Wipe I've Ever Used!",
      "text": "We were traveling and one of these packets was in the complimentary bathroom basket of goodies. I dislike makeup remover wipes since they always sting the eyes and don't remove much makeup. This was a marvel! Absolutely gets every bit of waterproof mascara, lipstick and foundation off with no irritation whatsoever! Leaves my skin feeling soft and refreshed.",
      "rating": 5.0,
      "verified": true,
      "author": "MCR",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Best Makeup Remover Wipe.",
      "text": "This is the softest and most effective makeup remover wipe of all the brands I have tried. It has a very light scent, and removes makeup without damaging sensitive skin around the eyes. Leaves a clean, smooth feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie K.",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Perfect travel companion",
      "text": "Light scent. Work great and perfect for travel. I buy a box and throw a few in my suitcase when I travel. The unused ones last a long time. I’ve never had any dry out and I’ve had them for up to 6 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Senta Burton",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Needed Cleansing Prod",
      "text": "I “met” these at a Hilton and have been in love ever since. They do an excellent job of removing regular makeup and waterproof eye products. I won’t be without them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great for travel!",
      "text": "Great for travel. Started using these after getting a few at hotels. Don't irritate my sensitive skin. Takes off eye makeup too. Very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Not wet enough and hurt my eyes",
      "text": "I like these ok. They hurt my eyes if I try to remove eye makeup though. They smell ok, but it's kind of strong. They also aren't as wet as others I've used. I now just save these for travel and use my other brand at home.",
      "rating": 4.0,
      "verified": true,
      "author": "megn_bailey",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great product",
      "text": "First tried this product at the Emily Morgan Doubletree Hotel in San Antonio. They put them out with the toiletries in the rooms. It worked amazingly well to remove Cheer makeup (including lip stain) on my daughters face without irritating. She begged me to find the product so thank you Amazon for selling these! Convenient for travel and they work. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "JennFlinn",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Removes all make-up",
      "text": "I used these wipes in a hotel and FELL IN LOVE. When I used it I had gone to a concert so I did contouring and had on A LOT of glitter. They remove all of my make-up, including my waterproof mascara. I have sensitive skin and have no reactions (breaking out like some wipes cause me to do), they have a soft subtle scent, and they are inexpensive. Working on my second box of wipes now and will definitely order a third!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Danieluk",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "These are great! They don't both my eyes at all and ...",
      "text": "Many makeup removers burn my eyes or make them feel very dry. Also, a lot of them make you have to rub and rub to get the make up to come off. These are great! They don't both my eyes at all and it only takes a couple of rubs to get the makeup off.",
      "rating": 5.0,
      "verified": true,
      "author": "Dominik S",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "These are prefect!!",
      "text": "They keep for a long time. They come in a friendly cabinet spacing saving box. They are moist enough to remove all of your makeup without dripping all over. So soft on your skin and they don't leave a oily feeling behind.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Leezer",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great makeup remover and perfect for traveling",
      "text": "I buy these all the time as I travel a lot. These work great, have a light fresh (but not overpowering) scent, and are the perfect size for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Greta Soul",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "La Fresh gets the job done easily",
      "text": "I love using these even when I am not traveling because they are so easy to grab and they remove the makeup easily off your face. I like that they are big enough to get the job done and the package is easy to open.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty K. Slack",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Great makeup remover",
      "text": "I really like these things. They are great for travel but I use them at home too. They smell good and can remove all your makeup including mascara",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy1214",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Perfect",
      "text": "Used as sample on a trip and was very impressed with the product. So glad I can purchase it online. Works great for me. Hardly have to use anything else and easy to carry around in my handbag or travel bag. I've used many different sheets and overall I like this product the best.",
      "rating": 5.0,
      "verified": true,
      "author": "travelgrams",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "These are the best!!",
      "text": "The first time I used these I was staying at a hotel and they had them available as complimentary for the room. I never heard of this brand but these are seriously amazing! I have sensitive skin and these are so gentle and do an amazing job removing ALL make up from my face, foundation, mascara, you name it and they smell so good and clean! These will forever be my go to makeup remover.",
      "rating": 5.0,
      "verified": true,
      "author": "alison",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "removes all the makeup even the Dermablend foundation and waterproof mascara",
      "text": "I tried so many different make up remover and the is the only one that with ONE wipe, can really remove all my make up. From the Dermablend foundation to waterproof mascara. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "mmcc",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "handy",
      "text": "I used these in some hotels and decided to try and find them online. They are nice for travel and take off my mascara well.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy V.",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Love these!!!!!",
      "text": "Love these. I first used these on a trip I took to Gettysburg. We stayed at the Lodges at Gettysburg and they supplied them daily with other toiletries. I fell in love with them. I looked on Amazon and found them. I have ordered them ever since. They work well to remove your makeup and smell good also.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi ",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great product.",
      "text": "I really like theses a lot. I don’t have to use eye makeup remover anymore. This makeup wipe does it all. I do wash my face after a use the wipes. This is the second time I’ve bought them.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great for sensitive skin",
      "text": "I was introduced to these wipes while staying at a hotel and thought they were amazing. I had tried a lot of different items, but my face is super sensitive. I decided to order these for myself and have not been disappointed. They are big, but I just cut them in half. More for my money. They are a good price and easy to use. They are great at removing make-up easily. Would highly recommend. I also appreciated the email from the company asking if everything was ok with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "diana",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Convenient cleansing W Freshness",
      "text": "I really like these and are great for traveling or on the go. They do a great job of cleansing and are still soft and feel clean",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Arrived without dispensing box",
      "text": "My 50-ct wipes arrived without the dispensing box. I specifically bought this because it came in an easy to use dispensing box that i could set on the counter for my renters to use. Very disappointed it didn’t arrive as shown in the pictures! No wheee in the description did it say “box not included” so i expect it to be in a dispensing box as shown. I would like the box sent to me. Thank you.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "A refreshing clean without harshness",
      "text": "I purchased these for my Airbnb vacation rental. It is a good product at a reasonable price. I have tried them myself. They are better than several other brands I've used that are not individually wrapped, which can get dry after opening (though for waste reduction I prefer to just wash my face or use a bulk packet). I also feel that they do not leave a harsh-feeling residue but instead leave a fresh, clean feeling. My guests must like these too because they definitely disappear!",
      "rating": 5.0,
      "verified": true,
      "author": "Pr",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "These do NOT remove waterproof mascara.",
      "text": "The description said these remove waterproof mascara. NO They Don't. I would not have purchased them if I'd known this.",
      "rating": 3.0,
      "verified": true,
      "author": "Nevis Rik",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "One and done!",
      "text": "Originally tried this product through staying at a Staybridge hotel. They have these in each room. Loved the clean feeling with the moisture and softness left behind, so instead of using other facial cleansers and then moisturizers, I just use these wipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikaroni",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Great packaging",
      "text": "Live the fact that it comes in individual packs.. great for travel and does not dry up compared to the larger container. That makeup remover does the job for me!",
      "rating": 5.0,
      "verified": true,
      "author": "C. M.",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Terrific",
      "text": "Very nice with lots of wetness so you can be sure you get all your makeup off with one towelette.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Great makeup remover",
      "text": "Love these makeup remover towelettes. They are like the ones you get as a courtesy at some hotels. They are great for travel and home. The don’t dry out. They don’t irritate my eyes or my sensitive skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy G.",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Can irritate the skin",
      "text": "These makeup removers are OK. The fragrance is not all that great and the material is a little rough. They get the job done though, removing all makeup. I would say they are fine in a pinch or to use once in a while. However, I would not use these daily as they might tend to irritate the skin.",
      "rating": 3.0,
      "verified": true,
      "author": "N Pearce",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Love these clothes",
      "text": "These are the handiest makeup removers to travel with and I love the job they do. Would recommend these for anyone...",
      "rating": 5.0,
      "verified": true,
      "author": "N. S.",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Good Buy",
      "text": "I first discovered these wipes when I stayed at a hotel in Charleston, SC. I needed something to quickly wipe the mascara from my under my eyes and these did the trick. I have tried numerous makeup wipes and these are by far, the best. They aren't sticky, don't burn your sensitive skin, and they are great to take with you for an overnight trip.",
      "rating": 5.0,
      "verified": true,
      "author": "The Whimsical Pineapple",
      "helpful_votes": 2,
      "publication_date": 20161011
    },
    {
      "title": "I love these!!",
      "text": "These are awesome! They remove waterproof mascara with ease and leave your face feeling fresh and clean! They were shipped fast and arrived in perfect condition! (Thank you Hilton hotels for introducing me to this brand!!)",
      "rating": 5.0,
      "verified": true,
      "author": "Gab",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Great Clothes!!!",
      "text": "I love these wipes for traveling. And the little extra perk is that your luggage gets lighter as you use the wipes! :)",
      "rating": 5.0,
      "verified": true,
      "author": "N. S.",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Cleans Well",
      "text": "Those nights when I'm too tired to remove my make up properly, this is a great substitute. Otherwise it's the first step before jumping into the shower and cleansing properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Throughly removes make-up quickly",
      "text": "Very good for removing all makeup. Even waterproof mascara comes off quite easily. Does not leave my face feeling dry and tight. Handy to throw in a purse or travel bag. I use them every day. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "BTolle",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Great Product",
      "text": "O run an Airbnb and love having these out for guest. Plus when I travel they are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great and handy to keep in purse or use while traveling",
      "text": "I love these little packets. I keep them in my purse and use them for all kinds of stuff, not just makeup removal. Although it does work great for that. It takes 2 for me to completely remove all makeup.",
      "rating": 5.0,
      "verified": true,
      "author": "kjm27434",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Amazing makeup remover",
      "text": "I first used the wipes at a hotel. It was amazing and I was able to find them on Amazon. Best makeup remover wipe ever & it doesn’t leave my face feeling dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Best makeup remover wipes!",
      "text": "These makeup wipes are the best. I keep a stash of these in my nightstand for convenience when I get home late at night and am just too tired to take off my makeup with soap and water. They are very moist and take off all my makeup. Because they are individually wrapped, I also keep them at my second home, and they never dry out!",
      "rating": 5.0,
      "verified": true,
      "author": "carla merrick",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Best makeup remover I've tried, even on waterproof mascara!",
      "text": "LOVE! The box is great, easy to use dispenser. Feels luxurious, like something that would be used in a spa. Cloth is large, can easily clean entire face. Left my skin feeling pleasantly silky and soft. Easily removed waterproof mascara with no irritation. Will buy again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "KMS122",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "These work very well !! I travel with these, no spills",
      "text": "I had bought these from Amazon ( a different seller ) last year . I had tried a cpl that were left in my hotel room, as a freebie . !! These work great !! The price is reasonable , and fast shipping from Amazon. I will order more when i need to . Very happy to have found these !",
      "rating": 5.0,
      "verified": true,
      "author": "EeVee V.",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "I love La Fresh Makeup remover",
      "text": "I love La Fresh Makeup remover! I stayed at a hotel in Denver Colorado when I used your product for the 1st time and I was hooked. I asked the maid if I could have a extra one to look up online and thank goodness Amazon had it on their website. I will definitely keep ordering because this is the 1st time I’ve used a make up remover cleaner that really works.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Fajardo",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Only takes one to get the job done!!",
      "text": "I’ve used these is hotels so I knew that I loved them! I was happy to see that I could purchase them! These are soft on your face and remove all traces of make up and stubborn mascara",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "The absolute best product. I think I’m on my 5th or ...",
      "text": "The absolute best product. I think I’m on my 5th or 6th box of them. If you uveitis sensitive skin, these cleanse very gently. Quick delivery always.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginny Clausen",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Yass Girl",
      "text": "Scent not too strong smells like baby oil, they're soft super moisturized. My #1 traveling companion, also best for when I don't feel like going through my face cleansing routine but don't want to leave make up on my skin. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "La Fresh Makeup Remover Wipes",
      "text": "Great makeup removers. These do a thorough job in reviewing my makeup, even most of my mascara. The size of these sheets is adequate and they don't tear. I will definitely purchase these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie MM",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Need to follow with moisturizer but its good",
      "text": "Way convenient for traveling and they work well and do not sting eyes! Need to follow with moisturizer but its good stuff",
      "rating": 5.0,
      "verified": true,
      "author": "sunkitty",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Pleasantly Surprised!",
      "text": "These wipes are more effective at removing makeup better than other brands I have used, especially mascara! I first experienced them in a hotel and have been hooked ever since!",
      "rating": 5.0,
      "verified": true,
      "author": "Vsh",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "As expected. Nice product!",
      "text": "As expected. Nice product! A regularly purchased item for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Dyment",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Smell good, and don't dry out my skin",
      "text": "Love these, discovered them in a couple hotels, and then found them online. Treat myself to them from time to time.",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Great for travel too!",
      "text": "As a makeup wipe connoisseur, I’ve tried out many brands. These are one of the very best: individually wrapped, very moist, and effective.",
      "rating": 5.0,
      "verified": true,
      "author": "CSK",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "... these thru work our hotel uses them and I love them so finally decided to order a box",
      "text": "just got mine today I found out about these thru work our hotel uses them and I love them so finally decided to order a box. These are great makeup remover wipes love them glad I found these definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "iamrandomosity",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Worth it!",
      "text": "Wonderful! Works amazing, smells good and overall just awesome for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle P",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Saved our pillowcases in our rental from makeup!",
      "text": "I bought these for my air bnb rental suite. RECOMMEND for anyone with a rental especially!!! These will save your sheets from makeup! Being a girl we get lazy to do the full face wash before bed which leads to makeup on pillow cases. But offering these complementary to guest, I PROMISE they are more likely to use them!! Yay!",
      "rating": 5.0,
      "verified": true,
      "author": "nicole klenk",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Work fine, individual wrapping = lots of trash",
      "text": "These wipes work fine. Im giving them three stars because they are individually wrapped and create a lot of waste. They are good for traveling but it is extremely wasteful to individually wrap single wipes.",
      "rating": 3.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Love the La Fresh Makeup Remover wipes for traveling",
      "text": "Love the La Fresh Makeup Remover wipes for traveling. I first tried these when they were given as a complimentary item in my hotel room. I now purchase them to pack in my travel bag. Since they are individually wrapped, they do not dry out as the larger packets of wipes sometimes do. They are the perfect size for removing all traces of makeup and are gentle on the skin. I highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Love these.",
      "text": "I found these in various motels when traveling. I love them so I went looking for them on Amazon. I was so glad to find them. They are handy, stay moist because individually wrapped and are convenient when traveling. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Would buy from brand again",
      "text": "I have very sensitive, dry skin so can’t use these Daily beacuase my skin will Peel.",
      "rating": 4.0,
      "verified": true,
      "author": "Jake and Ash ",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Great wipes, takes out your makeup and refreshens the ...",
      "text": "Great wipes, takes out your makeup and refreshens the skin. Great to travel with when you want to freshen up on your makeup. Very convenience and smell fresh!",
      "rating": 5.0,
      "verified": true,
      "author": "Let",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Let down",
      "text": "Does not remove all makeup. Doesn't even do anything for waterproof mascara. Pretty bummed I purchased this.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicolelynn",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Wipe the night away",
      "text": "Used these for our wedding gift bags and they were perfect!! Great for traveling too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Jenkins",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Underwhelming",
      "text": "These were not as great as the reviews claim. Maybe I didn’t get a good box but mine were hardly moist and I had to scrub to get any makeup off.",
      "rating": 1.0,
      "verified": true,
      "author": "ramire37",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Hard to find makeup removers individually wrapped!",
      "text": "Great makeup remover for guest amenities basket! These are hard to find in smaller quantities - usually have to buy 200-300 at a time. They have little fragrance, which is what women prefer. Packaging is bright and an attention-getter.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Carol",
      "helpful_votes": 3,
      "publication_date": 20160929
    },
    {
      "title": "Removes makeup easily",
      "text": "2nd time ordering. Use them to remove makeup before water yoga and take on vacations. Easy to carry in your makeup bag and are individually wrapped so they do not dry out. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Cortez",
      "helpful_votes": 0,
      "publication_date": 20180304
    }
  ],
  "product_meta": {
    "title": "La Fresh Travel Lite Makeup Remover Cleansing Wipes – Facial Towelettes with Vitamin E for Natural or Waterproof Makeup – Individually Sealed Wrappers (Large 8 in x 7 in Cloth Size) Pack of 200 Count",
    "description": "Size:200 CountLA Fresh Make up remover 200 count",
    "rating": 4.7,
    "feature_bullets": [
      "PERFECT FOR TRAVEL (Size = 8x7): Keep these 6x7.75 TSA-approved wipes in your carryon for easy access. Each makeup remover wipe is sealed in a pouch to avoid spills and leaks.",
      "DISSOLVES STUBBORN MAKEUP: Our wipes can remove your heaviest, waterproof makeup and still leave skin soft and supple thanks to vitamin E.",
      "MADE WITH RESPONSIBLE INGREDIENTS: Wipes are made with 100% biodegradable material, are safe for sensitive skin and are never tested on animals.",
      "GOOD FOR YOUR SKIN: Our formula is silky – never greasy – and made with vitamin E to keep your skin hydrated. Safe for even sensitive skin types.",
      "KEEP THEM ANYWHERE: Stash them in your purse, desk drawer, gym bag, nightstand or car - anywhere you might need them!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12 x 6 x 6 inches; 3.6 Pounds",
      "Manufacturer": "La Fresh",
      "ASIN": "B07582DPHX",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Makeup Remover",
      "Beauty & Personal Care",
      "Face"
    ],
    "price": 39.99
  }
}