{
  "website_summaries": [
    {
      "verdict": "The wireless Sony WI-1000X earphones deliver solid noise cancellation and some of the best audio quality we've heard in this category, with a sound signature that can be tuned to your liking.",
      "pros": [
        "High-quality audio performance with sculpted, but balanced sound signature",
        "EQ allows for sculpting audio to your taste",
        "Excellent noise cancellation",
        "Comfortable fit",
        "Easy-to-operate design",
        "Generous array of accessories"
      ],
      "cons": [
        "Sound signature not for purists seeking accurate, flat response"
      ],
      "aspects": {},
      "publication_date": 20180702,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Comfortable, poorer noise cancelling ability and poor battery life.",
      "text": "I bought it because of its size for use during long distance travel on the plane, eg I could sleep on my side without the bulky headphone getting in the way. Compared to my Sony MDR-1000X, the noise cancelling ability of this headset is a distance poorer away, but got to sacrifice that for comfort. Battery life is about 3 to 4 hours, probably not enough to last a long flight journey.",
      "rating": 4.0,
      "verified": true,
      "author": "Limpeh",
      "helpful_votes": 8,
      "publication_date": 20181106
    },
    {
      "title": "The headset is awesome! It has a great feature",
      "text": "The headset is awesome! It has a great feature: a few seconds before the incoming call the headset vibrates (with Galaxy S9). It has a long battery life, stable Bluetooth connection, very good noise cancellation and ambient sound feature. I used Bose QC30 and Sony WI1000X is much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180426
    },
    {
      "title": "Versatile headphones",
      "text": "I purchased these for a long trip overseas. Very good sound quality and excellent battery life. I liked the ability to plug into the plane entertainment system the best. Update: I have had these headphones fail twice in the last year and Sony won't replace them because the original purchase was 1 year ago. Sad, because I liked them so much. I have to say I wouldn't spend that much money on headphones again and the Sony name, which I swore by, is tarnished for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Boris Medich",
      "helpful_votes": 4,
      "publication_date": 20180612
    },
    {
      "title": "Excellent earphone.",
      "text": "It's really good for workout and running, but I wish it had fast forward and rewind button. Google assist only works when the phone is close to your mouth, so this function is useless to me when running. Again, great sound quality and good noise canceling. To me, the noise canceling is not excellent because I can still hear things around me. Also, the ambient feature is not excellent because to hear someone clearly, I still have to take the earphone off. Regardless, I think this is still one of the best I have had thus far. I cannot really talk much on battery life because I recharge after each workout.",
      "rating": 4.0,
      "verified": true,
      "author": "vcharlo",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Wow!!!",
      "text": "I received my Sony WI1000X Premium Noise Canceling with great joy. Packaging was in excellent condition. Headset look, feel and sound premium. It was love at first sight. Listening experience is second to none, while noise cancelling is only second to another great Sony headset I used in the past...the SBH80. Thank you Sony for making this beauty and thanks Amazon for delivering in record time.",
      "rating": 5.0,
      "verified": true,
      "author": "Quame",
      "helpful_votes": 7,
      "publication_date": 20171109
    },
    {
      "title": "Noise cancellation is still not great",
      "text": "I bought this phone for my frequent air travels to replace the aging Bose QC20. I chose it over Bose QC30 since Sony has an optional wired connection that you can use with entertainment systems in the plane. Unfortunately, noise cancellation is not near the quality of QC20. Even at maximum noise cancellation, there is a lot more noise coming through. One issue is the earpieces are simple round silicon plugs and do not attach securely. Which makes the noise cancellation even less effective.",
      "rating": 3.0,
      "verified": true,
      "author": "Gardener",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "As nice as it gets.",
      "text": "Obviously high in quality. Perfect for any occasion. I enjoy the noise canceling feature. I have had many different types. By far these are the best. Highly Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Roberson",
      "helpful_votes": 2,
      "publication_date": 20180724
    },
    {
      "title": "Fair but pricey",
      "text": "Pricey and bulky. Sound quality very good mic quality not so much. Picks up a lot of background noise not good for business calls",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Sony headsets are okay.....",
      "text": "noise cancellation seems not to block out the wind. Also, you do not get any notification for when the battery is low. This is very annoying. The headsets are okay but I would NOT say they are outstanding.",
      "rating": 3.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Doesn't stand up to over the ear type headphones",
      "text": "Good quality earbuds. Noise Kingsong does not equate to the over the ear Sony versions. Bass response is weak. Highs adequate. Battery life works really good on cross-country flight.",
      "rating": 3.0,
      "verified": true,
      "author": "Travis Tompkins",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great sound with noise cancellation",
      "text": "This product has very nice sound. Hifi quality. And the noise cancellation is working very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ilker A.",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Love Love Love it!",
      "text": "Airline noise, even on a tractor, cancels great. Very good sound quality, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Very impressive!",
      "text": "Good sound quality, impressive battery life, stylish, easy controls, ... it is an elegant small gadget!",
      "rating": 5.0,
      "verified": true,
      "author": "jshe",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Noise-cancelling works great, excellent sound",
      "text": "Noise-canceling worked great on the airplane & has excellent sound",
      "rating": 5.0,
      "verified": true,
      "author": "SteveM",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Outstanding sound",
      "text": "This are the earbuds to get if you want those extra details you been missing out in other earbuds, if there was something that could be improved is the neck band it's hard to clean but when it comes with sound quality it excels in that area",
      "rating": 5.0,
      "verified": true,
      "author": "luis rico",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Two Stars",
      "text": "Call is dropped on trying to connect this on the calling.",
      "rating": 2.0,
      "verified": true,
      "author": "CS Hong",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Spike on high frequency",
      "text": "Given the lowered price, it’s a nice unit, but it has a totally unacceptable high frequency spike that ring your ear in most songs with tambourine. ANC function is good but only half as effective as WH1000mx3.",
      "rating": 3.0,
      "verified": true,
      "author": "Ghost ",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "The nose cancelling on these headphones are very impressive",
      "text": "So far I have really enjoyed these headphones. I mainly use them travelling from one location to another in a crowded van.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Anderson",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Good",
      "text": "Weak against wind. Noise cancellation is not as good as Sony's headphone but is still OK. Everything else is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Excellent pair for long use",
      "text": "Excellent earphones, if you want a pair from a known brand that lasts, this model is definitely it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Talking to others",
      "text": "Microphone is not good. Other person can barely hear you. Sound muffled on the other end. If you dont use them to talk, they are good.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian ",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Four Stars",
      "text": "It works well. But the ‘SONY’ logo has fall out already. It’s been only 1 month.",
      "rating": 4.0,
      "verified": true,
      "author": "hoping2shoping",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "terrible as headset for your phone.  Very disappointed",
      "text": "For the money there is nothing i like about them",
      "rating": 2.0,
      "verified": true,
      "author": "Jordan Heilweil",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Five Stars",
      "text": "Nice sound and build quality, definitely will recommend to others",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "I dont know what noise canceling means but it doesnt ...",
      "text": "I dont know what noise canceling means but it doesnt work with rhis product and also phone talking is really low quality picking sounds from around not good",
      "rating": 2.0,
      "verified": true,
      "author": "hamdija suljic",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Exceptional noise cancelling. Comfortable.",
      "text": "Noise cancelling settings can be automatically controlled by the app. This is a nice feature that makes it easy to change your surroundings without having to fiddle With the buttons or volume. No lack of battery using the device all day. The cords stay straight and can be tucked into the headset, although not automatically retracted. If they last over a year, I would purchase a replacement set without pause.",
      "rating": 5.0,
      "verified": true,
      "author": "terry schmidt",
      "helpful_votes": 0,
      "publication_date": 20201204
    },
    {
      "title": "Great sound! Confortable and easy to use!",
      "text": "Great sound. Very comfortable and easy to use. This is my second one. Battery is amazing. I think sound canceling is good. I don't use it that much. One great feature I haven't found with others is: When you adjust volume up or down from the headband, it does so in very small increments so that you can get the perfect pitch.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20201121
    },
    {
      "title": "My Honest Review Was Deleted",
      "text": "My first order was missing the ear bud cushions and the USB/3.5mm audio adapter, but I kept it anyway because they are extremely lightweight/comfortable and the sound is phenomenal, especially with the customizable equalizer feature. My second order contained a cheaper, lower model headset (Sony WI-H700). Returned them immediately for a full refund. Just placed a third order. The second unit is for my significant other, who thoroughly enjoys using them and has decided to keep them...so I actually need a replacement for myself. :)",
      "rating": 3.0,
      "verified": false,
      "author": "Bad Wolf",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Weakness in build",
      "text": "This is my 6th set of these headphones... The only reasons why I keep buying them is 1: Best Buy Warranty and 2: They sound incredible. Less than a year in, they ALWAYS come apart on the right, no matter how I use them. The battery life is great, the interface is great, but damn if they can’t put some extra body in the flex areas... OMG, WTH... I can tell you from all these I’ve had... they ALL do this.",
      "rating": 3.0,
      "verified": false,
      "author": "Darrin and Charlie",
      "helpful_votes": 0,
      "publication_date": 20201107
    },
    {
      "title": "Dissapointing",
      "text": "Perhaps my unit which I am returning later today is defective, but the noise cancelling feature is nearly non-existent. On the positive side it has good battery life and looks terrific - but what good is this if it does not do its job! Compared to Bose this is inferior.",
      "rating": 1.0,
      "verified": false,
      "author": "A. R. Shark",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "NO SOUND AFTER UPGRADE TO 2.0.1",
      "text": "Updated to Firmware 2.0.1, there is no sound at all for the headset! Please fix it ASAP!",
      "rating": 2.0,
      "verified": false,
      "author": "Chan Hung Kee",
      "helpful_votes": 0,
      "publication_date": 20180706
    }
  ],
  "product_meta": {
    "title": "Sony WI1000X Premium Noise Cancelling Wireless Behind-Neck In Ear Headphones (International version/seller warranty) (Black)",
    "description": "Color:BlackHear nothing but your music wherever you go. These Bluetooth wireless, behind-the-neck wireless headphones have industry-leading Digital Noise Cancellation that adapts to altitude—ideal for flying. The Smart Listening feature that can detect your activity and adjust the sound appropriately, and you can even optimize your audio experience different listening environments, including outdoor stages, clubs, halls and arenas.",
    "rating": 4.1,
    "feature_bullets": [
      "Digital Noise Cancelling with Atmospheric Pressure Optimizing.",
      "Connect\" APP for Android /iOS to use Smart Listening technology to control your ambient sound settings.",
      "Ambient Sound mode to hear essential sound without taking your headphones off",
      "Battery life up to 10 hours (with wireless noise cancelling) / Hands free calling with vibration notification",
      "Wired cable solution let you connect in-flight entertainment"
    ],
    "specifications": {
      "Product Dimensions": "15.94 x 12.8 x 10.43 inches",
      "Item Weight": "14.1 ounces",
      "ASIN": "B075XF9VN9",
      "Item model number": "WI-1000X",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.1 out of 5 stars124 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#3,899 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "Bluetooth",
      "Additional Features": "Wireless",
      "Other display features": "Speakers",
      "Device interface - primary": "Buttons",
      "Colour": "Black",
      "Manufacturer": "Sony",
      "Date First Available": "September 25, 2017"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 174.99
  }
}