{
  "website_summaries": [
    {
      "verdict": "It doesn't ship with any disks, but you'll have a good price point for a four-bay system with the latest features.",
      "pros": [
        "NAS system will handle HD video nicely with a quad-core CPU, giving you high-quality data transfer speeds",
        "Can use a mobile app to access your files from anywhere",
        "Gives you a slightly below average price point for a diskless four-bay NAS system",
        "Will deliver good speeds if you're using gigabit Ethernet"
      ],
      "cons": [
        "You will have to add your own hard drives",
        "May suffer from incompatibility issues with some camera systems"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Big heavy & costly paper weight...",
      "text": "This is another pure waste of money.. poor User Interface and very HARD to use... I wanted to check with the support to inquire about their SMB2 support and the only option I have is via email. Poor documentation/manual. No information is clearly provided in the website either. It took them few days for them to respond to my inquiry and no SMB2 support. All the online high reviews for this product is either by the manufacturer or someone who is paid/gifted with their products. STAY AWAY FROM THIS PRODUCT... AMAZON, please note of these reviews and should stay away from selling...",
      "rating": 1.0,
      "verified": true,
      "author": "TK. Lakshminarasimhan",
      "helpful_votes": 3,
      "publication_date": 20200325
    },
    {
      "title": "Incredibly slow UI, is this a joke?",
      "text": "I can't believe anyone slightly technically proficient would purchase this thing. EVERY little action I perform in the Linux UI results in a LOADING graphic, for 5-15 seconds each time. It's like a computer from 1999 or something. Just buy an old used PC and make your own Windows based NAS. I'm shocked at this overpriced nonsense. Shocked! But hey they saved good money using the bare minimum hardware to barely run anything it tries to do.",
      "rating": 1.0,
      "verified": true,
      "author": "Dad of 8",
      "helpful_votes": 3,
      "publication_date": 20200113
    },
    {
      "title": "Read the fine print!",
      "text": "Read the fine print!!! Currently I don't use it. I waited too long before I opened the box and hooked it up. It wasn't for the faint of heart. Customer service stated \"I don't know what to tell you as everyone else got it to work.\". Finally through alot of trial and error I got it to work but my Plex account (the reason I purchased it for as well as the ad at Amazon that says it does transcoding and learning that they have DS418, DS418J, DS418 Play. Even when I called Synology they said \"It should work\". Well guess what IT DIDN\"T. FRUSTRATED IN VA",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas A. Norfleet",
      "helpful_votes": 7,
      "publication_date": 20180824
    },
    {
      "title": "Terrible Support",
      "text": "I own 2 4 bay Synolgy Diskstations. I have had nothing but problems with their apps. Documentation is sparse. Support can't seem to help unless you give them access to you system. I'm not comfortable giving strangers access to my computers and network. Do your own boycott of this Chinese company.",
      "rating": 1.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 5,
      "publication_date": 20190425
    },
    {
      "title": "ram not upgradable DS418",
      "text": "will be returning this, I bought it because I read you could upgrade the ram, but come to find out the new ones you cannot. Its one customer they lost in the is play to become unupgradable.",
      "rating": 1.0,
      "verified": true,
      "author": "Lesley",
      "helpful_votes": 6,
      "publication_date": 20190407
    },
    {
      "title": "I am not a networking power user",
      "text": "I purchased a QNAP NAS and found it frustratingly difficult to set up simple apps for photo backup, video file streaming etc. I returned it. Before I gave up on network storage entirely I thought I give Synology a try. Much more straightforward for someone who has no desire to look under the hood so to speak. I had it up and running in minutes. Backed up my photo collection which was available immediately on my wife's Win 10 machine, and my two macs. Streaming video to my network connected Fire TV was also a cinch. No reading manuals, calling tech support or watching perplexing Linux geeks youtube videos. It just worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "a good entry level product but no more",
      "text": "like all synology products, this is a great device to use and the UI is great. BUT if you are going to do anything other than small load home use file sharing, you may want something with more horsepower. I tried to use it for memories (photos) app with about 30,000 photos and it really wasn't up to the task. System is very laggy and needs frequent reboots.",
      "rating": 2.0,
      "verified": true,
      "author": "C farl",
      "helpful_votes": 3,
      "publication_date": 20190526
    },
    {
      "title": "Product Failed within 3 months",
      "text": "Failed to perform after 3 months. Goes into complete shut off mode with continuous beeping, no fix.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 7,
      "publication_date": 20180914
    },
    {
      "title": "One of the best out there",
      "text": "Switched from a WD mycloud drive to this . The WD drive had an easier interface and was a simpler system but it was alot slower and would not work with some TV,s. the sinology however is a huge improvement but is a little more technical to set up. i went from 10 to 20Mbs to 114 Mbs with the synology on my NAS but be sure to use cat5e r 6 cables along with a gigabit switch and router. I also can now view all my raw video files on all tvs in the house which the WD didn't do very well.",
      "rating": 4.0,
      "verified": true,
      "author": "KL",
      "helpful_votes": 2,
      "publication_date": 20190306
    },
    {
      "title": "Some minor flaws, loud fan and hidden one time $4 fee",
      "text": "So far it’s been solid except for two small issues: 1.) The included fan is crap. It’s loud and mine broke in less than two weeks. It’s easy to replace with a quality, quiet fan (you can buy any 3 pin 92mm fan you want) I got a warehouse deal so I can’t really whine about that though. I recommend swapping the crappy fan even if yours doesn’t break. 2.) They charge 3 or 4 bucks to allow you to read/write the exfat file format. This is really chintzy to not include in a $200+ device.",
      "rating": 4.0,
      "verified": true,
      "author": "SR",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Noisy",
      "text": "I am going to end up returning mine. After waiting to buy this for months I was excited to get it... However, this is the noisiest enclosure I have every heard. It echos the hard drive so bad to the point I have to keep it off most of the time. I can hear it across my whole room and if it is not the hard drive then it is the fans. Great potential however after spending money to build a quiet PC this just added the noise of 2-3 PCs. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "ACC",
      "helpful_votes": 2,
      "publication_date": 20200505
    },
    {
      "title": "This NAS is super simple to install IF you follow instructions",
      "text": "Don't cheat and buy cheep disk drives! Buy the WD \"Ironwolf\" drives to ensure long term viability of the drives. Go on YouTube and look for \"Mydoodads\" tips on the setup. These are FANTASTIC videos. He might not use your specific model but one can easily figure out the differences. DO NOT jump ahead of his videos. Determine AFTER you get into each video what options you want as his whole approach is \"building blocks\". As a major size airline flight instructor, I use building block learning and I do not skip around!",
      "rating": 5.0,
      "verified": true,
      "author": "Win",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Wish I never bought this",
      "text": "I’ve been using this for almost 2 years with it wired to my router and connecting to it via Ethernet and WiFi. I rate it poorly because of it’s awful performance. EVERYTHING takes a long time and sometimes fails. Backups can hang for hours and never complete. Connecting to files involves long delays. The file/folder structure is infuriating and I never know what’s a dupe. Cannot get my security camera to reliably connect and stream to the box. Just waiting for the files to load on my device can take seconds to minutes. I’ve configured it right and used syn tech support. Wish I never bought this.",
      "rating": 2.0,
      "verified": true,
      "author": "Howard Kay",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "So far, so good",
      "text": "I have had this product now for over a month. Too early to give it 5 stars on all fronts, but so far, I am pleased with this unit. Easy to set up and run. Lots of good documentation and works with all my machines so far. I have 3 Windows machines and 4 Linux machines and I am able to support all of them with this one device. I have not used all the features yet, but I am planning on testing out the iSCSI and other advanced functions. It is populated with 3 WD 4TB Red Drives and 1 6TB red Drive. So far, I would recommend this unit.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Franklin",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Great home NAS",
      "text": "This is my 5th Synology for different things and these things are great and easy to manage. I had another NAS go bad after 4 years (from a different company), received this, put the 4 hard drives in, and was online within 30 minutes. I migrated the data over pretty quickly and it has been running great. The Web UI is very easy to use and stays updated automatically (if you let it). There are a lot of addons available for free to run on the system without any real work. Fantastic support and product!",
      "rating": 5.0,
      "verified": true,
      "author": "mgoldman",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Nice solution for a home NAS",
      "text": "Needed a NAS on my home network to dump pics and videos from multiple smart phones. Also, to back them up. The Synology solution works nice. Nice feature, is being able to give family members local accounts to manage their own backups. Also, the Quickconnect option is a slick way to give access from outside my home network without the need to configure port forwarding. I opt'd for the single drive unit over a dual drive mirror solution to save money. My plan is to backup the NAS to the cloud to protect my stuff from a hardware failure. Easy to setup and manager. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Marks",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Frustrating",
      "text": "Update: after many hours of troubleshooting, it turns out one of the drives that I had installed initialized properly and gave no indication of the failure within DSM, however the drive was causing the software to lock up. The responsiveness is back to what I was expecting with higher end models. Original: I have used other Synology products before and this model is just frustrating. I have spent 4 hours trying to get it initialized and configured and cant get it working. The UI is normally good, but on this model it is unresponsive and cannot load half the time.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor M",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "this is an easy to setup solution without fighting headless linux installs and ...",
      "text": "After going through several iterations over the past 10 years of using servers for our home NAS, this is an easy to setup solution without fighting headless linux installs and random SATA controller (PCI-E raid controller) errors. Pretty much plug and play. We only use this as an samba share, so I have not used most of the functions within the software. I would highly recommend this product. Current configured to have 8 TB of drive space (wife is a graphic artist dealing with massive files).",
      "rating": 5.0,
      "verified": true,
      "author": "A. B. Dunn",
      "helpful_votes": 2,
      "publication_date": 20171118
    },
    {
      "title": "Great NAS but not the easiest interface.",
      "text": "This is a great network storage device. My only complaint is with the user interface. It is not the most intuitive design and not a great design for those who don't have a wealth of experience with servers. It really seems like the software could be made more user friendly. Other than that. it's a great product. I didn't want to give it 4 stars just due to it's interface but that's part of the package and is the only thing keeping me from giving 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Nice Software, but Unreliable.  6 failures in 1 year",
      "text": "4 New drives, lots of failures. Tried to expand SHR volume, failed on rebuild. Then NAS Device froze. Another time customer support said the DS418 cpu isn't strong enough for NIC teaming and recommended disabling second NIC (a feature I bought it for). Another time a disk mirror failed, then DSM software currupted (had to reinstall main OS), another time a disk mirror degraded, I repaired and it degraded again during the repair. Finally it worked. Going to try to RMA, not much faith at this point.",
      "rating": 2.0,
      "verified": true,
      "author": "Dllem",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "No problems at all",
      "text": "I have a very good experience with Synology; much better device than QNAP in speed and software protection. Both are Linux based; but, Synology is faster deploying security patch and running applications even for the same processor and memory hardware. QNAP is not bad but I like better Synology",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse L.",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Great machine for my NAS RAID 6 set up",
      "text": "I'm still learning how to use this but so far it has been fairly easy to set up and it's comforting know that I should never lose photos again. I have 4, 4 TB Western digital hard drives in it so I should have years of safe storage. Compared to the cost of data recovery (about $1300) for a wedding I lost, this is a bargain-even with the hard drives included. I look forward to getting all of my photos imported onto it and sleeping better knowing I will never have to go through the agony of disaster recovery of photos again. Also i needed to contact tech support and they were helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 2,
      "publication_date": 20171222
    },
    {
      "title": "Works well.",
      "text": "Using this NAS on my local network, it works flawlessly. When trying to stream my videos remotely, that is where the software needs to be improved because it doesn't seem to transcode H.265 codecs very well. But I can still just download the file remotely and then play it so it is not a dealbreaker. Overall very satisfied with this NAS.",
      "rating": 4.0,
      "verified": true,
      "author": "Laney",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Worked great!",
      "text": "No issues! I bought this as a way to upgrade above the \"Costco $150\" external drives that would seem to fail every 2 to 4 years... I paired this with a hard drive rated for 1M hours - a server class drive - the Seagate IronWolf - Seagate IronWolf ST10000VN0008 10 TB Hard Drive - note that this drive was also available for $50 less as an 004 model (instead of 008) but it appears that cheaper version has a smaller cache and is a bit slower... The drive slipped right in and worked right away.! Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "KeithFlorida",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Well designed product",
      "text": "I don't write many reviews but I had to give kudos to the design team at Synology. I just upgraded my NAS from an old 2 Bay Synology to a DS418. I just moved the drives from one to another and I was up and running in less than 10 minutes. Not easily done form a product design perspective. Outside of the simplicity of the migration, the Surveillance Station is very good as well which is what prompted me to upgrade. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Pompano Mark",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Wonderful little NAS",
      "text": "I've had this for about 6 months now and it has worked flawlessly since I set it up. I am using this for media storage and as a shared drive. The instructional videos on how to set it up are a bit value in some cases but if you mess with it long enough it's actually very easy for anyone to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth S",
      "helpful_votes": 2,
      "publication_date": 20180822
    },
    {
      "title": "Good media center",
      "text": "I use this mainly for a media center. Their video server software is nice as well as the app to view. Only wish they would release version that works on fire tv. The user interface is nice and there are lots of free apps that expand the uses. One thing I like is the included backup software (active backup) works with the community edition of VMware. So far it has been reliable and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ast",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great performance and value for the money",
      "text": "There's lots of NAS devices to choose from. This DS118 works great with the Seagate 8TB drive I installed in it. Good user interface with options for a simple & quick configuration or dive as deep as you want into the extensive features and options.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Nichols",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Synology Quality",
      "text": "Using as my iSCSI and NFS storage target for with XenOrchestra Hypervisor along with a 1TB Samsung Evo 2.5 SATA disk. Only 1GB RAM but it's handled everything I can throw at it including several packages downloaded from the Synology Package Store.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Good, but ...",
      "text": "After one week I realize that I’ve purchase the wrong item, this nas is ok if you need a backup solution, if you need more and more , go with ds918+. I’ve return this and purchase the ds918+ and I’m super pleased.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael I",
      "helpful_votes": 2,
      "publication_date": 20190127
    },
    {
      "title": "Does not do PLEX!",
      "text": "I have had this for awhile. It's pretty rad. I docked it a star for not being able to transcode plex. It can do it's own transcoding using DS Video, which is essentially Synology's Plex. The 418+ and 418play can both transcode plex I believe. Be sure to check the plex website before purchase if you plan on using it for that.I don't really NEED it, but it would have been a nice to have. It's memory is also not expandable. Those negatives aside, it's a pretty good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 2,
      "publication_date": 20180523
    },
    {
      "title": "My first Synology device.",
      "text": "I bought this to replace a Buffalo LinkStation that had a failing (and noisy) fan. I bought the single drive diskless model and installed a WD Red 6TB NAS drive. This setup is very quiet, can't hear it at all, and totally cool, not even a trace of warmth on the unit. It's faster and has nicer web management than the Buffalo had. The Buffalo was configured with a pair of WD Red 2TB NAS drives in a stripe, so it appeared as a single 4TB drive. It was always slower than I liked but until the fan started getting noisy it had run for almost five years, hardly ever turned off. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Neaux Peign",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Just buy it already. If you're looking for a NAS, you know this is the one you want.",
      "text": "My life vastly improved after I installed this in my home. Goodbye local PC storage. I use this thing to view files when I'm away from home and it's great. There is a lot of support for this thing online. I was thoroughly impressed with DS Video and how easy it is to set up. These things have features I don't even need or know how to use and it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Arlifus",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Excellent Product",
      "text": "Is an excellent product with lots of useful fatures, a bit slow and only one drive, so I returned it and bought the 2 drives with an improved processor, as personal cloud and after researching everywhere, Synology is the best system you can buy",
      "rating": 3.0,
      "verified": true,
      "author": "Elian",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "I'm an addict...",
      "text": "I bought this one to back up another Synology on the same network. I didn't need the performance, so I just needed it to be 4 bay and be a destination drive to backup my other one. Technically this one is \"off site\" because it is in the guest house, but it works great to back up my DS918+",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole and Bryce",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "A lot of storage and more",
      "text": "I've had two previous Synology NAS, both of them smaller two-bay units. But I find myself needing a lot more space these days so I got this four-bay unit. As before this is a great product, easy to setup and configure and super fast. I cannot recommend Synology enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Domenico Bettinelli",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great NAS, lots of features, well thought out and developed software!",
      "text": "Awesome product for a home server. I bought this to replace an old Windows 10 computer that I was using as a server. It is supper fast and all of the software has been easy to install and setup. I even connected our home cameras to the surveillance station software. I think that surveillance software and the apps are some of the best that I have used for ip cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "LJRG.A",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Work great with WD 1Tb red drive",
      "text": "Work great with WD 1Tb red drive. It take some time to get used to new way. There is a learning curve. Replaced old WD Netcenter 320Gb NAS.",
      "rating": 5.0,
      "verified": true,
      "author": "Vaclav D.",
      "helpful_votes": 3,
      "publication_date": 20180716
    },
    {
      "title": "Reliable NAS",
      "text": "Love the reliability of Synology. This model competes with the less expensive buffalo nas devices. But those units don’t last, ive had at least 4 of them fail after a few years. That’s why I went with Synology. 4 rather than 5 stars due to a bit of a weird setup process the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "Dans Electronics",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Learning Curve",
      "text": "Not the most intuitive for a mac or pc user. It appears to be linux based OS. Honestly it works wonderfully and is feature rich, but some people may need help setting it up.",
      "rating": 5.0,
      "verified": true,
      "author": "Epic Oak Tree",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Powerful and complex.",
      "text": "Extremely full featured. However, not for the novice or even intermediate computer user. Ideally, this device is best installed by a network specialist. It is not intuitive or user friendly. But it is very capable. I do not suggest it for the average homeowner. It is more business and business network oriented.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Don't know how I lived without it",
      "text": "Great device! Easy to setup, a bit of digging on youtube and I now have my own Roku-compatible 4K media server with torrent client, which downloads all the stuff via VPN (it took me 5 minutes to setup PIA VPN). I can task downloads through my PC, or cellphone from anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Nice desk top NAS",
      "text": "I like this NAS because it is not too big, accepts SSD and is quieter than my old one. Without spinning disks, there is no high pitched whine. It beeps when it is ready and has lights on the front that indicate the status of the individual drives. For small office file sharing it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R. Morrison",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great entry level NAS",
      "text": "This had y been a great addition to our house network. Our phones sync pictures automatically and I've ripped out movie collection so I can put the DVDs away and watch from any room in the house. Only drawback is the chipset in these isn't supported by Plex yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Not for the 'Tech noob' but functions great once set up.",
      "text": "I had too many frustrating days trying to set up PC back up's w the provided software. Installed 3rd party software to my PC and it worked great! Only 4 stars because of the tech difficulties. (I am using Win 7 Home - NOT Premium, so external back up wasn't a PC option).",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Davidson",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Best Item i ever spend money on",
      "text": "Everyone should have this for thier storage. It is very easy to use and can access it from anywhere. Only turn down for me is just the speed of transfer file over ethernet and memory usage. I wish there was a way to upgrade memory on this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Risit ",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Provides reliable mass storage at low cost",
      "text": "Installation is a bit tricky, but the instructions are clear. The device is fast and provides 45 TB of storage with four 12 TB disks. Operation is quiet, but this is a factor for the disks mostly.",
      "rating": 5.0,
      "verified": true,
      "author": "JRH",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Easy does it.",
      "text": "After building and rebuilding DIY NAS stations for the last several years, I was tired of dealing with bugs and updates. I decided to just go ahead and spend the money. Synology makes the setup easy and painless. They've done a fair job of making add-on packages available -- but they are missing PLEX. Oh well, guess that's something for that old DIY NAS hardware to do.",
      "rating": 4.0,
      "verified": true,
      "author": "M&J",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "The best way to back up your files",
      "text": "This DiskStation with 2 6TB internal hard drives is my way of dealing with my obsession with backing up my files. If you have ever had a hard drive crash, or if you have files that are of critical value or importance to you, a DiskStation with 2 hard drives is the best solution.",
      "rating": 5.0,
      "verified": true,
      "author": "W. J. Streeter",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Effortless setup and works perfectly",
      "text": "Plugged it in, popped in four WD Red disks, waited not all that long for it to initialize the disks, and have been happily using it since then without any issues. Both read and write speeds are very fast, and the capacity is huge.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "It's basically like having another computer on your network",
      "text": "Probably way more of a NAS than what I require but it's been solid so far. It's basically like having another computer on your network, there are so many options and various programs this thing runs. Aside from the learning curve, it's been reliable and I haven't had any issues at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "BEST. STORAGE. SOLUTION. EVER.",
      "text": "As high as my expectations were, it went beyond them! The definitive solution for Network Attached Storage. The interface is Linux-based but VERY intuitive (better than any Ubuntu or Mint). It has solved all my storage problems (I used two 6TB Seagate Ironwolf HDDs, and I still have room for two more when needed). There are also plenty of YouTube tutorials about Synology NASes... Really no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "The Mad Count",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Quality Product",
      "text": "This is my third Synology NAS drive, and I couldn't be happier with them. Hardware quality is second to none, and the UI is full of features and very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181228
    },
    {
      "title": "very fast and has more features than I could ever use",
      "text": "Upgraded to this from a Lenovo IX2-DL and man what a difference! This thing is very fast and has more features than I could ever use. I have 3 WD RED NAS 6TB drives in SHR and it works great. Plenty of room for all of my video, music, backups, photos, etc plus I created accounts for my whole family to store their important files and share whatever they want.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Keifer",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "This is a great NAS that does alot more than just host files",
      "text": "I went back and forth for some time trying to figure out what NAS to buy to replace my loud/hot Dell R710 server. This is a great NAS that does alot more than just host files. I've been very impressed with the unit so far and with 4 x 4TB HGST DeskStar drives I can hit ~900Mb/s in write speeds when backing up my PC with Veeam Free. I highly recommend this unit, its exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "The easiest and versatile home NAS",
      "text": "Very nice affordable home nas, very suited for photographers and full of usefull tools like drive app (similar to dropbox), and other picture oriented apps, plu, use and forget",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Alfonso Umaña Trujillo",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "An extremely nice NAS with a lot of additional bolt-on apps",
      "text": "The device is one of the best NAS devices I've used so far. It is very easy to setup and comes with an array of software that can be downloaded such as an anri-virus app, a cloud storage app for backing up and it can be setup put in a DMZ for file sharing. I don't believe anything is perfect so I don't give 5 stars but, this device I would rate a 4.5 out of 5",
      "rating": 4.0,
      "verified": true,
      "author": "Hollywood9712",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Best NAS I have purchased",
      "text": "I used to get WD Sentinels for my clients backup servers but they died within three years. Either the drive would die or the OS got corrupt. I started getting Synology's and so far these work great. I have not had a problem with one yet.",
      "rating": 5.0,
      "verified": true,
      "author": "AlanJD",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "easy peasy to use",
      "text": "They are so successful for a reason. I'm using this as tertiary backup to a small, Mac - centric office. Set & forget. Minus 1 star for the cheap plastic enclosure. My fault for assuming it was metal at this price.",
      "rating": 4.0,
      "verified": true,
      "author": "Butch Deadlift",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Easy to setup and good web interface",
      "text": "After trying to get my Buffalo Terastation to work for almost a year and failing, this NAS has been a welcome relief. It was super easy to setup, and their web interface for accessing from a different network is 100% better. There are so many options I haven't tried yet, but I'm happy with the basic setup I have.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wagner",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "No official docket support",
      "text": "Docket and other custom apps don’t seem to be “compatible” with this particular model even though they work for other models. Even Plex doesn’t work with this model. Need to spend more money on better hardware for the more complex nas",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren N Taylor",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Good Network storage Device.",
      "text": "I like this product. I haven't delved into the full potential of this device but everything is working fine so far. Using it as Network storage for other devices on the network.",
      "rating": 5.0,
      "verified": true,
      "author": "Mobilemike ",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "This NAS can grow with your needs",
      "text": "This NAS is the perfect fit for the home user, it’s flexible and has tons of apps, it has a little bit of a learning curve to it but once you set it up you will enjoy using it",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse munoz",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "A solid NAS",
      "text": "Just awesome product with lot of features. Don’t expect superspeeds , it is what it is . Good for home use like file sharing",
      "rating": 5.0,
      "verified": true,
      "author": "RamsInd",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Good performance for the miney.",
      "text": "Fast just the level of performance I need. For video streaming at home. Only problem is Video Station software found pornographic titles online for technical videos. Had to diable online data lookup. Construction is not robust. Needs tender care.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Nemcik Cruz",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "I should get the 2 bays",
      "text": "If you need the VPN service then i highly recommended you get 2 bays model. Its much better. For this model other than VPN everything working fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Jiang",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Ds218 & iron world. Great!",
      "text": "Easy to set up with the Seagate iron golf nas hard drive. Great apps. Easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "JOSE ANTONIO VALDEZ CHAVIRA",
      "helpful_votes": 2,
      "publication_date": 20200603
    },
    {
      "title": "Mediocre NAS for cost.  Others might be better value.",
      "text": "Basic NAS function is mediocre for cost, but does work well. Tech support is below average, unless you escalate to managers, which works fine. Mobile apps function but you’re on your own to figure them out. Or even why so many are necessary.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike M",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Awesome product.... just works.  Best NAS I've ever owned.  Feature rich.",
      "text": "Best NAS I've ever had. The software rocks. The hardware also rocks. It just works, no fiddling around with linux or random disk setup. Plug and play. The web UI is not some cheezy software developed by kids. It's refined. Far exceeds my expectations as a NAS. If you can swing the price, do it, you will not regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Solid, Just Works",
      "text": "Unit has been running with 2 4tb RED drives. No issues, easy to setup. It is only being used as network storage, no apps. Upgraded with a Noctua fan to make it a little more quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt T",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Now even their entry-level NAS units are fast",
      "text": "Very affordable and very fast NAS. I put 5 of these in for a client and am very happy with the performance and expansion capabilities. Synology Rocks!",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Bates",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Great!",
      "text": "I'm glad I brought this device over building another homemade NAS. They work fine, but Synology did this NAS package (hardware and software) better.",
      "rating": 5.0,
      "verified": true,
      "author": "hawk158",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Works Great",
      "text": "Using with cloud sync to MS onedrive and google drive. Also using with Plex to stream my music collection to my car via Android Auto and record some shows. Works great when direct playing...",
      "rating": 5.0,
      "verified": true,
      "author": "SI-285",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Good product for the money",
      "text": "Easy to use, setup, lots of functionality and apps. Lots of good support online. A little bit loud, 4k transcoding lags a bit. Perfect for small-scale plex server (no need for RAID for that lol)",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan Stclaire",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Running as an internal movie server transfer all my movies ...",
      "text": "Running as an internal movie server transfer all my movies via usb 3.0 Using a patriot fast drive , bought a 6 inch usb 3 cable to hang off the NAS port USB to NAS exceeds 100MB sec Will convert memory to 8GB and repost",
      "rating": 5.0,
      "verified": true,
      "author": "bghmsh",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Great NAS",
      "text": "Easy drive install. That took me 10 minutes. Ran the find command in my browser and it found the device in a few seconds. Followed the prompts and I was done in no time. Went to Sonology NAS setup and found great YouTube instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "i got this 418 put in the hard drives and it was Easier then the initial setup from the 718",
      "text": "does not lag on me and i stream plex on it... over wire and wire no issues",
      "rating": 5.0,
      "verified": true,
      "author": "ken",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "I/O performance is fantastic, the NIC bonding works really well",
      "text": "In hindsight I wish I got the five bay so that I could use a SSD for cache. Otherwise I'm blown away by how well this thing works. The WebUI is intuitive and filled with features. I bought it specifically for NFS and iSCSI and wasn't even aware how much this little box is capable of. I/O performance is fantastic, the NIC bonding works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "anglocide",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Worked instantly",
      "text": "It worked right after I put the drives in and plugged everything in. It was recognized by the software that I was using from another NAS from Synology. They've always responded completely and wonderfully to every question or problem I've had including helping me update a NAS that I hadn't updated for around a decade.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Batdorf",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Very solid NAS device.",
      "text": "Synology has a really solid device here. I've used a lot of Drobo's and QNAP's. The Synology easily beats them with their built-in functionality and third party developed apps. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Steve-Colorado Springs",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Not Supported by SynoCommunity at this time!!!",
      "text": "Please note that if you are buying this to use with SynoCommunity this is currently not supported by most packages in the comunity.",
      "rating": 3.0,
      "verified": true,
      "author": "Ultimate",
      "helpful_votes": 3,
      "publication_date": 20171217
    },
    {
      "title": "Easy setup",
      "text": "The NAS drive was easy to setup and get up and running after ordering the hard drives for it. It came in on time.",
      "rating": 5.0,
      "verified": true,
      "author": "pman",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great server!!",
      "text": "This server is absolutely great! So easy to use. We keep our backups of pictures on it, and it works so well!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Anderson",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Fast and reliable",
      "text": "After 7 years my Synolgy DS411 failed and would not power up again. Ordered the DS418 to replace it. Simply inserted the disks from the DS411 and migration was extremely simple and quick. I had an external USB backup just in case there were issue.The DS418 is much faster CPU and double the memory. It also has two 1Gb network ports. Great product. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay W.",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Very good and full featured product",
      "text": "Bought this for backup of my home network. Works perfectly with Windows 7 and Windows 10. LAG setup painless to get 2GB thruput.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Very happy with this purchase",
      "text": "I should have bought this a long time ago. The best NAS out there for home use. It's my first time buying a Synology and I am so pleased with this compared to other brands. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "deaneski",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Works for my multi IP camera system storage",
      "text": "Easy setup and works perfectly. I installed my spare 500MB HDD without issue. Easy to manage and navigate.",
      "rating": 5.0,
      "verified": true,
      "author": "GO HAWKS!!!",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Standard NAS",
      "text": "I just replaced my ds220j with this model (ds218) and I coud say it's 10x faster with the 2g memory in it. This is the standard of NAS. I used this to back up my photos, including files and videos using iMac and so far I'm very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sid Acurantes",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Great NAS, but steep learning curve for beginners.",
      "text": "This NAS appears to be really good. However, I'm struggling with how to best set it up. There are so many \"apps\" that are not very explanatory and the documentation is sparse. I feel like this should be a lot easier than it is.",
      "rating": 4.0,
      "verified": true,
      "author": "JoeyD",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Very slow NAS",
      "text": "Too slow! The processor was at 99% for the majority of the time while reading/writing data.",
      "rating": 1.0,
      "verified": true,
      "author": "J Dubb",
      "helpful_votes": 11,
      "publication_date": 20180130
    },
    {
      "title": "This is an awesome little server",
      "text": "This is an awesome little server. Took no time to set up and get running. Love how I can hit as a web page and transfer files from pre-existing server without having to route through another computer. I've used Freenas for several years and prefer this much more.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Turner",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "You won't be disappointed.",
      "text": "Works great with chromecast and google drive. I like having encrypted backups stored online in google's cloud. Give me another point of disaster recovery. I'm also using the built in VPN and surveillance system which work great. I do wish their surveillance software had better export and search functions but it still works OK for home. Synology is constantly releasing updates and addons. Nice to see a manufacturer actively improving their products months after purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "DS218 actually worke! No issues like DS217 series!",
      "text": "Works great. Fast! No issues! Holy moly! Previous model year had fans failing, boards failing, noc failing etc... this unit has been rock solid!",
      "rating": 5.0,
      "verified": true,
      "author": "CRAZY4TECH",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Very nice and easy set up",
      "text": "Great product and easy to set up! Now I have my private NAS for all of my media files!",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne H",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Excellent product",
      "text": "Great product for backup and recording surveillance cams used in/out of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie White",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "its a nas and works",
      "text": "it's a nas and works. you can read reviews elsewhere",
      "rating": 5.0,
      "verified": true,
      "author": "Professor",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "ease of installation",
      "text": "Still having issues but I believe tht it is the drives that I have installed. WD red 3tb. they are from another NAS and 2yrs old.",
      "rating": 4.0,
      "verified": true,
      "author": "BigBird",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Best NAS drive",
      "text": "Best NAS drive ever this is not just a NAS drive it's almighty server",
      "rating": 5.0,
      "verified": true,
      "author": "Edwin MH",
      "helpful_votes": 2,
      "publication_date": 20180522
    },
    {
      "title": "After some major issues in the beginning when the disks ...",
      "text": "After some major issues in the beginning when the disks would not stop spinning 24/7, it started working properly after a few months and since then is a breeze to use.",
      "rating": 3.0,
      "verified": true,
      "author": "Philipp",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Good equipment",
      "text": "Tons of apps. Techie knowledge w help get these things up and running.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20190708
    }
  ],
  "product_meta": {
    "title": "Synology 4 bay NAS DiskStation DS418 (Diskless)",
    "description": "Size:4-bay; 2GB DDR4| Style:DS418Synology Disk Station DS418 is a high-performance and versatile 4-bay NAS, specifically designed for offices and home users to effectively manage, protect, and share data. Its new 64-bit quad-core processor supports volume management of large-capacity storage and 10-bit 4K H.265 video transcoding to enrich multimedia entertainment. Synology DS418 is backed by Synology's 2-year limited warranty.Power Frequency : 50/60 Hz, Single Phase",
    "rating": 4.6,
    "feature_bullets": [
      "Sequential throughput performance at over 226 MB/s reading and 170 MB/s writing",
      "Dual 1GbE ports with failover and Link Aggregation support",
      "4K 10-bit H.265 video transcoding on the fly",
      "Over 40TB raw single volume capacity. Operating Temperature - 5°C to 40°C (40°F to 104°F)",
      "Storage Temperature -20 degree Celsius to 60 degree Celsius (-5 degree Fahrenheit to 140 degree Fahrenheit)"
    ],
    "specifications": {
      "Brand": "Synology",
      "Series": "DS418",
      "Item model number": "DS418",
      "Hardware Platform": "Mac",
      "Item Weight": "5.03 pounds",
      "Product Dimensions": "8.78 x 7.83 x 6.54 inches",
      "Item Dimensions  LxWxH": "8.78 x 7.83 x 6.54 inches",
      "Voltage": "240 Volts",
      "Manufacturer": "Synology America Corp",
      "ASIN": "B075N17DM6",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 16, 2017",
      "Customer Reviews": "4.6 out of 5 stars538 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#2 in Network Attached Storage"
    },
    "categories": [
      "Computers & Accessories",
      "Data Storage",
      "Electronics",
      "Enclosures",
      "Network Attached Storage"
    ],
    "price": 369.99
  }
}