{
  "website_summaries": [
    {
      "verdict": "Despite the useful conveniences the U by Moen Smart Shower adds to your daily routine, the barrier to entry is too high unless you're already planning a premium remodel.",
      "pros": [
        "You can control the U by Moen Smart Shower with a well designed app",
        "Presets in the app let you make profiles with custom temperatures for different family members",
        "Moen will also warm up the shower and pause the waterflow when it's ready"
      ],
      "cons": [
        "The high price for the Smart Shower doesn't include any shower heads, and installing this gadget is a task for a plumber",
        "The app occasionally stumbles with repeated use of a single preset"
      ],
      "aspects": {
        "Features": 7.0,
        "Usability": 7.0,
        "Design": 8.0,
        "Performance": 7.0
      },
      "publication_date": 20170221,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Spa-like experience",
      "text": "This product is expensive but worth it! I just completed a DIY Master Bath Remodel and installed the U by Moen system in my shower. The control panel can be easily placed anywhere in the room (ours is five feet from our shower heads so we can turn it on without getting wet). We have a main showerhead and body sprays connected to the two outlet ports. Our shower is always the perfect temperature as soon as we step in (I like 101 degrees and my wife likes 109), and it maintains temperature even if someone is doing dishes, running the laundry or flushes a toilet. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "HandyDadTV",
      "helpful_votes": 15,
      "publication_date": 20180427
    },
    {
      "title": "Love it",
      "text": "I’ve had this for over a year now and couldn’t be happier. It’s amazing to just push a button and have water at the temp you want and to not have to worry about temperature variations ‘",
      "rating": 5.0,
      "verified": true,
      "author": "Julian",
      "helpful_votes": 4,
      "publication_date": 20190124
    },
    {
      "title": "So simple entire family jumps in and sets temp and picks there shower heads. Love it",
      "text": "Best controller ever. Only thing I read in other reviews was that you could not adjust water flow, but I never would want too. This is so easy compared to the old manual valves that were use the other heads all the time, that is the best feature. Temp control is perfect even after flushing toilet. I am so happy and I read a lot of reviews and studied up on all options. I have 4 heads and to berry same moen manual valves would be 560 dollars less. This is very much worth that cost to upgrade. And, I installed it all myself, instructions were helpful. This is a must if you ate going to have multiple heads.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott A.",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Smart Shower for an affordable price!",
      "text": "We were shocked when our local plumbing supply store sold this product for much more than Amazon. I was a bit hesitant in purchasing from Amazon, but I'm happy I did. The installation was a breeze for my plumber and the product seems to work well. For some reason, we lost electric to the unit but it somehow came back. Not sure what the issue was, but it hasn't happened after the first week. I understand that there is an app to control the water. The unit is installed in my boys' bathroom and they use Alexa to turn on the water-based on their user profile and heat setting. Fantastic product.",
      "rating": 5.0,
      "verified": true,
      "author": "GCV",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "The best Alexa device we own.",
      "text": "This is not only the coolest home automation device we have but it has several hidden benefits. For the elderly who has trouble getting water temperature right, it prevents burns from to hot water. It saves water because you don’t stand there adjusting the temperature. It has been reliable and the installation is easier than a regular shower valve. We are very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Brenda C. Landers",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Who knew one needed this?",
      "text": "At first I thought this was overkill, especially considering the price, but now that I have it installed I don't want to live without it anymore. Heats up the water rapidly and keeps the temperature steady, even if the washing machine/ dish washer are running and would normally change the water temperature slightly. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Warning DO NOT PURCHASE",
      "text": "I installed this moen smart shower in December and it’s already defective. The shower will not turn on and I’m not able to shower at all. The shower also would on show off one time and I had to unplug the moen and prayed to god and it shut off thankfully. This moen is crap and. I don’t wish this stress on anyone else. Do not buy a moen shower system.",
      "rating": 1.0,
      "verified": true,
      "author": "Dangerspiderpig",
      "helpful_votes": 2,
      "publication_date": 20190903
    },
    {
      "title": "great product",
      "text": "this was much cheaper than the kohler product and does the same thing. we used this in a huge shower with 4 shower heads. it is really fancy and everyone that sees it wants to take a shower at our house. this is a great product. very happy with the purchase. we use this with the 4 valve product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tfess",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Wonderful controller",
      "text": "We really live this product. My wife and I have our own preset settings. Walk over to the unit, hit your present and a few minutes later it tells you the water temperature has been reached. This operates 4 different shower devices- main, handheld, rain and body sprayers. Really great experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas C. Holbrook",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "very cool, minimalist look",
      "text": "Very cool addition to our newly remodeled bathroom; minimalist look without all the shower valve hardware - easy to use - love it. Very luxurious. Only drawback for me is the screen stays on 24/7 and is very bright; have to cover or shut the bathroom door at night.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Green",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Finally went into WiFi set up mode as has been described by others.",
      "text": "At First ever been able to connect it with Alexia and after trying to reconnect with WiFi the set up mode will not generate the temporary WiFi network when you hit the temperature up button as instructed. I gave it negative ratings but finally called in and they were super helpful and fast at solving it. Now I love it. Once in a while it goes blank and I have to unplug it and take out the batteries to reset it. (Twice in two years). But I still love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Macutak",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Great device but pricey and a could use better tech",
      "text": "If it loses power you need to leave it powered off for a couple of minutes for the valve to reset before the controller will power back on again.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Great when app works correctly",
      "text": "Great shower gadget when the app works correctly to save time from having to lean into shower door to turn on",
      "rating": 4.0,
      "verified": true,
      "author": "Caleb Pressel",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Perfect for our bathroom remodel",
      "text": "Perfect for our bathroom remodel. Works great. Our plumber and electrician were able to install with no issues. I can’t live without this now. The phone app works great too",
      "rating": 5.0,
      "verified": true,
      "author": "Peacemaker",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Worth the expense",
      "text": "The future is here. Automated temperature control and flow. Great customer support for installation. Bought two systems one for tub and one for shower. Icons are easily customized.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Helmy",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Amazon had lowest price I could find.",
      "text": "So far I love it, easy to install easy to operate, do not have any problem staying WiFi connected as someone said below.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Stephens",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "21st century shower!",
      "text": "This takes a little work to get it set up, but once it is set up it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Park City MD",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Awesome!",
      "text": "Been in service a year now and has worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Alf Kramden",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Cool Idea. So I included it",
      "text": "Cool Idea. So I included it,Tiled a shower with 4 heads, pulled the control out of the box and ...nothing, there is power to the unit but no lights and no noise. Of course its the middle of the weekend and no one is available at Moen. Hope to get it fixed since it will be a major and expensive pain to re-plumb.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 8,
      "publication_date": 20180407
    },
    {
      "title": "Great product, super support!",
      "text": "The product is outstanding. Really takes your shower project to the next level of luxury. Everything was working fine, until I tried messing with the Apple Homekit feature. I ended up having to call Moen tech support and was blown away by how helpful they were. Really, US based support, the guy I spoke to knew the product fluently and was able to solve my problem quickly. This was a DIY install, no issues. Love the outcome.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Batta",
      "helpful_votes": 0,
      "publication_date": 20201210
    },
    {
      "title": "Good for home automation.",
      "text": "These are really great for a home automation enthusiast especially if you use Alexa and Amazon. These are as integrated with Alexa as they can be. They can be controlled using routines. I added my shower to my morning routine which turns the fan off, turns on a lamp, states the weather for the day, and now turns on my shower to a preheat setting. I have a mesh wifi setup with good coverage. No issue connecting to wifi. For some reason, they always show as disconnected in the Alexa app, but so far they have always responded to commands whether spoken or using the app. Happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "The digital valves are fine, but if you're hoping to control them with ...",
      "text": "If you're looking for a stable WiFi connected controller that you can use from your phone, look elsewhere. I have two of these, have no problem making the initial connection, have a strong WiFi signal throughout the house, but the controllers are constantly going offline. The only way to fix the problem is to reboot the gateway. The controllers both come back online, but within 10 minutes they are offline again. Very frustrating to spend this much for WiFi technology and not have it work. The digital valves are fine, but if you're hoping to control them with your phone, you'll be frustrated and disappointed.",
      "rating": 1.0,
      "verified": false,
      "author": "RM",
      "helpful_votes": 20,
      "publication_date": 20171113
    },
    {
      "title": "A truly horrific product and experience",
      "text": "This product is horrible! Very expensive and it does not work! This is my second unit and neither one will display the “Moen WiFi network” which means that it cannot be set up! After spending thousands of dollars for this unit and several thousand installing it in the wall it is a sham! Do not buy this product! And Moen is completely useless in helping to resolve the many issues.",
      "rating": 1.0,
      "verified": false,
      "author": "Ronald S Oates",
      "helpful_votes": 8,
      "publication_date": 20181003
    },
    {
      "title": "Needs to be a little more advanced",
      "text": "I have the older Moen Iodigital control. It works well. But I would like Alexa and iPhone integration. I don't care about the cost. However, after doing research I don't think I will pull the trigger. The Shower U does not allow control of volume. The Iodigital does. Why did they remove a capability? To save a few a few bucks? That. loses the high end customer. Instead Moen should make a model that allows different temperatures for different outlets, volume controls, and programming of spa experiences. That would be an upgrade, and not a downgrade. This looks like a neat system, but it offers no advantage to someone like me with recirculating HW and an IoDigital installed.",
      "rating": 3.0,
      "verified": false,
      "author": "Frank Dobbs",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Not a \"Smart\" device",
      "text": "The good; a single push of a button on the wall pad or your phone and it maintains constant water temp throughout your shower. The bad; I use HomeKit automation and this is not a \"Smart\" accessory. It is useless regarding home automation. For example you cannot set up your shower fan and shower light to turn on when you turn the shower on. The U by Moen is a \"Scene\" in Homekit and not an \"Accessory\", so you cannot automate other accessories when the shower comes on. It is useless as a smart home application .",
      "rating": 2.0,
      "verified": false,
      "author": "K.S.",
      "helpful_votes": 2,
      "publication_date": 20191221
    },
    {
      "title": "Power outage will fry the console",
      "text": "A power outage rendered the unit useless. Once the power came back on the screen is now dead. We had a battery backup with new batteries and nothing saved this thing. I googled and this happen to others. Beware! This has rendered our shower completely and absolutely useless with no way to bring the moen back on. Again after a 10 second power failure, the light came back on but the shower is now completely dead forever. I’ll have to call a tech for a warrantee replacement and honestly I’d rather have a normal working valve for next time. Booooo Moen. You suck.",
      "rating": 1.0,
      "verified": false,
      "author": "Thoughtful American",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "LCD doesn't last long",
      "text": "We've had the controller in our home for 2 months and really like it, but suddenly a black dot showed on the LCD... resetting didn't help. Looks like the display has some kind of cancer. Our plumber is replacing the unit for us, will update the review with status and how long that one lasts. We're also using just 3 of the 4 valves. Would be nice to be able to blank out the icon for those valves not in use.",
      "rating": 2.0,
      "verified": false,
      "author": "gnomehole",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Nice... when it works",
      "text": "This product would be convenient if you could rely on it to always be visible to your network and if it didn’t totally shut down and require an an obnoxious reboot process several times in the past few months following installation. I might go without a “smart” shower when it comes time to replace this one.",
      "rating": 3.0,
      "verified": false,
      "author": "Eric Prescott",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great addition to the bathroom!",
      "text": "This is the most technologically advanced shower control I have ever witnessed. It is so nice to step into a shower set to a temperature that is controlled without fussing with knobs or dials. Turning on other items like body sprays or the hand shower is just as easy too. Our recent bathroom makeover project included the four outlet controller, body sprays and hand held spray as well. It looks sleek and modern, a very nice feature to have.",
      "rating": 5.0,
      "verified": false,
      "author": "S. Hall",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "dont buy this unit",
      "text": "I have had this unit for 3 months. IF you house power goes out the unit will fail and have to be reset. The unit will go into pause and will not reset. I called Moen, put on hold, and then told to set up an appointment for 7 days from now to simply talk to them about the unit's problems. The unit is too expensive and troublesome when you can simply turn on a water valve. To pull the unit, i have to tear down my brand new tile. DO NOT bring this trouble into your life. Moen makes great valves but not electronics.",
      "rating": 2.0,
      "verified": false,
      "author": "Mike Mitchell",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "SO HAPPY",
      "text": "I LOVE THE MOEN U! It's so sleek and it works really well. Follow me on instagram @homewithmaura for more design ideas!",
      "rating": 5.0,
      "verified": false,
      "author": "@homewithmaura",
      "helpful_votes": 0,
      "publication_date": 20191018
    }
  ],
  "product_meta": {
    "title": "U Shower by Moen Smart Home Connected Bundle for 2 Outlet, Complete with Digital Controller, Valve and Backup Battery Kit",
    "rating": 4.5,
    "feature_bullets": [
      "Now featuring three ways to control your shower: voice, phone, or controller",
      "Remote activation with Amazon Alexa and U by Moen smartphone apps",
      "Compatible with Amazon Alexa.",
      "The app driven shower controller features an easy-to-read LCD screen that's outlet powered and Wi-Fi connected",
      "Control the shower with soft-touch buttons that operate two outlets, Plus power, temperature, and preset selection",
      "U by Moen shower is only supported in the US and Canada"
    ],
    "specifications": {
      "Manufacturer": "Moen",
      "Color": "Terra Beige",
      "Style": "2 Outlet with Valve and Battery Kit",
      "Item Package Quantity": "1",
      "ASIN": "B0757BBWND",
      "Customer Reviews": "4.5 out of 5 stars98 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#32,411 in Tools & Home Improvement",
      "Date First Available": "August 29, 2017"
    },
    "categories": [
      "Bathroom Fixtures",
      "Kitchen & Bath Fixtures",
      "Bathtub & Shower Systems",
      "Tools & Home Improvement",
      "Bathtub Faucets & Showerheads"
    ],
    "price": 784.31
  }
}