{
  "website_summaries": [
    {
      "verdict": "Suction cups stick well to both glass and plastic and are perfect for stemless wine glasses, as well as tall drink glasses.",
      "pros": [
        "Suction cup charms are easy to attach to any glass, perfect for those who prefer a stemless wine glass",
        "Set comes with a variety of comical and detailed emoji faces",
        "Charms can easily be stored on the side of your fridge for quick access",
        "Also works well on plastic cups"
      ],
      "cons": [
        "Emojis are larger than they appear in the photos"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fun & Useful!",
      "text": "I’m not sure how long these will last but I brought them to a casual party as a hostess gift and they were a hit with adults and kids alike. My friends had fun picking out an emoji to use and liked knowing which glass was whose. The kids got jealous of us and put them on their juice cups. They stick very well. Perhaps a little too well...I sometimes found it a little difficult to remove. They are bigger than expected but that makes them easier to spot and easier to remove. Overall, a great, inexpensive gift!",
      "rating": 4.0,
      "verified": true,
      "author": "Mostly Maven",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Not all different",
      "text": "These stuck to the glasses easily and were cute, but I did NOT receive 12 different emojis as is shown in the pictures. Several were repeated 2 or 3 times.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Fun!!!",
      "text": "These emojis were absolutely adorable!! I would definitely buy some more as hostess gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "christine",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Fun!",
      "text": "People thought these were hilarious and really fun during our camping trip. I was sticking them to plastic short, disposable wine glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Taylor Weber",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Cute and Reasonably Priced",
      "text": "Love these! They are super cute and creative! The suction is pretty good, I've only tried using it on a one type of glass so far. They are a little bit smaller than a quarter.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Ash",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "They are great, worked for what we needed!",
      "text": "I bought these to use on a wine tasting birthday trip. They were a big hit. Only bummer is that the poop one was the Birthday girl’s favorite and we couldn’t find it anywhere the next day ☹️",
      "rating": 5.0,
      "verified": true,
      "author": "AnnMarie McCarthy",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Good Size, Looks exactly like the picture",
      "text": "This was a add on gift for a bridal shower, so I never opened it. But it came exactly how the picture showed it. Each piece looked exactly like the picture and were bigger then I thought they would be. Bride loved them !",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Highly recommend!",
      "text": "We love these for being able to tell kids glasses apart! Great for cutting down on dishes!",
      "rating": 5.0,
      "verified": true,
      "author": "KGood",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Super Cute & Fun",
      "text": "It is great because it can be used on stemless glasses. Everyone Had a lot of fun at our last gathering with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Great!",
      "text": "These are a good size, not tiny. I used for Thanksgiving and they worked perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Valdez",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Perfect for non stem glasses.",
      "text": "Love them. Very useful especially if you are not using stem glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Super Savvy 🐐",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "So freaking cute!!!!",
      "text": "These are so cute! I used them for any dinner parties I've thrown and it's a hit with EVERYONE! They stick on glasses and even plastic cups for the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Devi0us",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Adorable!",
      "text": "These were a gift, so I'm not sure how they will hold up, but they are soooo cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllis Tutor",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Cute but doesn't stick :-(",
      "text": "I was super excited about using this for our party as the emojis are very cute. Unfortunately, it doesn't stick and keeps falling off. Wouldn't purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "R.E.",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "I LOVE these emoji markers!!!",
      "text": "These markers are so fun for parties with friends! We all enjoy picking our emoji and the suction cups are a great way to keep them on the glass!",
      "rating": 5.0,
      "verified": true,
      "author": "Shellpurplelover",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Fun and functional",
      "text": "We hosted some parties, and these were a hit! Not only do they help distinguish everyone’s drink glasses, they were so much fun with the different emojis.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Q",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Don't stay on",
      "text": "They don't stay on glasses OR cans. The suction sucks. 😄",
      "rating": 1.0,
      "verified": true,
      "author": "JodieLU",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Cute! Don’t swap germs and mark your cup!in a fun way!",
      "text": "So fun for making sure we don’t mix up drink glasses! I use them on my kids’ drink cups too. My son loves to choose who gets to be the poop emoji.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Excellent item",
      "text": "Good product, good service. Now if I can just get everyone to use them!",
      "rating": 5.0,
      "verified": true,
      "author": "judy eyges",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Items not as advertised",
      "text": "The item says 12 pieces, but there were only 2 in an open package. Don’t buy this product.",
      "rating": 1.0,
      "verified": true,
      "author": "David B",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "They are great for stemless wine glasses",
      "text": "These were a hit at our Thanksgiving affair. They are great for stemless wine glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Love these!",
      "text": "These have been SO helpful for when we have guests or my son has friends over (or even for when it’s just me and my son and I can’t remember if that cup was mine!). They stick well to multiple types of cups and glasses, and they’re fun too- it’s fun to see who picks what and why! Would definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Scarlett",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "These work great. We use them on regular cups and glasses ...",
      "text": "These work great. We use them on regular cups and glasses so that my kids are not grabbing multiple glasses throughout the day and getting them mixed up.",
      "rating": 5.0,
      "verified": true,
      "author": "shoeshopper",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "They were a hit! Received exactly what was described!",
      "text": "These are really cute. Got them as an add on gift 4a friend who hosts our girls night in gatherings & she uses wine glasses without a stem so it had 2b specifically 4any glass which can be difficult 2find. They were a hit! As soon as she opened her gift everyone grabbed the 1 they wanted like I just busted a pinata open! We all stuck 1 on our glass & they never fell off once the whole night. Only downside was that they came in a cheap little baggy not good as a gift so I bought some little mesh gift bags from amazon & it looked great!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Rhodes",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "These emoji glass charms are adorable! They stick well to the glass too",
      "text": "These emoji glass charms are adorable! They stick well to the glass too. They make for great hostess gifts. I bought 3 packs so I always have a hostess gift on hand in case of an emergency! Friends will love the cute faces!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tksharp1",
      "helpful_votes": 2,
      "publication_date": 20160824
    },
    {
      "title": "fun",
      "text": "so much fun that my grandkids wanted to take them and keep on their glasses. they stuck pretty good to the cups, glasses and even stuck to them after washing the cups, glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosina",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Huge hit at my last party",
      "text": "Love these. Will be buying for the holidays. Perfect gift for anyone who likes to entertain. The suction cups stay put all night long.",
      "rating": 5.0,
      "verified": true,
      "author": "Kalyn",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "they serve their purpose in a fun way!",
      "text": "I didn't expect them to be as large as they are, but they're really cute, and the suction cup stays on all day. More importantly, they serve their purpose in a fun way!",
      "rating": 4.0,
      "verified": true,
      "author": "daddys3rd1075",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Fun on a Glass!",
      "text": "Love these glass markers! First time use - everyone was trying to find their favorites before another person could get it. Fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla Blevins",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Favorite over all purchased",
      "text": "Love the, went over well with children in the family, who kept the as gifts..I will be ordering replacement",
      "rating": 4.0,
      "verified": true,
      "author": "ILIKEBlue",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "I think that will almost work better.",
      "text": "Thought these were magnets but they are suction cups. I think that will almost work better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Cute and functional",
      "text": "As cute as they look! A great size and cool faces. Everyone in the family is keen to use these, so we can finally keep our own glass now",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Suction cups not secure",
      "text": "Many of these charms had loose suction cups on the back, and a couple even fell off completely. Cheap junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Works great",
      "text": "It stays on the wine glass and does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Five Stars",
      "text": "Fun and Funky :-) and stick very well to glasses, and plastic as well.",
      "rating": 5.0,
      "verified": true,
      "author": "SEA SHELL",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Five Stars",
      "text": "they work great on glass! very happy with the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Karen E.",
      "helpful_votes": 0,
      "publication_date": 20170805
    }
  ],
  "product_meta": {
    "title": "MelonBoat Poop Unicorn Emoji Wine Charms for Glasses, Universal Drink Markers with Suction Cup, 12 Pack",
    "description": "Color:Funny face 12Specifications: \nColor: Yellow ; Material: Silicone\nSize: 1 inch ; Weight: 20g \n\nFeatures: \nIt's so durable and stick well to non-porous flat surfaces like glasses, mirrors and stainless steel.\nYou can pick out the emoji marker that best fits your mood. \n\nNotes: \nIf suction did't stick well,please wet it.That will help\n\nCustomer Services: \nIf you are not 100% happy with your purchase, we would offer you a replac好ement or 100% Money Back.\n\nPackage includes: \n12 different moods in a package",
    "rating": 4.4,
    "feature_bullets": [
      "Distinguishing everyone's drinks. 12 different adorable emoji markers are molded in silicone.",
      "The suction cup are durable and stick well to non-porous flat surfaces like glasses, mirrors windows and stainless steel.",
      "You can pick out the emoji marker that best fits your mood.",
      "Unique wine glass markers make a memorable impression at any event.",
      "Perfect for hostess, housewarming, birthday gifts, wedding presents, Christmas, emoji party, holiday gifts for friends or neighbors."
    ],
    "specifications": {
      "Product Dimensions": "9.4 x 3.5 x 2.4 inches",
      "Item Weight": "0.64 ounces",
      "Manufacturer": "MelonBoat",
      "ASIN": "B075WL9JJ8",
      "Customer Reviews": "4.4 out of 5 stars89 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#72,719 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 24, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Glass Markers & Charms",
      "Bar Tools",
      "Bar Tools & Drinkware",
      "Dining & Entertaining",
      "Kitchen & Dining"
    ],
    "price": 8.99
  }
}