{
  "website_summaries": [
    {
      "verdict": "A gentle formula that provides serious relief, especially to short-haired dogs. And it smells great to boot.",
      "pros": [
        "A natural spray that soothes itchy skin with oat proteins and aloe vera",
        "Clears up hot spots and helps to moisturize dry skin",
        "This light formula comes in a bottle with a spray mechanism gentle enough that it doesn't startle dogs when applied",
        "Great-smelling formula"
      ],
      "cons": [
        "This is not as effective on longer-haired dogs, because long fur may get in the way of application"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "We are very pleased!",
      "text": "Our dog is a foot licker, and nothing really seemed to stop that. But once I spray this product on his feet, that's the end of the foot licking. If he goes outside, I have to reapply, but that makes sense to me. The scent is very pleasant, and the product works! We are very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "L. T. Barr",
      "helpful_votes": 65,
      "publication_date": 20180225
    },
    {
      "title": "Amazing customer service and product! Great for cats!",
      "text": "So at first I tried the spray alone, but then I got the shampoo to go with it. My goodness did this make a huge difference in my ragdolls fur! He is itch and scratch free and his fur looks great and healthy. I am extremely happy with the customer service! This is an amazing company and product and I will be purchasing future pet products from them! I'm still wowed by the customer service! Very happy customer here!",
      "rating": 5.0,
      "verified": true,
      "author": "Areeba",
      "helpful_votes": 55,
      "publication_date": 20180122
    },
    {
      "title": "It works!",
      "text": "I can't believe this works!! My kitty hates getting sprayed of course, but the spray has been helping her stop pulling her fur out. She's been doing it for months and we couldn't understand why, and now she's finally on her way to getting her beautiful coat back! ❤️ I wish it was available in a smaller bottle, because (hopefully) I won't get close to using it all, but I guess at least I'll have a lot to spare just in case. I also LOVE that they donate the whole profit to pets with cancer if you just take a couple extra easy steps once you get the bottle. Thank you Pets Are Kids Too! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna",
      "helpful_votes": 33,
      "publication_date": 20180329
    },
    {
      "title": "It works - and it smells fantastic!",
      "text": "I can't count how many items I've purchased for our pup that were a waste of good money. This definitely is not one of those! It is great...our pup loves it. It must feel good when we spray it on him - because he gets excited when he sees the bottle. And it smells wonderful. Definitely a great purchase and I plan to check out some of their other products as well. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Punsky",
      "helpful_votes": 33,
      "publication_date": 20180117
    },
    {
      "title": "Worked wonders for my labradoodle!",
      "text": "This product is AMAZING. I use this daily on my 7 month old labradoodle who was having serious itching problems, and almost ALL itching / licking has stopped! We couldn’t figure out the root cause of all of these itching problems, and did take him to the vet once but they told us he was too young to do any allergy testing and we could give him Benedryl to help until he was older. I didn’t particularly want to give that to him daily, so I found this spray and some other supplements to give him and he is a different dog after only 1 week! Plus he smells SO good with this spray. 10/10 recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "ES",
      "helpful_votes": 35,
      "publication_date": 20181220
    },
    {
      "title": "she feels better",
      "text": "I was at my wits end, I had changed her food her treats, gave her people food which I am against, but for your furbabies you will go to lengths to make them feel better, and so I bought her your product, she was able to nap all afternoon without itching, it had gotten to the point of having to put her in the cone to keep her from making herself bleed, a shampoo with the same main ingredient oatmeal and baking soda. She is much better. Thank you so much. Just look at that little face wouldn't you do anything for her, I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Patterson.",
      "helpful_votes": 9,
      "publication_date": 20190123
    },
    {
      "title": "Smells like sugar cookies.",
      "text": "This product smells great like sugar cookies and is easy to apply. The seller is very friendly and reached out to me promptly about some concerns I had. For my doberman, he still had itchy skin which my vet recommended I add some omega 3 supplements to assist with his dry skin issues. I think this product is worth a try, but for my Dobie, he did still have some itchiness.",
      "rating": 3.0,
      "verified": true,
      "author": "Amira",
      "helpful_votes": 11,
      "publication_date": 20180406
    },
    {
      "title": "nothing seem to relieve my dog of itching till this spray",
      "text": "this spray works far better than anything I have tried for my dog who is allergic to something outside. in minutes itch is gone and I do not see him scratch most of day. pleasant scent too. gave 4 stars , as the bottle leaks at top when I try to use spray nob. so I pour some in my hands and rub it on him. great product tho",
      "rating": 4.0,
      "verified": true,
      "author": "doglover3",
      "helpful_votes": 10,
      "publication_date": 20180618
    },
    {
      "title": "Worked great!",
      "text": "My dog was having excessively dry skin where he was scabbing and his hair was falling out. The scabs were getting really bad and started bleeding. Before going to a vet, i wanted to try another remedy and saw this. I got the Shampoo and spray and started spraying him twice a day with a bath 1-2 times a week. I also added coconut oil to his food at least once a day. He showed results within a week getting better every day. His coat has fully healed and looks great now! Bonus points that he smells like an oatmeal cookie after!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew  Harnden",
      "helpful_votes": 4,
      "publication_date": 20200603
    },
    {
      "title": "This spray is incredible!!",
      "text": "Fantastic spray!! It works fantastic and smells incredible!! It works best when used in between shampoos and conditionings with the Pets Are Kids Too shampoo and conditioner and followed by a brushing. My poor boy has been suffering from skin allergies for months. Other sprays appeared to burn his already sensitive skin, and vet prescribed medicines left him lethargic and not at all himself. This spray is super gentle and all natural- there was no pain when I applied it- rather my pup was relieved to feel it. Anything that helps my boy feel better, uses all natural ingredients and loves pets enough to make a donation to help another pet with cancer is a keeper in my book!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Clark",
      "helpful_votes": 31,
      "publication_date": 20180312
    },
    {
      "title": "Great Product Great Motto Great Company Great Outcome",
      "text": "This is great stuff!! The smell is a bit much at first but it fades really fast and it smells like a baked good. Much better than the Vet’s Best we were using that did nothing but stink. Samson is so much more comfortable now and doesn’t need Benadryl. We don’t know what’s caused his itch but it’s better with the spray. This is a great company, to donate to actual sick pups, and Samson got to see the photo of “his” pup. We will be buying more of this company’s products.",
      "rating": 5.0,
      "verified": true,
      "author": "Sashmom",
      "helpful_votes": 32,
      "publication_date": 20180314
    },
    {
      "title": "Slippery on non-carpet areas!",
      "text": "I mean, it smells good for about 15 mins, like sugar cookies. But it is 100% non effective on my dogs for allergy itching. ALSO WARNING if you spray this on tile or wood floors, IT IS SLIPPERY!! My poor kids have slipped in the same spot that i have cleaned over and over again, even bleached the area, and it is still very slippery! Do not use while on tile or wood floors!",
      "rating": 1.0,
      "verified": true,
      "author": "S_Re",
      "helpful_votes": 5,
      "publication_date": 20190110
    },
    {
      "title": "My dog had a bad reaction",
      "text": "Well, it seemed to work very well with a lot of dogs from the reviews. Yet did NOT for my small mixed shi-tsu. He stopped itching for about an hour and then back to scratching. But after using on and off for a week in a half I washed him and noticed a STRONG smell of ammonia when lathered up. My dog also displayed black spots all over his belly and chest. Therefore I had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Sylvia",
      "helpful_votes": 3,
      "publication_date": 20190922
    },
    {
      "title": "So far it's working great",
      "text": "My 7 month old Lab, Big Sean, is a rambunctious fun loving boy that enjoys going into the yard and roll in the grass, which causes him to have an allergic reaction. I've tried expensive medications from the vet, but it lowers his immune system response. I have been looking for a healthy and safe alternative and I may have found it. I cut back on the medication and I'm trying out the Premium Pet Anti-Itch Deodorant Spray. It smells amazing and so far he has not been caught scratching. The real test will be this spring when the grass comes back. Will update then.",
      "rating": 5.0,
      "verified": true,
      "author": "Monique",
      "helpful_votes": 2,
      "publication_date": 20191114
    },
    {
      "title": "Best thing we have used!",
      "text": "Max suffers every summer from allergies and I have tried everything to no avail. This works great, smells fantastic and is all natural (which is MY favorite thing). Thank you again for a great product. You guys have saved his fur from being off him 😊. And best thing is that with a purchase y'all donate money for dogs with cancer. Lori and Max.",
      "rating": 5.0,
      "verified": true,
      "author": "lori costa",
      "helpful_votes": 5,
      "publication_date": 20180815
    },
    {
      "title": "Smells sooooooo good!",
      "text": "I have two miniature panthers (some call them black cats), and while only one had an issue with itching, I used this on both. Not only did it cure the itching issue, it made them smell really good. For the one that was itching - she was seen by her vet for this and I got the OK from them BEFORE using it. The same one that had an itching issue, is also a cancer survivor, so that this company helps pets with cancer was an extra bonus. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 3,
      "publication_date": 20190215
    },
    {
      "title": "Spray on, let dry, then brush.",
      "text": "We absolutely love the product. We took Tucker (Boykin Spaniel) outside yesterday to play in the rain and after he smelled like a baked good rather than a wet dog! We are also using the conditioner spray and its helping with his dry skin and is gentle enough on his skin to use nearly every day! We absolutely love the product and intend to swap over to this company for all our puppy cleaning needs (:",
      "rating": 5.0,
      "verified": true,
      "author": "RedBeast",
      "helpful_votes": 4,
      "publication_date": 20180820
    },
    {
      "title": "Didn't stop my dogs scratching",
      "text": "I wanted so badly for this to work and give my poor beagle a reprieve from the allergy itchiness, unfortunately it did not. I bought and immediately used both the shampoo and spray. He started scratching as soon as he was dried off. Have used the spray daily since and nothing. Still scratching. I have 3 stars instead of 1 because they donate to dogs with cancer. I hope that is true more than their product claimd",
      "rating": 3.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 3,
      "publication_date": 20190404
    },
    {
      "title": "Helps my little dog with her itching.",
      "text": "After giving my little long-haired chihuahua a new brand of flea medicine, she developed a constant itch. I have tried different topicals, but this is the only thing that gives her relief. It doesn't take much and it seems to last for 2-3 days each time I spray her. She resisted the spray at first, but now when she sees me with the spray bottle she just sits there and waits for me to spray her and rub it in. My wife doesn't care much for the smell, but I like it--it's a mild, and smells like a plant.",
      "rating": 5.0,
      "verified": true,
      "author": "Don S.",
      "helpful_votes": 2,
      "publication_date": 20190525
    },
    {
      "title": "Her itching is gone! Happy cat is back!",
      "text": "My cat Kali had small scabs around her ears and at the beginning of her tail which we were treating with Zyrtec and CBD oil. We decided to try your Pet Anti Itch Spray, the scabs are gone, she is fine and she even asks for it, and it smells fresh. She’s fine, it seems it’s a stress related allergy because we have recently moved. Five stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Gatunia",
      "helpful_votes": 4,
      "publication_date": 20181130
    },
    {
      "title": "Happy and Great Smelling Doggies!",
      "text": "It's been less than a week since I've been spraying my labs with this product prior to bedtime. Already I have noticed the difference. They smell better, they hardly scratch or lick themselves, and their coat is shiny and smoother. They don't mind when I spray them either. With other products, one of them would run away. I bought another bottle for my friend who owns a dog with similar problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Violet",
      "helpful_votes": 3,
      "publication_date": 20190212
    },
    {
      "title": "Worked for a day at most.",
      "text": "Unfortunately, this spray did not work with my french bulldog and I so badly wanted it to. It worked literally for a day and then he went back to licking his paws even more right after I sprayed it and let it dry. He's been on it for a few weeks now. Maybe this will work for others but not mine.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 3,
      "publication_date": 20190217
    },
    {
      "title": "PREMIUM PET ANTI-ITCH SPRAY SOOTHES MY DOGS PAWS 🐾",
      "text": "“PREMIUM ANT-ITCH SPRAY“ SOOTHES MY DOGS SKIN 🐾 BUT DOESN’T LAST LONGER. WHE GETS ITCHY PAWS 🐾 WHEN HE GETS ”WET IN THE RAIN 🌧 OR SNOW” ⛄️..., DO NOT KNOW WHY?..., ~> I GUESS HE HAS A VERY SENSITIVE SKIN. THE PRODUCT IS NOT BAD OR CHEAP SO FAR SO GOOD. I DO LIKE THE FRESH SMELL, SPECIFICALLY NOW THAT IT’S COLD 🥶 AND I DO NO 🛀 HIM OFTEN....., COLD OUT THERE FOR MY YORKIE/POODLE ”THEY DO NOT HAVE DOUBLE COATS” LIKE POMERANIAN, HUSKIES, CORGIS ETC., THANKS FOR POSTING MY REVIEW AMAZON MERRY CHRISTMAS 🎁🎄 AND A PROSPEROUS NEW YEAR 2020 !! THE ECONOMY IS BETTER THAN EVER!!! THANKS 🇺🇸 😊",
      "rating": 4.0,
      "verified": true,
      "author": "M.D.N/P🐾",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Two Stars",
      "text": "Doesn't seem to work on our lab's itching. Updated - while this product was not the one my pet needed, the company has been great to resolve this. For any needs that arise for my dog, I will check out this company first. I like that this small company helps pets with cancer. Kudos to them! This is why I changed my review from 2 stars to 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Gordon",
      "helpful_votes": 3,
      "publication_date": 20180627
    },
    {
      "title": "great smell",
      "text": "I'm not sure why my dog started itching. He doesn't have flees, so I assumed maybe dry skin because I didn't see anything too off with his behavior or his skin. I bought this product because of the reviews. I give it a two because I absolutely love the scent. This did not help my dog at all though or does the scent last long at all. The scratching doesn't cause enough concern to take him to the vet so I will just let him be and just use the rest of the product as a temporary doggie perfume.",
      "rating": 2.0,
      "verified": true,
      "author": "Diana Pena",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Works fine, smells good",
      "text": "I coulnd't find anything that said what the actual scent was, it is like bubble gum or cotton candy. It is a pretty light and very sweet scent. The scent does not last long at all. The dogs are getting used to being sprayed down and I give them a treat afterwards to try to make it a positive. I mostly wanted something to make my older dog and my boy dog that always smells like a foot smell better. It does ok at this and I think it also helps condition their skin and hair.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Excellent for problem skin",
      "text": "I am part of a licensed rescue.. I have had this poor shitzu for 3 weeks.. until I bought this product, nothing soothed his dry, itchy skin. He does not scratch nearly as much, the pink, irritated look is gone and he’s less flakey. The scent is very light and I love it! I spray him a couple of times a day and if I see breakthrough itching.. i’ll Spray directly on that spot. It seems to soothe the itching, immediately!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Sharp",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "This spray is a God send for my dog",
      "text": "I have a Jack Russell with chronic allergies. Her belly and inside of legs have horrible rashes. I have tried everything and spent a ton of money on vets. I was tired of nothing working. I stumbled onto this spray and have been using it for 3 days several times during the day. She is sleeping during the night and not dragging her belly on the floor. It looks like the sores are healing. I will never be without this.",
      "rating": 5.0,
      "verified": true,
      "author": "debbiec",
      "helpful_votes": 4,
      "publication_date": 20180419
    },
    {
      "title": "Dangerous when used over tile floors",
      "text": "Use on carpet/rug only! There must be a powdery substance left behind after spraying because my floor became dangerously slippery. I honestly don’t know if the product worked because my dog’s allergies were so bad that the vet gave us oral apoquel and nothing else was effective. Smells great though, and does make his fur feel conditioned. -edited for grammar errors-",
      "rating": 3.0,
      "verified": true,
      "author": "James Williams",
      "helpful_votes": 2,
      "publication_date": 20181214
    },
    {
      "title": "Customer Service out of the World!!!!!",
      "text": "Update to my first review. This has to be BEST customer service that I have ever received. The co-founder of the company sent me a hand written, yes hand written thank you by express mail with a freebie of their dog shampoo. I am totally impressed by that and will probably sue only their products for our two dogs in the future. Thank you so much!!! So far hasn't worked real great for my dog. He tries to lick it off as soon as I put it on. I haven't been able to keep it on there until it dries yet. So that could be a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "spidc",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Smells good",
      "text": "This works well. Dog gets pretty itchy at times, thought he might have got fleas somewhere but turned out just dry skin at times. He is out in the fields sometimes and may be getting into something that irritates his skin, so I tried this and it works great! His skin gets relief from whatever he got into and the itching stops. Use it in between baths to give him, and me, that relief ! Smells good too!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgans mom",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "OMG! OMG!",
      "text": "This stuff is a god send. In simple terms. It works. I have spent easily $100 on products that don't work when it comes to stopping the itching and licking. Most had cyan pepper or something to burn the mouth to deter. for fear it was like that. I put some on my tongue. No burn And With this. It soothes the itch. She automatically stops and relaxes because the itch is gone. I would give 10 stars if I could.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen G",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Great smell and really stops the itching !!",
      "text": "I have a 14-year-old cat with a skin condition and nothing would help this is keeping her from scratching. My other cat it was only 10-month-old also seems to scratch a lot and this has definitely reduced it! It also makes them smell great!",
      "rating": 5.0,
      "verified": true,
      "author": "catwoman",
      "helpful_votes": 5,
      "publication_date": 20180121
    },
    {
      "title": "This product does work!",
      "text": "This product really worked for our cat Alice. I have tried switching from one expensive cat food to another, changing to unscented kitty litter, to brushing her nightly to relieve her itching. Nothing seemed to work. I purchased this product and she was able to finally stop scratching and biting at herself. I do not spray it directly onto her coat. I spray my hands then pet her and this works fine. Finally relief for Alice. I will be purchasing this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 2,
      "publication_date": 20181031
    },
    {
      "title": "This Product Provides Great Relief for Itchy Feet and other Hot Spots",
      "text": "My dogs think this is a great product. We all love the vanilla scent. As soon as I spray this on my doggies, they sit back and breathe a sigh of relief. The Dental Product is also great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181026
    },
    {
      "title": "Can’t wait to show pictures of my beautiful Thai with his beautiful coat growing back",
      "text": "I have to say I have been only using this product on my dog Thai for a little bit I can honestly say this product is helping! He honestly has not been itching as much I have to admit. My Thai is my 💕and to see him have the itchies is just heartbreaking. I am finally hopeful and going to order another bottle and the shampoo! Can’t wait to show pictures of my beautiful Thai with his beautiful coat growing back. I will follow up in a couple of weeks to update everyone! I wish you guys would Make some kind of thicker ointment to add to your collection!",
      "rating": 4.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 2,
      "publication_date": 20180530
    },
    {
      "title": "Slept like a puppy",
      "text": "It worked. That's the main thing. At night, when our Bichon itches, I reach for the spray and she's able to fall back to sleep. I personally don't like products that smell like food, except food. So the scent was tolerable, didn't seem to entice our dog so that's good. We watch her like a hawk so she doesn't have a chance to lick it off. It lulled her to sleep, that's what I wanted.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Please make WIPES",
      "text": "I have a cat that the vet thinks is allergic to flea bits. Even with flea control he still scratches while the other cat doesn't. So I bought the spray which does help a lot, he slows down on the scratching. The problem is he thinks I'm punishing him with the spray. I trained them with spray water bottles so any spray is not a good idea. WIPES would be IDEAL. For now I'll just spray a paper towel and apply the paper towel. I'm just losing some of the product that way, quite a bit actually. I may try the shampoo even though I've never used shampoos on them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Works great and instantly on hot spots!!",
      "text": "Our little Shelby likes to scratch at her lower back until it's red and raw. We keep a dress on her to prevent scratching but she always finds a way. This stops the itching instantly without causing any display of burning discomfort and has a very pleasant smell. Also used it for a spot at the base of my 7 month old Bruno's tail (Pekingese) and the scabbing is almost gone and he isn't trying to chew there anymore after only 3 applications!!",
      "rating": 5.0,
      "verified": true,
      "author": "debidog",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Smells amazing, but leaves an oil-like film behind on any surface it is sprayed on...",
      "text": "I sprayed this on my dog on my wood floor, and immediately after almost slipped on the same spot. The slickness lasted for days and I realized if I wanted to use this, I needed to spray her outside or something so I wouldn't slip on my back in my own house. The scent is great; it definitely does make your dog smell like an oatmeal cookie.",
      "rating": 4.0,
      "verified": true,
      "author": "Black Pierrot",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "It works!",
      "text": "I have 4 for babies that have skin conditions and were constantly biting or scratching their behinds;it has ended after spraying this on them one time! This is truly a miracle product and I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Scott",
      "helpful_votes": 3,
      "publication_date": 20180516
    },
    {
      "title": "It helps the itchies",
      "text": "New puppy had chewed on himself, so when I got him he had many bald spots, scabby and raw spots. This is really helping him. The pound said they were hotspots — I’ve been treating them as allergies and he is much better, and this has provided immediate relief to his worst spots. It also helps his less itchy brother. And the smell is pleasant and doesn’t make me sneeze. Neither dog has new spots and the raw scaby areas are healing up nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Meche in Okla",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Deceiving Advertising/Doesn’t work",
      "text": "Advertising is deceiving. Shows three bottles but is only one included and it is the smallest of the three. It says quantity 1 but it appears like it’s one pack of three based upon photos There is not an option to choose a size, so there is no reason someone would think the price is for one bottle and the smallest size. In addition, the spray function on the bottle doesn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Buy it!",
      "text": "For the longest time I've been looking for a great quality shampoo, and when I found this product and read the amazing reviews I knew this brand was just what I was looking for. And since I saw that most people also bought the spray I decided to order it as well. My furry baby and I couldn't be happier, it smells AMAZING and it works great for in between showers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Escobedo",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Did Not Help At All!",
      "text": "My dog has been licking his paws for quite some time. I've tried several products and so far nothing has worked. This was no exception. Good thing? It smells AMAZING! It just did not work at all and I will be out shopping again for something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Kerri",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "I love that this product is all natural and makes me ...",
      "text": "I love that this product is all natural and makes me feel safe to use on my pup! He gets dry itchy skin and this stuff helps relieve the itch! It smells so good too! I spray this on his coat after he comes in from playing outside to freshen up that dog smell! Lol I love that we are helping a dog with cancer in the process too! What a great company to make put here from!",
      "rating": 5.0,
      "verified": true,
      "author": "Lala",
      "helpful_votes": 2,
      "publication_date": 20180325
    },
    {
      "title": "Works For Blue ,The Catahoula Leopard Dog!",
      "text": "So far so good on this anti itch spray. My dog, Blue has terribly dry skin so I purchased this hoping it will help him and give him relief. It definitely decreased his itchy skin. Less scratching from him. It also has a pleasant scent, makes the fur soft. I will order again as long as it keeps working.",
      "rating": 4.0,
      "verified": true,
      "author": "BMac",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Smells good!",
      "text": "I received this yesterday & it smells yummy!! Our 1 year old lab has extremely dry skin. She was scared to death when I sprayed her with it, but I did notice she did not scratch and rub her back on the carpet last night. I hope she eventually gets over the fear of the spray bottle. This item is on autoship for our home.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah from Oklahoma",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Smells great and works!",
      "text": "I use on Pinkie (black dog with one eye) I adopted her from a shelter with very bad mange. She still has an area on her back that is missing hair. I have been spraying it on that area and its helping. She hates water and has had such a rough life I wont bathe her. This smells fantastic so it helps with that too. The other dog is Charlee and I spray it on her just because it smells so good. Fantastic product!",
      "rating": 5.0,
      "verified": true,
      "author": "Penny L.",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Love, Love, Love this product (and do does Miss Bella)!!!!",
      "text": "I absolutely am in love with the smell of this product and in love with how Miss Bella responds to it. She has allergies, which cause severe itching. Once this is on her, the scratching stops and she can concentrate on being cute again! I also purchased the oatmeal shampoo, but have not used it yet, but it smells like a fresh baked oatmeal cookie!!",
      "rating": 5.0,
      "verified": true,
      "author": "tmy14",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Combined with the Shampoo he smells likes cookies for a ...",
      "text": "Combined with the Shampoo he smells likes cookies for a short while and he scratches and bites a lot less. We have a poodle terrier mix thats slightly greasy and stinky, with a thin coat, this really helps him.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 3,
      "publication_date": 20180516
    },
    {
      "title": "My Frenchie got rashes",
      "text": "This product seemed so promising. The scent is amazing. Two issues- 1. the spray top leaks a lot of the product out. 2. I sprayed my Frenchie in the areas where she itches the most and she ended up developing severe red rashes in those areas after a couple days of using. I returned the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great product from a caring company team!",
      "text": "Love this product!!!! My recently adopted 10 year old Shih Tzu, Sophie was absolutely miserable from itching even after taking a round of prednisone and antibiotics prescribed by her Vet. After using this product twice a day for several days, the itching began to subside and she is now about 95% itch free plus the bonus that she has a fresh smell! I now have the shampoo which I can't wait to try! What a blessing this product is!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Works for itchy dogs.",
      "text": "This spray works really well, smells nice and easy to apply... And it's non-toxic which is great too! The only reason for four stars is because of the price. I will, however, purchase it again if I need to. I've tried other anti-itch sprays but this one was the best.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Anti Itch Spray works!",
      "text": "This spray soothes my dog's itchy irritated skin, and smells nice, too. We keep it at the back door for whenever he comes back from his back yard adventures!",
      "rating": 5.0,
      "verified": true,
      "author": "S.E. Smith",
      "helpful_votes": 2,
      "publication_date": 20190323
    },
    {
      "title": "Your pet's coat will be softer",
      "text": "I have two feline kids that had issues with overgrooming and nervous scratching. My girl had constant scabs and sores. My boy was developing bald spots by his tail. I've been using this product for a week daily. Their coat is already so soft and I've noticed them scratching less. The bonus is that your pet will smell good. Anyone with a cat knows how much they hate anything that you put on them. Mine seem to tolerate be misted, I think it helps that it smells like food.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy A. James",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "You won’t be disappointed!",
      "text": "This is the 2nd time I’ve used this brand.. the spray actually does help with itchy spots on my yorkie.. it smells so good! You’d be surprised at your pets skin under their fur.. sometimes you don’t even notice an irritating rash or dry patch , but if you take the time to check all over , you’ll want to spray those spots with this stuff! It makes a huge difference and who doesn’t want a happy , itch free , great smelling pet ??",
      "rating": 5.0,
      "verified": true,
      "author": "M B",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Smells nice.",
      "text": "With so many great reviews, I had high hopes that my Lucky would finally get some relief. I tried multiple times. Nope... it didn’t help at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 3,
      "publication_date": 20181017
    },
    {
      "title": "Works wonders",
      "text": "Have tried so many product for my 12 years old Cocker spaniels dry itchy skin and nothing worked until I bought this product !! Side note: when spraying on your dog make sure you have a towel underneath . I sprayed it on my dog over our wood floors and it made the floor very very slippery and was hard to get off my floor",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn Lund",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Relief for Rusty",
      "text": "Rusty was scratching almost constant. No sign of fleas, ticks, or lice. I have tried many things to help him. While I cannot give a full response as I just received this spray today. But I sprayed him with it, and so far it seems to be working great.",
      "rating": 5.0,
      "verified": true,
      "author": "Alma Markham",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "UPDATE TO PREVIOUS REVIEW...",
      "text": "UPDATED REVIEW, 11-26-19: My faith in good customer service has been restored by Pets Are Kids Too. I received a severely damaged bottle of one of the sprays in early November. Being that it was a gift, I complained directly to PAKT (not expecting a replacement). Within a week or so, I received a replacement bottle of the spray, PLUS a free bottle of another spray, along with a hand-written letter of apology from the owners. I will order more in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Brown",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Not Applied Easily to Hairy Dogs",
      "text": "Smell is pleasant and not too strong, which I like. I have an exceptionally hairy dog. It’s very hard to get the spray down to her skin so I have to really part her hair and rub it in. It works at first, but wears off quickly. It’s such a pain to apply that I only do it once a day.",
      "rating": 2.0,
      "verified": true,
      "author": "JaimeTop Contributor: Calligraphy",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great product & customer service.",
      "text": "My dog Razz has always been prone to itchy skin and we've bought TONS of products over the 7 years to remedy the situation between groomings. Normally, she runs away from the bottle- with this spray she sits still and lets me put it all over, which leads me to believe it is instantly soothing to her. Her itching has almost completely stopped! The customer service is also very attentive and reached out to make sure I was happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Owens",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Really works!",
      "text": "I used this immediately on my 2 small dogs who have been rather itchy lately. It smells nice - kind of like vanilla cream. I love that if they lick it, it won't hurt them. I did notice that they didn't lick after I sprayed them. And it does seem to moisturize the area which is wonderful as well. So relieved to find a solution for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Pandalu",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Frenchie loves it!",
      "text": "My Frenchie has bad environmental allergies and dry spots under his front legs. His skin gets really dry and smelly. This spray is really helping him with the itching and the odor. He was running from me at first, but now he likes it and let’s me spray his skin!",
      "rating": 5.0,
      "verified": true,
      "author": "Katharine Beaird",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "yummy scent",
      "text": "easy to use once the puppies are still and they must like it too since want to lick it and sniff off of each other but have noticed once in a while with too frequent use, fur fallout/shedding increases. maybe just our puppies - one has more sensitive skin than the other",
      "rating": 4.0,
      "verified": true,
      "author": "TOM",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "A Lifesaver!",
      "text": "My dog has dry itchy skin to the point where she will rip her own hair out, I just got this today and before it was delivered she was chewing and rubbing against everything to take care of that itch. As soon as I sprayed her with it, she seemed relieved and hasn’t been bothered by her dry skin.",
      "rating": 5.0,
      "verified": true,
      "author": "CD",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Worthless",
      "text": "It doesn't work at all. May as well spray your pet with water. I tried their Ear Cleaner solution and that was a fail too. Don't bother with any of Pets are Kids Too products.",
      "rating": 1.0,
      "verified": true,
      "author": "MichelleMG9",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Probably not worth the money",
      "text": "I haven't noticed this helping with my dogs itchiness at all. I had been hopeful that it would help but it didn't. The smell isn't good at first but after it dries, it smells pretty good. The smell does not last even a day so it requires frequent application. My dogs dont mind it when I mist them. And they dont sneeze afterwards.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "It smells amazing and has a really good spray to it",
      "text": "It smells amazing and has a really good spray to it, covers a lot in a single spray. I’m feel fairly confident that it helps. I do feel she has been scratching herself less since I started spraying her with it. So I’m happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "Smells great & seems to help",
      "text": "The scent was amazing, as other reviewers all said. The big problem for me is that my rescue dog totally FREAKED when I tried to spray her with the anti-itch spray. I even tried treats, but that wasn’t enough. (I think someone must have very harshly trained—or tortured—her with a spray bottle at one time). So now I have to spray it on my fingers and rub it in to the hot spots. But I must say, it still seems to help.",
      "rating": 4.0,
      "verified": true,
      "author": "Siouxie B.",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "No residue!!!!!! Amazing scent!!!",
      "text": "I didn't rate for flavor because i don't believe this is for consumption.. Great products. Great company. I stumbled across their breath spray and had unbelievable results so i Had to try this. Stopped our boys itching! No weird film or residue left on coats after spraying my dogs!!!!! Nice clean light fresh feel and scent 10/10 will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "aim",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Great stuff for skin allergies!",
      "text": "This has worked really well on our Boston terriers belly and under his arms. He has bad skin allergies and is always red and itchy. We have tried many things and meds but this works the best and smells good and also doesn’t bother him like another brand did. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Patten",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great Product - Very Effective and Smells Great!",
      "text": "My Scottie had an itching issue. I did a little research and found this spray. It takes a little persuasion to get him sprayed but it works. A day later he is no longer itching and he smells amazing! If he could talk he would tell you he loves it. (other than the spraying business)",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Dowling",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Recommended Product",
      "text": "Have a few itchy female kitties this summer. Not sure why. The vet suggested some seasonal allergy. So I wanted to try this product to see if it could help. I just started using it but it does seem to be helping. Fast service, reasonable price, and smells wonderful. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "nmsunny",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Calming and coat smells and feels great!",
      "text": "Our Shitzu, Pop's, loves the shampoo and anti-itch spray. He has sensitive skin and is constantly licking at his paws. Both products calm is skin and make him so much more comfortable. His coat smells and feels great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Prescott",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Good Product!",
      "text": "It has helped soothe the leisure on our dog's skin and improve her coat texture. The scent is subtle and very pleasant, not overpowering or too strong to where I would be concerned it will only irritate her skin.",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Love the smell!",
      "text": "The smell is amazing and my dog feels so clean after his bath I’m not sure if it really helps with the itch because he’s on other medicine for allergies but it’s a great product",
      "rating": 5.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "So far so good!",
      "text": "Our dog has been licking his paws incessantly lately. We've been using it for about a week and it seems to be helping his foot fetish LOL! It could be because he hates spray bottles, so he flees when he sees me approaching with it. But either way, it makes him stop. Love the smell of this too! Great to spray on him to \"freshen\" him up between baths.",
      "rating": 5.0,
      "verified": true,
      "author": "LittleGemGirl",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "My dog is even more itchy!!",
      "text": "I bought this based on all the great reviews but it’s not helping my dog at all. I give two stars because he smells better but the lack of three stars are based on it making him itch more. Unfortunately, I now have to take him to get a bath because of how bad he’s itchig and I can no longer use the product. For me it was a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "victoria",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "It works and it smells good",
      "text": "My German Shepherd was suffering from dry skin following his afternoon swim during the hot Summer months. I used this product for 2 weeks and it helped him stop scratching within 3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Leaves my puppy happier and smelling good !  Also, leaves me happier !",
      "text": "Product is easy to use. My pup is hyperactive, as a lot of Aussies are . He gets so excited when he is handled that it is hard to groom him or apply products (hopefully he will chill out with age). I just spray this product on him and after a minute or two, he seems to get relief from his itching and he smells way better (he rolls in everthing outside, which leaves him stinkin' ! After a treatment with PREMIUM ANTI ITCH DEODORANT SPRAY he gets relief, as do I because he smells better, which allows me to give my pup some love).",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Very bad allergic reaction on both dogs!",
      "text": "I would brevets buy this product again! Very bad allergic reaction on both our dogs! Horrible, that I had to take them to vet and get some shots and pills. Also it cost me $600. :( Bad mistake! People never spray anything on your dogs, even if it says all natural ingredients! That’s what our vet told us. Also choose pet shampoo with extra care!",
      "rating": 1.0,
      "verified": true,
      "author": "Irina Malik",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Not worth the price in my opinion 😔",
      "text": "Smells great but didn't stop the itching or relieve it on any of my 4 pets, 2 small dogs 2 DSH cats, watched the video and I used as directed, but not happy for the price, I do love the shampoo but the spray is nearly ineffective except for getting pets wet and smell good...",
      "rating": 2.0,
      "verified": true,
      "author": "Rachelle Valdez",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Smells yummy!",
      "text": "Harper was recently rescued from a puppy mill, where she did not receive good care. Her skin was itchy and smelly. This spray has really calmed down her itchiness and it helps all of my dogs with their \"smelliness\" between baths.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "would buy again",
      "text": "My Boston mix is allergic to grass. She takes a claritin in the mornings, a benadryl at night, hydrocortisone as needed, and oatmeal baths. After all this, she still itches. My vet is against steroid shots as she is still a baby. I found this spray and decided to give it a shot. It helps really good, but seems to wear off fairly quick. I would buy it again though since it did give my baby some relief.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheryl ",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Works and Smells Great!!",
      "text": "Our dog loves this stuff and we got a free bottle when we sent a picture. We use it in conjunction with their matching shampoo. Our dog is getting to be a old lady and was scratching a lot. This spray helps her out almost immediately when we notice her scratching more than usual and it smells great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Seems to be working",
      "text": "I just got it but it came on time. It seems to have calmed down some of the itch on my fur baby. But will comment again after more time. Pleasant scent. Not over powering",
      "rating": 5.0,
      "verified": true,
      "author": "Diane McMichael",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "A+++ Customer Service!!!",
      "text": "Great company, amazing people, good cause, product smells good and my cats fur looks nice. Hasn't helped much with the licking but nothing else has in the past ten years either. Customer service has been outstanding, people are very quick to reply, extremely polite and helpful and eager to help you and your pet. Thanks Chad!",
      "rating": 5.0,
      "verified": true,
      "author": "Zachery Lee",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Great spray to get the pup to stop scratching so much!",
      "text": "I wasn’t sure this would work for pup but with weather changing and I sprayed it on her due to the constant scratching and it worked rather well. I was very surprised and pleased with this product. Whenever she begins scratching a lot I spray this and she definitely slows down on the scratching. It also smells fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "n.haynes",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "BUY IT",
      "text": "I cannot believe how well this product works. My Frenchie has a lot of skin issues and irritations. This stuff smells AMAZING and really helps his itchy, red skin. The only thing I can say is that I won't buy the spray next time because the noise of the spray scares him. Otherwise, it's really truly a miracle product.",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "GREAT PRODUCT",
      "text": "My Basset hound loves this! I really can't say if it does much for itching but it keeps him smelling less doggish between baths! He actually will stay still while I apply it.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Pruden",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Great Product!",
      "text": "My cat has seasonal allergies that cause her ears to get itchy bumps on them. They were so bad that she was getting scabs from scratching. The spray seems to have soothed her ears fairly quickly. They are not as inflamed and bumpy and apparently are not as itchy either. She has not been scratching and her scabs have almost healed. She must like the way the spray makes her ears feel because she lets me rub it on her ears without protest, which is pretty surprising. Also, it makes her smell like a cookie, which is a bonus. :)",
      "rating": 5.0,
      "verified": true,
      "author": "lindsay",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Easy to use and works.",
      "text": "Our dog was continually scratching and we had tried antihistamines to no avail. This product works , our little baby is not scratching Herself to death. It took at least two baths before the scratching calmed down.",
      "rating": 5.0,
      "verified": true,
      "author": "barnard wilson",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Stopped itch",
      "text": "We have boxers with skin issues and this helped a lot.Very pleasant scent and does not build up on coat.This really helped with their seasonal itchy paws.",
      "rating": 5.0,
      "verified": true,
      "author": "susan gauthier",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Oh, smells like vanilla cookies !",
      "text": "My dog grooms herself constantly. I tried this and now she smells like sugar cookies instead of dog spit and wet fur ! She seems to be itching less too. Thank you for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Amazing company",
      "text": "This stuff smells like birthday cake! My little dog gets so itchy so this stuff does the trick! Plus the company is beyond caring and helpful",
      "rating": 5.0,
      "verified": true,
      "author": "Pixie ",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great product good value on the customer service from this place rocks",
      "text": "when absolutely love this stuff we live in Texas where it's hot and I have an old 18 year old dog with cancer when we come in from our walk we use this to cooling down to clean him up and he loves it so much that doesn't irritate his skin and it makes him very comfortable in this Texas Heat",
      "rating": 5.0,
      "verified": true,
      "author": "Jt",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Nothing else worked! Great product!",
      "text": "Our dog could not stop scratching. She scratched everywhere: her ears, her legs, her body. She was losing patches of hair from scratching so much. We tried everything, allergy pills, fish oil, medicated shampoo, and diet. Nothing seemed to work. After reading the reviews we decided to try the anti itch spray. It was a miracle! It works great and gives our dog instant relief. Whenever she starts scratching, we bring out the spray and she stops to let us spray her. She loves it and it helps her so much. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin O",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Actually works!  AND smells like vanilla and oatmeal cookies!",
      "text": "Dang, this stuff IS really good! Smells like vanilla and oatmeal. (Am oatmeal cookie is the perfect way of describing it). Best yet, it seems to work too! My pooch is a happy little cookie smelling soft skinned wonder right now.",
      "rating": 5.0,
      "verified": true,
      "author": "ID",
      "helpful_votes": 0,
      "publication_date": 20190319
    }
  ],
  "product_meta": {
    "title": "Premium Pet Anti Itch Spray & Scent Freshener! Natural ingredients & Hypoallergenic! Soothes Dogs & Cats Hot Spots, Itchy, Dry, Irritated Skin! Reduces Odor, Allergy Relief! Smells Amazing! (1 bottle)",
    "rating": 4.2,
    "feature_bullets": [
      "“WORKED INSTANTLY!” ON THE SPOT ITCH RELIEF. Our customers say our spray quickly goes to work, conditioning and freshening their fur baby’s coat to a soft, shiny, healthy sheen, all while reducing itching and irritation with NATURAL healthy ingredients",
      "EASY & FAST: Simply point, spray and watch as the oatmeal cookie scent transforms your pup into a comfortable, itch free, happy ball of love who smells great! BUTT SCOOT MUCH? Poor Pooch! Pets Are Kids Too's Dog Anti-Itch Oatmeal Baking Soda Spray STOPs suffering, insatiable irritation, and that obsessive chewing, biting and scratching that drives you nuts. POWERFUL RELIEF for SKIN AILMENTS: SOOTHES itching, hot spots, flea bites, and allergies!",
      "YOUR PET WILL SMELL AMAZING - In between baths, our dog and cat anti-itch spray is the single best way to help your pet smell their best! In fact, since they'll smell like a delicious oatmeal cookie, it'll be hard to stop sniffing them yourself!",
      "GIVE IT A LICK! MADE WITH NATURAL INGREDIENTS, PURE BOTANICAL PLANTS & VITAMINS: Do you have a fear of spraying something on your pets skin that they could lick? We understand! Safe to ingest, and cuddle friendly, our plant based spray leverages the power of Oat Proteins and Wheat to moisturize. Baking Soda rapidly soothes while eliminating odors. EXTRA MILE: We even add Vitamins A, D & E because they promote ANTI-BACTERIAL, ANTI-INFLAMMATORY and MOISTURIZING qualities!",
      "HELP SAVE A PET WITH CANCER & SEE THE PET YOU HELPED - After your bottle arrives, you'll be given the option to send in a pic of your pet :) When you do, we’ll donate a portion of the profits to a pet with cancer & reply with a pic of the pet you and your pet helped - we call it \"pets helping pets\" :) We believe that “Pets Are Kids Too” and our mission is to help save 200 pets with cancer by 2022! 100% Made in the USA and cruelty free!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.91 x 1.85 x 1.65 inches; 9.84 Ounces",
      "Date First Available": "September 16, 2016",
      "Manufacturer": "Pets Are Kids Too",
      "ASIN": "B075RH3NXS",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Supplies",
      "Itch Remedies",
      "Pet Supplies",
      "Cats"
    ],
    "price": 16.99
  }
}