{
  "website_summaries": [
    {
      "verdict": "A durable, well-made case that will extend the life of your battery and keep your iPhone safe.",
      "pros": [
        "We loved that this case not only charged our phone, but provided extra durable protection too",
        "The case will hold a charge for 2-3 days and is compatible with wireless charging mats as well",
        "Compared to similar cases this was one of the less bulky",
        "Access to the power and volume buttons is covered for protection, but we found the buttons were still easy to press"
      ],
      "cons": [
        "The case blocks the headphone jack you will need  Bluetooth headphones"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "So far, it’s working great",
      "text": "I purchased this battery case to replace my Mophie case, which turned out to be a huge disappointment. The Mophie case would only charge my phone 40% before it completely drained out. This case looks very similar and also charges wirelessly on the Mophie chargers. I tested this case with my phone, and it charged my phone the same 40%, but without even going down one bar. I tested it again and it recharged my phone another 40% and only went down one bar the second time. 80% recharge total, and the case only lost one bar of power. I think this one’s a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamullane",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Love it and have gifted it multiple times",
      "text": "I’ve bought this case 3 times, not because I’ve broken mine that many times or that it doesn’t last but because I’ve gifted 2 of them after loving my case. Some of the thinner pieces do wear down and break off but nothing major. I did break one of these cases after almost 2 years of use. I dropped my phone at work and the case broke along the bottom seem, phone is perfectly fine. I’m someone who drops my phone a lot and it took that long to break the case. My only real complaint is the top is sometimes hard to remove and that can lead to some of the wear, causing the thinner parts to break.",
      "rating": 5.0,
      "verified": true,
      "author": "crystal cote kennedy",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Good case with decent battery life. But fragile.",
      "text": "It works well as a battery with Qi charging, and is a decent case. I'm on my second one as the first one broke off near the power switch. I tend to 'baby' my phone. I don't drop it, or even set it down harshly. But both phones have the same broken piece of plastic. The exposed broken piece catches on everything, which makes it break even further. It's a shame that such a silly little design flaw exists on an otherwise nice product.",
      "rating": 3.0,
      "verified": true,
      "author": "Russell",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Seems like a good idea until a month later...",
      "text": "I really wanted to like this case. However, even after getting a replacement it never worked correctly. The case is very heavy and would never connect to my computer. I would have to take my iPhone out of the case to sync. The iPhone would charge wirelessly but the case did not?!?!? Instead Inhad to charge the case with a USB cable. The case also cracked and was not sturdy. Additionally, this was a replacement from the first one that did not work. I do not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "RicoMcKee",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Great Case",
      "text": "This is a great case, keeps my phone charged. Will charge my iPhone 8 Plus from 20% to 100% and leave about 10-20% remaining on the case. Case is a little heavy but I like the extra heft to it. Keeps phone well protected as I have dropped it a few times with no damage to the phone even after leaving the phone on the bed cover of my truck and having to locate the phone on the side of the road. Few cracks in the case be phone was fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Clevenger",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "One of those rare products that is what it claims to be. Love it!",
      "text": "I carefully did my homework before purchasing this item. I needed to be able to recharge my phones on the run because I will spend as much as 6-8 hours on my phone doing data entry, and using my GPS. I compared it to several other available options and found this to be by far the best fit for my needs. I can recharge my iPhone 8+ as many as 2-3 times from this case. Very satisfied with the product, and customer service. I have since my 1st purchase ordered 2 more for employees.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark McNutt",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Didn't charge!  I believe there is a problem with compatibility with my charge stand.",
      "text": "I really like the case but I believe I have a compatibility issue with the charge stand I purchased from Amazon as the case works on my wife's flat charger (mine is angled up, see photo). Wireless charging demands correct positioning. I like my nightstand (ZIKU Wireless Charger.6 in 1) and will use my best judgement in ordering a different and more compatible charging Iphone case. Thank you Amazon for helping me with my issue. Dan",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Y.",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Good Value but top piece tends to break. Great battery life and OK protection.",
      "text": "This is a very functional case, and the price is way better than some competitive brands. Unfortunately I've had this for about a year, and the top clip seems pretty easy to break compared to other cases I've owned. The good news is that the piece is available for replacement for $1.99 on the manufacture's website, so I would still recommend the case. If you are physically hard on cases or a dropper, then maybe look further.",
      "rating": 3.0,
      "verified": true,
      "author": "Happy Father",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Maybe I got a lemon 🍋 🤔",
      "text": "Arrived in good condition except didn't work. Sometimes it would work but battery life was just ok, probably wouldn't make it through the day if your a heavy user like me. It would charge for 10 min then stop or sometimes it would charge for an hour, it was pot luck. Update: Customer service is fantastic and offered me a replacement for my troubles, I'm updating my review and because of that I would definitely recommend it!! They stand by their products!!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Toscano",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "OK, but...",
      "text": "Still breaking it in. I would say it takes a bit longer to charge the case than expected but not to a problematic degree. I purchased it because it is the only battery case I could find that charges wirelessly and allows the new iPhones to charge wirelessly with the case in place. I have noticed, however, that the charge to the iPhone drops frequently, causing obnoxious beeps, when in the case. Finally, for some reason, the only colors available are black and blue. My iPhone is gold, so it doesn’t really go well with it.",
      "rating": 4.0,
      "verified": true,
      "author": "DJBIL",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Wireless Charging is so much easier",
      "text": "Just got the case last week as I was looking for a wireless charger battery case for my iPhone 7plus. The battery cases I was using before weren’t charging properly as it felt like the charging cable port was too loose. Though going with a wireless charger would do the trick. So far it’s pretty simple to just place my phone on a wireless charging pad at night and wake up in the morning with a full battery case and phone ready for the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Bentley",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Wireless charging case perfect for busy job that involves a lot of travel!",
      "text": "Just received this--the product is well-packaged, and has solid construction. I've just installed and all looks well. I will add to this review over time--and I can confirm that the wireless charging works! I paid twice as much for a \"well known name\" charging case for my last iPhone, and am pleased with a more affordable option. Thank you Alpatronix!",
      "rating": 5.0,
      "verified": true,
      "author": "anonymama",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Case falls apart, but charge is as advertised",
      "text": "I’ve had the case a little over 2 months now and I’m already all the side buttons are broken. With the missing parts aside the battery and charging functions are still functioning as well as the first day I bought it. When I got this case I was amaze how well it fits on the IPHONE 8Plus. I can prolly almost get to 1 1/2 charges from dead with this thing. What I also love is the wireless charging which will charge both the phone and the case simultaneously. It’s a good product for light use. I’m going to reach out to utilize the 2 year warranty. We’ll see how the service is.",
      "rating": 3.0,
      "verified": true,
      "author": "Carolina",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Liked it for a day ...",
      "text": "Well I DID like this case. For a day. It charged my phone wonderfully yesterday. I charged it overnight and once my phone battery ran down today I went to charge my phone with the case and....nothing. It shows that it’s completely charged. But it won’t transfer any of that to my phone. I have an email to customer service but they replied with an auto reply that they won’t help me until Monday. So we’ll see.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer ",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great power back up and phone protection",
      "text": "This case provides you with a power back up for your IPhone. Case is made out of durable attractive material and not bulky like some other products. This provides superior protection for your Phone.Charges quickly when the case is engaged. Case fits phone perfectly but I had difficulty removing the phone from the case. Also, it has the option to charge wirelessl in addition to a wired charging connection, cord provided . I have taken this on long walks and bike rides with piece of mind that I will have power to my phone for a long period of time.",
      "rating": 4.0,
      "verified": true,
      "author": "Mdonahoe2",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Awesome!",
      "text": "Solid feeling case and I like the rubberized feeling of it can’t wait to really put it through the test. Also the packaging looks really professional unlike other case companies that just throw their stuff in a clear bag and send it UPDATE REVIEW after having for two months the case stopped working properly and hardly ever works contacted the “warranty” email and have heard nothing almost a week",
      "rating": 1.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Great for travel",
      "text": "No longer use as I upgraded phone. But it was great. A little bulky but the battery life was worth it. Maybe better for traveling than day to day use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Alpatronix / Quality craftsmanship, with products that perform as described!!",
      "text": "The iPhone 8 Plus / 7 Plus Battery Case that Qi Wireless Charging Compatible from Alpatronix si a BX190plus 5.5-inch 5000mAh Rechargeable Protective Portable Charger for iPhone 8+/7+ [Apple Certified Chip] - Black]] is Quality made and performs as described. Combined with the CX101 10 watt Qi Wireless Charging pad is an upgrade for your iPhone 7 plus, w/o the expense of purchasing an iPhone X. Enjoy",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Duncan",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Great case",
      "text": "The screen protector it comes with.....sucks. But I hate having to apply those type of screen protectors probably because I suck at applying them. I’m used to the built in protector with the Otterboxes. But other than that......this is a great product. Battery lasts a great deal now and it works great with my wireless charging pad. I’d give it 5 stars if it wasn’t for the screen protector. Nonetheless I’ve had it for a couple of months now and overall I’m extremely pleased with this purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie S.",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Makes my battery last all day!",
      "text": "I am a heavy user of my cellphone and I never want to be out of battery. This battery case will keep my phone charged all day. The case is thin enough so it doesn't feel too big and bulky. I don't know how well it protects the phone if I drop it, but it seems to be a good case and made well. I like the products from Alpatronix and the warranty. We had their charger cases for our old phones, so when we got new phones, I wanted to buy from them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Battery Case Won't Keep Charging - Shuts Off After 30 Seconds",
      "text": "I ordered this case as an alternative to the more-expensive Mophie case I've used reliably for years. It refused to stay on even when fully charged, so I returned it and got a second. Customer service was very responsive the first time I had an issue. But when the second case had the SAME problem, they didn't respond to me at all and I had to go through Amazon for the return. Waste of time and money. Yeah, the Mophie case is more expensive, but it's also a LOT more reliable. If you want a reliable battery case and reliable customer service, don't look to this company.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Vannucci",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Why does my charger turn off at the time my phone battery reaches 100%.",
      "text": "I just got this case. I used a iPhone6S before & used the iPhone extra battery case made under Apple name, some called it the white wale. Because, the shape did somewhat resemble a white hump back whale. I liked the way the battery pack managed the battery to keep the battery within the phone charged completely without the need of the user having to turn anything on or off.",
      "rating": 4.0,
      "verified": true,
      "author": "Rocky",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Works as advertised.",
      "text": "Received the product in a timely manner. Easy to install and works fine. Feels good to hold and easy to handle. Like the weight of it and how it functions. When my phone says 20% left just have to press the button on the back and then it starts recharging the phone. I'm in sales and it keeps me from chasing charging cables and outlets to recharge my phone. Have not been able to try the wireless charging since the required piece is a separate purchase. I ordered but was out of stock. once I receive I will add to this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Smith",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great Product",
      "text": "I really love this product because it’s not too big, heavy, or bulky. It has great battery life and so far I’ve had it 3 days and it has yet needed to be charged. As a plus, it’s very easy to use and offers great protection for your device. It is truly a great iPhone product because it has replaced my need for constantly needing a charger cord. The only thing I dislike is the color please consider having a variety of colors available for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Good Battery Case",
      "text": "Arrived on time in perfect condition yesterday. Working as described. Easy and straightforward to put together, charge and use. I have bought multiple Alpatronix products (including multiple iPhone battery case) in the past and I never had a problem with them and was never disappointed. They all lasted many years and never died on me. I got a new one only when I changed my iPhone. I am a regular/repeat Alpatronix customer. Will update review after I have used this case for sometime",
      "rating": 5.0,
      "verified": true,
      "author": "Sun G.",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Sleek & easy to hold",
      "text": "The charger is sleek & offers great protection for the phone. Though you will need to take any cover that you might already have on the phone. The case is surprisingly light, i used a similar charging case with my previous iPhone 5s but this case felt really light and far more practical to carry along. So far it has worked fine, ive used it while traveling, which is a great convenience as you don’t need to worry about running out of battery while you are out taking the pics and that too without having to carry an additional portable battery with you. Easy to hold and convenient to carry around. Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Shehneela",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Breaking my phones battery, with two of te same cases",
      "text": "Stopped working and has massively hurt my phone's battery, the customer service was great they sent me out a new one but yet again this one has issues shortly after getting it with the battery not working ot overcharging my phone and yet again im looking at other cases because my phone is just getting worse with the use of this product, sadly its a waste of money",
      "rating": 2.0,
      "verified": true,
      "author": "logan hutton",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Significant Upgrade from BX170Plus",
      "text": "I've been using the Bx170plus for my iPhone 7 Plus for almost 2 years when I decided to give the BX190Plus a try -- mainly for the wireless capabilities. Not only does the BX190Plus have a slightly larger battery but I no longer need to worry about plugging in a cable to charge as well. I simply lie the phone in case on top of my Qi compatible charger and it charges without issue. I'm extremely happy with the increased battery size that comes without a significantly larger footprint for the case. Overall, a solid upgrade over the existing BX170Plus and highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Smith Jr.",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great product and Great Value",
      "text": "Just what I needed to get my iPhone8 Plus over the hump in terms of running out of power at inconvenient times. A quick assemble and plug in powered up my Alpatronix battery pack and i was good to go. I have a wireless charge pad so it is super easy to charge the battery pack each night. By the moring, the battery pack is fully charged and ready to go for the day. I shopped for other battery packs, yet Alpatronix's offered the best value of the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred F",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Short Time Use",
      "text": "When we first bought the chargers it was great. Did have problems charging it, had to take the phone out and reinsert to charge sometimes. Not protective of phone. Side buttons break easy. Case gets really hot when charging. Only lasted 10 months now it takes forever to charge wireless. And the Android charger was pushed in while trying to charge the case.",
      "rating": 3.0,
      "verified": true,
      "author": "Briana",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Charger doesn't last - only useful as a protective case.",
      "text": "Second battery case I have bought and while they are great initially, they don't seem to last. Case ceased charging after a couple of months and therefore is only useful as a protective case. Have to remove case to charge with standard iphone charging cable instead and then you don't get the benefits of extra battery time that are supposed to come with a charging case. Contacted Seller through Amazon about warranty but didn't get a response. Contacted manufacturer and they are willing to repair or replace, but I have to send Case back to them, which means I have no protective case for my phone in the meantime, so I have to buy another case anyway.",
      "rating": 2.0,
      "verified": true,
      "author": "Brenda DeGarmo, Yaussie LLC",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "A must have item!",
      "text": "I have never been disappointed with this company’s battery cases. You cannot go wrong. The case protects your phone and increases your battery life. You will be glad you got it! I highly recommend it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana C",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Like mophie but BETTER",
      "text": "Just like Mophie! But Better! Had the mophie for an iPhone 7, got a new iPhone 8 Plus I went with this because it had more battery life than the mophie case and still had wireless charging which is a plus for me! I can charge my phone all the way from about 10% to 100 and still have 2 out of 4 bars left of juice on the case👍 I could only get one charge out of my mophie!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon B",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Waste of money",
      "text": "No battery life at all, does not even last an hour. I charge it over night and when I try to use it, it has nothing. Wouldn’t mind if it was cheap but it’s not at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Cecilia ",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Disappointed with the product. Not compatible w/ my iPhone 8 plus or headphones",
      "text": "I am very unsatisfied with this product. It was supposed to make my life easier but, it’s a hue inconvenience. 😠 The case doesn’t allow for you to use your headphones, you have to remove the case entirely to do so. Unless you have pods... I do not recommend. And, it only charges my phone when it’s on the wire. I went to a concert and tried to use the case and I got a message ... noting the case is not compatible with my phone. Really disappointed. And, frankly annoyed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Good case",
      "text": "Only thing I dislike about this case is the top piece doesn’t always stay down, it’s not loose where it’ll fall off but constantly have to take it off and redo it and it stays down for a bit but it’s a never ending thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Not a good buy",
      "text": "The battery pack case was great at first but I experienced a similar problem as another customer. When I removed the top cover, a piece of the case started to break off. I contacted customer service but they did not resolve the problem so I returned the case as defective. I only had it 2 days before the problem occurred.",
      "rating": 1.0,
      "verified": true,
      "author": "Nise327",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Works well, is lighter than expected, and does ...",
      "text": "Works well, is lighter than expected, and does supply the added battery life as promised, but one drawback is that the attachment for power/charging is a different one than the native iPhone lightning jack. Therefore, you can't use that jack to connect your speakers or earphones. You are forced to use Bluetooth accessories unless you can find an adapter.",
      "rating": 4.0,
      "verified": true,
      "author": "vascman",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Can't buy a better battery case for the price",
      "text": "I have always purchased Alphatronic products because they are durable, reliable, and backed by a very responsive customer service. I actually purchased the wireless charger before ordering this battery case. You can't go wrong with this product not to mention the affordability.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Beautiful construction; Customer Support",
      "text": "We've tried many battery cases, but this one promises to be the best yet. 5000mAH of power and wireless recharging. It's new and we need to give it a workout before commenting further. But looks, appearance, packaging and etc. are superb. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Halford H. Fairchild",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Poor quality",
      "text": "Didn’t even last 4 months, never dropped once. Micro USB connection collapsed into the case a couple weeks inwhile trying to plug it in, and now it won’t even charge wirelessly either. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Mattey",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Quality good but I got issue one",
      "text": "Everything is good, looks also good , but too heavy , I don’t know why when I used second days became no work for charging, so I decided to return it, except this problem maybe that quality is good from mostly , if no surprise maybe you get better than me.",
      "rating": 2.0,
      "verified": true,
      "author": "I-Hsiang Hsu",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Wireless charging for the iPhone 7 Plus!",
      "text": "I can not say how long I’ve been waiting for a case like this. Wireless charging and an extended battery. This case works great and I am beyond excited that I didn’t have to purchase an 8 plus just to get wireless charging. After several months this case is still amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Meyers",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Great battery case for iPhone 8+",
      "text": "So not my first case from Alpatronix and I had high expectations but not only did they meet them but they even exceeded them. The feel of the case has been improved and the screen protectors were very easy to put on. Also much easier to get in and out of case if needed. As far as battery I play some mobile games on my phone and this makes it possible to still have some battery left even with heavy play. Nice looking and practical battery case without adding a ton of weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "The perfect battery case",
      "text": "I have an iPhone 8+. This case fit my phone snuggly without it feeling like I would break the phone trying to remove it. The charging was very easy. You can charge using USB C or my favorite way, Qi charging. The phone will charge very quickly when using Qi and you don’t need to remove the case. The case is durable and has a solid feel without being heavy. The four lights on the back tell you how much charge the case has remaining. Four lights was more than enough to bring my phone from 10% to 95%+. I’ve had this case for over a month with no problems. This is my favorite battery case. It is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy M Curran",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Amazing!!!!",
      "text": "I ordered the phone case on a Sunday night and received the product Monday afternoon. Very fast. I got the wireless charging case because I bought a car that has the Qi charging dock. The case charges quickly; both wirelessly and through cable. The case charges the phone pretty fast as well. The design is very nice. It’s sleek and aesthetically pleasing. I have bought Mophies in the past but am now switching to this brand as they are less expensive and better quality IMO. I can now comfortably go through a whole day of filming (skateboard,) social media, etc and not worry about battery life. Would def recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "walter rojas",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "This is a great wireless charging battery case!",
      "text": "Don’t let the three stars scare you from buying this product if you work in an office environment, if so add a star! The rest of us that work outside in dusty harsh conditions this case isn’t for you! You The reason I bought this battery case for the 8 plus is that it allows wireless charging! Although for some reason the case overheated on my initial charge, the problem has gone away and Its charging perfectly now.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Edwards",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Great Customer Service!!!",
      "text": "i just want to say Thank You Very Much Rachel with Alpatronix for a replacement of a new battery case! I have to say it was a pleasure to deal with you! Thank you again for such a quick response and a new replacement case!;) I highly recommend these cases!!! Great Great Great Customer service !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Denyce ",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Easy to put on and off the phone and to ...",
      "text": "I've been using this for almost a month now and can say I have never even once worried about my battery running out. It's a little thicker case than I prefer, but no more so than any other battery case. Easy to put on and off the phone and to use/recharge. No complaints at all.",
      "rating": 5.0,
      "verified": true,
      "author": "ELS",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Very Good.",
      "text": "Very Good. Takes a while to charge the case but it does charge the iPhone pretty well. Easy to hold, no real slip. I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Nolan1974",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Took too long to charge back up after several weeks of use",
      "text": "With the plus, this case makes it huge. Which I didn't mind all that much. However, after using the case for about 2/3 weeks, I really noticed how long it took for the case to charge back up. I tried different cables hoping for different results, however, they were all about the same. I returned it because I really hated just how long it took to change. However, I did like the feature where you could choose when the case charges your phone. Because I know there are some cases that will not give you the option of when you would like to do charge it.",
      "rating": 2.0,
      "verified": true,
      "author": "Brooke Bigelow",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "2 or 3 months of Service on this charger",
      "text": "This must be the 7th IPhone battery charger that I’ve bought. Out of them all the brand UNU worked the best, had 2 pairs that lasted 10 to 13 months. This particular pair stopped charging.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah Carr",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "All broken when I opened the box!",
      "text": "I can't believe they sent me broken item! You can tell the item has been used by looking at the damages and the ring on the back of the case! This is so annoying, waiting for my case to come and having to send it back because the item was totally broken when received and having to go get another case. I held the case to see how much damage it had and the back of the case just fell off exposing the battery. It makes me wonder, how would my phone do if I dropped it.",
      "rating": 1.0,
      "verified": true,
      "author": "New user",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Not good in high humidity",
      "text": "Works great unless you live somewhere where it rains. Even if it is in your pocket protected from the rain the additional moisture in the air will make it start acting up and you will have to give it some time in a low humidity environment before it will start working again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Case doesn’t charge well!",
      "text": "The case it’s good although the battery on the case is just not good at all!!!!! I charged the case and every time I try to charge my iPhone 8plus it only changed around 5 percent and next thing you know they case turned off. Every time I try to turn on my case to charge my phone it turns off. Sometimes it stays on for like 5 minutes and then it turns off. I just wish the case would stay on until it fully charged my phone. Checking if it’s on it’s pretty annoying. How can I get a refund or exchange because I’m not happy with this battery case.",
      "rating": 2.0,
      "verified": true,
      "author": "Diego Pina",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "works as it should",
      "text": "works as it should 4 indicators light up when iphone and extra battery are fully charged. when the iphone battery is below 1/2 full I press the button on the back of the extra battery and waalaa it charges my phone",
      "rating": 5.0,
      "verified": true,
      "author": "BJ Krause",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Great case and excellent customer service.",
      "text": "This case will not disappoint you. Feels great in the hand and easily gives me all day battery life. Also, enhances the quality of the audio that comes out of your phone. I don't even need to use a bluetooth speaker anymore! And last but not least, the company's customer service is exceptional. Don't hesitate to buy this case.",
      "rating": 5.0,
      "verified": true,
      "author": "Caramel Edition",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "It's good. Worth the money.",
      "text": "I did take out the plastic screen because it collects alot of small fibers underneath. Also out of nowhere the rop left corner of the top cover just broke. Never dropped.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Creawell",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "It’s hard sliding the phone in and out of the case/didn’t charge at all",
      "text": "Just a little hard to slide in and out the phone. Other than that it’s great. Update: I never got to use it because I wasn’t able to turn it on. I left it connected to the charger many hours and It never charged. I wasn’t able to return because i was out of the country. Other people’s product seemed to work, but I guess mine just didn’t . Hope I buy a new one soon!",
      "rating": 1.0,
      "verified": true,
      "author": "Karina",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "The one sold by a well-known competitor (which I had used for many years for my 6 Plus) did not get good reviews, as many people complained that they could ...",
      "text": "This is the only charging case with positive reviews that I could find for the iPhone 8 Plus. The one sold by a well-known competitor (which I had used for many years for my 6 Plus) did not get good reviews, as many people complained that they could not get their phones out of the case once the case was placed on the phone. Therefore, I decided to give the Alpatronix case a try and I have been very satisfied. It is easy to use, provides a quick charge and has protected my phone from damage when dropped. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Wiggins",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Do Not waste your money, go elsewhere!",
      "text": "Battery will not hold charge after 6 months... shows charging and fully charged by lights but is dead.",
      "rating": 1.0,
      "verified": true,
      "author": "YOUNGIE",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Excellent Customer Service!",
      "text": "Although I was unable to use the initial product we purchased for our son for XMAS (due to our changing his phone type), Rachel was extremely helpful in obtaining a full exchange to a new battery case. We also purchased a Qi enabled wireless charger for our phone. It works perfectly. We will continue to purchase products from Alpatronix in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy B.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "My iPhone 7 plus best friend on the go",
      "text": "This is an excellent product. Securely holds and charge's your iPhone 7 plus.",
      "rating": 5.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "This case saved my phone",
      "text": "Great case. Very durable. The CASE SAVED MY PHONE!!! Just tonight I lost my phone, fell in the street, got ran over by a car. Found the phone, case was smashed in, but saved my phone. I recommend this case. The car still works as well. Just doesn't look pretty. Lol I will be getting a new one as soon as I have the money. Great, great case",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Lo'",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Having extra battery capacity is very nice and the case is a good protection during outdoor ...",
      "text": "This item appeared to be a life saver. My wife and I are homeschooling our kids. They are frequently out and about and my wife's iPhone 8 is under constant heavy use for educational matters. Having extra battery capacity is very nice and the case is a good protection during outdoor activities. Thumbs up on this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Oleg",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Wasted money",
      "text": "This product does not have a good connection to phone at this point Worked at first. Just like everything else Pay good money for something and it’s worthless Now I have to pull the case off every time I want to charge phone Don’t waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Todd Anderson",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Doesn’t work!!",
      "text": "I received this on Friday and I have had it charging since Friday and only charged one bar! It is now Monday!!I took it off the charger Saturday to see if it would charge my phone with one bar and nothing!!",
      "rating": 1.0,
      "verified": true,
      "author": "Shelley Willoughby",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "he lives the phone case says its great, no issues",
      "text": "I bought this as a gift for my fiance, he lives the phone case says its great, no issues, the 8plus fit perfectly. What he had an issue is the screen protector, when he opened it, it was improperly packaged, leaving room for dirt & dust to contaminate it. So now we gotta find another screen protector. The picture isn't too great,you can't see too much if the dirt but it was a significant amount. There's air bubbles & the protector is starting to peel off",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Santana",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Awesome buy!!",
      "text": "No more searching for an out let when I’m out and my phone is dying. Now I just push a button and my phone is charged pretty quick. Obviously it’s going to add some weight to the phone, but it’s not that bad. Wish it would come with a belt clip as I’m not one who likes to carry my phone in my pocket, but this case is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Varner",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "... in 2017 Tacoma wireless charging system and it works fine. I like the fit on the phone",
      "text": "I Purchased for iPhone 8 plus to use in 2017 Tacoma wireless charging system and it works fine. I like the fit on the phone. It is not too big or slick. Its perfect for what I need it for.",
      "rating": 5.0,
      "verified": true,
      "author": "jt",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Well made product!",
      "text": "After ordering the Alpatronix battery case I was a little skeptical about how well this product would work. Upon receiving the product and seeing how well made it was I was amazed. After some time using the product I was glad I decided to purchase the product. So much we decided to buy the QI charging station by Alpatronix to use with it. Great product! Great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Bohler",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Loyal customer....this is my second one of these....",
      "text": "This is my second one of these---I ordered a backup because I use the first one all the time. I'm in the process of having it repaired due to an issue and Alpatronix customer service has been very helpful and timely in their response. Overall, they make great products and it's worth paying a little bit more to have a solid product regardless of whether you can buy one with more capacity for 30 dollars. Worth the investment for reliability and durability....",
      "rating": 5.0,
      "verified": true,
      "author": "k113",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Garbage",
      "text": "I would definitely not recommend this product as a viable way to charge your phone as it lasted about a week before it stopped working. The info on registering for the warranty does not work , so I am stuck with a useless piece of plastic encasing a lithium ion battery. It seems to charge fully but will not recharge my brand new iPhone 8 Plus no matter what I do. Needless to say I am extremely disappointed with the product. I would have gotten the Mophie charger except the wait time on deliver is months.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Very pleased!",
      "text": "Great buy! Would definitely recommend to friends. It’s perfect for emergencies when you don’t have a charger nearby.",
      "rating": 5.0,
      "verified": true,
      "author": "rifth",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Excellent customer service",
      "text": "Excellent customer service. The first case failed to charge wirelessly so the company overnighted a replacement which works perfectly. The case performs as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "bad case",
      "text": "This case needs more work, this is the second case that I have to return because when you power the case on to charge your phone the case turns off so the phone is never changed. Frankenstein needs more work great case but doesn’t work like it should I’m sad because I like the feel of it but now I have to start all over again looking for a new case 😩🙏🏾",
      "rating": 1.0,
      "verified": true,
      "author": "chereico W.",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Excellent Charging Case",
      "text": "The case is great! I bought a previous charger case from this company and was not disappointed. The case is easy to put on it even comes with a screen protector in the package. The case doesn’t take long to fully charge and it lasts a long time. The case is heavy duty and provides great protection. I wish you could use an iPhone charger to charge the case instead of a micro USB. Other than that I highly recommend this case to those who don’t like to carry around chargers.",
      "rating": 5.0,
      "verified": true,
      "author": "ShaCari",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Nice phone accessory",
      "text": "A very nice product. Charges phone fully but button on mine is a little funky but otherwise works as expected. I would have the product replaced as recommended by the company but shipping back is a hassle as we all know. Otherwise it’s a nice product. I would buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "Bigticketnames",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Very well-made. I am very pleased so far",
      "text": "I knew the case and phone combo would be a bit heavy, but I am used to that as I have always ordered a battery case. This case performs better than my last charging case, and is Very well-made. I am very pleased so far",
      "rating": 5.0,
      "verified": true,
      "author": "David Farberow",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Oops, they did it again",
      "text": "I've had very good luck with Alpatronix Battery Cases and this one works very well with my iPhone X. Definitely slides on and off easier than previous models and provides excellent battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "ABM",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Alpatronix knows how to produce a well made charger case.",
      "text": "Textured surface to reduce slippage? YES Lightweight and slim ? YES Enough battery juice to last you through the day? YES YES \\ YES / YES=GREAT",
      "rating": 5.0,
      "verified": true,
      "author": "Zamot77",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Poor Quality Case !",
      "text": "This is the second one that just broke at the on off button. i am so maticulous with my electronics. Never dropped or scraped. It’s like material drys and just cracks. The return window is one month and I know why as it break naturally in about 2. Very disappointed in seller for not replacing or refunding if product is flawed. Buyer beware!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Holden",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "This phone case is freaking awesome.",
      "text": "This phone case is freaking awesome. Even though the newer I phone have a longer charge time I love the fact that I now can make it through an entire day without plugging it in. the charging battery charges it fast with just one click of a button. For people like me that like to play game on their phone this comes in extremely helpful. I also love that is can be charged on a pad now like the competitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Scot Peters",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Good case!",
      "text": "Nice case that has a really long battery life and is protective for the phone. The only reason it doesn’t get a 5 is because the top has some rather fragile plastic pieces around the camera, but other than that, it’s great!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "I love this battery case and wireless charger",
      "text": "I love this battery case and wireless charger. I am on my phone often, and this gives me even extra time. All you do is push a button on the back and it starts charging immediately. The wirelass charger makes the charging easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Bad. I got it last week and it worked ...",
      "text": "Bad. I got it last week and it worked one time, charged the phone 100% but never again. It’s very sensitive to the way you position the phone on the charger pad. I tried holding 3 seconds the ON bottom and then 5 secs and nothing. Never dropped the phone charges case or harm it in any way",
      "rating": 1.0,
      "verified": true,
      "author": "Isabel L.",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "but I liked the potential so returned it and reordered another",
      "text": "First one wouldn’t charge the case, only the phone, but I liked the potential so returned it and reordered another. Hopefully better luck this time.",
      "rating": 3.0,
      "verified": true,
      "author": "ShayneG",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Only lasted 6 months",
      "text": "Bought this and charger in December 2018. It was unusable as of May 2019. The place to plug in to charge broke.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly K",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "affordable and great",
      "text": "great product I love the fact that you can wirelessly charge while still in the case. this adds protection to the back of the phone and makes it affordable with all day power. would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Gau",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Great Product",
      "text": "This case is exactly what I expected of it and what I wanted. Protection: 5/5 Speaker Sound: 5/5 Batter Life: 5/5 Weight: 4/5 (heavier than anticipated, not a downside) Also, I received a card saying there was a 50% rebate available for this product; however, when I filled the form out it said otherwise. Hopefully, this will get addressed.",
      "rating": 5.0,
      "verified": true,
      "author": "William Furber",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "I enjoyed the device as it provided extended battery life by ...",
      "text": "I enjoyed the device as it provided extended battery life by recharging my phone when I activated the battery in the case. However, 3 months later, I dropped my phone with the case on from a low distance from the ground and the device broke. If you are like me and rarely to never drop your phone, all it takes is that one time and it will break. Be cautious when purchasing this item as its not a protective case to that degree as it is just a battery life extender.",
      "rating": 3.0,
      "verified": true,
      "author": "Geri Lynn Samson",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "device would not turn on",
      "text": "I received the case and immediately put it on my phone and then charged them both, the case charges wireless and the depending on the phone it also charges while in the case. however the case itself would either not charge itself, or would not activate when the power button was pressed.",
      "rating": 2.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Micro usb charging connection for iPhone",
      "text": "It’s Durable I like the screen protector keeps my phone retry much charged throughout the day and evening now the cons it’s smooth texture takes some getting used too and I’m confused as to why they went with a micro usb connection so you can’t use iPhone chargers or headphones",
      "rating": 4.0,
      "verified": true,
      "author": "S.Cliett",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Case came out the box not working.",
      "text": "Case fit nice, felt nice but wouldn’t charge at all. It didn’t work at all and when I plugged it in trying to charge the phone and case it actually drained my battery on my phone instead of charge. I’m going to order again just because I want to see how this case actually works. I’ve owned mophie cases and they work great but only charge up to half percent.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "A great battery case for my 8 Plus",
      "text": "Great battery case. Wireless charging works great. Fit and finish is very nice. Fully charged this gives me a bit over 2 days worth of use. The glass screen protector fit perfectly and is quite easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "DJV",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Doesnt Charge",
      "text": "I was never really happy with this product because it would take like 8 hours to charge however I left it on the charger for a few hours and the battery case itself will no longer charge. It will just blink on the first bar of 4 which means its still not charged. Of course it went just past the 30 days so I do not have the option to return this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Gusty",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Great case and simple to use!!",
      "text": "I use this battery case a lot when I’m playing golf and traveling!! It is fantastic and makes my phone last all day, even with constant use and gps use on the golf course!",
      "rating": 5.0,
      "verified": true,
      "author": "Treymedic",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "I works .",
      "text": "Great product, it came assembled and ready to go. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Does exactly what it says it does.  Great product",
      "text": "Its a very good product. I use my phone all day long. The battery life on my phone will normally run until about 4:00 pm if I don't share it all day. Now I just hit the pack and it gives me a full recharge in about 30 minutes. Exactly what is says it does. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Arsenault",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Great combo of Battery Case and Wireless charger. Very happy.",
      "text": "Nice fit, easy to apply screen cover and works seamlessly to slide the phone into the battery case. I bought their wireless charger that goes with and love that as well. I had a Mophie on my old Android phone and while it was good, I constantly had issues between the unstable OS for Android and battery management with that setup. I like this much better.",
      "rating": 5.0,
      "verified": true,
      "author": "coastal raider",
      "helpful_votes": 0,
      "publication_date": 20180713
    }
  ],
  "product_meta": {
    "title": "iPhone 8 Plus/7 Plus Battery Case, 5000mAh Slim Portable Protective Extended Charger Cover with Qi Wireless Charging Compatible with iPhone 8 Plus & iPhone 7 Plus (5.5 inch) BX190plus - (Black)",
    "rating": 3.7,
    "feature_bullets": [
      "Powerful Rechargeable Case: 5000mAh UL-certified internal battery delivers more juice and life to your iPhone to keep it charged and last the entire day, for up to 24 hours. 100% Compatible with iOS 13+, Apple Pay & CarPlay.",
      "Qi Wireless Charging: Charge the battery case with a wireless charger (not included) for a quick and convenient wireless charging experience. It will charge your case and iPhone at the same time.",
      "360° Protection: Protects your iPhone from every day wear. Raised bezels and tempered glass screen protector offer full frontal protection.",
      "Easy Installation: Remove top piece, insert iPhone by sliding into the certified connector chip and reconnect top piece. You can charge and sync both the case and iPhone to your computer without having to remove the case.",
      "What You Get: Alpatronix Battery Case, Micro USB Cable, Tempered Glass Screen Protector, User Manual & 1-Year Warranty (2-year Warranty is also available at no extra cost). We're a California-based company, designed in the USA including our friendly customer service."
    ],
    "specifications": {
      "Product Dimensions": "3.2 x 0.55 x 6.7 inches",
      "Item Weight": "8.2 ounces",
      "ASIN": "B075LNBMKK",
      "Item model number": "BX190plus",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "3.7 out of 5 stars715 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#18,044 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "IOS",
      "Additional Features": "First iPhone 8 Plus / 7 Plus battery case compatible with Qi wireless charging with MFi certified chip and 5000mAh UL-certified internal battery.",
      "Other display features": "CE",
      "Colour": "Black",
      "Manufacturer": "Alpatronix",
      "Date First Available": "September 13, 2017"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Electronics",
      "Cases, Holsters & Sleeves",
      "Battery Charger Cases"
    ],
    "price": 45.95
  }
}