{
  "website_summaries": [
    {
      "verdict": "With their unique font, these high-quality stamps are the perfect way to spice up your crafts.",
      "pros": [
        "Letters and numbers are clear and well defined when pressed into metals",
        "Stamps feel heavy and durable, but still comfortable to hold",
        "The font choice is unique compared to standard stamp sets",
        "Stamps are 3mm wide"
      ],
      "cons": [
        "Difficult to determine orientation of stamps",
        "We suggest marking the stamps with a sharpie"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Kids think they're cool. Perfect for my needs.",
      "text": "We've been wanting more crafts to do with kids and thought these would be fun; let the kids stamp their names into wood, leather, etc. The quality of the stamps seem great, each stamp is heavy and I think these will last for years. The stamps are clean, bright stainless steel with well defined letters, numbers, and symbols. These are perfect for our needs. Shipping note: Amazon shipped these in a padded envelope and the stamp container opened some time during shipping and the stamps were floating around the envelope when they arrived. All the pieces were there, but I think Amazon could do a better job securing these when they ship them.",
      "rating": 5.0,
      "verified": true,
      "author": "Presidente",
      "helpful_votes": 11,
      "publication_date": 20180213
    },
    {
      "title": "Does the job.",
      "text": "We are able to use and stamp aluminum Blank plates. A tad hard to line up, will need practice. Easy to use. Found that we need to use a hammer on a wooden surface for the letters to stamp clearly. I got it to label keys and worked on some keys but some harder keys you can’t barely see the stamp.",
      "rating": 4.0,
      "verified": true,
      "author": "Ria Cayer",
      "helpful_votes": 7,
      "publication_date": 20190301
    },
    {
      "title": "Great quality, tons of uses",
      "text": "These metal stamps came yesterday and they've already come in super handy. I had 5 keys who were made from similar blanks and now I don't have to be Rain Man to remember the grooves of each key! My moleskin notebook will no longer be confused with my co-worker's who has a similar one. Only thing I would suggest is before you strike on your piece, practice a few times on another material, or hidden area of your piece, Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron D Johnson",
      "helpful_votes": 7,
      "publication_date": 20180212
    },
    {
      "title": "I don't think is awesome as I was expecting because on the product description ...",
      "text": "I don't think is awesome as I was expecting because on the product description it says the following: Easy to press With the Coral Cactus logo on one side of the stamp and it's hardened steel core, it is easy to orientate the stamp and even easier to press into several different materials with one solid hit..... Which is wrong because my kit came with random coral logos that don't specify the orientation of the letter and is very uncomfortable...",
      "rating": 3.0,
      "verified": true,
      "author": "Grace Mercedes",
      "helpful_votes": 6,
      "publication_date": 20180722
    },
    {
      "title": "I love my LOVE LETTERS.",
      "text": "These are great stampers! As well as the hilarious emails received from you when first ordered. The only thing that could possibly make it better is to put the product name or other symbol all on the same side of each piece, relative to the letter(number or symbol), so when you stamp it, you always know which end is up without having to decipher the letter backwards. Example, if there was a marking on the flat side which was always facing you, you would know the letter was right side up.",
      "rating": 4.0,
      "verified": true,
      "author": "SheilaK",
      "helpful_votes": 3,
      "publication_date": 20190630
    },
    {
      "title": "Check you received all the letters as soon as you can!",
      "text": "Ordered this product for a project for my son's birthday. Just found out that I'm missing the letter \"K\" and instead got to \"P\"! Since my son's name has a \"K\" in it, I can't use the set as I intended when I purchased it! Not happy that I have to revamp the whole project in 3 days.... Very disapppointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Tina Stanley",
      "helpful_votes": 3,
      "publication_date": 20180604
    },
    {
      "title": "Decent value",
      "text": "The letters aren't labeled, and it makes them hard to use. I carefully sorted them and labeled. Some of them are used for multiple characters, one upside-down from the other. To make sure the whole character imprints, I took to tilting the punches in each direction while striking them. Used on aluminum and copper with no dulling.",
      "rating": 4.0,
      "verified": true,
      "author": "NomiB",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Very good",
      "text": "Very good. Still need more practice. If you're a new user on this. Get alot of material to practice. But once you get yhe hang of to it's awsome",
      "rating": 5.0,
      "verified": true,
      "author": "Cesar Cadena",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Works great",
      "text": "Stamps work great. My only issue is that 2 of the stamps have to be rotated and used as 2 different letters. I just wrote on them with a sharpie to keep track.",
      "rating": 5.0,
      "verified": true,
      "author": "Gray9390",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Great stamps for a great price!",
      "text": "I’ve been stamping for several years now as a hobby and letter sets are expensive! Glad Coral Cactus came up with a good quality set that is affordable!",
      "rating": 5.0,
      "verified": true,
      "author": "JemsMom",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Very happy with my metal stamp set",
      "text": "Very happy with my metal stamp set! They were delivered fast and arrived in great condition. It can be hard finding good quality metal stamps for my jewelry and leather work, but so far I have been very pleased with these. I would definitely recommend these over other brands that I have used in the past!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Hatch",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Great for beginner",
      "text": "Nice size!! I bought a 3mm set from impressart for $60 and it was so tiny. Maybe this one is just a larger font advertised as 3mm?! I don’t know. But I like this font and size and it works great! I just wish it had a cap to the box to keep everything inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Disappointed",
      "text": "I'm very disappointed that they did not come with a top to the container..... This would have been a deal breaker for me if I had known before ordering.",
      "rating": 2.0,
      "verified": true,
      "author": "Penny Boyer",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Not so lovely...",
      "text": "Just opened this kit, received two B's and no D, no 7 either so I guess the L or J is supposed to suffice. Barely makes a mark in annealed med carbon steel, and the punch is deforming after four tries. Rather disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kegan",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "I have loved this product",
      "text": "I have loved this product. I’m attending college right now so it has been super fun to use these stamps for dates. We stamp peices of metal and leather and it has been very interactive and easy to use. I highly recommend this product to anyone who is into crafting or would just like to try something new. I do not regret buying this product for one minute!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Pretty style but small",
      "text": "The kids loved them, and they are a really nice font, but they are a bit small.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Bower",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Works great! I just got this in not too long ...",
      "text": "Works great! I just got this in not too long ago and was finally able to stamp some of my jewelry with it, no problems at all! It's a cute font too, and a great price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi Brown",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "You get what you pay for",
      "text": "The 7 and L are the same and hard to use straight on. You sort of have to twist the stamp a bit to get the L to look straight. Overall, not a bad kit.",
      "rating": 3.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "good product",
      "text": "It is a basic product. It fulfills its function and is good for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Eder",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Good but didn’t get all letters",
      "text": "Product is great except I didn’t get the letter ‘Q’ and got 2 letter ‘V’ which is a bummer. Wished it was packaged properly.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny Emami",
      "helpful_votes": 2,
      "publication_date": 20180525
    },
    {
      "title": "Missing so many characters!",
      "text": "2 G’s, 2 H’s, 2 R’s, 2 7’s, no J, no L, no O, no P, no W, no 6, and no 9. Very poor!",
      "rating": 1.0,
      "verified": true,
      "author": "Scooter",
      "helpful_votes": 2,
      "publication_date": 20180623
    },
    {
      "title": "Perfect for a project with my son.",
      "text": "I bought this to do a small project with my teenage son. The product came in great shape and worked really well. We had a great time using it together and we got to make something really cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Victor M. Miller",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Be sure to verify a complete set!",
      "text": "The stamping kit looks to be of decent to good quality, and it is well priced. I had a duplicate letter “H”, and the sellers corrected the issue in a timely manner. I would buy from them again.",
      "rating": 4.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Easy to use",
      "text": "Wish these stamps were easier to read and marked somewhere on the top what letter the stamp is. Imprints beautifully though.",
      "rating": 4.0,
      "verified": true,
      "author": "Darlene M.",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "which appeared similar before but this one was much better. Highly recommend",
      "text": "This product has been exactly what I've been looking for. I have used other metal stamps, which appeared similar before but this one was much better. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Come for the metal stamps, stay for the great stamping of metal!",
      "text": "Was really excited to get these metal stamps for some projects that I have planned. The metal stamps and case are exactly as advertised. I was very pleased with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amzn Customer",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Some letters missing",
      "text": "Some letters were missing. Many of them do not leave a very deep indention.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Missing stamps",
      "text": "I received yesterday and there was no \"W\" \"0\" or \"9\"",
      "rating": 1.0,
      "verified": true,
      "author": "Sylvia Smallwood",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "They are great quality and I would definitely recommend them",
      "text": "I bought these stamps a week ago and have used them a couple of times already. They work very well and leave a clear impression (I have used mine on leather). They are great quality and I would definitely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle H.",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Great for a creative mind!",
      "text": "Great product! Able to use in many different instances and helps my creative side a ton. Would definitely recommend and buy for friends",
      "rating": 5.0,
      "verified": true,
      "author": "Cory.murphy",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "The best metal stamps",
      "text": "These metal stamps are very high quality. I plan on telling everyone who needs a set to buy these exact ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Dane Thomason",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "We were excitedto get these but they Don’t have a ...",
      "text": "We were excitedto get these but they Don’t have a uniform orientation so you really have to pay attention before you stamp. Also, we didn't get a W.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Homewood",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Five Stars",
      "text": "These are great. Bought them for my wife and she is very happy with them. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Stamps work fine, but one warning.",
      "text": "Stamps work great. However, the letters are not aligned with the printing on the side of the stamps. Usually, you would expect to put the side with the letter and the words Coral Cactus facing towards your body and would know that the letter would come out in the correct direction. Not so with these stamps! You must always stamp on a trial piece of metal first (or somehow mark the stamps yourself) as it is too easy to make a mistake and ruin your work. The stamps themselves, seem well made and work fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris H.",
      "helpful_votes": 5,
      "publication_date": 20180525
    },
    {
      "title": "Quality metal stamps, artistry at ease.",
      "text": "These metal stamps make an excellent gift for the aspiring Pablo Picasso or wannabe crafty weekend warrior. As talented as I’d like to believe I am, I’m no Michelangelo. But these stamps, originally purchased as a gift, are so easy to use for a little personalized artistic touch on important items like keys and tools for the airplane hangar and garage. Mom’s uses are slightly more artistically inspired than mine :). For starters, use on a hidden part or scrap piece for a trial run before making the final product, or start light and increase pressure for desired look on new materials.",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 2,
      "publication_date": 20180304
    },
    {
      "title": "Missing letters, duplicate letter",
      "text": "Missing letter g and w; extra q/b. The unnecessary “ is so small and close together it’s unreadable as to what it’s supposed to be, it just looks like a blob. Letters were not organized, just placed in a blue box (no lid included). Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "luvlee",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "HELP. Need to be able to print label. Can't do it since I downloaded the code.",
      "text": "I took the code to the only UPS company in town and they can't scan it. I would have to drive 70 miles to the nearest place that can scan it. I want to return an item, but I will miss the deadline. Since I didn't have a printer at the time, I thought I could use the code. PS this item did not work as expected. Letters not totally visible on metal.",
      "rating": 1.0,
      "verified": true,
      "author": "Bev Powers",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "No Lid for Storage :(",
      "text": "Very nice Stamps... but no lid ?? How are you supposed to store? I’ve bought a lot of metal stamps.... always a lid, looks like it should have one...but nope, kinda disappointed in the lack of a common necessity :(",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Meyers",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "It comes in a great case that is easy to store everything and has ...",
      "text": "I have over the years purchased a lot of stamping tool kits. This one is by far high quality and worth every penny. It comes in a great case that is easy to store everything and has a lid. Honestly, in a stamping kit, what more could I ask for?! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "AZolson",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Thought these stamps were Good until I tried to spell my nick name JJ",
      "text": "Turns out all the letters are finer except the \"J\" which is backwards. Which is a major problem when my nickname is JJ, My children are Jeanette, Judy, & Joseph. Really bummed out.",
      "rating": 1.0,
      "verified": true,
      "author": "JSSJ",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "I like this product",
      "text": "These work very well, not unhappy with it. My only issue is getting lettering straight, so thats my learning curve",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Like others have said missing 1 letter and 1 number",
      "text": "Missing the letter W and the number 0, will make due by using the letter M upside down and the letter O for the 0.",
      "rating": 3.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Stamps aren't consistent in position.",
      "text": "I work in a metal shop and often have to stamp part numbers on parts. I don't think these are going to hold up long. And there is letters and numbers do not all line up the same on the stamp.",
      "rating": 3.0,
      "verified": true,
      "author": "danielkon",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Best Metal Stamps out there",
      "text": "These are exactly what I was looking for. These metal stamps are high quality for a great price. The little case they come in is very convenient and helps to keep them organized and easy to access each letter and number. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Chase Murphy",
      "helpful_votes": 2,
      "publication_date": 20180304
    },
    {
      "title": "exactly what was expected",
      "text": "The product arrived as promised and will perform exactly as I hoped it would.",
      "rating": 5.0,
      "verified": true,
      "author": "Morey M. Mast",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Missing letters and numbers",
      "text": "I bought both the upper and lower case letters and I'm missing letters and numbers from both. How do I contact the seller?",
      "rating": 2.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Great product",
      "text": "The stamps performed very well and we're exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer: Dr. Allen.",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Pretty set.",
      "text": "All the letters are there but the M & the W are to be used as both I believe. Pretty set.",
      "rating": 5.0,
      "verified": true,
      "author": "Luv Working Out",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Excellant stamps",
      "text": "I like the size. I like the font. Well made, decent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry s Parks",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Nice craft box addition!",
      "text": "This is a great set! There are several little projects/gifts that I've been wanting to personalize, and now I don't have to pay extra to have that done by someone else. Using just this kit and a hammer, I can stamp into almost anything. I also love how tidy and compact the box is for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley B.",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "I don’t think they will hold up but great size and nice letters",
      "text": "A little soft , I don’t think they will hold up but great size and nice letters",
      "rating": 3.0,
      "verified": true,
      "author": "Bobby nawrocki",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "These are by far the best metal stamps I've ever purchased",
      "text": "Wow! These are by far the best metal stamps I've ever purchased! They are sturdy and durable. I couldn't be happier with these metal stamps.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20180216
    }
  ],
  "product_meta": {
    "title": "Custom Font Number and Letter Stamping Tool Case (36 Uppercase Stamps/Alphabet 0-9 & !) 1/8 inch (3mm) Letters, Numbers, Symbols - Hard Carbon Steel Tools - Stamp/Punch Metal, Jewelry, Leather, Wood",
    "description": "Size:Uppercase36 durable hardened steel 3mm stamps \nCoral Cactus provides a durable hardened steel stamp that will last project after project. We have designed our stamps to give you the absolute most value with substituting letters and numbers with others such as the 6 and 9 or M and W to give you even more stamps for your designs. \n\nAesthetic Packaging \nWe have designed a packaging that looks like it should belong on your workbench and conveniently stores all of your stamps for easy work ability. The storage container does not include a lid to show off your stamps. \n\nClean and Oil Free \nWorking with your stamping set shouldn't mean having to deal with dirty, oily hands. We have designed a set of stamps that keeps your hands clean from oil and rust in order to keep you stamping \n\nEasy to press \nEach stamp is made of hardened carbon steel allowing you to easily press the characters into several different materials with one solid hit \n\nUnique and Timeless Font \nWe believe that everyone's story is unique and that requires unique tools. We have produced the \"Love Letter\" stamp set to be a unique and timeless font for any type of stamping project",
    "rating": 4.3,
    "feature_bullets": [
      "✔ 36 DURABLE HARDENED STEEL 3mm Stamps - Full 26 Uppercase Letter Alphabet (M multifunctional for W) 10 Numbers 0 through 9 (Letter O multifunctional for number 0, 6 multifunctional for 9) with BONUS Symbols \"&\" \"!\" and \".\"",
      "✔ AESTHETIC AND CONVENIENT Storage Bin For Organization of Your Stamps without a Lid to Show Off Your Stamping Set",
      "✔ CLEAN AND OIL FREE Electroplated Silver Color Stamps to Look Beautiful On Your Workbench And Keep Hands Clean",
      "✔ EASY TO PRESS Into Materials Such As Aluminum, Pewter, Alkeme, Copper, Brass, Nickel, Silver, Wood, and Leather",
      "✔ UNIQUE AND TIMELESS Font For Your Unique Projects And Crafts"
    ],
    "specifications": {
      "Product Dimensions": "5 x 3 x 2 inches",
      "Item model number": "4336839081",
      "ASIN": "B075876B2M",
      "Customer Reviews": "4.3 out of 5 stars140 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#18,786 in Arts, Crafts & Sewing",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "1.34 pounds",
      "Manufacturer": "Coral Cactus",
      "Date First Available": "July 6, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Arts, Crafts & Sewing",
      "Beading & Jewelry Making",
      "Metal Stamping Tools"
    ],
    "price": 21.99
  }
}