{
  "website_summaries": [
    {
      "verdict": "You'll pay up a bit for this mat, but owners rave over its ruggedness and portability.",
      "pros": [
        "Size is 118 by 39 inches",
        "Constructed from commercial grade PVC tarpaulin",
        "Lightweight and portable",
        "For use on a variety of surfaces",
        "Easy to inflate and deflate",
        "Comes with a hand and foot pump, storage bag, and repair kit",
        "Rugged",
        "Available in a variety of other sizes and colors"
      ],
      "cons": [
        "On the expensive side",
        "This mat can become slippery if it gets wet"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "She enjoys practicing her tumbling outdoors and this works great. Easy setup and takedown",
      "text": "My daughter loves the air mat. She enjoys practicing her tumbling outdoors and this works great. Easy setup and takedown. No complaints. Only issue involved locating an adapter that is needed for the pump (It is inside of an included repair kit). Extra mat in video is not included.",
      "rating": 5.0,
      "verified": true,
      "author": "Bone Doc",
      "helpful_votes": 20,
      "publication_date": 20180330
    },
    {
      "title": "Great quality",
      "text": "My daughter loves her air tumble track! She got it a month ago for her birthday and uses it every day. It is great quality. I did a lot of research before I bought this and I am glad I went with Sinolodo.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyelle",
      "helpful_votes": 17,
      "publication_date": 20180709
    },
    {
      "title": "Great gymnastics practice mat",
      "text": "We purchased this for our 12 year old daughter who is currently on a competitive gymnastics team. She wanted an option for practice/working out at home as well as to have a fun gym mat to use on the lake. She has been very happy with the mat; however, I would recommend the 20' vs. 16' for children 12+ who are a little taller (5'1\"). The mat comes with a cary bag (think hiking backpack for size) as well as an electric pump for quick and easy of inflation and deflation. Works like a charm! We've used the pump for other inflatable items we own as well!! Overall, very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Katadhin",
      "helpful_votes": 9,
      "publication_date": 20180730
    },
    {
      "title": "Disappointed",
      "text": "I am very frustrated that I spent $700 on a mat that was used under a dozen times and started leaking air in multiple seams in 13 months. I was also not helped and ignored by the company because it was barely over the 1 yr, like weeks. I then contacted Amazon who did not give me much help. The handles started leaking air and the side seams, large amounts of air quickly. Very poor , I would not recommend .",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca Schmidgal",
      "helpful_votes": 5,
      "publication_date": 20190802
    },
    {
      "title": "Air track",
      "text": "I got a 16 feet air track , and I love it! I also have a ibigbean air track, and I like the Sinolodo the best it’s A bit wider then my other and had really good handles. I love my sinolodo air track it’s perfect to work on my tumbling, plus it’s really fun! I love how you can use it for tumbling, a slip’n slide and it floats on water! It was definitely worth the money. Overall i would give sinolodo air tacks 10 stars!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shaylafosta ",
      "helpful_votes": 9,
      "publication_date": 20180731
    },
    {
      "title": "Five Stars",
      "text": "Great product, and price. Just as described. Sturdy and well made. Decent shipping and great communication!! Would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "DiDi",
      "helpful_votes": 12,
      "publication_date": 20180111
    },
    {
      "title": "Good quality, happy gymnast",
      "text": "My daughter has wanted one of these for a long time, and after much research over the years we decided to go with this one as it seemed to be best for \"gym floor\" feel. She absolutely loves it. We have only had it a week or so, but it inflated with no issue and has held it's air fine for us. 16-ft version is big enough for actual tumbling (the next size up would be even better if you have the room). Great way to practice outside of the gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 2,
      "publication_date": 20191017
    },
    {
      "title": "Awesome air track!!!",
      "text": "My gymnast daughter was dying for one of these and saved her money. I was nervous at first to buy from a company I had never heard about. It arrived sooner than expected! My daughter used it almost everyday last spring and summer! Snow just melted so it will be coming out again soon! We even bring it along camping with us! It is light enough when it’s not blown up for my daughter to carry herself, which is a bonus! I highly recommend this brand to everyone! Why buy 3times as much $$$ for half the air track!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Flora",
      "helpful_votes": 3,
      "publication_date": 20190404
    },
    {
      "title": "Their reaction was awesome. In addition to giving me the repair instructions ...",
      "text": "Complete deception when the mat was delivered. The box was completely destroyed and the mat was punctured. I put a complaint with Sinolodo. Their reaction was awesome. In addition to giving me the repair instructions for the damaged mat, they sent a brand new one (in a stronger box) within two weeks. The mat is great, It is sturdy, very good materiel and construction. My daugther really enjoys it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pascale",
      "helpful_votes": 4,
      "publication_date": 20180419
    },
    {
      "title": "Great training tool and fun!!",
      "text": "My daughter saved for months to purchase this Sinolodo Gym Mat Tumbling Track and couldn’t be happier. She had been able to add several skills this season because of the hours she had spent on this mat. It’s easy to inflate/deflate and is so portable. The bag that comes with it makes traveling with it so easy. Best purchase we have made in a long time!!",
      "rating": 5.0,
      "verified": true,
      "author": "us3girls",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Great Gymnastics Mat, Great Seller -- Highly recommend!!!!",
      "text": "We were so lucky to get this before Christmas! The mat is easy to work with and it simulates a spring floor nicely and it is easy to set up and get the proper bounce. We have an open living room and family room, and there is enough room to work within this space! Our daughter is a level 5 gymnast and we highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Leng",
      "helpful_votes": 10,
      "publication_date": 20180308
    },
    {
      "title": "Less than a year old and will not stay inflated!",
      "text": "Not good quality. It was purchased less than a year ago. From the beginning it would bee to be pumped up every couple of days. Not it needs to be pumped up multiple times in a day. For the money definitely not worth it. Very disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "K Kramer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Happy so far",
      "text": "We've had this mat for over a week and it has been used numerous times for tucks, aerials and back handsprings. It works great and is just as good as the one at the gym according to my kid. So far, no complaints. Would gladly recommend it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy K",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Love it!",
      "text": "Our daughter has been wanting an air track forever and we are so happy we bought a sinolodo! It inflates in just a minute or two with the electric pump it comes with and it offers her little ankles so much more support when she land! We’re in love!",
      "rating": 5.0,
      "verified": true,
      "author": "lolo12",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "cheerleaders dream",
      "text": "We are so happy with this air track. Got for my 6 year old cheerleader for her birthday. We have it in our main room. I got 16ft one although a tad long for our space it’s perfect for a few combinations together front and back walker or cartwheels. My 11 year old cheerleader likes it too! Perfect for jumps also to practice. Very happy and we got it at a great price. I shopped for months.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke Palle",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "My 3 competing gymnasts love it!",
      "text": "It surpassed my expectations. I have 3 competeing gymnasts and they absolutely love it. Super easy to inflate, ita made from durable material. My girls can't stop flipping on it. They loved it so much they slept on it theu day we got. I highly reccomend this mat.",
      "rating": 5.0,
      "verified": true,
      "author": "Sextonfamily",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Once you recieve it, you wont reget your purchase.",
      "text": "I recieved my Sinolodo Airtrack this Christmas and I love it! Amazing quality, bright colors, inexpensive, and overall just a great tumbling mat\\track. The whole family can enjoy jt in many different ways. I would totally recommend buying from Sinolodo!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great buy!",
      "text": "I’m impressed with the air track. My son is a power tumbler and uses it everyday almost all day long since we received it in July. Even the dogs have walked on it and still no issues, but don’t really recommend trying that. We don’t have to add air often. It’s easy to deflate and store. However, manual pump is quite a workout for me.",
      "rating": 5.0,
      "verified": true,
      "author": "J & L",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Easy set up/take down, durable",
      "text": "Very impressed with the durability. Easy to set up and take down. Great for young and old alike.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen L Anderson",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Deflating within a couple hours",
      "text": "This mat is losing air just hours after inflating it and the Sinolodo name is no where on the product. Is it even that brand? I spent so long looking at different mats and reading reviews before ordering and honestly feel like this is a knock off cheap mat.",
      "rating": 1.0,
      "verified": true,
      "author": "sunkis",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great tumbling mat",
      "text": "I have 2 competitive gymnast and they both absolutely love this mat. My children have used this mat almost everyday since we got it and both have improved significantly in their tumbling skills. It has been the best purchase I have made. It is very sturdy, durable and the quality is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "A. I. Sequin",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "GREAT PRODUCT- Great Seller",
      "text": "We bought this for my daughter who is on a competitive cheer team. The quality of the mat is A++! We would buy again but we don't have to thanks to the excellent manufacturing! Happy customer here!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Works great for tumbling",
      "text": "It’s great. Doesn’t take long to inflate or deflate. Great for my daughter she does tumbling on it. She’s around 90lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Financially an absolute steal!! Love it!!",
      "text": "My daughter does competitive cheer so I bought this to help with her tumbling. I looked at a bunch of other websites which were incredibly pricey and weren’t as long as the sinolodo air trak so I took the chance with this one. And what a great buy!!!! Super durable, long and all around great buy for the money. I would highly recommend this track.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Very good quality",
      "text": "Great product! My 10 year old loves it and it is very strong material",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Hooks",
      "helpful_votes": 3,
      "publication_date": 20180313
    },
    {
      "title": "Great tumbling mat!",
      "text": "So far they are working great. Still waiting on the Velcro piece that holds the two together though.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Easy to inflate, seems durable",
      "text": "Easy to inflate and move around the house. My 11 yr old daughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of Four",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Hours of tumbling fun!!!",
      "text": "The Sinolodo Air Gym Mat has made this summer the best ever for my 13 year old! She is in competitive cheer and can't stop practicing tumbling on it!! She invites friends over and has even turned it into summer soapy water fun!! Great quality, lots of bounce and overall, well worth the money!!",
      "rating": 5.0,
      "verified": true,
      "author": "NW",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Great Product",
      "text": "I was very pleased with the price and quality of this gym mat. We have had it since July 2019, and it has held up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Get Outdoors",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "So bouncy and",
      "text": "I love my Sinolodo airtrack! I’m 15 so I’m pretty tall and the 16 ft airtrack is the perfect length! It’s so fun to flip on and it’s super bouncy but also durable and good for power tumbling. I definitely recommend this, especially for an older or taller gymnast.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine ",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Love it",
      "text": "Love it! Perfect size. Easy to inflate and deflate. It is extremely heavy though, but was expecting that.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Great product for a great price",
      "text": "This is a really great quality air track. With a great price. The 20ft is the perfect size for my daughters cheer/tumbling. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "The real Shaundiddy",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Need to inflater",
      "text": "Anyway we can get help with inflating the track? We can’t find the device to blow it up?",
      "rating": 4.0,
      "verified": true,
      "author": "Kai Dawes",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Five Stars",
      "text": "Very happy with quality & easy of use. 4m version works well inside & outdoors, fits in my backseat!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rogers",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Great product",
      "text": "Very sturdy product! My daughter loves it and uses it daily",
      "rating": 5.0,
      "verified": true,
      "author": "necole bynum",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Solid tumble track.",
      "text": "Amazing product. My daughter is a full time gymnast and spends hours on this. Holds air and is a solid made track! I would give it 6 ⭐️ If I could",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Koorndyk",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Love it!!",
      "text": "Got it for my 8 yr old daughter for Christmas and she loves it! Awesome purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Awesome mat!",
      "text": "Excellent product! My 8 year old gymnast absolutely loves this mat! It is made really well and it is great for her to practice on. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Perfect gift for your gymnast.",
      "text": "Well made product. I love the backpack carrying case for it.",
      "rating": 5.0,
      "verified": true,
      "author": "mandi",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "airtrack",
      "text": "i liked the material and how it was bouncy. i didint really like the price. but overall i was satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "David Martin",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "great service and product",
      "text": "my daughter loves her airtrack and our product even arrived earlier than expected so it was a wonderful experience so far!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Mitchell",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Great purchase!",
      "text": "My daughter loves this! Been using about a month and seems sturdy and well constructed.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Five Stars",
      "text": "Loved the product. Well worth the money. My daughter and son both love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Great for tumbling",
      "text": "So far so good. My daughter loves it and great for tumbling!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle A Burton",
      "helpful_votes": 0,
      "publication_date": 20180627
    }
  ],
  "product_meta": {
    "title": "Sinolodo 10ft/13ft/16ft/20ft/23ft/26ft Inflatable Gymnastics Air Track Tumbling Mat 4/8 inches Thickness Airtrack Mats for Home Use/Training/Cheerleading/Yoga/Water with Pump",
    "rating": 4.7,
    "feature_bullets": [
      "【【GREAT Christmas GIFT】It's a perfect gift for gymnasts,cheerers,tumblers and yoga lovers. They could spend hours on it whether indoor or outdoor or in pools.",
      "【FREE ACCESSORIES】: The tumbling mat comes with electric pump which could inflate the gym mat within 1-2 minutes.",
      "【WIDE APPLICATION】: The Air Floor can be placed on the gym floor, the artistic gymnastics floor, in high-performance training, gymnastic exercises, dance clubs, fitness clubs, schools, leisure centers,home entertainment, gymnasium, dance club, professional training, park or rental business. Also, it could be used on backyard, grass land, beach or water. Just make sure there is no sharp things or fire around.",
      "【PROPER SIZE】The air mat for tumbling is low weight and portable, easily stored in a bag when not use. The mat simulates a spring floor nicely and it is easy to set up and get the proper bounce.",
      "【PRESSURE ADJUSTABLE】By controlling air inlet, the airtrack and air board is with adjustable resistance and comfort."
    ],
    "specifications": {
      "Date First Available": "May 2, 2017",
      "Manufacturer": "Sinolodo",
      "ASIN": "B08G8GMHBT",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Sports & Outdoors",
      "Tumbling Mats",
      "Sports & Fitness",
      "Mats",
      "Gymnastics",
      "Mats & Flooring"
    ],
    "price": 299.0
  }
}