{
  "website_summaries": [
    {
      "verdict": "Comes with a variety of accessories, making it a great multi-tasker.",
      "pros": [
        "Comes with every attachment you need, from a mini chopper to a whisk, and more",
        "The blade is tough enough to crush through ice, too",
        "A great multi-tasking tool for the kitchen that features a splash guard design and pressure controlled speed",
        "ACTIVEBlade technology ensures food blends incredibly smoothly"
      ],
      "cons": [
        "Storage is a little tricky since the accessories don't fit into one another",
        "Unit is also pretty expensive considering it's a hand unit and not a countertop model"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "not as good as old ones",
      "text": "New design does NOT blend as well as my old Braun. Had to use old one to get soup creamy. Was only buying because my old one is Plastic and I wanted Stainless Steel but it even failed on that point because it seems to have some kind of nonstick coating inside the bell where the blade is. I returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "kathy",
      "helpful_votes": 18,
      "publication_date": 20181231
    },
    {
      "title": "Will not work with US electrical outlets!",
      "text": "I would probably love it as I ordered it so I could mash food for my 95-year-old father who is terminally ill. However, THIS UNIT WAS DESIGNED TO BE USED IN EUROPE... it can NOT be used with American electric outlets. Prongs are round... will not even FIT in a US designed electrical outlet! So disappointed as I was anxious to receive it and use it. Returning today!",
      "rating": 1.0,
      "verified": true,
      "author": "Marjorie Smith",
      "helpful_votes": 38,
      "publication_date": 20180529
    },
    {
      "title": "Amazing kitchen tool!!!",
      "text": "This is an amazing addition to our kitchen! If you do vegan, raw, or paleo this is a must have. We love it! We even use all of the attatchments, especially the processor, it shreds onions to nothing in seconds (I despise onions so this is great for hiding them and still getting their nutritional value).",
      "rating": 5.0,
      "verified": true,
      "author": "B.MACK",
      "helpful_votes": 15,
      "publication_date": 20180402
    },
    {
      "title": "An excellent hand blender with great accessories!",
      "text": "After reading the reviews, I bought my unit from Gandhi Appliances, llc, as I needed a 220V unit. I am very happy with it. It arrived in perfect condition with all the pieces intact. It is an excellent hand blender with perfect accessories. I am very pleased with my buy and would highly recommend this unit to anyone looking for hand blenders.",
      "rating": 5.0,
      "verified": true,
      "author": "Suraiya",
      "helpful_votes": 15,
      "publication_date": 20180224
    },
    {
      "title": "Overall good blender",
      "text": "This is my third blender by Braun. But this time the small chopper's lid has broken that has never happened before, and I was surprised that the warranty covers only the motor of a blender. The price for a replacement lid is almost the same as the price for the whole chopper attachment.",
      "rating": 3.0,
      "verified": true,
      "author": "Olga",
      "helpful_votes": 9,
      "publication_date": 20191007
    },
    {
      "title": "Great blender and accessories",
      "text": "Blends perfectly. The mashing tool does do a better job on soft foods like potatoes. The chopping container is large and cleans easily. I use it to chop all my onion, garlic and ginger - no more tears. The cup is good for mixing one cup, but i would have liked a tall narrow pitcher like I had with another blender. The safety feature of holding the top down while depressing the on button is a bit annoying, but I found you can let go of the top after the blade starts so perfect then. I haven't figured out the speed control, but I tend to go full speed on blenders so not an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaye",
      "helpful_votes": 8,
      "publication_date": 20180825
    },
    {
      "title": "Amazing Product",
      "text": "I love to make hot sauces with my peppers I grow in the garden. But a normal stand blender doesn't liquify the peppers as well as I need it to. The Braun MQ9097 is able to blend the pepper mixture down to a good hot sauce consistency that I love. 10/10 product.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Falcone",
      "helpful_votes": 10,
      "publication_date": 20180913
    },
    {
      "title": "Swanky blendification",
      "text": "After much reading, bought this set to replace budget stick blender nearing end of life. So far delighted with set. Motor unit is crazy powerful. Really like the variable speed trigger, versus most units hi/lo switches. Set came with a whisk attachment which is way useful, more than expected. Only negative (tiny) is that motor unit has a \"safety\" button on the end which has to be \"bumped\" before trigger will operate. Button times out in only 1-2 seconds. Didn't expect the timeout initially, was perplexed. On company/delivery, was speedy. One attachment was shattered on delivery. Placed ticket with Braun along with pic and order #. Received a replacement from Braun via speedy delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "james c.",
      "helpful_votes": 4,
      "publication_date": 20190626
    },
    {
      "title": "Handiest Appliance I Own!!!",
      "text": "I love this emulsifier. I keep it out on my counter to blend my shakes everyday. I've mashed cauliflower with the masher, chopped nuts, whisked eggs and egg whites. It's wonderful. I bought this same appliance for a shower gift and altho the couple had registered for another brand name, I got them this one because it came with more attachments and I just think it out performs any other out there. I recommend it highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen S.",
      "helpful_votes": 4,
      "publication_date": 20200310
    },
    {
      "title": "not great. Haven't tried the potato masher",
      "text": "Wish the motor would be a wee bit more powerful. The whisk is a little flimsy but works to stir \"thin\" batter, etc. Chopper was okay, not great. Haven't tried the potato masher.",
      "rating": 3.0,
      "verified": true,
      "author": "verna rankin",
      "helpful_votes": 10,
      "publication_date": 20180727
    },
    {
      "title": "Not worth the price",
      "text": "The hand blender itself looks chic yet still overprice for the whole set with all other cheap flimsy plastic accessories.",
      "rating": 2.0,
      "verified": true,
      "author": "Red Mercury",
      "helpful_votes": 11,
      "publication_date": 20180906
    },
    {
      "title": "Arrived in old beat up box; so did the replacement",
      "text": "The produce arrived in a box that clearly had sat in a warehouse long enough start seriously degrading. On top of that the main blender tub had a large crack in it so we had to do a replacement. The replacement arrived in a box about the same as old. We found no physical breakage but are not impressed with the quality of the plastic and system. Our preference was to return it but we kept it as a backup.",
      "rating": 1.0,
      "verified": true,
      "author": "Dalton Pulsipher",
      "helpful_votes": 4,
      "publication_date": 20190614
    },
    {
      "title": "It’s so easy to use.",
      "text": "I love that I can blend veggies right in the pot. I also make mayo, salad dressings, have mashed potatoes and cauliflower that come out perfect. I have not used the mini processor yet but I have a salsa recipe ready to try. It’s also easy to clean. I just zip it a few times in a cup of soapy water and scrub with a brush after. Order it! You’ll be glad you did.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180425
    },
    {
      "title": "Great product so far, easy to control, well built.",
      "text": "Had a Braun for years, love this one. Powerful, yet not crazy fast. The remarkable thing is that it never splashes the material out of a container. It's got a gentle start, and somehow nothing ever splashes out. Plus, the control 4 Speed Works, very very well. Very easy, very intuitive to use. So this model is much more controllable than anything else I've ever used. In fact, I bought a cheap model prior to this and returned it, because it wasn't really usable. Liquid virtually exploded out of a container. And the accessories are very very good, too. They're useful. I'm selling the Cuisinart.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Hammond",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Plastic mechanism is going to crap out.",
      "text": "My Cuisinart immersion blender bit the dust after very occasional use for the past 5 years, because it relied on 2 cheap, tiny plastic parts to spin together. I assumed for the higher price that this on one that this Braun would be higher quality. Nope, same design. And its components (the bowl, other pieces) are cheaper plastic too. I wasn’t even sure they’d hold up in the dishwasher (I hand wash the bladed wand). I am keeping because I need it in quarantine cooking days, but I do hope it breaks before the warranty period ends... because I expect it to break.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharon B.",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "A GREAT immersion blender",
      "text": "I bought this product to replace my old immersion blender, my old regular blender, and my very old chopper. I use it as an immersion blender all the time. It is a GREAT immersion blender. I have not tried it as a regular blender yet. It claims it can blend ice, but we’ll see. I love all the attachments. It will take me a while to try out each one. It fits very nicely into a cabinet, taking up very little space. I bought small plastic bins to hold the main parts so that they can stand up, easy to find. I am very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "FeralFiddler",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Food processor has power but no capability",
      "text": "We bought this product for its high wattage and multi-function use, but the first use for cauliflower-ricing in the food processor did not work. After needing to chop the vegetable pieces into small 1-2 inch chunks, the machine only riced about 2 tablespoons successfully. Then we read on the box that the material has a p65 warning, identifying the unit has toxins. Customer Service has not been helpful from Amazon (they dropped the ball) or Braun. I am waiting to have someone to fix this issue for me, so I can be a happy customer, and remove my negative comments.",
      "rating": 1.0,
      "verified": true,
      "author": "DLC",
      "helpful_votes": 2,
      "publication_date": 20201005
    },
    {
      "title": "Follow the directions and your set!",
      "text": "I absolutely love this! I replaced my old Braun Multimixer which is no longer made any more. I use it everyday. My husband has a protein shake and 2 tuna salad sandwiches everyday. I use the active blade shaft for the shake and the 2 cup chopper accessory for the tuna. Then I put them in the dishwasher except for the chopper lid, which I hand wash and I’m done in less then 10 minutes total for both! 💕💕💕💕",
      "rating": 5.0,
      "verified": true,
      "author": "Dawne A Kenney",
      "helpful_votes": 4,
      "publication_date": 20190517
    },
    {
      "title": "Returned for personal reason.",
      "text": "I love this item reason for return was I only needed the container as I dropped and broke my other one. The unit itself did not need to be replaced. Ordered a new set but then went to Breville web site and was able to order from them at a great price just the one item for replacing so that is why I returned it. Love it for smoothies ice , nut chopping. Great for making my home made whipped cream.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Rosenblatt",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Strong built and 💯 % user friendly",
      "text": "One of the best and i can say it is the only 700watts handheld blender. With all of its extra parts that comes with it. You got everything you need in your kitchen. My wife and i really love this big boy. We made a delicious guacamole, mashed potato, smoothies and pureed soup.",
      "rating": 5.0,
      "verified": true,
      "author": "Rj",
      "helpful_votes": 2,
      "publication_date": 20191219
    },
    {
      "title": "worth the money",
      "text": "A great blender--very powerful. The drawback is that the mixing head is small, so if you need to mix a large batch, it does take patience and time. The plastic 'mashing' attachment doesn't work well at all unless the contents has already been mixed and mashed. Then, it does a little blending, but it's not robust enough to mash by itself.",
      "rating": 4.0,
      "verified": true,
      "author": "BDN",
      "helpful_votes": 2,
      "publication_date": 20190528
    },
    {
      "title": "Got a defective one",
      "text": "Guess we got a defective one, it had almost no power and sounded like metal on metal. My husband said it sounded like bad bearings. Sent back right away",
      "rating": 1.0,
      "verified": true,
      "author": "M. A. Erickson-pepin",
      "helpful_votes": 3,
      "publication_date": 20190708
    },
    {
      "title": "Buy it!",
      "text": "This item is great. I didn't have any kitchen appliance and now it's like I have everything! this is really handy with all of its parts. Although it might not be as powerful as a heavy duty processor or blender, it does its job in the best possible way.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180822
    },
    {
      "title": "Excellent product.",
      "text": "I moved to US from Europe. And, of course, I have been trying to find a good quality food processor for my brand new empty kitchen ;) Spend almost a moth visiting different appliances stores, looking for good quality product. I have to admit that non of US brand can even compare to this one neither in quality or easy to use. Even those high priced product are not comparable to this one. You cannot spend more than $600 for the product that doesn't have various rotation speed settings or doesn't have enough cutting blades or what else it doesn't... This one delivers all I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Vasyl",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "A great product",
      "text": "It is outstanding blender. Very powerful and the auto off safety feature in just awesome. I use this for making smoothies, and fruit juice. I return the orange juicer because juicer also removes pulp from the fruits and I don't like that. This blender is perfect for my use. I will highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Vishal ",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Braun hand blenders are a must have!",
      "text": "We had a Braun we got as a wedding gift many years ago, and after many years we finally wore out the button on it. Since that one, we tried a Ninja product, but eventually decided to order another Braun. This one has been awesome so far, and makes food prep a breeze. Hopefully it lasts as long as the first one did!",
      "rating": 5.0,
      "verified": true,
      "author": "MattH007",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Great Product, Use it daily.",
      "text": "Great product, use it daily. Immersion blender does a great job. Probably use the small processor the most. Next the bowl with the feed. Probably the least favorite so far is the shredder. But I’m thinking if I chill cheese so it’s a little harder; that might work better. It has come out more crumbled balls than shredded.",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy Daulong",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "DO NOT BUY!",
      "text": "I purchased this on Feb. 22, 2020 and it now overheats and gets extremely hot after only 10 minutes of intermittent use. Braun refuses to refund, and so does Amazon. Braun's customer service is extremely poor. Paid a lot of money and expected it to last longer than 3 months!",
      "rating": 1.0,
      "verified": true,
      "author": "REDZIPITLOVER",
      "helpful_votes": 2,
      "publication_date": 20200421
    },
    {
      "title": "Definitely a step up",
      "text": "I had a less expensive stick but it couldn't handle the heave cheese sauces i wanted to make (in small quantities of course LOL) This unit is a definite step up, plenty of power, great accessories, and cleans up quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180930
    },
    {
      "title": "USED NOT NEW - Amazon charged NEW price!!",
      "text": "I bought this back in March for my new house — due to COVID we just moved. And this blender and all the attachments have been used before!! I’m appalled. I spent $200 and I got a re-used and damaged item. I am absolutely sick about this.",
      "rating": 1.0,
      "verified": true,
      "author": "EMH",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "BRAUN !",
      "text": "Blender works great. Feels well made. Did have some trouble, the first one they sent me was 220v, which in a US kitchen is a bit excessive. Amazon fixed that problem quickly and satisfactorily.",
      "rating": 5.0,
      "verified": true,
      "author": "J. C. Branch",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Wrong plug!",
      "text": "Won't work ! Wrong plug! I live in US ..Why Amazon send me euro version???",
      "rating": 1.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "European plug",
      "text": "After waiting to use this I was surprised to realized the plug is not an American one? I would love you send me a converter so I can try your product and give you an honest opinion. Looking forward for it !",
      "rating": 1.0,
      "verified": true,
      "author": "TOBACCO KING",
      "helpful_votes": 2,
      "publication_date": 20200310
    },
    {
      "title": "Junk that I did not order!!",
      "text": "I didn’t appreciate your sending me a thirty dollar unit that’s 350 watt when I ordered and paid for a ninety dollar 700 watt unit and now I am put out by having to return this junk as I am feeble and have no way to print a label b",
      "rating": 1.0,
      "verified": true,
      "author": "James l.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Very weak power",
      "text": "This immersion blender has very weak power. Did not emulsify mayo like we desired. It took a lot longer to make a smoothie than just using a bullet blender. It is very nice looking, but that's about it. We ended up returning it. It was very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "estyro",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "The ware points are all plastic and dose not last long",
      "text": "The blender it self works good, but the attachments are junk. There ware points are all plastic and they break right away.",
      "rating": 1.0,
      "verified": true,
      "author": "Mic",
      "helpful_votes": 3,
      "publication_date": 20190823
    },
    {
      "title": "One of the most useful things in my kitchen",
      "text": "This blender was a splurge but is so versatile and useful that it has been worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dancerella",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Great Multitasking tool.",
      "text": "Love this immersion blender. I have used it to purée soup. The chopper attachment is great for quick chopping onions and garlic. I have not used the potato ricer or whisk but based on how well the chopper works , I’m sure I will be pleased with that too. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Behrens",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Another fantastic product from Braun",
      "text": "very powerful, easy to clean up and use. love the product and ergonomics",
      "rating": 5.0,
      "verified": true,
      "author": "Joe K",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great for quick jobs",
      "text": "does not blend up as good as blender but really convenient for soups and sauces",
      "rating": 4.0,
      "verified": true,
      "author": "charlie maldonado",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Made in Romania.",
      "text": "As good as it is made in Germany. Ideal for small kitchen. Chops quick. Easy to clean. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "catpaws ",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Totally worth it",
      "text": "My wife loves this piece. Totally worth it and has a lot of gadgets that help out!",
      "rating": 5.0,
      "verified": true,
      "author": "Omar Sabbahi",
      "helpful_votes": 2,
      "publication_date": 20181015
    },
    {
      "title": "Just what I needed",
      "text": "Love it, easy to use, very light and powerful, easy to clean. Has a bunch of different attachments!",
      "rating": 5.0,
      "verified": true,
      "author": "Anir",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "The power needs more improvement but overall very good",
      "text": "The price is high but I like it and the quality is excellent but I think the power is weak",
      "rating": 5.0,
      "verified": true,
      "author": "Walid",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "This product is easy to use, and a very efficent.",
      "text": "This hand blender is easy to clean, it is lightweight, easy to use and clean, and a very efficient blender. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mem",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "You need this little helper on your kitchen!",
      "text": "It’s a pretty good blender,can be little more powerful but so far so good. Surprisingly can easy grind a meat,shave ice,make a smoothie, love this vegetable slicer. I made a big butch of butter for pancakes with the whisk easily. Easy to use. Quiet. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Katerina Makidon",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "easy to use",
      "text": "loved it. easy to use, fast. It is one of the best one out there",
      "rating": 5.0,
      "verified": true,
      "author": "Nam Do",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Heavy duty and elegant!",
      "text": "Excellent product and heavy duty ! Blends in seconds . I loved it as it serves my purpose of purée , soup . Doesn’t need much space . The safety button is also an added feature to protect the little hands which are happy to help even when u don’t need 😀",
      "rating": 5.0,
      "verified": true,
      "author": "Deepak Momula Deshpande",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "GREAT PRODUCT",
      "text": "The power behind the unit is wonderful. It replaces a 20 year old product by the same producer. I hope this one lasts as long as the last one. I use mine for all my baking and cooking. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Best Hand Blender I ever bought",
      "text": "1000 times better than any other hand blender I previously bought (I went through a few that really frustrated me)... this one is awesome, I use it multiple times a day",
      "rating": 5.0,
      "verified": true,
      "author": "S. Matar",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Recommend",
      "text": "Don't like the necessity to press two buttons simultaneously, but it's for safety. Except this, everything is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Ilya Kolesnikov",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great kitchen tool",
      "text": "It’s perfectly for smoothies and milkshakes, it’s really handy and easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky Vanna",
      "helpful_votes": 2,
      "publication_date": 20190917
    },
    {
      "title": "Great addition to any kitchen",
      "text": "Very powerful. Great variety. So many uses. love the steel look.",
      "rating": 5.0,
      "verified": true,
      "author": "dcom",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "love this product",
      "text": "Love this product very powerful, and very easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "mona2521",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Overpriced... beware.",
      "text": "Overpriced! Beware and check store prices before buying. This is almost double the price and I cannot return anymore. Easy to clean but blending power is very lacking.",
      "rating": 2.0,
      "verified": true,
      "author": "M Chapman",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Highly recommended!!!",
      "text": "Easy to use and very light comparing what I had before heavy cusinart I’m very happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Monika Maiellano",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "No real complaints",
      "text": "Can't really complain about any of the equipment. Everything works the way it's supposed to and the motor is very strong. Could use a storage container to keep all of the parts together",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Perfect!",
      "text": "Was eye balling it for a long time and finally got it! Love it! The annoying part I'd the power button, but it's just some getting used to process.",
      "rating": 5.0,
      "verified": true,
      "author": "YuliP",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Well worth the price",
      "text": "We love this machine, super easy to use and powerful. Excellent quality, thank you Braun",
      "rating": 5.0,
      "verified": true,
      "author": "Md11skipper",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Very easy and practical",
      "text": "This set really eased my work in the kitchen !",
      "rating": 5.0,
      "verified": true,
      "author": "Sevan T. ",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Braun vs Breville",
      "text": "I had my last Braun for 20 years and loved it. I regifted this Braun and bought a Breville. Such a dif!!! Love my Braun!",
      "rating": 2.0,
      "verified": true,
      "author": "Denise Renken",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Bad qulity,  return more than 2 months still not refund",
      "text": "Bad qulity, return more than 2 months still not refund",
      "rating": 1.0,
      "verified": true,
      "author": "Xingwang Zhou",
      "helpful_votes": 2,
      "publication_date": 20190131
    },
    {
      "title": "Overall good, but some of the additions are not in use",
      "text": "Overall good, but some of the additions are not in use",
      "rating": 4.0,
      "verified": true,
      "author": "Nurdin",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Must have",
      "text": "Went from nice to have to a kitchen requirement. Powers thru most everything and has versatile attachments",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin F. Saenger",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "very good quality",
      "text": "the product is exactly what I needed. you can choose the power and it work great",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Love it. Strong power.",
      "text": "I love it. It has a very strong power to blend and chop.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Does what it says it foes.",
      "text": "Good all round kitchen tool,works well and has 700 watts which can handle limited ice crushing. Makes a great milkshake.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark ",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "I didn't have to strain my sauce after blending.",
      "text": "I used this product for blending sauces. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Adams",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Easy to use and works great",
      "text": "I have blended soups, mashed potatoes and chopped herbs. This product does it all.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorrie ",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Nice kit",
      "text": "I love this kit. Use it all the time. Great flexibility",
      "rating": 5.0,
      "verified": true,
      "author": "Tyson H Flugstad",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Awesome Product",
      "text": "It is a very useful kitchen item. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dava Begley ",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "It was a gift for my son, a computer ...",
      "text": "It was a gift for my son, a computer scientist and a kitchen scientist as well. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "JBH",
      "helpful_votes": 3,
      "publication_date": 20180314
    },
    {
      "title": "i used the older model before, but why you ...",
      "text": "i used the older model before, but why you didn't mention in details it's used on 110 V not 220 V ? now i'm stuck because i'm living in kuwait and it's 220V only. Any suggested solution ?",
      "rating": 5.0,
      "verified": true,
      "author": "MAFA",
      "helpful_votes": 2,
      "publication_date": 20180619
    },
    {
      "title": "Waste of time",
      "text": "Item came with EU plug standard and support of only 220-240V power grid only. Absolutely useless in US.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 12,
      "publication_date": 20180524
    },
    {
      "title": "You do love money and not the public's safety",
      "text": "The reason I gave it a 1 star is because u sold me a product with known cancer causing products.. You do love money and not the public's safety..",
      "rating": 1.0,
      "verified": true,
      "author": "Judith A.Bloom",
      "helpful_votes": 11,
      "publication_date": 20180325
    },
    {
      "title": "The best electric kitchen appliance I've ever owned.",
      "text": "This is a phenomenal product. Far exceeded my expectations. I was able to throw out my blender. My immersion blender which was rated best from Cooks Illustrated doesn't compare to this thing. The fact that the liquid doesn't ride up in the pot is excellent. Soups are entirely putters with three main immersion attachment. There is a potatoe puree/Masher attachment that I thought I would never use, but is actually great. I have never owned an electrical kitchen product that I truly believed improved my cooking - until now. This is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 23,
      "publication_date": 20180108
    },
    {
      "title": "Great hand blender, but skip the food processor attachments",
      "text": "The hand blender itself is AWESOME. I wish I would have bought the set without all of the extra attachments, though, because they are very cheap-looking, and I would not expect them to last long. My advice would be to get just the blender, whisk, masher, and beaker, and skip all of the \"food processor\" attachments, as they're really not worth the extra money.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Hopkins",
      "helpful_votes": 14,
      "publication_date": 20180113
    },
    {
      "title": "Best yet!",
      "text": "I’ve used Braun stab blenders since they first hit the shores here about 40 years ago. Every time they came up with a new model I upgraded because they had interchangeable accessories. This is the best yet with an active movable blade that presses down into the product being blended for a more complete blend.",
      "rating": 5.0,
      "verified": true,
      "author": "GuestStarChef",
      "helpful_votes": 15,
      "publication_date": 20180228
    },
    {
      "title": "Extremely poor choice",
      "text": "I got this because my old Braun set which had faithfully powered me through to the back of beyond in chocolate truffle recipes, soups and smoothies finally died after about 7 years. This one is simply awful: so underpowered it can't emulsify a chocolate caramel banana ganache that is fully melted. What a disappointment. Plus it has this godawful safety feature which makes you click the top and then press the switch to start and then, if you try to lighten the touch, it simply balks. Not worth a dime. I hate it.",
      "rating": 1.0,
      "verified": true,
      "author": "Pete Vanderlaan",
      "helpful_votes": 7,
      "publication_date": 20181212
    },
    {
      "title": "Upgraded",
      "text": "I had a previous model of the braun stick blender. It lasted 12 years until I burnt out the motor (my fault). The upgrade with a more powerful motor and additional accessories is incredible. You need to pay attention to the speed you use (actually paying attention to the manual is important). I tried to shredded cheese on full speed that wont work. I have used all the components including the French fry maker. Absolutely love it all. The mashed potato attachment worked great and gave me light fluffy potatoes. Highly recommend this model. Only thing I wish it was even more powerful, 1000 watt brushless motor and nothing could beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmelo J. Rizza",
      "helpful_votes": 2,
      "publication_date": 20190304
    },
    {
      "title": "This Replacement Braun Mixer etc. Works As Good As our Older Model - If Not Better",
      "text": "Replaced an 18 year old model, which I dropped and broke. I had such good service previously I did not look for other manufacturers. This unit works very well and I suspect we will get close to 20 years service out of this new model. Strong motor with several appliance attachments that come in handy when not wanting to break out the food processor.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200119
    },
    {
      "title": "High quality!",
      "text": "It’s so quiet! I really enjoy using this blender. I don’t use all of the accessories I bought with it. But I’m hoping I will start to use them more!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 7,
      "publication_date": 20180313
    },
    {
      "title": "Great immersible blender",
      "text": "I love the tech of the blender well made, it looks like the manufacturer spent all the money to develop the blender and had no additional funds to make noteworthy accessories to go with it. It's such a shame the high-end blender stuck with second-hand flimsy plastic containers, the moment you drop one it will crack.",
      "rating": 4.0,
      "verified": true,
      "author": "edwin f ortiz",
      "helpful_votes": 4,
      "publication_date": 20180821
    },
    {
      "title": "NOT Made in Germany (Misleading Marketing)",
      "text": "Although the box and packaging display a German flag with word something like \"German Reliability\", this is quite misleading as the product is actually Made in Romania. Considering Braun is a German company, Display a German Flag suggesting it's German Product, and charging a premium price, this product is not honestly marketed.",
      "rating": 3.0,
      "verified": true,
      "author": "FreeMinded",
      "helpful_votes": 3,
      "publication_date": 20190102
    },
    {
      "title": "Can't praise it enough!",
      "text": "I haven't tried every attachment yet, but so far I am loving: 1. The immersion blender, which is fast and efficient with very little splashing. 2. The potato masher, which makes perfect fluffy mashed potatoes in no time at all. 3. The food processor works very well for a smaller, lightweight attachment. If i needed to do a larger, heavy duty job, I'd haul out the cuisinart. But this is easier and can do almost any job I'd typically do. So far I've only used the small grater blade so I can't comment on the others. 4. The blender makes perfect smoothies.",
      "rating": 5.0,
      "verified": true,
      "author": "An Amazonian",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "The induction unit is Awesome but most the accessories Junk. Poor Quality plastic",
      "text": "The main unit is of very good quality but most the other stuff is cumbersome and takes a whole cabinet to store. DOn't throw all parts in the sink with water as one of the top pieces for the food processor will fill with water and then take days to leak out. I just purchased a breville food processor and its plastic pieces are all top notch. The plastic pieces for this unit are equivalent to child play toys and maybe worse. I will keep the unit and some of the accessories and the rest are going in the trash bin.",
      "rating": 3.0,
      "verified": true,
      "author": "ASE Technician",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Awful",
      "text": "The dome of the immersion shaft seems to have a nonstick coating -- this already was enough for me to send it back. But also, every accessory has a different lid (lazy designers?) so there are just too many different parts, and half of the parts cannot even be put in the dishwasher. Wouldn't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "DCreviewer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "German Quality",
      "text": "This mixer is absolutely worth it’s money. Braun is a good German form, that produces quality appliances for a lot of years. The handheld mixer has extrem power, is easy to operate and the way it is built, it doesn’t splash anywhere. It does a fine job with the blade as well. Depending on how long and how strong you use it, it will cut whatever you will into sizes you want. I totally recommend this product. I just wish, it would have had all the extras when I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Frosch69",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "This thing is strong",
      "text": "I uswd to have one while li ing outside the US and I LOVED IT. That one was 900w. This one was 700w but still very powerful. I still love it. Glad I bought it again. Wish price was a little lower and that it came with a clear platic box to hold all the bits and bobs but otherwise very happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "JFLYER",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "The more power the better.",
      "text": "Bought for husband. He bakes. Replaced Braun we had over ten years, so bought this one. Hope it lasts like the old one. Works great. Very sturdy and blends nice. If ordering on line, look at many sites for best price. Not too noisy. Powerful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "2x the power does the trick",
      "text": "Straight five stars for this powerful blender that shames all the other ones as toys. Had a couple no names and less powerful name brands over the years- the all fail, sometimes at simple tasks. Not this baby.",
      "rating": 5.0,
      "verified": true,
      "author": "nadanix",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Bought one for each brother as Christmas gifts.",
      "text": "This deserves a plus sign for each category. Bought these as Christmas presents for both of my brothers. They even raved on more than myself. Should have an extra star category for gift ideas!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great design and cleans easily",
      "text": "This is a great addition to my kitchen. I use it to make soups, rouille, chimichurri, protein smoothies, stuffing, etc etc. It is a wonderful product that is super easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Bob",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Fault after 3 weeks but I give it a try",
      "text": "It was broken but a plastic white piece from a another part got stucked in the motor head. I couldn't remove it. I still like this blender and I decided to give it a try after my return.",
      "rating": 4.0,
      "verified": true,
      "author": "Nigel Pham",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Really enjoy the versatility of this blender!",
      "text": "I've made whipped cream with the whisk, mayonnaise and aioli with the blender, and peanut butter, hummus and general chopping with the bowl. Works better that I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "mitziplat",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Space saving versatile kitchen tool.",
      "text": "Travel with husband's job in 5th wheel and braun multiquick is a must have. Takes up small space considering it can do so many things. My only wish is that I could have the 1,000 watt that folks i in UK can get.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Works really well! Glad I chose this.",
      "text": "SUCH a great all in one product! It does everything and packs away so neatly. You literally have a tool for everything you could think to do in the kitchen. Have used it a load since buying & am thrilled. I read so many reviews for various options & am happy I settled on this one. GREAT product!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Di & Eugene Venter",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "It so heavy",
      "text": "I return this item because it was heated when working even short time.",
      "rating": 2.0,
      "verified": true,
      "author": "Alesia",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Well worth the money",
      "text": "I purchased this to make baby food. It been working very well with a powerful motor. It blends everything in fine consistency. This machine puts other baby food makers to shame.",
      "rating": 5.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Weighty but pretty.",
      "text": "It's heavy, but easy to clean and works well. I don't have any problem with the switches as some have mentioned just need to pay attention.",
      "rating": 4.0,
      "verified": true,
      "author": "Ro Germaine",
      "helpful_votes": 0,
      "publication_date": 20180611
    }
  ],
  "product_meta": {
    "title": "Braun 5-in-1 Immersion Hand Blender, Powerful 700W Stainless Steel Stick Blender, Variable Speed + 6-Cup Food Processor, Ice Crusher, Whisk, Beaker, Masher, Faster, Finer Blending, MultiQuick MQ9097",
    "description": "Style:MQ9097The revolutionary MQ9 hand blender blends ultimate power with unlimited versatility to turn the toughest ingredients into the most delicious creations. The breakthrough technology in Braun next-generation hand blender delivers groundbreaking innovations to let you easily express your culinary vision. The world's first active blade technology incorporates a flexible shaft that moves the blade up and down. The result is a 250% more active cutting surface to work with which results in 2 times finer blending. This motion gives you flavorful, smooth results with no unwanted pieces while requiring up to 40% less effort than traditional blending shafts. The power bell plus features an extra milling blade to blend large pieces of food more easily. Advanced splash control technology prevents splashing and delivers the best blending results to keep you and your kitchen clean. Additionally, the MQ9 provides 55% less suction for effortless handling and perfect control. With Braun Smart speed technology, you can intuitively adjust blending power without stopping. Push gently for coarse results and apply a little more pressure for more power and finer results. Plus, the smooth start feature prevents jolting on startup. The hardest foods stand No chance with the 700-watt MQ9 hand blender. With multiple attachments, including a blending wand, a whisk, a masher, a beaker, a 1. 5-Cup mini chopper and a jug blender, it is the game-changing kitchen appliance that lets you effortlessly tackle the most challenging jobs. Compared to Braun MQ500. Compared to Braun hand blenders with non-ACTIVE blade shaft.",
    "rating": 4.4,
    "feature_bullets": [
      "The world's first active blade technology incorporates a flexible shaft that moves the blade up and down. This motion gives you flavorful, smooth results with no unwanted pieces",
      "Advanced splash control technology prevents splashing and delivers the best blending results to keep you and your kitchen clean",
      "The power bell plus features an extra milling blade to provide more slices per rotation, blending large pieces and hard ingredients more easily",
      "With the easy click plus system, You can quickly change attachments as you prep. It gives you the versatility to blend, chop, whisk, mash, crush, and puree ingredients effortlessly",
      "Adjust blending power without stopping with the squeeze of a button. Push gently for coarse results and add more pressure for finer results. The smooth start feature prevents jolting on startup",
      "Attachments included: 20 fluid ounce beaker (BPA free), whisk, 1. 5-Cup chopper, masher, 6-cup food processor, jug blender/ice crusher"
    ],
    "specifications": {
      "Product Dimensions": "2.68 x 2.68 x 16.14 inches",
      "Item Weight": "2.02 pounds",
      "Manufacturer": "Braun",
      "ASIN": "B0757TMGJ5",
      "Item model number": "MQ9097",
      "Customer Reviews": "4.4 out of 5 stars754 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#30,237 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 5, 2017"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Hand Blenders",
      "Blenders",
      "Kitchen & Dining"
    ],
    "price": 199.95
  }
}