{
  "website_summaries": [
    {
      "verdict": "Considering the reasonable price, chances are you'll be impressed with the performance and features the Ultra-Stick has to offer.",
      "pros": [
        "Powerful 500-watt copper motor",
        "Contoured handle is comfortable in the hand",
        "Nine speed settings",
        "Affordable"
      ],
      "cons": [
        "Somewhat noisy",
        "Bottom part of the blender gets warm to the touch",
        "Blade has been known to fall off during use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I bought it hoping that it would ease the mess that I hate to clean when I make smoothies",
      "text": "This is a highly efficient blender. I'm an extremely ineffective user. I bought it hoping that it would ease the mess that I hate to clean when I make smoothies. So... it's me, not the blender. I guess I have to put less in the jar AND not turn on the blender until the blades are submerged to avoid spraying smoothie all over the kitchen. But, the blender is powerful enough to send a poorly-assembled smoothie mix to all ends of the kitchen and dining room. Once the volume of the jar's contents was low enough, the blender worked to produce a wonderfully smooth and deliciously blended smoothie. Now for the cleanup.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfymom",
      "helpful_votes": 681,
      "publication_date": 20180918
    },
    {
      "title": "Excellent immersion blender",
      "text": "Worked great, feels sturdy, took on boiling temperature to blend, but the top of the shaft stayed cool. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Nol",
      "helpful_votes": 639,
      "publication_date": 20180708
    },
    {
      "title": "Powerful, but not what I needed.",
      "text": "Pretty good blender for the price. A lot larger than I expected. I bought it to make smoothies with when I’m traveling. I’ve seen sone YouTubers using these. However, this one is different. Very hard to clean, in my opinion. If you are looking for power, it definitely has that. Just don’t expect to fit it down into a drinking glass for a small smoothie. Nice mixing head that came with it!!",
      "rating": 3.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 411,
      "publication_date": 20181102
    },
    {
      "title": "Amazing blender!!",
      "text": "Amazing blender! I've had other (cheap) models of immersion blenders. While they did what they were supposed to do, they did not have quality that this Mueller one has. I absolutely ADORE that the piece that does the work is all stainless, not cheap plastic. I use mine mostly for doing soups, and it does a wonderful job even on 'tough' kohlrabi. I highly recommend this to anyone looking for a GOOD immersion blender!",
      "rating": 5.0,
      "verified": true,
      "author": "Judy D.",
      "helpful_votes": 478,
      "publication_date": 20180312
    },
    {
      "title": "I can't say enough good things....",
      "text": "Just bought and used this within the last week and I LOVE it! Have intended to get a hand blender for years and finally just did it. I looked at ones that were much more expensive and was worried that this would be cheaply made (because you often get what you pay for). However, I have been pleasantly surprised with this one. At 500 watts it has serious power and it is super easy to use. I made tomato soup and it blended it in under a minute, then I just popped the bottom off and washed it! Super simple. Super happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "amazonaddicted ",
      "helpful_votes": 503,
      "publication_date": 20180129
    },
    {
      "title": "Expensive hand mixer but a complete bust in quality.",
      "text": "Purchased this for mixing my soap mixes. Keep in mind that when I combine the materials they have the thickness of a thick soup or pudding, and the housing NEVER touches the mixture, so there couldn't have been corrosion of any kind. I also thoroughly cleaned and put the mixer back in the box after the first use. Went to use in this hand mixer the second time in a month and as soon as I started mixing the mixer fell apart, and the plastic housing that houses the gear can be seen in the pictures above. It just fell apart without any extra stress or heat.",
      "rating": 1.0,
      "verified": true,
      "author": "Flaskk",
      "helpful_votes": 266,
      "publication_date": 20190221
    },
    {
      "title": "Great for soap making",
      "text": "Great blender. High quality and fast shipping. I needed this for soap making.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Mocuta",
      "helpful_votes": 350,
      "publication_date": 20180116
    },
    {
      "title": "Warning! Choking hazard!",
      "text": "Warning!!! After using this blender 5 times the blade came off in my drink, thankful I noticed it and didn’t choke on it. Be very cautious, blender worked great before this.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Roberts",
      "helpful_votes": 418,
      "publication_date": 20180509
    },
    {
      "title": "Excellent product, i like the stainless steel blade housing ...",
      "text": "Excellent product, i like the stainless steel blade housing so i don't have to immerse plastics in my hot food. The motor is very powerful and I appreciate the variable speed function. The design is very sleek and comfortable in the hand.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Z. Savit",
      "helpful_votes": 199,
      "publication_date": 20180117
    },
    {
      "title": "Powerful",
      "text": "This item works great and feels like it is quality made. More than powerful enough for anything we have thrown at it. I'd advise to go a bit less than you think you need to and check because it will blend things very quickly. My only complaint is the bottom of the blending attachment is quite sharp metal and can easily damage pans with coatings on them. I would have liked to see more of a bevel on the edge that would be making contact with your cookware.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather Catface",
      "helpful_votes": 137,
      "publication_date": 20181130
    },
    {
      "title": "Made In China!!",
      "text": "NOT European quality as expected, sorry?? When running, it makes MORE noise than my garbage disposal when it's running!! Instructions also state \"use for 1 minute maximum or internal damage may occur\", really?? It feels sturdy and includes a wisk but I've got to believe the negative reviews now cause the ONLY thing \"European\" is the name I think!! Bought this with the Cusinart which is far superior and has exact same cord length and this one goes back for sure and I'm keeping the Cuisinart for sure!",
      "rating": 1.0,
      "verified": true,
      "author": "Misterart",
      "helpful_votes": 130,
      "publication_date": 20181128
    },
    {
      "title": "Very disappointed, scary",
      "text": "It only lasted four months. The blade broke off in my breakfast shake. Thank god it didn't break into tiny pieces that I may not have seen.",
      "rating": 1.0,
      "verified": true,
      "author": "Loral F.",
      "helpful_votes": 120,
      "publication_date": 20181016
    },
    {
      "title": "Keep looking.",
      "text": "Two months old and coming apart. External construction is excellent. Intenal component that broke apart is cheap brittle plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 88,
      "publication_date": 20181120
    },
    {
      "title": "Just got it",
      "text": "I just got my Mueller Ultra-Stick. I used it for the first time today. I used the whisk attachment to make home made whipped cream. The one thing I have to say is if you don't lock the attachments tight, you can burn it up. I did not make sure the whisk was locked in place and it came off while I was using it and I noticed some burnt plastic pieces came out as well. It seems that it is ok but I was concerned I had ruined it on my first use.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 49,
      "publication_date": 20190112
    },
    {
      "title": "Whip only light stuff",
      "text": "My wife loves this thing. Does whipped cream, fluffing you name it. The only day I try to use it, is the day it breaks. Do not try to whip mashed potatoes with the whisk; the whole whisk came apart. Also, water can get trapped inside the whisk head (dirty water can drip into your stuff). Bummed I could not just replace the whisk. Buyer beware! I ended up having to buy a new set. I don't blame the company, my mashed potatoes were just too viscus but the dirty water did concern me.",
      "rating": 4.0,
      "verified": true,
      "author": "Prime Member",
      "helpful_votes": 49,
      "publication_date": 20181227
    },
    {
      "title": "Broke with in a month",
      "text": "Not only does it get extremely hot ( I mean burn your hand hot) with in a few seconds of using it, it broke within a month. The whisk attachment completely fell apart, un-repairable.... do not waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia Dulaney",
      "helpful_votes": 48,
      "publication_date": 20190103
    },
    {
      "title": "It works great and it is so much easier than lugging out ...",
      "text": "This powerful little blender chopped up an onion and frozen peppers with ease! It works great and it is so much easier than lugging out the big blender. Much easier to clean, too!",
      "rating": 5.0,
      "verified": true,
      "author": "RS",
      "helpful_votes": 30,
      "publication_date": 20180117
    },
    {
      "title": "Dangerous- blade and nut left in bottom of drink",
      "text": "I never write reviews but I have to for this item. I liked this product until a couple of mornings ago when I was blending my instant breakfast and banana drink before work. Fortunately I didn’t stick the mixer into a cup of water to soak while I drank my drink, which I sometimes do. I rinsed it off and something caught my eye, and then I noticed there was no blade in it. I poured my drink out through a colander, and sure enough, the blade and nut were in my drink! I shudder to think what would have happened if I had drank it with the sharp blade in it. I returned it today.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Aschenbrener",
      "helpful_votes": 24,
      "publication_date": 20190724
    },
    {
      "title": "Melted plastic/broken with first use",
      "text": "This broke the first time I used it. It started making weird noises and the whisk began spinning unevenly. I took the attachment off and three melted-looking black plastic pieces fell into the oil I was mixing. I would avoid this brand. I’m not even sure if I can return this now that I’ve used it. Pretty annoying...",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Gordon",
      "helpful_votes": 29,
      "publication_date": 20181108
    },
    {
      "title": "Amazon wouldn't allow me to write a negative review",
      "text": "This broke the second time I used it. I was surprised because this was an \"amazon choice\" item with SO MANY five star reviews. Aaaaaaand then I tried to write a bad review . . . . and Amazon wouldn't let me. I tried several times over the next few months; every time Amazon fed me a message saying that they were unable to receive my review. (Ah, convenient) I'm going to be honest - I'll have a hard time trusting amazon reviews again. meh.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua Paul Smith",
      "helpful_votes": 23,
      "publication_date": 20190630
    },
    {
      "title": "Private chef dissatisfied",
      "text": "I was so happy to receive this dual hand blender about 3 months ago and as a private chef I was hoping it was top quality. I’ve used it 9 times and the wisk/blending attachment has already fallen apart with all the internal mechanisms completely falling out and into the food I was making. One second I was making a really expensive cognac whipped cream the next second it was in total pieces. Extremely disappointed as this item was at premium pricing and now unusable",
      "rating": 1.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 19,
      "publication_date": 20190617
    },
    {
      "title": "Rock Solid and muscle motor!!!",
      "text": "We have have wanted a new hand blender for a longtime but just couldn't pull the trigger on a new one. Our very old antiquated one died years ago. My wife wanted to make some recipes that uses one so I searched Amazon and this looked perfect. It arrived and right out of the box you can tell how solidly made it is especially compared to our old plastic one. Used it several times now and I am sold. Does everything you need and has super strong motor. Love the attachments. I would definitely buy this model again and think I will get a couple for gifts for the holidays later this year. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "RobCee",
      "helpful_votes": 17,
      "publication_date": 20190118
    },
    {
      "title": "Might be a great blender, died on the third use.",
      "text": "I purchased this a few months ago and used it for one or two protein shakes. It’s been in a drawer until today when I got it out to make mayonnaise, and it died. Pretty disappointing. Won’t purchase this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Priscilla Hafer",
      "helpful_votes": 20,
      "publication_date": 20190207
    },
    {
      "title": "Sturdy, well made",
      "text": "Appears to be very well made and much sturdier than others we've had in the past. Fairly quiet operation as well. I think this will serve us for a good long time. Very pleased so far",
      "rating": 5.0,
      "verified": true,
      "author": "mainsail",
      "helpful_votes": 20,
      "publication_date": 20180117
    },
    {
      "title": "Product stopped working after one year. Definitely not Austrian!",
      "text": "It worked reasonably for a year, then the motor simply stopped working. It should be pointed out that, as far as I can see, this product doesn't have any \"Austrian\" roots or has any superior European quality. Its label also says \"Made in the PRC\" (People's Republic of China). I couldn't find this company, which is registered in Florida, or any of its \"products\" in Austria or in Europe. It seems to be a US trading company for goods made in China which uses the label \"Austrian\" to suggest a higher quality product. Buyers beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Ad Astra",
      "helpful_votes": 13,
      "publication_date": 20190919
    },
    {
      "title": "Will not work for frozen fruit or ice",
      "text": "I bought this to do the smoothies or shakes I have to have daily (the things you can \"hide\" in a smoothie to cover the taste is extensive) and wanted something easier to clean than the regular blender. This was a huge disappointment as it would not work at all against chunks of frozen fruit (softer than ice cubes) or ice cubes either. It would just jam up against the fruit pieces and whine, even at highest power. Hubby tried to do a shake with firm ice cream and it also lagged down on that to the point of not working. Sending it back and will just stick with the blender.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Milner",
      "helpful_votes": 13,
      "publication_date": 20190524
    },
    {
      "title": "Stopped working after only 2 and a half months",
      "text": "The motor stopped working after 2 and a half months of minimal use, and only short bursts to blend things like milkshakes and soups. It also didn't form the suction flow very easily. When I bought it, I figured the Amazon top pick/best seller meant something but I guess don't trust what you read online. Edit: extra stars because customer support reached out after reading the review and sent a new one. I didn't even need to send the broken one back. Hopefully it was just a defective one.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheng",
      "helpful_votes": 17,
      "publication_date": 20181113
    },
    {
      "title": "Good quality for a low price",
      "text": "This product exceeded my expectations for such a low price point. The top part of the handle felt reasonably heavy and right in my hands. This showed that the material of it was not cheap. The stainless steel blender portion is made of stainless steel, so be sure to dry it after washing it. The speed of the blender is extremely diverse and will help blend almost anything imaginable. Including the whisk is a plus, and it can be used for much gentler mixes such as cake batter. This product is extremely easy to use and convenient to clean up, and I look forward to using it more.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 20,
      "publication_date": 20180507
    },
    {
      "title": "A great value - everything you need, nothing you don't",
      "text": "This is a well built, solid kitchen appliance that comes with but one accesory - the whisker. Unlike the name brand competitors that sell for more, but have tiny motors and tons of plastic packaged with them. This unit has a 500W motor, one of the most powerful available. And that power can be felt using it, it does not bog down under thick blends. The blade detaches easily, is all stainless on the business end, and easy to clean. A no brainer at the price - easily better than models I compared to at more than 2x the price.",
      "rating": 5.0,
      "verified": true,
      "author": "DIYBob",
      "helpful_votes": 9,
      "publication_date": 20181208
    },
    {
      "title": "Wish it was more powerful",
      "text": "I purchased this after my Cuisinart blender bit the big one. I'd have to say I liked my Cuisinart blender better, but this works as well. It's lightweight and has an easy twist off for cleaning. The whisk attachment is pretty handy as well. Unfortunately it just doesn't have quite the power I would like for smoothies, it ended up leaving ice chunks or chunks of fruit in the smoothie. I definitely have to use it longer to get the same results as my last one. This doesn't come with a blender cup, but a wide mouth quart Mason jar works just as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 11,
      "publication_date": 20190412
    },
    {
      "title": "Flimsy product that won't last. Bad customer service.",
      "text": "Feels flimsy and cheap. Made in China, but the whole listing makes you think it's European. Instructions say not to use it on high setting more than a fee seconds. Difficult to clean. Comes with a brochure telling you can choose a free gift. They make you message some bot, then stop responding to you. According to their FB page, this happens to a lot of people. Ultimately I am returning this because I doubt it will last more than half a year. Will pay a little more for a reputable brand with a sturdy product.",
      "rating": 1.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 9,
      "publication_date": 20200113
    },
    {
      "title": "Hazard. Should have paid attention to poor reviews",
      "text": "I wish I would have paid attention to the negative reviews. Like many others, the blade fell off into my shake on the fourth use. It had great speed, appearance and ease-of-use but that is all useless when it breaks as soon as you start using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeana",
      "helpful_votes": 13,
      "publication_date": 20190716
    },
    {
      "title": "Weak sauce blade, Broke off after three uses on day one.",
      "text": "My wife picked this up on a whim and we quickly realized how cheap this product is. After three liquid blends within an hour, the blade fell off. Not acceptable for a brand new product. Again, the blade FELL OFF after blending water and protein powder mix. Not ice, food, or any substance that is thicker then water. No bueno.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam P.",
      "helpful_votes": 13,
      "publication_date": 20190717
    },
    {
      "title": "Worked well for awhile, then cheap part broke",
      "text": "Sadly, there is a tiny plastic part where the base fits onto the stick that broke after a short time of use. Would love to replace this part if possible so I can keep using. I would advise a higher quality stick as I’ve been disappointed. Review Edit: After reviewing product, the company contacted me to refund product and ship a new one. They were very kind and efficient. Excellent Customer Service!",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie Pinter",
      "helpful_votes": 11,
      "publication_date": 20190708
    },
    {
      "title": "Disposable Immersion Blender",
      "text": "This product was great when I first got it. Only really used it for potato leek soup and it did a great job of blending, never had an issue with the durability other users had. Fast forward two months later and the motor is gone. The unit powers up but it doesn't do anything no matter what buttons I push. Next time I'm going to spring more for a more reliable blender for sure because this one is trash now.",
      "rating": 1.0,
      "verified": true,
      "author": "MSGPresident",
      "helpful_votes": 10,
      "publication_date": 20191129
    },
    {
      "title": "Way too powerful!!",
      "text": "I purchased this to make avocado oil mayonnaise and 4 out of 5 times it has “broken” my mayo. Fixing “broken” mayo is exhausting! This is just far too powerful even on its lowest setting. I used the whisk attachment to make whipped body butter and it splattered all over. Do yourself a favor and just get one with less power. Maybe a 300 Watt instead of this 500 Watt blender. Wish I hadn’t missed the return window, I’d return it in a heartbeat.",
      "rating": 1.0,
      "verified": true,
      "author": "Karisa",
      "helpful_votes": 10,
      "publication_date": 20191221
    },
    {
      "title": "I just used my hand blender yesterday and I love it! I never used one before so I ...",
      "text": "I just used my hand blender yesterday and I love it! I never used one before so I wasn't sure if the other positive reviews would match my expectations. I made lasagna for my family and while making the red sauce I needed to blend in onion, red pepper and chard (the recipe called for spinach but I didn't have that on hand). The stick blender made fast and fun short work of this task. Clean up was a breeze as the bottom detaches from the base and into the dishwasher it went. Will be recommending this to my coworkers as we all enjoy cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 8,
      "publication_date": 20180729
    },
    {
      "title": "Powerful enough",
      "text": "I bought this to replace another brand that wasn’t as good as it claimed, but this was is. My first kefir breakfast smoothie was blended in about 20 seconds. I thought I wouldn’t like the “turn to disconnect” feature due to my arthritic hands. To my surprise it was easy and then it rinsed clean instantly. I have used the whisk but had trouble. There was too much power and even turned to lowest speed it sprayed eggs out of my bowl. Guess I need to find a better bowl.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader1",
      "helpful_votes": 6,
      "publication_date": 20190507
    },
    {
      "title": "Broke quickly.",
      "text": "Just dropped this down from a 5 star. Was awesome, had lots of power. Bought this for the wife for Christmas. Here is is only February and the wisker part of this broke. The 2nd time she was using this it had a burning oder. Removed the wisker attachment from the motor and found a rubber gasket fell out and was torn up. We are talking only about 5 minutes maybe of actual run time and the gasket failed. A real bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Relyea",
      "helpful_votes": 7,
      "publication_date": 20200221
    },
    {
      "title": "Afraid to use again...",
      "text": "This unit got so hot that the bottom of my palm was burned slightly. I unplugged after a minute of use and set to the side but was shocked that it got even hotter than that after 5 minutes leaving it alone!!! I left it outside in case it explodes. Very scared to use the Ultra-Stick again.",
      "rating": 2.0,
      "verified": true,
      "author": "J B",
      "helpful_votes": 6,
      "publication_date": 20191218
    },
    {
      "title": "Failed the test of time.",
      "text": "I don’t usually write reviews but when a product doesn’t even last through the first year it feels like civic duty to warn others. This stick blender worked ok, but only for about 9 months of semi regular blending of fruit smoothies. Bought in January 2020 broke in October 2020. You can see in my photos that the internal mechanism shattered into pieces today while blending a smoothie.",
      "rating": 1.0,
      "verified": true,
      "author": "Sia",
      "helpful_votes": 6,
      "publication_date": 20201011
    },
    {
      "title": "Wrong parts was sent!!!",
      "text": "The blender is OK but the attachment like the egg whisk and milk frother are wrong parts...they cannot be attached because the connector is totally different design. I assume the manufacturer made mistake when packing. The blender power is OK but it's stressful when you tried many times but still cannot attach the part. Order replacement may not help either, wish this review can help me to be contacted by the Customer Representative.",
      "rating": 1.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 5,
      "publication_date": 20200103
    },
    {
      "title": "Not great for smoothies",
      "text": "I got this to replace my Braun blender that finally wore out. This seemed like a good option but I didn’t like it from the beginning. I used it to make my morning smoothie. It didn’t manage power greens and didn’t consistently blend frozen berries, resulting in a chewy, chunky smoothie. I tried to be patient but finally returned it as it didn’t fit the need I have. I’ll go back to my blender",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth J. Monden",
      "helpful_votes": 7,
      "publication_date": 20191009
    },
    {
      "title": "powerful",
      "text": "I liked that it was much easier to hold the power button than the cuisinart I bought from Bed bath and beyond and so far it seems so much more powerful..One of the things I wanted it to do was blend up dates with butter for the sugar free cookies I make..have not tried that yet but the egg salad I made was a breeze..It has 500 amps as opposed to the 300 that the cuisinart had and over heated really quickly in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill McAnally",
      "helpful_votes": 3,
      "publication_date": 20190509
    },
    {
      "title": "almost too much power",
      "text": "I've used this twice so far (sweet potato puree and humus) and it was amazing! It almost has too much power at times which causes and sucking/seal at the bottom of a glass container but this also helps create fast/smooth textures. Quality of parts appears great and is easy to clean by running the blade in a small container with soap/water. I do however wish the electrical cord were a little longer for more ease of use/cleaning at times.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Peacock",
      "helpful_votes": 3,
      "publication_date": 20190417
    },
    {
      "title": "This baby has \"substance\"!",
      "text": "Really gets the job done regardless of delicacy or power needed for the job at hand. Adjustable to suit your needs. Ice...no problem. Smoothie...a breeze. Puree, pesto, herbs, you name it. Love it. Comfortable, though hefty in hand, it performs as desired. Has the heft and design of a durable product I was looking for. My only request would be a wall bracket to mount it. I'm sure I would be much more inclined to use it if it was that handy.",
      "rating": 5.0,
      "verified": true,
      "author": "PHILLIP",
      "helpful_votes": 3,
      "publication_date": 20190220
    },
    {
      "title": "Solid--Just Solid.",
      "text": "We used to have another manufacturer's immersion blender, but found we could overheat it in frequent use. That, plus the blade cracked out of warranty. Mueller's blend, by contrast, appears to 20-30% heavier and more durable. Ran it thru some common kitchen tasks and it passed with flying colors. Would I recommend it? Yes. It's a solid unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20181201
    },
    {
      "title": "Very well built",
      "text": "Bought this as a gift for my wife, I would of given it five stars if I had used it more before reviewing. As soon as you unbox the product you notice it’s construction, it feels like you could fight off a wild animal with it. Very impressed with this product and look forward to using it more.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Parrish",
      "helpful_votes": 4,
      "publication_date": 20190112
    },
    {
      "title": "I like the compact and sleek build and it takes up ...",
      "text": "This product came quicker than expected!! I like the compact and sleek build and it takes up little space. It's lightweight but strong enough to blend food in seconds and it takes me less time than with a regular blender to clean up afterwards as well. It works out so well for me, I have no longer use for my bulky regular blender. Makes smoothie making so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "ClwrKaren",
      "helpful_votes": 6,
      "publication_date": 20180312
    },
    {
      "title": "Great Product and Well Made",
      "text": "Great item to have when cooking. If you want to chop up ingredients or best of all make your own tomato sauce it will dice or puree whole tomatoes right in the pot while you saute them. Get the most flavor out of your ingredients. Makes using fresh vegetables a breeze and reduces cooking time. Powerful motor does not bog down and wide speed range for any operation. Best stick blender and best bang for the buck.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Mort",
      "helpful_votes": 4,
      "publication_date": 20190106
    },
    {
      "title": "While it worked it was great... But then it died.",
      "text": "It lasted exactly one year. I went to see when I bought it and it died on me exactly 1 year after I bought. Worked while it did but then the blade started moving around and I think the attachment part was wearing down. Oh well....they just don't make things like they used to.",
      "rating": 1.0,
      "verified": true,
      "author": "Livingonadime",
      "helpful_votes": 6,
      "publication_date": 20190503
    },
    {
      "title": "Sorry I purchased this",
      "text": "The instructions warn you not to blend for more than a minute or the motor might overheat. Really? I was blending something the other day and had to keep stopping every minute because the motor was, indeed, getting very hot. This seems like a serious design flaw and an under powered motor. I would not recommend the blender to anyone, because it fails at its one primary function.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Smith",
      "helpful_votes": 5,
      "publication_date": 20190502
    },
    {
      "title": "Small plastic parts broke off during third use",
      "text": "Pro: Great power Cons: 1. small black plastic parts broke off during third use 2. Blade Guard has no openings, resulting in a strong suction to the bottom of the container. 3. The connection to the motor end by twisting is not secure, the shaft can fall off very easily. I'm returning it. Very disappointing for such a highly rated item.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Carlson",
      "helpful_votes": 3,
      "publication_date": 20201012
    },
    {
      "title": "Sub-par engineering, I’ve had two break in under a year.",
      "text": "The first time I bought this product six months ago, it was great at first but then completely burned out making a basic smoothie. I assumed in unluckily recieved a defective product. Not a problem, I ordered another. But yet again, the new one has also rendered itself completely ineffective less than one month in. This time, there is a screw holding the blade in that comes off. Multiple times I had to spend my morning rescrewing it back in while my smoothie went bad. Tonight, it finally stopped taking the screw in general. In summary, this product has sub-par engineering. Two have broken on me and the most recent lasted less than two months.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 5,
      "publication_date": 20190730
    },
    {
      "title": "Not what I though. Does not do the job or I got a not shark blades blender.",
      "text": "I was disappointed with this blender. It does not do the job. It does not purée but leaves the chunks of food. It takes a long time to blend. The result is still not great. I can use it only for something I can use the fork to stir. It’s a waste of time and money. The stick is not strong enough for stirring purposes either if I am making easy to whisk recipes.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 5,
      "publication_date": 20190509
    },
    {
      "title": "It was good, then it died with 9 months of mild use.",
      "text": "I purchased this thinking Müller was a reliable brand, unlike so many flimsy products out there... It's a great disappointment that blending smoothies on a weekly basis (fruits, juice, nothing crazy) beat this machine. It stopped turning on completely. There was NO burning smell or anything - it was a fulminating death. It didn't last one single year...",
      "rating": 1.0,
      "verified": true,
      "author": "Ana S",
      "helpful_votes": 4,
      "publication_date": 20191003
    },
    {
      "title": "Ease of use!",
      "text": "I bought this product to make protein shakes. I hate to have to use the blender, because I have to clean all the components after every use. I don't use the shaker cups, because there's always clumps left over. This machine is an awesome alternative. It mixes all the powder very well and it is a breeze to clean. Then you can put it away in the drawer. Just make sure that you hold the cup well. It has a ton of power.",
      "rating": 5.0,
      "verified": true,
      "author": "Octavio Gonzalez",
      "helpful_votes": 3,
      "publication_date": 20190130
    },
    {
      "title": "Blades fall off in less than 6 months - twice?",
      "text": "I liked this immersion blender until the blades fell off. The first blender I had less than 30 days. The second one I’ve only had four months. The blender has good blending power, is easy to use and easy to clean but I would never recommend this blender to anyone. My very first immersion blender made by another manufacturer lasted me three years and the motor wore out on it. Less than 6 months for the same problem is unacceptable. I will never buy another.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon Kuhlman",
      "helpful_votes": 5,
      "publication_date": 20200118
    },
    {
      "title": "Choose a different item if purchasing from the USA matters to you.",
      "text": "Misleading advertising and poor shipping! This product is made in China, not in Austria - I wouldn't have purchased it if I'd known it was made in China. Also, it arrived today, the original box was in a flimsy poly-vinyl envelope! The cardboard box was crushed and there's no way for me to know how much the shipping process may have damaged the product... I didn't buy this so I can return it (& use the warranty)!! This is a big disappointment from the manufacturer AND Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "SGC",
      "helpful_votes": 2,
      "publication_date": 20200528
    },
    {
      "title": "Nice for the price!",
      "text": "We purchased the Mueller immersion blender to replace our dearly departed 15+ year old Cuisinart immersion blender. We use an immersion blender for pureeing soups and the occasional smoothie so we weren't excited about replacing it with a more expensive model at this time (economic uncertainty due to COVID-19 pandemic). We've used our new Mueller immersion blender once so far and it seems to be a very good product. Took a few minutes to figure out how to detach the blade wand from the power unit but it's easy once you know how. Cleaned up beautifully. And, most importantly, it pureed a potato soup like a champ!",
      "rating": 5.0,
      "verified": true,
      "author": "AuntieJ",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Blending power into one!",
      "text": "This immersion blender works really great and I’m happy with the product. I had been contemplating on getting one for some time and I was impressed with the high reviews. It’s been my go to kitchen gadget in making mashed potatoes, cauliflower mash, and purée soups. The dials are intuitive and overall the device is easy to use. Only things I’ve noticed a couple of times is when it gets heated up after a use, the device begins to transmit a burning plastic smell. However, it’s only temporarily and the device continues to function well.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine N",
      "helpful_votes": 2,
      "publication_date": 20200119
    },
    {
      "title": "Double check finger placement before using",
      "text": "dead with less than 5 minutes of used don't waste your money buy a higher quality item. I used it to blend lentil soup. next use bullet proof coffee dead. Wish I hadn't waited over a month in between both uses total waste of money. Edited to say The company contacted me and replaced the blender stick which was very nice. I made another soup no issues so far would recommend short short bursts to make sure the motor doesn't burn out and never use the turbo setting as I noticed my finger's naturally rest on turbo button while holding it. Will double check before using from now on in case that was the issue.",
      "rating": 3.0,
      "verified": true,
      "author": "Dorkaramas",
      "helpful_votes": 5,
      "publication_date": 20181025
    },
    {
      "title": "Great Product!!!",
      "text": "This is my first immersion blender... And it's great! I bought it to make creamy soup easier and to make my own mayo. It definitely gets the job done! I look forward to finding other uses!! I don't see much difference between the regular speed and the turbo, but even the normal speed is incredibly powerful.",
      "rating": 5.0,
      "verified": true,
      "author": "KEYRVA",
      "helpful_votes": 3,
      "publication_date": 20190109
    },
    {
      "title": "Works best for me!",
      "text": "This handheld blender is what I was looking for. It's not too heavy for me (I've had 3 surgeries on my dominant wrist and holding a heavyweight that is moving or vibrating is painful). It is very simple to attach the mixing and whisk parts (yes there is a slight twisting motion but no extreme effort is needed). The recipes I have made using this blender are simple and I was using a regular blender before it so much easier now while making cleanup a breeze. So far I've made protein smoothies with spinach, soaked chia-flax-hemp, ice cubes and frozen fruit with my favorite protein and nut/seed milk. Really great tasting. I'm very happy with this personal blender.",
      "rating": 5.0,
      "verified": true,
      "author": "Miki Harmon",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Two of these broke in TWO years",
      "text": "I really wanted to like this, but unfortunately, reliability of the product is not good. It is super powerful, and super easy to use and clean, but the two I have purchased broke almost exactly a year after purchase. First the plastic but in the power unit broke off, the second time the nut attaching the blade to the blender shaft stripped. Both of those instantly render this useless, so that is a 100 bucks down the drain in two years. Not exactly the reliability I'd like to have from something I use weekly. DO not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "A Hungarian in Texas",
      "helpful_votes": 2,
      "publication_date": 20201007
    },
    {
      "title": "Fooled me, then failed",
      "text": "I haven’t used it yet, but I think it’s deceptive to lead the buyer to think it’s made in Austria, when in fact, it’s made in China. I used it for the first time. I was whisking cream, when the PLASTIC gearbox failed. It began to smell like burning plastic as tiny bits of black plastic flew into my cream. Lasted less than a minute. Wow!",
      "rating": 1.0,
      "verified": true,
      "author": "K. A. Maxwell",
      "helpful_votes": 2,
      "publication_date": 20201011
    },
    {
      "title": "Releases plastic pieces",
      "text": "It mixes well the downside is it releases black pieces of plastic. We made pancakes and found the pieces of plastic when were eating. This was when we used the wisk. I'm glad I havent used it to blend my daughters food. Definately upsetting.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190831
    },
    {
      "title": "Broke! Don’t waste your money!!",
      "text": "I purchased this in August of 2018. It is now April 2019 and it is broken. I use this for soapmaking. I am not hard on it, clean it right away and do not use it for more than 15-30 seconds with each batch I make. The consistency of my batter starts out as soup and then turns to a very thin pudding consistency. I only bring this up to point out that I’m not mixing cement with it. Very disappointed. One more unrecyclable item for the landfill too. This thing should last longer. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20190403
    },
    {
      "title": "Meh, The unit I recieved was not as good as advertised.",
      "text": "I bought this to use as a milk frother for drinks. There were reviews that said it worked really well. Mine did not. It was way louder then my wolf gang puck immersion blender which is on it way out after many years of service. So this unit has been returned. I ended up going to my local thrift store to look for an alternative. I found a used rechargeable dremel type tool. IF you do not know what dremel is think of a large battery powered frother. Bought that for 5 usd. Works better then expected and way quieter. Your Mileage may vary.",
      "rating": 3.0,
      "verified": true,
      "author": "Malinourn",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "It’s one powerful beast!",
      "text": "Over the years I have purchased several Müeller products so I am pleased that they make this stick blender. Actually, I had purchased a separate milk frother last year and was never happy with it, so when I saw that this had a frothing attachment plus a whisk, I knew this was perfect. I am so pleased that it is a heavy duty blender, all metal- no cheap plastic and it is powerful. I use it for canning, making whipped cream, hot soups, making jam, the list goes on. I expect to have this for as long as my other Müeller items have lasted, knock on wood! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Lily Bee",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "pay attention to voltage rating",
      "text": "I could not use it. reason? because it is fitted with a 110 V, 50 HZ motor. where i want to use it (Dubai), the power rating is 220V. why there is no hint to such important issue on the product spec.? one might say \" use a step up transformer\"? but the whole idea in purchase of a hand blender was to use minimum space and attachments.",
      "rating": 1.0,
      "verified": true,
      "author": "dissatisfied with voltage rating",
      "helpful_votes": 6,
      "publication_date": 20190324
    },
    {
      "title": "Powerful with a bit of a learning curve 🤣",
      "text": "This is my first experience with a blender stick. It is bigger and heavier than expected. However, the control buttons are very easy to push. And it's nicely balanced so easy to use. There is a bit of a learning curve (big grin). I guess you're supposed to hold it on top of the coffee. Putting it into the liquid sends it splattering! It is very powerful. So I am looking forward to using it on many new recipes for my new keto way of eating.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Brauer",
      "helpful_votes": 4,
      "publication_date": 20180616
    },
    {
      "title": "WILL NOT FUNCTION",
      "text": "COULD NOT SEPARATE THE MOTOR FROM THE SHAFT IN ORDER TO CHANGE THE MIXING DEVICES IT SHOWS A SHAFT RELEASE BUTTON ON THE BOX BUT IT DOES NOT EXIST....IT IS POSSIBLE FOR HERCULES TO PULL OUT THE SHAFT BUT I AINT HERCULES...SENT BACK",
      "rating": 1.0,
      "verified": true,
      "author": "Herman Rosen  HERMAN ROSEN",
      "helpful_votes": 3,
      "publication_date": 20190917
    },
    {
      "title": "Too Fast - Go Speed Racer Go",
      "text": "Good quality, however, the issue with this mixer is the speed adjustments. There are 8 speeds setting, plus a Turbo button. The lowest speed setting is what I would expect the High speed setting to be. The lowest speed setting is so fast it throws whatever you’re mixing all over the place with the whisk attachment. There is very little noticeable difference between the High and Low setting. If they could fix this speed issue, I would rate it higher, and use it more often.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest Reviewer",
      "helpful_votes": 3,
      "publication_date": 20190328
    },
    {
      "title": "Easy to use and powerful too!",
      "text": "I was making several batches of preserves last summer, peach, strawberry and apple to name a few.. and thought if how much time to could save if I wasn’t cutting all the fruit by hand.. so I just cleaned it all, chopped in big chunks, and put my new immersion blender right in the pot while it cooked.. I got a nice consistency for my preserves with little effort.. very happy with this item and would recommend to anyone looking to make life a little easier.. sellers were great, too! Thanked me for my purchase..",
      "rating": 5.0,
      "verified": true,
      "author": "Rayna",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Fell apart after 4 months, BUT...",
      "text": "Fell apart after 4 months (as in, central rod was loose, blades came off into the food I was chopping). To be fair, I was using this blender twice daily to grind up a half cup of dry dog food. It wasn't on for long, but the matter being processed was not liquid or soft fruit/veggies. Would it have lasted longer if I'd been making smoothies? I'll never know. It was very easy to clean though, and easy enough to use although the cord was a little cumbersome. Will be looking for something specifically for nuts/hard items now.",
      "rating": 2.0,
      "verified": true,
      "author": "Judy Evers",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Hard to clean",
      "text": "Instructions are lacking and buttons are confusing. Power button doesn’t turn off, but rather changes intensity. It is a powerful unit; however, It gets 1 star because it’s incredibly difficult to clean. The black attachment piece that you put the whisk and frother into does not come apart, but of course needed to be cleaned after use. Water got stuck in the piece during cleaning. I find that rather disgusting and a major mold concern. Will be returning. The whisk attachment also fell off multiple times into the food I was making. It wasn’t sturdy enough to mix with.",
      "rating": 1.0,
      "verified": true,
      "author": "Cece",
      "helpful_votes": 3,
      "publication_date": 20191227
    },
    {
      "title": "\"Wow-level\" Oomph!",
      "text": "So what's not to like? Rugged (though we haven't tried everything yet), versatile, easy to clean. Haven't used it long enough to comment on durability, but seems hefty and very well-made. It is big and a bit heavy compared to some, so a few folks might find it harder to handle than they expected, but if you judge by results it makes the smoothest guacamole I've ever seen (whipped potatoes with the included whisk come next, so we'll see). Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "RK_Durham",
      "helpful_votes": 3,
      "publication_date": 20181208
    },
    {
      "title": "Sturdy and quality materials for a great price!",
      "text": "This is a great product. I'm trying to support more American companies, so it was a bit daunting thanks it's hard to find out where Mueller is located. . . Austria? China? Florida? Lol, but my consumer side called, and I answered. Great price for a sturdy, beautiful stainless steel, very nice looking immersion blender. I had bought a Cuisinart a few years ago, kept calling over, and plastic broke around the motor, tape wouldn't stay on it. . . So Cuisinart was selling their least expensive for 35 dollars. . . I chose the Mueller, and I'm glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190131
    },
    {
      "title": "Good quality",
      "text": "For that price I believe it's the best, it works very well so far in a commercial kitchen ,cause before we had to use a 4 foot long stick blender(heavy). Good material made ,light weight, emulsifies very well and for 500Watts it's a good option cause either can find in a retail shop or it costs double and triple.",
      "rating": 5.0,
      "verified": true,
      "author": "Panos",
      "helpful_votes": 6,
      "publication_date": 20180118
    },
    {
      "title": "Cheap",
      "text": "I was able to use this hand blender once and it broke. Its not a product I would use often and expected it to last for a long time. I tried to use it the second time for Christmas dinner and it just had no power. The light turned on but thats it! Beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181231
    },
    {
      "title": "Unit needs to be reengineered.",
      "text": "The item was defective. The speed control did not work and the speed of the unit would stay very high, making whisking impossible. The unit seemed to overheat after a few minutes, and there was an odor of burning plastic form the unit. I'm a licensed electrical engineer and it appears to me that the speed control was misassembled: the variable resistor is defective or not correctly connected, or there is an issue with the power electronics (thyristors failed or mis-connected)",
      "rating": 2.0,
      "verified": true,
      "author": "M. Van Remoortere",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Blade Broke Off in Food",
      "text": "I've had this product for about 11 months and I've used it essentially every morning to blend a powder, water, and ice mixture. Up until this point it worked as well as expected given the reviews on the product. This morning, however, the small blade piece broke off and was left in the drink mixture. I nearly didn't notice. This is extremely dangerous. I will be reaching out to Mueller support to see what can be done.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Collins",
      "helpful_votes": 3,
      "publication_date": 20191007
    },
    {
      "title": "Quality of product",
      "text": "I bought this \"heavy-duty\" blender on July 14th and last week the plastic part (See pics) that helps connect the motor body with the removable blending arm broke. I contacted the U.S. Muller Customer service website a few days via email and so far no answer. I would recommend you not to buy this product because of the low quality and terrible customer service of this company. Santiago",
      "rating": 1.0,
      "verified": true,
      "author": "Santiago F. Tenesaca",
      "helpful_votes": 3,
      "publication_date": 20201011
    },
    {
      "title": "Solid",
      "text": "This is a solid immersion blender and looks to be made of quality material. The locking mechanism is reinforced with a guide/slide to line things up properly and, hopefully, prevent breaking (this was a big issue with my last immersion blender). My first use had issues with getting clogged with cream cheese, but after clearing out the blades, putting it on a higher setting and taking smaller \"bites\" of cream cheese, we were good to go. Blended fast and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Guidry",
      "helpful_votes": 3,
      "publication_date": 20190112
    },
    {
      "title": "The blade came loose after three weeks of use",
      "text": "The blender was very powerful and quick when it worked, but upon blending a smoothie with frozen bananas the blade was no longer tight with the stick part of the blender. I was able to retighten the screw but only a week later it happened again. I would advise against purchasing this stick blender.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert G",
      "helpful_votes": 4,
      "publication_date": 20190915
    },
    {
      "title": "Not enough speed options",
      "text": "There are a lot of good reviews for this product, and I guess it would just depend on what you are attempting to emulsify. I was making lotions/creams, and this will not work for that. There is a standard power speed which has a turn dial, and a turbo speed as well. Most of the time, before you start high speeds, you need to mix/emulsify slowly in order to thicken your solution before upping the speed. This emulsifier ONLY goes fast and will spray things all over you and the house and the counter. And I have tried many different mixing bowls and cylinders. Need a slow option as well",
      "rating": 2.0,
      "verified": true,
      "author": "Jake H.",
      "helpful_votes": 2,
      "publication_date": 20191224
    },
    {
      "title": "Scratched my pot",
      "text": "This blender has sharp metal edges (unlike others that are coated in silicone) that scratched the hell out of my nice Calphalon pot. Super angry, and would definitely not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 5,
      "publication_date": 20190127
    },
    {
      "title": "vendor success story",
      "text": "We were on our 2nd unit in last few years when the stem broke free from the blade due to crushing ice mixed in with fruit for smoothies. You are not really supposed to do this I suppose but I've figured out to slowly mix the ice in with the fruit to place less stress on the blade. Anyway, the vendor offered a new unit at no charge, unsolicited from us, so I figured that was above and beyond. Excellent, five star service and Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "greg",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Buy the powerful blender if you want performance by your hand.",
      "text": "The Blending power in this thing is mind blowing. It's like german powerful engine. I use it blend fruits, sometimes vegetables and my favorite the lentil soup. It's amazing how smooth it becomes given that it's pretty easy to use on a daily basis. And cleaning is a breeze. Very easy to clean and because of the metal the way it is, it gets dry much faster. I definitely recommend for smooth soup and other blending as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mahmoud Nowaz",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Lots of power",
      "text": "If it had stated the country of origin in the description, I would have felt company to be more honest. It is made in the P.R.C. How ever I am impressed with the amount of power the unit has. Easily disassembled for cleaning, has nice blue back light on controls, variable speed. It says you can put the blade end in the dishwasher, but I find it cleans very nice, if operated in hot soapy water, then rinsed. I have used a couple times for medium weight batters, like waffle batter, had very good results. Attachments were not a problem to change, for me. One star off, because of nylon gear connection. Would liked to see stainless steel, instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Terrible. Broke on the second use.",
      "text": "This broke on the second use -- the motor made noise, but nothing spun. None of the attachments worked. I pulled one of the plastic connector bushings off with pliers, and that fixed it for about ten minutes. And then it went kaput. It also left a metallic taste+smell in my food. I regret buying this blender. The ruined meal and disappointment were far more expensive than what I saved by getting this cheap piece of plastic..",
      "rating": 1.0,
      "verified": true,
      "author": "Ted Pennings",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Didn't Buy! Does not work!",
      "text": "First didn't work. Amazon sent another. It did not work either! My advice is NOT buy one, they suck! Used my Ninja pitcher to make mayo in thirty seconds!",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca CohenTop Contributor: Health & Wellness",
      "helpful_votes": 3,
      "publication_date": 20190926
    },
    {
      "title": "Broke after 2 light uses",
      "text": "So the blender has great potential, but mine broke after 2 light uses frothing coffee. Some plastic just fell off of the attachment for the frother/whisk and now the heads won't clip into the blender anymore. The basic blender still works fine since it's a separate attachment piece, but the other one is completely useless now. I'll update my review if I receive a replacement part, but so far, not so great.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica B",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Works fine",
      "text": "Overall I'm finding this very easy to use. I bought it so I don't have to drag the blender out to make Starbucks-style egg bites. Which means blending a cup of cheese, cottage cheese and eggs down to smoothie consistency. This works fine, so I'm happy. Detaching it is easy and so far cleaning it is not a problem. I took one of the other reviews to heart and haven't emersed the entire blade attachment in water, I just clean the end with soap and water.",
      "rating": 5.0,
      "verified": true,
      "author": "RDC",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Stopped working after 8 uses",
      "text": "I was cooking veggie soup and when it was ready to be blended i brough this item out and started to blend. I heard the motor moving but no movement in the soup. I attached and reattached the piece again and saw the metal piece that blends moving. Something was off as it was not moving as normal. I removed the metal piece and found pieces of plastic plus the plastic piece close to the motor was broken. I have used this to make 4 soups and 4 smoothies, 13 days of ownership.",
      "rating": 1.0,
      "verified": true,
      "author": "F",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Too bad it lasted only one use, would have been a good blender",
      "text": "Blender had a lot of power to it. It wasn’t too hard to use. However the blade stopped turning after about 40 seconds of use on the first use. It also says in the manual not to hold the button for longer than 60 seconds at a time. Returned since the blade stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon User ",
      "helpful_votes": 2,
      "publication_date": 20200929
    },
    {
      "title": "Too powerful",
      "text": "I tend to go through immersion blenders within a year, the bearings or bushings wear out. They get used 1-2 times a day with Shakeology. This one feels much more solid in design and the motor sounds like it's going to last. Unfortunately it's too powerful even on the lowest setting with the immersion attachment. Kept it anyway because the whisk attachment does the job and turns out it's easier to keep clean.",
      "rating": 4.0,
      "verified": true,
      "author": "J. J.",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "The Best Little Kitchen Gadget",
      "text": "I really like this hand held blender, it is absolutely great, it does a really good job blending which I had been wanting something like this to blend my Protein shakes, I used to have to blend it on my big kitchen counter blender which makes it annoying from time to time because having to clean the bigger blender which makes it a little more time consuming especially when you're wanted to get your drink and go! This little blender is amazing and it takes a lot less time cleaning it...I have never heard of this brand but so far so good, I just hope that it will last me a very long time like the bigger name brand!",
      "rating": 5.0,
      "verified": true,
      "author": "jmv",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Dangerous choking hazard",
      "text": "DANGEROUS. Blade broke and came off while blending a smoothie. It's small enough to swallow if you don't notice. Amazon needs to review this product for safety.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Brainard",
      "helpful_votes": 3,
      "publication_date": 20190815
    }
  ],
  "product_meta": {
    "title": "Mueller Austria Ultra-Stick 500 Watt 9-Speed Immersion Multi-Purpose Hand Blender Heavy Duty Copper Motor Brushed 304 Stainless Steel With Whisk, Milk Frother Attachments, BPA-Free",
    "rating": 4.6,
    "feature_bullets": [
      "❤ SOPHISTICATED DESIGN - The ergonomic grip offers a non-slip and comfortable grip when continuously blending ingredients.",
      "❤ EXCEPTIONAL QUALITY - The full copper motor withstands continuous use and will last 3X longer than competitor's motors.",
      "❤ VERSATILITY - The removable blending arm with fixed blade locks into the motor body for easy operation. The stainless steel S-shaped fixed blade quickly blends ingredients for smoothies, milk shakes, soups or baby food and the quality Whisk attachment is a perfect addition.",
      "❤ EUROPEAN QUALITY – AMERICAN GUARANTEE - 100% 1 Year Warranty so you can buy with confidence and blend happily ever after.",
      "❤ INCLUDED ITEMS - Hand Blender, Whisk & Milk Frother Attachments, Manual."
    ],
    "specifications": {
      "Package Dimensions": "15.28 x 4.88 x 2.87 inches",
      "Item Weight": "2.16 pounds",
      "Manufacturer": "Mueller Austria",
      "ASIN": "B075X1KPLZ",
      "Item model number": "MU-HB-01",
      "Customer Reviews": "4.6 out of 5 stars17,080 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#38 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 25, 2017"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Hand Blenders",
      "Blenders",
      "Kitchen & Dining"
    ],
    "price": 34.97
  }
}