{
  "website_summaries": [
    {
      "verdict": "If you are looking for nesting dolls that have a doll design, this beautiful set is definitely worth considering.",
      "pros": [
        "Classic doll theme with pretty faces and bright colors",
        "Consumers brag about the design being similar to authentic nesting dolls from their childhood",
        "Crafted of durable wood"
      ],
      "cons": [
        "Not all dolls close securely",
        "Some reports of smaller dolls having irregular or chipped paint"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful dolls",
      "text": "These nesting dolls are hand painted and are absolutely beautiful! When I was little, my friend had a set and I loved playing with them. We bought these for my 18 month old daughter for Christmas. She loves putting things inside containers so we figured these would be a hit...and they are! Both my 5 year old and my 18 month old play with them. It's a very simple but fun toy and they are so beautiful to look at. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "T.J.A",
      "helpful_votes": 12,
      "publication_date": 20191227
    },
    {
      "title": "The painting quality decreases along with the size of the dolls",
      "text": "Nice set but the smaller dolls faces are really messed up. Also the dolls I got open too easily; if you tip the doll over the whole top halves just falls right off.",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 13,
      "publication_date": 20190203
    },
    {
      "title": "Beautiful and well made!",
      "text": "Purchased these for my 2 year old granddaughter and she loves them! She plays with them under supervision, though perhaps I should be supervised as well, since I was the one who stepped on one and broke it. Fortunately, her mother was able to fix it for us (a good dose of wood glue) and now all is well! Thanks for such a lovely set of nesters!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonJunkie",
      "helpful_votes": 11,
      "publication_date": 20190621
    },
    {
      "title": "Impressive for the price",
      "text": "I think these are impressive for the price. Really nicely painted. The colors are bright and crisp. I bought this set for my 3 yr old daughter as she loved to play with the old set my grandma gave me before she passed away. We use these as a toy and my kiddo loves them. Having 7 sizes in one keeps her busy and interested.",
      "rating": 5.0,
      "verified": true,
      "author": "Golden Swede",
      "helpful_votes": 20,
      "publication_date": 20190329
    },
    {
      "title": "Nice!",
      "text": "It came matte and I’m going to add a quick clear coat possibly. Nice product. Reminds me of childhood where a neighbor gave us one with just 5 nesting.",
      "rating": 5.0,
      "verified": true,
      "author": "VaniCosenza",
      "helpful_votes": 26,
      "publication_date": 20180715
    },
    {
      "title": "Quality nesting dolls-a different type of gift",
      "text": "These colorful nesting dolls are very cute and will make a nice birthday gift for my 4 yr old granddaughter. She loves stacking and nesting toys, so I think she'll have loads of fun with these, along with trying to figure out what other small toys she has that will fit inside each one - other than the next nesting doll size down. Some of the clear shrink wrap was split on the seams that covered the painted dolls, so the company that produces them should actually invest in clear wrap that is a little higher quality for shipment purposes and so none of the paint is rubbed off from handling. Otherwise, I find them to be adorable.",
      "rating": 5.0,
      "verified": true,
      "author": "chynamarie1",
      "helpful_votes": 21,
      "publication_date": 20180622
    },
    {
      "title": "Perfect gift!",
      "text": "My granddaughter loves nesting dolls and I wanted to get her a set for her birthday! Perfect place to hide her treasures! These were beautifully painted!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Smith",
      "helpful_votes": 24,
      "publication_date": 20181224
    },
    {
      "title": "so cute",
      "text": "reminds me of my pop pop. cute as a decoration. kids like to play with them",
      "rating": 5.0,
      "verified": true,
      "author": "Sara B",
      "helpful_votes": 23,
      "publication_date": 20190206
    },
    {
      "title": "Would buy again",
      "text": "I was very happy with this product - the quality was as expected. I would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "jamieLeigh",
      "helpful_votes": 14,
      "publication_date": 20181026
    },
    {
      "title": "Cheap and made out of thin material - - breaks easily",
      "text": "Very, very thin and cheaply made! Don't get tricked into buying these. They lasted about a minute!",
      "rating": 1.0,
      "verified": true,
      "author": "Merritt Rhodes",
      "helpful_votes": 8,
      "publication_date": 20180606
    },
    {
      "title": "I always wanted nesting dolls when I was a kid & now my daughter loves these",
      "text": "1 or 2 were a little tight fitting, but I’m hoping they might loosen with use. They’re very well done & my daughter is wild about them. Very cute, nice bright painting.",
      "rating": 5.0,
      "verified": true,
      "author": "gagamama",
      "helpful_votes": 22,
      "publication_date": 20180521
    },
    {
      "title": "I love this set",
      "text": "I love this set! I bought it for a young child for Christmas, since he loves my own set of nesting dolls. As in other sets I have bought of these dolls, a couple of them were very tight and difficult to separate. To fix this, I gently and lightly use a dremel tool on the inside of the top piece where it overlaps the bottom half, just a little at a time until it works better.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Perna",
      "helpful_votes": 33,
      "publication_date": 20171126
    },
    {
      "title": "Could have been better",
      "text": "It is a matte finish, painted but no final gloss layer as I expected. Weird —only the largest doll has been painted on the bottom. It’s like they were trying to cut corners to save time and paint. It’s good “enough”, pretty “enough” but not up to par. I expect the paint will chip easily since it is unfinished. Could have been better for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "E Nana",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "My 2 year old daughter loves these.",
      "text": "My 2 year old daughter loves these. I remember playing with similar dolls when I was a child. Its simplicity makes for a great toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Chen",
      "helpful_votes": 23,
      "publication_date": 20181028
    },
    {
      "title": "Perfect Gifting!",
      "text": "My daughter have been loving playing with these that we're now gifting them to pretty much all of her friends on their birthdays. These are high quality painted and really come off far more expensive than they were. I think they are perfect as a classic gift that will last for years (and probably follow the girls through adulthood)!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa MC",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Disappointed",
      "text": "They boast authentic, I don’t believe so. Some ads say 5 months and older, others 3 years. Don’t believe most 5 year olds could open them. Terrible dull finish. Not even painted on bottom. I would get paint tested if I had I kept them which I didn’t. I was expecting the beautifully crafted dolls with shiny finish. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "XOX",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Nice nesting dolls for kids to play with",
      "text": "Every kid I've met loves nesting dolls and these are a great alternative to letting them play with my $100 sets.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan S",
      "helpful_votes": 22,
      "publication_date": 20190406
    },
    {
      "title": "Better than Expected!",
      "text": "I am a teacher and often refer to Matryoshka dolls when I teach. I decided it would be helpful to have some, so I ordered these. The craftsmanship and quality of the product far exceeded my expectations. The Matryoshka dolls are an outstanding visual and I am so very pleased with how they have already helped me in my lessons! My only comment for the manufacturers would be to offer color choices, but that's a minor thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna.",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Price reflects these",
      "text": "The wood used is cheaper then I expected, o got these for my granddaughter for when she comes over she loves to play with them but has already broken two of the dolls. She’s only 2 so that tells you how sturdy they are.",
      "rating": 3.0,
      "verified": true,
      "author": "WinkyLee",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "A 14 yr old loves this",
      "text": "Purchased this for my 14 yr old granddaughter and she loves it. She is too old for dolls, but not for these beautiful dolls that are lovely. Great gift at any age, will purchase more for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "fiona finkle",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Beautifully crafted and painted.",
      "text": "I didn’t read the full description so they turned out to be much larger than nesting dolls I was accustomed to. But the painting is beautiful and my granddaughter to whom I gave them as a gift really loved them.",
      "rating": 5.0,
      "verified": true,
      "author": "M. B. Munnell",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Great Toy",
      "text": "These were larger than I thought but perfect for my 3 year old granddaughter. They're sturdy and easy for her to take apart and put back together. Very colorful.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan D.",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Beautiful nesting doll set",
      "text": "This is a beautiful set. They are larger than I thought they would be. My granddaughters love to play with them. They are sturdy enough.",
      "rating": 5.0,
      "verified": true,
      "author": "ACB8791",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Very good detail/quality",
      "text": "These are very cute and my daughter will love them! She loves mine and I wanted to get her some of her own to play with and they are very good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Pretty Dolls",
      "text": "Very nice set of stacking dolls. Granddaughter loves unstacking and restacking them. They stick a little but over time that will get better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200319
    },
    {
      "title": "Not made in Russia cheap immation",
      "text": "These are not made in Russia. More like China. Very cheap Details substandard. Better off paying a little more for authentic quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Circe E. Martin",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Make more dolls this size, there're just great!",
      "text": "Once again I'm very pleased with this doll, particularly the large size, she's a great addition to my collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Maree Fox",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Beautiful Russian Nesting Dolls",
      "text": "Nicely crafted and very nice coloring scheme. Quality looks good. The smallest doll is very tiny and impressingly crafted, and it surprises. Delivered on time. Surely will buy again from this store.",
      "rating": 5.0,
      "verified": true,
      "author": "Kamran",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Wish they were totally painted",
      "text": "The dolls on the inside are not even painted on the bottoms and there is no sealing on the outside paint to protect them. I will say, you can hardly find the seams. Much larger then I thought.",
      "rating": 3.0,
      "verified": true,
      "author": "Susan M. Haney",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "I like the texture and color",
      "text": "These are quality. My daughter plays with them quite a lot (she is almost 3). I like the texture and color.",
      "rating": 5.0,
      "verified": true,
      "author": "Nut Lover",
      "helpful_votes": 2,
      "publication_date": 20180407
    },
    {
      "title": "Beautiful design and detail, great sensory toy!",
      "text": "Got this set for my 2 yr old for Christmas 10 months ago and she still loves playing with them! Had to remove the tiny baby one, its a choke hazard for 2-3yr olds but otherwise a really fabulous toy! Very happy A++",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Bailey",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Pathetic product. Came broken.",
      "text": "The outermost cap was broken when closed. Also, the material felt really bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190515
    },
    {
      "title": "Wonderful!",
      "text": "Bright colors, good quality. My granddaughter loves nesting dolls. These are very cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "quality",
      "text": "quality gift. It was made in China you must accept this because price is half cheaper than original one and it is quality. I just returned one with animal pain from different seller. so i know this one is good quality. every set is close perfectly as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Romyakorn",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Cute",
      "text": "The art is close to photograph. The paint is pretty on some of them. Good value for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "sgool",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Stacking Dolls",
      "text": "I thought they were small stackable dolls but they are so big and not what I expected",
      "rating": 3.0,
      "verified": true,
      "author": "BARBARA HIBBS",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Just as advertised!",
      "text": "These nesting dolls are just right for my little granddaughter - very nice :)",
      "rating": 5.0,
      "verified": true,
      "author": "JA Kelley",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Fun to play with",
      "text": "Got it for my daughter, she enjoys playing with them.",
      "rating": 5.0,
      "verified": true,
      "author": "rojas",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Love them",
      "text": "These are really cute nesting dolls! They are bigger than I expected which my daughter likes. They also come apart well without any sticking.",
      "rating": 5.0,
      "verified": true,
      "author": "MLindseyDC",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Beautiful toy for kids",
      "text": "These nesting Russian dolls can keep a young kid busy for hours. Originally I bought these to be gifted, but my daughter loved these so much that I am now keeping these for her!",
      "rating": 5.0,
      "verified": true,
      "author": "Kat Eye",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Buy 1 get 6 free",
      "text": "Wow I just bought one and they sent me like 6 more free. So cool",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Lozano",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "as soon as my child sees this she loves this toy",
      "text": "she loves the doll also it is beautiful decoration all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Russian nesting dolls",
      "text": "The dolls themselves are very cute and well made but I wish the packaging was better. There was just a thin layer of plastic around the dolls and it had holes in it resulting in one eye being scraped up. Other than that they are beautiful and my daugter loves them.",
      "rating": 4.0,
      "verified": true,
      "author": "heaven",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Cute",
      "text": "Bought for my little girl she loves them so colorful",
      "rating": 5.0,
      "verified": true,
      "author": "doris estrada",
      "helpful_votes": 2,
      "publication_date": 20200419
    },
    {
      "title": "My grand daughters will love them!",
      "text": "This set came promptly. The dolls easily open, look nice, and will entertain my grand daughtrlers.",
      "rating": 5.0,
      "verified": true,
      "author": "Loves Basenjis",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Not real deal but still very cute!",
      "text": "Im from Russia and is say it’s pretty close to real russian nesting dolls! Will do for gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "julia chambers",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Really giftable",
      "text": "I got it for my friend. She liked them very much. Want to order for my self",
      "rating": 5.0,
      "verified": true,
      "author": "Inna",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Not awesome",
      "text": "Not a fine piece of art but what would you expect",
      "rating": 4.0,
      "verified": true,
      "author": "Sumu",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Ok",
      "text": "Good looking nesting dolls. Unfortunately made in China not Russia but still are very presentable and look quite traditional to me. For the price the quality is good enough.",
      "rating": 4.0,
      "verified": true,
      "author": "Olga ",
      "helpful_votes": 3,
      "publication_date": 20190415
    },
    {
      "title": "Absolutely adorable!",
      "text": "Excellent product. My daughter absolutely loved them! Arrived promptly and no damage!",
      "rating": 5.0,
      "verified": true,
      "author": "sela",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Gets the job done.",
      "text": "Bought for a school project, perfect! They are painted a bit cheaply, but are still cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancyvh",
      "helpful_votes": 3,
      "publication_date": 20180614
    },
    {
      "title": "Beautifully hand painted!",
      "text": "These are absolutely beautiful you can see all the details that were put into the paint. The reason I gave it four stars is because they didn’t put any clear coat over the paint so it’s easy to chip or otherwise damage the paint.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin DeLong",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Very cute",
      "text": "Very cute dolls I will buy again I give them as gifts",
      "rating": 5.0,
      "verified": true,
      "author": "bebe n baldeo",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Great",
      "text": "Love this nesting dolls. Great quality for the reasonable price. Bought two sets as a present.",
      "rating": 5.0,
      "verified": true,
      "author": "elena",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Lovely",
      "text": "My son loves to learn about cultures & had been wanting some Russian dolls. Very detailed on the painting. Makes good decor.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana C.",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Cheap",
      "text": "One of the dolls do not stay on whoch defeats the purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Coleman",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Five Stars",
      "text": "Absolutely stunning!! Can’t wait to give it to my daughter for Easter!",
      "rating": 5.0,
      "verified": true,
      "author": "Terese",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Nice Nesting Dolls",
      "text": "My granddaughter went nuts over this Easter basket present. Nice quality, gorgeous colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa M. Pease",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Larger than normal",
      "text": "Absolutely gorgeous! My 2 year old daughter collects them and she’s in love with this one. It’s huge and perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "... largest one is difficult to get open but it’s beautiful and my 2 yr old loves playing with it",
      "text": "The largest one is difficult to get open but it’s beautiful and my 2 yr old loves playing with it!",
      "rating": 4.0,
      "verified": true,
      "author": "Lenae",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Closed shut",
      "text": "Made very nicely; however, the second half closed shut and won’t open with any action taken. I’ve tried applying heat or water to dissolve the paint that is closing it but nothing will work, any help?",
      "rating": 3.0,
      "verified": true,
      "author": "Edison Leal",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "As described",
      "text": "Gift for my granddaughter's birthday. They are beautifully painted and fit together well.",
      "rating": 4.0,
      "verified": true,
      "author": "LML",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Gorgeous design with many dolls",
      "text": "Gorgeous designs many dolls to play with teaches little ones about sizes",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne Sweet",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Satisfied",
      "text": "Witnessed a reaction in my mom I haven’t seen in a while, I’m glad I got this for her birthday",
      "rating": 5.0,
      "verified": true,
      "author": "Hanzo",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Perfect",
      "text": "These are beautifully hand painted and unique. They are sturdy enough for the 5 year old that asked for them for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Marjorie",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Not for children - better for decoration",
      "text": "The dolls are beautifuully painted, but don't fit very well and are definitely not designed for children",
      "rating": 2.0,
      "verified": true,
      "author": "meg",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Quality.",
      "text": "It was a gift for my son. He loves it. Paint has held up well. The fit and finish is great too.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "well made, beautiful detail",
      "text": "Worth the money! These are beautiful, very sturdy, detail colors. Very pleased, would def recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Well constructed and the colors are beautiful!",
      "text": "My daughter is 5 and has been asking for nesting dolls. She picked these out and absolutely loves them. Well constructed and the colors are beautiful!",
      "rating": 5.0,
      "verified": true,
      "author": "Marisol",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Fun to play with.",
      "text": "I liked the color. Looks like it was hand painted. I got it for my grand children.",
      "rating": 5.0,
      "verified": true,
      "author": "Lpm",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Amazing!",
      "text": "If my little girl loves it then so do we. Definitely a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "zeetrip",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great for busy toddler hands.",
      "text": "My 2 year old LOVES this. Takes it with her everywhere she goes.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Schultz",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Five Stars",
      "text": "The grandchildren loved the nesting dolls. The colors were vivid and the quality excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Albert",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Great price great quality",
      "text": "My granddaughter ❤️ This gift for her 2nd bday. Has provided hours of entertainment!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary jo cecil",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Beautiful intricate design",
      "text": "Beautiful intricate design! Great for developing 1.5 year old's fine motor skills, I just had to hide the 2 of the smallest pieces due to choking hazard. Highly recommend this as a toy for your child!",
      "rating": 5.0,
      "verified": true,
      "author": "Shea Croshaw",
      "helpful_votes": 2,
      "publication_date": 20180329
    },
    {
      "title": "Don't close tightly",
      "text": "Bought it as a gift. The dolls are nice, but some of them don't close tightly, which is not good.",
      "rating": 3.0,
      "verified": true,
      "author": "Brooklyner",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Very pretty dolls",
      "text": "I love it when I come across so drying unusual on amazon and I am so glad I found these! They are even prettier in person. They appear to be hand painted and made of real wood. They are very detailed and the paint is good quality. No chipping or peeling off. I like my three year old play with them and they still look as new.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Cadengo",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Love it!",
      "text": "Super cute! Very well made and it's our daughter's new favorite toy. The last 2 dolls are so tiny, I needed to take them out since it's dangerous for our little one. I'll put it back when she grows up. No complaints at all! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Luiz Felipe Hue",
      "helpful_votes": 0,
      "publication_date": 20200628
    }
  ],
  "product_meta": {
    "title": "Starxing Russian Nesting Dolls Matryoshka Wood Stacking Nested Set 7 Pieces Handmade Toys for Children Kids Christmas Mother's Day Birthday Home Room Decoration Halloween Wishing Gift",
    "description": "The Nesting Doll has strong exotic style, is handmade craftwork unique to Russia. The main material\nfor Nesting doll is Linden wood. Nesting dolls can be not only for decoration, but also can store jewelry,\ncandy, etc. Besides, it is a perfect choice for gift packing. Nesting doll-A premium gift everyone deserves.\nIt is the exotic kind of delicate gift that makes stronger family bond, witnesses affectionate love, and\nexpresses ardent yearning for the one you care. \n\nThe Legend of Nesting Dolls:\nIt is said that in the old times, there were two cousins, boy and girl, lived in the same neighborhood in Russians. \nThey grew up together very intimately. As time passed by, the boy leaved hometown. He missed his lovely girl\nvery much. So he made wooden dolls taken after the girl every year. The size of nesting dolls grow bigger and bigger\nyear by year. Years gone by, he came back to hometown, and send this collection of wooden dolls to her\nas a gift. People then modeled the style of the dolls by the name of Matryoshka. It has another name ‘lucky doll’.\n\nSpecifications:\n1. Brand: Starxing\n2. Pattern: Little girl with red flower cloth and blue scarf\n3. Material: Linden wood\n4. Item Weight: 9.9 ounces\n5. Shipping Weight: 10.4 ounces\n6. Size: Approx. 3.1 x 3.1 x 7.1 inches (L*W*H).\n7. Suitable for: Home decoration, Christmas, Valentine’s day, birthday, Mother’s Day and any other time.\n\nPackage Includes:\n1 * Set of Seven Pieces Nesting Doll Matryoshka Russian Handmade Wooden Little Girl Pattern Nesting Dolls Toy Gift",
    "rating": 4.6,
    "feature_bullets": [
      "💌EXQUISITE DESIGN: Nesting Doll is handmade craftwork.",
      "❤EASY TO OPEN & FITS VERY WELL: Children are able to open and close it by themselves. The top and bottom pieces fit perfectly.",
      "❤NO PAINT SMELL: The paint for nesting doll is high-grade eco-friendly.",
      "❤NATURAL SAFE WOOD: Nesting Dolls is made of linden wood. Carefully selected and polished. Safe enough for kids.",
      "❤100% MONEY BACK GUARANTEE: We devote ourselves to provide the best customer service and bring the best shopping experience to every customer. If you are not satisfied with our product, just contact us and we can offer a full refund. No questions asked!"
    ],
    "specifications": {
      "Product Dimensions": "3.1 x 7.1 x 3.1 inches",
      "Item Weight": "9.9 ounces",
      "ASIN": "B0756QZHD4",
      "Best Sellers Rank": "#31,944 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars331 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Toys & Games",
      "Novelty & Gag Toys",
      "Nesting Dolls"
    ],
    "price": 17.99
  }
}