{
  "website_summaries": [
    {
      "verdict": "5-pack of 4.5-inch flat cut-off wheels, featuring patented alumina granules and ultra-thin design for less material loss.",
      "pros": [
        "Patented alumina granules enhance cutting operation and reduce blackening of stainless steel when cut",
        "Unique composition ensures longer life",
        "Ultra-thin design for fast, burr-free cutting and minimal stainless steel material loss.2 full sheets of fiberglass for strength, safety, and accurate cutting angle",
        "5 to a package, excellent value!"
      ],
      "cons": [
        "Feedback on this product is mostly favorable, only complaint was regarding cutting life being too short"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "great product for half the price",
      "text": "Work well, no chipping or exploding wheels. I have pushed down on tool grade steel at 2\" thick, ground it red hot and disk stayed true, used as stationary grinding wheel to cut odd corners and the wheel produced required results. dropped my grinder on the table when switching tools and the wheel broke through its connection point. they are quite thin and i believe this wasn't a design flaw as much as careless handling on my part. i will buy these again",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Great Cut Off Wheels!",
      "text": "Will cut and grind without breaking. Used one steady for about a hour grinding and cutting until about only a inch of wheel was left and it did not break. Wheel will flex when hard pressure is put on it without breaking which is great. Always wear a face shield when using a grinder to protect from flying dust and debris and in case wheel does break!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Ok",
      "text": "Great bang for your buck but they do not last long I would say you can cut the same amount with one radner wheel as you could with 3 of these",
      "rating": 2.0,
      "verified": true,
      "author": "J1",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "exactly what he was looking for",
      "text": "exactly what he was looking for , good price and arrived very fast , thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy W.",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Fast, Aggressive Cuts",
      "text": "Probably the best cut-off wheel I've used so far: cuts fast and lasts longer than other wheels. I'll buy it again, but these will last me for quite some time before I need to re-order.....",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Colombini",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Works!",
      "text": "Cut through 14/20 gauge steel without too much hassle. Nice!",
      "rating": 5.0,
      "verified": true,
      "author": "driven168",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Great wheel for cutting steel and through welds.",
      "text": "Pros: Good fit on spindle, grind very well, removes material quickly. Would recommend to others. Cons: Don't know of any.",
      "rating": 5.0,
      "verified": true,
      "author": "RPinOK",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Saved a bunch of money look just like the ones I saw at Lowe’s.",
      "text": "Saved a bunch of money look just like the ones I saw at Lowe’s",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Good product",
      "text": "Cuts much better than some that cost three times as much. Does a real good job",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Product Review",
      "text": "These cut-off wheels are the worst I have ever used. They are not worth buying. Spend a few more dollars and buy better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "John M. Pio",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Work Great",
      "text": "These fit my grinder and worked great for cutting bolts and metal ... good buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "good service",
      "text": "aggressive cutting, even on 1/4 inch steel . very durable and long lasting, will buy again,",
      "rating": 5.0,
      "verified": true,
      "author": "james cheek",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "They last.... durable too.",
      "text": "I liked to saw wheels. Plus they work and last.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth R. Bullock",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Break easily, very thin",
      "text": "I've never experienced this with a cutoff wheel but the wheel fails where the arbor washer meets the cutting disk.",
      "rating": 1.0,
      "verified": true,
      "author": "seektruth",
      "helpful_votes": 0,
      "publication_date": 20201207
    }
  ],
  "product_meta": {
    "title": "5 Pcs,Cut-off Wheel, B, 4.5\" x .045\" x 7/8-Inch Cutting Wheels, Double Reinforced Fiber Flat Grinding Wheel Aggressive Cutting Blades for Stainless Steel and Metal, for Grinders, MPA Certification",
    "description": "Size:115 mm-4.5 Inch| Color:5 PackGive the high speed and sharp electric grinders power cut off tool to you and look for quality designs to your cordless grinder cut off wheel. \nAll these are for we know what troubles you.\n\nAre you afraid that your porter cable angle grinder wheels will break easily?\nWorried about cutting quality using normal electric cut off wheel tool?\nTroubled by grinder cutting blades broken frequently?\nWanna have durable and reliable grinder disc wheels?\nWorry about the color deviation of stainless steel material after cutting?\n\nNow, you can get rid of all these worries with our supreme cut off wheel!\nT41-A/F46Q4BF 4.5\" x .045\" x 7/8-Inch, 25-Pack, Max RPM: 13300, MPA\n\nProfessional Quality\nOur company is a manufacturer which is specialized in the production of cutting discs. \nWe concentrate on creating professional cutting disk quality.\n\nFast and Aggressive Cuts\nAfter a series of technical improvements, and thousands of cutting test of our united abrasives cut off wheel, \nthe sharpness of our grinder wheels 4 1/2 inches for angle grinder is enhanced. \nGood fit on spindle, and grind very well, and also removes material quickly. \nFit grinder and work great for cutting bolts and metal. \nThe side grinder cut off blades bring a faster and sharper cutting experience to you.\n\nExtensive Use\nOur cutting disk has a wide range of uses, \nwhich can be used to cut steel tubes, steel plates, square steel, stainless steel, and copper and aluminum plates and so on. \nOur cutoff wheels can meet the multiple daily and industrial cutting needs\n\nIndependent packing\nThe package of 5 sets of 5 thin cut metal wheel constitutes a packaging box of 25 pieces, \nwhich is convenient to take out a small amount of cutting disc at a time and is helpful for the full storage of metal cut off wheel that are not used.",
    "rating": 4.5,
    "feature_bullets": [
      "Excellent Performance, Stable and Durable: Our cut off wheel uses advanced production technology and high quality raw and accessories materials, so the angle grinder cutting wheel is with high tensile, impact and bending strength, and cutting performance.",
      "Thin Double Meshes and Sharpness: The cutting wheels are designed with ultra-thin double nets. While ensuring the sharpness, it can also make the tile saw blade more durable, and not easy to blow up. So it can be used safer.",
      "High-Quality Ring-hole Design: Our cut off wheel is designed with unique ring-hole, which is made of high-quality stainless steel material. Therefore, the ring-hole is firm enough and not easy to fall off.",
      "Reinforced Alumina Granules and Quality Assurance: The use of high strength reinforced alumina granules of our cordless angle grinder wheel, and combines the fiberglass materials and meshes closely, so that the angle grinder sanding disc is strong and durable, and not easy to break.",
      "Thin Disk Design: Our metal cutting blade is designed in thin disk, making possible the cutting of various metals with high speed. The benchmark abrasive wheel has outstanding sharpness and wear resistance, ensuring its longer lasting service life."
    ],
    "specifications": {
      "Manufacturer": "B",
      "Part Number": "43237-2",
      "Item Weight": "5 ounces",
      "Product Dimensions": "4.53 x 4.53 x 0.05 inches",
      "Is Discontinued By Manufacturer": "No",
      "Size": "115 mm-4.5 Inch",
      "Color": "5 Pack",
      "Material": "Alumina abrasive",
      "Thickness": "1.2 Millimeters",
      "Installation Method": "Screw-In",
      "Item Package Quantity": "5",
      "Outside Diameter": "115 Millimeters",
      "Speed": "80",
      "Cutting Diameter": "115 Millimeters",
      "Usage": "Metal Cutting",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Assembled Diameter": "115 Millimeters",
      "ASIN": "B076NZJC46",
      "Customer Reviews": "4.5 out of 5 stars70 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#202,823 in Tools & Home Improvement",
      "Date First Available": "October 22, 2017"
    },
    "categories": [
      "Cutting Wheels",
      "Power Tool Parts & Accessories",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Power Rotary Tool Parts & Accessories"
    ],
    "price": 5.99
  }
}