{
  "website_summaries": [
    {
      "verdict": "With a trademark laidback charm, the Sperry Seaside Suede lets the wearer transition between different casual activities. These kicks are not just all about looks, either. It’s been found to be comfortable, with excellent arch support and cushioning. It also offers stylish pastel colors to choose from.On the other hand, buyers have found the shoe to be narrow and small in sizing. That said, this budget-friendly model could be a decent option for those looking for a pair of comfortable and trendy sneakers for everyday use.",
      "pros": [
        "The Sperry Seaside Suede is set at a budget-friendly price tag",
        "Most reviewers thought that this is a good-looking shoe, describing it as beautifully styled",
        "According to a lot of testers, the Sperry Seaside Suede is comfortable",
        "The kicks offer excellent arch support and cushioning, perceived several wearers",
        "A couple of users observed that the Sperry Seaside Suede has great colorway options"
      ],
      "cons": [
        "Some buyers were displeased that the sneaker was too narrow",
        "They added that the toes touch the top of the shoe, squeezing them tight",
        "Many reviewers detected that the Sperry Seaside Suede runs small",
        "An individual shared that she could barely get her foot inside"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Uncomfortable, pretty shoe",
      "text": "The shoe is definitely on the narrow side which I personally did not have a problem with. It's very uncomfortable overall, I purposely bought half a size larger. It's very tight on the heel and it's pitty I had to return it. I looks beautiful, the color and the quality looked good, extremely uncomfortable though",
      "rating": 2.0,
      "verified": true,
      "author": "Thelma A. Desouza",
      "helpful_votes": 4,
      "publication_date": 20190617
    },
    {
      "title": "Cute , but not durable , would not expect them to last more than one season with light use",
      "text": "Honestly super cute 😍 I was really bummed to return them but honestly the pink Swede was impossible to keep clean even though I am super careful. They just end up looking kind of dirty after one use , also i used them lightly for one day and the bottom was completely destoroyed I was a bit disappointed that they werent more durable , I love Sperry's, & they have great taste but both the top Swede & the bottom rubber where not the thicker more durable value I expected for $40 ,",
      "rating": 3.0,
      "verified": true,
      "author": "Cris",
      "helpful_votes": 3,
      "publication_date": 20190312
    },
    {
      "title": "Cute shoes but a little tight",
      "text": "These are great looking shoes but are tight. I have a lot of sperry shoes and this shoe is tighter then all the other ones that I own. I also got a blister with these shoes which I don’t normally get. I would recommend these shoes as they are very cute and the footbed is comfortable but maybe order a size up",
      "rating": 4.0,
      "verified": true,
      "author": "Sam Mager",
      "helpful_votes": 2,
      "publication_date": 20190723
    },
    {
      "title": "Love!",
      "text": "So comfy and cute. I wish I had sealed them with clear shoe polish when I first got them because they do get dirty easily due to the light color/texture of the suede. Overall very nice quality",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "So comfortable but narrow.",
      "text": "These are so narrow! Would love to find in a wide.",
      "rating": 2.0,
      "verified": true,
      "author": "JustJ",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "Runs small",
      "text": "The mint color is very subtle. I have a narrow foot. The shoe runs small. ORDER 1/2 size up.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Fedders",
      "helpful_votes": 2,
      "publication_date": 20190129
    },
    {
      "title": "Extremely disappointed",
      "text": "I am so disappointed in this shoe. I have many pairs of Sperrys at home ranging from their sneakers, to boat shoes, to boots and I have never been more disappointed. These are the correct length and width per size but the ankle is ridiculously tight. I thought breaking them in would fix this problem, but it’s not! I can’t wear these for more than an hour without my ankles being completely shredded! It’s such a shame, because they are really cute and the sole is memory foam, so they should have been very comfy!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Cute but too small",
      "text": "These are in the most lovely light lavender color. I love the suede they're made of, too. However, they're too small and too tight (I got my usual 7.5), especially in the toe area. Also, the back rim seemed to cut in the back of my heel. I am a Sperry lover, but sadly, I had to return these.",
      "rating": 3.0,
      "verified": true,
      "author": "Roksana Sobieralska",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Very narrow",
      "text": "I have to return them because they are way too narrow for me. If your feet are on the wide side forget about these shoes! Well made because they’re Sperry but they don’t fit me at all. Couldn’t even get my foot in.",
      "rating": 2.0,
      "verified": true,
      "author": "Checko",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great, except for small spot on R-shoe!",
      "text": "I Love them, just one problem. The right shoe has a spot or flaw on it. It might just be in the material. Should I return them? How long would it take to get a new pair?",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Shoes for ants",
      "text": "Like easily 3 sizes too small. Tried to force it and cramped up my foot so bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Ariana Michalak",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Not true to size",
      "text": "I'm size 7 but I ordered 7.5 for the socks allowance but this 7.5 is tight. I checked the label as i might be wrong but label indicates 7.5. Their sizing is not the standard sizing. Get one size up otherwise you'll end up the hassle of returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Shi8E",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "real Sperry shoes",
      "text": "I compared the new ones to an old pair I bought directly from Sperry and they're exactly the same, arrived quickly and fit as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Marie Taylor Chacon",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Beautiful shoe, love the color, but runs small",
      "text": "Loved the color, material, design, but this shoe runs very small. I wear medium in all of my shoes, and could not even get this pair on my feet! No way am I going to force it and be miserable every time I wear them. Returning!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanne Lynch",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Size up",
      "text": "Too small - size up an entire size. Great quality and super cute. My daughter gets them for Christmas because they’re too small for me",
      "rating": 3.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Comfortable top-sider",
      "text": "I typically wear an 11 Wide and the 12M fit perfect",
      "rating": 5.0,
      "verified": true,
      "author": "hfohlin",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Horrible!",
      "text": "Horrible shoes. Sent them back as soon as possible. They run small, right and narrow!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "I love it!",
      "text": "I love it! Sperry is a wonderful brand for walking shoes. It’s soft and flexible while still giving you the proper support needed. The color is exactly the same as shown and the fit is great (I wear 9US)",
      "rating": 5.0,
      "verified": true,
      "author": "Shalimar",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Just so-so ..",
      "text": "Lower to ground than normal sperry canvas shoes. I own 5 pairs. But these are my least fav. They also as expected being suede stain easy.",
      "rating": 3.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Really Narrow",
      "text": "These shoes are really cute and well cushioned but man are they narrow. I usually wear medium shoes but these squeeze my foot. I may try half a size up.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Still love them",
      "text": "Love these shoes. But easily show any dirt or stains",
      "rating": 4.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Perfect comfortable and casual slip on",
      "text": "These are very comfortable and super cute to wear. The color is exactly as pictured, they are exactly what I have been looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "megan",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Great if you have small feet not a size 8",
      "text": "Like these very much but they are very very tight, should have returned them but I thought they would stretch out by wearing them. They didn’t.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Williams",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Narrow",
      "text": "So narrow I had to give them away. I have an average width foot and have never bought a wide shoe.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth Goldberg",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Cute and comfy",
      "text": "These shoes are so cute!!! And unbelievably comfortable... feels like walking on a cloud",
      "rating": 5.0,
      "verified": true,
      "author": "tiffany",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Size",
      "text": "Great shoe, comfy support, but shoe runs a little small.",
      "rating": 4.0,
      "verified": true,
      "author": "KarleyK12",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Love the fit but suede material gets dirty easily",
      "text": "These are some of the most comfortable and best fitting shoes I own; however, I my dusty pink shoes got some water spots on them the first time I wore them and I couldn’t get them off. Since then they have gotten dingy looking. Even though I love the way these feel on my feet, I only wear them around the house most of the time. It’s too bad because of the material held up better I would want these in multiple colors.",
      "rating": 3.0,
      "verified": false,
      "author": "Cheryl Redman",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Beautiful in person",
      "text": "I love the color rose gold perfect and fits like a glove perfect.. Love them thinking on getting every color! I recommend for summer.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190507
    }
  ],
  "product_meta": {
    "title": "Sperry Top-Sider Women's Seaside Suede Sneaker, Light Grey, M 065 Medium US",
    "description": "Looking for an iconic design that pairs with just about anything? The possibilities are endless with the stylish Sperry® Seaside Suede shoe! Durable sneaker construction securely bonds upper to rubber outsole. Premium suede upper. Laceless slip-on design featuring elastic gussets for easy on-and-off. Memory foam footbed with arch support for all-day comfort. Breathable, moisture-wicking Dri-Lex® lining for a cool and dry wearing experience. Wave-Siping™ provides wet/dry traction. Non-marking rubber outsole with Wave-Siping™ technology that provides superior traction on both wet and dry surfaces. Imported. Measurements: Weight: 11 oz Product measurements were taken using size 8.5, width M (B). Please note that measurements may vary by size. Weight of footwear is based on a single item, not a pair.",
    "rating": 4,
    "feature_bullets": [
      "Offered in High-quality suede",
      "Double-gore upper design for easy on/off wearing",
      "Outer Material: Suede",
      "Sole: Rubber",
      "Closure: Slip-On",
      "Heel Type: no-heel",
      "Shoe Width: medium",
      "Memory foam insole provides Comfort and Integral Arch Support",
      "Dri-Lex footbed lining provides breathability through its moisture-wicking technology, for a cool and dry wearing experience",
      "Vulcanized construction ensures a secure bond between upper and outsole Non-marking rubber outsole with Wave-Siping for ultimate wet/dry traction"
    ],
    "specifications": {
      "Product Dimensions": "12.7 x 12.7 x 12.7 cm; 311.84 Grams",
      "Date First Available": "18 May 2018",
      "Manufacturer": "Sperry",
      "ASIN": "B076JXD34T",
      "Item model number": "STS82598",
      "Department": "Women’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 44.44
  }
}