{
  "website_summaries": [
    {
      "verdict": "Effective and efficient, this infrared heater keeps you and your patio toasty, as long as the air temperature doesn't dip too far below 50°F.",
      "pros": [
        "Heats up to 15 feet",
        "Produces about 5,000 BTUs",
        "Three heating modes",
        "Can be mounted on wall or ceiling",
        "Uses a carbon fiber infrared heating element",
        "Designed for safety with tip-over protection and 24-hour shut off timer",
        "Includes remote control"
      ],
      "cons": [
        "The neck angle is not adjustable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sent me used product",
      "text": "Obvious that this product has been used before. Pa lacing was awry, screws were in ziplock bag and main body scratched. Am really annoyed. Considering retuning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Karyn Snyder",
      "helpful_votes": 16,
      "publication_date": 20181110
    },
    {
      "title": "Stopped working after 1 month",
      "text": "We used this heater regularly to heat a small, covered area outside. After 1 month of use, it has completely stopped working for no reason. It hasn't tipped over, gotten wet, anything. I'm really disappointed with this product and would suggest to buy from another brand and model.",
      "rating": 1.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 17,
      "publication_date": 20181130
    },
    {
      "title": "Doesn’t work!!! Buyer beware!!!",
      "text": "This heater does NOT WORK!!!! The instructions were awful and there is a supposed safety feature that will turn heater off if it’s tipped over. The instructions say to simply tip the unit 90 degrees and shake gently. I’ve done that 42 times and it’s still not working!!! What a piece of junk. So now I’m supposed to rebox the 13 diff pieces and lug a 40 pound box to the post office??? What a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Frederic",
      "helpful_votes": 11,
      "publication_date": 20190115
    },
    {
      "title": "Quality product that does the job",
      "text": "The area we are heating has a bistro table, and this unit allows us to enjoy the space year round. I setup the heater without the middle extension so it sits lower. Heat is instant. No complaints so far. Update: Months later, the heater is still performing perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "RyanL",
      "helpful_votes": 11,
      "publication_date": 20181213
    },
    {
      "title": "The base om this unit is heavy and use caution moving from one area to another.",
      "text": "This a top quality patio heater!! It is used on a side porch and will keep the table area comfortable as long as the temperature is above forty five to fifty degrees.",
      "rating": 5.0,
      "verified": true,
      "author": "john l. leggette",
      "helpful_votes": 10,
      "publication_date": 20181116
    },
    {
      "title": "A bit disappointing but does heat well",
      "text": "The instructions were not included and I had to contact the company to get them. The instructions were not clear but, after a few wrong turns, the heater was assembled. The remote was also missing but was mailed from the company, after I contacted them, and received about 5 days later. The remote is pretty useless. You have to be standing directly in front of the unit and not too far away for it to work. It heats well and will turn off if it is knocked over.",
      "rating": 3.0,
      "verified": true,
      "author": "Karen Roupe",
      "helpful_votes": 4,
      "publication_date": 20191105
    },
    {
      "title": "First class outdoor heater",
      "text": "Wonderful product: both extremely effective and low in cost. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "James Y. Myers",
      "helpful_votes": 13,
      "publication_date": 20180126
    },
    {
      "title": "Quick radiant heat",
      "text": "Pretty much instant radiant heat. The stand is more useful than I thought it would be. I’ve been using it multiple times a day for several weeks, so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Family Man",
      "helpful_votes": 6,
      "publication_date": 20181106
    },
    {
      "title": "Heat doesn’t travel",
      "text": "The device gets hot but unless you’re right next to it, it’s not helping you. It will not heat a space but does offer warmth if you are right near it. It’s not a bad product— it’s just not as useful as I’d like it to be for heating our porch area.",
      "rating": 3.0,
      "verified": true,
      "author": "Rocket",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "OK Item",
      "text": "Item heats well, but be carful, stand is top heavy",
      "rating": 3.0,
      "verified": true,
      "author": "Don Ward",
      "helpful_votes": 7,
      "publication_date": 20181115
    },
    {
      "title": "Very impressed",
      "text": "Had this for a few weeks to replace several small space heaters over the years that I've used in my garage. Love it, so much better than any of those by far, especially if you're sitting in one spot typically.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Compton",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Don’t buy. :(",
      "text": "It works great for a month and then stops working!! I got a replacement and it did the same thing!😰 Now I’m stuck with it broken!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 3,
      "publication_date": 20190312
    },
    {
      "title": "How to assemble it...",
      "text": "There are/were no assembly instructions included in/with this heater...I am unable to figure out how to assemble & therefore it is useless to me...would someone please send me instructions/directions or I will have to return this product...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Nice",
      "text": "Bought this new unused because it was 20 bucks, wish i boght a few more before they figured it out....",
      "rating": 5.0,
      "verified": true,
      "author": "william spesshardt",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Worth the money",
      "text": "We bought this heater for our screened in back porch. We were not disappointed! Works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Dickerson",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "LOVE IT!",
      "text": "I love this heater! We use it on screen porch and it's very economical.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Carr",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Patio heater",
      "text": "I thought this would put out a lot more heat for my patio",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Huxley",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Not worth what it costs.",
      "text": "Had this heater for about a month. Worked fine until the switch to turn it on and off failed. Sent the company a message about it, but have yet to receive a reply. 2 weeks. Dont buy it. It's cheaply made and not worth the $$",
      "rating": 1.0,
      "verified": true,
      "author": "Justin H.",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Works well; slight shipping damage",
      "text": "A bit difficult to assemble the telescoping rod. The base arrived damaged - 2 dents in the base, but paint is not chipped.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Great",
      "text": "Great item does the job well we have 3 of them in a 1200 sq ft garage keeps the temp at 52 to 56 constant. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe O'Fria",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Bulb blew",
      "text": "Works great but the bulb blew out in a few weeks and replacements are not available online",
      "rating": 3.0,
      "verified": true,
      "author": "HMW",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Do Not Get!",
      "text": "Small Space Heater Would Heat Better. Do Not Recommend. Very Disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff and Amy",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Looks a good choice",
      "text": "It's my first time I am using an electric heater and so I'm happy.was so easy to set up. for sure the propane one has a lot more heating but you have to be wary about your propane tank.",
      "rating": 5.0,
      "verified": true,
      "author": "samyar",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Works great",
      "text": "Product works great! When package arrived the base was bent. No issues getting a replacement base.",
      "rating": 4.0,
      "verified": true,
      "author": "Vanessa Wentworth",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great heaters",
      "text": "Bought these for my rv patio, worked great, have only used for two weeks but made a huge difference, very warm",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Peters",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Easy to use",
      "text": "It works well for my screen room and garage. Made well easy set up options for use.",
      "rating": 5.0,
      "verified": true,
      "author": "James Tino",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Very poor condition",
      "text": "the buttons are side are detaching from the heater making it unsafe",
      "rating": 1.0,
      "verified": true,
      "author": "Teo",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Works great - so happy with it that I bought a second one",
      "text": "Like many people during Covid, I had been looking for ways to socialize outdoors as the weather gets colder. Tried two different outdoor heaters before this and neither of them was any good. I'm delighted to report that this one worked great. It came with all the parts and had directions that were actually easy to follow. Took less than an hour to put together. (Definitely don't bother with the paid assembly.) The lamp is stable and you can adjust the height and angle of the heating element. Most importantly, it puts out a good amount of heat as soon as you turn it on. You can easily feel it several feet away.",
      "rating": 5.0,
      "verified": true,
      "author": "woodside_boomer",
      "helpful_votes": 0,
      "publication_date": 20201123
    },
    {
      "title": "Works well but heat doesn't go as far as we had hoped.",
      "text": "It came quickly and was mostly easy to assemble, except that the directions don't say that you need to pull a connector piece out of the top of the poll which caused some confusion. We thought we were missing a piece at first. It seems to work well, but the heat doesn't radiate as far as we had hoped.",
      "rating": 4.0,
      "verified": true,
      "author": "zbjs",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "Not made well",
      "text": "Worked good only for a year. Will not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201119
    },
    {
      "title": "Do not buy this heater",
      "text": "Within the first 5 minutes of turning it on, there was a pop, a white flash, and then it died. $350 down the drain.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20201122
    },
    {
      "title": "Try another brand.",
      "text": "Would not TURN ON.. Called SERVICE dept. Told to tilt backwards. Still not on. Service dept. Told to tilt forward ..Wouldn't turn on. Was a gift. Had no paper work. Would have to pay shipping cost. It's jut sitting on the patio. Can't give it away. As my old Dad always said. Live & Learn. Never Again with Pure Heat.",
      "rating": 1.0,
      "verified": false,
      "author": "Albert's View",
      "helpful_votes": 2,
      "publication_date": 20191120
    },
    {
      "title": "Power Switch Issues",
      "text": "I purchased my heater at local hardware store. Did great for a few months then the power switch went out, hardware store had a new heater in stock so we switched out, worked til spring. Only had it out for 2 months now and stopped working. I believe might be power switch again but impossible to find replacement switch",
      "rating": 3.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Does Not stay lit.",
      "text": "Do you see any light? NO. I have had this for 2 years. The light and heat keep going off. It comes back on when it feels like it. I’m very disappointed. When it’s on, it’s warm. It’s plugged directly into GFI outlet. I have tried everything. So frustrating.",
      "rating": 1.0,
      "verified": false,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Stopped working!!!",
      "text": "Just would not turn on I tilted it and did everything the instructions said ( which is very little) Cant find a number to call to find out how to repair or correct the problem . This tip thing you can hear rattling inside of the housing may be the issue. any suggestions?",
      "rating": 1.0,
      "verified": false,
      "author": "Ken W.",
      "helpful_votes": 2,
      "publication_date": 20190122
    },
    {
      "title": "Outdoor wonder....",
      "text": "The portability from garage to deck was just what my house needed! Ideal for entertainment any guest outdoors!",
      "rating": 5.0,
      "verified": false,
      "author": "DFA",
      "helpful_votes": 0,
      "publication_date": 20190705
    }
  ],
  "product_meta": {
    "title": "pureHeat Garage & Patio - Energy Efficient Floor Heater",
    "rating": 3.8,
    "feature_bullets": [
      "WEATHERPROOF DESIGN- pureHeat PATIO’s ruggedness makes it a perfect fit for outdoor use. The aluminum body and design allows it to withstand the constant torture that mother nature throws at it. While it may not be ideal for monsoon weather, it certainly works in anything you would stay out in.",
      "SUPERIOR HEATING TECHNOLOGY- Using 3 different heating modes, pureHeat PATIO’s carbon fiber Element provides safe and efficient warmth without any dangers of Oil, Ceramic, and Quartz Bulb heaters. With an estimated lifetime of 5,000 hours this heating element will keep you warm for years to come.",
      "360° TIP-OVER SAFETY-Your safety doesn’t stop at the Carbon Fiber Infrared Heating Element! pureHeat PATIO has far reaching legs to prevent tip overs but, because accidents happen, it also has a built-in Tip-Over Safety Shut-Off feature that will turn power off if your heater ever gets knocked over.",
      "24 HOUR SHUT-OFF TIMER-Don’t worry about walking away and leaving your heater on. With pureHeat PATIO’s Shut-Off Timer, you’ll be able to set a desired shut-off time and know it will take care of itself. pureHeat PATIO also comes with a remote to control Power Modes and the 24 Hour Shut-Off Timer so you can make any adjustments from the comfort of your warm seat.",
      "CONVENIENT MOUNTING-Need to save a little extra floor space? Use the included Wall and Ceiling Mounts to remove pureHeat PATIO from your walking or sitting space. The unit connects easily to the mount and remains sturdy until it’s removed."
    ],
    "specifications": {
      "Item Weight": "13.78 pounds",
      "Manufacturer": "Greentech Environmental",
      "ASIN": "B076DFL6KH",
      "Customer Reviews": "3.8 out of 5 stars68 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#95,461 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Outdoor Heating & Cooling",
      "Patio Heaters",
      "Garden & Outdoor"
    ],
    "price": ""
  }
}