{
  "website_summaries": [
    {
      "verdict": "This best-selling traditional planner showcases high quality with a few key accessories.",
      "pros": [
        "Faux leather cover",
        "exterior pen loop, closing band",
        "2 ribbon bookmarks",
        "Interior pocket built into cover",
        "Dated monthly and weekly calendars",
        "Includes monthly view stickers",
        "Holidays and contacts sheets",
        "Opens flat"
      ],
      "cons": [
        "Black-and-white color scheme",
        "Bulkier than some buyers anticipated"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great dated planner for projects, work, school",
      "text": "Great planner! Ordered it in early June and was happy that it starts out in May so I only missed out on 1 month's use haha. Perfect for planning work projects and taking notes. Am too lazy to fill out those undated planners so I enjoy having it already planned for me in advance. Has a nifty spot on the side that holds and fits most of my pens. Looks very professional but is a little bulky for my small camera bag. Wished it was a little thinner somehow! Would definitely recommend though as a daily planner especially for work, projects, and school!",
      "rating": 5.0,
      "verified": true,
      "author": "Kibou 希望",
      "helpful_votes": 124,
      "publication_date": 20180620
    },
    {
      "title": "EXCELLENT PLANNER!",
      "text": "I normally purchase planners with a spiral binding, I find solid bindings tend to wear out with use, or fall shut instead of laying flat. I have had this planner for a few weeks, and I have had no problems! It lays flat on my desk so I can write in it easily. Binding is flexible enough to fold completely over, but strong enough not to wear over time. Lots of room for extra notes, large blocks on monthly calendar to fit multiple messages. I will be purchasing this for my husband to use for his business appointments!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Wheaton",
      "helpful_votes": 58,
      "publication_date": 20190106
    },
    {
      "title": "Great planner for the new term!",
      "text": "Purchased this planner for my first term of nursing school and I love the look and weight of it. The black exterior and binding is nice and feels more \"mature\" of a choice than other bright, clip art-like covers (but otherwise good options too). I think there are too many lined note pages after the months and weeks for what I would need but it's a good bonus in case I need that space for quick memos. This adds to the overall weight but I don't mind it. I ended up buying this over other planners because the photos showed a lot more space for Mon-Fri. Very useful to have a lot of room for college-level courses.",
      "rating": 5.0,
      "verified": true,
      "author": "Mistral",
      "helpful_votes": 50,
      "publication_date": 20190401
    },
    {
      "title": "My new go-to planner",
      "text": "I’m a huge Moleskine fan, and now I will say I “was” a Moleskine fan. I love the fact there are so many pages for notes, that’s exactly what Moleskine was missing. You have to buy multiple products to have that option. The layout is simple, and it’s exactly what I wanted. It’s as thick as a daily planner, but that’s due to the notes pages. The tabs they include are a really nice touch and it’s really adds to the fiction of the planner. I’m sold, this is an awesome product. If you need a great planner, this is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam B.",
      "helpful_votes": 53,
      "publication_date": 20181014
    },
    {
      "title": "Nice planner for work",
      "text": "Recently I was promoted at my job and had many new things to keep track of, more than I could keep in my head, so I decided to get a planner to carry to meetings and put notes in. I have messy and somewhat large handwriting so the large size of this planner is appreciated. It's nothing fancy, just a month view, then the days each week. Exactly what I needed. The weekly pages have little mini-monthly calendars at the top which is very helpful for keeping track of deadlines.",
      "rating": 5.0,
      "verified": true,
      "author": "Moro",
      "helpful_votes": 45,
      "publication_date": 20190423
    },
    {
      "title": "Great Look and Great Quality",
      "text": "I am very picky about planners and I love this planner. This is the second one that I have purchased. The paper quality is amazing, the paper is thick and doesn't smudge fountain pens. I love that it is has the monthly calendar before the daily break down of each month. It came with some great stickers for marking birthdays and appointments. There is also a section at the back of the notebook for notes and addresses that I really enjoyed. The cover of the planner is hard and sturdy. I use this planner every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylyn Belcher",
      "helpful_votes": 47,
      "publication_date": 20190115
    },
    {
      "title": "Hard to find planner & notebook combination -- both to last a year.",
      "text": "I'm away from my office a lot at work. It is very useful to have a planner with an abundance of notebook pages to last a year. I've searched dozens of planners on Amazon and am glad I purchased this one. Ample note space on the weekly pages to capture most notes while the extra note pages are great for capturing more information. I've been using a system like this for years and am 100% satisfied w/ this planner!! The cover is durable, of high quality and good looking. Will buy again next year!",
      "rating": 5.0,
      "verified": true,
      "author": "Us 5 Camp",
      "helpful_votes": 46,
      "publication_date": 20190122
    },
    {
      "title": "I had doubts, but I found the planner that is just right for me.",
      "text": "The cover has a pleasing texture. The pages are heavy and withstand erasures. The amount of space is exactly what I need. Nothing about this planner is frilly; it is sedate and serious and to the point. Two ribbon bookmarks are affixed. I use one for the month and one for the week. A stretchy band keeps the planner closed in my bag. I am a teacher and I divided the M-F pages into thirds for the three courses that I teach. The monthly pages are great for keeping track of meetings, drills, deadlines, and exam dates. I intend to buy this planner again for the next academic calendar-year.",
      "rating": 5.0,
      "verified": true,
      "author": "D. G.",
      "helpful_votes": 51,
      "publication_date": 20180811
    },
    {
      "title": "Absolutely perfect",
      "text": "This is a perfect planner. I'm a really particular person when it comes to planners. This one is very well made. It is small enough to fit in a medium-sized pocketbook , any tote, any backpack. The pen holder on the spine is brilliant. The month calendar with each week following it is a great format for me. The cover is really sturdy. I little bit grippy which is nice. One of the best features is that, when open, the planner will remain open with a simple rub of your hand to gently press it open.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Harkins",
      "helpful_votes": 51,
      "publication_date": 20180918
    },
    {
      "title": "Amazing quality, very professional.",
      "text": "This planner is amazing. The quality of the pages and how professional everything looks. Im OBSESSED with my new planner, and I will be buying this same planner for 2019. I love the pocket inside to store misc. things and I love the bookmarks. I also like that you can chose whether or not to attach the monthly tabs, I was bummed at first because it did not have this but to my surprise this was included for me to put on myself and i decided I liked the way it looked with out (more professional). My FAVORITE thing about this planner is all the note pages. This is what sold me. HIGHLY RECOMMEND!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer M.",
      "helpful_votes": 52,
      "publication_date": 20171220
    },
    {
      "title": "Professional Appearance",
      "text": "The features I appreciate most about the planner are the monthly overview, including inset calendars for previous and coming months, and the built in bookmarks (it has 2 strings and an elastic band to attached to the planer). The planner has a professional appearance, definitely appearing to cost more. It seems to be put together well; I'm about to test it out as today is the last day of my summer break. As a school administrator, I use an electronic calendar, but this planner allows me to make notes regarding a particular meeting or conversation to refer back to if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "G Mat",
      "helpful_votes": 43,
      "publication_date": 20180715
    },
    {
      "title": "Deceiving",
      "text": "The planner itself is so nice, and the packaging was great as well. BUT I ordered the 2019 planner, and was expecting to get that one like the pictures others have posted as well as the main photo, but they sent me a 2018/2019 planner that started in May of 2018! It’s January of 2019, what on earth do I need the past 8 months for. So disappointed, the planner was so nice, I would have enjoyed it. It’s a great planner if you get the right one!! Will be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexis Williams",
      "helpful_votes": 11,
      "publication_date": 20190109
    },
    {
      "title": "BEWARE NOT AS ADVERTISED",
      "text": "Absolutely not what was advertised!!!! Shows in photo as 2019 planner. When received it's a 2018-2019 planner. Its December and being given as xmas gifts. It goes from May 2018-June 2019 not Jan-Dec 2019 as described. So the several I bought are pretty much useless. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "April Gilmore",
      "helpful_votes": 9,
      "publication_date": 20181201
    },
    {
      "title": "Love it, beautiful, simple, well.done.",
      "text": "Pretty much obsessed with this! I like to think I BULLET JOUNAL but really I just use a calendar and do notes. This is perfect for what I need. Monthly calendars - weekly calendar - and then plenty of notes space. It's beautiful in a simple way, the pages are thicker than MS, 2 ribbons for place holders, and a sturdy binding. Perfect size for my purse, diaper bag, front seat etc but not too small to fit my daily activities. It also came with month stickers for easy access and a back pocket for stuff like important receipts, or other random stuff I think I might need later.",
      "rating": 5.0,
      "verified": true,
      "author": "hannah bowen",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Absolutely perfect.  Avoids all the problems of other planners like this.",
      "text": "I've been buying planners like this for a more than 10 years. The biggest problems with them are 1.) A wire binding that breaks or loosens releasing pages; 2.) Not enough blank pages to make notes; 3.) No lock or closure; 4.) No easy way to keep a pen handy for quick notes; 5.) Cheap paper the ink bleeds thru. 6.) A cheap cover that won't hold up for one year. --- This planner has none of those problems and is an excellent find. As long as they keep their price reasonable (NOT $30 OMG) I'll buy these forever. Sorry, Blue Sky, you changed your product and I found something better.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluestone",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "High Quality",
      "text": "Just ordered this lovely planner. The quality is evident. I will update if anything changes. The paper is beautiful ecru and thick, no bleeding. I loved the accessory tabs to put in (optional). They are convenient with calendar on the tab (see photo). You may place them where you like, and they can be removed if you do not want them where you put them. There are 2 bookmark ribbons (very helpful), a back folio pocket, and the reason I ordered- an elastic band to keep shut. I am very much looking forward to using this and seeing how durable it is over the next year.",
      "rating": 5.0,
      "verified": true,
      "author": "pmp1974",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "PERFECT COMBINATION",
      "text": "This is exactly what I had been lookig for! I now only need this instead of having a notebook for notes and a separate calendar... my purse is grateful for the space! The quaility of the paper is great! the space to write is just enough... THE ONLY THING IS ... THE MONTHS OF AUGUST AND SEPTEMBER ARE PRINTED TWICE AND BLENDED ON THE CALENDAR! But I need to start using it so Im just gonna keep it... HOPE THEY FIX THIS for the new prints! Other than that... I LOVE IT AND TOTALLY RECOMMEND IT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia",
      "helpful_votes": 6,
      "publication_date": 20171207
    },
    {
      "title": "Give Order to Your Life",
      "text": "Despite the myriad of digital tools, sometimes old school pen (or pencil) and paper works best and is simplest. This Planner is slim, yet has all the standard features. What I like best is the week at a glance (across 2 pages) that let's you organize highest priority tasks or meetings. This isn't for minutiae of the day, or long to-do-lists. Instead, this type of planner helps you get the high priority items of your life in order. Write them down, and there they are, easy to see and act on.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Silverstone",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Perfection!",
      "text": "This is the second time I am ordering this exact product. I had it in 2019 and it was invaluable! It has everything you need and nothing extra. I used the back empty pages to write random thoughts and stuff. The main pages with the dates are all correct and have just the right amount of lines. This is perfect for college students. The pages are made of good quality paper, there is no bleed through. One thing to note is that you have to put the month tabs on yourself. There's an outlined area where they should go but still it may not come out perfectly. It doesn't bother me, but it might bother you.",
      "rating": 5.0,
      "verified": true,
      "author": "Layla",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "PERFECT!",
      "text": "I LOVE this. It is exactly what I was looking for. It is well made, nice leather, sturdy and surprisingly allows you to open completely flat without looking like it is going to fall apart. The paper is heavy, the layout is perfect and the notes section size is perfectly large. Nice perk having the Holidays sheet in the front. I like the calendar stickers and appreciate that I can apply them, if I want, allowing you to either use them flush to the page or more as a tab.. OH and the little pocket in the back perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Very Nice Organizer",
      "text": "I love this organizer so far. The only things I do not \"love\" are the stickers that come with the monthly name tags also end up covering the notes space on the monthly calendar unless you cut the names off as I did to leave the space available for writing and that the organizer does not come with a place to put your writing utensil. Otherwise there is tons of space for notes, ideas, scheduling, contact information and any other items you may need. I love the extra pocket in the back as well!",
      "rating": 4.0,
      "verified": true,
      "author": "Lyssabby",
      "helpful_votes": 2,
      "publication_date": 20181204
    },
    {
      "title": "Simple, elegant planner that does what I need it to do",
      "text": "In this product I found a planner that met my needs perfectly. There is enough space for daily notes and reminders, including any appointments I might want to jot down for future reference. There aren't any snappy sayings or forms to fill out with all my life goals. For pure functionality, this is a good buy. There are many notes pages as well, and helpful calendars. The binding is solid, but the book opens and lies flat so it's easy on the writing hand. I have three photos, but I'm not sure how I attach them here.",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Talmadge, M.D.",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Love it! Worth every penny!",
      "text": "I love this planner. Its everything I need! I also love that my pens didn't bleed on the paper or through to the other page, which is usually my biggest complaint. The sticker tabs were easy enough to put on. I found them stuffed halfway through the planner. I also suggest putting the stickers on before writing, which as you can tell I messed that up in mine. It also lays pretty flat to make it easier to write on the inside of the pages. Overall the best planner I've gotten for school. Will definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "shannon_mpeterson",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Fantastic product!!!!",
      "text": "Absolutely fantastic product. Very nicely and strongly bound. The front and back covers are strongly made and would hold up perfectly. Pages are thick and do not bleed. Includes quick reference personal page, 2 year overview page, holiday page, 2 pages for contacts, monthly view as well as weekly/daily pages. Includes about 20 blank pages which is great for bills each month or journaling. It also came with month sticker tabs which is a great plus. I love this planner and cannot say enough! I cannot wait to try more products. Truly great product and can’t beat the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "The Sapp’s",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Excellent  Value",
      "text": "We switched from the Mole planners to this new planner and are very pleased with the change. We like the horizontal page format of two pages per week as well as the extra pages for notes and the full monthly planner pages at the beginning of each month. They've included a handy little elastic pen holder on the binding as well as two bookmark ribbons one for the calendar portion and one for the note portion. All in all I feel this is an excellent value and will be purchasing these again next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Eastern Shore",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Good solid planner",
      "text": "you would think in this day and age a good all purpose planner would be easy to find, however I have found a lot of them in the stores I don't like, or If I do like them I find the price unreasonable. This planner is a good balance of functionality, and price. I am very satisfied with this product. Why only 4 stars than? - well I will tell you, myself I like having tabs on my planner, + tabs are provide - you have to stick them on yourself (I would rather not), and therefore only real detractor to me. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Devine",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "It has everything needed",
      "text": "This is the second year I purchased this planner for my wife. Last year she was looking for a good planner that covered everything she needed and could not find one that was complete. We got this planner and she has used it the entire year. It lasts, survives heavy treatment and has the proper number and type of pages she needs. This second planner is the first time she wants the exact same planner again. The quality is great and the pages don't bleed thru like others do. The space to write is enough in the calendar pages. Good overall design.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Guzman",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "A Good One",
      "text": "Coming from an organizational freak, this is a really good, straightforward planner for the academic calendar. Plenty of room for Contacts and Notes, as well as a bonus little folder to tuck a few things in. Two place-keeping ribbons and an exterior elastic to hold bond. I couldn’t figure out at first why the Monthly tabs did not come attached, but rather separately as stickers that had to be individually attached by hand, but I guess it’s simply to provide the tabs as optional.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Happy purchase. Can't wait to use it!",
      "text": "I cannot wait to begin using this planner. I ordered one for 2021. I am presently using one that is somewhat similar, but the quality of this one appears to be superior in several aspects. Its appearance speaks of solid quality. I will especially appreciate the pen loop since that will prove to be quite convenient. Not only is the year represented well in both monthly and weekly contexts, there are also note pages in abundance. The heft of this is significant, but also reflects the quality of the materials used.",
      "rating": 5.0,
      "verified": true,
      "author": "p",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Would buy again,nice!",
      "text": "I ordered this for my husband for work. It feels so nice,durable,well made, it looks expensive. It comes in a gift box which is a huge plus if giving it that way! I loved the bonus stickers for the month, that we used as markers for each monthly calendar. It also has book markers built into the binding which helps keep important dates easily accessible. The pen holder is a super awesome feature that keeps my husbands habit of losing pens at bay. Overall for the price this product is definitely worth it! I would buy again, and i would give this as a gift as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Candis barnes",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Even better than previous years",
      "text": "We have gotten this planner each year for the past three years and have always found it very functional. This year's planner is the best yet. The cover and construction are sturdier and the pen holder is also stronger than last year's. We like this planner because it has everything we need to stay organized. There is plenty of space to keep track of things and the Month-at-a-glance is always helpful. It's a great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Reasonable price and Easy to Use",
      "text": "I used to own a lot of the smaller versions but there just not enough of room to write things. I wanted a planner for bigger projects. I didn’t need the extra lines and spaces. I just wanted a clean, simple design and a calendar. I was quite surprised to the quality of paper and cover for the price that I paid. I’m really pleased to find the fitting planner. The sturdiness is only four stars because it’s a very flexible cover. Not a hardcover, so the durability and flexibility makes up for the sturdiness.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Great value for the money!",
      "text": "I am very impressed with this year planner I received as a gift. I don't normally use one, but I'm excited to give it a try. It is nicely constructed and the pages have a nice heavy paper weight to them. They feel like they will hold up and pens will not bleed through. There is plenty of room for notes on the monthly and daily pages for each month of the year as well as plenty of pages for notes. My only hang up is it's too nice to just throw away when done. It cannot be reused or refilled.",
      "rating": 5.0,
      "verified": true,
      "author": "Mossy Creek",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "My new favorite planner!",
      "text": "I got this planner for the first time last year and has hesitant because I like to carry them in my purse. This thing is heavy duty and thick with all the extra pages, but it still fits in my (large) purse. I use it daily and love the layout of it. The paper is thick, so ink doesn't bleed. My favorite part is having 2 bookmarks so that I can easily flip between the month layout and the weekly layout if I choose. The stickers are a nice touch! Also, my pen holder never broke this year, so I was able to attach a pen to it at all times. Overall a great planner!",
      "rating": 5.0,
      "verified": true,
      "author": "Jana M.",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "2019 Calendar ends in June or July, only part of the year of 2019 included in this date book.",
      "text": "I liked the cover and the size of this date book, the paper has a nice weight and feel to it, the organization of the calendar book is professionally styled however, I disliked that the year 2019 ended in June or July and I really needed the entire 2019 calendar so, I had to return this book for this reason.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180914
    },
    {
      "title": "Amazing! What I've been looking for forever!",
      "text": "It's absolutely beautiful! The box the planner came in was shiny, glossy, and beautifully designed. The planner itself is very sturdy and durable. There's a pen-holder as well as not one, but TWO bookmarks--one for a quick flip to your month, the other for a quick flip to your week! You can tell that they care deeply about the details. The layout is very simple with adequate space. It's not overly decorated and they don't bombard you with stickers either. Overall, it's a very smart, productive planner that is essential for everybody.",
      "rating": 5.0,
      "verified": true,
      "author": "satisfied person, depends",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Nice one for my 2020 planning",
      "text": "Love this planner. Sleek. Pages are great quality. It has 2 ribbons attached to serve as dividers, along with the provided monthly stickers. So i.e if you decide to curb using the monthly stickers tabs, the ribbons serve a back up purpose in general. Plenty writing room. Plenty of extra pages in the rear for noting side material. It feels great. I utilize gel pens... like any paper ensure you allow a minute or two to dry. Pen strap along the side to secure your writing utensil of choice. I'm pleased! Will be a returning customer, yearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Willie J. 3",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Really good quality, I will continue buying these",
      "text": "I really like these planners. It looks professional at work, the pages are sturdy and the color is pleasant and not too bright. My last one lasted a year of daily use, which includes going in and out of my bag, without the cover scuffing, fading, or anything, and not a single page tearing. The last one I got was appointment style, but I didn't end up really needing that aspect so I'm glad I found this version! I've attached pictures of my 18-19 one. You can see the spine eventually cracked in the center, but it still feels completely sturdy, no signs of pages falling out.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis and Ella",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great size and quality!",
      "text": "I have started working 2 different jobs and found myself needing a planner! Both jobs require me to schedule myself, so I thought having a planner will help keep me organized. I love the size of the planner and all the extra sheets for notes. They come with stickers that you can create tabs with but I wish the tabs were already built into the planner. I also like that there's a slot for pens. I'm always losing my pens so it helps me keep track of it. Lastly, I do wish the weekly view included the hours of the day. It would help me visualize my days and weeks better.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Just What I Was Looking For",
      "text": "My calendar last year was ALMOST what I needed but was missing a few key features. This one has them all. Love the elastic to keep the book closed in my bag, love the pen holder so I don't have to go searching for one. Love that the weekly calendar is directly after the monthly calendar ( my last one had all the monthlies then the weeklies. Love the stickers to mark the months with tabs, love the pockets, love the space on the monthly calendar for notes/to do, and love that there are two ribbons bookmarks not just one. This is winner. Thanks you made the perfect calendar for my needs!",
      "rating": 5.0,
      "verified": true,
      "author": "Mamakat",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Terrific Planner",
      "text": "Has everything I look for: calendar months displayed on every page, month-at-a-view, page holder, place to hold notes/papers, pen holder, larger entry for days of the week vs weekend, and simple, elegant presentation. What it could improve upon are: tabs for months, more sheets for notes, and on a personal note, as an educator, I would prefer that it started in July, not May. All in all, an excellent product. Will definitely be ordering again next year",
      "rating": 5.0,
      "verified": true,
      "author": "catya",
      "helpful_votes": 2,
      "publication_date": 20180804
    },
    {
      "title": "Best purchase",
      "text": "So much room to write all I need. Nice weight not heavy. I like the binding the planner opens and stays open keeping its shape. Very professional product. No nonsense quotes or sayings plastered around. Has extra pages at end for note taking and an address book page section infront. The stickers it comes with is very handy and optional. I like the folder at the end. It helps to keep business card or check. The fited box it comes in is a great masculine gift box. White and thin gold stripe. Its vacuumed sealed. Making it super hypoallergenic no wearhouse smell. Arrived immediately with Prime.",
      "rating": 5.0,
      "verified": true,
      "author": "Elias",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Excellent quality planner",
      "text": "I got this planner to keep track of my classwork and research this year as I work toward my Master's degree. The most important feature for me is the weekly sections where you write your daily work, and this planner does a good job of utilizing the space available to give you as much room as possible to write. I like the sticker tabs they included for each month, too, and the planner itself is very durable. The only thing I dislike about the planner is that almost half of the pages are simple lined paper at the end, which just makes it thicker than necessary, since I don't expect to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "liromar",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "3/5 stars for personal preference  5/5 for product delivered.",
      "text": "3/5 stars for personal preference 5/5 for product delivered. I gave 5/5 rating bc nothing was actually wrong with the calendar. The calendar came in a beautiful package.. very nice. I can’t complain about the item itself. I just don’t personally love it due to very small differences that I’m used to. I really did not like that I had to put the stickers on myself for the months - due to the fact that I’m terrible at doing it and I would prefer that it came with tabs .. Im a creature of habit and I personally do not like the color paper ( off white -ish), the day of the week on the left side",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Professional looking calendar",
      "text": "I bought the calendar for work. I’m a little obsessive about the visual appearance of my calendars-I need different colors to distinguish week days and weekends. I looked at several office supply stores and bought one but then started looking on the internet to find better ones. I thought this calendar met my criteria for calendars and returned the one I bought from the store. The cover is thick but not too much for putting it in my bag-very slim but sturdy and looks professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Mustang93",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Simple and sturdy!",
      "text": "This is my second yearly planner from this company. I love the amount of space available for each day. And the pages are simple and blank (no decoration) so that I can customize and decorate myself (I made the pretty ribbons around the month/year at top of pages). This planner is smaller than my previous years planner so that I could easily bring it with me in my small backpack. I think it’s A little expensive comparatively to Other planners out there, but it’s worth the extra cost knowing it’s exactly what I want in a planner. I will continue to buy from this company in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Higham",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Just what I was looking for",
      "text": "I read so many descriptions and reviews to find a calendar/planner I like. This one is hardback, has an elastic closure and 2 ribbon bookmarks. The format is monthly/weekly with enough space to write what I need to schedule. Plus I love the lined pages in the back. I am always having to plan an event or trip and need enough space to jot that down in one place. The only thing I would like to change is the color. I was so excited to see a turquoise planner by this company until I realized the format was school year instead of calendar year. But I will enjoy using this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Perk",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Wrong monthly tabs",
      "text": "I am really satisfied with the quality of the planner. I was looking for something with blank pages in the back for additional notes. This was exactly what I wanted. Unfortunately the monthly sticker tabs that come in the back of the planner are wrong. Jan-Apr are for 2019(unusable, wrong dates for 2018). I didn’t recieve May-Aug. And there is a duplicate of Sep-Dec 18. The quality of the planner and the paper are top notch though... Update: the company sent me new sticker tabs. That’s customer service right there! Started using the planner and it’s everything I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Titi ",
      "helpful_votes": 3,
      "publication_date": 20171204
    },
    {
      "title": "Nice product!",
      "text": "When I received the day-calendar, it was well packaged. It has useful sticky tabs for the months which is great, but also had no direction for placement. You learn as you go. Tabs went higher than calendar had months. It has the calendar month before the individual days and that was nice, but I wish that some months wouldn't spill over to others. That could and probably will get confusing. Wish there were more color options. Overall happy with my purchase. P.S. I appreciated the attention given to a specific issue I had and the generosity shown by this company!",
      "rating": 4.0,
      "verified": true,
      "author": "melinda lockhart",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Perfect for what anyone!",
      "text": "This little gem will be perfect for my son’s freshman year. I looked around at other notebooks and was leery with anything having a binder. We all know those can catch on things and start to unwind...and the pages get torn out easily. This is not like that. It’s a sturdy bound notebook (good uplift material too!) with plenty of room in the pages to write down what’s due and when. There are page ribbons to easily find the week your on, a pen holder (so convenient!), a pocket folder in the back, and they sent stickers for the calendar month pages as well. Great price too! Will be buying again next year.",
      "rating": 5.0,
      "verified": true,
      "author": "NicoleM",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Fantastic planner",
      "text": "I ordered this planner because it looked small enough to keep in my purse but large enough that I could keep track of things. I have a very complex work schedule and need to have a functional planner to work out of, and this definitely met those needs. The cover is sturdy, the pen holder works well and is not loose, and there is plenty of space to write daily notes and mark on the monthly calendar spread, too. There are also plenty of extra pages for addresses (if you need that in today's tech age), generic notes, and a pocket in the back for those extra bits of paper and notes that don't go elsewhere. Overall recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great Organizer!",
      "text": "Pleasantly surprised with the quality of this organizer. I ordered the larger size so I can write more on each date. The cover is very durable. I am a student and it's perfect for writing down all my deadlines on the month view and then I can get more detailed on the individual day pages. Putting the stickers on the monthly pages were a bit of a nuisance and I wish I had applied them a bit straighter, but overall it wasn't too bad. I will definitely be ordering for next year. Kinda bummed that I didn't get it at the start of the year, I lost the use of several months. Very professional looking too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Pack",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Best Planner",
      "text": "My friend bought me this planner because I'm pregnant & cannot remember anything. It is fantastic! I have the calendar pages, then a section behind that to write down more info for each day, and a section in the back for list making, two differently colored ribbon book marks, a thick protective shell, a place to put a pen, an elastic band to keep it closed, and an envelope inside the back cover. It's the best planner I've ever had and I'm so excited to use it more.",
      "rating": 5.0,
      "verified": true,
      "author": "c",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Super Awesome Planner",
      "text": "This planner is just absolutely amazing. I love the sturdiness, and the thickness. It's extremely compact and will definitely get you organized with your daily tasks of living. I love the fact it has a pen holder and a back pocket inside to hold other paperwork. I has all the major holidays listed and an overview of 2020 and 2021 to plan ahead. I am a teacher so I NEEDED this academic planner in my life. I would definitely recommend all my teacher friends to buy this planner. Trust me you won't regret it. Love love love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Nice Planner",
      "text": "This is a really nice planner. It's not large so easy to transport. I like the way the months are staggered so you can easily align the monthly stickers. The pen holder and the band to keep it close makes it very practical. My only complaint is that the pages are an off white color. My preference is a bright white but it's not a big deal just my personal preference. I would highly recommend and next year I'll be buying another one.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Sturdy, great paper quality.",
      "text": "let me preface this by saying that I tossed the Moleskine and the Leuchtturm planner for their thin awful paper. Yes I did. Because this Lemome planner is bomb. The paper is thick and cream colored (much kinder to my eyes). It lays flat, the cover is solid and I like the crosshatching design. The weekly spread is spacious (wide ruled lines), the monthly spreads are just right and the side add-ons are not annoying or take up too much space. I use this for simple scheduling, no artistic stuff, but I feel tempted because this paper is good. And I am sold for 2020",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "I love my new planner, and what a good deal!",
      "text": "I'm really impressed with the quality of this planner. It was a really great value for the money. It was well packaged and came in a nice box. The seller's contact info was included in case of any issues. Pages for contacts and the list of holidays is really handy. I like that there are a ton of plain notebook pages in the back. I like the tabs for the months. The size is perfect and there is plenty of space to write in daily items. The texture on the cover is nice. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "O. D. Book Reviews",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "One of the best calendars on the market!  Great value!",
      "text": "I have gone through countless calendars trying to find the perfect one. This calendar is the best by far. I selected the 8 1/2 x 11 in brown. It looks and feels like leather and is well bound. So nice to not have a spiral ring binding that gets in the way when you try to write on a date right next to it. The monthly and weekly format give you plenty of space to write your appointment details plus notes. I may be one of the few remaining using a \"paper\" calendar, but if you are in the market for the best, this is the ONLY option you should consider!",
      "rating": 5.0,
      "verified": true,
      "author": "Luv2Fish",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Not full 2019 year, just half of 2018 and half of 2019",
      "text": "I thought I ordered a 2019 planner based on the title. But it was a 2018/2019 planner it’s from May 2018 to June 2019, which is disappointing since its January 2019 and I was hoping for a planner for the full year. But the planner is great quatlity and I love that it has a bunch of lined paper in the back for notes and the organized tabs. I just wish it had the full 2019 year like the title said, a little deceiving.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah R. Brandt",
      "helpful_votes": 2,
      "publication_date": 20190113
    },
    {
      "title": "Excellent value. Beautiful. Well made. Couldn't be happier.",
      "text": "When ordering I was already thinking this was a great buy. But now that I received it, I'm even more excited. This is an awesome journal. Not only is this the exact format that I was looking for to journal my day trading, it is also a much better quality than I thought the price suggested. I love the pen holder and elastic band to keep the journal closed. The paper quality is excellent and I like the light printing and stickers. The end of the journal includes lined pages for general writing. The lines are dashed in case the photo does not make that clear. Easy 5 of 5 stars. Customer for life.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Kim",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "best value planner on the market right now",
      "text": "I really like this planner, it has all the features one would want. There are plenty of pages at the end for notes, there are daily pages like most other planners, monthly calendar marker for each month. The paper quality is good - its thick and ink doesnt flow through. I also like that it is full size as I tend to write big. It also has a pouch at the back to keep cards and paper. A pen holder. Leather quality (not sure if its faux or not) is professional. It has 2 ties to act as bookmarks. Overall i think this is best planner available around $20 range.",
      "rating": 5.0,
      "verified": true,
      "author": "The.Saint",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Must purchase organizer, planner, and notebook!",
      "text": "One of the best daily use planners. I’m able to use the monthly view calendar to take notes of key events and the weekly/daily section to write down more details of the key events. There is also a note section at the end of the planner - with enough pages - giving me the option to use this planner as a notebook as well. Seriously, awesome product - great quality, and diverse use. Recommend purchasing for all professionals!",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Kim",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great quality for the money, but sadly ends in December",
      "text": "I bought this one in particular because I saw the stickers went all the way up to April 2020. Unfortunately when the planner arrived I found out that the actual calendar pages only go up to December 2019. Not a deal-breaker per se, but I wanted it through 2020, so I thought that's what I was getting. Otherwise, the quality is great, it's pretty heavy and durable. The pages are nice and smooth to write on and the little monthly tab stickers are a fun addition! I also like the pocket in back to put any loose papers or business cards.",
      "rating": 5.0,
      "verified": true,
      "author": "Genagirl19",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Best Planner",
      "text": "I recently purchased you 2019-2020 Weekly/Monthly Planner after seeing son use his for his college courses. It’s is well constructed and looks professional enough to use in the office. I like the color tabs provided, but I wish there were instructions or recommendations for placing them. I placed them as tabs, but then they extend beyond the covers. I believe they will snag and become a nuisance. I should have placed the flush to the pages.",
      "rating": 5.0,
      "verified": true,
      "author": "RC2",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Could be better",
      "text": "I'm really disappointed with the tabs it comes with. I really love the quality of the planner and it's exactly what I wanted, but you have to put the tabs on yourself. Also, they are flimsy paper so they constantly rip or detach from each other. I regret putting the tabs on because I love these planner without the pads.",
      "rating": 3.0,
      "verified": true,
      "author": "Kobusjul",
      "helpful_votes": 3,
      "publication_date": 20180426
    },
    {
      "title": "Fantastic Planner!",
      "text": "What sold me most on this planner was watching the video describing it. Last year I purchased a larger sized planner (different brand) so it would lay flat. This one is smaller, fits better in my bag & lays flat. Has plenty of blank note pages & love the pocket in the back as well as a pen holder. I purchased one for me and one for my husband & one for my daughter after she saw how great they were. Also, love that there are 2-page marker ribbons. My only change would to be to make the cover smooth not textured-I like to use it as a pad when signing papers or taking quick notes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Beautiful and well laid out",
      "text": "Very attractive & professional appearance. This is my second year purchasing. There is a nice monthly view followed by weekly views that give plenty of space to write in appts, info, etc. I use it to track my work accomplishments to make annual appraisals easy to write. I also put in reminders, appts, birthdays, etc. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "popsykle",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great planner for an amazing price!",
      "text": "I loved my 2020 planner so much that I just had to get the 2021 planner. It’s so sturdy and the paper is just the right thickness that it doesn’t bleed through. I also love the monthly tabs so that I can quickly flip through and double strings to hold my place in two separate places! Overall one of the best planners for an amazing price!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great planner! Try it out.",
      "text": "The planner is very durable. I am not sure if I will use the month and date stickers but they are nice. I really like the fact I won’t need a notebook to take notes in. This planner has a lot of blank pages for note taking. The paper used for the planner is very thick!!!! That’s a positive for me. I wish they had an option for additional colors but this will do. Another plus is the pen holder. Overall I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "K. F. Miller",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Handy Organizer, Great Quality",
      "text": "Bought this to help My son organize his school work and after school robotics sessions. The book is a nice quality leather and feels very sturdy. I like the elastic that keeps it shut until you want to open it and the 2 ribbons that let you mark different pages. It also has a pen holder, envelope to hold papers and sticker tabs to mark each month for quick reference. My daughter wants one now so looks like I’ll be ordering another one in teal! Nice organizer for the cost. I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barrett",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "This Planner Has Some Date Typos",
      "text": "I’m giving this 3 stars because it’s a nice quality planner with thick paper and various choices of monthly views. Plenty of room to write. Would have been 5 stars, but the small calendar shots showing future months are INACCURATE - someone did not proof this very well before it went to print. I think an important feature for any planner are those small reference calendars that show future months as a quick guide to find dates ... but not with this calendar because the future dates on many of those months are wrong.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara L West",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "The only planner I will ever use!",
      "text": "I'm in love with this planner, coming from a previous planner novice. The layout for this planner is amazing! It's very user friendly (especially for newbies). Lots of room for daily brain dumps. I switched to a 6 months planner so I can get on track for getting one of these for the for the same calendar year, but OMG do I miss this one. Ugh, I'll never go back to another planner. January can't get here fast enough, so I can start one of these planners again!",
      "rating": 5.0,
      "verified": true,
      "author": "Emma J Waits-Miller",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Way Better Price than Staples or OfficeMax/ Excellent Quality",
      "text": "I have been pleased with my 2020 Weekly & Monthly planner. It has a executive look with the Black leather feel & the Royal Gold 2020 print on the Cover. Inside the planner there is plenty of room to write notes/reminders/important dates/ journalize..You also have a Great size Calendar Grid inside for every month along with mini-calendar dates at the top of each page. The added bonus of two Ribbon page holders/spacers are great. You honestly get more than what you pay for with this product. Beats the High Pricing of Staples & OfficeMax The quality is way better than that cheap stuff you buy at a Walgreens or CVS...",
      "rating": 5.0,
      "verified": true,
      "author": "Rif",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Have I found my perfect planner?  Yes!",
      "text": "I am very particular about my planner and this one seems to be as close to perfection as you can get. I love that the planner can lay flat, the cover feels and looks like leather, the pages are thick with a3 month reference at the top, a deep pocket to hold items in the back and tabbed monthly stickers to customize your journal, 2 satin book markers and it all came in a nice white gift box sealed closed. When I first received it I thought it was an apple product.",
      "rating": 5.0,
      "verified": true,
      "author": "JDK",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Very nice date book",
      "text": "This was very well put together and looks like it is going to be very durable. I like that it has ribbons that you can use to keep track of certain pages so that you’re not having to flip through and find the current day in the process of making an appointment. I also like that there is an elastic band to hold it shut. Also, there is a little folder type envelope in the back where you can stash small papers, receipts, or notes.",
      "rating": 5.0,
      "verified": true,
      "author": "BillieG",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Favorite planner by far!",
      "text": "Planner is very sturdy which I like. One thing I hated with planners were the sides and corners folding in. There's no way this one will do that! The pictures show the available pages in here and it all that I need. A plus was the little pouch that at the end you can place small cards and papers as well as the colorful tabs to find your place much easily. The price is a little higher than I normally spend on planners but now I know why. Great find!",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Solid purchase!",
      "text": "Cover - sturdy with dense cardboard, does not bend much. Great quality! Pages - I can't say enough about the pages. The paper is thick so the marker doesn't bleed through. It's also slick so any pen and marker writes really nice. Layout- pretty typical for a weekly planner. The journal paper in back is almost half of the book. I would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Note pages galore!",
      "text": "The bad: On the weekly pages the weekend is split in half. This seems to be the trend in most planners but I would have loved to see a full block for each day. The great: Lots and lots of note pages. This will be my work planner and those many pages eliminates the need for a separate notebook. The rest: The paper is fairly thick; ghosting with a juicy rollerball, fountain pen and gel inks, bleed-through with felt tip pens. I enjoy the beige pages and the softness of the print, though it ghosts, as well. Overall, nothing too obtrusive. I love the pen loop in the spine and it lies flat with minimal training. Minimal and classy.",
      "rating": 5.0,
      "verified": true,
      "author": "Trish",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great planner! Love it!",
      "text": "I researched a lot before buying the perfect planner. This one hit all the marks. I love the soft leather feel, the tabs for each month, the full month view, plus weekly pages, extra note pages and the two tassels for bookmarking. A huge bonus! The only thing I miss is a to do list on the side of the weekly pages, but I can get over this and create my own in each day/ week. Great product, can’t wait to use in 2020.",
      "rating": 5.0,
      "verified": true,
      "author": "OreoCrazy",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Great price!",
      "text": "I thought I might be a bit cheap to get this one given the low price, but I'm realizing it was thrifty instead. Great price, sturdy, and feels good in my hands. The pages are a rich creamy color and they cover weeks, months, and the entire year at a glance. Really fantastic back pocket too, holds the organizational stickers in the back. I wish there was a bit more for the pockets, so I wasn't as worried things might fall out. But it's still real good.",
      "rating": 5.0,
      "verified": true,
      "author": "Cas Herring",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Good Planner",
      "text": "Bought this for my girlfriend. She's the nerdy type. She loves it! I got it almost halfway through the year, but she said how it was laid out and that it includes the months and also weekly pages that it was perfect for what she needs. I got her the bigger size, as her handwriting is big, and she says she has enough room to write and still read it afterwards. It does have a bunch of lined paper in the back and a pocket on the back cover as well. She finds it 'really handy'. I think i'll be getting her the 2021 version by the end of the year at this rate!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Douglas",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Great planner",
      "text": "Pros: The outside has an attractive embossed pattern on it. The pages are smooth to the touch and have a weighted feel (it doesn't feel like flimsy paper). The weekly layout is great and there's plenty of room to write. I love the fact that there are multiple bookmarks, an elastic strap to keep it closed, and sticker tabs to easily locate where a month starts. Overall, would say this is a great planner. Cons: Not crazy about the texture on the outside. Would prefer a smoother texture, not something so rough. The planner's height and length are great, but it's a little too thick. I could personally do without so many extra pages just for notes.",
      "rating": 4.0,
      "verified": true,
      "author": "RZ",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "PERFECT planner for business!",
      "text": "This is the perfect business planner! I love that each day has the ability to write notes on them. I’ve been using it to write notes for upcoming meetings on those days. Plus, all of the extra notes pages makes it so much easier to write more details. This has eliminated the need for me to carry more than one notebook at a time. I will be ordering one every every year. This is truly the most perfect planner I’ve ever found.",
      "rating": 5.0,
      "verified": true,
      "author": "HRinAZ",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Everything and more",
      "text": "I have gone through every type of planner and have finally found one I love. Pages don't bleed through. Having two ribbon bookmarks is something that missing from many planners when flipping between monthly/weekly views. Planner actually has strap closure, that I did not realize it had but my old planner had and really like. Only \"down\" side is the sticker tabs - no instructions, so I did the first month wrong but figured out how they were to be applied quickly afterward. Being left-handed, the fact that this planner lays flat is wonderful - no more rings or spiral binding to get in my way. At the price point, you cannot beat this planner.",
      "rating": 5.0,
      "verified": true,
      "author": "An Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great Planner - I just got it and I'm using it already!",
      "text": "I am so pleased with this planner! It's so much better than what I was expecting, because most basic planners aren't that great overall, just functional. I chose the brown cover, and it's nice looking. Gold stamping on the cover, pages are heavy, there are alot of lined pages in the back and it has a nice pocket inside the back cover. I have no doubt it's going to get through the rest of 2019 intact. I will definitely try to get the 2020 planner for next year. BTW - This one covers January 2019 through December 2019.",
      "rating": 5.0,
      "verified": true,
      "author": "Psl6248",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great product-will buy another next year.",
      "text": "I use this calendar to keep up with my work activities and I really love this calendar. I like the large area to write information on the date. Also, like the month at a glance so you can annotate any appointments for the month and see them ahead of time to help plan out your month. Really enjoy the pocket in the back to help keep receipts in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Very high quality calendar/planner book",
      "text": "This weekly-monthly planner is perfect for my needs...I can stay organized, plan ahead, make important notations, etc.. This book is durable, sturdy, has lots of writing space, 2 ribbon bookmarks, an extra pocket in the back for receipts, colorful stickers for indexing pages and the calendar boxes are plenty big enough to make notes. The paper is very good weight and quality and the binding is strong yet flexible. The cover is beautiful. Love this book!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee L.",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Best Planner for Busy Mom of 4!",
      "text": "I love this planner so much I bought it again this year. It's perfect for keeping up with the schedules of a family of six! It is well organized with a month view and weekly views with plenty of space to write in actives, appointments and to do lists. I especially like that there are a lot blank pages in the back, so I can keep all my notes and dates in one place. The back pocket is handy also. This is my favorite little book!",
      "rating": 5.0,
      "verified": true,
      "author": "Colbey Sparkman",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "This looks classy...",
      "text": "This is much better quality than I expected and the paper is pretty thick. I wouldn't use a sharpie, but I never write notes and appointments with a sharpie. I do, however, use gel pens, so the thick paper is a good thing. It has sticker tabs for the month, and you can choose to apply them. I like that the date blocks in the montlhy calendar are big enough to write appointments/assignments. I'm both a nurse and returning student so planners work well for me, since my phone is more of a distraction.",
      "rating": 5.0,
      "verified": true,
      "author": "e dem",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Professional Looking",
      "text": "Just received it & I wish I could post pictures😭😭 Its really sturdy ; both the pages & the cover. Comes with sticker tabs which i love😍 Excited to start writing on this❤️ UPDATE: Was able to add a pic & videos😍 hope it helps if you are on the fence of buying thiss.",
      "rating": 5.0,
      "verified": true,
      "author": "Yessenia H",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Great Quality!",
      "text": "Now that we are working from home, I needed a nice planner to keep me organized. This planner is of great quality and visually appealing. The leather cover is soft and the pages are great. Just what I needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great planner with good quality paper and cover.",
      "text": "Really nice planner! Great layout with room for daily appointments as well as your standard month view. I love the sticker tabs for each month. The pocket in the back is wonderful! (I use it for sticky notes) there is a hefty section in the back of lined paper, which I find super useful for various reasons. If there were a 4.5 rating that is what I would give. The “I am a gift” box was a little cheesy and not what i was expecting.. for a handcrafted company.. shoot for something more natural.. brown paper with a clever sticker design.. anything other than the gaudy white and gold box. (My opinion) hope this helps!",
      "rating": 4.0,
      "verified": true,
      "author": "Starstruck",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great for college students and anyone who wants to be organized!!",
      "text": "This planner is amazing! I got it a couple days ago, and I couldn't wait to start using it. I began writing down everything from what I need to do to what I am thinking of doing on a particular day. It has been a great help in keeping myself organized, as I am a college student. It also feels amazing. This planner has a great sturdy feel and look! It has a pen holder for my favorite pen, and a pocket in the back cover for anything you need to keep in there. It is just a great choice and I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Saint-Louis",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Best purchase I've made this year so far",
      "text": "I absolutely love my new planner calendar here. As soon as it came I was excited to use it. The paper felt lovely against my hand as it glid across the page. The beige paper is very easy on the eyes. In the little tabs make it really easy to access all months. What I like the most though is that I have a calendar and then I have detail as well so I can go back and forth. Great products very professional very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. James Wayne Shaw",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "4/5 product",
      "text": "The product was better than I expected. I liked the strap that prevents the notebook from opening and the strap from the spine that holds your pen. It makes it very convenient that I do not have to leave a stray pen around. The biggest reason why I chose this instead of other notebooks was because of the string bookmarks it came with; however, I didn't know that the monthly tabs were just stickers and you had to manually place it on. Despite this small inconvenience, the sticker is NOT flimsy and definitely has a premium feel to it. So in other words, you can peel it off and stick it back without a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Maisee",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Worth the price!",
      "text": "I needed a planner for this semester and I’m really satisfied with this one so far! It gives me plenty of space to write out what I need to do for each day, it has a calendar layout for each month, tabs for easy use, and 2 book markers. The cover is a nice material although I do with it was hardcover it’s still a very good quality planner for the price. I would def recommend to anyone looking to stay organized whether you’re a student or not :)",
      "rating": 5.0,
      "verified": true,
      "author": "zenobia",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Nice Planner",
      "text": "I liked this planner for its sturdiness and very classic design. It is a heavy duty one, with high quality cover and paper. So for the quality I would give it the highest rate. However, I would appreciate if they include more parts for monthly goals, and a little bit more space for creativity. Literally, if I want to set my weekly or monthly goals I do not have any place to do that in this planner. But again the overall quality if very high!",
      "rating": 4.0,
      "verified": true,
      "author": "Thoth",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Good stuff!",
      "text": "Actually a great planner. I didn’t expect it to be this great for the price! I’ve had multiple people comment on it or ask about it, and they’re surprised when I tell them where I got it. I’m also very picky about the layout of my planners, and this one is great. Each eeek takes up one spread, so each day has plenty of space. A monthly calendar is also included before it splits up into weeks, so that’s nice to have an over view before getting more specific with weeks/days.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Marshall",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Looks like a nice option",
      "text": "I am pleased with the weight and quality of the cover and pages. It's quite complete in its offerings. My only gripe is the month tabs, which show so nicely on the product page, are DIY. As you can see from my photo, they're not the easiest to make look \"professional\". Maybe it's just me and I should have had someone else do it? The stickers ARE fairly easy to reposition and don't tear the paper. But I gave up.",
      "rating": 4.0,
      "verified": true,
      "author": "J-Mo",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "I'm Very Happy",
      "text": "I order a calendar like this every year off Amazon from diff suppliers of different designs. This, upon my first inspection, is a very well made and good looking calendar. It feels like it will be durable and its good looking too. Each month has a large section after breaking down each day so in depth and detailed notes can be made about the notations on the main two page calendar. I am very happy. Unlike in the past I will re-order this specific one next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Iseedumbpeople",
      "helpful_votes": 0,
      "publication_date": 20181227
    }
  ],
  "product_meta": {
    "title": "2020-2021 Planner-Academic Weekly and Monthly Planner, 5.75 \"x 8.25\", Thick Paper with Saffiano Leather, Back Pocket with 88 Notes Pages",
    "rating": 4.7,
    "feature_bullets": [
      "· Academic yearly planner July 2020 - June 2020, featuring 12 months of weekly/monthly pages/holidays marked. With Weekly/Monthly sections, help you manage your life efficiently|achieve your goal perfectly.",
      "· Come with 16 months 2020-2021 calendar stickers. Past and future monthly referencing in monthly planning pages|use the notes column for your to do list/important projects.",
      "· Durable crosshatch leather hard skid resistance cover, excellent texture. 2020-2022 yearly holidays lets you master the holidays clearly. The planner offers unruled monthly pages/ruled weekly layouts for detailed planning.",
      "· Thicker/off white paper is used in this 2020-2021 planner. No bleach, which can adequately protect your eyesight. The planner is resistant to the most passionate artist giving reduced bleeding issues, environmentally production with vegan raw materials.",
      "· The elastic closure keeps it securely closed|The elastic pen loop is always available for your pen held well|You can make a better mark with 2 bookmarks|calendar stickers|Exquisite box|Inner pocket, it is convenient for you to pack business cards."
    ],
    "specifications": {
      "Manufacturer": "Lemome",
      "Brand": "Artfan",
      "Item Weight": "15 ounces",
      "Product Dimensions": "8.4 x 5.7 x 0.9 inches",
      "Item model number": "LMPLANNERBLACK001DATED",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Material Type": "Durable faux leather hard skid resistance cover",
      "Expansion": "11.4 Inches",
      "Size": "5\" x 8\"",
      "Sheet Size": "5-x-8-inch",
      "Line Size": "8.4 Inches",
      "Manufacturer Part Number": "LMPLANNERBLACK001DATED",
      "ASIN": "B076BKJCK3",
      "Customer Reviews": "4.7 out of 5 stars5,118 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#675 in Office Products",
      "Date First Available": "October 10, 2017"
    },
    "categories": [
      "Calendars, Planners & Personal Organizers",
      "Office Products",
      "Planners",
      "Planners, Refills & Covers",
      "Office & School Supplies"
    ],
    "price": 20.69
  }
}