{
  "website_summaries": [
    {
      "verdict": "Choose this weighted blanket if you are looking for a child-size option. The included cover is a bonus feature.",
      "pros": [
        "Designed for children over 5 years old",
        "A good choice for calming anxiety and soothing youngsters to sleep",
        "Comes with a cover that's easy to wash and has a soft texture",
        "Decent price"
      ],
      "cons": [
        "Some owners wish it were a bit longer",
        "Fill tends to shift, resulting in uneven weight distribution"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worth the $$",
      "text": "Being used for a 36 lb three year old who has never slept well and has sensory, language, behavioral issues. He always kicked off his blankets and wound up freezing by morning. The weighted blanket stays put and helps ground him while calming down to go to sleep. It's really been worth every penny. The cover is soooo soft and silky. I really need one of these for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Drug Waitress, RNTop Contributor: Baby",
      "helpful_votes": 116,
      "publication_date": 20180505
    },
    {
      "title": "Just okay -- blanket itself is not washable",
      "text": "The blanket is okay, but it slips around easily in the blanket cover even though there are several ties to try to keep it in place. The more aggravating factor is that the outer cover is washable but the actual blanket is not, which is a problem when you have a toddler using it and he accidentally wets the bed when he is sleeping, thereby wetting the blanket cover through to the actual blanket. I wish I had known that the actual blanket was not washable and that the cover was not waterproof before I bought the blanket. An expensive lesson.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann Huber",
      "helpful_votes": 59,
      "publication_date": 20181206
    },
    {
      "title": "Better sleep for our child (and us!)",
      "text": "Our 4 year old daughter has ADHD and would take up to an hour to go to sleep every night. (She would be hyper and get up and play, keep going to our room or our son’s room.) She would also have vivid nightmares that would cause her to wake up crying and come wake us up in our room almost every night. We’ve had this blanket for almost two weeks and it has been amazing. She has been falling asleep pretty quickly and also has not been having nightmares. The blanket is also really soft and breathable (I was worried she would get too warm.) We are very happy (and less sleep deprived) with this blanket!",
      "rating": 5.0,
      "verified": true,
      "author": "MrandMrsC",
      "helpful_votes": 60,
      "publication_date": 20180422
    },
    {
      "title": "Great sleep has worked wonders",
      "text": "I don’t know why I waited so long to get one of these blankets. I’ve been reading about them for years. When my little guy started having trouble-sleeping, anxiety, and behavior problems-I remembered this blanket and ordered one as fast as I could. Great sleep has worked wonders!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Adams",
      "helpful_votes": 52,
      "publication_date": 20180609
    },
    {
      "title": "Great for anxiety",
      "text": "It has really helped my son sleep better for naps and bedtime with his anxiety. He now feels like someone is with him, so he is sleeping longer stretches for naps and during the night, making everyone more rested and happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Callie",
      "helpful_votes": 38,
      "publication_date": 20180331
    },
    {
      "title": "It's super soft and the texture helps with calming him",
      "text": "My son has Autoimmune Encephalitis and has lots of newly developed sensory issues. This blanket has been an absolute blessing! He has difficulty making his needs known at times and was becoming aggressive with hospital staff. Since we received the weighted blanket, those issues have significantly reduced and he will ask for his blanket when he feels overstimulated. It's super soft and the texture helps with calming him. Thank you for an incredible product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 34,
      "publication_date": 20180424
    },
    {
      "title": "DO NOT BUY THIS BLANKET. Spend a little more and buy quality!",
      "text": "I am not one to leave bad reviews but if I were you, I’d want to read this before buying such a high priced blanket. All the beeds have shifted to one side and are not evenly distributed. I bought this for my 8 year old son, after i myself bought a $300 one. He has ADD and i was hoping this would help him sleep better. I tried it out the first night and awoke to beeds on one side instead of throughout. I wanted to save some money and buy him one but after seeing the difference in quality, it appears the more expensive brand is worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "kirsten",
      "helpful_votes": 8,
      "publication_date": 20190117
    },
    {
      "title": "Game changer, and separate duvet cover is the best part!",
      "text": "Not a magic bullet, but certainly was a real turnaround for one of my three year olds being able to fall and stay asleep. She wasn’t excited to have a different blanket than her twin sister, but since it was a comforter with a separate duvet cover, I was able to put the weighted blanket part of it in her existing duvet cover from ikea, which were the same size, and she loves it (not sure she realizes it’s a different blanket from her sister).",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley - Designer/TwinMomma/Exercise Nut",
      "helpful_votes": 11,
      "publication_date": 20180825
    },
    {
      "title": "Excellent blanket!!",
      "text": "This blanket has been a life saver for my toddler. He is special needs and has anxiety issues and restless legs due to his disability, he is blind and has sensory issues and this blanket has really calmed him and helped him sleep better. It’s an excellent choice for anyone with anxiety (adults included) you won’t be sorry for this purchase one bit!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Zakowski",
      "helpful_votes": 12,
      "publication_date": 20180531
    },
    {
      "title": "COZY AND PUTS ME TO SLEEP",
      "text": "I wasn't sure why I needed a weighted blanket, but now I know why. I've been using this blanket as a couch throw and it really puts me to sleep in <15mns. I think it's because I feel like I'm swaddled in it like a baby. The blanket doesn't feel heavy rather, it feels like you're tightly tucked in bed. It is super comfortable and extremely cozy. I don't know why I didn't jump on this purchasr sooner. Another plus: My dogs absolutely love being under the blanket! You can wash the outer covering as it assembles like a duvet. The teal color is beautiful. 100% recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Lumanauw",
      "helpful_votes": 10,
      "publication_date": 20180311
    },
    {
      "title": "One Star",
      "text": "Didn't help my autistic son at all. All of the weighted material inside shifts to one corner.",
      "rating": 1.0,
      "verified": true,
      "author": "BabyBlueTV",
      "helpful_votes": 14,
      "publication_date": 20180406
    },
    {
      "title": "Kid friendly!",
      "text": "We bought this blanket for our 3 year old son. He is a light sleeper in general, and hasn't slept through the night since he was a baby. A friend recommended a weighted blanket - and although I was nervous this was going to be too heavy (he's 30 lbs) it's just perfect for him. He has slept through the night since we got it, and even his babysitter commented how much energy he had in the days to follow! Only downfall is that is is thick minky material, and he does get warm. We put him to bed in shorts and a tshirt and he's good to go, however. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Grace",
      "helpful_votes": 7,
      "publication_date": 20180918
    },
    {
      "title": "Doesn't Distribute the Weight!!!",
      "text": "Based on the reviews, I thought my autistic son would love this blanket. Unfortunately, that's not what happened and the return date passed two weeks ago. These blankets are supposed to distribute the weight evenly and this product most certainly does not. No matter how tightly I tie the weighted insert to the tabs inside the cover, it always comes undone.",
      "rating": 1.0,
      "verified": true,
      "author": "Meggin L.",
      "helpful_votes": 8,
      "publication_date": 20181109
    },
    {
      "title": "the blanket is amazing! i find myself with it on the couch ...",
      "text": "i bought this for my 4 year old who has trouble falling asleep. when it is bedtime he will lay in his bed and he will be quiet, however, he is always restless. hours after bedtime, he is still awake. i noticed differences in his sleep habits after the first couple days. the blanket is amazing! i find myself with it on the couch when he isn't home! its super soft and is easy to wash as well! definitely plan to buy more for my other children!",
      "rating": 5.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 4,
      "publication_date": 20180716
    },
    {
      "title": "Easy to wash, comfortable",
      "text": "My kids don't have any sensory issues, but they love these blankets. Covers are easy to wash and the ties inside keep the weighted blanket in place. I was hoping the blanket would help my kids feel snuggled in the night, resulting in less wakeful, restless nights. Two weeks in that hasn't proven to be the case, but they love the blankets and carry them around the house to cuddle them.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Murray",
      "helpful_votes": 6,
      "publication_date": 20180919
    },
    {
      "title": "Really Good Quality.",
      "text": "Very happy with the quality. I bought this for my 4 year old to use at daycare. Smaller than a twin sized bed. It is perfect size for my kid to use at daycare on his napping cot, or at home as an additional blanket on his bed. The duvet is awesome! Good Quality. The seams look clean, the zipper is working well and smooth. The tabs for tying the duvet to the blanket are necessary with it being weighted and work great. The tie into additional loops on the blanket. Then a zipper along the long direction of the blanket make it easy to get the cover off and on.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Olson",
      "helpful_votes": 3,
      "publication_date": 20190326
    },
    {
      "title": "Great blanket for kids!",
      "text": "I was looking for an affordable weighted blanket for my daughter (after she kept trying to steal mine!) and found this. Love that it came with a cover, as a separate cover for a weighted blanket can be $30+ on its own. It is great quality and the cover is a very soft minky. Easy to secure and will be easy to clean! I looked over the stitches and everything looks great. I would definitely recommend this for those with kids-- probably too small in size for an adult, but I actually have been enjoying using it as a lap blanket when she's not using it so that's an option too.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin K.",
      "helpful_votes": 2,
      "publication_date": 20190330
    },
    {
      "title": "Great for my 6yr old daughter",
      "text": "Bought this for my 6yr old daughter who is always wanting to have multiple blankets on her for comfort. She absolutely loves this and even though it's heavy for her to carry she takes it back and forth from her bed to couch all the time. I only wish the squares were smaller. The cover that comes with it is extremely soft, but was a little too loose for our comfort so we kept it off for now. Worth the money for any parent who has a child that has a hard time sleeping or just likes to snuggle all the time. 😁",
      "rating": 5.0,
      "verified": true,
      "author": "MJB Tech",
      "helpful_votes": 3,
      "publication_date": 20190621
    },
    {
      "title": "It is comfortable and it helps stress and anxiety.",
      "text": "My oldest son who is 6 who has asd and sensory processing disorder enjoys this blanket. For me it was a win/win situation. Since the blanket is \"2 ply\" my oldest son can enjoy the actual blanket. While my youngest son (who enjoys accessories) can enjoy the outer blanket. (The two blankets zips up to become one.) I have noticed a big change in his behavior since he got the blanket. The price is a tough nail to swallow but when it comes to making your child comfortable, you do what you can to help relieve their stress. (Weighted blankets are expensive. Period. )",
      "rating": 5.0,
      "verified": true,
      "author": "adam",
      "helpful_votes": 3,
      "publication_date": 20180623
    },
    {
      "title": "Comfy, cozy, covered in nubbies!",
      "text": "This blanket is amazing for when my kiddo needs a little reassurance and some calm down time. It is rather heavy and warm, so he doesn’t sleep with it on all night, but it’s helpful when getting him to calm down while having relaxing on the couch or having quiet time before bed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180320
    },
    {
      "title": "Good",
      "text": "So I have a love/hate relationship with this blanket. I got the king size one for my bed and the instructions didn’t explain well enough how to attach the cover and the weighted blanket together. After messing with it for a while I finally figured it out. I will say that this blanket has helped me sleep MUCH MUCH better and helps a lot with my anxiety. The part that annoys me is because the blankets are tied together ,the inside which has the weighted beads is constantly having to be pulled back into place where it belongs.....and this blanket is not light! Otherwise I highly recommend it and I will be buying another one",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Schroeder",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Sensory kiddo finally sleeping!!!",
      "text": "My 2yo kiddo has never slept. Like, ever. Someone suggested a weighted blanket and I was willing to try anything. They went from waking 3-5 times a night and only sleeping 6-8 hours (and no naps, NOT enough sleep for a 2yo and they have always slept this way) to sleeping a solid 10-13 hour night every single night and a 2 hour nap almost every day. I’m so pleased and we’re all healthier and happier with more sleep in our lives.",
      "rating": 5.0,
      "verified": true,
      "author": "Shortnforgetful",
      "helpful_votes": 2,
      "publication_date": 20190611
    },
    {
      "title": "Great weight.",
      "text": "Love this blanket. Child feels snuggly. I wish i had not ordered the warm cover though. I need a thin cover for all seasons then use a warm blanket along with this for the cooler nights",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 3,
      "publication_date": 20180628
    },
    {
      "title": "10 stars",
      "text": "This is exactly what I was looking for and it’s perfect!! Love that it comes with the cover so makes it easy to clean! Would give 10 stars if I could. My son loves it. He has SPD, ADHD and this has helped so much",
      "rating": 5.0,
      "verified": true,
      "author": "Mandi",
      "helpful_votes": 3,
      "publication_date": 20190520
    },
    {
      "title": "super soft.... even the seems",
      "text": "so i have bought many from this company. i used a 20 pound, my son and daughter both use 5s. the Teal 5 pound one though basically fell apart in the wash as soon as i got it. i removed the insert like your supposed to and noticed almost all of the \"ribbon ties\" on the inside were basically unfinished and frayed apart and all the seems in the ribbon ties pulled out. also the seem thread holding the zipper on came does about 3 inches and i had to hand sew it all back up and reinforce it with additional tack stitching.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Singletary",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Filling shifts in blanket",
      "text": "Why does it seem like all the filling is shifting all to one side when you hold up this blanket? I was hoping to find one where the beads stayed in place in their own square! This is not one of those blankets, totally shifts and really not happy about that and will have to return! Please comment below if you have a weighted blanket where the glass beads or whatever the filling stays in place! Other than this issue I have no problem with the blanket, soft etc",
      "rating": 3.0,
      "verified": true,
      "author": "Mommaof3boys",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Very comfortable!",
      "text": "I use this blanket for my 3 year old son who has trouble falling asleep since his Dad passed away. His Dad always snuggled with him until he fell asleep and now he struggles to relax at night. This blanket has helped him get comfortable and relaxed more quickly and easily. We love it! I want one for myself now!",
      "rating": 5.0,
      "verified": true,
      "author": "RobbieBurke",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Not sure yet... not completely washable and expensive for a blanket?",
      "text": "So one night with this product, couple concerns: How do you clean it if a toddler pees the bed? The outer cover isn’t waterproof and you can’t wash the inner glass beaded cover. Hmmm.... $44 for a small blanket that it already put together (mine looks worn, like someone put it together, used it and then returned it) although directions stated how to put it all together. Will update if it works for my 3 year old and stays up on him at night...",
      "rating": 2.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Amazing blanket, zipper breaks easily",
      "text": "My 4 year old has sensory processing disorder. We bought this for him to help him with calming. We were very very excited for this. He loved it the minute we removed it from the package. Unfortunately the zipper broke within hours of opening the package and the covering flips over the blanket itself. The weight does not stay spread out and lumps to the bottom of the blanket. He is still very much in love with this blanket and it does wonders for helping him calm. I wish the zipper didn’t break the first day so he could enjoy it the way it was meant to be.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Haag",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Good buy",
      "text": "5lb blanket for my 31lb son who is on the spectrum and has a hard time self soothing himself to fall asleep and has to snuggle up with me or dad in order to do so. This soft blanket has worked wonders to help him fall asleep. There is less sneaking down the hallway because he can't fall asleep now that he has a weighted blanket. My only gripe is that it's a hassle to attach the blanket back to the weighted portion of it after washing it. Once you spend 20 minutes figuring out how to attach the blanket back correctly you're good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "April Nixon-Tarkington",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Helping make bedtime a happier event",
      "text": "This blanket has helped my four-year-old stay in bed at bedtime. We’ve had nights where he just can’t stay in bed long enough for his legs to stop moving. But the number of times he pops out of bed since we’ve started using this blanket has sharply decreased, and there have been several nights where he stays in bed after tuck in. I think this blanket has set us up for success. I feel like I’m putting him in a hug when I drape it over him.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth K.",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Its Magic!!!",
      "text": "My son was having a difficult time falling asleep and staying asleep. I mean it was soo bad to where we could spend 4-5 hours up in the middle of the night trying to do everything to get him to fall asleep. He was recently diagnosed with Autism and after doing some research, I found that weighted blankets work really well. Well let me tell you, I tried this for the first time and its MAGIC!! My son went to sleep right away. No fussing, fidgeting or anything. He slept all night long and finally got some good rest. He was even able to take a nap during the day. I am so happy I bought this for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Absolutely amazing! There is obviously some awesome comfort that takes ...",
      "text": "Our autistic granddaughter has trouble shutting down at bedtime. Her Mom put the weighted blanket over her inside her crib the last 4 nights, and she goes completely still & quite then off to sleep. Absolutely amazing! There is obviously some awesome comfort that takes place. We are so excited about this blanket!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 3,
      "publication_date": 20180420
    },
    {
      "title": "Awful",
      "text": "No recommended. The weight is not evenly distributed. Just a lump of weights in a soft cloth bag moving all over the place. For this price I wish that I had returned this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Customer ",
      "helpful_votes": 3,
      "publication_date": 20190920
    },
    {
      "title": "Beads bunch up, pointless design, don't purchase",
      "text": "Poorly made. It's falsely advertised that it's stitched so the beads are evenly distributed but that is a lie. They are not secure inside the blanket and end up bunching in every corner or in random spots making the weighted blanket pointless and/or uncomfortable. It's worth it to pay a little more and get a better product than to deal with this cheaply made product.",
      "rating": 1.0,
      "verified": true,
      "author": "Beth Delery",
      "helpful_votes": 2,
      "publication_date": 20191002
    },
    {
      "title": "Better sleep and oh so cozy",
      "text": "My husband travels for word and I never sleep well when he is gone. I decided to try a weighted blanket. I like that the very soft chenille cover can come off to wash it. The blanket it'self is WONDERFUL! Who knew a weighted blanket would make such a difference?!? I'm sleeping better and waking up less in the night. It's warm, which right now is lovely. I'm not sure how much I'll use it come summer.",
      "rating": 5.0,
      "verified": true,
      "author": "SandyJanssenBarry",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Soft, evenly distributed weight",
      "text": "Soft outer cover with inside weight evenly distributed. Bought this for my 35 pound 4 year old son. So far so good. (Mostly) has been sleeping through the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian122",
      "helpful_votes": 3,
      "publication_date": 20180129
    },
    {
      "title": "Great sleep aid for kids",
      "text": "This was a gift for my 8 year old granddaughter, who has had trouble sleeping through the night since she was a baby. From the first night, this weighted blanket (I told her it was a hug blanket) has given her an uninterrupted night’s sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Holland",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Wrong blanket sent",
      "text": "When I purchased this item the description said 20lb weighted blanket, and in my purchase history it still says 20lbs. However I received a 15lb blanket and they have since changed the product description following my purchase. Decent product quality but I payed for something that would typically cost more. Unfortunately, I opened the box a little too late to allow a return. I purchase this back in December and I pulled it out of the box in March.",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Amazing!",
      "text": "Our 4 year old has had major sleep issues since day 1. She loves being cuddled. This blanket does just that. She stays wrapped up in it and is now staying in her bed all night. It’s a miracle. I can’t believe we never tried this earlier.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "good items for helping children reduce anxiety at night",
      "text": "my grandson who is 3 has difficulty staying asleep at night and often winds up waking up my daughter and son in law. I am mm a MH therapist and work with the autistic population and sensory processing issues in young children. this blanket is supposed to help with nighttime anxiety as well as the weight gives a child a sense of security and grounding. I think it's well made and my grandson just loves it. He's less anxious but I think his pattern of getting up at night is what needs to change.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen H.",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Weight does not stay evenly distributed and poor ties",
      "text": "I bought this blanket and one from another company. Both blankets have a soft minky cover but the other blanket I purchased is nicer for 2 reasons. First, the ties in the other brand are made of a material that stays tied. This blanket's ties are made of a silky material and do not stay tied therefore the weighted blanket does not lay well inside the minky cover. Second, the weighted beads in this blanket do not lay evenly. The weight always falls to one side rather than being distributed evenly. The other brand I bought is quilted with the beads evenly dispersed with in quilt so the weight stays distributed evenly throughout the banket.",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Beads move, but all in all works great!",
      "text": "I bought this for my husband. He says he has been sleeping better, but my only complaint would be that despite there being separate stitched pockets where the beads sit- they still tend to move and pile at one end if you’re not careful or if you move a lot in your sleep. Husband said it doesn’t take long at all to get used to the weight and he enjoys it!",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Helps my toddler fall asleep and stay asleep",
      "text": "My 3 yo has always been a terrible sleeper, it’s hard for him to fall asleep and stay asleep. This blanket helps with both, no more tossing and turning! We’re all sleeping better now that he’s not waking up constantly and he’s getting the rest he needs. Worked since the first night we put it on and the material is quite soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Flowers",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Weight not evenly distributed",
      "text": "I bought this for my toddler to help with sleep. It was disappointing to say the least. The weighted material moved around a ton in the blanket and is hard to keep evenly distributed. I’m actually very surprised by the good reviews. Makes me question the validity of these claims. The weighted blankets that have stitched squares work much better to keep the Weight evening distributed. I have one of these for myself and love it so much. When he’s older I’ll most likely buy him something similar.",
      "rating": 2.0,
      "verified": true,
      "author": "Dane Miluski",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Weighted Blanket",
      "text": "We purchased this blanket for our grandson who has sleeping issues. He seems to enjoy the blanket, however it seem rather heavy to me. I think three or four lbs would be better. Also the glass beads do not stay spread through the blanket. His parents have not yet tried to clean it so can not comment on that aspect of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen T. Haynes",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "A good night sleep will he had with this blanket.",
      "text": "My son loves the weight and feel of this blanket. Will often find him in same position when he uses this blanket. It has improved his quality of sleep when he uses it. He uses it often enough. Some nights he sleeps so heavy he may have an accident. I throw in the wash and do a soak, wash and 2nd rinse to clean it. I find the cover to be a bit annoying, so we don’t use it. The size is not suitable for adults to use. My son is 9.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Too hot to handle",
      "text": "This is a nice looking blanket, however I can't use it. I am an individual that is cold all the time. This blanket was so hot with my pjs on, I took off all my clothes and was still sweating. I thought at first it must be because the cat is laying next to me. I tried this blanket again this year without the cat and still was so hot and sweaty. I bought this blanket to try and get a better nights sleep, but instead got a worse nights sleep. I would not recommend it to anyone. I should have just sent it back. Lesson learned.",
      "rating": 1.0,
      "verified": true,
      "author": "spartan93",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Amazing product!",
      "text": "1, this product is amazing! Super high quality. So my 5 year old is having trouble sleeping through the night. I used This on him last Night and he slept Through the night! The way the weighted blanket ties to the minky blanket to keep it in place, is genius! My son wet the bed and the blanket was wet. I took off The minky and washed with ease. I have never purchased another weighted blanket, but won’t need to. The quality, is amazing with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon Weiss",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Best blanket for sensory needs",
      "text": "My son is autistic and he used to sleep under 5 different blankets because he likes to feel weight on him while he sleeps, I thought of this type of blankets cause he wears a vest in school that’s also weighed and calms him down, I went for this one and I don’t regret it, he used this blanket only! Last night and he was very happy and comfortable, slept all night too. I’m really happy about this",
      "rating": 5.0,
      "verified": true,
      "author": "sabrina",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Comfort",
      "text": "Love this blanket. It’s soft and easy to clean but most of all, it does what it’s supposed to. My 19month old is a contact sleeper but sometimes I need to get things done during his naps. He’ll usually wake up within 5 minutes of me sneaking away from him. This blanket helps him feel safe and snuggled, it’s the only way he’ll sleep without mommy.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Frayer",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "It's been amazing for us.",
      "text": "My 4 year old grandson was having trouble waking up in the middle of the night every night. I ordered this for him and his mom and dad are so happy because he's slept thru the night every night since it came. I'm so pleased that I also ordered one for my house when he sleeps here!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Matlack",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Blanket Slips Around in the Cover",
      "text": "The blanket slips around in the cover really badly. The weight is nice and the cover is soft but the weighted blanket doesn’t stay flat inside the cover. It’s really annoying for kids with SPD and OCD. It was an expensive mistake. 😔",
      "rating": 2.0,
      "verified": true,
      "author": "Mom of Boys",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Sensory Integration Disorder",
      "text": "My son was recently diagnosed with Sensory Integration Disorder. This blanket in just days has kept him his bed at night. He goes to sleep so much easier! It gives his body the deep tissue pressure it desires and gives him a sense of being in the bed. Hard to explain in few sentences but I know it was one of the best choice we’ve for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel",
      "helpful_votes": 2,
      "publication_date": 20180422
    },
    {
      "title": "Mostly as expected",
      "text": "This blanket came with a plush duvet cover that I love!!! Blanket weighs 20 lbs as advertised. I only wish this blanket had larger glass beads instead of the sand size beads. It seems as if they shift more often than I would like them too. Other than that I love this blanket.",
      "rating": 4.0,
      "verified": true,
      "author": "Abysmal delight",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Just what he needed",
      "text": "My son needed a weighted blanket as he would carry around the biggest heaviest blanket he could find in the summertime to sleep with. We live in the south so it gets hot. He loves the weighted blanket as he still gets what he is looking for, the weight, without the bulk.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather L.",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Soft, comfy blanket",
      "text": "I was hoping this would help my daughter sleep all night long and stop waking up. It hasn't really done that, but it is super soft and she does like sleeping with it. I think just the thought that it is supposed to help her sleep has helped the most. She has had a few bed wetting accidents and I have had to wash this blanket. Both the cover and the actual blanket can be washed, which is great! I do wish it was a little bigger. My daughter is almost 8 and average size. This barely covers her from shoulders to toes. Overall, it was worth they try at this price. She still loves the blanket.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Keiper",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Don't buy",
      "text": "This blanket had all the sand shifted to about three of the squares and no other weight in any other part of the blanket. We went on vacation and when I returned and tried to return the blanket, the time frame of return had expired.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole Fisher",
      "helpful_votes": 2,
      "publication_date": 20190722
    },
    {
      "title": "Feels like a big hug all night.",
      "text": "We bought this for our grandson who gets very anxious at night and did not want to stay in his bed all night. This has given him a sense of security feels like a big hug all night. My son and daughter in law are very happy that I got this for him he sleeps much better now",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Cole",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Comfortable and nice weight",
      "text": "I bought this in an effort to help my very sleepless child relax at night. He likes the way it feels on him and we are very happy with the blanket. The instructions say dry clean only but we had a spill and had to put the whole blanket in the washer. I was nervous that it would ruin it but it turned out fine. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Wilson",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Worth the purchase!",
      "text": "I’m SO glad I purchased this blanket for my toddler. I own a 15lb weighted blanket and it puts my other child right to sleep. My toddler needed a blanket for daycare so I searched and voila. It’s super soft and the color is rich. It’s a good weight and very easy to transport. I recommend this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Very small",
      "text": "This is very comfortable. However, it is too small or short for my 4 year old boy. I think he likes it but it does fall off his body easily and then the beads shift and the weight is unequally distributed. I would be curious if the larger versions are keep the weight evenly distributed? This may just be the way weighted blankets are? I’m going to attempt to return my blanket and try another larger blanket from andiffeeent company. Overall this blanket is very soft.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181229
    },
    {
      "title": "You are going to be very pleased, a very good investment!",
      "text": "Better than expected, I am thinking of replacing the other one that I have already to one of this ones. I bought a smaller size from Walmart but definitely you can’t compare the quality of this blanket with the Walmart one. Planning to buy another one! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JMV",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Flaws",
      "text": "While I am happy with the softness, ours came missing the ties on the sides. Without these ties the entire inside slides into the middle and you cannot fix it unless you lay it flat, grab it and move it back. The beads also slide into one spot making the weight totally off. I wouldn't say I'm happy with this purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "My vote",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Awesome!",
      "text": "My son is 2 years old and is on the autism spectrum. He always seemed to have trouble staying asleep until I read up on these weighted blankets. Found this one and it seemed to help him a lot!!! I kid you not he sleeps all night now without waking up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Perfect for 6 and under. Highly recommend it!!!!",
      "text": "Amazing for my SPD daughter. I was desperate to try anything and this really calms her down at night. My only 'complaint' is that it is a little small for my age 7, totally Ave size kid. But it is exactly as described. Next year I will have to size up so it covers her feet and shoulders (she's very particular!) And this barely does.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandman Incognito",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great blanket!!",
      "text": "VERY nice blanket. We did 5 lbs for ny son with autism. He’s 13. He doesn’t prefer very heavy things but loves soft. This is so soft and do much nicer than the older style weighted blanket we have. My daughter even wants one!",
      "rating": 5.0,
      "verified": true,
      "author": "meghan tarantino",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Not what I was hoping for.",
      "text": "I bought this for my ten year old son to help him sleep. The problem with this is that is slides down inside the blanket and then all the weight gets stuck on one end. I have honestly seen no differences in his sleep since I have bought it.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Walters",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "🌟🌟🌟🌟🌟",
      "text": "I cannot believe what a restful nights sleep I’m now getting! Why didn’t I have one of these years ago? Great for any age above 3/4. Great gift for Christmas, birthday or for when your child goes off to college.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Hamilton",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Soft but clumpy",
      "text": "I bought two blankets of different brands. They both look the same and have very soft covers. My boys love them. However, this one clumps more so doesn’t lay as flat or distribute weight as evenly. Also, there are only ties inside the duvet at the corners and one on each long side so the weighted blanket inside keeps shifting around. I prefer the Keeptop brand.",
      "rating": 3.0,
      "verified": true,
      "author": "emeraldkrc",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Weight shifts everywhere",
      "text": "My son was so excited to receive this blanket and immediately curled up on the couch with it. Unfortunately, we have had it for 3 days and are returning it. The weighted part of the blanket is tied to each corner of the inside of the blanket which does not help with weight distribution. Once the weight has shifted, it is very difficult to get it redistributed. We got frustrated with how difficult is was for him to use without all the weight bulking up in one area. I am going to try one that has the weight in quilted squares so this will not happen again.",
      "rating": 2.0,
      "verified": true,
      "author": "Alison Garrett",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Not what I was hoping for",
      "text": "I wanted to love this so much. The information said this blanket had even weight distribution but but once my granddaughter picked it up all the weight stuffing went straight to the bottom. I was so disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Nan",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Very soft and seems that it will wash well.",
      "text": "Really nice blanket. My son loves it. We snuggled under it on Christmas morning and he wanted to use it Christmas night also. He said it felt good when I laid it over him. He is almost 6 years old but only weighs about 34 pounds.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules chime",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Perfect for my ASD son!",
      "text": "My son is 5, nonverbal ASD and SPD. The fabric being soft was so important. Glad I found this one! Not only does he love his new blanket, but it helps provide the weight/pressure he needs while he is self-calming. He loves it and I do too!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180622
    },
    {
      "title": "Cover is really bad. Does not work well with the blanket .",
      "text": "The weight and the actual blanket was great. But the cover for it well not so great. It don’t stay with the weight of the blanket. Only ties in the corners and the blanket is heavy so the cover is slippery in the inside and just don’t move well with the blanket. Works great without the cover.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Jimerson",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great purchase and beads don’t shift!",
      "text": "This is an awesome weighted blanket especially for little ones. The heads don’t shift and they are always even throughout the blanket, which is not the case with most weighted blankets in this price range. It is extremely soft and very easy to clean and take the cover off.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel S. ",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "4 year old with ASD",
      "text": "This has worked perfectly for my son with ASD. Cover comes off easy for cleaning. I fabreeze and hang the inside weighted blanket out in the sun so the UV can knock out some of the kid stink lol",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Wolan",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Defective",
      "text": "It was so soft but all the weighted beads came to the side versus staying where they belong. This is not what a weighted blanket should do. Will be returning and I’m so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "jmwalp",
      "helpful_votes": 2,
      "publication_date": 20190115
    },
    {
      "title": "Granddaughter approved",
      "text": "Purchased for my 5 year old granddaughter to help her sleep. She loves it and once she falls asleep seems to keep her comfortable. Good quality and not overly heavy for a small child. Quick delivery and I would purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela R",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "I LOVE this.",
      "text": "It's been a bit hot SOME nights even with my A/C on but in winter in Maine it will be wonderful. I bought a twin 10 lb for a double bed. Plenty of weight for one person and not as unmanageable to move around as a double would be. I like my feet out for instance.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Tallberg",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Good quality and very soft",
      "text": "Bought for my 3 year old grandson that has sleep issues. It's very soft and perfect size. I feel like it's the perfect weight. Definitely seeing improvement in his sleep and he loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Gaines",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "blanket",
      "text": "love this blanket. My great grandson is Autistic and very vocal. When he get's loud and starts screaming, and my granddaughter wraps him in the blanker and within a few minutes he calms down.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Partridge    NO",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Luxury!!!!",
      "text": "This blanket is BEAUTIFUL! I may have to return it as it will be heavy for travel. My 2 year old is still tossing but I may give it another try it may be better when shes 3-4. Yet it such a great blanket! So soft and luxurious! Buy it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dallas",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Perfect for a child",
      "text": "Bought this for our 7 year old and they LOVE IT!!! Took the comforter off their bed b/c they only want to use this now at night. Also drags it out for movie time on the couch. GREAT BUY!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Norville",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Weight shifts",
      "text": "The weight on the blanket shifts to one side of the blanket. I was looking forward to using this for my son, but I have to keep readjusting it to try to evenly redistribute the weight. For the cost of the blanket, I was expecting individual squares under the minky cover to help keep the weight stable throughout the blanket. The cover is great, but the weighted blanket itself is ineffective.",
      "rating": 2.0,
      "verified": true,
      "author": "SlowChurned",
      "helpful_votes": 2,
      "publication_date": 20181128
    },
    {
      "title": "Keep looking",
      "text": "Keep looking. All the beads get stuck on one side of your child moves around at all. Then it’s takes a lot of effort to try and distribute it evenly again. Very disappointed. There’s are much better ones out there.",
      "rating": 1.0,
      "verified": true,
      "author": "parents of 3",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Good, comfy blanket",
      "text": "My son absolutely loved the material and it wasn't too heavy for him, albeit a bit small. Unfortunately, one of the center ties was missing. That's not enough of an inconvenience to return it, though. Had it been a corner tie, I would have returned the product. Overall, the product lived up to the expectation.",
      "rating": 4.0,
      "verified": true,
      "author": "Sisi",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Great product.",
      "text": "I bought these for my grandchildren who are both on the spectrum. They (and their parents) love these blankets. Both children were sleeping better after the first night. They also wrap up in them while reading because they've said it makes them feel like they're getting hugged. Wonderful solution for sensory overload after school.",
      "rating": 5.0,
      "verified": true,
      "author": "Penn60",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Helps settle down my preschooler",
      "text": "My almost-four-year-old was really struggling at bedtimes and had a hard time settling down, even for naps at school. He hadn't napped in over a year. After introducing the weighted blanket, he now regularly sleeps at school and our bedtime struggles have reduced quite a bit. He loves the texture and softness of the blanket, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin M",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Great quality, super soft, 5 stars!!",
      "text": "I got this blanket for my 4 year old son.. He doesn't have autism but is a sensory kind of guy and doesn't like to be uncomfortable. I thought he might like the feeling and maybe it would give him some comfort and help him sleep. He loves it! The quality is great! the stitching is strong. There are sewn in loops for the duvet cover and it doesn't slip at all. The duvet is soft but not hot and I love that is was included, all with prime shipping. It is filled with glass sand rather than poly pellets so it is not bulky or loud. I would definitely recommend this blanket.",
      "rating": 5.0,
      "verified": true,
      "author": "OliveFish",
      "helpful_votes": 6,
      "publication_date": 20180226
    },
    {
      "title": "Wonderful",
      "text": "my grandson suffers from sensory issues and apraxia....most night he is very restless and kicks a lot during his sleep. This has been wonderful for him! He's sleeping better through the night and his kicking has ceased. Thank you for the wonderful product at an affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Great blanket, good for anxiety",
      "text": "This blanket is so soft and just the right weight for my son. I love that the cover is easily removable and washable. The blanket is easily maneuverable. You can take it with you!",
      "rating": 5.0,
      "verified": true,
      "author": "TJ Aldrich",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Beads pool at end but company made it right!",
      "text": "Update, the company contacted me to make this right. Great customer service The beads all shift to one end. It says compartmentalize to avoid this, but not true",
      "rating": 4.0,
      "verified": true,
      "author": "karen riddle",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Great purchase!",
      "text": "I bought this for a 4 year old who doesn’t like sleeping all that much. We call it his “hug blanket” and he’s a fan! I like that this one came with a cover and has ties on the inside to keep the blanket and cover together. Pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "H. A. Nicholson",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great for ADHD/Sensory overload!",
      "text": "My 3 year/36lb son used this blanket for the first time today during his nap and woke up a completely different child! He struggles with sensory overload and was very stimulated before his nap. This blanket has helped him calm down immediately and woke up clam, relaxed and content. A rare sight these days. This is a life changing blanket!!! Get it and enjoy watching your child not struggle as much anymore!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Supertino",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "good for older adults not able to use the 15 pound coverlet",
      "text": "I purchased the 5 pound coverlet for my 94 year old father. The weight was just right for him at night. We had purchased a 15 pound coverlet, but it was just too heavy for him to sleep under. I used the coverlet a few nights and may go back and order one for me for the winter. The cats liked it too.",
      "rating": 4.0,
      "verified": true,
      "author": "deb",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "they are SO relaxing and help us sleep better.",
      "text": "I have one of these blankets for myself, and I bought one for my eight year old. Now my teenager wants one...they are SO relaxing and help us sleep better.",
      "rating": 5.0,
      "verified": true,
      "author": "shoppinglover",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Helped keep my 2 yr old asleep after a couple weeks!",
      "text": "After about 2 weeks of use, my 2 year old stopped waking up several times a night. If I was you, I’d feel like “sold!”, and just buy it. Why? Sleep. Do you really need any other reason??",
      "rating": 5.0,
      "verified": true,
      "author": "Dmarie330",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Highly recommend",
      "text": "Beautiful and well made. This “magic blanket” helps my anxious six year old sleep through the night in her own bed. What a blessing. Wish we had bought this earlier.",
      "rating": 5.0,
      "verified": true,
      "author": "katy",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "My daughter loves it and so do I!",
      "text": "My daughter slept through the night without the tossing and turning. She was pleasantly surprised when she woke up in the morning to realize she slept all night!! Quality seems good and we have had no problems!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Sikora",
      "helpful_votes": 0,
      "publication_date": 20191112
    }
  ],
  "product_meta": {
    "title": "Roore 5 lb Weighted Blanket for Kids I 36\"x48\" I Weighted Blanket with Plush Minky Blue Removable Cover I Weighted with Premium Glass Beads I Perfect for Children from 40 to 60 lb",
    "rating": 4.6,
    "feature_bullets": [
      "💤This weighted blanket is engineered to be 8% to 12% of your body weight. The 5 lb 36”x48” blanket is perfect for children between 40 to 60 lb.",
      "😴Get even more value for your buck as this blanket comes with both the inner blanket and a outer dotted minkey duvet cover with a concealed zipper that can be fastened with corner ties to prevent any slipping.",
      "🛌With the two part construction, you dollars will go further as there is no need to wash the entire blanket. By simply removing the cover and washing the duvet cover, your blanket will be less prone to deterioration from rigorous washing cycles.",
      "🌜 Heavy Glass Beads are evenly distributed and compartmentalized inside the blanket to provide an even weight distribution that will not shift.",
      "💯 Satisfaction Guaranteed! No questions asked return policy. If for any reason you are not happy with your purchase, we will refund your order no questions asked!"
    ],
    "specifications": {
      "Product Dimensions": "18.5 x 13.5 x 5 inches",
      "Item Weight": "5 pounds",
      "Manufacturer": "Roore",
      "ASIN": "B0765NNXK2",
      "Customer Reviews": "4.6 out of 5 stars1,574 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#10,239 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specification met": "",
      "Batteries Required": "No"
    },
    "categories": [
      "Bedding",
      "Kids' Bedding",
      "Home & Kitchen",
      "Blankets & Throws",
      "Weighted Blankets"
    ],
    "price": 39.95
  }
}