{
  "website_summaries": [
    {
      "verdict": "A great reference book where you can quickly look up a specific command or library.",
      "pros": [
        "Lists out most of the important components, libraries, methods, and programming strategies of the Java language",
        "Easy to navigate to find specific information quickly"
      ],
      "cons": [
        "Not beginner-friendly for readers looking for a step-by-step guide book on starting to program in the language"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Here's how to download source code examples",
      "text": "This is a superb book, as are all of Schildt's. It is a huge defect that Amazon.Oracle/and McGraw Hill (the publisher) go to no effort to help readers download source code examples. I finally found it at  Thanks to the response below.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark E. White",
      "helpful_votes": 18,
      "publication_date": 20180115
    },
    {
      "title": "A must have reference book for Java 9 developers.",
      "text": "Herbert Schildt is one of the best authors for Java, this updated edition is a must-have for any Java developer. A great reference book that covers the new Java 9 recently released.",
      "rating": 5.0,
      "verified": true,
      "author": "Tomcat",
      "helpful_votes": 9,
      "publication_date": 20171011
    },
    {
      "title": "Excellent Java reference ( at least until Java 9 )",
      "text": "This is literally a Java manual for learning this amazing language. The reference will help you through your career. I currently use Java 8 and this book just helps me with anything. I mean, even an expert is going to find things in this book he/she didn't know. Simply put: an excellent reference book that has the basics of almost everything in the Java library.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Matute",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Should be 5 stars except for the version of kindle ...",
      "text": "Should be 5 stars except for the version of kindle: the exaples are so small and lightly printed, I bought a x4 magnifier to deal with this problem. The book is very well written ...",
      "rating": 4.0,
      "verified": true,
      "author": "Hao N. Le",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Great Resource",
      "text": "This is a great resource to have when learning Java. I found it to be an awesome add-on to my course textbooks. When I couldn't find the answer to my questions in my textbooks, I was able to look them up in this book. I love the detail. There were things I didn't know I did not know. It is definitely worth the money. I ended up getting an A in my Java class.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica B",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Great book for someone who wants to have some extensive ...",
      "text": "Great book for someone who wants to have some extensive knowledge on the subject of java. The collections framework piece as well as the applications into Java's GUI make this a solid piece to have around as a reference",
      "rating": 4.0,
      "verified": true,
      "author": "Trajon",
      "helpful_votes": 2,
      "publication_date": 20171214
    },
    {
      "title": "Chapters are well defined.",
      "text": "Awesome book, just one chapter reading the Generics with simple and easy to understand. Flow of information is well laid out and I would even suggest this book for total Java beginner as a course reference book.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Lam",
      "helpful_votes": 3,
      "publication_date": 20171214
    },
    {
      "title": "Great book for experienced programmers",
      "text": "I had taken one java programming course many years ago and wanted a book I could read though and get a good grasp of the language. This book has exceeded my expectations in doing that.",
      "rating": 5.0,
      "verified": true,
      "author": "dave schmid",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Great Book, but one request...",
      "text": "I love the book. It gives a nice sequential explanation of what goes on. However, a hardback version of this book would be nice. My book ripped.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Great Reference, not for absolute beginners.",
      "text": "This is a great book if you have some experience with Java and are looking to have a handy desktop reference available. New learners or novices may find the text overwhelming, as the book is quite long and the code examples are succinct and are only meant to provide a simple demonstration or \"proof of concept\" for the discussion of the topic.",
      "rating": 4.0,
      "verified": true,
      "author": "Gabriel Ceravolo",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Used as reference in College course along with textbook",
      "text": "Great reference guide for a student to use along with their textbook. Information contained is thorough and can help clear any questions you may have that your textbook does not make clear.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "excellent choice",
      "text": "great examples and very well written. The reading is easy and the application from book to programming is an easy transition.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin CTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Nobody signed for this, who is RORIE???",
      "text": "Book came with a broken spine. So there's a page where you can see the string and (lack) of glue. Works fine for now, but because of this, this book will definitely rip in half from repeatedly opening it.",
      "rating": 1.0,
      "verified": true,
      "author": "Dorick",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "One heck of a Java 9 reference book.",
      "text": "This is an excellent reference work. Its no-nonsense to-the-point examples were great help. I wish this edition much success, such as solid sales because it sure deserves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan Soto",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Not for beginners.",
      "text": "As always, new Java9 concepts explained. I've been buying 'Complete Reference' since Java2. Not for beginners though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Best Java reference I've found.",
      "text": "If I could only have one Java reference book then this would be it. Covers the basics and then some. Explanations are readable and clear. The index is good. All in all, one of the best reference books I've ever used. Based on an excellent experience with the Kindle version I decided to also get the paperback.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonarman",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Five Stars",
      "text": "Very good book. It was a little large (I wish it was a multivolume book).",
      "rating": 5.0,
      "verified": true,
      "author": "JAMES P BRECKEL",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Four Stars",
      "text": "Pretty good reference book, wouldn’t recommend for someone new to java.",
      "rating": 4.0,
      "verified": true,
      "author": "KevinMan",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Good book",
      "text": "Very good book with in-depth explanations about most topics required for aspiring Java devs (and even for experienced ones when trying to learn more about a feature). Language is clear and concise, Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Evil Morgan",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Missing pages",
      "text": "Our copy of this book is missing pages 191-222. My son loves the book but needed these pages for a class project.",
      "rating": 1.0,
      "verified": true,
      "author": "Mom",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "The complete package for any skill level",
      "text": "Had it for a month, a great refresher for me",
      "rating": 5.0,
      "verified": true,
      "author": "Maximiliano M.",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Very complete",
      "text": "- detailed - with examples - good to start with Java for more advanced people",
      "rating": 5.0,
      "verified": true,
      "author": "Michal",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Ver Big Book",
      "text": "I am longing to see new books, but who know they are so big big big books. I really crying. However, I love them. Books are delivery on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kanit Ph",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "SHIPMENT",
      "text": "It's very fast to get my ordered book. It's great!",
      "rating": 4.0,
      "verified": true,
      "author": "Eric LI",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Can't download examples.",
      "text": "To download examples, you need to disable add blocking and also go through other foolishness. It would be nice if you could simply download the examples, without having to manually type them out.",
      "rating": 3.0,
      "verified": true,
      "author": "James Everitt",
      "helpful_votes": 7,
      "publication_date": 20171015
    },
    {
      "title": "all what i have bought did not take long time like this book",
      "text": "i bought too many things. all what i have bought did not take long time like this book.",
      "rating": 1.0,
      "verified": true,
      "author": "Rayan",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Very good book, I think will be good also for ...",
      "text": "Very good book , I think will be good also for newbie to java . The only problem with kindle version is that , can't translate to other language than english even though that there is translate plug in for chrome\\firefox , it wont work with kindle cloud the copy option is absolutly canceled",
      "rating": 3.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180219
    }
  ],
  "product_meta": {
    "title": "Java: The Complete Reference, Tenth Edition (Complete Reference Series)",
    "rating": 4.5,
    "specifications": {
      "File Size": "274701 KB",
      "Publisher": "McGraw-Hill Education; 10th Edition (October 6, 2017)",
      "Language:": "English",
      "ASIN": "B076CVBN3T",
      "Publication Date": "October 6, 2017",
      "Word Wise": "Not Enabled",
      "Print Length": "1334 pages",
      "Page Numbers Source ISBN": "1259589331",
      "Text-to-Speech": "Enabled",
      "X-Ray": "Not Enabled",
      "Screen Reader": "Supported",
      "Enhanced Typesetting": "Enabled",
      "Lending": "Not Enabled",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Kindle eBooks",
      "Computers & Technology",
      "Kindle Store"
    ],
    "price": ""
  }
}