{
  "website_summaries": [
    {
      "verdict": "An excellent choice for someone always on the go.",
      "pros": [
        "Unique design is modern and aesthetically pleasing",
        "The microphone and speaker work well, phone calls have an impressive volume",
        "Replying to texts has never been easier with voice-to-text, select pre-written messages and even a small keyboard to chose from",
        "The Bluetooth connection is strong",
        "The E model sits at a desirable price point"
      ],
      "cons": [
        "Lifting your wrist to turn on the screen has a slight 1-2 second delay"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "screen burned in horribly, making it unusable",
      "text": "screen burned in horribly, making it unusable. I loved it at first, and if it weren't for the quality control this would have been a wonderful watch.",
      "rating": 1.0,
      "verified": true,
      "author": "M. R. Veteto",
      "helpful_votes": 327,
      "publication_date": 20180309
    },
    {
      "title": "Customer Service sucks almost as bad as the screen burn in.",
      "text": "On the second day of use, I woke up to a black vertical line on my watch and screen burn in at the bottom. At the day went on the burn in covered the whole screen which rendered the watch useless. I've tried contacting the seller and posting on the product forums but haven't been able to contact anyone regarding a replacement or better yet I'll just send it back and go with the watch I should of gotten to begin with. The Misfit Vapor.",
      "rating": 1.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 94,
      "publication_date": 20180112
    },
    {
      "title": "The button fell out!!!!!",
      "text": "This watch started out great!!! Loved the user interfaces and the functionality of the watch. But, after wearing the watch for a few days the button fell out. Without the button I was left with less than half the available feature's. Also the spotify app didn't work which is the main reason I purchased the watch. The watch has great potential but, is highly flawed.",
      "rating": 1.0,
      "verified": true,
      "author": "Taylort",
      "helpful_votes": 31,
      "publication_date": 20180301
    },
    {
      "title": "Works well when new, but mine which I bought ...",
      "text": "Works well when new, but mine which I bought on Dec 12th, quit working Jan 20th. Thats less than 45 days! Screen went black and then green and will not come on. Also remember the screen is cheap plastic and prone to scratching and breaking.",
      "rating": 1.0,
      "verified": true,
      "author": "Akhil",
      "helpful_votes": 34,
      "publication_date": 20180127
    },
    {
      "title": "Repackaged and broken watch!",
      "text": "Tin open with watch loose and rattling around in the shipping box. No instructions. Charging cable not wrapped in any way, just stuffed in a slot inside the tin. Not even sure I received everything that was supposed to come with watch. Charged for over 2 hours, screen briefly flashes or remains on with blank screen. By all appearances, this looks like a poorly repackaged, used and broken watch. I wish I could give it ZERO stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Hodo",
      "helpful_votes": 8,
      "publication_date": 20180313
    },
    {
      "title": "3 months and now it's dying.",
      "text": "UPDATE: I have had the watch for 3 months. Now the screen is all messed up and turning green with shadowy text behind it. So it worked fine for 3 months now it's almost dead. I'm very disappointed. This was my 2nd watch I ordered as well. The 1st was sent back as it was dead on arrival 100%. Didn't even turn on. I can no longer recommend this watch. Quality control is lacking IMO. I cant afford to spend over $100 to have something break like this.",
      "rating": 1.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 4,
      "publication_date": 20190221
    },
    {
      "title": "Great watches for a first time smart watch buyer",
      "text": "Got two of these watches for myself and my wife. They are pretty great. We each love them. The battery life is manageable if you keep the WiFi turned off, along with the always-on display and some other small features. But they charge from around 20% to full in under an hour--so do what you want. The phone calls work very well on them. the sound is just loud enough that you can hear it with your watch close by and the recipients on the other end have reported to me that I come through loud and clear. The voice search work great as well, just as well as your phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Wes M.",
      "helpful_votes": 4,
      "publication_date": 20180415
    },
    {
      "title": "Responsive, versatile, inexpensive",
      "text": "I've had several Android wear watches over the past few years. Most recently, an ASUS Zenwatch 3. The Zenwatch 3 didn't take to the Android Wear 2.0 update very well--got really sluggish both in terms of when notifications happened and in moving through menus. The Ticwatch E doesn't have that problem with wear 2.0. I don't care much about the fitness sensors, so the fact that they were simple to disable was nice. It's quite comfortable to wear--lightweight and the band is flexible for a good fit. Finally, at $130 the price is definitely right for what you get.",
      "rating": 5.0,
      "verified": true,
      "author": "Tenseiken",
      "helpful_votes": 3,
      "publication_date": 20180209
    },
    {
      "title": "Looks ok, but appears to be used",
      "text": "I just received the product today, so I cannot speak on the use of the Ticwatch E yet and will update if needed. However, I purchased this product as a NEW product and it appears to have been used previously. The initial screen protector you'd find on a new product was not on the screen/watch face, but it was stuck to the inside area of the packaging. Also, on the under side of the watch there appeared to be finger prints, but also some kind of debris build up around/on the sensor. If this was indeed a used product and not a brand new item....I expect to pay used price, not new price.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Hoffman",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Unusable Battery Life -",
      "text": "I have had the Ticwatch S for 6 weeks. Recently the battery life is only 4 hours. If I am exercising the battery is not able to last past the workout and dies after 2 hours. This performance is unacceptable. My other issue is the the look and appearance. The watch looks cheap and you cannot change the band to improve the appearance. Does not look good in a casual business setting. The dial with green text is not appealing either. Stay away. My search for a decent Android Wear 2.0 watch continues..",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 5,
      "publication_date": 20180424
    },
    {
      "title": "Functions advertised do not work",
      "text": "Very disappointed in the performance of this watch. When I first got it, I loved it. Then, I found that you cannot track your sleep. The app that is suggested to use is not compatible with this watch. As far as fitness tracking, it is a bust as well. It will randomly stop recording my heartrate for extended periods during my workout. I have tried adjusting it, wiping sweat off and none of that works. It has also stopped keeping track of my calories burned. So, the two things I was REALLY looking for in a smartwatch, sleep tracking and fitness tracking, do not work worth a flip on this watch. I have had it for 30 days.",
      "rating": 1.0,
      "verified": true,
      "author": "Traci Landry",
      "helpful_votes": 4,
      "publication_date": 20180322
    },
    {
      "title": "Ruined Christmas",
      "text": "Either I have received a defected product or the watch itself is poorly made. After spending hours on Christmas Eve/Day tinkering and contacting Amazon Support, I have decided to return the product. The watch was stuck on updating and would not update without crashing giving me the \"dead android robot with red triangle\". Once rebooted the watch would start the update download again before crashing once again upon trying to install the update. This was a major battery drain and the watch would not even last a few hours before dying. I feel so very disappointed today and this was not how I wanted to spend my Christmas.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 3,
      "publication_date": 20181225
    },
    {
      "title": "It doesnt do anything it says it can do",
      "text": "So I bought this as a gift to my oldest son. He loved it when he opened . But now that he has linked to his phone, it isnt what we expected. Battery life is awful. Lasts 3hrs. It doesnt work like the commercial ad . It doesnt do anything like it says it does. Im wondering if the posting that had 5 stars are from paid people to say it works. Because all the negative comments and reviews are actually the truth. Not happy with this product. Its too late to return since I dont want to ask for gift back so I can return for the same product. Waste of money. It just a upgraded watch... thats all",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie Reyes",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "battery won't make it thru the day,..not even close.",
      "text": "I've had it almost a year,..love the watch, but the battery life is killing the experience for me. I have to charge it at night AND..if I don't charge it at work it will be dead by the time I start driving home. Most of the weekend I am wearing a dead watch, as I'm not near a charger. BUT, since I really really like this watch,..I am now ordering a newer watch (pro) from this company and hope it has better battery life.",
      "rating": 3.0,
      "verified": true,
      "author": "Nath",
      "helpful_votes": 5,
      "publication_date": 20181005
    },
    {
      "title": "This is not a watch, it's a toy",
      "text": "If you are looking for something to withstand the test of time, not need your attention every 5 minutes, track your overall health/fitness, well then this ain't it. If you are looking for a toy that needs to be charged every night, need a watch face that matches your own personality so that everyone knows your favorite colors, needs to be updated every other time you look at it, well then this is it. After only 4 hours of normal use (checking time, reading notifications, looking at weather, I was shocked to find that I went from 100% to 50% charge. It may be a smartwatch, but I'd rather buy something dumber that doesn't need as much attention.",
      "rating": 2.0,
      "verified": true,
      "author": "Veniamin Lebich",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Stopped working after 1 month.",
      "text": "I've bought this product after a deep research and many \"positive\" reviews, but I got really frustrated one month after buying it. The screen went dark and display didn't turn on again. Summing up, \"smart\"watch died. My experience during this one month was ok, nothing super incredible. The apple or samsung watch are much better and reliable than this (of course the price is much higher, but now I realize that makes sense if you want something good and durable). Steps counting weren't super precise and was impossible to track exercises, because it didn't figure out was were the exercise and had to \"fix\" manually. Material looks like low quality. Overall experience was really frustrating after some many positive reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Fernando S.",
      "helpful_votes": 2,
      "publication_date": 20190222
    },
    {
      "title": "Poor quality control, defective item",
      "text": "I received this watch less then a week ago. I liked it and would have kept it if it worked, though build quality is lower then competition, and the watch appears bulky. After 2 wears, the battery was draining quickly. After 3 wears, I found the watch dark and unresponsive during the day, so I let it charge. Took it off the charger, it immediately went dark. Charged all day, briefly powered on to show me 100% charge, then it was back to black. Maddeningly, it keeps doing this and immediately stops working, both off the charger and on. I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "KJS",
      "helpful_votes": 2,
      "publication_date": 20181231
    },
    {
      "title": "Great option for entry level smartwatch with all the basics BUT WON'T LAST",
      "text": "To buy this product in 2019 it means you are not getting the latest hardware available and it shows in the sometimes lacking performance of this smartwatch in particular. But if you are willing yo sacrifice performance and battery life for a cheap smartwatch that has pretty much all the basics, go for it. You just have to be patient with the slow performance and deal with its one day battery life. UPDATE 10 months after the screen got burned and its in process of losing every pixel. It has static images overlaped and the pixels of the screen are losing colour. Pretty much useless by now so BEWARE this thing its cheap, its good, but wont last.",
      "rating": 3.0,
      "verified": true,
      "author": "Eduardo Rubio",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "I really liked the look of the watch",
      "text": "I really liked the look of the watch. The screen is very difficult to see when running, but I alleviated that issue by downloading a different app I could see better. Wore it on 1 long run, worked great!! Battery was good after the run...HOWEVER - 2 days after the run, the battery wouldn't last for 12 hours off the charger, and then 3 days after, died after like 8 hours. I had it for one week and the watch strap broke as well........returning.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica Ellis",
      "helpful_votes": 6,
      "publication_date": 20180320
    },
    {
      "title": "Replace the band",
      "text": "Been wearing the watch for 2 plus year, only really wear it while manually loading large packages in semi trucks. Watch has taken a beating and on my third wristband. Still works great. I use it to play music to Bluetooth since we can't have a cell phone in the warehouse. The battery only last about 90 minutes at this point of continuous listening to downloaded music. Its been great and taken a beating but the wrist band sucks",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri Byrnes",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Bought this watch on July 17, 2018.  6 Month later, it stop working......  ᅲᅲ",
      "text": "Bought this watch on July 17, 2018. 6 Month later, it stop working...... ᅲᅲ Screen is all weird and there is no dial. I'm sure that it is too late to return or get some sort of credit. Also at the time of purchase it was listed around $200 and was on special Mid July Sale for $134 plus tax. They made it sound like I was getting a great deal. 6 months later, it is sold for $129.99. My advice to my fellow Amazon Shoppers, ' Caveat Emptor, Let the buyers beware'.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Best affordable Android Wear watch.",
      "text": "Best Android Wear watch that doesn't look like garbage. Pros: Decent battery life, can easily get 1.5+ days, with ambient mode, & gestures on. Looks great, and like an actual watch. Handles well against dings and scuffs. Will be getting Android Oreo in March. Cons: No NFC. Wish watch strap notches were moved down a few mm. It is either tight, (not crazy tight), or loose (not crazy loose). But enough to be annoying on my wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 2,
      "publication_date": 20180228
    },
    {
      "title": "There's something nostalgic about wearing the Ticwatch",
      "text": "utilising a simple design made splashy by a clear plastic coating that gives it a nice sheen. version is especially eye-catching, and I've had a couple of people over the course of two weeks asking what I was wearing. It's also a good size with its 44mm watch case. On the underside, you've got a heart rate sensor, and inside there's GPS, which differs from that on the Ticwatch S, which has the GPS chip built into the strap in an effort to provide better performance. You've also got IP67 water resistance here, so don't you worry your brow over getting caught in the rain. It's not made for swimming I wish it would have been.",
      "rating": 5.0,
      "verified": true,
      "author": "Sully ",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "Move over Samsung...",
      "text": "I am a type 1 diabetic using Dexcom g5 (soon g6) and I wanted a compatible watch. I am a Samsung user, but their watches aren't compatible - which is fine by me as their new smart watches are huge & look overly manly on my small lady wrists. In steps Ticwatch E. Yes, it's still very large however it looks great. I love it! It is super user friendly. Runs with Dexcom g5 perfectly. In fact everything runs smooth. Only thing I liked better on my Samsung watch was the ability to create stock text message answers.",
      "rating": 5.0,
      "verified": true,
      "author": "KBC",
      "helpful_votes": 2,
      "publication_date": 20180414
    },
    {
      "title": "Good looking and comfortable watch but very inaccurate.",
      "text": "Sleep tracking and step counter are very inaccurate. Heart monitor is a little better but still reads higher than actual heart rate. For the GTX the app has almost no information on it. Just received it a week ago but will be buying a better fitness tracker soon. I've had Galaxy Fit and Gear Fit Pro trackers before this one but the bands break easily and replacement bands were worse. This watch seems more durable but I only needed basic features and the GTX is lacking.",
      "rating": 2.0,
      "verified": true,
      "author": "John Lewis Vine III",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "and I have to say that I enjoy it quite a bit",
      "text": "I've had the watch for roughly a month now, and I have to say that I enjoy it quite a bit. My only qualms are that it doesn't always synch as well as you'd hope with the phone and that I wish the BlueTooth range was a little greater. The latter isn't any fault of the manufacturers, though. That's just the way BlueTooth works. I discover new uses with it all the time, and it has allowed me to check my phone much less which has proven to be really nice. For the price and what it CAN do, I'd recommend this as a great entry-point device for someone curious about smartwatches.",
      "rating": 3.0,
      "verified": true,
      "author": "Chet Presley",
      "helpful_votes": 3,
      "publication_date": 20180708
    },
    {
      "title": "Nightmare!",
      "text": "Battery life just sucks! 300mAh, that's not gonna make it a whole day with a LED screen. Plus I couldn't pair it with my phone with respect to google. I tried my Xiaomi Note 5 and Samsung Galaxy S6 Edge. Both failed. Saw a lota people having same issues on websites. Tried their solutions, failed. Called Amazon asistant later, failed. Then I had to return it. Worse thing is, during the 2 hrs struggling setting it up, the battery depleted TWICE! So I had to have it plugged in charging the whole time afterward. What a nightmare.",
      "rating": 1.0,
      "verified": true,
      "author": "Li Tian",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Great first time Wear OS watch",
      "text": "this is my first Android Wear/Wear OS watch...previously I was using a Pebble 2, and while they're slightly different beasts, I haven't felt the need to go back to the Pebble since getting the Ticwatch E. It really has met all my expectations and then some. The watch is definitely on the cheaper side of Wear OS watches, and that shows in the materials (it's a hard plastic rather than metal body) but it's still classy and stylish in its simplicity. It also lacks NFC which would have been nice, but that feature doesn't show up in other watches until you're paying close to double in most cases. There's really hardly anything not to like about this device.",
      "rating": 5.0,
      "verified": true,
      "author": "andy",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Right out of the box it was very easy to set up with the Android Wear app on ...",
      "text": "I have looked long and hard for a simple, lightweight, power-packed smartwatch that would not break the bank. This it it. Right out of the box it was very easy to set up with the Android Wear app on my phone. It imported my contacts and other data in a flash. I like the ability to connect via both Bluetooth and WIFI. The calls via the watch aren't bad either all though probably the phone is simpler. Being so new it is hard to find a screen protector that fits. All in all a great watch for an amazing price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob S.",
      "helpful_votes": 3,
      "publication_date": 20171211
    },
    {
      "title": "Tic watch Ice light weight",
      "text": "Got this, set it up after charged, tried to use it to make a call and to send a message, nope the microphone did not work! I sent a message to the company, they told me what to do, I did it and no such luck for it to work! I am so bummed! I liked it, it was light and had some good features on it! I sent it back the day after it arrived! Bummed about it!",
      "rating": 1.0,
      "verified": true,
      "author": "ladyrider",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "Was great just to slow now",
      "text": "Had one of these couple years ago that broke so i saw it was $60 new so i jumped on it again. Problem is doesnt work right on newest software it lagged so bad the alarm would go off about 40 seconds late. The screen would shut off before it read my heart rate. Hitting the button on the side to turn on the screen would take for ever and when it would turn on it would be stuck on whatever screen it was on when it went off. So whats the use of a watch that takes a minute to tell you the time. Still the best fitting watch just cant handle the newest wear software",
      "rating": 1.0,
      "verified": true,
      "author": "CW54",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great for the price!",
      "text": "For the price you really can't beat it. It's responsive, light, and doesn't feel cheap at all. My only complaint is that it only tracks calories burned based off of steps or maybe it does with the built in fitness trackers too, but I haven't tried that because I don't do any of them. I mainly bought it to keep track of my heart rate and calories burned while lifting weights, so at least I can see my heart rate.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Optimum battery life, put on battery save mode",
      "text": "I like the product however battery life has to be improved. In order to get optimum battery life you have to put it on battery saver mode. Maximum life is 14hours. More options on band colors. Best feature is the Face app to change faces on your smart watch. Functionality is below average but can be better. Over all, it's an average smart watch not bad for a android watch",
      "rating": 4.0,
      "verified": true,
      "author": "DrFrantastique",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Amazing Watch. Great Product. Would buy products from this company again.",
      "text": "Love the Android integration. I can see my messages, and can send back replies. You can talk to the watch . There's a built in speaker to make calls. You can track you heart rate and fitness activity. Great buy for the price. Probably one of the greatest Android watches ever made. Never Used Sleep Tracking. Never used the mobile app. This watch is a bit older now but still works amazing. Have had it for over 2 years now. A little slow because it can only keep up with so many updates before being outdated but all the core features still work very well.",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Awesome watch!",
      "text": "Took some getting used to...had to reset and restart many times until I figured out how to work things...and I'm a computer tech and no slouch with android devices. Not intuitive, the phone app wear 2.0 is ridiculous and useless. battery is good for a day and a half to two days after I got it running optimally, even with non-native watch faces. With such a big form factor, I wish they could have had a more long lasting battery or engineer the software better to last longer. I know it took a big jump in battery life from wear os 1 to wear os 2, but it's still kinda crappy to have to charge nightly.",
      "rating": 4.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Speaker doesnt work, band broke.",
      "text": "Please contact. The speaker no longer works UPDATE: Still no contact after several months. Now the band has broke. So, end results, no speaker nor able to weat. Will never buy again. Don't have money to waste. Well, did here. Sad, don't have a watch. Cant afford another. Still customer service contacting me. DON'T BUY Since noone from this company will talk. I'll be putting it on Facebook. Letting people know I was ripped off. Selling me a defective watch. It's sad, its come to this. This watch wasn't cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucy217",
      "helpful_votes": 2,
      "publication_date": 20180530
    },
    {
      "title": "Won't sync to your Google Account",
      "text": "Watch will not sync to my Google Account. It used to work fine but when I downloaded the upgrade (which it forced me to) it stopped connecting to my google account. It will not let me copy the account from my phone to my watch. I tried on multiple Google Accounts, tried turning off my wifi, tried everything listed on the multiple product forums (apparently it is a known problem). My watch is pretty much useless now because on the home screen it forces me to connect the phone to a google account. Do not buy this. It may work ok, it might not. Eitherway, it is not worth the risk.",
      "rating": 1.0,
      "verified": true,
      "author": "Pabs",
      "helpful_votes": 2,
      "publication_date": 20190130
    },
    {
      "title": "Not Very IPhone Friendly",
      "text": "I came upon this watch after my Apple Watch that was stolen from me based on the great price and good reviews, but the only positives I’ve found about the watch are the stylish faces and battery life. The watch will not stay connected to my iPhone, has trouble staying connected to the WiFi, and will not allow me to update the wear os phone app so is useless notification wise. Wish I would’ve never had my Apple Watch stolen or had just spent the extra $300 to replace it. This watch was good for telling time, but not what I was hoping for",
      "rating": 2.0,
      "verified": true,
      "author": "Ty",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Pretty decent watch.. Its like the one plus of smart watches",
      "text": "Got mine fast from Amazon. Everyone complained about battery, but I didn't find any issue. Just follow their advice of draining charge the first time to zero and recharging it once. Watch is smooth and awesome.. Heart rate reading close to accurate. Google now, voice recognition etc all awesome that's y OS on smart watch matter. Wanted inter changeable straps so ordered E. Its not bulky but normal size.. Overall very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 3,
      "publication_date": 20171123
    },
    {
      "title": "Tried 2 in a row and couldn't pair with my Android phone",
      "text": "I have a ZTE Zmax pro and have used all sorts of bluetooth devices. It's easy. This watch has a 2-step pairing process: 1) the phone and it recognize each other, and 2) the watch sends a 6-7 digit code number to the phone. Step 2 is where it fails. I'm using Android 6 with the latest update and I worked with tech support to try to get it right. So don't get your hopes up.",
      "rating": 1.0,
      "verified": true,
      "author": "Chas. M.",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Disappointed. Waste of Money. Keep looking.",
      "text": "There are no good things to say about this. It is slow and unreliable. Complicated interface with low functionality. The menus are not intuitive and don't respond. It is slow. Veeeeery slow. I guess we have a long way to go before this technology becomes easy to use. What did I want? The ability to use it as a step counter and an offline music player (via storage) . Loading playlists from Google Play music is slow and unreliable. It keeps losing its wifi connection (even when it's next to my router!) Oh, it does count steps via FIT but I can get something a lot cheaper to do that.",
      "rating": 2.0,
      "verified": true,
      "author": "CingleServing",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Not a new item",
      "text": "Not sure how the watch is going to work. Looking forward to it, however I bought a new watch, but feel like I received a watch that may have been returned as the cardboard in the packaging was folded more than it should’ve been, there were scratches and fading in other spots and grime in the space where there HR sensor is located. Can someone from Mobvoi reach out to explain why I was charged and expected to receive a new product, but that was not what I received?",
      "rating": 1.0,
      "verified": true,
      "author": "Vin",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Got perfect storm of issues to ruin it",
      "text": "The watch was great except if you wanted to use it. The formatting didn't appear correctly on the screen, the charger was extremely picky and would not hold on well at all, and even if it did attach it would randomly lose charging status. The formatting was so bad you couldn't click the restart button to get it to reset itself. Had to return it because it had almost no functions working.",
      "rating": 1.0,
      "verified": true,
      "author": "MrAmazon",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Comfortable and Useful Smart Watch",
      "text": "The Ticwatch E is an affordable smart watch that is very comfortable and seamlessly integrates Google's Wear OS. The watch is a bit \"laggy\" when using some apps, such as the messages microphone feature and when many notifications appear at once. The band is soft and looks great with a matte black look. The band however is not very durable and has torn on one side from a bit of heavy duty use (worn while using machinery and using electric and hand tools). The watch is a great replacement for those who are looking for a similar experience to an Apple Watch on an Android Phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Roxanne Bausch",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Quality Affordable fitness tracker, limited smart watch options",
      "text": "The GTX has a solid feel. The metal body, rubber straps, etc can withstand twisting and bending and the occasional bump. I like how it can be washed easily and worn in the pool. The touch screen is responsive and I didn't notice any lag. I like how you can get text notifications but doesn't include sender information. Vibrations are subtle and comfortable. I wish it paired with google fit so it feels more like a stand alone device. The heart rate and sleep measurements seem fairly reliable. The initial pairing was fairly easily with a scan of a QR code. Watch face size was good for average male wrist.",
      "rating": 4.0,
      "verified": true,
      "author": "Tuan",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "This is my new favorite watch",
      "text": "It is super light and packet with features. I debated giving material quality a 4, not because it does not look great or feel high quality, it is just really light and made of resin rather than metal, but it has not had one hiccup since I got it so I feel obligated to give it a 5. The battery got a 4 just because I have to charge it once a day or day and a half. I had to let the battery drain all the way down a few times in the beginning to get it to take a full charge but after that it has consistently made it through the entire day plus a little.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Great smart watch for a great price",
      "text": "I've had this watch for nearly 1 year now, wearing it almost every day. It works just as great now as the day I bought it. The screen has no scratches at all with no screen protector. It's been very durable. Battery life is no different than when I bought it and easily gets me through the day since I just look at the time/notifications/health info. Very pleased. Would have liked NFC for Google Pay but really can't complain for this price. It's been just as dependable as a regular watch. I replaced the band soon after buying with a metal one so can't comment on how well the band holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Ford",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Might have put me off of WearOS",
      "text": "I got this after my Pebble died. The battery life isn't terrible but I have turned off a lot of sensors. To make this watch usable, I had to uninstall or disable a bunch of Mobvoi's apps (see its associated subreddit to see how). I guess I should have known what I was getting into for how cheap this watch is but I wish I would have spent a bit more and got something faster. Or maybe give up on Android and get an iPhone/Apple watch 😅.",
      "rating": 4.0,
      "verified": true,
      "author": "dinkelburt",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Stay away of you want a lasting product",
      "text": "I liked this watch at first...it was good a controlling music while I ran and the Google connectivity was impressive. That is until one day...less than 1 year after I got it and for no reason (no water or shock) it stopped working. No charge to be held, no light from the face... nothing. I charged it for weeks and tried to get it to turn on. Nothing. If you're looking for something to last a few months, this is a good option. Otherwise, I would stay away. I gave it two stars because it was decent while it lasted but I'm very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "A Very Capable and Straight-Forward Watch",
      "text": "So far, so good! I bought the watch a few weeks ago and have really enjoyed using it. I have had no problems whatsoever. I was a little hesitant to get this watch based on some other Amazon reviews, but I am glad I made the purchase. The watch is comfortable, not so big that it is overbearing, and easy to use. The latest version of Android Wear is pretty slick and intuitive. No complaints. Personally, I didn't want a wrist-sized smart phone, I wanted a watch with a few simple and straight-forward \"smart\" features. And the Ticwatch nicely meets my needs. Great watch for the money. I'd definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeferson",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "It's very slow and laggy. Not sure if it's just mine or all of them are like that?",
      "text": "I would say this watch is not the best. It does do its job at telling time, checking the weather, and the date. Plus you can of course change the watch face with what ever you want. However the watch is sometimes show. I get a call alert once it goes to voicemail mail which is terrible. Google Assistant is not working for me. I don't hear a word from her and the gestures, especially the raise to wake function is sometimes or always unresponsive. I feel my watch is a defect but I don't know. I'm thinking of returning it since the money I spent on it wasn't worth what I'm getting out of the watch.",
      "rating": 2.0,
      "verified": true,
      "author": "Zach S.",
      "helpful_votes": 2,
      "publication_date": 20180628
    },
    {
      "title": "This watch is waterproof,i went to the beach and forgot that i had it on, works fine no problems...",
      "text": "This watch is very light weight which is why i forgot that i had it on. The screen is very vibrant and you can see it even on bright sunny days ,it is large enough for me i have big wrist so i like the larger screen. The watch is simple to use i charged it up and had the watch faces and the watch set the way i wanted in just a few minutes. The battery last longer on a lower brightness setting and with the always on feature turned off. Also the WiFi eats into your battery life too. All in all i am very happy with my Ticwatch....",
      "rating": 5.0,
      "verified": true,
      "author": "wendell t adams",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Don't buy, bad product poor support",
      "text": "I purchased this in June, by October the display completely died. I contacted support for a replacement. It took a long time but I finally got on by the following June the display died again. I contacted support again, because the warranty went out on the original watch one day before they got my request they refused to cover it. I explained that I had only had this watch since October but they still refused and said the warranty only covers the original watch.",
      "rating": 1.0,
      "verified": true,
      "author": "amp1276",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Good but quirky",
      "text": "I thought this thing was broke right off the bat. Would work for a few hours then screen would go black (but still vibrate alarm etc). Looked online. Hold button in for up to 30 seconds to reboot. It would do the same a few hours later. ***TURNS OUT*** Buried in the manual it says to FULLY charge and FULLY discharge THREE TIMES!!! Did it and it has worked perfect ever since. Overall great watch for the price. Low battery alert would be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike W Love",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Excellent starter smartwatch",
      "text": "I wanted to get my feet wet with owning a smartwatch, so I took a chance on Mobvoi. I was not disappointed. Aside from the multiple compliments I got on a weekly basis, it did everything I expected it to, and more. I've since upgraded to the Ticwatch Pro. If you are looking to see if smartwatches are for you, but don't want to spend too much money, I say give the Ticwatch E a chance. I will say the battery life isn't perfect BUT, you can just plug it in while you sleep. It's not the end of the world to need to charge your watch, once a day.",
      "rating": 5.0,
      "verified": true,
      "author": "A-25",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Doesn't work well with iOS",
      "text": "The watch constantly disconnected from my Iphone and was often difficult to reconnect. I understand that some features are lost if you don't have an android phone, but it says that it is iOS compatible. So I decided to give it a shot. The screen looks nice and the features were easy to get used to, but I found myself constantly needing to reset the watch to default to reconnect. It is a shame, because I seem to agree with a lot of the positive talk about how many features come packed into a value smart watch.",
      "rating": 2.0,
      "verified": true,
      "author": "Erica W",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Love this android wear watch!",
      "text": "I searched all over for which watch to get, returned a couple in the process, and am happy I ended up with this one. It just works. It looks nice enough without looking like an apple watch person (yuck). It keeps its charge all day. It gives me the notifications that I need. I was missing calls and texts with my phone in my pocket. Now the watch is solving that problem. It's a great price, it does what I needed it to do and does it very well. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory D.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Quality smart watch at a good price",
      "text": "I have had a ticwatch S for a year and was pleased with the way it looks and it's battery life so I bought a second watch. I also own two Moto 360 watches that are poor. I bought the ticwatch E because of it's simple style and soft comfortable band. I added a Sikai cover in blue and orange adding a lot of individuality to the ticwatch E. Overall I am very pleased with the results. The ticwatch E lives up to Mobvoi's high quality standards. The battery usually lasts from morning to night.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliff Keller",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Randomly restarts and gets stuck in infinite boot loop multiple times a day",
      "text": "It worked great for the first few months but now it will randomly restart and get stuck in a boot loop restarting over and over and over. I can hold the power button down to make it turn off and back again to turn in back on. It does this 10-20 times a day. I could have just got a faulty unit but if I were you I would spend the extra money and get a better watch. At this point mine is pretty much useless. It might have been a wear OS update because it seems to after started not long after a update so I'll update review if anything changes.",
      "rating": 1.0,
      "verified": true,
      "author": "Coleton",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Very very good watch",
      "text": "I like it a lot. There's a lot of smart watch that I chose from, glad I decided to buy this. It's not too big nor too small, just the right diameter. It's just a little thick though. The battery life is fine, but not so great. Minimal use can last for more than 12 hours. It survives from beginning to the end of my shift. The only problem I had was the Google assistant, I turned the ok Google on but no matter how loud I get, the assistant won't open. But the good thing is you can just press the button longer and the Google assistant will open. But all in all, it's a very good watch",
      "rating": 4.0,
      "verified": true,
      "author": "Yinnie",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Great watch, but the touch screen stopped working, sent off for warranty and they sent a new one.",
      "text": "Out of the box, I loved this watch! It got me to fall in love and one month later we're in a love/hate relationship. The touch screen only works for an hour or so after start up. I've submitted for a warranty replacement... We shall see, I'll update after they reply. Update* Warranty approved and they sent a paid postage. Sent it away, after a few weeks a recieved a new one and it works just fine. This is day 2, I'll update after a few weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Knight",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "The battery does not even last 12 hours after being fully charged.",
      "text": "I have bought 2 movboi smartwatches, I have followed the advice given by the manufacturer regarding the battery, I have fully charged before using with both watches, after a full charge I have let the batery drain and charged them again to 100%, the problem is the battery life still is far too limited as it does not even last 12 hours. I am returning both wacthes and not ever buying the Ticwatch brand again!",
      "rating": 1.0,
      "verified": true,
      "author": "Rafael Solorzano ",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Did not work",
      "text": "Bought this product as a Christmas gift. Unfortunately, the item did not work despite more than one attempt to receive help via customer support. Apparently the app that works with this item was the problem, and there were many people having the same issue. After attempts to correct the problem via e-mail and customer support were unsuccessful, it was decided to return the item. While I was not happy with giving a Christmas present that became a real hassle, I was pleased with how easy it was to return the item and how quickly it all came together.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Its Ok",
      "text": "We had bought this cause it said it would work with an Iphone. Well it would sync then almost immediately disconnect. Spent 2 days trying to get it work with my daughters phone. Gave up. Tried on my Android phone and it did connect but it took a couple of tries. Battery life would be 10 hrs if you do not add any apps to it. Added 4 apps (hangouts, 3 mail boxes and step monitor) battery lasted 5 hours total. Ended up returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Florida Buyer",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Get more for the money you pay",
      "text": "Ok so to start things off, first I freaked out cause the battery was draining fast even tho the box says it last 48 hours. However after the updates it turned out to be a steal. Best smartwatch for the price because you can download many apps on the phone, and having google assistant makes this watch rival other expensive watches. I was amazed the amount of apps it came with. For $125 i can, get notifications, gps, google fit, read notes, set timers, calculater, wifi from phone, and mich more. Absolutely loved the white one and it looks much better than photo.",
      "rating": 5.0,
      "verified": true,
      "author": "Narbeh Sarkissian",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "horrible battery life",
      "text": "Did not live up to what it claimed to. 1. Could not monitor sleep cycles even with the app it called for. 2. horrible battery life; it only lasted a few hours with each charging. I was looking for a smart watch to help organzing my busy daily schedule, not adding more chores to my to do list.",
      "rating": 1.0,
      "verified": true,
      "author": "Pei",
      "helpful_votes": 3,
      "publication_date": 20180424
    },
    {
      "title": "Not samsung quality.",
      "text": "A lot of features but poor battery and poor gps quality. Strava works but the track is poor quality. User interface is okay it accidentally does stuff on its own I never had this problem on gear fit. Music setup is terrible. Fit tracker and viewer isn't as good as samsung. I would rather have a grear fit.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Fairbanks",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "I wanted to love this watch",
      "text": "First off, I'll state this. I do like this watch. Here is my HUGE frustration with it. The battery life is just awful. On any normal day it's fine. I can get through the day and into the night no problem....BUT, if I use GPS to track a 30 minute run, it just sucks the life of it. I will have to charge it before the end of day. I don't expect much from a smartwatches battery life, but I expect no matter what that at a full charge in the morning it will make it through one day (12-16hours). If the battery life gets fixed I would gladly up my rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric Bruskotter",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Ticwatch..",
      "text": "This is the most powerful android watch I have ever bought,some of the smart watches prices maybe higher than this ticwatch s, but ticwatch can never be beaten by any other product as a smart watch..I just ordered from Amazon and this is the finest wowwww,,Am really happy and even if it happens to spoil today,I will still go for the same type of ticwatch s..The one who invented this watch must be a hero to celebrate..I will continue to buy their products every year of any new ticwatch..Am a happy man...Please folks go for this product if you have not..",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Osafo",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Not as great as advertised....",
      "text": "I really wanted to like this watch. I bought one, returned it, gave it another chance and bought another, and I'm returning that one as well. Pros: Large, bright screen. Reasonably comfortable to wear. Nice features for a watch of this price. Cons: Microphone is not great at recognizing your voice. The simplest requests from google are answered with \"sorry, can't do or find that\". Sending texts requires pushing many tiny buttons.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew Burke",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Best Smart Watch I've found",
      "text": "Love it! This was supposed to be my \"starter\" watch to see if I really wanted a smart watch. I loved it so I purchased another more popular (read that as expensive) brand and actually found I prefer this watch. Great battery life, easy to use and accurately tracks steps, quick to charge and fun to change the watch face. I just wish they made one that looked a bit more polished instead of plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Tt71",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Good quality for great value",
      "text": "I got this for my husband for his birthday last November and he has absolutely loved it. Unfortunately, 2 weeks ago it began to get hot and actually burned him slightly before he could get it off. Of course the watch cut itself off, and despite our efforts to cool it, it wouldn't work any longer. I contacted customer service and filled out a warranty claim and they sent him a brand new one within 3 days. So far so good with it! So far, great customer service with quick turnaround. Much appreciated!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "best watch for the 50$ price tag.",
      "text": "Hey guys if you use an Android phone this is the watch for you, by a quick google search you'll see that on their website the device itself is only 80$ brand new but i bought the renewed version to test it out. I use the apple watch 3 for my iPhone and in comparison, i can guarantee it'll perform exactly how you want it, for calls and texts it's super convenient especially for when im working or when i am trying to conserve my phone battery life. it helps me keep off my phone and only use my watch when i need to check my notifications, call or text, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "kuo",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Buy New, If Possible",
      "text": "UPDATE: Much better. Purchased new and they battery life is much better, lasts for at least a day and a half. It was good. I bought one for my boyfriend back in October and it was great, so I got one for myself. I purchased it refurbished, however. It looked good enough, barely was used, but that's probably because they only used it for a few days before returning it due to the freezing constantly and atrocious battery life. And this was all with stock apps.",
      "rating": 4.0,
      "verified": true,
      "author": "Janiko",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Good choice for low-priced android wearable device",
      "text": "I have been looking for android wearable device with: - on-board storage to play music offline (without internet or phone connection) - heart-rate monitoring - GPS - water-resistant - low cost Ticwatch E 'ticked' all of the above options, using the watch for almost one month and without hesitation, i can say that I made the right choice to buy this watch. Though the material and build quality is not that good (mostly plastic) and looks odd while wearing on the wrist with formal dressing, I deliberately made this choice to buy the low cost mode. I highly recommend this for people who goes outdoor without phone in their pocket and want to listen to music.",
      "rating": 4.0,
      "verified": true,
      "author": "Atique Khan",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Works, but aint fancy. Base model Honda Civic of watches.",
      "text": "Battery life is so so. I get about 30-40 hours out of it. Feels a bit cheap on materials side and water resistance rating leaves something to be desired. Set up was also a bit of a pain going through the wearOS upgrade as this ships with older firmware that was updated to new WearOS. Not a piwerhouse, has a tendency to sometimes time out before it finishes loading whatever task you're trying to swipe to. Overall gets job done but there's nothing fancy about it.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe V",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Impressed!=Update, not impressed.",
      "text": "UPDATE: after 1 full year of use....batter is none existent...its fully charged by 7 am and now its 750 am and were at 40 percent. Mind you I have not done anything this morning on the watch. Super upset as I love this watch but if it will not hold a charge, it is not doing me any good. I waited to write my review to really test this watch. I've been using it for 6 months now and can honestly say without a doubt, I love it. It does everything I need it too, always still has a great charge by the end of the day and works great paired to my phone. Great purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "KayleighAlexis",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Don't waste your money",
      "text": "This watch is nothing special but what I really hate about it is the charging cord. The way to charge it is via a magnetic contact that detaches with every little movement of the watch so many mornings you will wake up finding that the watch is not charged. What is worst is that the charging cable is just 30 inches long so it barely makes it on a night table. The watch keeps falling to the ground with every little movement. In brief there are many much better options out there. Don't waste your money. Battery life is barely one day with very little use.",
      "rating": 2.0,
      "verified": true,
      "author": "Mauricio Mora",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great watch for the price",
      "text": "I've had this watch for about a month and I like almost everything about it so far. It's a little big for my wrist but I'm getting used to it. I bought additional color straps (compatible with standard size). The only real down point is that swiping left and right just goes to changing watch face, instead of more useful functions, like apps or weather.",
      "rating": 4.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Feels cheap for the price",
      "text": "For the many products I've purchased and used over the years, this one's is definitely a no-go for me. When it arrived, it was decently cool to have. It was decent to wear, the strap was again, decent. The worst part of this product would have to be the build quality. The casing is made from plastic, one that could get easily scratched. The screen, while big and bright, wasn't as nice to look at as I'd originally hoped.",
      "rating": 2.0,
      "verified": true,
      "author": "XTheUnwanted1",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Because of the dislike of Samsung Tizen with limited apps",
      "text": "After reading all of the reviews about the battery life, I was not impressed. Because of the dislike of Samsung Tizen with limited apps, I returned my gear S3 frontier. Keeping my eye on the ticwatch e, I decided to give it a try. I have had my watch for roughly two weeks and I am very happy with it. I have not charged it, left it in my office and still at 37%. I am not sure what others are doing with their watch but mine stood there test. I wear it on my wrist and treat it as it is, a watch with perks. Overall, I am very satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Great starter watch",
      "text": "I had been looking to get a smartwatch for a couple of years, but price and technology kept me out. After researching Mobovi online, and finding this on sale on Amazon, I decided to give it a try. Couldn't be more pleased. Does everything it says it does. The watch is very comfortable. I would recommend replacing the band as the silicone makes it look like a toy (just personal opinion). Sleep, step, heart rate tracking are very good for someone like me. If you are looking to try a smartwatch, you won't go wrong with the Ticwatch E for price, use, and comfort.",
      "rating": 4.0,
      "verified": true,
      "author": "tony d hicks",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Lackluster where it counts",
      "text": "Stopped working after 1.5 years. When it did work, it was usually not connected to my phone. I sometimes had to manually connect through the wear app. I felt like this is a device that worked well to tell time and do things that watches do, but it didn't do it's job of reliably relaying information from my phone. The screen looked great, but the battery didn't make it through the day.",
      "rating": 2.0,
      "verified": true,
      "author": "zanoni",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Poorly designed charger makes Ticwatch E a DO NOT BUY",
      "text": "My Ticwatch E lasted for around 6 months. Pros: -Reasonable performance for a Wear OS watch -Decent battery life Cons: -Slow performance, especially when using assistant Why you shouldn't buy: This model features a proprietary magnetic connector that corroded rapidly. To get it to work at all after a month, I had to scrape the contacts every night just to charge. After 3 months I discovered a gaping hole where the contact should have been. Apparently, the same spring-loaded pin connectors were used on the watch side as well, so too much scraping leads to an un-chargeable watch.",
      "rating": 1.0,
      "verified": true,
      "author": "James A. More",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great Watch",
      "text": "I have had this watch approximately a year now and it is still going strong. This is my first smart watch and I don't see why I would ever have to own another brand. Hasn't let me down yet and still looks almost new after wearing it everyday. Comparing the features to the price you can't go wrong with this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Great option if you don't want to spend a fortune on a good smartwatch.",
      "text": "I really like the look and function of this watch. I couldn't afford a Samsung watch and found this one. It has everything I wanted in a smartwatch. The only thing is I wish the battery life was a bit longer. I get about 1 day on a charge, but it takes maybe 30 minutes to charge so it isn't a long wait. I still haven't figured out how to use the sleep tracking so I can't rate that.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Duff",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Amazing watch. Just little sad about battery life",
      "text": "Amazing watch. Just little sad about battery life, it is little smaller than I would like. I use the workout option whenever I play sports (3-4 hours straight sometime) so it runs out of juice quickly because it is using GPS, heart monitor and other sensors. I think big battery would have taken care of that. Other than that great product, people complaining about very bad battery life is not true at all. Just follow the guidelines given in the email by mobvoi after you purchase the device. I hope the review helps",
      "rating": 5.0,
      "verified": true,
      "author": "drs",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "it doesnt worth, not now at least",
      "text": "pros light weight cons doesnt worth the money not that applicable with iphone, i struggled for a day just to get it connected, yest it keeps disconnecting nothing much you can use if you are an IOS user cant use voice commands cant reply at texts cant auto-read them cant answer calls it is a simply expensive digital watch if you ask me",
      "rating": 2.0,
      "verified": true,
      "author": "tareq",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Best Smartwatch for Price!!",
      "text": "Swithced from Fitbit Ionic to Ticwatch. I was skeptical at first, as I switched once before from Fitbit to Samsung gear fit and was extremely disappointed. This is a completely different story! Ticwatch is incredible for the price. It does everything my Fitbit did and has the ability to sync a chest strap heart monitor. It's comfortable, light weight, has Google assistant built in and TONS of apps! What an amazing smartwatch for a small price! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike L",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "poor battery life, even after following charge cycle instructions.",
      "text": "I really wanted to like this watch. I knew it wasn't going to be the same quality as an Apple or Samsung watch, but the battery life on this watch was ridiculous. It wouldn't last a 12 hr shift. I tried to turn off the \"always on\" feature, but then it was hard to see the time. The watch wouldn't always turn on when I raised my arm. It was also very difficult to keep paired with my phone so I missed a lot of notifications. Overall, I was very disappointed and returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Great Budget Smartwatch",
      "text": "This is a great smartwatch. The battery can last me from 8 am to at least midnight, with at most 45% remaining, which is more than ideal for me. It is IP67, and I've washed it a few times under running water with no problem. It rarely gives me issues, but it's good to restart it once in a while. One thing that I notice is with the design on the heart rate sensor. While the sensor works fine, the back of the device is plastic with integrated openings for the sensor to work, making it harder to clean. This is unlike the smooth glass back of other premium smartwatches, such as the Gear 3.",
      "rating": 5.0,
      "verified": true,
      "author": "Galen",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "really cool smartwatch",
      "text": "This is my first smart watch, and for my first, it is not too bad. The battery life was really bad when I first got it, it died right before I got on the bus to go home, and I had to charge it when I got home. But after letting it die and recharging it fully, it now lasts all day. It tracks my heart rate, and the call and text feature is handy if I am too lazy to get up and get my phone. I recommend this! The 1 star reviews were possibly either unlucky or didn't know how to use it",
      "rating": 5.0,
      "verified": true,
      "author": "Mark G.",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "You get what you pay for.",
      "text": "UPDATED REVIEW. After many tries of fixing certain bugs I kept coming across, the watch isn't terrible. It has a subpar battery and wear OS has issues with it once in a while but that's to be expected for a $60 watch I suppose. Very comfy and lightweight though. The microphone is a tiiiiny bit hazy to hear for the caller, but again to be expected for paid price. Would be a 5 star of the setup process didn't make me want to jump out a 3 story window.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett Welborn",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Rock On !!!!!!",
      "text": "This is my 1st smartwatch. Bought it primarily because of price. Features are pretty much the same as watches costing several $$$$ more. I have had this for about a month now and it has surpassed my expectations. I use it for 1. A timepiece 2. To see and respond to text messages (right on watch) 3. Keep track of temperature and weather 4. Track steps daily. The battery last a full day but it does need to be charged nightly at my usage level. All and all a excellent value for an awesome smartwatch. Will recommend and purchase Ticwatch in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "MJK",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Best smartwatch at this price range.",
      "text": "This watch is great, it does everything I would expect an android phone to do while connected to a apple iPhone. The new android update has made the watch even better. Previously you would have to restart your phone and watch each time the watch decided to lose connection to the phone - which was frequent throughout each day. Since android has updated the phone has yet to disconnect to the phone without resolving the issue on its own. I would purchase this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Horrible battery",
      "text": "I was going to buy Samsung watch but decided to give ticwatch a try but I am really thinking I made a bad decision. The battery life on this thing is so horrible that it doesn't even last from morning to evening. I have it 100% every morning, and by 9pm, the watch is already dead even though I am not using any apps or GPS on watch, except just checking time and messages couple of times during the day. Because of this main reason, I end up wearing my watch only once in couple of weeks, because whenever you want to wear, it is lying dead most of the time unless you are charging it twice a day.",
      "rating": 2.0,
      "verified": true,
      "author": "ANURAG GUPTA",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Works very good so far",
      "text": "Works very good so far. Few things could be working better like only pretty much being able to respond to text is fine but when trying to text from contacts from watch not so good... Only issue so far. 4 star. (Update 5-15-18) after owning for a few month's now, working fine after all updates. Originally i bought 3 tic E watches and just recently one stoped connecting to bluetooth totally. Had to factory reset it and its seems to be good now. Seems like their still working out some issues but all in all their great watches.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Poor battery performance",
      "text": "It's Android Wear and has many nice features. Probably one of the nicest smart watches for the price EXCEPT the batter life is not good enough. You will need to charge it every evening. I am returning mine and waiting for the new Fitbit (pebble) watch coming soon.",
      "rating": 3.0,
      "verified": true,
      "author": "Punchout",
      "helpful_votes": 2,
      "publication_date": 20180317
    },
    {
      "title": "Great watch, great value!",
      "text": "I've only had the watch for a day, but I have spent a lot of time learning how to use it. I really think this watch is great. Android Wear 2.0 is really nice. My only complaint is the band smells terrible (like rubbery chemicals), but for $15, I just bought a brown leather band for it. One nice thing about the band is it has quick release snaps on it, making the band VERY easy to remove. I would definitely recommend this watch (so far). Battery life seems to be OK. I think I will have to charge it every night, but as long as it makes it through the day with normal usage, I won't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Good watch, bad straps",
      "text": "This is my first smart watch and I love it. It does everything I need it to. I have adjusted the settings to extend the battery life, otherwise if you don't the battery life is not good. My only complaint is the straps. The first one I got I had to return because the strap connecting to the watch it self was broken, it literally arrived broken. The second one they sent lasted close to two months before the buckle broke. I ordered a stylist replacement for the straps. Over all the watch is worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie Lundy",
      "helpful_votes": 0,
      "publication_date": 20190418
    }
  ],
  "product_meta": {
    "title": "Ticwatch E Super Lightweight Smart Watch Ice,1.4 inch OLED Display, Android Wear 2.0,Compatible with iOS and Android, Google Assistant",
    "rating": 3.7,
    "feature_bullets": [
      "Android Wear 2.0. Get your favorite apps and watch faces. Request a car ride. Perfect your golf swing. Explore a new neighborhood. With thousands of Android Wear apps, there's no limit to what you can do with your Ticwatch E.",
      "Follow your fitness.Track walks, runs, rides, heart rate and strength training with Google Fit and your favorite fitness apps. Get coaching, measure your heart rate, and even stream music, right from your wrist.",
      "Your personal voice assistant. Meet Your Google Assistant. Bring Google Assistant to your wrist. Find answers and get things done even when your hands are full. Reply to a friend that you’re running late, remind yourself to call mom, or ask for directions. Just hold the power button or say “Ok Google”.Phone calls only compatible for android device now.",
      "If you meet abnormal battery capacity, like sudden drop or short battery life…; it is not the quality issue. Please charge the watch more 2hrs before you start to use it. And use the watch till battery empty and charge it up to full for 1-3cycles, the battery capacity indicator will be on right status.",
      "30-day money-back guarantee for any reason, 12-month warranty for quality-related issues."
    ],
    "specifications": {
      "Product Dimensions": "9.21 x 1.73 x 0.53 inches",
      "Item Weight": "1.46 ounces",
      "ASIN": "B076HQ133W",
      "Item model number": "Ticwatch E Ice",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "3.7 out of 5 stars4,340 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#16,491 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Wear OS by Google",
      "Wireless communication technologies": "Bluetooth, wifi",
      "Connectivity technologies": "Bluetooth",
      "Display technology": "OLED",
      "Other display features": "Wireless",
      "Device interface - primary": "Buttons",
      "Colour": "E Ice",
      "Department": "Mens",
      "Manufacturer": "Mobvoi",
      "Date First Available": "October 23, 2017"
    },
    "categories": [
      "Electronics",
      "Wearable Technology",
      "Smartwatches",
      "All Departments"
    ],
    "price": 49.99
  }
}