{
  "website_summaries": [
    {
      "verdict": "While you'll pay up a little for it, this is a high-quality and durable trolley that maneuvers through uneven terrain well.",
      "pros": [
        "Maximum weight is 150 pounds",
        "Anti-corrosion powder-coated aluminum construction, with 10-inch airless tires",
        "Has a double kickstand for good stability",
        "Breaks down and folds for easy storage",
        "Comes with attached tie-down straps and a mesh bag",
        "Works well on uneven terrain"
      ],
      "cons": [
        "Design of the straps is lacking, with some saying they are hard to use and won't stay secure"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bad tires, do not buy this product",
      "text": "Tires get flat spot after load is placed on cart in a few hours that creates a rough role. They do rebound after load is removed, but what good is that ? I do not recommend this product. I own a malone cart that work flawlessly that carries an identical boat to the same location. I replaced both tires with ones from Harbor Freight at my expense to make this cart functional. The manufacture said they had never heard of this issue, hard to believe.",
      "rating": 1.0,
      "verified": true,
      "author": "HLK",
      "helpful_votes": 11,
      "publication_date": 20180715
    },
    {
      "title": "Life Saver!",
      "text": "This makes kayaking a breeze! Now when you work so hard going against the current to get back to the dock, you don't also have to carry your kayak! It's small enough it fit it my husband's Jackson Tripper kayak (I have a smaller Jackson Tupelo and it will fit behind my seat if I put it in sideways and really work to get it in there). The straps make it easy to hold your kayak on the wheels. It feels strong and sturdy -- this is not just a cheap metal piece of junk. This is worth the money. The tires are perfect and go over the dock, the rocks, the sand perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "AZ",
      "helpful_votes": 2,
      "publication_date": 20200507
    },
    {
      "title": "Easy set up",
      "text": "I ordered yellow and received orange. No big deal but thought I'd let you know. I particularly like that the trolley collapses flat so it's easy to carry in the car. It's easy to set up. I like that it has solid tires so I'm not having to worry about them going flat.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 3,
      "publication_date": 20200220
    },
    {
      "title": "Makes kayak easy to move around",
      "text": "We are older and found it hard to carry kayak to water. This trolley made it a breeze. Important to criss cross the straps to make it stable on cart. We no longer worry about how we are going to carry our 2 person kayak!",
      "rating": 5.0,
      "verified": true,
      "author": "C Kell",
      "helpful_votes": 4,
      "publication_date": 20190811
    },
    {
      "title": "Great product...mine came in the wrong color",
      "text": "First off...ditch the straps. They're garbage and that is primarily the reason I gave it a 4 star rating. I had a couple of decent straps I use instead. Additionally, mine came painted orange instead of yellow. I actually prefer orange so not a negative! I had my 75lb kayack resting on it overnight in the garage and the wheels did not flatten like other reviewers mentioned. Handled well in rocky terrain and in sand.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael T.",
      "helpful_votes": 2,
      "publication_date": 20191001
    },
    {
      "title": "Cost Effective Way TO Transport Your Kayak",
      "text": "I have a 10'6\" kayak and this device helps get it from my truck to the boat ramp. It is a little difficult getting it into position under the kayak. Once there is is easy to maneuver the the kayak where it needs to go. I don't use the straps because I am only moving it a short distance on pavement. It folds up easily for storage. The wheels come off easily however I leave them on all the time. I didn't give it 5 stars because of the difficulty of getting it into place.",
      "rating": 4.0,
      "verified": true,
      "author": "Clint VanHoy",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Lives up to the high ratings",
      "text": "Great product. Breaks down and sets up quickly. Works really well on uneven terrain. We loaded 2 inflatable kayaks, one on top of the other and it worked great on a 300 yd haul on a state park trail over roots and rocks. The quick connect pins on the wheels are great. Stored easily in the stern of the kayak. With the wheels off it stows flat in a small space. Like the no flat wheels.",
      "rating": 5.0,
      "verified": true,
      "author": "gf",
      "helpful_votes": 5,
      "publication_date": 20180319
    },
    {
      "title": "Definitely worth getting",
      "text": "Works better than expected. It is orange for those wondering about color. The straps it comes with aren't great so I plan to change those out. The wheels are what I was wanting (no air valve to go flat). Easy assembly and take apart. Hauler wheels and frame fit down by my feet in my kayak (I have a pongo 120). Would go 4.5 stars due to the straps it comes with aren't great, but Amazon only lets me go 4 or 5 and I love everything else about this hauler.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeP",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Didn't Fit My Old Town Topwater 120",
      "text": "This cart does not work with the shape of the hull on the Old Town Topwater 120. No matter what angle or hull placement I tried this thing slipped out of position and became unusable. I ended up returning it and making my own cart using PVC, a threaded steel rod and cheap wagon tires. Works great.",
      "rating": 2.0,
      "verified": true,
      "author": "AMColorado",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "I am so pleased with this Kayak Trolley I am 68 and for ...",
      "text": "I am so pleased with this Kayak Trolley I am 68 and for years have been carrying or pulling my 14 foot kayak to the water this is the best purchase I have made. It is easy to place and strap down and easy to pull. I can enter water from different spots with out difficulty Thank You",
      "rating": 5.0,
      "verified": true,
      "author": "Maddy",
      "helpful_votes": 4,
      "publication_date": 20180410
    },
    {
      "title": "Good cart, except for soft sand",
      "text": "Wanted this cart for my kayak as I was tired of inflating cart tires on a regular basis. Works great, but not to good in soft sand. Big difference from inflatable tires. Tie down works well, and love the bag. Six in one, half a dozen in the other???...",
      "rating": 5.0,
      "verified": true,
      "author": "Island Review",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Works great!",
      "text": "The cart is great and works really well. Mine was orange instead of yellow which I actually prefer. This product seems to be better then alot of the other carts I have seen.",
      "rating": 5.0,
      "verified": true,
      "author": "R Hair",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Makes moving a kayak so easy, can't believe I didn't buy it sooner",
      "text": "Just used this to move a heavy 12'8\" BKC Tandem over beach sand. The wheels are really easy to put on or remove, and once disassembled you can stuff it in the bag that comes with the kayak. Its really easy to assemble. I saw another reviewer complain about the straps, maybe they raised the quality because I had no issues with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Wilcox",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Kayak cart",
      "text": "No more flat tires & no more cart rolling away on an incline. Love the straps are attached",
      "rating": 5.0,
      "verified": true,
      "author": "P. Clark",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Four Stars",
      "text": "good cart for the price... need to strap kayak to it correctly, but overall works fine",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180405
    },
    {
      "title": "It works great with my inflatable kayak",
      "text": "Went kayaking at Valdez Glacier with friends. We were able to load up two inflatables and all our gear in one trip from the vehicles to the shore. We did have to use some bungies through the kayak handles to keep from bending over too much, and the straps were a bit tricky. Feeding the end into the buckle was difficult; wished the clamp opened a bit more. Definitely satisfied though. It will work great when I go on my kayaking adventures with my Beagle Pippi.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben T.",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Works well",
      "text": "Affordable and works well enough if you’re not someone who Kayak’s all the time. It does the job well.",
      "rating": 5.0,
      "verified": true,
      "author": "Streamlined Mom",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Great assistant",
      "text": "Makes moving your Kayak so much eAsier. Just wish the strapping to hold the Kayak tight to the dolly was easier to use. Guess I have to get use to using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Monfort",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Fantastic Value for such a great cart.",
      "text": "I have a 14.5 ft Double + 1, 80 lb kayak and this cart was fantastic!!! It took a little experimenting to get the cart right in the middle and balanced but once you do it works perfect. Great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D.",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Not as it says it is.",
      "text": "The tires were not supposed to go flat. Except, I left the kayak on it over night bc I wanted to take it out the next day and the tires went flat right away.",
      "rating": 1.0,
      "verified": true,
      "author": "D3Grier",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Works great, collapses very nice and well made",
      "text": "Works great, collapses very nice and well made. I also like the bag that comes with it to put everything in one place. Just what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan A.",
      "helpful_votes": 5,
      "publication_date": 20180107
    },
    {
      "title": "Disappointing",
      "text": "Not worrh the price didn’t do the job ...returned it and bought a AUSPENDZ Lg airless end carr...higher price but much better value sunce it actually fits my kYaks and is fast and easy to usediss",
      "rating": 2.0,
      "verified": true,
      "author": "my opinion 2",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Works well",
      "text": "Beats the heck out of dragging or carrying a kayak!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Bower",
      "helpful_votes": 2,
      "publication_date": 20180326
    },
    {
      "title": "better off using my own straps",
      "text": "unstable, trapped it down and kept comming undone. better off using my own straps",
      "rating": 3.0,
      "verified": true,
      "author": "Thang Nguyen",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Five Stars",
      "text": "Excellent trolley. Has everything needed. Love the no flat tires!",
      "rating": 5.0,
      "verified": true,
      "author": "Guy Irving",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Great cart",
      "text": "Easy to assemble, carried our 14’ tandem sea kayak with ease. Stores nicely on kayak while paddling",
      "rating": 5.0,
      "verified": true,
      "author": "Christine M Banks",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Buy this one!",
      "text": "This works perfectly! I can haul my tandem kayak wherever I need to all by myself. Attaches securely with the straps and rolls easily across rough terrain to the waters edge. Numerous people have stopped me to comment on this and ask where I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake in Denver",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Kayak Trolley",
      "text": "a bit wobbly on rough terrain but it does work as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "M01738225B",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Well made,  works as intended.",
      "text": "Works just like it looks , well made , straps hold better than I thought they would.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Ulmer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Four Stars",
      "text": "The straps are attached at both ends and therefore easy to find",
      "rating": 4.0,
      "verified": true,
      "author": "jrw",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Very robust! Easy to use! Great for the price!",
      "text": "Very robust! Easy to use! Great for the price! We need this for sandy creek beds, and some long hauls. It is easy to use. Considering the size of the wheels, it does fold to be pretty flat.",
      "rating": 5.0,
      "verified": true,
      "author": "P. J. Rowan",
      "helpful_votes": 0,
      "publication_date": 20201109
    },
    {
      "title": "Great product!",
      "text": "I am very pleased with this purchase! Sturdy and works great! Good price!",
      "rating": 5.0,
      "verified": true,
      "author": "KM",
      "helpful_votes": 0,
      "publication_date": 20201119
    },
    {
      "title": "Exactly what I needed.",
      "text": "This little thing is great. Easily breaks down. I put it in the back of my fishing kayak when I am on the water. Great price. I have no idea why people spend $100 plus on other carriers.",
      "rating": 5.0,
      "verified": false,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200605
    }
  ],
  "product_meta": {
    "title": "1235 RAD Sportz Kayak Trolley Pro Premium Kayak Cart Airless Tires 150 LB Cap Yellow",
    "description": "The RAD Sportz Kayak Trolley Pro makes moving your kayak or canoe a breeze! The sturdy aluminum frame will hold up to the largest kayaks, and the 10\"airless tires will never go flat, and never let you down. When you finished using it, the Kayak Trolley Pro folds down to a compact 27\" x 13\" x 3\" and stores away in the included FREE mesh bag.\n\nWith a 150 pound weight capacity, the RAD Sportz Kayak Trolley Pro is not lightweight. The 10\" NO-FLAT airless tires can be easily removed so storage is a breeze. The trolley features rubber cushions to protect your kayak or canoe from damage, and the double kickstand offers extra stability when mounting your kayak.\n\nFEATURES:\n\n * RUGGED: With a 150 pound weight capacity, your Kayak Trolley Pro will haul even the largest kayaks or canoes with ease to and from the water, or anywhere you don't want to carry your kayak.\n * SAFE AND SECURE: With the included tie down straps, you don't need to worry about your kayak falling off the trolley.\n * CONVENIENT: Compacts down into the included FREE 27\" x 13\" x 3\" mesh bag for easy storage.\n * DURABLE: High quality yellow powder-coated aluminum will hold up to years of use. 10\" NO-FLAT airless tires won't go flat under the heaviest of loads.\n * USEFUL: Perfect for home or use at the water's edge.",
    "rating": 4.3,
    "feature_bullets": [
      "►RUGGED: With a 150 pound weight capacity, your Kayak Trolley Pro will haul even the largest kayaks or canoes with ease to and from the water, or anywhere you don't want to carry your kayak.",
      "►SAFE AND SECURE: With the included tie down straps, you don't need to worry about your kayak falling off the trolley.",
      "►CONVENIENT: Compacts down into the included FREE 27\" x 13\" x 3\" mesh bag for easy storage.",
      "►DURABLE: High quality yellow powder-coated aluminum will hold up to years of use. 10\" NO-FLAT airless tires won't go flat under the heaviest of loads.",
      "►USEFUL: Perfect for home or use at the water's edge."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "13 x 14 x 27 inches; 9.7 Pounds",
      "Item model number": "1235 RAD Kayak Trolley Pro",
      "Department": "Unisex-adult",
      "Date First Available": "May 15, 2017",
      "Manufacturer": "Trademark GLB",
      "ASIN": "B076C2KXS4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Indoor Kayak Storage",
      "Kayaking",
      "Water Sports"
    ],
    "price": 72.99
  }
}