{
  "website_summaries": [
    {
      "verdict": "Taller and more spacious insulated carrier for up to 6 wine bottles, with removable divider to convert to a general cooler.",
      "pros": [
        "Thermal-insulated material and 5mm PE foam insulates and protects 6 bottles of wine",
        "Thick padding keeps beverages cold for hours, and adjustable shoulder strap makes transporting your wine convenient",
        "Removable inside divider keeps wine bottles separate and prevents them from hitting each other",
        "Pockets on outside of carrier to carry other needed items"
      ],
      "cons": [
        "An added pocket for an ice pack might be an improvement to this carrier"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Decent product",
      "text": "I bought two of these wines carriers because the price was good. They're better than I expected and seem to help keep the wine from getting overheated, 'though I don't put them in the trunk on a hot day. They're also handy for just carrying six bottles of wine.",
      "rating": 5.0,
      "verified": true,
      "author": "RLS42",
      "helpful_votes": 3,
      "publication_date": 20180729
    },
    {
      "title": "Only works well when there are 6 bottles in the bag",
      "text": "If the bag is not full, then the separator shifts around and the bottles will knock together.",
      "rating": 3.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 4,
      "publication_date": 20190628
    },
    {
      "title": "Bottle and Wine Carrier for RV use",
      "text": "We love the bottle wine carrier. We use it in the airstream during travel. It is medium size and has a flexible insert. Perfect for tight spaces. It is insulated and I even put my grandsons bottles in for a quick grab n go. Easy to clean, sturdy and perfect for RV travel. Fits right under my sink area in the Airstream, out of the way. We are happy with the purchase. I looked a long time for the perfect size. This is it. Just big enough for your needs but doesn't take up to much space due to excellent quality and design. I would recommend to airstream and RV owners.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda pemberton",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Wine bag is cute but I ordered the black and ...",
      "text": "Wine bag is cute but I ordered the black and received a blue one. Also, it had puncture holes under the lid. I need the bag for a bridal trip this coming weekend so I can’t return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 4,
      "publication_date": 20180611
    },
    {
      "title": "Useless",
      "text": "This bag is very flimsy. The dividers are not built in and are very thin. I'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Low quality, divider not effective.",
      "text": "Low quality. Dividers are a flimsy insert. This item is useless for glass bottles unless you have exactly six bottles because the cheap/flimsy insert let's the bottles hit each other and break.",
      "rating": 2.0,
      "verified": true,
      "author": "Professional Handyman",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Have to be drunk to buy this!",
      "text": "If I could give this 0 stars I would. Anyone who rated it higher must have been drinking when they did the review. The insert that is supposed to hold the wine is a joke. Poorly made...I couldn’t get six wine coolers in, let alone my expensive wine. Will be returning this promptly!",
      "rating": 1.0,
      "verified": true,
      "author": "Bret K. Bernstein",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Wine Tote",
      "text": "The overall quality is good but some features were not as I would have liked. I had to fit 6 Chardonnay bottles in this tote. They were so very tight, I could barely get them to fit. Also the internal separator is very poor quality. They need to attach to the sides and not be free floating. Also it was larger enough to reach each side when you have the larger bottles inserted. It was good, but it could be better.",
      "rating": 4.0,
      "verified": true,
      "author": "Errol",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Just a carrier not much for cooling..",
      "text": "Will see..not the quality other Kato cooler..hope the handles hold up...have the 4 carried witch is better quality..ok as a carrier but not much as a real cooler..",
      "rating": 3.0,
      "verified": true,
      "author": "J Rogers",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Peformance as needed",
      "text": "Fits 6 bottles, safely and securely transports them and maintains temp for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Right sized and priced right",
      "text": "Exactly what we needed for transporting various beverages in our RV (overstock from fridge). The insulation and padding made this a great \"second fridge\". Great price - might buy a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "GCD Jill",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great Quality",
      "text": "This was perfect. We were able to take 6 bottles of wine on the plane in our luggage. I did add cushion with bubble wrap, just from paranoia of the bottles breaking.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Picnic bag",
      "text": "While a decent cooler bag, the insert dividor supports are not enough tovtravelvwith wine bottles. I would describe this more of a picnic cooler bag.",
      "rating": 2.0,
      "verified": true,
      "author": "Pattik",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Pretty good carrier at a good price",
      "text": "Have only used it a few times so far, but it seems to be pretty sturdy and conveniently sized. I actually use it for beer. I needed something that will hold different sizes from cans to large bottles. This does that nicely. Would give it 5 stars if it had slick little pouches built in for the cold / ice packs. There is room though, I'm just being picky now!",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Close but no cigar",
      "text": "I used it to store bottles of wine and liquor on a boat, to prevent them from rattling and damaging one another. I was disappointed to discover that the divider was not attached to the inside surface of the carrier as it also pears to be in the photo, but just a free floating piece.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel M.",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Lightweight insulated - great birthday gift",
      "text": "The case is made to be a wine carrier but the interior dividers are removable so you can use it for a picnic or daily lunch. It's very sturdy and nice looking. I bought this for a birthday gift and love it so much I plan on buying one for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Good value",
      "text": "Works well for traveling up to 6 bottles of wine. Will keep it cool if pressure chilled . Carrie's easy",
      "rating": 4.0,
      "verified": true,
      "author": "nhim2atl",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Works for the occasion",
      "text": "The inner pieces are not good but I guess if you wanted to remove them its a good thing.",
      "rating": 3.0,
      "verified": true,
      "author": "Anita Robinson",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Looks Nice But Flimsy",
      "text": "Color, design and intent all on point. However, the quality was BELOW AVERAGE. There were stitching threads all over the interior that we had to cut off. I stopped counting after 7. This is just poor quality control. The handles need to be made of slightly sturdier material such as a canvas quality. After all this was a 6 bottle tote and 6 bottles of wine are heavy. Minor but necessary improvements that would have made this item get a higher rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Bottles not secure in bag.",
      "text": "Nice bag. I am disappointed that the bottle section is a loose piece. That really disappointed me. I really wish it was attached. I put another 6 bottle carrier inside it to travel with today.",
      "rating": 2.0,
      "verified": true,
      "author": "Kimberly Ridall",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great deal on a great product.",
      "text": "Perfect for when you need to take a “Bar in a Bag” to an event. The six compartments can hold liquor, wine, mixers, fruit, knife and corkscrew. Or what ever else suits your fancy. Price is right",
      "rating": 5.0,
      "verified": true,
      "author": "T. J. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great gift",
      "text": "My daughter in law liked it very much, it was a gift for her",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Teresa Cerqueira",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Looks great",
      "text": "Have not used yet, but quality looks great. Also, great price and excellent shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "capt",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "the lining keeps the white wines cold for a good while and I've had no problems with it",
      "text": "This is a strong, durable wine tote bag. the lining keeps the white wines cold for a good while and I've had no problems with it. I liked it so much I bought two for larger events. I highly recommend this for picnics, parties or wine tasting events.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Should do the trick",
      "text": "We were looking for a wine holder that will travel well, and this case seems sturdy and it will keep the bottles protected. I haven't used it yet but it appears to be durable and better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa Termini",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Great item",
      "text": "My husband is a shipt shopper and uses these for delivering alcohol purchases. Very good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Franklin",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Six Bottle Wine Carrier",
      "text": "I like the insulation but didn't like the dividers on the inside (if you have fewer than six bottles they don't provide necessary bottle protection.",
      "rating": 2.0,
      "verified": true,
      "author": "Walter T. Wilhelm",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Good product.",
      "text": "Nicely made, good price and quick delivery. Will not hold 6 pinot noir bottles but will hold 3 with 3 smaller bottles.",
      "rating": 4.0,
      "verified": true,
      "author": "Tcart driver",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Great for transporting multiple Whiskey Bottles",
      "text": "Exactly what I was looking for! A way to carry multiple bottles of Whiskey to get togethers or when going on a trip. The removeable/adjustable inner divider is great for when the bottle shapes/sizes are different.",
      "rating": 5.0,
      "verified": true,
      "author": "James Foy",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "STITCHING NOT SUITABLE TO HOLD 6 BOTTLES!",
      "text": "The stitching ripped on 3 of the four sides of the bag. I loaded 6 bottles only and immediately noticed the stitching ripped.",
      "rating": 1.0,
      "verified": true,
      "author": "Armando",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "EH...",
      "text": "It's a tad on the flimsy side. The partition is not affixed to the side of the cooler. Not really worth the money",
      "rating": 2.0,
      "verified": true,
      "author": "Paul S. Calzolano",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Totally happy for the price  BUT",
      "text": "Only 6-skinniest bottles will fit easily. put 6 bottles of chard in there and couldn't close zipper! worked it out by alternatin bottles top up/top down. appears well made. will review again after some elbow exercizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Taylor",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Disappointed",
      "text": "This wine carrier is not very sturdy and padding is definitely an issue Won't keep this as I'd be afraid to carry Riedel glasses with our wines.",
      "rating": 2.0,
      "verified": true,
      "author": "Liz Corbett",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Wine Cooler Tote",
      "text": "Love this wine totes. Keep everything organized great for byob or picnic.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Tran",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "I really like that you can pull the bottle divider out to ...",
      "text": "I just used this for a trip to Florida. It stored 6 bottles and I didn't have to worry about packaging the bottles for travel. I really like that you can pull the bottle divider out to make it just a cooler. Very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "JLH",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "It works as advertised!!",
      "text": "We used to travel with wine in a suitcase. Worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald Keyes",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Sturdy carrier",
      "text": "Convenient for backseat of car especially on hot days so the wine doesn’t spoil or fall over",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Pogue",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Great Quality! I'm glad I bought 2.",
      "text": "These wine carriers are insulated and collapsible and suited for all types pf bottles. Made of a good quality material and very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Best Value Item!",
      "text": "I do private wine tastings and love that I can pack and carry chilled wine and it will stay chilled until I’m ready to pour.",
      "rating": 5.0,
      "verified": true,
      "author": "Gil Calderon",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Functional",
      "text": "I saw one that a friend had and immediately ordered one for myself! Quick delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Holds 6 bottles",
      "text": "Very handy for a long trip & also to transport 6 bottles of wine from store to home!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Fast service and very affordable!",
      "text": "Very happy to find a wine carrier that was so affordable! Came fast and it was in great condition no problems at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Good product overall and very pleased",
      "text": "I like that it is designed for wine bottles and packs down well for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Br. Isaac Haywiser, O.S.B.",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Mine looks more like a lunch bag",
      "text": "Not the product I received! Mine looks more like a lunch bag!",
      "rating": 1.0,
      "verified": true,
      "author": "pjm ",
      "helpful_votes": 2,
      "publication_date": 20180421
    },
    {
      "title": "Works great!",
      "text": "This product works great! Exactly what I was looking for!",
      "rating": 4.0,
      "verified": true,
      "author": "Nichole Rubin",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Good value",
      "text": "Doubles as an insulated carrying case for other liquids as well.",
      "rating": 5.0,
      "verified": true,
      "author": "JOSEPH",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Awesome carrier",
      "text": "We liked our first one so much we just bought a second!",
      "rating": 5.0,
      "verified": true,
      "author": "Flower Harvey",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Love this!",
      "text": "Carries 6 bottles of wine onto our cruise in this. And then used as cooler at the beach. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "diane mello",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Excellent product",
      "text": "Excellent product and great as a gift. Only setback is the use of the material for the sling - too soft.",
      "rating": 4.0,
      "verified": true,
      "author": "kcationg",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great product",
      "text": "I love this bag. Will probably order a few more. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Deneen Rimmer",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Five Stars",
      "text": "Excellent bag. I can carry my wines in style now",
      "rating": 5.0,
      "verified": true,
      "author": "Ayodhya Glenardi",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "it fits bottles nicely and I like the padding",
      "text": "I am using it as an alcohol bottle carrier, it fits bottles nicely and I like the padding. Can't really speak to the insulation capabilities. But it is perfect for what I need for road trips!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180626
    },
    {
      "title": "As advertised but accomodates smaller bordeaux type  bottles better than wider burgundy type",
      "text": "I have another Chinese made wine tote but the separator is fixed and holds the bottles in position better. It is slightly larger and accommodates bottles like champagne, rhone or burgundy without difficulty.This wine tote I will have to add additional padding before I would put this in a suitcase for airline travel. The tote is lined with reflective material but the size of the openings are 3 inches by 3 inches. That is fine for narrow bottles but champagne, chardonnay, burgundy are 3 3/8 to 3 1/2 inches and will stretch the compartment. Buyer beware.",
      "rating": 3.0,
      "verified": true,
      "author": "jp",
      "helpful_votes": 4,
      "publication_date": 20180814
    },
    {
      "title": "It is not water tight, cannot hold ice, leaks, useless for me",
      "text": "I figured this would be a great little cooler for bottle shares and bringing cans/bottles out on the golf course with some ice. Nope, it leaks out the bottom when the ice melts. Pretty useless for what I wanted it for. If you want to use ice to keep things cool, skip this one.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Webb",
      "helpful_votes": 2,
      "publication_date": 20181227
    },
    {
      "title": "Awesome Wine Carrier!",
      "text": "I bought this specifically to take on a recent trip where we would be doing a lot of wine tasting. Having this bag with us was a life saver! Having something to put our wine purchases in while traveling from tasting room to tasting room was a huge help. I think I may need another one of these!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Looks like good quality",
      "text": "Although we haven't used it yet, it seems very well made. We are going on a Wine Cruise tour holiday, and my wife wanted something to use when we go shopping and want to buy a few bottles. We were going to buy the 4 bottle, but decided to get the 6 for almost the same price. Very happy with the purchase. When we ordered it, I was at a hotel in LA. The parcel arrived almost the next day, less than 2 days. Amazing delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer Suzanne T.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Great Deal",
      "text": "We purchased this bag at the last minute, we were going on a trip and planned on taking some of our wine. We started looking and we found this bag that was one day delivery and we need that. We ordered the bag on Thursday and we were leaving Friday after working. The bag arrived about one hour before we left. It worked great and kept the wine chilled and is very strudy. We couldn't have been happier witht he bag or the serivce we recieved. Thank you!! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Exactly what I needed",
      "text": "I ordered this and really didn't know what to expect, but I got in the mail and I was very impressed with the workmanship. I am able to easily put 6 bottles in it, and three big 1.5 lt bottles in it. I like it and recommend it for everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L. Casebolt Jr.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "This is a sturdy, well -made bag that we believe will be ...",
      "text": "This is a sturdy, well -made bag that we believe will be durable and serve us very well! We took it along to our favorite wine store the other evening and filled it. Straps are strong and well made. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Great way to supply a party with the goods",
      "text": "Great way to supply a party with the goods. I was skeptical when I unpacked it, but once all the bottles are in it’s perfect. Well worth the price......I bought 2!",
      "rating": 5.0,
      "verified": true,
      "author": "andrew kennedy",
      "helpful_votes": 2,
      "publication_date": 20180619
    },
    {
      "title": "Cheap crap",
      "text": "It's not very tall and the insert doesn't attach to anything - it is like the insert of a cardboard liquor box. If you try to carry less than six bottles it moves around.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd Pajonas",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Multiple functions",
      "text": "Received the wine cooler. Quality good. Like it can be used as a cooler as well as hold wine bottles so they don't bump into other bottles and break. Looking to purchase additional coolers.",
      "rating": 5.0,
      "verified": true,
      "author": "paint lady",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Made cheaply!",
      "text": "Bad product and WAY overpriced! This is your typical cheap Chia product. Don't buy it... you won't like it!",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Batt",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "great travel cases",
      "text": "I use these as travel cases in the car. They provide enough protection and the shoulder strap make them easy to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger G.",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Very good product",
      "text": "The wine cooler itself was great. The insert was a bit flimsy and took a while to fit correctly. We were in 106 degree heat and our wine stayed cool. Great product but please fix the bottle divider",
      "rating": 4.0,
      "verified": true,
      "author": "RF",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Perfect for wine bottles or any bottles that need to ...",
      "text": "Perfect for wine bottles or any bottles that need to be kept cold. I own a mobile shaved ice company and needed a cool place to keep my toppings. This is the perfect solution. Seems well made, and the dividers are removable or adjustable. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Carry you with me",
      "text": "Was given as a gift and has different compartments for your wine bottles very nice",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda Sosi",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Perfect for my sales needs.",
      "text": "I work for a distillery and do tastings on the road all the time. I bought one for every one at work! Love these. So convenient and awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Good solution for travel",
      "text": "Good bag to keep your alcohol cool. The flexible interior must be packed carefully, so the glass doesn't knock.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Tilton",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Haven't used yet but it appears to be well made ...",
      "text": "Haven't used yet but it appears to be well made. Once Spring arrives and the winery's in the area begin the WineFest's... I will be bringing this with me to hold the bottles I purchase and the bottle I am drinking. Hopefully it will make life easier and leave me with a free hand to hold my wine glass.",
      "rating": 4.0,
      "verified": true,
      "author": "robmski",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Decent bag.",
      "text": "This holds flavor syrup so it doesn’t really travel. It’s decent.",
      "rating": 5.0,
      "verified": true,
      "author": "Fairykeiley",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Well constructed with the exception of the dividers",
      "text": "I was disappointed that the inserts were not attached. It makes it more difficult to use when the inserts (dividers) shift when putting the bottles in",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Crockett",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Like it",
      "text": "Does the job. Carried 6 bottles with no issues. Included was a bottle of Champagne, a Pinot Noir and a larger than normal cabernet bottle. I can't comment on durability since I've only used it once.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCalUomo",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great bag!",
      "text": "I have thos bag as a gift and my friend loved it! Seems very durable. Love the extra pockets!",
      "rating": 4.0,
      "verified": true,
      "author": "Erica Rorie",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Carries Six Bottles Safely and Easily",
      "text": "The bag is lightweight but can handle six bottle easily. Time will tell if it's durable but, for now, I am very pleased with my purchase. Makes bringing wine to dinners/parties/holiday gatherings very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nilza S.",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Recommend",
      "text": "Excellent quality, robust. We bought 2 to store our wine bottles in our RV",
      "rating": 5.0,
      "verified": true,
      "author": "John Strome",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Folds down nice. I do private wine tastings and need just ...",
      "text": "Folds down nice. I do private wine tastings and need just something to keep bottles safe and cool en route and this works out just right. Perfect for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela S.",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "This is a great cooler. I went on a hike with this",
      "text": "This is a great cooler. I went on a hike with this. I fit a whole picnic meal in here plus a couple bottles of wine. After 2 hours of hiking everything was still chilled to perfection.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Don't even bother.",
      "text": "The interior ripped almost the instant I put something in it, then proceeded to leak everywhere. Complete garbage. This would be overpriced if it were free.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Stotz",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Perfect for picnicking",
      "text": "Yes! Item arrived on time & is exactly what I was looking for! Perfect for picnicking!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    }
  ],
  "product_meta": {
    "title": "6 Bottle Wine Carrier - Insulated & Padded Wine Carrying Cooler Tote Bag with Handle and Adjustable Shoulder Strap for Travel or Picnic, IDEAL Wine Lover Gift, Black",
    "description": "Color:Black - 6 BottlesSKU :1KTWB600BK\n\nInsulated bag is lightweight, durable and compact insulated food, wine container has a dual zip-around closure. It is made elaborately of durable 600D Polyester, insulated with the PU material which easy to clean and keep temperature cool for hours. \nThe front pocket storing tools, napkin, snake etc. Thermal insulated compartment can hold 6 bottles of normal size red wine. The thick padding detachable divider prevent wine bottles from clinking or shattering, take it out and instantly turn it to a large picnic bag. Both side mesh pockets for additional storage space. Easy-grip handle & adjustable shoulder strap made it easy to carry.\nwine carrier bag is a great bag for taking your wine, food and beverages to work, school, picnic and field trips while keeping them cold for hours.\n\nPackage Content:\n1x 6 Bottles Wine bag",
    "rating": 4.4,
    "feature_bullets": [
      "PORTABLE WINE CARRIER - The strong handle, thick padded & thermal insulated material and adjustable shoulder strap make it the perfect wine carrier for outdoor activities. Great for transporting wine to parties, wine dinners, restaurants, pool or beach parties, picnics, concerts and sporting events. Put your wine in this bag and start your travel at ease!",
      "PADDED & THERMAL-INSULATED - PU thermal insulated material and 5mm PE foam padding protect your bottles of wine from external collision, keep 6 bottles of wine intact and well chilled for hours.",
      "REMOVABLE DIVIDER - The inside padded divider keeps 6 bottles of wine separate and prevent them from crashing with each other. It's also removable, you can use the wine bag as a insulated cooler bag for picnic or transporting water, beverage or beer….",
      "AMPLE STORAGE SPACE - 11\" x 7.5\" x 13.5\" (L x W x H), the large size wine carrier has ample space for 6 normal size bottles of wine.",
      "IDEAL WINE LOVER GIFT - Elegant look and pratical design make this wine carrier suitable for all age wine lovers. If your families or friends are wine drinkers and love to share wine with others, this wine carrier would be a excellent gift for them."
    ],
    "specifications": {
      "Product Dimensions": "13.6 x 12.2 x 3.1 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "Tirrinia",
      "ASIN": "B076F4NKFJ",
      "Customer Reviews": "4.4 out of 5 stars192 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#25,370 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 1, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Dining & Entertaining",
      "Kitchen & Dining",
      "Bar Tools & Drinkware"
    ],
    "price": 25.98
  }
}