{
  "website_summaries": [
    {
      "verdict": "A soft, sturdy toothbrush that won't hurt your gums and will leave your teeth feeling like you just left the dentist.",
      "pros": [
        "Comes in a 5-pack",
        "Soft bristles that won't damage your gums",
        "Comfortable to hold and maneuver in your mouth",
        "Excellent value for the price"
      ],
      "cons": [
        "Many feel that the activated charcoal bristles don't make a huge difference"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Will take some time to get used to",
      "text": "The bristles are soft but due to the material, my gums have been slightly damaged and hurting. Not for everyone. If you have sensitive gums, I wouldn’t recommend these. [update] I brushed lighter than usual allowing my gums to recover and when they were completely healed, I started brushing g normally agai and my gums are used to this brush. Now it’s all good",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah",
      "helpful_votes": 146,
      "publication_date": 20180617
    },
    {
      "title": "Nice product, nice people.",
      "text": "Really nice product. It has soft brushes, but can still be very effective. I don't know if it's because of my other products, but my teeth feel cleaner and seem whiter. My gums were sensitive after first few uses, but I believe it's a result of getting used to the new brush. I have no real complaints yet. Also, the seller is very kind. They sent a friendly email afterwards, which is really the only reason I'm responding. :P Thanks a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Lowieanne",
      "helpful_votes": 91,
      "publication_date": 20180325
    },
    {
      "title": "Great quality, great value",
      "text": "This product was hands down amazing. The bristles were soft, but still durable and effective. The handles are stable and feel comfortable while brushing. Also the charcoal lasts long on the bristles and don’t stain teeth at all. At five brushes, this is an amazing buy, will definitely be buying again.",
      "rating": 5.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 81,
      "publication_date": 20180718
    },
    {
      "title": "I'd recommend",
      "text": "It's a quality tooth brush that feels great when using it. It's medium soft, gentle yet firm enough to do its job. I'll have to wait and see if it does all that it says it will. I'm glad I bought a 5-pack. I would recommend. Updated to 5-stars. Needless to say, I ordered and received my second 5-pack as my wife is now using the toothbrush too.",
      "rating": 5.0,
      "verified": true,
      "author": "Who Da Guy",
      "helpful_votes": 66,
      "publication_date": 20180321
    },
    {
      "title": "While the Charcoal Powder would be something I recommend, these brushes I do not",
      "text": "I got these with the Active Wow Teeth Whitening Charcoal Powder. While the Charcoal Powder would be something I recommend, these brushes I do not. Now I'm the type of person that brushes very vigoursouly and for a full two minutes - I actually set a timer on my iPhone. Each time I used the brush, thistles came off into my mouth. This has happened every single time I've used it. This makes me wonder about the quality of the brushes. If you don't mind getting the thistles black on another brush, I'd use something besides this.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill Fath",
      "helpful_votes": 167,
      "publication_date": 20180422
    },
    {
      "title": "I Love it, it is a good brush that i ...",
      "text": "I Love it, it is a good brush that i have been looking for a long time. This Brush is soft and able to a perfect cleaning, I have Bridge and implant, and this brush really works for me. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire Chen",
      "helpful_votes": 64,
      "publication_date": 20180321
    },
    {
      "title": "I wanted to love it. But it was a total waste.",
      "text": "I wanted to love this so much! But unfortunately I save this for a vacation trip and didn't regret it until the first night when I first tried it. It felt okay in the hand but my gosh, the bristles are so soft. And not a good soft. I typically use Colgate super soft but this is even softer. I brush my teeth systematically and because of these soft bristles, I spend twice as long brushing my teeth. STILL, I felt my mouth was filthy- no friction or cleaning power- despite using mouthwash afterwards. I could feel the plaque building... Haha. A little extreme but I threw it out as soon as I got home.",
      "rating": 1.0,
      "verified": true,
      "author": "ang",
      "helpful_votes": 18,
      "publication_date": 20181209
    },
    {
      "title": "Gets in between teeth leaving a better clean feeling in your mouth.",
      "text": "Surprisingly it leaves such a clean and fresh feeling in your mouth. The fine bristles get in between your teeth and clean better. I used my toothpaste with it but I plan on buying the toothpaste to try with it as soon as possible.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Combrink",
      "helpful_votes": 27,
      "publication_date": 20180105
    },
    {
      "title": "Five Stars",
      "text": "It's comfortable. Gumfriendly. And a lifetime warranty. One of the best deals in Amazon I guess.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirk Almonicar",
      "helpful_votes": 37,
      "publication_date": 20180423
    },
    {
      "title": "Not effective for whitening, but feel dreamy!",
      "text": "I've been using these brushes for nearly 3 weeks. I don't feel as though it whitens my teeth. But...the bristles are so soft and effective at getting between every nook & cranny! I have sensitive teeth & receding gums. This brush feels like heaven & does not agrivate the tenderness at all. I wear Invisalign & they work great for cleaning the grooves. Love these!",
      "rating": 5.0,
      "verified": true,
      "author": "L. McElroy",
      "helpful_votes": 19,
      "publication_date": 20180318
    },
    {
      "title": "Bad quality",
      "text": "The bristles fell out at first use. I've never had that happen before. It was like tons of small hard hairs in my mouth.",
      "rating": 1.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 79,
      "publication_date": 20180330
    },
    {
      "title": "Works very good!",
      "text": "I use and have charcoal toothpaste already which I don't use often because it can be messy at times. Randomly saw this as a recommendation in Amazon so I gave it a shot. Within the first time using I saw a difference. These are pretty awesome. And the brush it self is like a mix of soft and medium. Exactly how I like em.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Ksmith",
      "helpful_votes": 16,
      "publication_date": 20180320
    },
    {
      "title": "The perfect toothbrush!",
      "text": "I love these toothbrushes! The brittles are super soft so they do not irritate your gums. The head of the toothbrush is small enough to get in those hard to get to areas of your mouth. I use these toothbrushes with the charcoal toothpaste and they are the perfect combination to deliver that awesome brushing experience. Highly recommend especially if you are using any kind of charcoal toothpaste.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy U Allen",
      "helpful_votes": 13,
      "publication_date": 20180409
    },
    {
      "title": "Feels and works like a good toothbrush",
      "text": "I’m happy with this. It is soft (as my dentist recommends) but cleans well. I was relieved that the charcoal didn’t come out in my mouth - photo shows one I’ve used (left) and a brand new one from the package. Other than the used one being wet, you can’t tell the difference. I also used it first with white toothpaste so I could see if there was any grey to it, and there wasn’t any. Long term, I’m curious to see if the charcoal will make a difference it short term, I’m very happy with it. It feels and works like a good toothbrush.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 6,
      "publication_date": 20190801
    },
    {
      "title": "A completely new experience",
      "text": "I like the toothbrush just fine after a few uses. I haven't had them long enough to really say more than that. The black brush takes a little getting used to, but I do like the slim head and the gentle soft brush since that is what my dentist recommended. I tried the charcoal toothpaste and I'm sorry to say that it was a complete turn off! I don't think I could ever get used to that. I'll continue using the toothbrushes though because they are just what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "jester",
      "helpful_votes": 11,
      "publication_date": 20180328
    },
    {
      "title": "I have to say that I’m extremely pleased with the quality of these toothbrushes",
      "text": "I was not paid nor did I receive these toothbrushes for free. I have to say that I’m extremely pleased with the quality of these toothbrushes. The bristles are so very soft and feel wonderful on my gums which is unusual. I find myself brushing longer due to how good the bristles feel on my gums, not scratchy, but massaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Austin",
      "helpful_votes": 11,
      "publication_date": 20180202
    },
    {
      "title": "Stop looking further for toothbrushes!",
      "text": "If you are in the market looking for your next toothbrush, look no further. This is what you need. Very gentle on teeth and cleans well too. My previous toothbrush was harsh on gums and caused occasional bleeding too. Since I switched to this toothbrush, there is no bleeding and my gums are also happy. If you need a gentle toothbrush for yourself or entire family, this is worth a try. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Raj",
      "helpful_votes": 7,
      "publication_date": 20180823
    },
    {
      "title": "New favorite tooth brush",
      "text": "I was surprised how well the tooth brushes work. I have sensitive gums and the bristles are soft but make my teeth super clean all day. I have tried looking for soft ones at drugstore and couldn't find any so I will be purchasing here in The future. The bristles are a little uneven if you use powder charcoal it won't fall off the brush which is cool. I highly recommend especially for sensitive teeth .",
      "rating": 5.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 9,
      "publication_date": 20180204
    },
    {
      "title": "Best tooth brushing experience of my life!",
      "text": "These toothbrushes are the best I’ve ever used, hands down. They are soft in the gums and still get my teeth very clean. They fit with ease where most other toothbrushes don’t. This is the first time that I’ve felt it was effortless to clean my wisdom teeth. I recommend this toothbrush to anyone with overcrowded teeth or difficult to reach areas.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180212
    },
    {
      "title": "Where’s the proof???  No way am I sticking these in my mouth!",
      "text": "Shady! There is no ingredient list, no ADA seal...no indication whatsoever that these weren’t made in someone’s basement dungeon. No proof that it is actually even charcoal!",
      "rating": 1.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 8,
      "publication_date": 20181015
    },
    {
      "title": "excellent buy",
      "text": "These are great toothbrushes for the charcoal toothpaste, the handle is ergonomic for comfortable grip and the bristles of the brushes are just the right \"softness\" to properly clean and whiten teeth - after I finished with my charcoal toothpaste, my teeth and gums were fresh and clean - these are an excellent buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180607
    },
    {
      "title": "Low quality brushes",
      "text": "These brushes irradiated my gums and I kept finding lose bristles in my mouth. They have black bristles but I see no other indicator that they work better for charcoal whitening toothpaste than a regular tooth brush. Also Prepare to be harassed by emails begging for reviews titled \" Did I do something wrong?\" I have gotten at least 6 of these emails.",
      "rating": 1.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 5,
      "publication_date": 20181129
    },
    {
      "title": "Amazing!!!",
      "text": "Where have these toothbrushes been my whole life?! love them, they are perfectly soft and reach places other brushes can't...I prefer these over electric toothbrush. My kids use them too and along with the charcoal toothpaste..their teeth are plaque free and white as can be...no stains, even after one use! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne U",
      "helpful_votes": 7,
      "publication_date": 20180830
    },
    {
      "title": "Health Scare DO NOT BUY!!!! Not enough info on packaging!!",
      "text": "Giving this product one star, I would give less if I could. The reason is Because I’m not sure what they put on the tooth brushes but they break my gums out in some strange rash. At first I tried it with charcoal and it happened, so I thought maybe it was the charcoal. Then I gave it up waited a couple weeks and then tried it again this time with only toothpaste, And again red sore inflamed gums. So I finally realized it was the toothbrushes!! DO NOT BUY!!! I am super concerned for health reasons Amazon needs to take this product down ASAP!!",
      "rating": 1.0,
      "verified": true,
      "author": "Purchase slayer",
      "helpful_votes": 6,
      "publication_date": 20180211
    },
    {
      "title": "Don’t waste your money!",
      "text": "Poor quality! First time I used one the bristles started to fall apart!",
      "rating": 1.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 13,
      "publication_date": 20180403
    },
    {
      "title": "Not as Soft as it says it is!!!",
      "text": "These say Ultra Soft ...no it is more like Rough. These did hurt my gums and it chipped off a piece of 1 of my front teeth from the back part. So i threw the rest of these tooth brushes away, I didn't even brush hard ...i tried as gently as i could but it's the Rough bristles. The soft that you all might be looking for is probably the toothbrushes the dentists usually give out to people after a checkup. The toothbrushes i have been given by dentists usually were really soft like if it was soft hairs or something. I DO NOT RECOMMEND THIS PRODUCT!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Izzy C",
      "helpful_votes": 3,
      "publication_date": 20190113
    },
    {
      "title": "I use this toothbrush in conjunction with the Twin Lotus ...",
      "text": "I use this toothbrush in conjunction with the Twin Lotus Active Charcoal Toothpasteand my teeth have become noticeably whiter. I also have very sensitive teeth and even toothbrushes labeled as \"soft\" make them hurt. I haven't had a problem with my teeth hurting while using this toothbrush and it cleans my teeth extremely well.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 7,
      "publication_date": 20180303
    },
    {
      "title": "Effective and efficient",
      "text": "This toothbrush is much like the structure of any other toothbrush. Easy, manual toothbrush, comes in a pack of five. Works great at cleaning my teeth and what i liked most about it, is that after continued use, you begin to notice that the black, charcoal bristles, begin to lose color to help you better identify when it's time to switch your toothbrush. I did receive this product at a reduced cost in return for my honest and unbiased opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea myette",
      "helpful_votes": 6,
      "publication_date": 20180125
    },
    {
      "title": "Soft toothbrush",
      "text": "Perfect soft toothbrush. I was looking for soft toothbrush for a while, I used to use a black looking toothbrush from Walmart, but no longer available, so I tried purchasing this, it is perfect, it just what I want, thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "ASN",
      "helpful_votes": 6,
      "publication_date": 20180725
    },
    {
      "title": "Really work",
      "text": "These really work. The soft bristles are great for cleaning teeth and leaving mouth fresh. I think the charcoal really does remove tea and coffee stains from your teeth. I am not sure how long the charcoal will last, but the toothbrush itself is highly effective. Good buy for 5 toothbrushes regardless.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 6,
      "publication_date": 20180227
    },
    {
      "title": "Soft and Slim",
      "text": "Perfect for use with charcoal whitener., I like to change my toothbrush every few months & this set will allow me to do so. The bristles are just right,",
      "rating": 5.0,
      "verified": true,
      "author": "Steph-O'",
      "helpful_votes": 7,
      "publication_date": 20180326
    },
    {
      "title": "Works how its suppose to",
      "text": "Works well for the price, super soft against my gums. They kind of tickle. Not great at cleaning the back of the teeth or tongue if there is a lot of build up because of how soft they are, so I recommend to not skip brushing, 2-3 times a day obviously.",
      "rating": 5.0,
      "verified": true,
      "author": "FeiAiJie",
      "helpful_votes": 5,
      "publication_date": 20180721
    },
    {
      "title": "These are lovely.",
      "text": "This is the best tooth brush I believe I have ever owned as far as just comfort in use, the bristles are soft and seem resistant to that brittle-effect a lot of soft bristle brushes seem to quickly develop, I am fairly shocked at the quality for such a reasonable cost. I only gave 3 stars on the whitening effect, not because the effect may or may not be taking place, it is just I have not been monitoring my teeth for the effect and my teeth are white already. So, its an unknown to me in the couple weeks I have been using these.",
      "rating": 5.0,
      "verified": true,
      "author": "steventypedwords",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Very soft.... But they're not bad",
      "text": "My first time using the toothbrush I was immediately turned off with how soft the bristles were as I'm used to using harder brushes.... I also noticed that my gums hurt after using it. I then noticed that it actually cleaned my teeth. A week later of using this toothbrush, all my complaints pretty much disappeared. I do love love the all black look of the toothbrushes. I'm still getting used to how soft it is, but I think it's better to use the toothbrush with the charcoal powder as opposed to actual toothpaste. No noticeable difference with the color of my teeth yet but if that changes I will update my review.",
      "rating": 4.0,
      "verified": true,
      "author": "sleepykeebler",
      "helpful_votes": 3,
      "publication_date": 20180105
    },
    {
      "title": "I love these brushes",
      "text": "I love these brushes. The only issue is that one of my brushes came without bristles. Hard to love the product knowing I did not get what I paid for.",
      "rating": 2.0,
      "verified": true,
      "author": "dominic doctor",
      "helpful_votes": 10,
      "publication_date": 20180402
    },
    {
      "title": "I was curious.",
      "text": "Bought these to see what the hype was about. They are very soft and feels great. I have not bought the Charcoal Powder but might try that next. I have not seen much difference as far as whiteness. I drink a lot of coffee so hopefully I can get a lighter shape of stained teeth.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael T.",
      "helpful_votes": 6,
      "publication_date": 20180327
    },
    {
      "title": "Soft and comfortable",
      "text": "I bought these to go with the charcoal toothpaste and they have soft bristles and are not too large so it's easy to brush back teeth. Hopefully, if I use these often along with the charcoal toothpaste my teeth will loose some of the stains I've been trying to remove.",
      "rating": 5.0,
      "verified": true,
      "author": "Juniquilt2day",
      "helpful_votes": 6,
      "publication_date": 20180407
    },
    {
      "title": "D I like that even though its a soft bristle brush",
      "text": "I have only been using them for a week, but my teeth feel so polished :D I like that even though its a soft bristle brush, it still feels sturdy like an adults toothbrush (sometimes I feel like the soft bristled brushes are weak) but these have super dense brush heads so it feels like it gets all my adult teeth lol. The package came on time and I had no problem with the packaging. Regarding the whitening aspect, I'm not sure it's very whitening but it has only been a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Massiel Morales",
      "helpful_votes": 5,
      "publication_date": 20180327
    },
    {
      "title": "Avoid--Absolute Trash Product",
      "text": "This pack was the worst set of toothbrushes I have literally ever purchased. The head is very small and compact almost as if it were designed as a child's toothbrush. As such, the toothbrush tore up my gums badly. Since I absolutely cannot use them to brush my teeth, I was hoping to use them to clean things like my sneakers. But the bristles are treated and the black color DOES come off when wet. So, I can't even use these brushes for anything. Literally. A complete waste of money. Avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Romy",
      "helpful_votes": 2,
      "publication_date": 20190629
    },
    {
      "title": "Love them!",
      "text": "I love the very fine, soft bristles. I tend to brush my teeth very hard resulting in receding gums. Years ago I followed my dentist's recommendation to use only \"soft\" toothbrushes. Some of them started off soft but soon hardened, so I was going through a lot of brushes. I only knew what soft was when I tried these. You just cannot brush too hard with these and they do a great job cleaning. They are by far the best, most comfortable I have ever used, and I am 68. I cannot attest to the whitening because I didn't pay attention to that.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Allan",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Dental Expert vs Curaprox CS5460",
      "text": "This toothbrush has an exceptional value - for 2$ a piece you get a lightweight toothbrush with very soft bristles. In comparison to Curaprox CS5460 (Amazon UK best seller toothbrush), the Dental Expert has better grip and its plastic almost never hit my teeth (with Curaprox it happens quite often). However, the Curaprox has denser and higher quality bristles which is, and it comes in different colors so you don't take your wife's toothbrush by mistake.",
      "rating": 5.0,
      "verified": true,
      "author": "Josef",
      "helpful_votes": 4,
      "publication_date": 20180731
    },
    {
      "title": "These brushes are a perfect value and work wonderfully with my charcoal tooth powder",
      "text": "These brushes are a perfect value and work wonderfully with my charcoal tooth powder. They're soft and feel great, allowing the powder to do its work without 'hard' bristles getting in the way. Once of my favorite things about them is that there is an angled shape at the end of the brush. My index finger rests on it naturally when I'm brushing my top teeth and provides more control than the general tapered end of most brushes.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisChow",
      "helpful_votes": 4,
      "publication_date": 20180204
    },
    {
      "title": "Give it a try!",
      "text": "I don’t know if I am imagining it but my teeth seem whiter all ready. You HAVE to brush for several minutes or your teeth are black, so that’s a good thing. So far I like this stuff and will get the flavored next time.",
      "rating": 5.0,
      "verified": true,
      "author": "HELPIE",
      "helpful_votes": 5,
      "publication_date": 20180302
    },
    {
      "title": "Good Product. Better than other \"staple\" brands...",
      "text": "The bristles are very fine and they seem to be able to get deeper in between teeth because of that. Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "C.L.",
      "helpful_votes": 6,
      "publication_date": 20180714
    },
    {
      "title": "Toothbrushes worthy of a review!",
      "text": "I didn't think I would ever write a review about toothbrushes, yet here I am. These are wonderful, I've used charcoal brushes for the past year, but these truly are different & the best. The follow up from the company is also wonderful, but it's honestly like a massage for your teeth & gums.",
      "rating": 5.0,
      "verified": true,
      "author": "godsninja4life",
      "helpful_votes": 4,
      "publication_date": 20180228
    },
    {
      "title": "Even better!",
      "text": "So, I decided to order the brushes that go with the toothpaste? Amazing! My teeth feel squeaky clean and look great! I am a coffee drinker and am 59! I highly recommend these products! You just got to get over the black bristles and toothpaste, but that goes away quickly when you see the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Mazel",
      "helpful_votes": 4,
      "publication_date": 20180201
    },
    {
      "title": "Try these out!",
      "text": "At first I saw \"charcoal\" and thought 'HUH?!' But I am all about using new products, so I took a chance and bought them. The softness is SO PERFECT to get in all of the hard areas and spaces in between my teeth! I love that it comes in such a big pack too, because after a month or 2, I can change the toothbrush out and begin using a brand new one again!",
      "rating": 5.0,
      "verified": true,
      "author": "Cody Comeaux",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "dense bristled toothbrush",
      "text": "I was looking for a very soft toothbrush. I am 70 years old and require a gentle brush. I did find that by soaking this brush in a cup of water helps to soften the bristles. The bristles are very dense and the spaces between my teeth are tight so the bristles are too tight to fit to get a thorough clean. The service was quick. The product is good and well worth the price; but does not suit my situation well.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryl w",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Sketchy Product=Bleeding Gums",
      "text": "These are cheap and trash. For $7.99, I suppose I should have known that you get what you pay for. These made my gums sore and bleed after three uses. My gums don’t typically hurt or bleed so I can attribute this brush being the issue. I’ll stick to name brand, quality ADA-sealed brushes from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "SLM",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "Worth the $$$ spent",
      "text": "Love my toothbrushes, they are the perfect small size for great reach in all areas that need be clean in my mouth. They are gentle on my sensitive gums.❤💯🙌",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie Tovar",
      "helpful_votes": 4,
      "publication_date": 20180918
    },
    {
      "title": "Wish the bristles were a little longer",
      "text": "Like the toothbrush and the cleaning. I wish the bristles were just a bit longer to get the backs of my back teeth. My teeth feel squeaky clean after brushing which I don't think I've ever had happen before. (They actually squeak as I finish brusihng them) I will purchase these again.",
      "rating": 5.0,
      "verified": true,
      "author": "KC AZ",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Great product!",
      "text": "The softest toothbrush I've ever used! Good quality, small head, long handle, comfortable to use",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 7,
      "publication_date": 20180318
    },
    {
      "title": "Great ultra soft toothbrushes",
      "text": "Item was great and expected. Very soft and doesn’t hurt the gums. Very clean too! Lasts longer than expected. Great price compared to store.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 4,
      "publication_date": 20180924
    },
    {
      "title": "Soft and fits my mouth.",
      "text": "Obviously black bristles work with charcoal tooth paste. The bristles are soft enough for my gums, and the head is narrow enough for my small mouth. It’s the best adult brush I’ve ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "MummieT",
      "helpful_votes": 4,
      "publication_date": 20180702
    },
    {
      "title": "Super soft for sensitive gums",
      "text": "I purchased this for my partner and myself and we've been using them for the last month or so, and I love how soft the bristles are, and how clean they leave my mouth feeling. I haven't noticed my teeth be whiter, necessarily, but I don't think that has anything to do with the toothbrush. They haven't gotten nasty and spread out like the regular toothbrushes I get at the drugstore either. This is with me brushing my teeth twice daily, AND brushing my retainer daily as well. Over all, I give this product 5 stars for the softness of the bristles AND the durability, since I do brush rather hard, and I do have sensitive gums.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristian",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Very nice toothbrush. I use activated charcoal as a daily ...",
      "text": "Very nice toothbrush. I use activated charcoal as a daily toothpaste and these toothbrushes are perfect for cleaning the teeth and gums. The shipment was fast and the customer service was more than expected. GREAT SELLER !!! Thank you, Eddie",
      "rating": 5.0,
      "verified": true,
      "author": "edward wehmeyer",
      "helpful_votes": 4,
      "publication_date": 20180228
    },
    {
      "title": "used only for a week",
      "text": "I was looking for a ultrasoft toothbrush and bought these. While the bristles were soft, the edges are sharp and I could not use it more than a few days as it hurt my gums more and more with every use and after a week i gave up. The bristles fall off as well. I have 4 left of the pack of 5 and would not be using these anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Manny",
      "helpful_votes": 4,
      "publication_date": 20180906
    },
    {
      "title": "Great toothbrushes! I have 3",
      "text": "Great toothbrushes! I have 3,7,9 yr olds and they use them along with my husband and myself. We love how gentle they are but get the job done. And my boys think black bristles are so amazing they have been loving brushing bc their teeth!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Stromberg",
      "helpful_votes": 4,
      "publication_date": 20180225
    },
    {
      "title": "Good quality and value for money",
      "text": "I’ve been using activated charcoal since a year and trying out new toothbrushes. Usually each toothbrush costs around 3$ so I thought the price of 9.99 for 5 is a great deal. I wasn’t sure if the quality was good, but there was no need to worry. The toothbrushes are excellent quality and I’m sorted for this year and will look to buying more for my partner.",
      "rating": 5.0,
      "verified": true,
      "author": "Zhill",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "As described.",
      "text": "exactly as described. The bristles are quite soft, a bit too soft for my liking but the product description does mention soft bristles. So far we’ve found them to get the job done. Not sure how the charcoal helps in the bristles but we did also purchase and use intermittently the accompanying tooth paste. You may look like a monster during brushing but it seems to have lightened my teeth up a bit. Not very minty. But that’s for another review.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Did Not Try Them",
      "text": "While they felt nice and soft I ended up not even trying them because of the toothpaste that often accompanies these toothbrushes. I care about my teeth and do not want to risk anything. There is just too big a chance that they will end up staining my teeth that the usual white ones. I listened to my gut instinct after reading the instructions and just tossed them out. A complete waste of a purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Super soft tooth brush",
      "text": "I have a nasty habit of brushing too hard. If I get distracted while brushing I find my self really brushing hard. This brush is soft enough that even my distracted hard brushing probably won’t hurt me!",
      "rating": 5.0,
      "verified": true,
      "author": "DeborahDarlingTop Contributor: Knitting",
      "helpful_votes": 4,
      "publication_date": 20180411
    },
    {
      "title": "toothebrush nut!",
      "text": "I love to try new toothbrushes. With this purchase I have found my “forever” brush. No need to look for any other; this is it! Does a wonderful job cleaning, especially at the gumline. Thankyou!",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie shelofsky",
      "helpful_votes": 4,
      "publication_date": 20180325
    },
    {
      "title": "Quality Brushes that Are Made to last!",
      "text": "I am excited to see what these toothbrushes and the charcoal toothpaste can do to my teeth! The brushes are soft, but strong and feel like they’re quality-made! Clean up easily with rinsing! 5 Stars!",
      "rating": 5.0,
      "verified": true,
      "author": "A. B. Runkles",
      "helpful_votes": 4,
      "publication_date": 20180414
    },
    {
      "title": "Great toothbrush",
      "text": "I wasn't sure if this kind of toothbrush would really meet my needs but decided to go ahead and give it a try since I have heard such good things about charcoal toothbrushes. I had been using charcoal powder to brush my teeth for a while and I just used my normal toothbrush which I thought was doing a good job. I found this toothbrush to be very effective at cleaning in between my teeth and leaving them smooth and polished. This toothbrush has far exceeded any expectations I had and I will continue to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "NaturallyLash",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Please try them",
      "text": "At first I didn’t like these brushes but after a few days they grew on me and I will buy them again. I feel they really clean my gums and teeth better than the regular tooth brushes",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. TNT",
      "helpful_votes": 4,
      "publication_date": 20180506
    },
    {
      "title": "Bristles fall out",
      "text": "Saw all the positive reviews and I like charcoal toothpaste, so I figured I would give them a try. I like the feel of the toothbrush, and my teeth do seem a little whiter, similar to when I used charcoal toothpaste, but one pretty big issue IMO. The bristles keep falling out! I've only just tried my first one, but on it's first use it lost at least 1/2 a dozen bristles while brushing. Not a huge deal, but not a great experience either.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Excellent, well made toothbrush",
      "text": "The best toothbrush I’ve ever used. And it has become the only toothbrush that I use. I love the soft bristles and how they get between my teeth to sweep out food and plaque. These brushes are very well made and they’re the only ones that I’ve found to stand up to to abuse my teeth put them through. Most of the more expressive brushes only last me for a couple weeks before I have to replace them. These seems to last me for months before needing to be replaced!",
      "rating": 5.0,
      "verified": true,
      "author": "PrinceXiaobao",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Everything arrived as expected very satisfied with the quality and the promptness of delivery",
      "text": "Everything arrived as expected very satisfied with the quality and the promptness of delivery, all in all, very pleased with service.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph M.",
      "helpful_votes": 4,
      "publication_date": 20180701
    },
    {
      "title": "Good Charcoal Toothbrushes",
      "text": "At first I wasn't super happy that these were Gentle Soft. When I got them, they looked great. Once I applied some toothpaste, I gave it a test run. The brush is very soft as it cleaned my teeth. I am not sure how good the whitening capabilities are, but I will update the review after a month to see if I noticed a difference. I would buy these and recommend them to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "John Couch",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Very happy would recommend",
      "text": "I bought these toothebrushes because they were cost effective and seemed interesting with the charcoal aspect to them and looked pretty cool too. Overall im very happy with them they are comfortable on the gums but still feel like theh are cleaning. The overall design of them is really nice and seems quality. Im still using the first brush from the package so i cant attest to any of the charcoal cleaning qualities but I would recommend these to anyone who needs a good toothbrush.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Actually Polishes your teeth!",
      "text": "Loving the tooth brushes! Soft bristles that really do polish your teeth. The bristles, when put in water, feel rubbery to the touch but very soft on your gums and teeth. I believe the \"rubbery\" feel is why they polish your teeth so well. My main toothbrush I use is the Sonicare and I just use this one for a really quick brush if I'm in a hurry. But I must say I'm really impressed on how clean my teeth feel after using these brushes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180411
    },
    {
      "title": "Switched",
      "text": "I'm in total shock. I'll never use another brush again. This brush healed my gums completely. Clean everytime. After 3 days of brushing all pain was gone . Sore areas from flossing completely healed . Breathe fresh without the hot extras. I'm sticking to these brushes. Definitely a keeper. People you need to try these.",
      "rating": 5.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "and I am glad I did",
      "text": "To be completely honest I didn't know soft bristle toothbrushes existed and bought this thinking it was a normal/medium bristle toothbrush, and I am glad I did. My teeth and gums are very sensitive and often would bleed before when brushing my teeth. With these that doesn't happen and I'm very happy I got these.",
      "rating": 5.0,
      "verified": true,
      "author": "FriendlyGamerGuy",
      "helpful_votes": 3,
      "publication_date": 20180530
    },
    {
      "title": "Charcoal toothbrush",
      "text": "Well I ordered these toothbrushes and are really gentle on the teeth and gums. They last a while and they look really cool too with the black color and bristles are black too and are charcoal infused I dont know if I have seen any whitening but they are really good and feels good in the hand. I would give them a shot for getting 5 in a pack and the price. I am not affiliated with this brand just an honest review and they didnt send the product to me for free either and I am not getting paid to write this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick R.",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Nice and soft",
      "text": "I'm always skeptical when brush makers say their brushes are soft. These are spot on. Noticeably softer than the one I was using from the dentist. Also, love the black bristles. I have been using charcoal powder once a day and there's no issue with color because.......wait for it......they are black!! The price of these is excellent. I'd recommend them for everyday use.",
      "rating": 5.0,
      "verified": true,
      "author": "Nyberg",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "I've replaced my electric toothbrush with these Charcoal toothbrushes.  Great product.",
      "text": "I've been using the charcoal toothbrush for a couple of days and so far I'm impressed with the softness of the bristles, the bristles seems to work better between the teeth then the bristles on my electric toothbrush and my mouth feels cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Andi O",
      "helpful_votes": 3,
      "publication_date": 20180304
    },
    {
      "title": "Not really sure about this",
      "text": "with charcoal trending in so many products I decided to surprise my daughter so I purchased this for daughter to use at University; she says she does not notice a difference in the whiteness of her teeth, and is using it because she needs a toothbrush. She does say that the bristle is somewhat soft on her teeth.",
      "rating": 3.0,
      "verified": true,
      "author": "Oweary1",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great, but not eco friendly",
      "text": "Would say I loved the feeling of them, the whitening (on the first couple of uses) properties and the overall experience. However, these are made of plastic and I would not recommend them as much as the other more eco friendly bamboo options out there for similar cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Damiana Acuña",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Would recommend.",
      "text": "I love these toothbrushes. They’re soft but I feel like they are also effective. I can tell my teeth are getting whiter, but I’m also using a charcoal toothpaste that may be contributing to that.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn Swim",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Not for sensitive/soft gums",
      "text": "A lot of fake reviews. Do NOT buy this toothbrush if your gums are sensitive. It’s not gentle aside from the soft bristles. I am also not seeing any results whitening-wise and i’ve been using it for a couple of weeks. Decently soft for the price I guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Shana ",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Awesome toothbrush",
      "text": "Honestly, (like most fad products) I thought that the \"charcoal infused toothbrush\" was going to be nothing more than a gimmick. BUT after the first brush my teeth felt incredibly clean. Then after a few days of using it, my teethe were actually whiter! My wife said the same thing (and she was mad at me for getting it because she bought me another toothbrush the same day (oops)). If a disgruntled wife admits you did good, it must actually be good.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 3,
      "publication_date": 20180403
    },
    {
      "title": "Bristles came out in my mouth",
      "text": "I originally rated this toothbrush 5 stars but i was too quick to judge because after using this for a little over a week the bristles started coming out in my mouth and i never seen a change at all in my teeth, terrible toothbrush.",
      "rating": 1.0,
      "verified": true,
      "author": "jrmhknz1981",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Simply Amazing",
      "text": "I am amazed at the softness and quality of these toothbrushes, the clean they give is simply amazing. Oral B was (past tense) toothbrush for so many years, now I have the dentist polisher, that provides a total clean. Dental expert, you have a new customer. Stay true to your product and never sacrifice on quality, this product is outstanding. Ten Stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Outstanding find",
      "text": "These are amazing.....I thought they would be hard even though they say soft and it is actually soft. Also there is no nasty taste with the brushes at all. I definitely recommend this product and I am going to continue buying this.",
      "rating": 5.0,
      "verified": true,
      "author": "Omega Red17",
      "helpful_votes": 3,
      "publication_date": 20180401
    },
    {
      "title": "Feels great and cleans great",
      "text": "I wasn't quite sure what to expect so I was pleasantly surprised when trying the toothbrush for the first time. The bristles are soft and it cleans my teeth to the satisfaction of my electric toothbrush.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 3,
      "publication_date": 20180403
    },
    {
      "title": "Great brushes for a cleaner mouth",
      "text": "Been using this brush combined with charcoal powder so whiten my teeth, and it has been working. The bristles are very soft and will not irritate your gums and mouth. I take my dental hygiene very serious, and I'd highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafi1998",
      "helpful_votes": 3,
      "publication_date": 20180305
    },
    {
      "title": "... using with activated charcoal teeth whitening and these are perfect for the purpose",
      "text": "very soft bought for using with activated charcoal teeth whitening and these are perfect for the purpose. sellers are very professional and care about their customers really like this professional attitude.",
      "rating": 5.0,
      "verified": true,
      "author": "Shahab Q.",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "Soft bristles",
      "text": "I have been using an electric toothbrush for many years so I was not sure how well I would line a regular toothbrush again. I like this toothbrush and it had really soft bristles. It seems to clean really well. I had my teeth cleaned just a few weeks before receiving the toothbrush so we will see how well it actually cleans when I go back to the dentist in a few months.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Amazing toothbrush!",
      "text": "OMG! I received my order yesterday, brushed my teeth with it before bed, and I am thoroughly delighted. The degree of softness, yet firmness is perfect, and my teeth feel the cleanest and smoothest since my last dental hygiene appointment a few months ago! I cannot discern any whitening difference, because my teeth are inherently rather yellow and translucent 😁 👏💖",
      "rating": 5.0,
      "verified": true,
      "author": "Robin K. Davidson",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Softer than you’d think, large head, bristles get into crevices",
      "text": "These were soft, and softer than I expected them to be considering activated charcoal was used in the bristles. Brushing was softer than brushes we typically use, and I admit my mouth felt clean (not as clean as my electric brush but close). They also worked well with my clay based toothpaste. It’s a little soon to tell how they work for whitening, but based on how well they clean I’m hopeful.",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie Carr",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Amazing toothbrush",
      "text": "After thousands of years of mankind using all manner of different apparatus to clean their teeth, they finally got it right. These are by far the BEST toothbrushes I have ever used! I don't know how much actual whitening the \"charcoal infused\" bristles really do but they are super thin so they really get all up in-between ur teeth and clean em. And they're also really soft so it doesn't hurt. Love this toothbrush and u should definitely try them.",
      "rating": 5.0,
      "verified": true,
      "author": "Gavin M.",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Charcoal tooth brush",
      "text": "One of the best tooth brush I have ever used. I no buy regular tooth brush. Highly recomended to use Charcoal tooth and paste.",
      "rating": 5.0,
      "verified": true,
      "author": "Dhokhar1979",
      "helpful_votes": 3,
      "publication_date": 20180914
    },
    {
      "title": "These brushes are the best",
      "text": "These brushes are by far the best I’ve used and I’m 65 +. They are soft yet able can get into all the in-between places without any scratching or damage to your gums. I’ll use them at least twice a day, everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Z.",
      "helpful_votes": 3,
      "publication_date": 20180323
    },
    {
      "title": "Not as expected",
      "text": "Not what I expected. They seem to be just plain black toothbrushes when you use them no charcoal.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa W.",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great price, soft but not to soft!",
      "text": "Genuinely love these! Great price, soft but not to soft where it doesn’t feel like you’re getting a good clean. Not to sure about the whitening help it does seem to claim, but honestly love these anyways with a whitening tooth paste.",
      "rating": 5.0,
      "verified": true,
      "author": "BullmastiffMama22",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Good buy",
      "text": "I really like this toothbrush. The bristles are soft. The handle is easy to hold. I have sensitive teeth and gums and this works perfect. You get 5 brushes for $10. I'm very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20180409
    },
    {
      "title": "Soft and good quality",
      "text": "These brushes feel really sturdy and soft but not flimsy. My gums have been super sensitive and so far these toothbrushes have not irritated my gums. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Miss J",
      "helpful_votes": 3,
      "publication_date": 20180512
    },
    {
      "title": "Not so soft",
      "text": "After brushing with these for the third time, my gums were very sore. I wouldn’t call these super soft. I’ve read other reviews where people had the same experience that I did, but after taking a break from this toothbrush for a few days, then going back to it, they had better results (toughened up their gums?). I will try the same and see if I get a similar result.",
      "rating": 3.0,
      "verified": true,
      "author": "RBoz",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Nice soft toothbrushes",
      "text": "These toothbrushes are very soft. I used my toothbrush along with activated charcoal toothpaste. My teeth feel very clean & the toothbrush is soft and nonirritating. I would recommend these toothbrushes!",
      "rating": 5.0,
      "verified": true,
      "author": "MamaJ",
      "helpful_votes": 3,
      "publication_date": 20180129
    }
  ],
  "product_meta": {
    "title": "Activated Charcoal Teeth Whitening Toothpaste - DESTROYS BAD BREATH - Best Natural Black Tooth Paste Kit - MINT FLAVOR - Herbal Decay Treatment - REMOVES COFFEE STAINS (5 Pack, Black Toothbrush)",
    "rating": 4.5,
    "feature_bullets": [
      "𝐍𝐄𝐖 𝐈𝐌𝐏𝐑𝐎𝐕𝐄𝐃 𝐓𝐎𝐎𝐓𝐇𝐁𝐑𝐔𝐒𝐇 𝐃𝐄𝐒𝐈𝐆𝐍𝐄𝐃 𝐓𝐎 𝐑𝐄𝐌𝐎𝐕𝐄 𝐔𝐏 𝐓𝐎 𝟗𝟗% 𝐎𝐅 𝐏𝐋𝐀𝐐𝐔𝐄 𝐈𝐍 𝐇𝐀𝐑𝐃-𝐓𝐎-𝐑𝐄𝐀𝐂𝐇 𝐀𝐑𝐄𝐀𝐒 – are you looking for quality toothbrush that can easily reach hard-to-reach areas and properly clean your mouth? Dental Expert’s toothbrush pack is designed to eliminate up to 99% of plaque with total convenience. Get the best for your oral health with the new Dental Expert toothbrush that has angled bristles to sweep away all the plaque.",
      "𝐏𝐎𝐖𝐄𝐑 𝐓𝐈𝐏 𝐋𝐎𝐍𝐆 𝐀𝐍𝐃 𝐒𝐎𝐅𝐓 𝐁𝐑𝐈𝐒𝐓𝐋𝐄𝐒 𝐓𝐇𝐀𝐓 𝐀𝐑𝐄 𝐁𝐎𝐓𝐇 𝐄𝐅𝐅𝐄𝐂𝐓𝐈𝐕𝐄 𝐀𝐍𝐃 𝐂𝐎𝐌𝐅𝐎𝐑𝐓𝐀𝐁𝐋𝐄 – are you looking for new toothbrush that is more effective and also comfortable? Ditch your regular old toothbrush and take advantage of the new Dental Expert toothbrush that has been tested for months by top dentists. You’ll find it easier to clean your teeth with this cool toothbrush. What’s more? You can reliably use it with regular or charcoal toothpaste.",
      "𝐈𝐌𝐏𝐑𝐎𝐕𝐄 𝐆𝐔𝐌 𝐇𝐄𝐀𝐋𝐓𝐇, 𝐑𝐄𝐃𝐔𝐂𝐄 𝐆𝐈𝐍𝐆𝐈𝐕𝐈𝐓𝐈𝐒, 𝐀𝐍𝐃 𝐑𝐄𝐒𝐓𝐎𝐑𝐄 𝐎𝐏𝐓𝐈𝐌𝐀𝐋 𝐃𝐄𝐍𝐓𝐀𝐋 𝐇𝐘𝐆𝐈𝐄𝐍𝐄 𝐈𝐍 𝐉𝐔𝐒𝐓 𝐅𝐎𝐔𝐑 𝐖𝐄𝐄𝐊𝐒 – do you have bad gum health, gingivitis or other poor dental health problems? Dental Experts new toothbrush is designed to easily access and properly clean all parts of your mouth (including tongue and upper mouth) so you can boost your overall dental hygiene in four weeks. This new toothbrush is an excellent everyday accessory",
      "𝐆𝐄𝐓 𝐌𝐀𝐗𝐈𝐌𝐔𝐌 𝐕𝐀𝐋𝐔𝐄 𝐖𝐈𝐓𝐇 𝐎𝐔𝐑 𝐒𝐔𝐏𝐄𝐑 𝐏𝐀𝐂𝐊 𝐎𝐅 𝟓 𝐓𝐎𝐏-𝐐𝐔𝐀𝐋𝐈𝐓𝐘 𝐃𝐄𝐍𝐓𝐀𝐋 𝐄𝐗𝐏𝐄𝐑𝐓 𝐓𝐎𝐎𝐓𝐇𝐁𝐑𝐔𝐒𝐇 – how about a super-saver pack of top quality adult toothbrush to remove stains and odor causing germs? Get a set of 5 that you can use for up to 15 months at a bargain price. Our toothbrush are ideal for use by adults, and work excellently well with both activated charcoal and regular toothpaste. Get ONE pack for your entire family.",
      "𝐘𝐎𝐔 𝐆𝐄𝐓 𝐀 𝐏𝐀𝐂𝐊 𝐎𝐅 𝟓 𝐒𝐎𝐅𝐓 𝐖𝐇𝐈𝐓𝐄𝐍𝐈𝐍𝐆 𝐓𝐎𝐎𝐓𝐇𝐁𝐑𝐔𝐒𝐇 𝐅𝐎𝐑 𝐀𝐃𝐔𝐋𝐓𝐒, 𝐎𝐑 𝐘𝐎𝐔𝐑 𝐌𝐎𝐍𝐄𝐘 𝐁𝐀𝐂𝐊 – with our 5-pack, you get soft-bristled, top-quality and highly effective adult toothbrush. If for some reason you’re not happy with product, we’ll make it right and process a refund for you. At Dental Expert, we are committed to optimal dental health. If for some reason you’re not happy with any of our products, we’ll make it right and process refund for you"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "9.49 x 4.92 x 0.98 inches; 3.74 Ounces",
      "UPC": "754185217066",
      "Manufacturer": "Dental Expert",
      "ASIN": "B0777SKKBL",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Manual Toothbrushes",
      "Oral Care",
      "Beauty & Personal Care",
      "Toothbrushes & Accessories"
    ],
    "price": 8.99
  }
}