{
  "website_summaries": [
    {
      "verdict": "This model is impressive because of all the additional tools you get at a decent price.",
      "pros": [
        "This is a leather punch set that also includes rivets, scissors, an awl, and a ruler",
        "Made for use with lots of materials including fabric and plastic",
        "It has more in the set than others in the same price range and is a best bet if you are looking for a kit to keep with your craft supplies",
        "A good starter kit",
        "Punch is well made for the price"
      ],
      "cons": [
        "For certain materials, it will be helpful to use an extra piece of thick paper, like cardboard to help protect the hole punch from the brass anvil with the tool",
        "Without this modification, the tool can dull easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "good variety",
      "text": "I just started making DIY leather things. This is a good start up kit. The only thing I didn't like about it was the scissors. I expected it to cut my leather better then my regular scissors, but it didnt. It seems very dull and barely cuts the leather. So i just end up using my regular westcott scissors.",
      "rating": 4.0,
      "verified": true,
      "author": "craftmom",
      "helpful_votes": 8,
      "publication_date": 20190125
    },
    {
      "title": "Disappointed",
      "text": "The snaps/rivets do not stay at all they just easily pop off if any force is applied can’t really use them at all The hole punch is very good everything else is fine it’s just the rivets that sucks",
      "rating": 3.0,
      "verified": true,
      "author": "bee bee",
      "helpful_votes": 7,
      "publication_date": 20190808
    },
    {
      "title": "Good Quality",
      "text": "I wanted to add rivets to my tote bags. I wasn't sure how this product would hold up, but the quality is actually very good. Very good product for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190319
    },
    {
      "title": "Unhappy",
      "text": "Received package and the container that holds all the little rivets was broken and they went EVERYWHERE. Not happy UPDATE Was contacted and offered a replacement case and rivets. Damage due to shipping.Changed to 4 star as the set itself is sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 3,
      "publication_date": 20191115
    },
    {
      "title": "Dulled EXTREMELY fast, stopped cutting after only 20 holes.",
      "text": "The hole punch seemed to work ok at first but it requires a tremendous amount of hand pressure, causing extremely sore points when trying to do even just a few. Then, after not even 20 holes made it was already dull and not cutting at all, regardless of the amount of pressure applied. These are standard leather strips, supposedly what this tool was made for. The case it arrived in also has a torn zipper so that isn't even a useful item for holding the remainder of the pieces included. This was a complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Veronica",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Product not like advertised picture.",
      "text": "The product isn't the same as the ad. There are 10 slots of rivets in the ad. As you can see from the picture there are only 6.",
      "rating": 3.0,
      "verified": true,
      "author": "jarpea",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great kit. Came with all I needed for my ...",
      "text": "Great kit. Came with all I needed for my project. The hole puncher is sturdy and strong. Well made product.",
      "rating": 5.0,
      "verified": true,
      "author": "selkhis",
      "helpful_votes": 3,
      "publication_date": 20180806
    },
    {
      "title": "Great Buy",
      "text": "I’m new to leather-working but hope to make some leather bracelets. I didn’t want to spend a fortune and I’m very happy with this super nice set in a sturdy zippered case at a very reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki M",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Used, not new",
      "text": "This rivet tools set appears to be a used set. Nothing about it looks new. The items in the pouch are beginning to rust. The pouch zipper was even busted before i opened it. As expensive as this was i would think this would have been a brand new item. Very disappointed. Will not recommend this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaylisa Sweeting",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Fantastic set!",
      "text": "Repaired Costumes for a play in which ever everyone wore leather sandals - needless to say, because it was a musical at least 2 or 3 broke during every show. This set was a great help!! Was able to fix shoes in about a minute!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa M.",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Happy with my purchase",
      "text": "It gets the job done. I had an issue with the case, I emailed the company & they sent me a new one.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great tools for Great projects",
      "text": "I need leather craft tools for a holster project I'm working on. This fit the bill perfectly. Almost everything I needed minus the tooling. Looking forward to completing the holster with professional results.",
      "rating": 5.0,
      "verified": true,
      "author": "PTB",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "DON'T DO IT!!!",
      "text": "The hole punch is what I bought this for and it doesn't work I have to try to punch the same hole 4-5 times and it's a pain and it started bending after the first use. I had to buy another one and that one has been working great. This is a poor quality product and poor craftsmanship. They're just trying to make a buck. Do not recommend buying this to anyone",
      "rating": 2.0,
      "verified": true,
      "author": "tReble_MyNd",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Well made. Works great",
      "text": "Works great. Good punch well made. Plenty of accessory products",
      "rating": 5.0,
      "verified": true,
      "author": "ROBERT W.",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "High Quality, great value, fast shipping",
      "text": "Super fast shipping, item as described. The punch is very high quality",
      "rating": 5.0,
      "verified": true,
      "author": "MT Consumer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Great hole punch",
      "text": "Love this hole punch ! Great but I used it on my leathers for my irons they are making it with fabric and makes it hard to go through, I tried many other kind of hole punch this was the only one that worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimi Nelson",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Easy to operate",
      "text": "I never thought there’s one like this. I’ve been using the other kind that’s difficult to work with. I’m glad I found it.",
      "rating": 5.0,
      "verified": true,
      "author": "Krissy",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Case small & no instructions",
      "text": "Absolutly No instructions included. I'm sure we can figure it out, but would prefer to know I'm doing it correctly and not possibly going to break it. Instructions please. Also case is not quite big enough. It broke through the zipper!",
      "rating": 3.0,
      "verified": true,
      "author": "Lori Monday",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Works great",
      "text": "Easily cuts a new perfect round hole in my belt.",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "the punch is dull some of the sizes worked fine but most of them didn't work",
      "text": "Needed for hole punch in leather, and it doesn't complete the hole even punching it twice, to dull. Nice kit though to bad it didn't do the job! ordered a second one and the same problem now I need to return two of them.",
      "rating": 2.0,
      "verified": true,
      "author": "Peggie",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "no instructions",
      "text": "I did not know how too use the rivets and its tools . their was no instructions on how to use them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Perfect tool set",
      "text": "Wonderful tool for me to adjust my leather belts and also for my wife with some of her arts and crafts.",
      "rating": 5.0,
      "verified": true,
      "author": "Julius E. Locklear",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Not American made.",
      "text": "Thought we were buying American made. Clarke is an American name company. Got the product and it says made in China. Not happy about that. Amazon needs to have a check box for American made.",
      "rating": 1.0,
      "verified": true,
      "author": "Bonny",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Revivebef eith broken zipper on case and  robot box broken",
      "text": "Item received with broken plastic case and robots loose in case. Dipper broken on case when received. Tool looks sturdy but quality of case and to it case cheap and defective.",
      "rating": 2.0,
      "verified": true,
      "author": "Carl E. Sams",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "For the most part it's an ok buy",
      "text": "One of the hole punches broke when I first used it",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole Gibson",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Very Beneficial",
      "text": "It came with so many items. It was exactly what I needed",
      "rating": 5.0,
      "verified": true,
      "author": "Larina Jeanell",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Works with ease, simple.",
      "text": "Perfect for shortening longer belts, adding holes on good ones too.",
      "rating": 5.0,
      "verified": true,
      "author": "Daryle D",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Missing items",
      "text": "Alot of missing items in the kit I received..and no response from the email I send them",
      "rating": 2.0,
      "verified": true,
      "author": "Aja Givens",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Great product!",
      "text": "I love this tool set..it has everything I needed and comes in a great sturdy storage case too!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassieee M",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Leather man",
      "text": "It came in a case easy to use makes a hole no problem",
      "rating": 5.0,
      "verified": true,
      "author": "Steven p jennings",
      "helpful_votes": 0,
      "publication_date": 20190710
    }
  ],
  "product_meta": {
    "title": "Glarks Adjustable Leather Hole Punch Pliers with Single Cap Leather Rivets Set Free Scissor & ruler & Awl Tool for Belt, Watch Bands, Saddle, Shoes",
    "description": "Package:\n✔ 1 x Professional Punch Plier\n✔ 2 x Backup brass pad \n✔ 1 x Screwdriver \n✔ 1 x Awl tool \n✔ 1 x Stainless steel scissors \n✔ 1 x Steel rule \n✔ 1 x Grinding rod \n✔ 1 x leather bag \n\nSpecification: \n● Hole Size Dimensions: 2mm, 2.5mm, 3mm, 3.5mm, 4mm, 4.5mm\n● Scissors: 7 inch\n● Small rivet size: cap 1/ 4 inch (6 mm), post 1/ 4 inch (6 mm), base 1/ 4 inch (6 mm) \n● Medium rivet size: cap 5/ 16 inch (8 mm), post 5/ 16 inch (8 mm), base 5/ 16 inch (8 mm) \n● Large rivet size: cap 5/ 16 inch (8 mm), post 1/ 2 inch (12 mm), base 5/ 16 inch (8 mm) \n● Pliers Colors: Blue and black\n\nwhen you get it, you will find:\n◆ All you need is in one set to help you get the job done better\n◆ Effortlessly creates perfectly punched holes without fraying edges\n◆ PVC dipped cushion grip handle for comfort use, won't waste much hand strength\n◆ Head revolves for quick size adjustment and effortlessly make a neat hole exactly where you want with no mistakes \n◆ Leather rivets with good quality for repairing broken belt and decorating your crafts\n\nTip: To prolong the sharp edges of the punch, put a thick paper card(the card under the punch plier works well) between the back of the leather and the brass anvil, \nso when you punch through, you hit the card, not the brass anvil which would damage the tool if you were using too much force\n\nNote: We will do better, if you received damaged box or found product quality problems, please feel free to contact us, we will try to meet your requirements of refund or return",
    "rating": 4.4,
    "feature_bullets": [
      "★ Package Introduction: As the picture shows, apart from a plier, along with 100 set 3 sizes single cap leather rivets with fixing tool kit, and include a hard 7 inch leather scissors for any leather work projects, everything packed in a Leather bag to help your work done better",
      "★ Save Your Belt: What would you do when find the belt bought from the store is not suitable, This hole punch pliers will help you, have a mark with the tip, then you can quickly and effortlessly make a neat hole exactly where you want it and no mistakes. It is a good tool to save money and time for you",
      "★ Value For Money: Pliers is made from hardened hollow steel, Heavy duty brass anvil, High hardness steel tube, Black coating for durability, can be used for many years, handles are cushioned, non-slip and ergonomic, don't need much hand strength",
      "★ Instructions For Use: You can choose from 6 different sized holes: 2mm, 2.5mm, 3mm, 3.5mm, 4mm and 4.5mm, make it to be used for punching through leather, plastic, canvas, cardboard, rubber, polyurethane, fabrics, silk and many other materials",
      "★ About Rivets Set: The rivets are in 3 sizes and 2 colors, 20 pcs for each color and each size, made of metal material, along 2 fixing tools put in a clear storage box, can be fixed on wristbands, hats, jeans, windbreakers and jackets"
    ],
    "specifications": {
      "Manufacturer": "Glarks",
      "Part Number": "GLADKQK-3",
      "Item Weight": "1.28 pounds",
      "Package Dimensions": "11.02 x 7.48 x 1.18 inches",
      "Is Discontinued By Manufacturer": "No",
      "Material": "Metal",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B07779GVZ6",
      "Customer Reviews": "4.4 out of 5 stars188 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#21,253 in Arts, Crafts & Sewing",
      "Date First Available": "November 6, 2017"
    },
    "categories": [
      "Leathercraft",
      "Punching",
      "Stamping & Punching",
      "Tools & Home Improvement",
      "Arts, Crafts & Sewing",
      "Crafting"
    ],
    "price": 21.49
  }
}