{
  "website_summaries": [
    {
      "verdict": "An impressive home theater projector from BenQ that offers great resolution and easy installation.",
      "pros": [
        "High resolution 1080p projection is clear and crisp in most home theater setups",
        "Can be installed in smaller rooms due to the shorter projection throw",
        "3D-capability"
      ],
      "cons": [
        "No 4K resolution offered",
        "Projection lamp does not last long and can be expensive to replace"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "True out door “Drive-In” Cinema.",
      "text": "Amazing projector! The first Video is of us projecting onto an eight foot wide beige SUNSCREEN, not even a movie screen, yet the image is super bright with vibrant color and perfect clarity. As seen in other photos, we now use it on our new 150” diagonal outdoor screen for true “Drive-In” Theater style movie nights. Trust me, it’s worth the extra few hundred to get a REAL projector vs a toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired In Baja",
      "helpful_votes": 10,
      "publication_date": 20200817
    },
    {
      "title": "Buyer beware",
      "text": "If you see this projector for sale from a 3rd party seller named Hlop at a bargain price, its because it is bait and switch from a seller overseas. Save yourself the aggravation, and run away.",
      "rating": 5.0,
      "verified": true,
      "author": "HDN",
      "helpful_votes": 5,
      "publication_date": 20190523
    },
    {
      "title": "BRIGHT AND CLEAR. BUY IT.",
      "text": "So far its been great. The picture this projector produces is absolutely incredible. This is my 2nd projector and this is beyond an upgrade. If you are on the fence BUY IT. Gamers this is the projector for you. Also, very pleased with the HDR perform. For this price range it's hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie256",
      "helpful_votes": 4,
      "publication_date": 20200610
    },
    {
      "title": "Highly Recommended",
      "text": "Awesome projector in this price range. I'm just projecting directly onto my white wall and it looks great. I have it connected it my receiver and speakers so the built-in speakers weren't really a factor for me, but I tested them and they sound surprisingly good! It was super easy to set up, and there are lots of handy adjustment settings to get everything just right. I can even watch it when it's still light outside. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "lastflowersTop Contributor: Makeup",
      "helpful_votes": 4,
      "publication_date": 20180716
    },
    {
      "title": "Great projector for the money",
      "text": "Ended up being very torn between buying this and a 4K unit for roughly $1500. I'm glad I went with this as it looks amazing to me but I'm no expert. The money I saved I took and bough a used jon boat, I mean how could it get any better? Cons 1) There is light leakage on the ceiling but you should already know that if you've done your research. 2) She gets pretty hot but I'm sure they all do to a degree. Pros 1) 135\" from about 12' away in a 12' by 18' room suits my needs perfectly. Almost went 120\", I'm glad I didn't. 2) Speakers sound pretty good. 3)Great all around little unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Spenser N.",
      "helpful_votes": 2,
      "publication_date": 20200913
    },
    {
      "title": "Has great picture. The zoom options are one of the ...",
      "text": "Has great picture. The zoom options are one of the best features, allowing a crystal-clear picture on the wall. Controls are easy and the speakers work great. I watched Coco and Spiderman: Homecoming on the lowest sound setting and they both sounded great. Would definitely recommend for anyone that wants the next thing down from a higher-end (i.e. 4K) model.",
      "rating": 5.0,
      "verified": true,
      "author": "Hill",
      "helpful_votes": 5,
      "publication_date": 20180712
    },
    {
      "title": "Can't be beat for the money",
      "text": "Super sexy. If you're buying this projector you have probably read the reviews on home theater sites. It's the king of its price range and punches above its weight. The clarity, the brightness, the quiet fan, low latency, the feature set, rgbrgb color wheel, even the speaker is impressive, not that you'll probably be using it. I had an Acer from a few years ago that was a highly rated unit and this blows it away on every level. I can watch shows during the day with quite a bit of ambient light with no issues. I don't think there's a better value.",
      "rating": 5.0,
      "verified": true,
      "author": "Negative459Top Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20180522
    },
    {
      "title": "Just needs better Keystone correction",
      "text": "I love this projector it looks just as good as the Ks800 I paid over $1400 for in 2017 it just needs better keystone correction.",
      "rating": 4.0,
      "verified": true,
      "author": "Hayden Bingham",
      "helpful_votes": 3,
      "publication_date": 20200726
    },
    {
      "title": "Good quality",
      "text": "It’s good quality for family movie night and gaming. There’s better ones out there for those who are really into this kind of tech - but it’s good for us as beginners! We’ve only had it for a few weeks but it’s going well so far!",
      "rating": 5.0,
      "verified": true,
      "author": "ThAzam",
      "helpful_votes": 2,
      "publication_date": 20200612
    },
    {
      "title": "Man how times have changed.",
      "text": "This is a great projector paired with a silver ticket 100 inch screen. I remember when a vcr and a 25 inch tv was a big deal. Better than going to the theater. Make sure your surround sound is as “ big “ as your picture. Blu rays look amazing . I also down Rez 4 k Blu-ray’s which also look great! 10 years ago this quality would cost 10 Gs. I’m in for $800. Just watched Avatar Blu-ray on system...amazing! Update: I paired this with an Oppo 103D with Darbee enhancement and I’m even more impressed with picture quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary S. Harper",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Great low cost outdoor movie projector",
      "text": "Set-up couldn't be easier. Simple to use and configure. Only has the very slightest rainbow effect, which I had look for, I know I shouldn't, but it is not a bother (so 4.5 stars for picture quality.) The throw is a tad short for use as an outdoor projector, but the zoom is flexible.",
      "rating": 5.0,
      "verified": true,
      "author": "David Newman",
      "helpful_votes": 2,
      "publication_date": 20200714
    },
    {
      "title": "No “Rainbow Effect”.",
      "text": "My biggest potential concern was a possible “Rainbow Effect” as I own other DLP projectors. I’ve attempted to induce it but haven’t seen any instance of it. I’ve actually had to turn the brightness down as it hurts your eyes at night; worked some better ambient lighting into the space to help. The clarity is great and the black levels are not bad. I like the fact that it can handle HDR and 120Hz, both work well. Projecting on a 100” screen at the maximum distance.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Peterson",
      "helpful_votes": 2,
      "publication_date": 20200724
    },
    {
      "title": "Good quality and speed",
      "text": "I dislike having a tv take up space so this projector is a great alternative. The picture quality is good and adjustability of the picture is good also. I would say the only issue is that the volume doesn’t go down enough. When my son is watching YouTube or something I don’t want to listen to, the lowest volume setting is still loud enough to fill the house! Also, this may be true of all projectors, but blacks do not show well in daytime, so make sure you have shutters or blackout curtains. My son plays video games and the speed and quality work well for him.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara J. Lewis",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "COMPLETE JUNK",
      "text": "NO WHERE CLOSE TO THE ADVERTISED LUMINS.DIFFICULT TO TURN FOCUS DIAL.WHEN YOU DO GET IT FOCUSED IN THE CENTER OUTSIDES ARE BLURRY. ORDER THREE UNITS ALL THE SAME PROBLEM .ONE THE FOCUS KNOB WOULD NOT MOVE AT ALL. YOU GET WHAT YOU PAY FOR.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 2,
      "publication_date": 20191221
    },
    {
      "title": "Millionaire lifestyle Projector.",
      "text": "I just got this delivered today. Plugged it in. Started a movie. And... I am totally speechless. I apolgize but its hard to put into proper words to describe the image that I am looking at. Run, very fast to get this machone.",
      "rating": 5.0,
      "verified": true,
      "author": "SPECTRA",
      "helpful_votes": 2,
      "publication_date": 20200603
    },
    {
      "title": "Incredible picture quality",
      "text": "Phenomenal projector. I have watched a lot of streaming and played many hours of ps4 games on this projector and the quality is unreal. Tons of adjustments to line up your picture in many configurations. The only thing to consider is if you place this in a room with a lot of sunlight, you may get a lot of wash out in the picture. I dont have issues with lamp light but during the daytime blackout curtains can be crucial if you are watching something that was filmed dark such as a horror movie.",
      "rating": 5.0,
      "verified": true,
      "author": "DirtyEJ20",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Awesome project. Used for movies, gaming and more",
      "text": "We use this for movies, gaming and hooking laptop up and works great. No rainbow effect from anyone who has watched it at our home. I was looking between this projector, an Epson and Optima and I definitely made the right decision.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Speaker ripped in two minutes.",
      "text": "The projector’s picture was amazing. Unfortunately, two minutes after I got it up and running (not an exaggeration) the internal speaker started buzzing, as if it was ripped. Tried to move it, lower the volume, play with the settings - nothing helped. Have to return. Very disappointed. Recommend you look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "dawkinsian nation",
      "helpful_votes": 5,
      "publication_date": 20181218
    },
    {
      "title": "Better than expected, definitely worth buying.",
      "text": "Picture quality is better than I expected ( 3840x 2160) easy and simple set up. low input lag when gaming and audio out option. Only 2 hdmi ports. Great value at this price. Would definitely recommend as budget/value purchase for occasional gaming and movie nights.",
      "rating": 5.0,
      "verified": true,
      "author": "Pascal",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great So Far",
      "text": "We had an old Dell projector that we used for outdoor movies but after 10+ years of it, it has started to break down so after a lot of research we went with this projector. One thing we didn't have on the Dell projector was an HDMI input. So now I can plug in my Firestick and play movies and Sling TV outside. For the audio, the internal speakers are great but get we got a 3.5mm to RCA cable at Bestbuy for $10 and that allowed us to still use our stereo for sound. The picture is great and clear and bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Very impressive",
      "text": "I am very happy with the quality of the projected image, its brightness and sharpness. The sound system is also decent enough. Best of all, with 2D keystone adjustment, it can project with a degree and make finding a proper place to put the project much easier. The noise of the fan is noticeable but not to the level of annoying. I connected a Chromecast to one of its HDMI inputs, and now I can easily cast youtube and netfilx to the huge screen. With 120\"+ screen and crystal clear image, the movie watching experience is very impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "REED SONG",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Awesome 1080p Projector for Movies and Gaming",
      "text": "This projector was my first ever for a home theater. I have to say, the sharpness of the image and richness of color continue to blow me away in the past few days I've had it installed. My Home Theater is fairly small, being 11x13ft in size, so my front row is close to my screen. But just like other reviewers have stated, I think BenQ nailed it with this projector's performance at this price point as it is amazing for gaming in addition to watching films.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Dies fast. Waste of money.",
      "text": "11 months in dead pixel in the middle of the screen that is bright white at all times. Makes watching anything unusable. Way too short of a lifespan for this product. Avoid. Useless now.",
      "rating": 1.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 2,
      "publication_date": 20191101
    },
    {
      "title": "Awesome PJ!",
      "text": "Awesome PJ!! Plenty bright and sharp. Colors and shadow detail very good. Only thing I wish had more vivid colors and brighter 3D but not enough to drop off any stars since it more than makes up for that. Gaming is fast and super quiet fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Julian Rodriguez",
      "helpful_votes": 7,
      "publication_date": 20180408
    },
    {
      "title": "Great product. Bare box. No additional packing.",
      "text": "VERY happy with product. SUPER upset with packaging. My area is know for package hunters & there was no additional packaging to cover up my box. EVERYONE in the neighborhood watched how my $700+ projector laid there on the floor. Good thing I caught it quick before someone left with a neat projector. Just wished it was covered & not the bare box showing.",
      "rating": 4.0,
      "verified": true,
      "author": "Arcadio Acevedo Evangelista",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Cant be beat for less than $800",
      "text": "I wont repeat what you already have read .. If you want a 120\" screen to play video games, watch live sports, or enjoy movies .. this thing is awesome. Is it as nice a $3k tv or projector .. NO. You get what you pay for and I would pay a lot more than $800 for this and $300 for a 120\" screen (off amazon, cant remember the brand but looks just like Silver's just a little more in a pain of the butt to put together).",
      "rating": 5.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Very good projector",
      "text": "I'm impressed by the brightness! Really sharp and beautiful image. I really appreciated the setting that let you to choose the color of your wall so it accordingly adjusts the color profile. It's convenient if you didn't get to paint perfectly your wall yet. Even on a beige wall, it looks amazing (see picture)! Also awesome that there is a USB type A port, you can connect your chromecast (or similar) directly on it. Sound is surprising loud, but lacks all bass of course. Two things are missing: - digital sound output (Coaxial or optical) - power cable should be white, since the whole product is white, it really is lack of taste for details",
      "rating": 5.0,
      "verified": true,
      "author": "TheSmartReviewer",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "great for a decent size media room",
      "text": "got this projector after searching for a lot of time and read multiple reviews. This works great and the picture quality is really good. Very easy to set-up and adjust the throw size / distance. This product lives up to its name and worth the price. The only this is - if there is sunlight then the brightness lags a little (this can be easily fixed through window screens or window blinds). I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Soms",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Looks Like a 1080p TV Screen",
      "text": "We upgraded to this projector from a cheap $80 projector. Just about any projector would be an upgrade from it, but this one definitely met my highest expectations. I use the projector to play video games mostly. The picture is great, the remote functions the first time I press a button (unlike the last one where I had to press the same button several times and point it at the perfect spot for it to respond), and it's bright enough for me to have a light or two on in the game room while I'm playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin R.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great projector",
      "text": "I love this projector. The keystone feature is really handy since i placed it on a end table in the corner projecting to the wall. I have it in the bedroom so it’s usually a low light setting but i only need it on 50% power since its already pretty bright. Always stays cool, and the illuminated remote comes in handy in dark settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan & Julita",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Looks Amazing!",
      "text": "After 3 weeks of reading reviews, watching videos, and ripping my hair out I kept coming back to the BenQ HT2050a. It is the best all around projector out there. I primarily use it for movies but also do some gaming on the Nvidia shield tv. I am really in love now that I discovered putting the shield in a yuv color mode. If you are on the fence, just go for this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Bright and sharp!",
      "text": "Bought this HT2050A gift for my buddy before his house warming party; everyone was so shocked by its amazing sharp image; we played Kirby games with kids and watched Netflix movies at that party. the installation was pretty simply and the instruction after first time you turned it on was so straightforward to be followed. originally we were worried if we could use it for movies or video games when other guys playing on the pool table side, but it turned out the great images with well-saturated colors made every worry gone. highly recommended! especially for those who never believe you can play video games on 120\"+ screen at home!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Face",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Great projector for price and needs",
      "text": "I really like this projector. It was my first projector I've ever bought and with the amount of them available on the market (and on Amazon) with mixed information from each model, it's difficult to find a good projector. The 2200 lumens seems like it would scare you off vs comparably priced 3100 lumen projectors but I get great color and brightness on my projector even with daylight. At night time I don't have to switch projector mode to lower the brightness which allows me to be maximum lazy.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Gasorek",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Worth the Price",
      "text": "I originally purchased a cheaper projector, however, found that during daytime use it was terrible. I decided to spend a bit more on this one to see if it made a difference and was pleasantly surprised. Well worth the cost. Not only is the picture quality great, but the sound quality was also shockingly great. This can be a stand-alone and not need a soundbar. Really happy with this purchase overall.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Well worth every penny.",
      "text": "I spent a lot of time trying to decide between a native 4K and and this native 1080p projector. In the end I decided to take a chance for half the cost and see. Turns out the picture quality is even better than I had hoped. The only thing I wish was different is the keystone effect. I wish that was manual and not just a setting. For my setup it would be perfect if I could just just a little more control.",
      "rating": 5.0,
      "verified": true,
      "author": "J. P. King",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great Projector",
      "text": "I bought this projector two months ago. The picture is sharper and more clear than the Epson projector I had previous. The sound from this projector is loud enough for meetings but it is not movie quality for long term tv or movie watching. I have not used this for gaming. I would buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "gm",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Quality projector.",
      "text": "Its bright af in my living room! 110inch-ish screen on orignal texture painted wall,the projector itself is off-center about 3 ft (~14ft from the wall). I freakin' love it! I can be a snob, Ill spend 300$ for headphones- this setup completely satisfies me. Movies are a blast- watched Batman Lego movie, a bloody marvel! Video games- no lag, Im slayin' foo's. Wife loves how there is no giant tv or screen when off. Friends will miss it till I set up a movie and are amazed. Money well spent. It's exactly what I wanted: high quality with minimal hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "It is an excellent projector.",
      "text": "I did a ton of research before I purchased a projector and it's definitely worth buying this over a 300$ projector. The picture quality is amazing and the setup was easy. The only thing I really dislike about this projector is that I had to use hdmi for audio to my home theater system.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Good projector and great price.",
      "text": "Very impressive projector. I've own three before this one and surprised this doesn't have a air filter, my others did. The keystone is a must and the e3d is easy to set up. Update 5/15 After using for a week now,and I purchased a 85\" elite screen, I'm getting the \"rainbow effect\", flashes of rainbow prism. Really bothersome, I forgot that DLP projectors can do that, still good projector for price. Just something to consider.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald B.",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Basic needs missing",
      "text": "Auto shutter close should be part of it otherwise lens will pick dust. Who will manually close shutter if installed in ceiling.. Basic need missing",
      "rating": 1.0,
      "verified": true,
      "author": "Kumar",
      "helpful_votes": 5,
      "publication_date": 20181225
    },
    {
      "title": "You will not be disappointed not even close",
      "text": "This was my first projector and boy does it live up to BenQ reputation. Don't worry BenQ does not have paid reviews they don't have to it would be like Lamborghini needing a paid review not going to happen. This projector is absolutely amazing quality Quality quality incredible image it looks better than both plasma TVs in my house and I am projecting a 150 in image.. my wife was skeptical of projectors especially because I was spending so much money all she does now is smile when she watches it she was thoroughly impressed. You will not be disappointed just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "David Rogero",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Solid Projector based on first couple months use",
      "text": "So far we have no real complaints. Solid product, runs fairly quiet. Picture is decent for what we need. Volume is plenty for a normal 13'x14' room. If you want more base in the volume, obviously a sound system will add better quality, but it works fine for our family as is. If there was 1 complaint about the volume, is that it actually cannot be turned down below a certain level...and sometimes the show/movie is too loud for what we need on the lowest volume setting (while others are trying to sleep). But that's a very minor complaint.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Stokes Gibbs",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Best HD projector under $1K",
      "text": "Went into this purchase by looking at the specs (which are pretty phenomenal at this price point), and online reviews. I was expecting a projector that could bring reasonable brightness and sharpness in the HD for a ceiling mount at about 12 feet away. Really does well at that distance and have no issues so far. I would recommend to others looking for a solid entry level HD projector to start a home theater.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Sound and picture",
      "text": "Using it to watch movies and sports. I like the picture. The image in general is great can watch it I daylight without a problem even with light on . I am using an external sounds system Bose and Yamaha sound great couple with 4K amazon sticks",
      "rating": 5.0,
      "verified": true,
      "author": "florent mbesse",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Best... Purchase.... Ever!",
      "text": "I LOVE this thing! Everything about it screams quality! I mainly use this projector for my Switch and Chromecast. There are settings to change what color wall you have, which will change how the colors are projected. I have this projecting on a light tan wall and it has no issues with color, clarity or brightness. It also has built in speakers that are actually pretty decent and can get quite loud if you aren't careful. Overall this is a fantastic first time projector. You cant go wrong with BenQ!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel M",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Great upper-mid range projector",
      "text": "I spent a lot of time looking for the right projector for me. It came down to this one and a few others, but obviously went with this. I also got a good, high quality screen, and the two together are amazing. The picture is just as clear as an HDTV, with a good, adjustable brightness and contrast level. I have mine on ECO mode and it still looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "2 months with this projector",
      "text": "Good 1080p quality Terrible HDMI CEC support Terrible remote Built in speakers are very loud and decent quality Fan is quiet No sleep timer, which is unfortunate Don't think I would buy this again, would like to see a less crappy remote and HDMI ARC",
      "rating": 4.0,
      "verified": true,
      "author": "Gino",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Incredible quality at this price point",
      "text": "Excellent video quality and easy to set up. Black levels are not great, but nothing to object at this price. Awesome value!! People that has never owned a projector before will have their minds blown away by the quality of the viewing experience compared to an average flat TV. Just make sure you get a good projection screen like Silver Ticket screens (excellent value as well).",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Amazing projector!",
      "text": "Purchase this to replace my BenQ 720 because the bulb broke. Great projector, not that much different from the 720. These projectors are amazing, deepest blacks, images are crisp and great for sports and gaming!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Sav",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Transformed my attic into a wonderful gaming center",
      "text": "This projector is fantastic for gaming. I've got all my game systems, modern and classic, attached to this projector. The picture quality is great and it's turned my attic into the best hangout space in my house. Definitely also recommend the BenQ brand mount found elsewhere on amazon, it was super easy to get installed and mounted in a secure fashion.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Lifka",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Crisp and color accurate. Low input lag. No need for 4k",
      "text": "So glad I returned that coil-whining Optoma for this. Insanely good colors and brightness. Although I live in CO, I don't use high altitude mode as it makes the projector too loud. Don't need it though - I've had this for almost a year and I'm still superbly happy with it. Text is very legible at 100\" when mirroring my PC.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Bing",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Great Projector so far.",
      "text": "So far so good after install unit works great. Only caution for installation is to be sure to take off the layers of clear plastic on unit or you will overheat. Its not easy to see all plastic on white case. The unit runs hot anyway so be sure you remove all clear plastic protecting cover.",
      "rating": 5.0,
      "verified": true,
      "author": "CustomerRca",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Good quality product",
      "text": "Being my first projector, can not compare. I bought it based on reviews and seems fairly good quality projector. Colors are good and picture is sharp. It is very easy to setup and install.",
      "rating": 5.0,
      "verified": true,
      "author": "Pravin Pathak",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Constant loud clicking",
      "text": "Really a nice projector. Unfortunately when its hung upside down it makes a horrible constant clicking noise. Not sure if it's the fan or the color wheel but its annoying to the point of making regret the purchase",
      "rating": 2.0,
      "verified": true,
      "author": "Nathan Bumgarner",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "BEST quality for the price",
      "text": "Whenever we want to show off how cool our projector is, we turn on Planet Earth and watch everyone's mouths drop. This has some incredible quality to it, and people are shocked at the price point. This was well worth the money, and I will never go back to owning a TV again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "awesome",
      "text": "incredible, used with lights on, still works great. works great for video games.",
      "rating": 5.0,
      "verified": true,
      "author": "matt meeks",
      "helpful_votes": 3,
      "publication_date": 20180608
    },
    {
      "title": "Amazing Picture!!  Super Easy Set up on the Ben Q Projector.  Very Happy!",
      "text": "After getting this projector mounted to the ceiling, I hit the power button and was immediately wowed!! The picture is amazingly clear and bright. Colors look great, and the set up was very easy. I do not rely on the projector for sound, but many people seem to think it's appropriate for a projector. I was using my pass through my receiver and still the picture quality was amazing. Best picture! I can't wait for many many movie nights using my new projector!",
      "rating": 5.0,
      "verified": true,
      "author": "TKG",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Amazing!",
      "text": "I LOVE this projector. It's my first one, so I wasn't sure what to expect. The picture quality is amazing. I just have it pointed at my light-tan walls, no screen. I have my Xbox One hooked up as my Netflix, gaming, TV, etc. The sound is pretty loud, but gets distorted if it's turned up all the way. I will be getting a different sound system eventually. I highly recommend this projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassidy Kessel",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "DEAD PIXELS POOR QUALITY",
      "text": "After 2 Months of use I noticed an annoying dead pixel in my display- now I have to go through the process of dealing with BenQ who's call center is closed. Horrible experience- I'd stick to a higher end well known brand especially at this cost price- I expected a lot more. Extremely disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "RAY M",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great projector",
      "text": "Great picture quality all around. I'm currently using this on a cheap cheap 100\" screen till I can get a larger cinegrey 5D. The lamp is very bright. Surprisingly the internal speakers sound pretty good. I have been playing a lot of madden 18 with this and the response time is crisp. Honestly I think that 4k is a bust, as you have to sit uncomfortably close to an image to even tell the difference. This was a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "King Kong",
      "helpful_votes": 7,
      "publication_date": 20180220
    },
    {
      "title": "Great projector, especially in a dark room",
      "text": "This is a great projector, especially for the money. It’s my first so I don’t have a ton of experience in projectors but the picture quality is very good at 120 inches and it was very easy to set up. The build quality seems high. My only complaint is that the room needs to be very dark for this projector to be at it’s best. I’m sure if you spent more money this wouldn’t be as much of an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "MA",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "It was easy to install",
      "text": "It was easy to install. The colors are so crisp. Also, the 3D works very well- it felt better than being in the movies. We were planning to get a screen later and tested out the projector on the wall. However, the colors were so bright and vivid that there's no need to buy a separate screen! I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "G.L. Stein",
      "helpful_votes": 3,
      "publication_date": 20180720
    },
    {
      "title": "Amazing color and clarity.",
      "text": "I always wanted a projector but I have a small room. This is doing an 80” screen from 95”. The color and detail are way better than I expected. It is a no brainer and I’m so glad I got this. I attached a picture of it doing 1080p on YouTube. I can’t recommend this projector enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Yoshimitsu Fujimoto",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Bang for the buck",
      "text": "Use this in basement on 100 inch screen - love the thing .. had an Acer and this is so much better in all aspects Quiet and has great zoom etc - have used on Xbox and from TV Settop box .. good light output . No rainbows I have seen Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Techsavvy",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Nice picture",
      "text": "Native 1080P, the video quality is great. 2200 lumens, super bright. I added a sound bar, for great sound output. Definitely have cinematic feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Chang",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Best projector you will find for under $4k",
      "text": "Simply phenomenal picture quality for the price. This genuinely looks like a $2000 projector. Colors are extremely vibrant and the image looks incredible. The only downside is that you can’t stream low quality videos because of the size of the image, but that’s a problem with YouTube and Netflix, not the projector Did a lot of research finding this projector and I couldn’t be happier with it",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Good Buy",
      "text": "For the price, it’s about the best you can get for the money. I’ve been using this for around 7 months now, no complaints. Naturally any blu-ray will look much better due to the higher resolution. It is also very quiet - which is great. No need for a projector box or anything like that. does also have many color balancing features, rs232 control etc, good buy- I would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Sanchez",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great picture lousy audio",
      "text": "Projector is simply not usable for Home Theater, even with a powered high end speaker attached the sound output is barely audible with all volume controls set to the highest setting. However if sound is not important then its a great projector.",
      "rating": 4.0,
      "verified": true,
      "author": "Wolfgang",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great picture quality!!",
      "text": "This is a very good projector For this price point. I have it ceiling mounted and I am projecting on 125 inch with 16.9 elite screen from about 12ft away and the picture Quality is outstanding. I bought a a stand alone tv tuner and connect it via HDMI port for sports. Also have a fire stick in the other HDMI which is powered by the USB port and it works great. The only con I can say about this projector is I with it had more HDMI ports then just two. But with a HDMI hub I can work around that.",
      "rating": 5.0,
      "verified": true,
      "author": "M.Austin",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Good value",
      "text": "First projector purchase. Was exactly what I wanted. I use it in my basement and have the screen about 120” and the picture is as clean as my TV. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Blaine Dixon",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "not even 4k",
      "text": "to start its not 4k like it said it was and to top off I returned over 13 days ago and still no refund",
      "rating": 1.0,
      "verified": true,
      "author": "Cynergy Corp",
      "helpful_votes": 2,
      "publication_date": 20200510
    },
    {
      "title": "Amazing",
      "text": "I very rarely write reviews but I am totally blown away by this unit and had to share. It's my first projector and I'm projecting to a 120\" screen and sitting 14 feet away and 1080p just looks brilliant, sharp and clear with beautiful colors. Probably would have to sit 6 feet away to see any graininess at all. Roku and Blu Ray are my main sources. I recently bought a Sony 4K 65\" LED TV and I really think I will rarely use it now. Kind of wish I skipped that purchase. I guess I will use it during the day...sometimes.",
      "rating": 5.0,
      "verified": true,
      "author": "heartygrain",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Dark room use only",
      "text": "The Benq 2050A is an excellent dark-room projector. It has numerous adjustments to fine-tune your image, unfortunately the screen is unuseable in a room with ambient light as the image is extremely dull (see photograph).",
      "rating": 3.0,
      "verified": true,
      "author": "CRPTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Impressive!!!",
      "text": "Very much satisfied with the colour reproduction. Out of the box colour appeared vivid and artificial. Cinema mode was quite ok. But, upon tweaking further and applying the settings suggested by \"sound and vision\" the colour tone became very natural. Their contrast level is good and brightness is apt, it manages to stay visible even in less darker environment.",
      "rating": 5.0,
      "verified": true,
      "author": "Madhur Shankar",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "very good projector",
      "text": "We use this product to watch movies from iphone and ipads.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Chen",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Can’t recommend more",
      "text": "Went from an Epson to this and I gotta say, this BenQ is better overall for a few bucks less. Great smooth picture, bright enough with an ALR screen in a lit room or during the day, just fantastic. A thousand hours into the lamp already and it’s still going strong and bright. Get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bo Haan",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Get. One. Now.",
      "text": "This was my first projector, and it has me wishing I would have gotten it a long time ago! Seriously, incredible picture, amazing interface, awesome remote, and the sound quality is so much better than I anticipated. Great job BenQ!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Montgomery",
      "helpful_votes": 2,
      "publication_date": 20180814
    },
    {
      "title": "Great product",
      "text": "Projector works extremely well in both light and dark rooms. Easy to set up and adjust, only real issues I have are the heat it puts off and that its lowest volume level is still pretty loud",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle J Campbell",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great quality and value!",
      "text": "I ended up needing vertical lens shift so this projector didn't work out for me, but the picture quality and brightness was really great for the short time I tried it.",
      "rating": 5.0,
      "verified": true,
      "author": "_SeriousSam_",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Made as Living room tv",
      "text": "Used this pdt for living room tv/ view with Xbox, chrome cast, sound system . Etc. kids love watching big screen/ life-size pictures.... Bluetooth audio connection would have helped a wireless connection possible",
      "rating": 4.0,
      "verified": true,
      "author": "Vid",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Excellent Quality Projector - Easy to Install",
      "text": "Loved the BENQ HT2050A Projector. I bought this after doing much research and would absolutely recommend this to anyone in the market for a HD projector. Installation was super easy and it was ready to go in a few minutes. The picture quality is excellent and it projects a 100 inch picture from hardly 10 feet away. For the price point, it is more than worth your money!",
      "rating": 5.0,
      "verified": true,
      "author": "Ketan Reddy",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great Picture",
      "text": "So far so good. This thing is better than I expected. The picture is TV quality and the sound is excellent. I would definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "RBlack",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Not the best, not the worst.",
      "text": "It’s a good projector for the price. I would spend more money next time to get better picture quality.",
      "rating": 4.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Awesome picture quality!",
      "text": "The picture is awesome for the daily user of tv shows and movies. I don’t use the speaker, but I have listen to it and would be fine in a pinch. The blacks are so Michel better than the BenQ 1070W it replaced, great buy and great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur Garibay",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "5 Stars for under $1000!",
      "text": "After purchasing this projector along with a 120 inch screen for a total under $1000, I couldn't be happier. Stunning colors for movies and Fortnite looks and feels amazing! Took me a long time to pull the trigger on this purchase because I was afraid my wife would send me to couch... she loves it so much she's on the couch watching it with me! 5 stars for the HT2050A!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Quality 1080p projector for the money.",
      "text": "Only owned for a month, so far no issues. Great picture thrown up on a 120 in. painted-on screen about 12 feet away. Wall is unfinished in picture. Stock speakers are even quality sounding. Fan is not loud and a very easy setup with alot of options. Only negative so far is I wish there was a 3rd HDMI port, but not a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Omalley316",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Great projector for home theatre!",
      "text": "Great projector for the price. Using as a home theatre and it works great! The only negative thing is there is no optical audio output. I used an HDMI adapter to optical audio for surround sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Folkerts",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great picture!",
      "text": "I purchased this item to replace an old BenQ projector which I have had for ten years. BenQ brands are so reliable. The picture quality is so clear, color is amazing. No need to purchase those really expensive brands. This one is definitely cinema quality. Can't go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie S",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Amazing Machine",
      "text": "This is my first projector, so I don't really have a basis for comparison, but I'm impressed. No lag. Crystal clear picture. Great out of the box. I have zero complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 3,
      "publication_date": 20180309
    },
    {
      "title": "Returned",
      "text": "Bought for our theater room, but it had to be much closer to the wall then we anticipated. The picture was not as clear as we were expecting.",
      "rating": 1.0,
      "verified": true,
      "author": "Chattygal",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Good value, bad portability.",
      "text": "I bought this projector for $500, and it was my first projector from BenQ. It was a good purchase on sale, and it wold also be a good purchase for the list price. The speakers are not bad, and it has a lot of different ways to configure the picture for your personal space. It's a very good projector. The only thing I would find unsatisfactory with it is the size. It's not too portable, and reducing size/weight would be great.",
      "rating": 5.0,
      "verified": true,
      "author": "Shameer Hassan",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Excellent Projector",
      "text": "Excellent projector used at my home theater. Excellent HD digital quality images projected on the big screen when I play my blue-ray DVD movies.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Gonzalez III",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Speaker Rattles",
      "text": "I ordered this projector because my 3 year old BenQ started to overheat after 5 minutes of use. When I got this new BenQ, the speaker/sound from it rattled like a loose marble was in the internal speaker. I am very weary of BenQ quality after 2 projector disappointments.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Best One at that Price Point",
      "text": "We got this for our sports bar and its got a great picture. Very happy with it as are our patrons.",
      "rating": 5.0,
      "verified": true,
      "author": "Lendon Marshall",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Good projector but bad sound issues.",
      "text": "I liked the projector picture but had problems with the sound going out when I changed channels. I was sent a replacement and the problem continued. I returned for a refund.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Brandon",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "it has horizontal and vertical keystone!!!!",
      "text": "great projector! They told me at best buy to get a projector with horizontal keystone would start at $2,000. I'm really glad I decided to check amazon!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Julian Petschek",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Picture Quality.",
      "text": "Replaced my 1070 Ben Q with the ht 2050A. The picture quality is far superior. Life like image. Glad that I decided to hold off on a 4K projector for now.",
      "rating": 5.0,
      "verified": true,
      "author": "darryl douglas",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Amazing Projector.",
      "text": "This is my very first at home projector, and I can tell you it is amazing. The color and the clarity are top notch. And the 3D is Excellent. No crosstalk at all. Which is my main concern of 3D. I read reviews with claims of some minor rainbows, however during gameplay, and watching movies I did not notice any at all. I highly recommend this for home viewing.",
      "rating": 5.0,
      "verified": true,
      "author": "Niceguyfocus",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "We've used the snot out of this thing.",
      "text": "We use this a lot and it works consistently well every time. Most watching Netflix but occasional group movies. Roommates love it. Sounds good for coming from a single location. Will eventually want a full sound system to go with it. Image is crisp. Very pleased. research paid off on this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "One of the best projector i have come across after lot of research.",
      "text": "This is my first projector for my home. After doing research for almost 5 days. I have finalized to this modal and it didn't disappoint me. You will need to blackout the room to experience the full effect of this great projector obviously I used the gray wall. I used a small table to project it and it was an absolute beauty.",
      "rating": 5.0,
      "verified": true,
      "author": "Ganesh",
      "helpful_votes": 0,
      "publication_date": 20180823
    }
  ],
  "product_meta": {
    "title": "BenQ HT2050A 1080P Home Theater Projector | 2200 Lumens | 96% Rec.709 for Accurate Colors | Low Input Lag Ideal for Gaming | 2D Keystone for Flexible Setup",
    "description": "Superb Big-Screen Audiovisual Experience BenQ HT2050A projector brings big-screen Full HD visuals to your living room, with >96% Rec. 709 accuracy for authentic cinematic color and short throw for 100\" pictures from just 2. 5m away without setup hassle. Offering Cinema Master Audio+ 2 for immersive AV experiences, HT2050A's ultra-low input lag and special Game Mode enable epic gaming.",
    "rating": 4.7,
    "feature_bullets": [
      "SUPERIOR PICTURE QUALITY: 1080p Projector with brightness of 2,200 Lumens, high native contrast ratio and 96% Rec. 709 color accuracy calibration.",
      "HIGH RESPONSIVENESS: The specialized low input lag of 16ms and unique game modes ensure gamers an ultra-smooth gaming experience.",
      "WOW YOUR FRIENDS: Take the action to the big screen by projecting a 100 inch screen from just 8 feet away. Projects up to 300 inches.",
      "FLEXIBLE CONNECTIVITY: Supports most media players, gaming consoles, PCs, Macs, and mobile devices with input options such as HDMI, USB, and more",
      "AWARD WINNING PROJECTOR: Highly Rated - Projector Central",
      "DLP TECHNOLOGY: DLP is the leading technology used in 90% of the world’s cinemas and 100% of Digital IMAX theaters. You will experience a longer lasting, slimmer design, sharper and crisper image in BenQ's projector.",
      "Compatibility: HDTV Compatibility - 480i, 480p, 576i, 567p, 720p, 1080i, 1080p‎ ; Video Compatibility - NTSC, PAL, SECAM, SDTV‎ ; 3D Compatibility‎ - Frame Sequential: Up to 720p , Frame Packing: Up to1080p , Side by Side: Up to 1080i/p , Top Bottom: Up to 1080p‎"
    ],
    "specifications": {
      "Brand Name": "BenQ",
      "Item Weight": "8 pounds",
      "Product Dimensions": "15 x 11 x 5 inches",
      "Item model number": "HT2050A",
      "Is Discontinued By Manufacturer": "No",
      "Item display height": "14 inches",
      "ASIN": "B077TG22H3",
      "Customer Reviews": "4.7 out of 5 stars489 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#85 in Video Projectors",
      "Date First Available": "December 1, 2017"
    },
    "categories": [
      "Electronics",
      "Video Projectors"
    ],
    "price": ""
  }
}