{
  "website_summaries": [
    {
      "verdict": "Stylish, well-made bedroom furniture with ample pieces that come at a decent price point.",
      "pros": [
        "Sports a rustic look that pairs nicely with classic and contemporary decor",
        "Pieces are durable",
        "Minimal assembly required",
        "Priced on the middle of the scale"
      ],
      "cons": [
        "Some items arrived with damage",
        "Customer service from the manufacturer isn't very helpful when issues arise"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "great price for a good bedroom set.",
      "text": "This is the best price going that I have found. 2 night stands a chest dresser and mirror and dresser with a queen size bed frame. It was 9 days late but that was because of weather. No one can control that. The dressers and night stand were already assembled, just had to put the \"feet\" on. Super easy. I would definitely recommend this product to any one. Its very modern, looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Muggy ",
      "helpful_votes": 25,
      "publication_date": 20190215
    },
    {
      "title": "Beautiful set...bed is not sturdy though.",
      "text": "I really like this bed set, but the bed broke after 1 week. There are only 4 support slats which does not redistribute weight well. For a couple of dollars more, they could have put 2 more and my bed would not have broken. Wow! I then contacted the seller and they indicated they don't offer a guarantee. They don't even stand behind their own product to offer a solution to the fact I now have a broken bed because they were cheap. It's ok though...I will buy the necessary slats and fix the bed on my own, but I would never recommend 2K Furniture to anyone else!",
      "rating": 1.0,
      "verified": true,
      "author": "Keith C. Tate",
      "helpful_votes": 6,
      "publication_date": 20190810
    },
    {
      "title": "Looks as great in person as it does in the photos!",
      "text": "So many sets only come with 1 dresser & 1 end table. I was nervous about how well it was made since it came with 2 dressers and 2 end tables for such a great price. It is great! I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20180904
    },
    {
      "title": "It came way before stated",
      "text": "It came way before stated, I ordered it 3/24 the seller called me 3/25 letting me know it. Was coming 3/26 he was very nice asked if I have any questions or any concerns to call him back.. it is a very nice set for the price, very easy to assemble the bed, which I did myself... and I’m 5’2 100lbs.. the tables/dressers only needed to put on the feet.. The delivery guys were nice as well and quick, asked if I needed help to set up.. (but I didn’t).. great customer service. Happy customer",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth R.",
      "helpful_votes": 6,
      "publication_date": 20190326
    },
    {
      "title": "Impressed 100%",
      "text": "I ordered this bedroom set and it it AMAZING.. It's very sturdy and just beautiful! I had a small issue that the wonderful customer service solved very quickly.. I love love love my new bedroom set.. it's is definitely a great value for the money I spent on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rogers",
      "helpful_votes": 5,
      "publication_date": 20190418
    },
    {
      "title": "Product is great - shipper not so much",
      "text": "We were super attracted to this product due to the number of pieces for the price. We did receive the set after about two weeks and really like the furniture. The shipping company, however, is quite slow and fails to communicate clearly when you will actually see your things. Tracking marked it in our town for over a week before it was delivered on a date that was still later than our expected arrival date. Long story short - if you have time to wait and don't like to know what's going on, the furniture set is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Got this for mother in law.",
      "text": "Very impressed with the build. Came pre-assembled. Looks nice. Seller had good communication. Delivery company was fantastic with their robo calls. (They didn't call to schedule). Made in Malaysia.",
      "rating": 5.0,
      "verified": true,
      "author": "Raj",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Nice furniture",
      "text": "The amount of furniture pieces for the price is fantastic. Most of the furniture arrived assembled except for the legs. The bed required a drill for assembly and was a two person job. One of the nightstand drawers arrived broken, but was easily fixed with wood glue and a bar clamp. Overall very pleased with the quality and look.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Damaged Furniture, No Replacement or Refund",
      "text": "Really like the furniture and thought it was good value, but the product was delivered damaged. 2K Furniture after agreeing to send replacement unit, came back and refused to replace or refund! Terrible experience with customer service!",
      "rating": 1.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Good price.",
      "text": "The price was good. I could have given it a 5, but, for the difficulty in assembling it. Also, 2nd drawer on the dresser is very stiff.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Good deal",
      "text": "Very good deal for the money. The quality is better than expected, but don’t expect solid wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Porta",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Beauitful",
      "text": "Did not come when it said it would and I say unable to track it. But I love the bedset its beautiful",
      "rating": 4.0,
      "verified": true,
      "author": "kyleigh",
      "helpful_votes": 7,
      "publication_date": 20180730
    },
    {
      "title": "Awful customer service.",
      "text": "Awful customer service. Had the bed 5 months and the side board split right in half. Tried contacting seller and they gave me the run around. Told me their claims department would contact me. That was 4 weeks ago and nothing. Tried reaching out again and got no response. So disappointing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lesleyv",
      "helpful_votes": 0,
      "publication_date": 20201122
    },
    {
      "title": "Fake paint and fale wood . Veru bad quality ...",
      "text": "it's horrible . bagasse wood. It has no paint, it is false, it is not paint. it is false . It is pure low quality paper glued. I dropped a glass of water up and took off the entire front .. I almost cried .. I paid a thousand dollars to transport this garbage to Cuba",
      "rating": 1.0,
      "verified": false,
      "author": "Namir Noureddine",
      "helpful_votes": 0,
      "publication_date": 20190824
    }
  ],
  "product_meta": {
    "title": "Kings Brand 6-Piece Black/Brown Wood Modern King Size Bedroom Furniture Set, Bed, Dresser, Mirror, Chest & 2 Night Stands",
    "rating": 3.8,
    "feature_bullets": [
      "Set includes King Headboard & Footboard, Rails, Dresser, Mirror Chest and 2 Night Stands.",
      "Furnish your bedroom with the comfort and style of this stunning kings brand bedroom set.",
      "This bedroom set provides plenty of space to store bedroom and clothing essentials.",
      "Dovetail drawer construction offer durability and center metal glides make you more convenient to open and close the drawers.",
      "Finish: Black/ Brown. Materials: Wood. Simple assembly required."
    ],
    "specifications": {
      "Item model number": "B2185-D.M.C.KB.2.N",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B0772SCBCX",
      "Customer Reviews": "3.8 out of 5 stars30 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#226,271 in Home & Kitchen",
      "Date First Available": "November 1, 2017"
    },
    "categories": [
      "Home & Kitchen",
      "Bedroom Sets",
      "Furniture",
      "Bedroom Furniture"
    ],
    "price": 1199.99
  }
}