{
  "website_summaries": [
    {
      "verdict": "The receiver units plug into the wall, so you'll go through fewer batteries. And you receive 3 of them, so you're sure to hear them throughout the house.",
      "pros": [
        "Operating range of 500+ feet",
        "Includes 3 pagers and 2 call buttons to place strategically where needed",
        "Transmitter and call button is slashproof",
        "Wear call button as a pendant or place in pocket",
        "55 preloaded ringtones",
        "Adjustable volume",
        "Plug and play set-up",
        "Includes brackets and double-sided stickers for pager and neck straps for call buttons",
        "Great range",
        "Very loud"
      ],
      "cons": [
        "Call buttons occasionally fail"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for elderly living with family",
      "text": "What a perfect solution for my husbands 93 year old dad. He recently moved in with us and was trying to use his cell phone from his room. It’s so great for him to just press the button for us to hear the doorbell ringtone. We have this system in addition to his medical alert system.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa L.",
      "helpful_votes": 66,
      "publication_date": 20181010
    },
    {
      "title": "Recommended.",
      "text": "Effective and inexpensive tool for setting up a \"call button\" system throughout a house. Handy if you have seniors who are fall risks or others with impaired mobility. I used it across three floors over approximately 2800 sf and never had a problem with reception or hearing the chimes. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "tech_guy",
      "helpful_votes": 47,
      "publication_date": 20180331
    },
    {
      "title": "Range is very good, easy to use",
      "text": "I really like this system and its range is very good. I live with my elderly mother and I bought it so she can have a \"panic button\" on her night stand and one she can keep on her during the day. I needed 3 receiver/alarms and so this kit was perfect. I have one in my bedroom, one in my den, and one in my workshop. My workshop is about 100 feet from the house and her panic buttons activate the receiver/alarm out there perfectly. I was afraid that each button would only activate one receiver/alarm, but as it turns out, BOTH buttons activate all 3 receivers, which is exactly what I wanted!",
      "rating": 4.0,
      "verified": true,
      "author": "William P. Clark",
      "helpful_votes": 31,
      "publication_date": 20180822
    },
    {
      "title": "Worked right out of the box. We have receivers ...",
      "text": "Worked right out of the box. We have receivers in several locations in a two story house and the signal has been plenty strong to set them all off.",
      "rating": 5.0,
      "verified": true,
      "author": "cvnav",
      "helpful_votes": 40,
      "publication_date": 20180130
    },
    {
      "title": "Must have",
      "text": "These are PERFECT. Have a two story house and with 3 receivers, we can put them all over the house and they are definitely heard through out.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry L Venson",
      "helpful_votes": 30,
      "publication_date": 20180127
    },
    {
      "title": "Perfect for us",
      "text": "Perfect for us. My 92 yr old grandfather moved in and occasionally needs assistance in the middle of the night. I put one call button by his bed and the other in the bathroom. Then, the ringers are in the kitchen and bedrooms upstairs. It is great for his everyone’s piece of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "TC10",
      "helpful_votes": 18,
      "publication_date": 20180403
    },
    {
      "title": "Instructions are HIDEOUS!",
      "text": "Purchased for my elderly parents. Printing on instructions were way too small for them to read. When I tried to follow the instructions they were incomplete, inaccurate and totally useless. Totally a trial and error procedure to get the units installed, properly paired and with the correct alarm sounded from each fob.. The length of time the alarm sounds is very short requiring many activations from the fob to ensure someone can hear it.",
      "rating": 3.0,
      "verified": true,
      "author": "H. R. Ferguson",
      "helpful_votes": 8,
      "publication_date": 20190505
    },
    {
      "title": "Great product, very useful.",
      "text": "These work great and are VERY loud, just as I hoped.",
      "rating": 5.0,
      "verified": true,
      "author": "bikerchickk",
      "helpful_votes": 13,
      "publication_date": 20180412
    },
    {
      "title": "Work well with good range - wide choice of silly tones though, with few useful ones",
      "text": "They work, and with good range. You can add additional buttons no problem (although the programming instructions could be simpler!) One thing is the choice of tones: They have a lot of silly \"ring-tone\" type things to choose from, but very few practical, short tones. The closest we could find is something that sounds just like a door bell. It would have been very nice to have a couple of beep or bing type noises too.",
      "rating": 4.0,
      "verified": true,
      "author": "ScottS",
      "helpful_votes": 7,
      "publication_date": 20180724
    },
    {
      "title": "It works but is lame",
      "text": "It works as far as you can push the button and have the chime make noise. The problem is that it is full of lame ringtones and no choices for non-annoying ones. The most basic one is ding dong, but it would be better if there was \"beep\" or just \"ding\". Instead, there is barber of seville and jingle bells types of songs, completely unnecessary and useless",
      "rating": 3.0,
      "verified": true,
      "author": "El Kabong",
      "helpful_votes": 5,
      "publication_date": 20190521
    },
    {
      "title": "Ridiculous product",
      "text": "I have nothing to say about this one. The product is almost on fire. The plastic is all black when I got home. Is there anyway I can do more about this unsafe product?",
      "rating": 1.0,
      "verified": true,
      "author": "Tianhuizi",
      "helpful_votes": 5,
      "publication_date": 20191106
    },
    {
      "title": "Worth so much more.",
      "text": "This is such a great alternative to the expensive \"I've fallen and I can't get up\" system. This has allowed me to hande peace- of-mind. They're easy as pie to install and pair, and I love the ability to choose a song that fit each of my parents, that makes it totally recognizable as to who it is. I chose \"Under the Sea\" for the bathroom! Though can also user this system with a doorbell and a door sensor.",
      "rating": 5.0,
      "verified": true,
      "author": "Lhester1965",
      "helpful_votes": 3,
      "publication_date": 20181212
    },
    {
      "title": "Works well, distance < 500' in a home, on transmitter stopped working in 5 weeks",
      "text": "Low price, able to configure with multiple transmitters including push button, magnetic relay and motion detector. Allowed me to create an effective in-house alarm to tell me when an elderly Parkinson's patient needs help or tries to get out of bed without assistance at night. However, in a house, the distance capability is significantly less than 500', maybe not quite 100' and one of the push button transmitters failed after just 5 weeks.",
      "rating": 3.0,
      "verified": true,
      "author": "Clag",
      "helpful_votes": 6,
      "publication_date": 20181009
    },
    {
      "title": "Life Saving",
      "text": "Life Saver .... My mom fell at home and we needed a system for her to call us .... We live within three levels .... We bought extra buttons to place in strategic places .... It has been a God send ... She is happy because she can call us and we respond immediately .... I am a nurse and I can tell you it has been a great relief to have this devise in our house ....",
      "rating": 5.0,
      "verified": true,
      "author": "Jamaican Diva",
      "helpful_votes": 2,
      "publication_date": 20200626
    },
    {
      "title": "Loud just wish all receivers worked",
      "text": "We bought this in June of last year but did not use or test. Now we need the product 6 months later & one speaker doesn’t work 😓 My window for support or returns have closed. Other than that we think it’s great the volume is awesomely loud which we like. Just wish all 3 worked",
      "rating": 1.0,
      "verified": true,
      "author": "Pua",
      "helpful_votes": 3,
      "publication_date": 20200113
    },
    {
      "title": "Wishing for better.",
      "text": "Lasted about 3 months. Didn't die from usage. Only time used was for testing. One remote button doesn't ring alarm but lights on. Other is fine. Both alerts will not stay set on tune programmed in. It defaults back to doorbell ring which is useless except to make dog bark.",
      "rating": 2.0,
      "verified": true,
      "author": "Donna Day",
      "helpful_votes": 3,
      "publication_date": 20190217
    },
    {
      "title": "EXCELLENT!!!  HIGHLY RECOMMEND!!!",
      "text": "Forget battery-operated versions that are made cheaply and so unreliable! I previously had a battery-operated version from another company which I purchased here on Amazon. I always had to pair the receiver to the call buttons because the connections would just drop. It was so annoying. NOW I HAVE PEACE OF MIND WITH THESE PLUG-IN RECEIVERS!!! WE HAVE A 2-STORY HOUSE AND HAVE 1 RECEIVER IN THE DOWNSTAIRS DEN, AND 2 RECEIVERS UPSTAIRS. WE CAN HEAR MOM'S PAGE THROUGHOUT THE HOUSE!!! These worked straight out of the box and pairing was super simple. It's also made well and doesn't look or feel cheap. Well worth it's price!",
      "rating": 5.0,
      "verified": true,
      "author": "riverashopperny",
      "helpful_votes": 2,
      "publication_date": 20180831
    },
    {
      "title": "So simple and yet so effective 100% satisfied",
      "text": "What a difference! Bought this because of my elderly mom who had fallen and broke her hip and we did not hear her call us until morning.... Broke my heart to see her helpless on the floor! Never again the chime is loud enough to wake me up and go and see what she needs... Even installed on receiver in our barn almost 600 feet away and it works clearly every time! So simple just plug and push the button... We installed one button next to the tub just in case she needs help and didn't have the button on her. Great value!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Cournoyer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Current model transmitter battery access is bad, transmitter is heavy",
      "text": "Worked out of the box. Spouse has a way to get my attention over ambient noise. However, the videos showing how to access the battery for the transmitters must be old. Current version does not include the metal bracket and does not have slots to easily open the back of the transmitter. Still not sure how to open the transmitter without leaving nibble marks from a screwdriver. The kit does include a tiny eyeglass-type flathead screwdriver, but there’s no easy way to access the screws. Be aware also that the transmitter is heavy. If purchasing for a frail individual, may be too heavy for them to wear.",
      "rating": 4.0,
      "verified": true,
      "author": "IntuitivelyObvious",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "A caregivers godsend",
      "text": "My wife recently went into the hospice at home program, and I often work around the house while she's upstairs in bed or after she comes down. Many times I'm doing woodworking in the garage with power tools, and I was having to constantly check to see if she needed me. I plugged these into outlets in the kitchen, upstairs hallway, and garage and placed the two buttons by her bed and downstairs chair. She doesn't use them often, but it instantly alerts me to check on what she needs. No wires, no problems.....a true plug and play.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Hartman",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Easy To Use, Loud Enough to Hear Throughout the House",
      "text": "This set-up is working great for me and for my caregivers. It's loud enough for me to hear when I ring the bell, and my caregivers can move the ringers around to wherever they happen to be. Also, I like that there are only a couple of different chimes to select, rather than the long list of silly chimes that come with electronic doorbells that I had been using before.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Fox",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "no outside vender needed",
      "text": "I love it my bed ridden husband can call me to his room from where ever I am in the house or out side .this is perfect and no monthly payments to outside agency that only calls 911 for him .this is such a blessing for us as we tried bells ,a bike horn ,speaker phone and none worked as good as this product ,we are very pleased ,the ring tone could be louder for outside calling ,so I pay close attention for the bell to go off and I do not go far in the yard .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Works great, definitely water proof...",
      "text": "89 year old family member moved in with us two weeks ago. We’ve already used the button several times! Works great. Things we like: variety of tones you can select, volume control, range from transmitter to receiver. Things we don’t like: the tone is very short. During the night it would be nice if it rang a little longer. WATERPROOF- absolutely! It got inadvertently flushed down the toilet. The plumber came the next day to retrieve it. We cleaned it up, dried it off, hit the button... AND IT WORKED!",
      "rating": 4.0,
      "verified": true,
      "author": "Rita K. Carver",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Peace of mind guaranteed!",
      "text": "I bought this when I was taking care of a sick family member. It was one of the most useful purchases I ever made. It gave the patient peace of mind knowing I was only a call away. Having three monitors was great. I placed them in different areas of the house. The worked great both upstairs and downstairs. They come with a neckcord which makes it easy to wear and very accessible. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Tedesco",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Don't expect the range.. probably would work about 100'",
      "text": "Loud, works great as intended. Beware it will chirp every time the power goes off and back on.. not an issue if your electrical power does not flicker much.. but annoying during an ice storm.",
      "rating": 3.0,
      "verified": true,
      "author": "William D Bywaters",
      "helpful_votes": 2,
      "publication_date": 20190215
    },
    {
      "title": "Just like our doorbell and cord doesn't fit",
      "text": "1. The ringing is just like our doorbell, so my husband needlessly comes to my rescue when the doorbell rings. 2. To hang device from my neck, I use the enclosed orange cord. But it doesn't fit into the device correctly, which means it falls off at slightest tug. Scarey since it could happen when I most need to call my husband if I fall.",
      "rating": 3.0,
      "verified": true,
      "author": "Ida M. Halasz",
      "helpful_votes": 3,
      "publication_date": 20190217
    },
    {
      "title": "We've joked for years but the time has come.",
      "text": "I made a mom day/ dad day gift of this. My parents actually set it up and have minor cause to use it. They feel more comfortable having it as they sleep in separate rooms and can use these to get the other persons attention if needed. If you're hesitating go ahead and try it. It's very reasonably priced and the noise is so loud even my 73 year old dad can hear it.",
      "rating": 5.0,
      "verified": true,
      "author": "Renae N",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Did its job",
      "text": "This product worked great when we needed something for my wife to use if her medical condition turned into a sudden emergency (which thankfully never happened). We programmed the button to make the sound loud, and it definitely was. The range was quite satisfactory: my wife could walk over a full block from the house and still activate the alarm. The set-up could not be simpler: Plug it in and you're ready to go. I hope we never again have to take this system out of the box, but if we do, it's good to know it's there.",
      "rating": 5.0,
      "verified": true,
      "author": "Timbo",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "What about customer service?",
      "text": "This would be a five star but after only 6 months two recievers stopped working. I cannot find a number to call for customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs Miller",
      "helpful_votes": 3,
      "publication_date": 20191223
    },
    {
      "title": "Good Product",
      "text": "This is a simple, straight forward, easy to use product. Basically, you just take it out of the box and plug it in. It serves an important function and provides a fair amount of peace of mind for those caring for someone with limited mobility. It's a good choice for those with chronic health issues, but would also be a good choice for temporary use for someone who is recovering from surgery or injury.",
      "rating": 5.0,
      "verified": true,
      "author": "David H.",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Call to U Device Plenty Loud!",
      "text": "Great device. Purchased for my Dad who had a stroke. Siblings were so tired and thought that they would sleep through their shifts caring for our Dad. Our Dad was afraid nobody would hear him in the middle of the night so he chose the obnoxious siren alarm! Setting was later changed to more tranquil setting, lol! Very well made and sturdy plastic. Very easy to hear clearly and plenty loud!",
      "rating": 5.0,
      "verified": true,
      "author": "Fidelis508 ",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "A necessity for elderly parents",
      "text": "I purchased this primarily for my mother, so she could call for help when she needed it. With the enclosed strap you can wear it around your neck. The device is a big larger than I would like it to be. The receivers are quite loud, and will definitely wake you up at night! The only thing I would have liked differently is for the alert sound to continue on until someone reaches the person in need, instead of just ringing only twice.",
      "rating": 4.0,
      "verified": true,
      "author": "Roland",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Indispensable",
      "text": "Indispensable if you are a caregiver and your house has a lot of rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 4,
      "publication_date": 20180309
    },
    {
      "title": "You can add more units to this",
      "text": "This is a great product. You select the ring tones you want. I used the door bell one and for some reason it did not set the dogs off.. You can add it to other CallToU pager receivers. I needed four units so I was able to add one more to this",
      "rating": 5.0,
      "verified": true,
      "author": "jo the quilter",
      "helpful_votes": 3,
      "publication_date": 20180605
    },
    {
      "title": "Easy to set up and use",
      "text": "This system is wonderful. Sounds loud enough to wake me when my elderly mom needs my attention. Easy cor her to press also. So thankful that i can be immediately alerted when my mom needs something. This bell has been a life saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Catina Gordon-Oates",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "A caregiver’s little helper!",
      "text": "Excellent product. Very easy to set up the preferred ring tone, superb volume control, and has exceptional range. Each control button comes with a lanyard for wearing. I purchased two additional control buttons so to have extra back ups whenever the original battery eventually needs replacement in the controllers that came with the transmitters. I love that the transmitters are wireless and simply plug into the wall. This has allowed my mother to have more in-home independence and confidence while offering her reassuring support whenever needed.",
      "rating": 5.0,
      "verified": true,
      "author": "My Two Cents...",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Good range!",
      "text": "He lives independently but his neighbor wants to respond if he needs help so we placed one of the alarms in the neighbor's house next door and it works beautifully. Now he can summon help from the neighbor if he's not near his phone. In his own home, we placed one of the buttons in the bathroom attaching it low on the wall and the other he wears.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Really met our needs",
      "text": "This is a wireless pager for the home. We have a 94 year old mother-in-law whose room is away from the main part of the house. This pager comes with 3 ringers and 2 call buttons. So we have one ringer in the main part of the house and one in our bedroom. We also have an apartment garage where my daughter lived. She had a ringer up there as well. There have been no distance issues and it works as expected. Makes taking card of the MIL very easy. Nice device.",
      "rating": 5.0,
      "verified": true,
      "author": "Count Darling",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "... was able to figure out the instructions it was pretty simple to link the two buttons to the receiver",
      "text": "Once I was able to figure out the instructions it was pretty simple to link the two buttons to the receiver. Haven't figured out yet how to connect the buttons to multiple receivers though. It works great though. The buttons are downstairs and receiver we're using is upstairs. You can hear it very clearly on first and second level of home with doors closed.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Walker",
      "helpful_votes": 2,
      "publication_date": 20180523
    },
    {
      "title": "Needs a wristband!",
      "text": "Pros: Very easy to set up and loud, clear speakers. Cons: Needs a way to wear the call button on the wrist. Some users have trouble putting things over their heads because of neck, arm or shoulder injuries and there is no good way for those people to use this product. This leads to then forgetting to carry the button with then and defeats the whole purpose of the system.",
      "rating": 3.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 2,
      "publication_date": 20190101
    },
    {
      "title": "The bell is nice and loud and the signal reaches the second floor",
      "text": "I bought these so that my mother could contact me if she needed help during the night. It works well. The bell is nice and loud and the signal reaches the second floor. In fact the bell can be heard all over the house. This has provided a much needed level of security for my mother.",
      "rating": 5.0,
      "verified": true,
      "author": "Zettie",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Great way to take care of people with out Alerting EMTs.....",
      "text": "Works great!! The extra ring tones is has is bit Kooky... But, if you don't want to alert EMTs every time a person you are caring for falls, this the best option. Be careful not to lose the small white piece of plastic on the box. It is used to put the back and string on the pendants...",
      "rating": 5.0,
      "verified": true,
      "author": "MARK",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "Good In-House System",
      "text": "This in house alarm system is great. We now have 6 Alarm Receivers and 7 Buttons. Our whole house is covered in case of a fall or other need. Highly recommend it for anyone who just needs a Local In-House warning system. We did not see the need for any outside agency or another bill to pay.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Anderson",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Working well so far",
      "text": "This is a really good option for if you have an elderly person that may need assistance. We also use it to get my son to come to dinner without yelling through the house.",
      "rating": 5.0,
      "verified": true,
      "author": "CapitalOne",
      "helpful_votes": 2,
      "publication_date": 20190127
    },
    {
      "title": "Wonderful Product!",
      "text": "This is perfect if you have a disabled person who needs your help. My husband is temporarily sleeping in a hospital bed on the first floor of our home due to an illness. I can sleep in our bed upstairs because I know if he needs me, the buzzer lets him ring me! This works so well, just plug it in and you are ready to go!",
      "rating": 5.0,
      "verified": true,
      "author": "Dori Price",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "We needed to have an easy emergency alert system should she require help with getting ...",
      "text": "Bought this for my 82 year old mother in law who moved in with us. We needed to have an easy emergency alert system should she require help with getting out of bed, or if she wasn't feeling well. The system has proved successful, however, it is a complicated process to set the type of ringtone you chose. I left it on the preset doorbell ring until I have the time to figure out how to set a new tone ( there are 50 tones to chose from). Other than setting the ringtone, having two buttons and three units makes it easy for Mom in law to get a hold of us no matter where we are in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous7",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Perfect for seniors needing to get caretakers attention",
      "text": "Purchased for my parents, dad is bed ridden and mom doesn’t always hear him call out for her. This was an excellent solution for them in a mid size apartment. It’s loud enough to wake her up. It gotten any interference from other apartment electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri J Velez",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great. Just what I expected and received in a ...",
      "text": "Great. Just what I expected and received in a timely fashion. Quite happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied customer",
      "helpful_votes": 2,
      "publication_date": 20180807
    },
    {
      "title": "PERFECT COMPANION",
      "text": "One of them sits next to my mother in case she can't get up from her chair and one sits in the bathroom for when she needs assistance. A little tricky to set all 3 receivers but once done it works great. Volume can be adjusted",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Kocinski",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Very pleased. Big house thick walls.",
      "text": "We take care of an elderly family member and this has been a God send. We live in a very old house with thick plaster walls but we placed these both up and down stairs at a fairy long way from the buttons and they work perfectly. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Barry",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Works great",
      "text": "This product works great!!! We previously had a call system that only one or two transmitters would work with one receiver. This one lets all transmitters work with all three receivers. My husband was constantly hitting the transmitter that went to the receiver in a room that I wasn't in and I wouldn't be able to hear it. Now it will do off in any room that I am in. May save his life some day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Worked flawlessly",
      "text": "It can't get any easier. Take it out of the box, plug in a speaker(s). That's all there was too it. No issues with range. I only have need for one call button & one speaker at a time. So if anything breaks, I have an extra call button and 2 extra speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall J. Ford",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Perfect",
      "text": "So easy to use, fantastic range and loud enough. Got it for my diabetic mother in case of emergencies because we live in a two storey house. Couldn't have asked for an easier and more effective product.",
      "rating": 5.0,
      "verified": true,
      "author": "DrDammit",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Gives you added peace of mind",
      "text": "My mother has been ill and I wanted a way for her to call me if she needed anything. Her bedroom is on the opposite side of the house from mine so I don’t always hear her. This CallToU pager was the perfect solution. Very easy setup. It comes with two call buttons, one we put next to her bed and the other in her bathroom. The chiming devices just plug in any electrical outlet so they can go in any room in the house. They are loud enough to hear but not scary loud so you don’t freak out if you get paged in the middle of the night. It was just what we needed.",
      "rating": 5.0,
      "verified": true,
      "author": "MollyD",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great for caregivers!!!",
      "text": "This was absolutely perfect for my needs. My husband has ALS and needs help getting in and out of bed, bathroom etc. I placed one of the call pads in the bathroom and one on the bed. With the 3 units I was able to place them so I can hear his call anywhere in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "GDC47",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Excellent",
      "text": "These are great value for the money. Perfect for my elderly parents as call buttons in different rooms. Lots of different tones and good volume . Well made, sturdy and easy to press buttons. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "R. McGearty",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Works well so far.",
      "text": "As I said, the unit works well so far. We spread the receivers around the house and tested them. No problems anywhere in the house (+3,000 sq ft). I would buy the unit again.",
      "rating": 5.0,
      "verified": true,
      "author": "RotorDaddy",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Would definitely recommend",
      "text": "Love this item. My father is not able to walk without assistance so I got him this so he doesn't have to yell. It sets up really fast. And it's very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "easy to install works very well as my dad lives ...",
      "text": "easy to install works very well as my dad lives in mother-in-law quarters and needs emergency alert. this is easy use. but only really effective as a doorbell alert.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah Norris",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Peace of mind",
      "text": "My elderly father lives in an apartment attached to our home. This system is enabling him to stay there because he can signal us any time for help.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen White",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Great product!",
      "text": "We got these for our grandparents, who are in their late 80’s early 90’s. These were easy to set up and use in house. The volume levels are great, and you various sounds you can choose as well. Love that it came with a lanyard to put it in as well",
      "rating": 5.0,
      "verified": true,
      "author": "heather LK",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Flawless, Nice personal add for ADA",
      "text": "Works excellent, Mother that no longer walks uses it in a daily basis, put a few in different rooms and when she needs something, excellent quality",
      "rating": 5.0,
      "verified": true,
      "author": "Mark D",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "works great",
      "text": "wife has gone blind has MS and start of Alzheimer's. She calls me when she gets distressed, of course sometimes she forgets to call me",
      "rating": 4.0,
      "verified": true,
      "author": "Ed Keener",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Great System",
      "text": "This monitor system is the best! Receiver easily just plugs into outlet. The call buttons are also easy to put together and with the lanyard it slips on a shower bar or handle, a post on the bed, or can lay on the night stand. Ours came with 2 receivers (not sure about this one). We put one downstairs and one upstairs. You can change volume and tone. You won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Goodnight",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "So easy to set up & works great",
      "text": "My husband had this set up in minutes! Perfect for my mom who lives with us but has a tendency to fall. Placed in 2 different areas so she can easily access. We have cameras but don't have sound on all of the time. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "David P. Zuefeldt",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Perfect for what I needed",
      "text": "If what you need is a device to call you from any part of your home to someone who needs your help, this device is perfect. I bought the one with three stations so I could put one in the kitchen, my bedroom and the front porch. My husband wears one button around his neck and has the other on the bedpost. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "works as they should",
      "text": "got them for my mom that falls a lot to help with letting who ever is in the home with her to come help. she gets up at night and they have helped a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "I wanted to give 5...",
      "text": "In wanted to give 5 stars but this is a great product if your house is not made of solid concrete. I guess it’s made with USA houses in mind. Here in CR, it works in short distances where there are no walls in between because of the concrete. Good volume and lots of different tones to choose from. Very responsive (if no interference).",
      "rating": 3.0,
      "verified": true,
      "author": "Daniela Volio Kruse",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great ideal",
      "text": "So far I like the ideal that my Aunt who is unable to get out of her chair without assistance, I felt like if I wanted to work in the garage I would have to go in and out checking on her, Now I plugged it into the garage outlet and now I don't have to worry if she needs any assistance while I work in the garage. it is very loud so I don't worry if I hear it from a long distance in my yard as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Works great, excellent range",
      "text": "This system works great and has excellent range. Three receivers allow me to cover all the floors inside and the garage outside. I was skeptical but it really does have a great range and the bell/receiver units are loud!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Eskam",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Great",
      "text": "Using this for elderly Mother. Doorbell-like sound can be heard all over the house. A lifesaver for us all.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Good quality, works very well",
      "text": "Bought this to be able to help mom when she was bed ridden after hip surgery. It is very good quality. The chimes are instant when u press the call button and all the chimes are synchronized so it never sounds like multiple chimes, rather it sounds like one chime ringing throughout the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil B",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "For our parents",
      "text": "This product is very good we purchased it for our family member who can no longer care for themselves and had to move her in with us it works great at night when she needs help best thing ever . U can set is loud as u like and u can select any type of ring tone as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Villalon",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Works great!",
      "text": "Using for my elderly mother that is living with me. Works great in the house. Can also put a receiver in an outside electrical socket and it still works. I have a receiver in my brother's house (living room) which is about 200 feet away going through 2 outside walls and 3 interior walls and it works!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Call system for person needing assistance.",
      "text": "Works perfectly. If I am in the den, on the computer, the light flashing and doorbell sounds lets me know assistance is needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Hairywolf",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Horrible experience",
      "text": "The pagers beep automatically at night without any click. It drives us nervous as we listen to the calling. However, nobody actually called it, not even a click. The false alarm wakes every up and drives everyone crazy. I will rerun it.",
      "rating": 1.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great Value, Works as Advertised",
      "text": "What a wonderful invention for us at home caretakers and our loved ones. They no longer need to yell out for help. It worked right out of the box with no learning curve. Sort through a ton of different cheesy ring tones and settle on the default. 🤘🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Ride or Dye Studio",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Works very well",
      "text": "This works really well for us. I put one on each level of my house and the sound is so loud that there is no way I will miss it.",
      "rating": 5.0,
      "verified": true,
      "author": "mimi",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "I know when my grandfather needs assistance right away!!!!",
      "text": "I got this for my 99 year old grandfather who lives with me. He needs help at times right away. It works great. Set up was simple. Its loud which is great. He ran at 5am once and I heard it immediately even though its plugged in the hallway. This is so convenient. We are able to leave on of the \"call buttons\" in the bathroom in case he forgets to take his with him. The \"button\" is on a orange lanyard so it's very easy to see.",
      "rating": 5.0,
      "verified": true,
      "author": "dmbfan68",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Pagers dead quickly",
      "text": "I had this pager for weeks. The pagers stopped working continuously. I think the pagers should be double checked before shipped out. It is caregiver pager under emergency. Not a toy for fun. Please treat it seriously.",
      "rating": 1.0,
      "verified": true,
      "author": "Liner ",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Good enough!",
      "text": "Sound is loud enough for the whole house to hear and with many sound/tone to chose from. You can hear it even beyond closed doors. The instructions was very acurate making it easy to use and install. Downside, the signal/coverage should be wider so that you can still press the button at a farther distance.",
      "rating": 4.0,
      "verified": true,
      "author": "Lissa F.",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "It Works!",
      "text": "Order arrived Missing Bracket Opener. Instructions are difficult to follow. Does work as advertised!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jung Poet",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Works perfectly, sound is just right....",
      "text": "We have a couple buildings on our property and this was perfect for our elderly aunt. I will recommend this to many! Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Provides an alert for in home patients and caregivers.",
      "text": "Provides my mother with a way to alert the caregivers when they are attending to other duties in her home. Reduces mother’s fear of falling because they can now come to her aid when the chime rings. Volume control is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Works great!",
      "text": "These work great in our home to alert me when my elderly Mom is in need. I even have one in the basement, on the other end of the house, and it works great!",
      "rating": 4.0,
      "verified": true,
      "author": "CHERI TUCKETT",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "A must have for caregivers",
      "text": "Got this for my mom with Alzheimer’s to call me when she needs help getting up or emergencies. The bell is a pleasant doorbell, loud enough but not too loud, worked immediately after installing it. Couldn’t be without it now.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Lowry",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Awesome",
      "text": "This is an awesome product for anybody who is trying to take care of a love one at home. Very simple to use very simple to teach someone how to use",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Functional and easy",
      "text": "Excellent product. Easy to set up and to use. Great product for seniors. Purchased additional call buttons to cover all the possible hard to hear from spots in the house. 55 melodies to choose from, helpful to distinguish from all the phones and computer sounds.",
      "rating": 5.0,
      "verified": true,
      "author": "ME",
      "helpful_votes": 2,
      "publication_date": 20180604
    },
    {
      "title": "User friendly",
      "text": "You just open the box and plug in the pagers and the whole system starts working.. My 93 year old mother as delighted with how easy it is sound the alarm if she needs it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice C.",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "A must for care givers",
      "text": "They work fine the only problem I have is that it came with 3 plug ins. Only 2 will work.",
      "rating": 3.0,
      "verified": true,
      "author": "kim newton",
      "helpful_votes": 2,
      "publication_date": 20181225
    },
    {
      "title": "So easy to use.",
      "text": "What an awesome product. This works so perfect for my 95 year old Mom who is staying with us after her surgery.",
      "rating": 5.0,
      "verified": true,
      "author": "Pris",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Fairly gentle sound and I like being able to plug in the receiver",
      "text": "Now I can be in any room in the house and hear my mother calling for me. Fairly gentle sound and I like being able to plug in the receiver.",
      "rating": 5.0,
      "verified": true,
      "author": "horizon",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "unreliable pagers",
      "text": "It is weird that the gateway beep without any calling from the red button. That’s absolutely unacceptable because it takes us more time to clear all the misleading info. I would never trust this model as it did delivered incorrect signal at night and nothing actually really happened. I need a reliable care helper, not the trouble maker.",
      "rating": 1.0,
      "verified": true,
      "author": "Catharsis ",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "It's a good product",
      "text": "This has great volume I can hear it throughout the house if my mother would use it properly I'm sure it would work",
      "rating": 5.0,
      "verified": true,
      "author": "cleo",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "works as advertised",
      "text": "Really helped us taking care of elderly parent. Of course they refuse to call us but when they really need helped they did us it. Pleasant tone but wish there was a way to adjust volume.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel E.",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Easy to Use!",
      "text": "I take care of my Grandfather around the clock and these made life so much easier! It comes with 2 \"call\" buttons and 3 \"alert\" plugs! Very easy to pair and works long range",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Glackin",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Love this product",
      "text": "Totally satisfied. My mom is downstairs so I have one the call to upstairs and I hear it very loud when she wants me. Totally recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Gemz",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Gave me Peace of mind.",
      "text": "These worked perfectly. My Mom went into Hospice and I needed something that she could use it let me know if she needed anything when I wasn’t in her room. Great.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne C.",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Perfect",
      "text": "Works great and a lot cheaper than baby monitor that doesn't last. Ordered the set with three bases so could put in different areas",
      "rating": 5.0,
      "verified": true,
      "author": "Roger S.",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Very nice",
      "text": "My husband has stage 4 brain cancer and we ordered these After a seizure incident. Luckily no more seizures, but these are super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "liz willnow",
      "helpful_votes": 0,
      "publication_date": 20191227
    }
  ],
  "product_meta": {
    "title": "CallToU Wireless Caregiver Pager Smart Call System 2 SOS Call Buttons/Transmitters 3 Receivers Nurse Calling Alert Patient Help System for Home/Personal Attention Pager 500+Feet Plugin Receiver Alert",
    "description": "PERFECT GIFT for CHRISTMAS : DON'T WAIT, ADD TO CART NOW For YOUR LOVED ONES AND SENIORS\n\nWireless caregiver pager easily installed with waterproof IP55 Plug-in and play.\n\nFeatures\nModern & stylish design\nEasy installation\nApprox. 500+feet operation range (open air)\n5 Levels of volume\nIP55 Waterproof\n55 Ringtones. The default ringtone is “Ding-Dong”.\nLow power consumption\nSpecifications\nWorking voltage of Receiver:110-260V\nBattery in Transmitter:12V 23A Alkaline battery\nWorking distance:500+ft In open area.\nPackage\n3 x Receiver\n2 x Transmitters\n2 x Double Sided Adhesive Tapes\n1 x User Manual\n2 x 12V 23A Batteries\nNOTE:\nThe transmitter requires a 23A 12V Alkaline battery which is already included and not rechargeable. The Receiver plugs into a wall outlet and requires no battery.",
    "rating": 4.6,
    "feature_bullets": [
      "3 Pagers and 2 Call Buttons, the Idea is for Both Caregiver and Patient/Elderly/Resident/Handicapped/Sick Freedom while Still calling for Help at home. Not need to Yell to Get Someone’s Attention",
      "Transmitter/Push Call Button is Waterproof. Acceptable for Meal/Soup Splash. And Allow to be Installed in the Washing Room",
      "Transmitter/Push Call Button is Easy Carry. It can Be Put in Pocket. Or Hang on neck as Pendant. Neck Strap included. Fixed in Bedside/Washing Room. The Fixed Bracket and Double sticker are included",
      "Pager/Chime Unit has 55 Ring Tones for Your Choice. Operating Range is 500+ Feet in open Area. 5 Level Adjustable Volume From 0db to 110db. Easy Use (Plug and Play) Plug the Receiver into an Electrical Outlet",
      "The Package Includes 3 Pager Units/Receivers and 2 Remote Transmitters, 2 Double Sided Stickers and 1 Fixed bracket for Transmitters,2pcs Neck Straps, 2pc 12V 23A Battery (Have been Installed inside of Button)"
    ],
    "specifications": {
      "Package Dimensions": "5.8 x 5.1 x 4 inches",
      "Item Weight": "14.9 ounces",
      "ASIN": "B077VMC89R",
      "Item model number": "CC01 2-3",
      "Batteries": "2 12V batteries required.",
      "Customer Reviews": "4.6 out of 5 stars389 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,186 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 30, 2017",
      "Manufacturer": "CallToU"
    },
    "categories": [
      "Office Products",
      "Telephones & Accessories",
      "Electronics",
      "Office Electronics",
      "Pagers"
    ],
    "price": 48.87
  }
}