{
  "website_summaries": [
    {
      "verdict": "The Onyx Boox Max2 is an impressively capable Android tablet with a 13.3-inch E Ink screen and a useful stylus...but it costs as much as an iPad Pro.",
      "pros": [
        "13.3-inch E Ink screen",
        "Full Android app compatibility",
        "Fast, accurate pen",
        "Long battery life"
      ],
      "cons": [
        "Pen doesn't work well with third-party apps",
        "No front light",
        "Lacks dual-band Wi-Fi"
      ],
      "aspects": {},
      "publication_date": 20180222,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best and cheapest e-ink monitor I have found. I no longer suffer from screen-triggered migraines.",
      "text": "Simple to use as a monitor, which is what I mostly use it for. I no longer suffer from migraines due to too much scren time. E-ink is like looking at a newspaper: no harsh light to trigger strain, fatigue, and migraines. The refresh is quick enough that there is not the irritating lag of previous attempts at an e-ink monitor. It is even fast enough to watch video! Less buggy and less expensive than the Paperlike, of which I own three. This is my new goto device for when I want to spend more than fifteen minutes on my computer. Check out the review on Good Reads--it is what made me want to give this a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Sigars",
      "helpful_votes": 9,
      "publication_date": 20180307
    },
    {
      "title": "It's not that it's bad. It just lack of some functions for me",
      "text": "I used it for two days and return it. It's not that it's bad. It just lack of some functions for me. Like I can't find the highlighting functions while taking notes and it does not have sentivity writing experience like remarkable. It also does not support 5 G hz wifi which is a little bit disappointed. Otherwise, it is pretty cool, you can customize your lock screen which is amazingly cool!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180205
    },
    {
      "title": "Good product. BUT it’s a used one",
      "text": "Good product. BUT it’s a used one. Someone named Douglas used it. And I can’t get rid off his calendar sittings.",
      "rating": 1.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 14,
      "publication_date": 20180313
    },
    {
      "title": "Monitor is good, but resolution is fixed and very high",
      "text": "Monitor is good, but resolution is fixed and very high. Display content is too small. As a display, can't change settings, contrast, brightness. Battery is too bad. It can only support 5 hours for reading with wifi. Wish new software can solve this. ---Append rate after one month usage Now display has a serious problem. It seems all display is moving downward. You can watch my video. The screen is not broken. Something wrong with display chip. I am contacting Onyx directly, because I just miss returning window. Onyx did not agree for return or replace it until now. Seems not a good customer service. If you like this one, please consider it carefully. It is not a mature product.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 9,
      "publication_date": 20180302
    },
    {
      "title": "I just received this today, but it doesn't really ...",
      "text": "I just received this today, but it doesn't really work... The most important issue is that the wifi does not work. It just says \"Searching for Wi-Fi networks...\" but sees no networks. I've tried rebooting a couple times. I tried resetting all network settings. Nothing works. I have lots of other devices here on the network. I tried to go to the onyx support web page, but it's a combination of Engilsh & Russian. I've emailed sales@onyx-international.com, which is what the support web site instructed. Hopefully someone responds quickly.",
      "rating": 1.0,
      "verified": true,
      "author": "J. S. Holmes",
      "helpful_votes": 2,
      "publication_date": 20180424
    },
    {
      "title": "Screen is too yellow with low contrast",
      "text": "Pro: it delivers some of the nice features of a large e-ink tablet: light weight, hand writing notes, and native Android support. I can confirm that Mendeley works fine on this tablet. Con: The screen. Unlike Kindle which has white background, the screen of BOOX Max 2 is pretty much yellow. The characters are dark gray instead of being solid black. This gray on yellow screen leads to very low contrast (image the printing on a piece of old yellow news paper). Honestly, it may do more bad than good to your eyesight.",
      "rating": 3.0,
      "verified": true,
      "author": "HR",
      "helpful_votes": 2,
      "publication_date": 20181206
    },
    {
      "title": "The screen is way too dim for comfortable reading",
      "text": "I was misled by positive reviews online, the sources of which I now wonder about. Very dim grey screen (put it next to a Kindle and it's like night and day), very difficult to highlight/edit documents in a easily visible manner, synching issues, weak wifi connectivity.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 4,
      "publication_date": 20180916
    },
    {
      "title": "All the faults. Product description is good enough for successes",
      "text": "I wanted to keep this thing so badly but the sorry comings were deal breakers. 1) monitor lag is too great 2) lack of front light means I can't read it when I'm ready to read, at night. 3) stylus is useless unless using their note app which is arguably unintuitive Less of an issue: (all were overcome) 4) buttons are placed in a very weird place 5) no customization of home screen, but even don't size? 6) no but I'm way to deliver personal library. 7) rotation is a shame 8) multiple cables when one cable can do it all, usb-c 9) no volume rocker 10) no lockscreen",
      "rating": 4.0,
      "verified": true,
      "author": "Clayton Dittman",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Great for reading PDFs",
      "text": "Great for reading PDFs, or other full page documents with fixed formatting. It is large enough that it perfectly simulates a large paged book like a dictionary or printed academic journal. Scans or digital copies of large books are easy to read without zooming or scrolling. Contrast is good, and it makes a high resolution image, with text that is nearly as good as printed ink. It has Android, so you can basically do anything with it if you need to, but the screen refresh rate does make some tasks awkward. Overall it serves its purpose admirably, and has capabilities its competition lacks, making it the best choice available for many use cases.",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Screen defect",
      "text": "I loved it, until it’s screen just suddenly froze after just two weeks of use. I’ve tried everything: recharging it, resetting it, nothing works. I’ve emailed onyx customer support. I guess I’ll see how it goes, but I’m not getting my hopes high as even if repair is offered, international shipping is usually problematic. I did some more research and apparently screen quality issues are quite common with these.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill L.",
      "helpful_votes": 2,
      "publication_date": 20181101
    },
    {
      "title": "Don't like it... The pen cannot write well...",
      "text": "It is not easy to use. Very hard to write on the board, especially on the pdf. It drives me crazy. I do not like it at all. Compared to the SONY dpt-r1, the only advantage is that it does not need to connect to the computer. But now I regret that I hadn't bought two dpt-r1 but tried this e-reader.",
      "rating": 1.0,
      "verified": true,
      "author": "liang zhu",
      "helpful_votes": 3,
      "publication_date": 20180605
    },
    {
      "title": "Works best for reading docs/email as extended monitor",
      "text": "Works good for text only reading. I only use it as an extension monitor because I read a lot of emails and review lots of documents. Doesn't work well for reviewing drawings. Due to the refresh rate it takes time to move the mouse around so for that application it doesn't work well. Very good at reducing eye strain. I also don't use the note taking aspect but it writes well, I'm just worried to loose battery in the middle of a meeting while taking notes. I downloaded Google drive to share docs between devices, works well.",
      "rating": 4.0,
      "verified": true,
      "author": "O. Memon",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "button",
      "text": "The power button is very inconvenient underneath, often turned off when placed on a shelf, the touch screen sometimes does not work, there is no separate screen rotation option",
      "rating": 4.0,
      "verified": true,
      "author": "Enyi Zhu",
      "helpful_votes": 2,
      "publication_date": 20180905
    },
    {
      "title": "If you do any reading or writing, Onyx Max2 is for you.",
      "text": "Big screen, outdoor use, incredible readability! The Onyx Max2 gives new life to paper. I only can count myself as lucky living in an age and at a time in my life where this technology has made a difference in my life. Lots to read with e-ink ease, no more flying sheets of music with drafts or outdoors, impromptu notes and easy reading in direct sunlight, a lightness that is a perfect complement to the huge screen, and not having to worry about sucky battery life like those other backlight tablets. The Onyx Max2 fills a void that no other tablet can satisfy to-date.",
      "rating": 5.0,
      "verified": true,
      "author": "Hawaiian Kava",
      "helpful_votes": 6,
      "publication_date": 20180221
    },
    {
      "title": "Kindle App seems to have trouble",
      "text": "I edit a journal, so i download manuscripts 2x weekly to read on the Max2, and it works fine for that. I loaded some books for Kindle, and it works okay. The go to feature, and the menu for making changes are not where they are on a kindle. I try all sorts of things, and every once in awhile the menu appears, and you can make some changes to it. I tried finding a manual for using kindle on a boox max2, no luck.",
      "rating": 3.0,
      "verified": true,
      "author": "Jay Janney",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Mobile Sheets Pro Sheet Music display",
      "text": "Installed Mobile Sheets Pro for Android and works great for sheet music. Bluetooth pedal turns pages. Had to add screen flipping app, as the power button is on the bottom, so I flip the screen upside down. Little pricy, but great solution.",
      "rating": 4.0,
      "verified": true,
      "author": "dvondy",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "It's great! exactly what I am looking for for years",
      "text": "I use it as a monitor. It's great! exactly what I am looking for for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Discounted Gentleman",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Works well as a secondary monitor. Onyx has to work on improving contrast of text.",
      "text": "This device works well as a secondary monitor but Onyx still has to do a lot of work ahead (specifically around improving the contrast of text). Looks like this display is tuned towards photos and videos. Therefore, you get realistic photos and videos however it takes a toll on the reading experience. Most users buy this device to read TEXT (and not videos, pics), Onyx need to improve contrast of text when the screen is mirrored as an extended monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Amazingly useful",
      "text": "The device is very useful for my college courses. I take notes, enter Excel data and read textbooks with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Distinctly Inferior Handwriting",
      "text": "This e-ink reader is marketed as a professional note taking tool. It has many nice features, but it fails in the most fundamental task: handwriting with the stylus. The trace lags the stylus nib very noticeably, and there is an objectionable offset between the nib and the trace. If you have experienced handwriting with the Apple Pencil on the iPad Pro you will be highly disappointed with the Boox Max 2. Too bad! I was hoping for a great handwriting experience on a device with an e-ink screen, but this one just does not live up to the advertising.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Davis",
      "helpful_votes": 5,
      "publication_date": 20180613
    },
    {
      "title": "Has problem with showing the battery percentage properly.",
      "text": "so it takes the battery for 24 h, but it does not show the battery percentage properly. It seems a good device, but I am a little annoyed with wasting my time on trying and returning the item.",
      "rating": 3.0,
      "verified": true,
      "author": "mojdeh",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Pretty good so far",
      "text": "Pretty good so far... Not sure about android support in long term. Haven't seen any updates since. Also no backlight to read in dark.",
      "rating": 4.0,
      "verified": true,
      "author": "KA",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Keeps flashing and became completely unresponsive to touch after firmware update",
      "text": "Been working well since April 2018. Did firm just now (Jul 2019), the device just goes into an infinite refreshing loop upon booting. Further, it does not respond to any touch, so I really don't know what to do with it.",
      "rating": 1.0,
      "verified": true,
      "author": "AAA",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "It's a great reader. Not sure if it's practical to use it for sheet music, but it is a nice reader.",
      "text": "I'm thinking color would be nice. The black and white is really clear, but color would probably really help.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Sheldon",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Best e-book I have ever seen before. But also the second expensive one",
      "text": "A dream device for a researcher - excelent for journal, text or manual view , equation scribble and simple notes ! Only one matter is the price - it's worth it... But.... yeah. . It is just good as the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Wooseung Lee",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Expensive but very good!",
      "text": "I love it. It’s very easy to use. The price is high, but I think it’s worth it. Now I’m using it everyday for writing notes, reading, and capturing important stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "susiefirst",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great product",
      "text": "Things that I liked about it - Big screen size - fast response - Google play connection -Great note taking experience",
      "rating": 5.0,
      "verified": true,
      "author": "Hozhabr",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "I love every aspect of it",
      "text": "This is such an upgrade from BOOX MAX, I love every aspect of it. I used a bluetooth keyboard to write papers on it, such a relief on the eye. I do hope it is more durable and the customer service is reliable. Will keep up with the update.",
      "rating": 5.0,
      "verified": true,
      "author": "Lea",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Love this, perfect for reading docs and prints outside",
      "text": "I love this. I have been carrying around a file box for PDF prject documents, and about 50 pounds of blue prints for all my projects. Now, I just carry this. The bright the sun light the better you can see the screen. Perfect for making notes and sketches on docs and blue prints, this is a game changer, for architects, prject managers and inspectors. AAA+++ love it, love it love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Perry",
      "helpful_votes": 3,
      "publication_date": 20180120
    },
    {
      "title": "But disappointed. Here is why",
      "text": "Was waiting for this release with lot of anticipation. But disappointed. Here is why. It is a lot of money compared to N96 mainly for the larger screen. The speed is better. However, the battery life is much shorter than expected or advertised. The wi fi connection keeps turning itself on, even though switched off.",
      "rating": 2.0,
      "verified": true,
      "author": "Sanmateo",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Bonne tablette de lecture",
      "text": "Points forts de cette tablette 1.une très bonne tablette de lecture pas de fatigue visuel, nous pouvons lire des heures sans fatigue. epub, pdf parfait 2.la partie wifi fonctionne très bien. 3.le passage d'application à l'autre est très bien pensée. 4.Assez rapide mais une foudre. Point faible 1.Elle est peut paramétrable androïd 6 peut visible il y a une sur couche qui la cache bien",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "I can now read PDFs without carrying around a crate",
      "text": "I've got thousands of PDF that I cannot read on Kindle because of the small print. I'm excited. But I just got it in the mail.",
      "rating": 5.0,
      "verified": true,
      "author": "John Petrocelli",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Highly recommended for those who like to read scientific or engineering ...",
      "text": "Highly recommended for those who like to read scientific or engineering technical books in pdf like me. You no longer need to be bothered with zooming,cropping your pdf due to the device size. For page flipping, you can always switch it to A2 mode(you can customise touch setting of neoreader for A2 mode switching), which will give you fast response(I can flip through 100 pages within 1 minute), and after you locate your page, switch back to normal mode for text quality. If you only do reading, without WiFi turned on, battery lasts very long(1% battery consumption can last>30 minutes). Hesitate no more if you can afford.",
      "rating": 5.0,
      "verified": true,
      "author": "Jones Khoo",
      "helpful_votes": 0,
      "publication_date": 20180601
    }
  ],
  "product_meta": {
    "title": "BOOX Max2 Ereader,Android 6.0 32 GB,13.3\" Dual-Touch HD Display",
    "rating": 3.7,
    "feature_bullets": [
      "Play Store Activation: https://youtu.be/QL7tF8cIfKE",
      "Stable Android 6.0: Compare with our older version of ereader and other ebook readers,Max 2 will run much more faster with 1.6G Quad-core CPU than ever before.",
      "Dual Touch Control : Electromagnetic touch control with electromagnetic pen (Wacom stylus) for scribbling, and capacitive touch with finger for free reading",
      "Side Note View : You can have an EPUB or MOBI open on one side of the screen and the note app on the other. This will allow you to jot down notes on each page and save them",
      "4096 Degrees of Pressure Sensitivity :Max 2 will let you get thicker or thinner lines by pressing on the screen and gives you a chance to draw or write down your inspiration"
    ],
    "specifications": {
      "Product Dimensions": "9.33 x 12.8 x 0.3 inches",
      "Item Weight": "1.21 pounds",
      "ASIN": "B077GVLMJN",
      "Item model number": "MAX 2",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "3.7 out of 5 stars209 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#125,992 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 28, 2017",
      "Manufacturer": "BOOX"
    },
    "categories": [
      "eBook Readers & Accessories",
      "Electronics",
      "eBook Readers"
    ],
    "price": ""
  }
}