{
  "website_summaries": [
    {
      "verdict": "The Singing Machine karaoke system is a good value for the money. It comes with fun lights, and its Bluetooth connection makes it exceptionally versatile.",
      "pros": [
        "We love how this karaoke machine can play Bluetooth devices as well as regular CDs and custom karaoke CDs",
        "Song lyrics will display on your TV, allowing everyone to sing along"
      ],
      "cons": [
        "Only comes with one microphone",
        "You can purchase other microphones for it at an additional charge"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Second Mic port does not work, port sound quality in speakers, very distorted.",
      "text": "Lights are great for kids but overall not thrilled with product. Sound quality is not good. My second Mic port never worked and even though I have never complained about a product directly with a company with years being on Amazon they want me to jump through hoops to show Mic port doesn't work. Bought for my daughter for her birthday, wish I went with mtg second choice now. Leaving her disappointed that she can't sing with someone else.",
      "rating": 1.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 14,
      "publication_date": 20190820
    },
    {
      "title": "Too many problems",
      "text": "This has broken twice on me now! Multiple problems... Now I can’t hear the CD play. Before the microphone had a hum. My return window just closed. Help please!",
      "rating": 1.0,
      "verified": true,
      "author": "T. Peterson",
      "helpful_votes": 12,
      "publication_date": 20190505
    },
    {
      "title": "Fun for home parties!",
      "text": "My only thing is I wish blue tooth or wireless mics could be used.",
      "rating": 3.0,
      "verified": true,
      "author": "Hawaiian Ginger",
      "helpful_votes": 9,
      "publication_date": 20190403
    },
    {
      "title": "Kids Love It",
      "text": "My 4 year old is obsessed with this machine. We even got the additional microphone and a microphone stand so he can “play band” with his friends. What a great gift! And the Singing Machine customer service was so helpfu When I needed Answers.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa G.",
      "helpful_votes": 7,
      "publication_date": 20191011
    },
    {
      "title": "Bought for my sister with Down Syndrome",
      "text": "I bought this for my sister with down’s syndrome. She loves it, possibly a little too much. She’s singing at full volume with the mic turned all the way up all day. It’s portable which is great except every family event since her March birthday has become a Karaoke birthday party. I love how she can operate it on her own. It’s simple to use and super fun. We like to turn it on and then bluetooth our phones to the TV so we can put the youtube of the Karaoke song on the TV play the music out of the TV with the lyrics on the screen and use the mic to sing.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna S.",
      "helpful_votes": 2,
      "publication_date": 20200703
    },
    {
      "title": "My 6yr old rocks this karaoke machine",
      "text": "This one replaced one that fell and stopped working. My daughter loves it and uses it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Rozas",
      "helpful_votes": 6,
      "publication_date": 20190731
    },
    {
      "title": "Happiness",
      "text": "I do Disco Ball Friday for my associates at work, just to show my appreciation for all their hard work throughout the week... This was a perfect fit to my disco music 🎶 enhancement to take it up a notch!!! Thank You Amazon for such a great product that put a whole lot of Disco smiles on a lot of people's faces.....Ms V'S Disco Ball Friday!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms V`s Disco Ball Friday",
      "helpful_votes": 5,
      "publication_date": 20191126
    },
    {
      "title": "Nice",
      "text": "This sound machine was a great Christmas gift for my kid. It was easy to set up with her phone's Bluetooth for her to sing a long with. The sound is great and the colors are very bright but you can also turn them off. You can download a multitude of different apps to use on your own.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great quality and good sound",
      "text": "Love it. Bought as gift for daughter but has been used by everyone. Great sound. Even works great at camp.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew thomas",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Machine is great, but don't do their subscription",
      "text": "Machine is great and has worked well so far. Their app is terrible and cost more than any other music streaming service. We set it up and then just turn YouTube on the TV. We find all the songs we need there and the kids have fun.",
      "rating": 4.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Dining Machine SML625BTBK",
      "text": "My 3 year old grandson absolutely loves this it lights up and you can hook it up to tv and he can sing along and dance he was so happy and my heart melted to see him dance and sing! Highly recommend highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca L.",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Microphone quality is low",
      "text": "I feel microphone quality is very low, need to keep it very very close to mouth otherwise voice is not coming out of it. I have seen it from different company at same price at someone`s house and sound and microphone quality were really good.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Exactly what I was looking for!",
      "text": "This item was exactly what I was looking for. I know most the other machines that were sketchy not able to have lyrics on screen and if you are looking for that. This is the product for it. Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "MAMA SQUISHY",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "No Cords Included",
      "text": "This was a gift for my niece. I received this and it had absolutely no cords so my niece has not been able to use this. This was a waste of money because it is now just a corner decoration.",
      "rating": 1.0,
      "verified": true,
      "author": "Loves to shop",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Disappointed",
      "text": "The microphone and lights work but that’s about it. The blue tooth connection does not work so I plugged up my phone with the cord and it did not work.",
      "rating": 2.0,
      "verified": true,
      "author": "Kim B",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Fun - easy to use with bluetooth",
      "text": "Great karaoke machine. Light show is fun and it us easy to pair with blue tooth. 10 year old daughter and her friends love it. Comes with one much but another can be added.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia in DC",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Sherry",
      "text": "I am going to use this on this Saturday, 8/24, at a close setting, so hopefully everything will work just fine, because the lights are beautiful and the machine works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Not Worth money",
      "text": "Waste of money. Microphone was not loud, system sound wasn't loud, too small. The microphone was ecko when you talk in it.",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia Minter",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Good Value",
      "text": "This machine is worth the price!! The lights are a great effect. We haven't had any problems so far! Knock on wood! The sound quality gets tinny when u have the volume up and your singing. It's fun for the whole family though!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn - Va Beach",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Very impressive quality for the price.",
      "text": "Purchased for our 8 year old granddaughter for a Christmas present. The quality was amazing for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard M",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "He loved it!",
      "text": "Got this for my son for his 4th birthday! He LOVES it, he wants to play with it all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsi Jackson",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Very good",
      "text": "I like this product but my little girl loves it",
      "rating": 5.0,
      "verified": true,
      "author": "hurriah alexander",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "the sound is a little iffy",
      "text": "my daughters love it. the sound is a little off but they still play with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Christmas gift",
      "text": "Christmas gift looks starting but I haven't tried it yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Singing machine",
      "text": "Grandson enjoys. Good sound plays cd’s and nice light show",
      "rating": 5.0,
      "verified": true,
      "author": "Project1",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Very disappointed",
      "text": "I am returning it! The lights do not work properly, and I have tried 2 different microphones with it and the Mic sounds keep going in and out! Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Hours of entertainment!",
      "text": "Was a hit at Christmas!!! Wish the volume turned up bit louder to Help drown out my voice ;-) Overall very happy and easy to connect to Bluetooth!",
      "rating": 5.0,
      "verified": true,
      "author": "k 2",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "perfect karaoke machine",
      "text": "this was perfect for my 9 year old. volume works great. The lights work great. It’s connects via Bluetooth to her ipad and she’s able to sing to whatever wrong. it was simple to figure out and set up!",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Nice Gift",
      "text": "My granddaughter loves thia machine. She is in her room alot just singing away",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Chapman",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Microphone didn’t work",
      "text": "Great machine, other than the microphone not working. Which defeats the purpose of this item. Returning.",
      "rating": 2.0,
      "verified": true,
      "author": "Kimberly Leslie",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Blaming myself mostly.",
      "text": "This was a gift for my niece. I bought it at full price, next day, 20 bucks off. I wanted to kick my own bottom. There was no price match option either. Then I find out that the microphone doesn't work after I'd given it to my niece for Christmas. Really bad timing for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good system for a fun dinner party",
      "text": "Sound quality was good and I purchased a separate microphone so two people could sing Karaoke together.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarda Bradford",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "did not work",
      "text": "the microphones did not work and i was never able to use the karaoke machine. DO NOT BUY I AM DEPRESSED NOW",
      "rating": 1.0,
      "verified": true,
      "author": "chris gustafson",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Oh What a night 🎶🎶🎶🎶",
      "text": "Family night... with family and friends and grandkids singing into the night 🎶🎶🎶🎶",
      "rating": 5.0,
      "verified": true,
      "author": "Nufrespect Boston ",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "I didn't expect it to be so nice",
      "text": "I was looking at several karaoke machines to purchase for the kids for Christmas. I saw several that were much more expensive but this karaoke machine definitely impressed me. I would definitely recommend this product for kids!",
      "rating": 4.0,
      "verified": true,
      "author": "Taylour",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Welp, the kids are driving me crazy",
      "text": "Purchased for my daughters birthday, works well, great sound! This is unfortunate for parents but my kids are super happy.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Mic didn’t work!",
      "text": "I got this package today and My daughter excited and opened the box and set it up; but mic didn’t work ☹️",
      "rating": 1.0,
      "verified": true,
      "author": "Bala",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Sound when using as a karoke is not the best",
      "text": "This is cool. Connects to BT. But the sound when in karoke mode is not to good. To be honest.",
      "rating": 5.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Awesome",
      "text": "Very easy to use and hook up to the T.V",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph D Grittini",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Fun",
      "text": "I bought this machine as a gift. Did not realize I needed to purchase cds as well, my mistake.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Singing Machine is not up to date",
      "text": "This product is not HDMI cable ready. It is old school and needs an HDMI adapter (TV INSERT) for an HD cord (insert on front of the equipment. Extremely dissatisfied that we couldn't use this when we gave it as a gift.",
      "rating": 2.0,
      "verified": true,
      "author": "charbridget",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Good for the price...",
      "text": "I bought this item for personal use. When I first remove it from the box I had a problem with the speaker going in and out. The problem eventually went away and its been working just fine.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Nichols",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Karaoke for the family",
      "text": "I purchased as a Christmas gift for my 6 year old granddaughter. The whole family enjoyed playing with it all evening.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan W.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Fun for the whole family.",
      "text": "Love this product. Wish there were longer free songs but the machine itself is amazing.",
      "rating": 4.0,
      "verified": true,
      "author": "Michonne Campbell",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Fast shipping",
      "text": "Love the product. My 2 year old is obsessed. Connecting BT to it could be easier. Doesn’t always work.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Didn’t work",
      "text": "Couldn’t get the cd to work. Disappointing because it was a gift to my Mom. We wanted to try it but couldn’t. We tried several kareoke cds and we couldn’t get it to turn on.",
      "rating": 1.0,
      "verified": true,
      "author": "David Cusick",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Good quality for price",
      "text": "My niece and nephew have been singing nonstop since they got this for Christmas a couple of weeks ago. A great investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Bright lights, plays and the CD sounds great",
      "text": "I purchased this for my grandson, he loves it. The light are great and bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Stephens",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Microphone doesn’t work",
      "text": "The microphone doesn’t work. We did everything the directions said about troubleshooting the problem, but it still did not work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Awesome company support",
      "text": "The first machine didn't work so well and the singing machine company had been a great big help very fast on fixing the problem I'm very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Tedder",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Karaoke Machine",
      "text": "The cd doesn't work. Unfortunately the box was thrown away.",
      "rating": 2.0,
      "verified": true,
      "author": "lois10472",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Plug not EU good so far.",
      "text": "The plug was not EU. Santa day was not great",
      "rating": 2.0,
      "verified": true,
      "author": "Majella",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Singing machine SML625BTBK",
      "text": "Brought for my nine year grand daughter, works real well, she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Passarella",
      "helpful_votes": 0,
      "publication_date": 20190625
    }
  ],
  "product_meta": {
    "title": "Singing Machine SML625BTBK Bluetooth CD+G Karaoke System Black",
    "description": "Your party guests will thank you when you turn on this awesome karaoke system packed with incredible features for you to create fun-lasting singable moments. This system lets you play your music CDs and CDGs or stream audio via your Bluetooth compatible devices. Follow the karaoke lyrics on your TV screen via the included RCA cables. Record your voice performances to the integrated USB jack. Built with over 40 multi-colored LED lights that synchronize to the music plus speakers in wood cabinets for a crispy sound, you are party-ready at a moment notice!",
    "rating": 4.3,
    "feature_bullets": [
      "Play your favorite music cds and Karaoke cds (CD+G). stream digital audio from your Bluetooth compatible devices (external devices not included)",
      "Stream thousands of karaoke songs on demand with the Singing Machine Free Mobile Karaoke *App for iOS devices! Multi-colored LED lights synchronize to the music",
      "Record your audio performances via the integrated USB port to share and playback. Connect to your TV for Scrolling lyrics via the included RCA cables",
      "Built-In speaker in wood cabin for a crispy sound. Supports two microphones with separate volume control for duets. One wired microphone included.",
      "Line-in to connect to your personal Mp3, smartphone, or other audio devices. 3-Digital LED display to Show your audio track. 5 free Karaoke song download of your choice"
    ],
    "specifications": {
      "Item Weight": "6.55 pounds",
      "Product Dimensions": "8.5 x 8.5 x 12.8 inches",
      "ASIN": "B077QYB796",
      "Item model number": "SML625BTBK",
      "Customer Reviews": "4.3 out of 5 stars341 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#2,307 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 25, 2017",
      "Color Name": "Black"
    },
    "categories": [
      "Portable Systems",
      "Electronic Music, DJ & Karaoke",
      "Karaoke Equipment",
      "Systems",
      "Musical Instruments"
    ],
    "price": 49.97
  }
}