{
  "website_summaries": [
    {
      "verdict": "A must have for anyone with a baby in the home. The well organized basket will be a huge time saver when it comes to washing bottles.",
      "pros": [
        "The lid is designed to hold baby bottle tops securely in place",
        "The inside of the basket is spacious and can hold multiple cup lids",
        "It is also an effective way to wash reusable coffee pods",
        "The split center opening makes the basket easy to open without removing from the dishwasher",
        "Made from thick durable plastic"
      ],
      "cons": [
        "Basket may be too tall for some dishwashers",
        "Be sure to check dimensions before purchasing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not just for baby 🍼 parts.",
      "text": "I purchased this because I use those refillable kurig cups (with paper filters) metal with plaste framing. Dishwasher top wrack but they are small. I make up 7 at a time. Less than 1/3 the price of the prefilled cups an I can add cinnamon if I want. Hand washing doesn’t take that coffee build up off. This is much sturdier than I expected. like the closure - no snap so not like a lot of thin baskets end up breaking. Well designed and built to last.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime P. Lovci",
      "helpful_votes": 23,
      "publication_date": 20180714
    },
    {
      "title": "maybe oxo should do a customer survey and then would know what is wrong with their product.",
      "text": "Everyone in the world has a medela pump, so why are the holes in this thing not small enough to prevent the white membranes from falling through during wash half of the time?? And it holds a ton of water that drips all over my counter when I am removing the parts. And the green flaps are not on tight enough, cannot lift the thing up by them when it is full.",
      "rating": 2.0,
      "verified": true,
      "author": "D Z",
      "helpful_votes": 15,
      "publication_date": 20181215
    },
    {
      "title": "Fits in my GE Dishwasher just fine",
      "text": "I love that it opens in the center and I do not have to take it out every time I put something in it. My baby uses both Tommee Tippee and Dr Brown's and I am able to fit all the tiny parts in the basket. Very happy with my purchase! And knowing it's OXO I know it will last for years and years.",
      "rating": 5.0,
      "verified": true,
      "author": "E. ChampionTop Contributor: Baking",
      "helpful_votes": 13,
      "publication_date": 20180705
    },
    {
      "title": "Worked well for my purposes",
      "text": "I used this daily before the AAP came out with yet another article to make parents lives harder. I kid. The AAP now recommends washing baby bottles, cups, cutlery, etc., by hand to avoid plastic chemical leaching. I'm prone to FTM anxiety, so now I wash every freaking thing by hand. I digress, this basket is very useful and has just the right amount of space for daily washing.",
      "rating": 5.0,
      "verified": true,
      "author": "Poco Drago",
      "helpful_votes": 10,
      "publication_date": 20181129
    },
    {
      "title": "Should Have Bought Years Ago",
      "text": "I've thought about buying a DW basket often but never did. Both my daughters used them when washing baby bottles and now for other things. I often wished I had one when I had tiny things I wanted to put in the DW, but always ended up hand washing them. After buying some silicon cupcake cups, I decided now is the time. I have a Whirlpool DW and this basket goes right in the middle on top. It fits right in and I had no problem with it being hard to place. It's a little large, but I'm glad I got it instead of a smaller one. It seems sturdy and I'm hoping it will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "FLGrammie",
      "helpful_votes": 2,
      "publication_date": 20200417
    },
    {
      "title": "Useless",
      "text": "Not easy to use to sterilize our bottles. It retains a lot of water and we had to let the bottles air dry afterwards. It did not seem that the bottles were clean enough after the first use so we haven’t used it since. We’re back to soaking, hand washing and sterilizing in boiling water for all of our bottles. Not worth purchasing and I didn’t save the packaging so I’m unable to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Perfect bottle basket",
      "text": "Great bottle basket! Solid and roomy in my dishwasher. Fits large Avent rings/nipples and pacifiers perfectly. I put the actual bottles on the rack itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Moon",
      "helpful_votes": 8,
      "publication_date": 20180603
    },
    {
      "title": "This. Is. Wonderful.",
      "text": "Why did I choose to handwash all of my bottle parts and sippy cups for 2 YEARS before buying this?? Because I am a fool. Do not be a fool like me. Purchase this. Fill it. Make a cup of coffee and stare at your empty sink with pride. I purchased this for my reusable pouches and happened to put my sippy cup parts in it out of curiosity. I never knew how much I needed this. I will be making good use of it for baby #3!",
      "rating": 5.0,
      "verified": true,
      "author": "amllentil2",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Fits perfectly in the dishwasher",
      "text": "I've never purchased an OXO product that I didn't like, and this didn't dissapoint, either. It fits perfectly in the glass slot on my dishwasher so it takes up minimal space. It's easy to open, and everything in it gets cleaned well in my dishwasher. I was worried that the bottle nipples wouldn't clean up well, but they come out looking as clean as if I washed them by hand. I like that there's a place for straws as we start getting into sippy cups.",
      "rating": 5.0,
      "verified": true,
      "author": "C00kie",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "A little too big",
      "text": "I really like this dishwasher basket because the small items I put in it actually get clean and it saves me a ton of time not having to hand wash the items. However, the basket takes up a large portion of my upper dishwasher rack. The basket itself only takes up about 1/8 of the rack, but it is nearly impossible to put things up close to the basket because it hugs the tines next to it and makes it impossible to make things stand upright next to it. Still, I use it if I have room in order to save myself some time. It does work!",
      "rating": 4.0,
      "verified": true,
      "author": "WyomingGirl",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Holds so much!",
      "text": "Replaced my munchkin brand dishwasher basket with this one and I’m so glad I did! I love that the top opens from the center. Fits Nuby sippy cups perfectly... holds way more than the munchkin one I had! Also has spots for 8 straws. I have a Frigidaire dishwasher and it fits in the top rack perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Life saver!",
      "text": "For some reason, washing bottles was my least favorite thing to do when I went back to work and my daughter started daycare. Realistically, it probably just took no more than 20 minutes, but I would dread it and put it off and then it would just seem like a way bigger deal than it was. And then I bought THIS! And it's AWESOME!! Works perfectly for all the little parts and pieces. Sometimes things flip over inside of it and fill up with water, but I could probably just pack it differently to avoid that. Anyway, I'm super pleased with this purchase and wish I had done it sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Lifesaver, and not just for folks with infants!",
      "text": "This thing is awesome! We live in a tiny place with a tiny kitchen sink. The only saving grace is that we have a dishwasher. This basket has seriously reduced the time we have to spend hand washing all the annoying little things too small to otherwise go in the dishwasher. It's lives in one corner of the top shelf, and fits perfectly! It has gone through a wash cycle almost every day for 8 months now, and still looks practically new. When we move, if we get a bigger dishwasher, we'll probably add a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Shanna A",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Works but doesn’t fit in dishwasher well",
      "text": "I really like how this bottle basket functions with the way the top opens. I also like that it has lots of room in it, but beware because it doesn’t fit very well in my dishwasher. I had to kind of force it into a spot and the bars in the dishwasher kind of interfere with how many things I can fit in there. In the end it works fine and accomplishes the task at hand for a good price.",
      "rating": 3.0,
      "verified": true,
      "author": "nieljo4",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Awesome basket. Well worth the money.",
      "text": "I bought this product not for baby things because my youngest baby is 33 years old. I bought it to put the mouth pieces to my nebulizer in it so I could sterilize them in the dishwasher. I've used it once so far and it worked phenomenally well. My husband forgot that I told him to put it on the top rack of the dishwasher and yet nothing bad happened to it when it was on the bottom rack. I am very happy that the basket can hold all the small little parts to my mouth pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Kaiser",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Game Changer",
      "text": "If you are having a baby this is a must have game changer! This product has made it possible to clean all of the little parts of the bottles, pacifiers, teething toys, and everything else for our LO that is small on the dishwasher! We love it! So far it has held up for months of two to four washes a day! I would otherwise have to wash these parts by hand, with a little baby around washing all these little pieces by hand multiple times a day is just not feasible!",
      "rating": 5.0,
      "verified": true,
      "author": "LEG 585",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Use for water bottle tops and protien shaker ball",
      "text": "I don't have kids lol but I bought this specifically for my gym water bottles and protein mixing bottles which have the wired balls. I was hoping that the top of the basket would hold the bottle tops in place but sadly it is very small. I don't the top part for anything but just as a cover. I throw all of my water bottle tops and wired protein mixing balls in this basket. If I would've known the top wouldn't fit the sport bottle tops I would've probably gone with a cheaper version without the top compartment. It works very well!",
      "rating": 4.0,
      "verified": true,
      "author": "Iggy",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Perfect",
      "text": "It fits perfectly in my older model dishwashing machine, It’s easy to store, and you can also use it in the newer model dishwashing machines. While my husband was deployed I took it to Kentucky with me and I used it there. Obviously it is easy to clean said to get clean as you wash it. It’s nice to be able to store your nipples on top and all your other small miscellaneous things in the compartment. Even if you don’t use it for bottles you can use it for anything small that you need to contain in your dishwasher so it won’t fly around.",
      "rating": 5.0,
      "verified": true,
      "author": "Anastasia Wright",
      "helpful_votes": 2,
      "publication_date": 20180913
    },
    {
      "title": "Buy something else that’s bigger and more sturdy",
      "text": "Doesn’t fit as many bottle parts as I expected. We have several bottles, and this is overflowing by the time we run the dishwasher so we often end up cleaning a couple by hand anyways. I was hoping this would take care of everything, but it’s only a small help really. The plastic isn’t very sturdy either.. I’m always scared I’m going to break it when I snap the top back on. We ended up keeping it though and it hasn’t broken yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Malcolm",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Dishwasher perfect",
      "text": "I liked the first dishwasher basket so much that I bought a second and use daily. The bottle nipples don't wash very well but it might be our dishwasher. As long as the baskets aren't overfilled, I feel confident that the bottle parts (Dr. Brown) are washed well enough. I still boil the bottle nipples a few times a week but recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Girlmommyx2",
      "helpful_votes": 2,
      "publication_date": 20181024
    },
    {
      "title": "Slightly awkward",
      "text": "It was slightly awkward getting this to fit with the tines in the top shelf of my dishwasher. We got it to work, but not without some finagling. The lid is a little tricky to open and close. The compartments within the lid are perfect for bottle nipples, but didn't fit any other small parts. However, overall, it does the job and fits all the bottle parts for one load of dishes. I like the way it has a place for straw-shaped objects, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Not my favorite",
      "text": "I have had both this one and the munchkin dishwasher holder And I take preference to the munchkin one. How the doors open on this oneIs like French doors versus the munchkin one opens like a regular door. Sometimes the sides don't wanna lineup properly causing it difficulty to close The area that holds the nipples. This fits somewhat awkward in my dishwasher as well. This one isn't bad i just prefer something else",
      "rating": 3.0,
      "verified": true,
      "author": "Hannah Decowski",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great for larger (“natural”) nipples",
      "text": "Love this basket! After having one baby 7 years ago all I had left was one of the old munchkin versions of these baskets. The larger bottle nipples (“natural”) don’t fit well in that version (standard nipples only) but this basket is AWESOME! I’d definitely recommend this. Both baskets fit in the middle top rack of my washer together so I have more than twice the space now.",
      "rating": 5.0,
      "verified": true,
      "author": "Truth",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Helps wash small bottles parts, holds up wash after wash",
      "text": "This is prefect for all of our bottle lids, nipples, and small breast pump parts. I toss everything in, it fits perfectly in the top rack of my dishwasher and I run the washer. It never opens from the water pressure, and everything stays put well inside. It’s easy to air dry or wipe clean. I love the little slots for the nipples to wash and dry too. I highly recommend this and I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Califano",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "lovely basket for washing baby's things in dishwasher",
      "text": "I bought 2 of these so that I could wash my baby's small little things in the dishwasher. The baskets are good quality, they seem durable and work great. I have no complaints. They go in the top rack of our dishwasher. When I remove the baskets, I rinse them and whatever is inside with water to remove any residual soap. With a little baby, I don't have time to handwash all his things and these baskets help make life easier",
      "rating": 5.0,
      "verified": true,
      "author": "thegirlwhoruns",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Life Saver",
      "text": "This thing is so useful for baby bottle and pump pieces. Dishwashing was so annoying before we got this. It keeps all the pieces and they all get clean. Sure, Medela membranes are too small, but they are tiny! There's no way you could make this product with holes small enough to keep them in without restricting water flow too much. Just get duckbill valves instead, they fit great in the nipple holders. Comotomo nipples don't really fit but they're big enough to just be on their own in the dishwasher. Also have a hard time with Dr. Brown's long tubes and just put them in the silverware basket instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Barrett",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "All depends on the bottles you use",
      "text": "This product does what it says it will do,but it all depends on what bottle you use if it is worth the money. We use comotomo and boon bottle which both have larger and wider nipples. They do not fit well into the nipple slots, they are just too big. You can make them fit but it will only fit 2 or 3 jammed across the entire top. The basket part holds a fair amount of small pieces and bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "Aguado Family",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Probably would have worked okay, but .  .  .",
      "text": "This may be an unfair rating, but when I received it, the tabs on the end were broken, presumably during shipping. To the credit of Amazon and/or the manufacturer, I received an immediate credit after reporting the broken product. My guess is that it would have worked okay, although the inside cavity was smaller than I expected.",
      "rating": 2.0,
      "verified": true,
      "author": "DAH Rosco",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Multiple uses and great quality!",
      "text": "This is great for even cleaning small items that may not be good to put in the utensils section of the dishwasher. I use it for my nebulizer hand sets to wash. It fits quite a good amount of items and allows the water to wash the items throughly. I would recommend this to anyone needing it for bottle tops or other items like nebulizer hand sets.",
      "rating": 5.0,
      "verified": true,
      "author": "tigereyes4322",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Straws come loose",
      "text": "I bought this to use as a second way to wash (after hand washing,) my reuseable glass and stainless straws. There is technically nothing wrong with the product, but without adding a rubber band to keep the straws together inside, some make their way out of this basket. So be cautious for washing kids straws in this. It does have small cut outs/holders for straws, but if straws are too long and you may them down, they may fall out.",
      "rating": 3.0,
      "verified": true,
      "author": "Angela K.",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Game changer, use this if you have Dr. Browns bottles",
      "text": "We use this with our Dr. Brown bottles. Easy to use, compact, and it gets everything clean. I love that the nipples stick out the top, I think they get more clean this way. We wash the parts for up to 8 bottles, but usually around 4 to 5 bottles, plus lids from other breastmilk storage bottles, pumping parts, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Ranae H.",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Perfect and convenient!",
      "text": "We bought this because I was SO TIRED of hand washing our Lansinoh mOmma bottles, but I didn’t want to risk parts getting lost or melted in the dishwasher. I trust OXO and love all of their products I have, so I ordered this. It fits the bottle nipples perfectly and the basket has plenty of space. I am so glad we bought this!",
      "rating": 5.0,
      "verified": true,
      "author": "Berkeley C",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great idea, doesn't quite fit in dishwasher",
      "text": "I use this product a couple of times a week, and am glad that I have it. However, it doesn't quite fit in the top rack of my dishwasher very well. It doesn't fit lengthwise in the rows between the prongs, so I have to put it on top of the prongs so that they go through the holes in the bottom of this basket. Not incredibly convenient, but it still gets the job done as far as holding all of the small items in the dishwasher.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Love it",
      "text": "The model I use at home was discontinued so I bought one of these for my inlaws house to make travel easier. I like this version so much I'm considering replacing mine even though they still work fine. Bottle nipples fit perfectly in the slots and the basket underneath fit the o-rings plus a few oral syringes to get everything nice and clean without the hassle of handwashing.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Crooks",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Must have for baby bottle cleaning",
      "text": "So much better than the flip top baskets. It doesn’t tip since the top opens on both sides. Holds more pieces than other caddies I have used. We use Tommee Tipper bottles which have larger nipples and I am still able to place all 8 in the top section, it takes a moment to close that way but with the previous one I had I could only use 5/8 designated nipple slots. Con. If you have a small dishwasher it does not sit perfectly in between the racks but I have still not lost any pieces during a wash cycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Epps",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Can’t Open in Dishwasher",
      "text": "I’d give this 5 stars except no matter how I place it in my dishwasher the top doesn’t open properly. So I end up opening it partly and squeezing bottle parts in it or I have to take it out completely to put parts in it. I also didn’t think of how much room I’d need surrounding it just to open the top. In hindsight, I’d order one of those other types that have a squishable lid to insert bottle parts.",
      "rating": 4.0,
      "verified": true,
      "author": "Morganne Stinsman",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great size, easy to use but doesn’t fit my kitchenaid dishwasher well",
      "text": "I own several different brands of dishwasher baskets and this one is by far the best quality, size and easiest to use. Update: I recently purchased a new Kitchen Aid dishwasher and the way the prongs are set up, this doesn’t fit very well, considering the hole pattern on the basket. I can only fully “seat” the basket in the top rack (actually the middle one if you count the tiny cutlery rack as the top) at a 45 degree angle, which isn’t great for space usage. Luckily my son is getting older and I have fewer cup parts to wash on a daily basis.",
      "rating": 5.0,
      "verified": true,
      "author": "Parker",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Works great!",
      "text": "I’ve been using the munchkin brand baskets for years and the parts that hold the straws break off after a few uses. They had to be replaced often. This basket is much higher quality and holds the straws (and every other sippy cup part) without any problems. I wish I had been using the Oxo Tot brand all this time!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Doesn’t really fit or close",
      "text": "It doesn’t really fit in my dishwasher the little holes don’t line up so it sits funny in there. Also is the lid supposed to close because it does not if you have anything in the basket even 4 oz bottles.",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn A Kennedy",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Space for Nipples/Pacifiers",
      "text": "I like that this wash basket has both a place for nipples/pacifiers and then a basket below for rings, caps, etc. The only complaint (which is not really a complaint) is that I use Dr. Brown bottles and the straw sides can only fit two to each end. However, I already had a different basket that works great for those.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigdog",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Wouldn't fit in dishwasher. Actual dimensions are 12\" long, 4.75\" wide and 4.25\" high.",
      "text": "The dimensions listed in the product description are not correct. I measured my dishwasher racks before ordering this basket and was made to believe it would fit, however, it is wider than advertised. I can still use the basket in my dishwasher and it gets the bottle nipples, rings and other small parts clean, but it doesn't fit very well in my dishwasher.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer F.",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Recommended",
      "text": "I like this basket. I can put every kind of little baby bottle part in it and it stays in the basket. I love that the lid of the basket clamps shut real tight so the basket wouldn’t open in the dishwasher. Also, you can put baby spoons and pumping duckbill valves in it and they will stay where you put them and be washed well. It’s easy to hold and the large holes aid cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Aadi",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Not as well made",
      "text": "I love these for cleaning my Dr. Browns bottle parts. They keep everything together while I run them through the dishwasher. I don’t know if they have changed how they are made, but this one has warped some from the dishwasher. I have an older one I bought with my first child (8 years ago), used it with my second child (6 years ago), currently using it with my twins and it is in perfect shape. But the one I purchased more recently warped. It is still usable, but the top storage comes off easily and does not close flush.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Not Compatible with Oxo Tot Straws",
      "text": "TLDR Not good with Oxo tot straws. I thought this would reduce my daily chore of cleaning Oxo Tot straws. Either my dishwasher isn't good or this basket is not good at getting them clean. The mouth pieces still had milk inside and would not get clean. The straws also move around in the basket because of the water spraying through them.",
      "rating": 1.0,
      "verified": true,
      "author": "EK",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Love clean bottle parts!",
      "text": "Love love love this for our bottle parts. Gets them insanely clean without having them all over the place. The only thing I do not like is that it is hard to get in and out the dishwasher if it gets stuck on the prongs, but that’s an easy thing to deal with for her clean bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Dano32",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "So far so good",
      "text": "No issues so far! It is slightly hard to open it, the first time I opened it after washing some pacifiers, one of them flew out. I'm sure it will get easier to open the more it's used. It's currently on the 2nd run through the dishwasher with breast pump parts and seems sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Car710",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Nice features for the price",
      "text": "We previously had another brand of dishwasher basket. This OXO model is better is about every aspect. Nice two compartment design is great for separating small parts from larger ones. Lots of uses aside feeding bottles. We don’t even have OXO bottles and still love this one.",
      "rating": 5.0,
      "verified": true,
      "author": "jmorton",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Perfect for bottle parts",
      "text": "This works very well in the dishwasher to hold bottle parts for cleaning. I'm able to put all parts for 6 bottles in there at one time...which saves me from having to hand wash bottles everyday. Also works well for other small items like reusable straws, sippy cup parts and pacifiers.",
      "rating": 5.0,
      "verified": true,
      "author": "tallymom",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Helpful for small baby gear",
      "text": "I am glad we got this to wash our baby bottle parts and toys in the dishwasher. The only reason I gave 4 stars is because it doesn't really fit in our dishwasher --- we kind of had to smash it in and manipulate the top rack to make it work. Otherwise, great basket.",
      "rating": 4.0,
      "verified": true,
      "author": "Ally S",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Love it!",
      "text": "We use Dr Browns bottles and it fits them perfectly! People mentioned it’s hard to open, but that’s because you have to release the snaps on both sides. It opens just fine and I like the fact it is a little harder to open because it stays closed during the washing cycle and my bottle parts don’t fly all over the dishwasher. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Works well for us!",
      "text": "I really love this dishwasher bottle caddy. The design has worked well and made cleaning bottles significantly easier. My only complaint is that the top clips do not clip nearly as good now that the caddy has been routinely used for the last month. It still works and holds pieces in but doesn't feel nearly as secure as it originally did. I loved the design and colors, and would still recommend to anyone looking for a dishwasher caddy.",
      "rating": 4.0,
      "verified": true,
      "author": "Jo Ham",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Well made but don't fit GE and Bosch Dishwashers",
      "text": "I bought these looking to reduce my bottle cleaning time, they are well made and overall the design is also function but try putting them in the dishwasher; its a hassle and we have tried it on two different brands and for both they don't fit. I am ready to return them because of the inconvenience, they are unpractical and have been sitting in the cupboard after first few trial uses. I had seen the earlier reviewers that said they don't fit the dishwashers but I thought I could hack it. With many trials, this product has become one of those that are nice to have but if they don't fit your dishwasher; its not worth keeping it.",
      "rating": 2.0,
      "verified": true,
      "author": "Ahmed B.",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Big basket for baby bottle pieces.",
      "text": "This one is definitely made for baby bottle use. I needed something to contain small items in the dishwasher and this one is too big to fit in between the dividers on my top rack. Not exactly what I wanted. But for what it is, it is very well made a very sturdy.",
      "rating": 3.0,
      "verified": true,
      "author": "mesha",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Smart design, great product, buy more than one!",
      "text": "I would buy stock in this nifty little gadget. No other baskets compare in my opinion. I now spend more time loving my baby and less time washing bottles. Time and money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Family T party of 3",
      "helpful_votes": 2,
      "publication_date": 20181126
    },
    {
      "title": "It didn’t close easily as it seemed misaligned",
      "text": "I was not a fan of this basket. It didn’t close easily as it seemed misaligned. It also didn’t fit well into my dishwasher so it was tough to find a good spot for it - it was a bit wider than most rows on the top of my washer (new kitchen aid). I found it cumbersome to open and close and get parts in and out easily with one hand. I ended up purchasing another brand with a silicone top and slit to just push parts in - and I love it!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "I wish I had two of these",
      "text": "I bought two different brands of dishwasher baskets for my baby's bottles and accessories. I wish I had just bought two of these. The only problem is they don't accommodate the dr browns tubes very well. You can wedge them in but then it blocks the bottom from being used efficiently. But I still like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nidanracni",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Must Have",
      "text": "For anyone that uses bottles or sippy cups, this is a must. Just pop all the parts into this baby and place it on the top rack of your dishwasher and you're good to go. Seriously the easiest way to give them a deep clean without losing or melting components.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley M.",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "BEST Dishwasher Basket",
      "text": "This is the best dishwasher basket. We've tried a few other brands, but this has been my favorite. It has spaces for nipples (bottles and sippy cups) and the basket holds other items. There are even spaces/holders for straws! I'll be buying this for all my friends when they have babies.",
      "rating": 5.0,
      "verified": true,
      "author": "Twincess Mama",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Good for nipples and lids",
      "text": "Life got easier when we started using this! Pros: bottle nipples and lids are cleaned easily and completely in this basket. It fits nicely on the top rack of our dishwasher. Cons: the Dr. Brown bottle straws do not fit inside. The lid feels a bit janky when you close it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jedidiah62",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Sturdy holder for small plastic items",
      "text": "Got this after a plastic lid fell onto the dishwasher’s drying element and burned up. Left a terrible smell and the element had to be replaced. Fits perfectly on the top rack and holds all the small plastic items. Easy to remove when not needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sttomper",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Must have for every new parent",
      "text": "I love everything almost about this. Medicine syringes will fall through the holes, but everything else, even straws, stay secure while inside the dishwasher. It's a little wide, so it sits sideways in my top rack - make sure it will fit in your dishwasher before you purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Dreamcrusher",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Life changing! It took such a weight off.",
      "text": "I cannot give this product enough stars. It saved my life! My son has Cystic Fibrosis, so he has some extra bells and whistles with his bottles and being able to throw everything in the dishwasher and sterilize it helps put my mind at ease. Been using this for 4 months and is holding up beautifully! I also use this for pacifiers, teethers, contact lenses cases, sealing discs for bottles..... Anything really",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "I'm so glad I chose this one!",
      "text": "I'm really glad that I chose this dishwasher basket. It's very sturdy and good quality with a lot of space for baby bottle parts etc. I recently saw a MUnchkin brand one in the store and I could tell that it was inferior quality. Buy this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Game changer!",
      "text": "This basket was a game changer and I do not know why I didn't buy it sooner. We use Dr. Brown's bottles and I exclusively pump which means LOTS of bottles/parts. This basket has made my life so much easier and I use it daily. Definitely get it- no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Very practical, easy to use",
      "text": "This basket is wonderful! My favorite part about this one, as opposed to others, is the nipple compartment up top. It makes it so that the nipples get cleaned well, but also saves room in the main compartment for all the bigger/bulkier items. I'm kind of bummed I bought two different baskets, rather than two of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Great for 360 Cup Lids",
      "text": "Had a bit of trouble at first fitting it in the dishwasher, but found just setting it on the top rack worked just fine. Our daughter uses the 360 cups and this allows us to sanitize the kids as well as the silicone insert separately.",
      "rating": 5.0,
      "verified": true,
      "author": "CindyRu",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Very smart design!!",
      "text": "I am so happy with this dishwasher basket! There are special compartments for bottle nipples, straws for sippy cups, and an open compartment for other small items. Everything comes out much cleaner when I use this basket in the top rack of the dishwasher! Great for small bottle and pumping parts. I wish I'd had this one for my first child!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Doesn’t fit all nipples",
      "text": "It’s works just alright... my complaints: 1. The lid doesn’t snap very securely - I tipped it upside down over the sink to get some water out and the lid opened which made the contents spill into the sink 2. We use the munchin latch bottles which have pretty big (tall and wide) nipples and I find they don’t quite fit into the designated nipple area on this. Other than those two things it’s fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Close to perfect.",
      "text": "Nipples fit in top perfectly, bottle pieces fit in the cage below. It creates great flow to get everything washed efficiently. My only complaint is it is a tad too wide, and I have to wedge it in the top rack, making on of the flaps not able to open. Everything still cleans fine, just a little inconvenient but still worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rikki",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Bottle-fed baby must-have!",
      "text": "I used this for baby bottle parts and sippy parts in the dishwasher. I originally thought it was too big, but it ended up being the perfect size. I leave it in the dishwasher and add parts as they are used. It allows the water and soap to clean all the parts. Very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie A. Bauer",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Works well",
      "text": "I’ve had this for at least a month and it has been working well. We use it for the parts of my child’s Munchkin brand sippy cups. It easily holds all of the parts for up to 6 of those cups. I like that it’s longer, because it makes it possible for three cup lids to fit next to each other without overlap. We do two stacks of three lids and put the rubber spouts in the slots up top.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Overall Good - Except for Holding Chopsticks",
      "text": "I think it’s pretty good so far and fits well with dishwasher. If you’re using it with only knifes / utensils it’s pretty good. The only thing for me is when I put chopsticks into them they might fall out occasionally if you are pulling the dishwasher multiple times before running it, since the holes on the side are much bigger so you might need a separate one for them. But overall I’m good with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Zac",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Pretty good",
      "text": "I needed a basket for Dr Brown pieces but the Dr Brown brand basket doesn't hold very many pieces at a time. One of the plastic pieces on the side broke in the box. I found the top tough to open at first. I didn't think that the long vent piece from the Dr Brown options bottles would fit in this. But if you flip the straw holders up and put them in here with the mouth of the vent piece down then it fits.",
      "rating": 4.0,
      "verified": true,
      "author": "Lo",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "GREAT!!",
      "text": "So glad we bought this product! We use it every night to wash our dr. Brown bottles in the dishwasher cause those bottles are horrible to hand wash and have so many pieces. This basket easily fits all the pieces to 6 bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Albert",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Kind of flimsy but does the job",
      "text": "While this has been great for washing bottle parts, the hinged top pieces aren't very sturdy. At least one of them comes off every time I open the basket. It does fit my 18\" dishwasher's top rack perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "PageTurner",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Almost perfect.",
      "text": "This basket works great for washing little Sistema dressing containers. Those things get blasted every which way by our dishwasher, but the basket keeps them contained. I wish it was just slightly smaller -- it barely fits in the top rack.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark S",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Definitely not for chopsticks",
      "text": "Okay/good product. Cons: Takes up a lot of space in dishwasher Definitely not good for chopsticks Tabs are useless I bought this specifically for chopsticks but I'm not going to give it a bad review just because it didn't suit my needs. Chopsticks fall all over the place.",
      "rating": 4.0,
      "verified": true,
      "author": "MTA Eddie",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great little basket",
      "text": "So much better than the Dr. brown one. When I moved out of our rental house I left my oxo basket in the dishwasher and I had to get a replacement! It’s perfect for all different type of bottle parts, syringes, pacifiers.",
      "rating": 5.0,
      "verified": true,
      "author": "mircat",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Too small for pump parts",
      "text": "I use pumpin pals and maymom Spectra adapters that I need to wash daily. It has room for one set only, so could work only if you don’t pump that often. I have two sets I rotate so it doesn’t work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "ReeViews",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "VERSATILE DESIGN",
      "text": "This is a great size for pet food lids, mixer beaters, knives and small items that might get damaged if put in the silverware holder. The lid is in two parts and open out. The lids have a long \"pocket\" for things like paring knives. It also has TWO fold down straw racks (one at each end). This is really quite clever in design. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle CustomerTop Contributor: Sewing",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Perfect",
      "text": "This basket is great! Works for pump parts as well as bottle parts and sippy cups. Great for both dishwasher and drying rack so that small proves don’t fall through the grates. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Dani O",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Retains all the parts and they get clean.",
      "text": "Used for cleaning nebulizer parts in dishwasher. It doesn fit in my top drawer so have it below. It fits well enough to work, but is a bit awkward to get the things inside. The top closure is wonky. It does retain all the parts, and they do get clean. That’s the point, no?",
      "rating": 4.0,
      "verified": true,
      "author": "Kate  Smith",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Needed this thing sooner love it",
      "text": "Amazing wish I knew sooner the CDC says sanitizing in the dishwasher was ok so I would of saved time sooner washing bottles and and sterilizing them microwave wasn't necessary . This thing works great for my madela nipples flanges and Avent pacifier high ly recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Great for pump parts!",
      "text": "Perfect for bottles, pacifiers, and pump parts! Great size and durability. I especially like the way the top rack opens. Makes for easy use.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "No more hand washing or scrubbing.",
      "text": "This item works great for washing our grand baby’s bottles in the dishwasher. We rinse with soap and water then into the basket. We do still sterilize the bottles using distilled water. Our community has hard water.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Not big enough for pump parts",
      "text": "Given that the product description includes pump parts, I would have thought the item would be deeper. It barely fits one shield from a breast pump if you angle it correctly. It’s a good product for nipples and bottle toppers but if you are buying like me to machine wash your pumping gear you can’t fit a single set of pieces (Medela pump) in this basket at one time.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer W",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Must have for new parents",
      "text": "This basket is a necessity if you are washing bottles, pacifiers, baby toys, etc. regularly. It saves me so much time to be able to throw all of these items in the dishwasher. It is also bigger than most dishwasher baskets which is a big plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy R.",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Alright for now",
      "text": "Works alright for chopsticks and steak knives. the chopsticks slide through the holes if you're not careful, but it's the perfect length. barely fit in our dishwasher though, and the lid is a little too thick and tall",
      "rating": 3.0,
      "verified": true,
      "author": "Seri",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "does what it's made to do",
      "text": "I bought this for my ramekins and other small dishes. It fits well in the dishwasher and my dishes got clean. It was kinda hard for me to get open which I guess is a good thing since I don't want it open during a cycle.",
      "rating": 5.0,
      "verified": true,
      "author": "emily",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Very nice quality, works great for non-baby items, too!",
      "text": "I actually purchased this to use to put my Keurig filter parts thru my dishwasher. It works great for small, dishwasher safe items the would fall through the top rack otherwise. Works perfectly for what I needed. Fits great in my dishwasher rack, too, and is well made. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "SusanS",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Works well, recommend!",
      "text": "Great for cleaning Dr. Brown's bottles! I use this one and another one to wash all the lids, nipples and vent accessories for my baby bottles and pumping collection cups/bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara J",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "As expected",
      "text": "I bought this to wash those small items in the dishwasher. Does just what its suppose to. Seems to be pretty sturdy. I am expecting another grandchild so I will most likely use it for that too.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Allison",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Great basket",
      "text": "This dishwasher basket is great. I bought two for my dishwasher and am pleased with them. I’ve been using them everyday for the last month with no signs of wear. I think they’ll hold up well. I love that they have a smaller compartment on top for smaller items.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendra M",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Works great for baby bottle / pump parts",
      "text": "This basket works well. I have not tried the straw holder yet. The basket is just a little bit narrow for Phillips Avent / Tommee Tippee nipples, so you have to squish them just slightly to get both sides closed all the way. I haven’t had an issue with this though.",
      "rating": 5.0,
      "verified": true,
      "author": "lenergyrlah",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Must have for busy parents",
      "text": "We have toddler twins and a newborn so we have zero time to wash bottles! This has been a lifesaver! I love the design and how the nipples are stored in the lid! I wish we would have gotten these for our twins because I know it would have lasted!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Excellent product",
      "text": "Have been using for 6 months now no issues I wash multiple loads of bottles each day these have held up nicely would highly recommend I have dr browns bottles and parts fit perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandria P.",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Bad design",
      "text": "It’s a little hard / large to put in dish washer to wash small items, hard to open and for me it’s just a bad design. Engineer trying to make a better mouse trap that didn’t work.",
      "rating": 2.0,
      "verified": true,
      "author": "5751 Jackson Georgia",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Poor fit in dishwasher",
      "text": "Great idea but doesn't fit well in my dishwasher. Have to put it in the bottom for it to fit well. And I have a typical size dishwasher. I feel like I could easily put everything that I put in it just on the top rack without using this and not lose much more space. However it does fit 8 of the Avent natural nipples well .",
      "rating": 3.0,
      "verified": true,
      "author": "mj",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "So convenient. Saved me from losing my marbles!",
      "text": "If you have Dr. Brown’s bottles you KNOW how annoying washing all of the pieces is. Now imagine washing bottles for triplets. I was miserable lol. This literally saved me so much time and my sanity. I bought two and let me tell it’s so easy and convenient to use. It doesn’t really sit in my dishwasher well but it doesn’t really matter. It works just as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Itssyd ",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Great for Dr browns bottles!",
      "text": "It has all the right compartments for all the pieces that come with Dr browns bottles. It’s a great way to keep everything together in the dishwasher! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Hoekema",
      "helpful_votes": 0,
      "publication_date": 20201004
    }
  ],
  "product_meta": {
    "title": "OXO Tot Dishwasher Basket for Bottle Parts & Accessories, Teal",
    "description": "Color:TealTired of losing bottle nipples, sippy cup parts, detachable straws and removable valves in the dishwasher? Try the OXO Tot Dishwasher Basket. The doors of the Dishwasher Basket accommodate up to 8 bottle nipples and open symmetrically to help prevent toppling during loading and unloading. Internal flip down straw holders keep sippy cut straws secure and upright (not lost and melted) for proper cleaning. Basket is space efficient to maximize the number of items that can be cleaned at once. Dishwasher safe.",
    "rating": 4.7,
    "feature_bullets": [
      "Holds small parts for baby bottles, sippy cups, straw cups and more for safe and thorough dishwashing",
      "Symmetrical door opening helps Basket sit securely on countertop when loading and unloading",
      "Doors accommodate up to 8 baby bottle nipples",
      "Flip down straw holders hold sippy cup straws upright to assist with cleaning",
      "Material: Plastic. BPA free"
    ],
    "specifications": {
      "Product Dimensions": "11.13 x 4.5 x 4.13 inches",
      "Item model number": "62123700",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Material Type": "Plastic",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Item Weight": "8 ounces",
      "ASIN": "B0771FFJ21",
      "Customer Reviews": "4.7 out of 5 stars2,309 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#659 in Baby"
    },
    "categories": [
      "Bottle-Feeding",
      "Baby Products",
      "Bottle Accessories",
      "Baby",
      "Feeding"
    ],
    "price": 9.99
  }
}