{
  "website_summaries": [
    {
      "verdict": "This conveniently-sized and lightweight 12-volt compressor is made from ABS plastic and stainless steel for long-lasting durability.",
      "pros": [
        "High-quality materials can stand up to abuse, and low noise level of <50dB will save your ears over time",
        "1.24 CFM inflation speed is impressive for consumer-grade product, able to fill a standard tire in 3 to 5 minutes",
        "Maximum pressure of tire inflator is 150 PSI",
        "Comes with adapters for other inflatables"
      ],
      "cons": [
        "Complaints about blown cigarette lighter fuses raise concerns about electrical shorts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Compact Tire Inflator",
      "text": "My old tire pump finally died (after 15 years) and I searched for a while for a new one. I like to keep one in the car just in case. Received this item promptly through Amazon prime. My husband finally had the opportunity to use it and he was really impressed. Inflated the tire quickly without hassle. You can set the pressure and it will turn off when has it inflated to the correct psi. I love that it come with great storage bag and it is compact and light. Very easy to store in the car. I would definitely recommend this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayliemac",
      "helpful_votes": 82,
      "publication_date": 20180227
    },
    {
      "title": "Simply AMAZING",
      "text": "I am so pleased with this pump. It is a must have for every car out there. Out with the old bulky compressor in your garage. This is a compressor everyone can use , all it takes is two buttons its amazing. I pumped my tires in my SUV and Sedan with so much ease that I will buy 2 or 3 more of these, absolutely so handy love it. And so small that its almost the size of a phone. It also has a nifty flashlight and digital display in case of emergency when pumping at night. It will save you from so much trouble and money .",
      "rating": 5.0,
      "verified": true,
      "author": "Emre URGENC",
      "helpful_votes": 62,
      "publication_date": 20180825
    },
    {
      "title": "Great pump to keep in trunk",
      "text": "I had a small pump to keep tires inflated but it was 120V house current only. Decided to get this 12V pump so that it is always in car trunk. Now I can adjust pressure whenever I need -- like when I go to snow country and the temperature is 30 degrees colder leaving tires under-inflated. ALSO - Now I know that when I need my neglected spare tire due to flat, I can pump it up to the required 60 psi. This pump is great. I set the desired pressure and all four tires get perfectly inflated. So easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Torch",
      "helpful_votes": 49,
      "publication_date": 20181014
    },
    {
      "title": "Very easy to use",
      "text": "Very easy to use. This comes with a long cord which is great. Many air compressors have shorter cords which are not long enough. One minor dissatisfaction is that the LED readout is very faint for the \"type\" of air measurement selected such as PSI, Bar, etc. That could be darker and easier to read. The actual numeric readout is fine. The unit is easy to hook up and stops when the right air level is achieved. Light weight, normal sound level, and attractive red & black color.",
      "rating": 5.0,
      "verified": true,
      "author": "Astute1000",
      "helpful_votes": 49,
      "publication_date": 20180213
    },
    {
      "title": "Arrived broken, cheap construction.",
      "text": "It arrived broken, with lots of pieces rattling around inside. I opened it up to see what the pieces were. They were mostly plastic supports that had broken from their molding. Arriving broken happens sometimes, so that is not the basis of the one star. It is the cheap construction I found inside, providing meager and thin support for the heavy pump pieces. I am not surprised that it arrived broken. I decided to buy a different one after sending this one back.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Adler",
      "helpful_votes": 30,
      "publication_date": 20180915
    },
    {
      "title": "Only worked once",
      "text": "Only worked once fine. Thought it was going to last but no. Tried to use it for a second time and it just died. Check your item as soon as you get it if you plan on buying it.",
      "rating": 1.0,
      "verified": true,
      "author": "Luis R Del Castillo",
      "helpful_votes": 26,
      "publication_date": 20181107
    },
    {
      "title": "Small but powerful",
      "text": "I bought 2 of these since my first one went to my other car. Very good quality for this air compressor. It's light and quick to adjust tire pressure. Having the digital readout, I don't have to take off the hose and test the pressure manually with a gauge. Easy to set the pressure you want to set it to as well and automatically stops once set pressure is reached. Overall I would recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward B.",
      "helpful_votes": 40,
      "publication_date": 20180909
    },
    {
      "title": "Its OK, wont buy again",
      "text": "Arrived in large padded envelope promptly in 2 day prime shipment. Display box a bit crushed, but content undamaged. Pump design is pretty but plastic color and quality is not good and not bad. Pump works well. Clamp to tire valve was a nice grip, but hose will barely reach if valve is high, need to rotate tire to reach 19\" tire, this is no big problem. Both hose and wire coils up and tucks under pump. Pressure gauge reads 1.5psi higher than my dial pressure gauge. Pump automatically shuts off 0.5psi above set pressure. Noise is acceptable, but not quiet. Its not bad enough to return. Its a nice design but plastic quality is not good. Picture looks nicer.",
      "rating": 3.0,
      "verified": true,
      "author": "Peterm",
      "helpful_votes": 16,
      "publication_date": 20181017
    },
    {
      "title": "WORKED GREAT FOR ALMOST 2 YEARS",
      "text": "I used this almost exclusively to inflate bike tires, not terribly often. After less than 2 years, it suddenly died. I don't necessarily expect things like this to last terribly long, but I think 5 years would be reasonable. I just ordered a different brand for about $8 less.",
      "rating": 2.0,
      "verified": true,
      "author": "skangirl",
      "helpful_votes": 22,
      "publication_date": 20180622
    },
    {
      "title": "Can’t believe it doesn’t work on the first try!",
      "text": "I purchased this product then on my 1st ever use of it, it does not work. I contacted customer service and they want me to change the fuse! Why the hell should I have to change the fuse the 1st time I use it?",
      "rating": 1.0,
      "verified": true,
      "author": "Jeong H. Ko",
      "helpful_votes": 22,
      "publication_date": 20181001
    },
    {
      "title": "Worked for less than 1 minute....but customer service was excellent",
      "text": "First time plugged in lasted for less than 1 minute then started making a high pitched whining sound without pumping any air. I don't believe they tested this device before shipping else would of never shipped it. Helteko says that fuse burnt out but don't believe that to be the case since unit is still making noise and compressor seems to be trying to pump air. If fuse would of burnt out then the unit would be silent. Helteko customer service is excellent. They replaced the unit without any further questions and wanted to make sure I got a good unit. The new unit works fine although I don't use it that often.",
      "rating": 3.0,
      "verified": true,
      "author": "All American Consumer",
      "helpful_votes": 12,
      "publication_date": 20181028
    },
    {
      "title": "Broke my 12V slot",
      "text": "As soon as I went to inflate a tire, the digital meter shoots the PSI to 100+ reading and then the device shuts off. Also as this happened the 12V slot in my car got burned out. I am quite furious because now I have a broken 12V slot a flat tire...I will fix this review as soon as they pay for the broken 12V slot and reimbursement for the new compressor. +++ Company quickly responded and said they would help pay for the 12V slot. Thanks for great support!",
      "rating": 4.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 12,
      "publication_date": 20181212
    },
    {
      "title": "Go to Helteko!",
      "text": "It’s a typical cheap 12v compressor. Really loud, vibrates a lot, incredibly junky hose and chuck, about what I’d expect for the price I guess. The pressure shutoff seems to work well however and the plastic case seems a little more robust than average. Overall it’s fine, good enough to keep in the trunk for periodic emergency use.",
      "rating": 3.0,
      "verified": true,
      "author": "KBeagle",
      "helpful_votes": 10,
      "publication_date": 20180709
    },
    {
      "title": "Best travel air pump",
      "text": "Excellent use when losing air in is tyre .. plug into car lighter and all you’re all set.. wire length enough to reach all 4 tires in an accord",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Danda",
      "helpful_votes": 40,
      "publication_date": 20200308
    },
    {
      "title": "Easy to use, solid product",
      "text": "Easy to use. Long 12v cord with a plug that stays firmly in the socket when plugged in. The PSI gauge is accurate and you can also toggle between other units of air pressure as well. I also like the quick release which keeps the loss of air when disengaging from the tire to a minimum if at all. Also comes with adapters to inflate other items such as inflatable toys, footballs, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Bilco",
      "helpful_votes": 10,
      "publication_date": 20180404
    },
    {
      "title": "May be fine for small projects",
      "text": "Product was only able to inflate two tires before it's functioning ceased",
      "rating": 1.0,
      "verified": true,
      "author": "Carl Mahler",
      "helpful_votes": 14,
      "publication_date": 20181121
    },
    {
      "title": "Super easy and convenient",
      "text": "Wow, I have to leave a review for whoever is lacking knowledge of your car, and you desperately needed to refill tire air! I didn’t know how to use this at beginning and wanted to return very bad, but fortunately I was too busy to do so and today finally I can’t stand my “flat tire” and checked out the videos amazon uploaded, and this product is able to automatically test the tire pressure and automatic stop when reach the right pressure, I was doing that while it’s dark outside and I accidentally lost the little cap, and the Light installation is great idea!!! You must have it for a daily check up!",
      "rating": 5.0,
      "verified": true,
      "author": "veronica",
      "helpful_votes": 30,
      "publication_date": 20191104
    },
    {
      "title": "Worked great...about 10 times",
      "text": "This little pump worked really well...as long as it worked, which turned out to be about 10 times. I'm hoping the seller reaches out to me so we can see about a replacement. Something like this shouldn't crap out in less than 30 days. Help a brother out!",
      "rating": 2.0,
      "verified": true,
      "author": "Roy Griffis",
      "helpful_votes": 6,
      "publication_date": 20181117
    },
    {
      "title": "No power",
      "text": "I don't know if any of the other ones are any different, but this took forever to blow up a pool float. I wanted this to put in my car in case I ever have a low tire and I could air it up to get where I need to go. I don't think you would ever get a tire inflated, and if you did, it would take forever! There is an automatic shut off at 10 min. Not sure how long before it would cool down and could be used again. But it's going to take forever. I just don't see this working for much",
      "rating": 1.0,
      "verified": true,
      "author": "UTEL",
      "helpful_votes": 2,
      "publication_date": 20200713
    },
    {
      "title": "Calibration is off.  Way off!",
      "text": "After a few weeks of working as expected, the calibration of this product is now off - way off! The PSI is reads is much higher than in should be. For example, multiple tire gauges show that my tires were at 25 psi (and thus in need of inflating). However, this product shows 75 psi and shuts off automatically (because I set it to fill the tire at 35 psi). This is a serious defect of the product and should be avoided.",
      "rating": 1.0,
      "verified": true,
      "author": "Y. Lee",
      "helpful_votes": 2,
      "publication_date": 20190928
    },
    {
      "title": "Fast and easy to use!",
      "text": "This thing is awesome! I’ve used others that were so slow they essentially didn’t work. This is fast - maybe 45 seconds per pound of pressure. No time st all to top up all the tires in my Mini. Compact, lightweight but feels sturdy enough. Very easy to use, except the instructions for attaching it to the tire valve stem are poorly written and not illustrated. The “button” to seal it is a lever, not just a button. Pull it out, attach to the valve stem, then push it in to seal. A great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Satterlee",
      "helpful_votes": 3,
      "publication_date": 20180905
    },
    {
      "title": "Useful but beware of flimsy plastic locking lever",
      "text": "*Update* They sent me a replacement unit. While a bit on the loud side, it gets the job done and the cords are long enough. The hose gets rather hot but that's to be expected from pumping all that air. Hopefully this one lasts longer than the first unit. I've probably used this thing twice and on the third use I realized the plastic lever at the nozzle had broken off. Now it cannot create a seal around the car tire valve and will not function. I might have to dismantle it and see if I can replace the whole hose.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian W.",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Epic",
      "text": "I had a product similar to this, but it used an analog meter and was extremely loud. This product is virtually silent (somehow, I don't know how) and provides a clear digital display. It can read the tire pressure instantly and automatically stops at a desired set pressure. With this I can easily fill my tires to the exact pressure I want. The only problem I had is that the power/start pressure button is a push button. You have to push it to start, but when the device automatically stops, the button remains in the \"on\" position. So to fill another tire you have to reset this button. Minor inconvenience. Overall, great product and great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "portable and convenient; a good buy",
      "text": "This compressor is small enough to leave in the trunk and after parking for a bike ride, if the bike tires are low it only takes a few minutes to top them off. The compressor is easy to use, even in full sunlight the LED display is visible, and it is quick at filling tires. I've had other 12volt compressors, and they were all annoyingly noisy and really slow, this one is an exception, when it is running the noise is acceptable and it doesn't take long. Plus, you don't have to sit right next to it and watch the pressure, because you set the desired pressure first and it will shut-off automatically.",
      "rating": 5.0,
      "verified": true,
      "author": "kix",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Nice and small while still powerful",
      "text": "I love how small this is... it's comparable in size to 2 sandwich containers stacked on top of each other. STEPS... 1. Plug it into your car 2. Attach it to your tire and then lock it on by pushing the little lever down 3. The LED display automatically shows you the current PSI of your tire. You can also change the unit of measurement to something other than PSI if you wish. 4. Press the plus symbol button a bunch of times until the display shows your desired PSI 5. Press the power button and it starts filling your tire with air 6. It automatically stops filling air once it gets to your desired PSI",
      "rating": 5.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great product. Multi purpose. Very portable. Essential for everyone. Great price",
      "text": "I got this product because one of my Cars was giving me trouble with tire pressure. I am glad that i got this product. It is a great tool to have for evry car owner. Pro: ** long cord ** minimalistic ** comes with storage bag and spare sockets ** great price ** digital pressure reading display ** additional flash light integrated ** very portable ** multi purpose usage Con: Couldn’t think of that many cons of this product I wish the flashlight would be more brighter",
      "rating": 5.0,
      "verified": true,
      "author": "Mohammad Khan",
      "helpful_votes": 27,
      "publication_date": 20200912
    },
    {
      "title": "Simplicity itself",
      "text": "I've used this new tire inflator a number of times already since I bought it recently - and I like it because it is fairly quiet, and very easy to use. It remembers the last setting you used, and automatically turns-off when the set-pressure is reached. How easy is that? It's also very easy to dial the pressure up and down - just a few clicks. I registered for the 18 month warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "R. G. W. Brown",
      "helpful_votes": 3,
      "publication_date": 20180901
    },
    {
      "title": "Worked okay upon initial use",
      "text": "I found the accuracy off a bit ~1 psi. I compared the reading to a high quality air pressure tester. As far as I'm concerned, I'm fine with this slight inaccuracy as long as I know what the psi actually is, regardless of what the gauge on this pump reads. I never trusted gauges on previous portable pumps I've used, so why would I start with this one. The built-in light could be useful. If this pump continues to inflate things, I'm happy. Also - register the product within 30 days of purchase and the warranty is 18 months. That's not a bad thing.",
      "rating": 5.0,
      "verified": true,
      "author": "misstSubo",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Broke after a few uses, but easy fix.",
      "text": "After a few uses, the compressor made a high pitched rattling sound and just runs with no increase in tire pressure. This was for a car tire requiring 44 psi. I could hear something jiggling around so I took it apart and noticed both screws that hold the motor onto the gear came out. I screwed them back in with some glue. Works fine now.",
      "rating": 3.0,
      "verified": true,
      "author": "F. Weiss",
      "helpful_votes": 2,
      "publication_date": 20190904
    },
    {
      "title": "Great customer service",
      "text": "This is a great little product. It is so easy to fill our tires when needed. Aftet 11 months the lighter part fell out and we could not find it, emailed customer service they got back to us right away seems said they were sorry and would take care of it right away.5 days later we got a whole new unit.david who was our service guy followed up and asked if we got the unit and that it wa fine. I wish all companies were this accountable for their products. I would not hesitate to buy this again, and i probably will get another one for my trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Useless",
      "text": "Possibly one of the worst purchases I’ve made on amazon. My truck tires take 80 lbs of air in the back. I know it is hard on small pumps. It usually takes a couple days to get the pressure up to 80 when I rotate the tires. I read the directions and set the timer on my phone for 8 minutes. Supposed to have a 10 minute run time. At 7 minutes and 48 seconds the hose blew off rendering the unit useless.",
      "rating": 1.0,
      "verified": true,
      "author": "CK in Virginia",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Works Great (1 Year Review) (Pros and Cons)",
      "text": "Pros: - Carrying case is nice to have - Small yet powerful enough to get job done fast - Cord length is long enough to reach all tires with no problem on my Acura CL and my Honda Minivan. Cons: - Pumps 1psi higher than it says on screen, but if you set it 0.5-1.0 psi lower then you should be fine. - The hose that moves the air to the tire gets very hot after pumping up 2 wheels, but let that be the deciding of factor alone (it is not NOT hot enough to cause fire). Overall, this is a must but from me. I would definitely buy another one if needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Exceeded expectations",
      "text": "This unit exceeded my expectations. It not only read the current tire pressure accurately but it also inflated it accurately as well. Follow the instructions carefully and it will work like a charm. Makes sure you wait the three seconds before you press the power button to start inflating. I was also expecting to take forever to inflate the tire based on the size of the unit but it inflated my tire from 25 PSI to 42 PSI in 3-4 minutes. I could not rate the light accurately as I tested it during the day. However if you are in need of it at night, I am sure something is better than nothing.",
      "rating": 5.0,
      "verified": true,
      "author": "GasCan",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great as long as hose stays attached.",
      "text": "This is a great little pump. The reason for the 3 star review is that the pump hose is just crimped to the pump and leaks and pulls off easily. I had to disassemble it, cut off the crimp fitting on the hose and re-attach the hose to the pump with a small hose clamp. Better than new because it doesn't have a slow leak now. If not for this issue I would give it 5 stars",
      "rating": 3.0,
      "verified": true,
      "author": "TPM",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great Compressor for my Truck",
      "text": "I do a lot of local travel for my job. Of course, Covid cut that back for awhile, but now that I'm getting back on the road, I wanted to make sure I had a portable compressor just in case. I tried it out this weekend, and was very happy with the results. I own a Tundra, and had to issues reaching the tires. They give you plenty of cord length. The unit tells you what your current pressure is, then you choose the pressure you want, and hit the on button. It then turns off when it's done. I used my pressure gauge and everything appears to be on the money. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mvonrohr",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great little portable air compressor!",
      "text": "This little unit has held up well so far. I've used it to balance the air pressure in my car tires several times. It does heat up a bit during continuous use, so be careful to let it cool down. It has great pressure (150psi), is relatively easy to use (minus the fact that after you set the pressure setpoint, it blinks and then display 0.0 psi--minor annoyance, not a big deal to me), and comes with a nice zippered case. It's nice to get the HOTOR 8.5A 100W 110-220V AC to DC converter with this so you can plug it into a wall outlet (sometimes it's easier to deal with than fiddling with the cigarette lighter in the car).",
      "rating": 5.0,
      "verified": true,
      "author": "Chewie",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Works like a charm!",
      "text": "Worked like a charm. I've never quite been able to master those annoying air pumps at the gas station. I cannot count the times i've lost all my money with no air to show for it. I finally decided there had to be an easier way and asked my dear friend 'google' which led to my other BFF 'Amazon' I'm an older lady who is clueless with cars, but within 15 minutes of this thing arriving on my doorstep all my tires were nicely pumped. The reading was exactly the same as my cars. Like someone else said it does stop .5 over what you enter in as your chosen PSI but i wouldn't lose sleep over that.",
      "rating": 5.0,
      "verified": true,
      "author": "DivaMomof2",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "It works, but for the prices, theres better",
      "text": "Decent, but theres better. Comparing to a $25 harbor frieght alum cyl looking pump. This is louder, and pumps slower. The light would be nice if it faced the same way as the air line. The digital readout is nice, but the buttons are not lit. Which is a shame. Nor do they light when you turn the light on. The pump stops 1psi above the setpoint. The buttons are not great. I had to push the power button several times before the pump started.",
      "rating": 3.0,
      "verified": true,
      "author": "p4killer",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "So far so good!",
      "text": "This thing worked great and easy to use, I followed instructions. Set the psi and let it go to work. Stopped when reached desired psi. Saved me a trip and line at the tire store and I’m sure will come in handy in emergency situations for me or for fellow pedestrians in need of help. Awesome! Will update if anything changes, as the psi leaks quite a bit during the winter months. Thanks Helteko.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 9,
      "publication_date": 20190105
    },
    {
      "title": "Stay Away From This Product!!!",
      "text": "I was excited to receive this. I needed to pump tires on both of my vehicles. I unboxed it, followed the instructions and began to pump one of my tires. First off, the digital sensor was WAY OFF in reading what my current tire pressure was. Then after I started to inflate the machine started to struggle and just died. I pulled the power out of the outlet and it was beginning to melt and I smelled the burning plastic. It felt and smelt as if it could have caught fire. My experience with this product is that it’s the worst air compressor I’ve ever used!",
      "rating": 1.0,
      "verified": true,
      "author": "Monica Hoefel",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "So useful it lives in my car",
      "text": "I am one of those people... too anxious to ever use the public air pumps at the local gas station. I used an old roommate's that had something similar and I did not realize it was something I HAD to HAVE in my life. Amazing invention and, honestly, so worth the money. The controls were just a little bit confusing at first even though there is only one button really, but once you get past that the on/off button needs to be pressed twice, then you are golden. I now keep it in my car especially because I suspect I have a slow leak on one of my fairly new tires. This is a lifesaver.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Good price/benefit ratio. Nice auto-shut off function",
      "text": "In general, I’m happy with this product!. Pros: *Auto shut-off when preset pressure is reached (it stops 0.5psi above to compensate for plug in/off losses). *Almost no vibration. *Lower noise than older compressors. *Good price/benefit ratio. *Percentage of defective units (lemons) is quite low compared to other compressors. Cons: *It would be nice if accuracy was 0.1psi instesd of 0.5psi. *Power and light buttons cannot be seen in the dark. It would be nice if they were lighted or fluorescent. *Cable cannot be stowed in the body of the compressor, and The space to stow the hose is too tight for it; it looks like it will get damaged if its constantly stowed there.",
      "rating": 4.0,
      "verified": true,
      "author": "Daherote",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Amazing product",
      "text": "Before this product, I used to have an air inflater which worked well but it had a nasty problem. To connect the air inflater's pipe with the tire, it required twisting and my car's tire had a narrow space to do the twisting and this resulted in me always having my index finger bruised after filling the air in 4 tires. But this one, it's just a click, no twisting!! And it performs all the other functions like reading tirr pressure, auto shut off and others perfectly. Overall, very much satisfied with the quality of the product. It's just a day, hope it stays durable and lasts long.",
      "rating": 5.0,
      "verified": true,
      "author": "Punit Oza",
      "helpful_votes": 4,
      "publication_date": 20180824
    },
    {
      "title": "Lives up to expectations.",
      "text": "The compressor filled my SUV tires from 26-35psi quickly. Also, it isn't as loud as my old one was. The cord is long enough to reach all the tires. The instructions weren't very clear as to how to start the compressor to begin filling, but I figured it out. I've only used it once, so time will tell how well it holds up over the long run. The carrying case makes it very easy to store on a shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180329
    },
    {
      "title": "i'm dissapointed",
      "text": "I should of bought this a long time ago..love it love it love it!!!! <- That's how I felt when first time use. in less than 3 weeks I tried again and it broke the air tube/pipe detached from the machine. The tire that was pumped all the psi was way wayyy high from what I set up. it was a nighmare driving with tires that are way over pumps.",
      "rating": 1.0,
      "verified": true,
      "author": "MissBeebly7",
      "helpful_votes": 4,
      "publication_date": 20200513
    },
    {
      "title": "Does its job well",
      "text": "Does the job well. I have used other products, all had issues such as vibrated so hard the unit could not be set on the ground, not accurate, very loud, long inflation time, short cords, bulky and hard to store... The Helteko has none of these issues. It consistently inflates an extra 0.5 pound, which is probably to allow for pressure lost when disengaging. I have used it on a daily basis for two weeks (tire has slow leak, no time to get it fix now) on my Subaru Outback.",
      "rating": 5.0,
      "verified": true,
      "author": "DebraLee",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "cheaply made, poor quality hose",
      "text": "Worked good for about a year, used it a dozen or more times on several vehicles, automatic pressure stop worked well. The hose is cheap (made in China) and sprung a leak at one of the bends. I was able to repair it but then a couple of uses later, the hose came dislodged at the base inside the unit. I took it apart and tried to repair it several times, but it would not hold, probably do to the vibration and extreme heat that it generates. I already bought another one for my son before this one broke, hope it holds up better than this one did. Will not buy again and do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "imjustsayin",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "It works FAST!!",
      "text": "My tire was going flat so I jumped onto Amazon and ordered an affordable portable tire inflator. It arrived the very next day [today] and took less than 3 minutes to put my tire that was 13.5 pounds up to the required 33 pounds of air. This thing is great! It seems like every gas station I went to had an 'out of order' air machine. This was a perfect purchase and gives me great peace of mind. I will definitely keep it in my car. Oh..and I also love the fact that it connects to the adapter in your car and does not need a battery! I recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Arnold",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great Product and Customer Service!",
      "text": "Based on my research, this inflator is an excellent choice. You can set the pressure and the inflator will automatically turn off when has it inflated to the correct PSI. It is very compact unit with a nice cord length, has well-lit readout display, stores easily, has a nice flashlight, and convenient storage bag. Helteko's (Emma) customer service has been great. The extra inflators were not included and they shipped them promptly, and followed up to ensure my purchase and follow-up experiences were top notch. Four stars because I have not needed to use it. Will update after I have done so.",
      "rating": 4.0,
      "verified": true,
      "author": "Angi",
      "helpful_votes": 2,
      "publication_date": 20180510
    },
    {
      "title": "WONDERFUL!",
      "text": "I purchased this as a gift and he LOVES it. I was able to be there first hand while my tires were pumped up with the Helteko Portable Air Compressor and it was really neat! First, we plugged it in, then we set the pressure on the unit. We set it to 32 PSI, then attached to the nozzle on my car tire and the compressor started up and AUTOMATICALLY stopped once it reached 32. That was so nice! We could work on something else, or chit chat while the tire pumped up. Thank so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime C.",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "All Round very good value and performance",
      "text": "The Helteko Portable Air Compressor Pump performs as advertised. It is a small, solidly built and easy to use pump. I have a slow leaking tire that I have been forced to nurture. Having this pump has gotten me out of a couple of jams. I gave it only 4 stars because in comparison to my tire gauge, the pump is typically 1 1/2psi low. Now that I understand it, I can simply add an extra 1 or 2 psi. Thanks Helteko for a valuable addition to my trunk.",
      "rating": 4.0,
      "verified": true,
      "author": "NewCo Builder",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "I can't belive",
      "text": "The greatest customer service I ever had encountered in my life. I will vouch for this guys and can say I stand behind them if you encounter any problems. I had one and without me even asking for anything they decided to make it right. And the compressor it's awesome the quick connect/release chuck is so much more convenient than the screw on ones . There is someone here explaining how yo set everything so read his comment and it will work like a charm. No words again thank you for the most pleasant customers service ever",
      "rating": 5.0,
      "verified": true,
      "author": "Lucian",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "STARTED SMOKING ON FIRST USE INFLATING TRAILER TIRE",
      "text": "The concept is great and the product looks good BUT the first time I had to use it, it started smoking, got really hot. Had to stop with inflating the tires. TOO bad because I really like the concept of dialing the PSI in and leaving it to inflate. Was going from 35 lbs to 70 lbs. At 65 lbs and 25 minutes, it started smoking.",
      "rating": 1.0,
      "verified": true,
      "author": "DallasMike",
      "helpful_votes": 2,
      "publication_date": 20190519
    },
    {
      "title": "But if needing a one time frame use for very short time",
      "text": "Do not buy this used it once on my vehicle after about 3 minutes it got super hot and shut down I let it sit for 4 days went to test it and got nothing when it was working for that 3 minutes it blew out very little air at a time. No good made very cheap and build very cheap",
      "rating": 1.0,
      "verified": true,
      "author": "Rocky Wakefield",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Fast and Accurate Pump for Your Inflatables",
      "text": "I initially got this before I knew there was a leak on my car tire. Pumping happens very quickly and I used a separate gauge to verify its accuracy. Though the power cord is long enough to stretch halfway around my car, I would still need to put the pump close to the tires because the air hose is significantly shorter by design. I also used the pump for bike tires and inflatable balls. To do this without starting the car, it's better to have a car starter battery around with a cigarette lighter output. For being a simple to use and accurate pump, I give this product 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Cheung",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Amazon,Helteko and this compressor rock",
      "text": "Great small compressor. I love the auto off at the preset pressure. The long cord lets me pump all the tires on my little RV. Pressure gauge reads accurately. The first one I got didn’t work and the free no hassle return from Amazon was great. I got an email from Helteko this next day asking if there was anything they could do to help. I got the replacement 2 days later and it works great. I really like the compressor but I’m more impressed by the customer service of Amazon and Helteko. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Erickson",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "So far I am happy with this",
      "text": "This air compressor will show you what the pressure is in your tire as soon as you hook it up. Per the instructions i set the machine for the psi that I needed and just pushed the on button. The machine started and ended about 20 seconds after it reached the set psi. As it is working you can see the psi go up which is helpful. If you have reasonable air in the tire it doesn't take long to achieve your desired psi. So far I am happy with this, I will carry it in my car so I have it in case I'm away and the darned unit on the dash shows one or more tires are low.",
      "rating": 5.0,
      "verified": true,
      "author": "JoAnne Kerr",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Lever broke off after using it maybe 5 times. Without it product is useless.",
      "text": "Lever broke off after using it approx. 5 times. Entire unit is worthless without the cheap plastic lever. The product is quite nice otherwise. I actually would have given it a 4 or 5 star review if the lever had not broken off. It is just strange how they can make critical parts like this so cheaply. Now I need to throw this otherwise perfectly fine unit away.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel B",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Short lifespan",
      "text": "Initially the product worked very well. I purchased it in September 2019 and used it occasionally (once or twice a month). However, over the past 4 months, it worked only intermittently. As of yesterday, it stopped working entirely. It was connected to the car and the display would show but it would not start. After pressing the power button several times, it died altogether and the display even stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "Aman Singh",
      "helpful_votes": 2,
      "publication_date": 20200707
    },
    {
      "title": "This is an air compressor for home use.",
      "text": "I bought this to replace one I \"loaned\" to a family member. I that it shuts off when the programmed pressure is reached. I also like that it sits flat on the ground and does not bounce around like the old one did. It is compact in size and fits easily in the spare tire compartment of my Jeep. I have only used it one time so I can't comment on the durability, but it seems well built. I like it better than the old one and it cost about the same, so I believe I got my moneys worth.",
      "rating": 5.0,
      "verified": true,
      "author": "blstang80",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Works Fine for a small pump, bit short extension cord",
      "text": "I tried to fill/measure tires for the first time with this new pump. The extension cord was too short. I could only measure the front tires. My vehicle is full-sized van, it was also UNDERSTANDABLE the cable won't reach rear tires, So I had to make up an extension cord long enough to reach rear tires. The pump works fine despite it's small size. The company was very responsive to their product, & we appreciate that.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Park",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Good product",
      "text": "Only thing I don't like about it is the display is kind of dim. That's not to say that you can't see the numbers. It's just that I would have like it to be a little brighter. Other than that everything else is great. I have a car with one tire that leaks very slowly. I start the car, plug the hose into my tire valve stem and lock it off, then plug the cord adapter into my 12V car outlet and then press the on/off switch. It does the just in about 5 mins and stops automatically at 35psi where I preset it to be. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "RawKing",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "I tore the pump hose on first attempt",
      "text": "First attempt was a bomb for me. As I tried to remove the air hose from my tire valve, I tore the hose which is pretty fragile. That destroyed my pump. I have no knowledge about the quality of the compressor since I had to return the unit as non functional",
      "rating": 2.0,
      "verified": true,
      "author": "Danny K.",
      "helpful_votes": 3,
      "publication_date": 20180909
    },
    {
      "title": "Does the job",
      "text": "We have only used this twice, but it seems to work fine for car tires and bicycle tires. The cords are long enough. We especially like that the hose clamps on instead of screwing on. We had to throw away or SLIME brand mini compressor (even though it still worked) because it screwed on at the hose and developed a leak there. It would no longer seal tightly to pump air. We expect this clamp-on hose will work better for longer.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bontekoe",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "it worked just fine the one time I had to use it. But it just feels very cheaply made.",
      "text": "made with really soft thin plastic all around. The connectors all feel very flimsy. But the one time that I had to use it, it worked. So I can't really complain. It took me a few tries to get it to work right but that might just be user error. Do not expect this to go as fast as what you get from a gas station. It took me about 5 minutes to fill up only about 15psi. that would normally take 1-2 mins at a gas station. But the convenience of having it in the trunk is nice. and it does come with a nice carrying/storage bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Punn Wiantrakoon",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Does what it says, and pretty well!",
      "text": "Does exactly what it's supposed to do with a reasonable level of volume. Wish there was a little better xable management, but in the bag in the trunk it doesn't matter at all. Hose and power cord are plenty long for most every vehicle. Will give an extra 0.5 to 1.0psi of pressure (for margin), so if you worry a lotz set it 0.5 psi lower. Oh, only other suggestion, put the light on the side where the hoses exit. I know this might be a design challenge, but even the bottom would be better than its current location.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Joe",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "It work",
      "text": "It does what it is supposed to do, inflate tires. I have used it twice. I like that it comes with a case so you don't have to try and stuff the cords into a very tiny space. Only those who have learned the secret way to fold everything into that particular space works for that company and it takes a lot of patience to try and learn how to do that. And I don't have that kind of patience.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris-Amz",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "The compressor has worked great so far!",
      "text": "I read many reviews of this unit as well as several others. The price seemed right so I purchased this compressor. The first tire I tried it on was on my Honda Odyssey which has one tire that loses air faster than the others. I read and re-read the instructions which are good if you take your time and follow the directioins. I also have an old Troy Bilt Bronco lawn mower that have started to lose air. I've had the mower for 10+ years so I guess that's to be expected. The unit did its well. I no longer have to use my hand pump.Thanks Kelteko for a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Coats",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Great machine",
      "text": "I love this little unit. Originally, I got a Slime one at Napa, which promptly broke. This one, however, is well made. Even little details like the electrical cord, air hose and adapter fitting are nice (not cheap). I love the preset function AND that it remembers that pressure setting the next time you use it. I use it on my SUV and trailer tires, from 35-65 PSI. Worked effortlessly. Tried it in my friend’s RV tires to 80 PSI, and it seemed to be putting in quite the effort. Not wanting to bust another one, I nixed that job. Definitely keeping it for my tires, though!",
      "rating": 5.0,
      "verified": true,
      "author": "LRC5555",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Super convenient, easy to use, accurate readings",
      "text": "I've inflated 8 tires with this since purchase and found it very easy to set to the desired PSI and get to the requested pressure. I have a vehicle that has a tire PSI reading on the dash. This compressor and the dash readouts both agree with the tire pressure. It powers properly with the vehicle cig lighter port and I also purchased a 120w AC/DC adaptor that also powers properly. In hindsight, I would prefer that the cord is 1 or 2m longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "It almost lasted a year!",
      "text": "One star because it served me well, for a while. This little device WAS great, until it wasn't. It is great to be able to set it for a specific pressure and just walk away from it. Especially in winter time, when you don't want to stand outside and babysit an air pump. I said \"was\" because it didn't even last me a year. It looks like the wire that connects it to the plug just snapped. See photo.",
      "rating": 1.0,
      "verified": true,
      "author": "Craig Gunderson",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Doesn't do the job",
      "text": "Even with the car running it doesn't work like I hoped it would! I contacted the manufacturer / seller back in March and they told me that the car did not need to run for it to work???? I tried inflating a basketball today and it stopped after a few seconds; hate to see what happens when I need air in my tires. The air compressor that I have in my son's car (different brand) works magic.",
      "rating": 1.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Works as advertised, really quiet.",
      "text": "This air compressor is really light and small but it works like a big dog. I have 17\" rims on my car and the tire pressures were 15.6 psi to 17.5 on all of them. I set the pressure shut-off @ 34.0 psi and each tire took about 3-1/2 minutes before the compressor shut off. The digital gauge on all 4 indicated shut-off @34.5 psi. Using a professional air gauge the true psi was actually 35.2 psi across all 4 tires, this is really excellent. The only test left now is durability, it seems very well built and sturdy. Only time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "George L. Ennis Sr",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Pumped up the winter tires!",
      "text": "Brought this Helteko air compressor out for the winter tires that were put on early this season and it did the job! The Helteko air compressor was unboxed, and first impression is that it is definitely portable as advertised. I used the compressor immediately to put air in my car’s snow tires ahead of a massive early winter storm. The Helteko air compressor worked quickly, flawlessly and automatically stopped once the optimal tire pressure was achieved. I have used it several times now to top off the tires on our cars and have checked the PSI accuracy with my tire pressure gauge. Yes, it is accurate and useful for the maintenance of our cars.",
      "rating": 5.0,
      "verified": true,
      "author": "sometimesUhave2say something",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Will work but needs improvement",
      "text": "The good: Pumps pretty fast, maybe a lb every 5-10 seconds. Small and portable. The bad: The power switch is intermittent. Sometimes I have to push it several times before air will start pumping. Also, the amount of air that is pumped varies quite a bit. Sometimes it goes 2-3 lbs over what I set. I wish it came with an adapter to plug into a wall outlet. It would also be nice if the cord was longer so it would reach to the opposite side of the car.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe Bill",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Works for mid-size car",
      "text": "I actually bought this to inflate kayaks, which it did not work for. You might be able to buy an adapter to make it work, but I haven't found one. Not long after I bought it I started having issues with a couple of my tires and it worked great for that. It was reassuring to know that I wouldn't be stranded in the middle of nowhere with a flat or low tire. It filled a very low tire in under 15 minutes, and tops off tires quickly. It would be nice if it had better instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "blundergirl565",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "buyer beware",
      "text": "first one, on button stay stuck...got another one..oh boy...this one also on button, very unresponsive and it keeps switching between psi to bar and other settings.its an adventure and do use it a lot. what am I supposed to do send it back again and get one worse..and first one I got as always the package was excellent inside another box with top notch, replacement came in the original box and it was open. lucky for me mailman is honest won't steal.the box is too small for product.as soon as I have money I'm getting another one and giving this to someone else",
      "rating": 3.0,
      "verified": true,
      "author": "iris",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Died after 15 minutes of use",
      "text": "Broke after my 2nd time using. Total life of pump was about 15 minutes of actual use time. Bought in May 2020 and used it for about 5 mins. Used it this week for about 10 mins and the hose that connects to the unit popped. Outside of return window. Great 15 mins while it lasted.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Didn't work as described",
      "text": "The air compressor arrived in the time frame. Unfortunately, the product did not work. After starting my vehicle and plugging it into a 12 volt outlet, I entered the PSI for a basketball to 8 PSI. When I inserted the needle into the basketball, the unit read 5 PSI. When I hit the start button, the compressor started and immediately turned off. It did this repeatedly. Tried on a tire and had the same issue. I'm returning this and purchasing a different compressor.",
      "rating": 1.0,
      "verified": true,
      "author": "Julia Bernatz",
      "helpful_votes": 3,
      "publication_date": 20190101
    },
    {
      "title": "Love it!!",
      "text": "They sent me a new one. Great customer service. Love this thing. I’m now updating my review from 5 stars to 1 star. In less than six months the hose blew off the compressor and it is now worthless trash. With 5 cars I am constantly trying to find air at gas stations. It usually takes 2-3 stops to find a working pump. The credit card macHines never work. Bought this to stop the madness. I absolutely love it. Only complaint is it’s a little slow if filling over 10 pounds. Maybe a little noisy. But I plugk it it, turn it on and walk away. One of my new fav garage gadgets.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Katherine Greene",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "worked well",
      "text": "Could never get air pumped to balls. Contacted seller but didn’t get any response. Got one from Costco which works great and is cheaper. Update: After returning and refunding, we got contacted by the seller who sent us a free replacement. I tested and this one worked well. Compared to the one from Costco Pros: It is lighter and looks nicer. It has auto-shut off system which is more secure but does need some adjustments to get the right pressure because you need to set the pressure higher than it’s required. Cons: it’s more expensive. The nozzle adapters are made of plastic rather than metal.",
      "rating": 4.0,
      "verified": true,
      "author": "Fei",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Good when it works but wasn't durable",
      "text": "Overall when it worked, I felt like it did a really good job of inflating tires quickly to the specified PSI. From day one however there was an issue with the power button. It wouldn't always turn on when pressing the power button after setting the desired PSI...I'd have to depress and press it multiple times sometimes before it would get started. This wasn't a complete deal breaker just a minor annoyance. The bigger issue was that after about a year the hose started leaking and so it no longer pumps air efficiently or quickly.",
      "rating": 3.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Blew the fuses in my 2006 Cadillac DTS",
      "text": "I went to use this air compressor pump, and it worked fine for a bit. Upon closer investigation it blew the fuses for both the front and rear cigarette lighter plugs (I was wondering why it wasn't working and thought it was just the one plug). Would not recommend at all, unless you want to damage your car's electronics.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick Thielman",
      "helpful_votes": 4,
      "publication_date": 20190506
    },
    {
      "title": "Small hardworking. gets the job done even if tire completely flat.",
      "text": "Now that gas stations charge for air you do need your own pump. When to check a tire the other day and it would not stop draining the air after I used the pressure gauge. Tire when completely flat. The Helteko was able to completely refill the tire. Stopped at the tire pressure I set. I was not able to replace the core but I am not worried with this pump around.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180715
    },
    {
      "title": "Easy to use. Lightweight and not clunky.",
      "text": "Easy to use. The digital display is a must. This beats going to the gas station and takes the stress away from seeing the tire gauge come on. Removes the guessing about your tire not being at the correct PSI or if the tire took the air. Cord is long enough to use on all four tires. Fast and reliable. I only wish that the bag was a bit bigger. It is difficult to store thr cord in this bag even when tightly coiled.",
      "rating": 5.0,
      "verified": true,
      "author": "VodkaSoda86",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "GREAT COMPRESSOR.",
      "text": "Pretty on point with filling air in my tires. It is accurate to the about +-.5 PSI. They sent me one and it did not work. The replacement came in the next day and it works like a charm! I’d highly recommend this to anyone looking for a pump. This pump stops pumping air into the tires after it’s filled to the desired PSI. Speed: Filled tires quicker than the Slime Compressors found at Walmart and Autozone.",
      "rating": 5.0,
      "verified": true,
      "author": "SA",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Worth getting it for Tesla Model3",
      "text": "Had to use this a few time to get me out of a bind for other vehicles. Tesla Model3's tie tend to deflate randomly even without rolling over any nails. small and compact with pressure readout that's actually accurate. (I use 2 different gauges to check) At least the one I have is accurate and is still chugging along just fine. I do recommend keeping the air intake away from dusty/sandy floor when it is pumping as the internals are just just crude pot metal/plastic for that price. Keeping that intake clean will help it last a lot longer for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasper T",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Not reliable.",
      "text": "Bought this based on glowing reviews & low price. in the the rather benign conditions of my carport, barely worked after much tinkering with it on 2 of 3 times tried to use it. Would not rely on this to work in an emergency on a cold, rainy night beside a dark road. Not inexpesive when have to by a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Desantnik",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Lasted 3 month before valve stem latch broke",
      "text": "I liked this product up until the time I really needed it most on a 1,300 mile motorcycle trip. The plastic locking latch on the valve stem attachment broke off very easily and rendered the whole device unusable. When purchased on Amazon it showed to have a warranty for 12 months but there is no info on how to get it replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "BRIAN BUCKLEY",
      "helpful_votes": 3,
      "publication_date": 20190823
    },
    {
      "title": "Update only lasted 1.5 years then broke - keep shopping",
      "text": "After a year and a half the pump busted. I only used it every few months for a slow tire leak. In addition the digital psi display was not calibrated correctly and was almost 10 psi off (causing over inflation of tires).",
      "rating": 1.0,
      "verified": true,
      "author": "JerseyNew",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "One of the better purchased items for me.",
      "text": "This product is amazing...its convenience..is really a help to me ...is it perfect ? Nothing is really but this one is close enough to- 5. The only issue is the it's off by about 2 lbs ..I just figure that into the process...its fine ..I have a newer Silverado and gauge by my dash ...anyways this is so amazing that I dont even care ..its quality its convenience. Makes this work for me anywhere I need it .",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Works Great",
      "text": "I drive a Lexus LS400 and this reaches all 4 of my tires from the center console 12V outlet. I was having tire troubles and was forced to refill one of my tires every morning for about a month. I used this air pump every day and it worked great and fills the tire pretty fast. The light is a nice added bonus too. Great pump for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh T.",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Slow to inflate...but works",
      "text": "The accuracy on the pump itself is off about 1-2 PSI. I set the pump for 35 and that will put about 33 PSI into the tires. I have a separate very accurate tire gauge and I use that to measure the pressure. The unit is compact. You won't be able to fill your trailer tires with this as the cords are not that type of length. However, it's able to do four tires on the vehicle very easily. I like it enough to purchase 2 additional units to place in my other vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott M.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Not as quiet as I'd like but a good tire inflator anyway",
      "text": "It's pretty compact although maybe not as small as other inflators I've owned. I've used it with my car and my father's car and haven't had any problems with it at all. It's pretty easy to use and it stores easily as well. I like that it can read the pressure and its auto shutoff feature especially. I don't know why, but I did expect it to be a bit quieter than the old inflator I had, but it's about the same. Still, it's pretty great and a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Lena E",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "It works, and then it doesn't.",
      "text": "Worked great the first few months (~10 uses due to a bad tire). Soon the stem (piece that attached to tire valve), started leaking and so I duct taped around it. Now the product smokes if it runs more than 2-3 minutes and it sounds like it's stuttering inside, like something is lose. I would recommend something more heavy duty for folks who actually plan to use this long term. UPDATE: This compressor completely stopped blowing any air; it just runs loud and gets hot. Terrible!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "I’ve only used it twice but it worked fine",
      "text": "It’s a nice little air compressor, the cords don’t really go back into the pocket of the pump the way it supposed to but because it comes with a bag it stores nicely. They should make a record retractable. You have to follow the directions exactly to get the motor to turn on, but it’s really not that complicated. All in all I think it was worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "JON  C VERMILYA",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Company stands behind their product",
      "text": "Update: Company actually reached out to me and sent me a brand new replacement unit for free which I was really impressed with. Now I have a backup and can also try to repair the original if I get the time. I have already purchased another inflator in the mean time which works ok but I took for granted how quiet this unit actually is compared to others on the market. Not reliable..cheap construction and materials..used for just about one month for light duty tire inflation. The inflator hose just broke off from the inside this morning. It broke just one day after the return window closed so now I'm stuck with it",
      "rating": 4.0,
      "verified": true,
      "author": "Doug Seubert",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Handy to have",
      "text": "I never thought about having an air compressor for my car, but we needed one on our road trip this summer for a tire with a slow leak. I think this one will work well although setting a desired pressure takes some patience with the digital read out. At least for me it was bothersome. I was glad it did give the pressure in the tire beforehand so I knew if it needed more air or not before I hit the start button to begin pumping. The price was a good deal for me.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Theriault",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "great pump, until the lever snaps.",
      "text": "The pump itself is good and inflates well. The problem is the lever that secures the pump to the valve on your tire. It's cheap plastic. I've used this pump a total of 4 times since I've owned it, and on the 5the attempt, the lever snapped off where it goes around the pin in the metal collar. I was very satisfied, until that happened. If the lever was made of metal or a very strong polymer, it would be a much better pump. Satisfaction went from 5/5 to 3/5 wheb the lever snapped. If I'm unable to use it just by holding it on there, it'll go down to a 2/5",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Cottrell",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "The little engine that couldn't.",
      "text": "Item broke after a month's use. The Seller did kindly replace the item and was surprised, and grateful they did this at no additional expense to me, however, the replacement has just stopped working (May 19th, 2019) after only for 4-5 uses. The engine in the machine sputtered out after about 5 minutes of continuous use. The item does get warm and I guess it needs to be used in very short bursts (2-3 min) or it will just break/melt down.",
      "rating": 1.0,
      "verified": true,
      "author": "David Owens",
      "helpful_votes": 2,
      "publication_date": 20190331
    }
  ],
  "product_meta": {
    "title": "Helteko Portable Air Compressor Pump 12V DC - Digital Tire Inflator - Auto Tire Pump with Emergency Led Lighting and Long Cable for Car - Bicycle - Motorcycle - Basketball and Other",
    "description": "Color:redFeatures & Benefits: \n\n▪️ Get 100% BEST SERVICE AND 18 MONTHS EXTENDED WARRANTY your purchase HELTEKO is totally risk-free! \n▪️ AUTO SHUT OFF - The digital air pump will automatically shut off when the pre-set tire pressure is reached, this prevents over inflation. \n▪️ DIGITAL LCD DISPLAY - You can easily read the pressure you program, even at night. \n▪️ EMERGENCY LED LIGHT - Air compressor tire will illuminate your car even in the darkest place. \n▪️ LONG STRONG CABLE - Car air inflator with a cable 3.5 M (11.5 ft) easily connects to a 12V cigarette lighter. \n▪️ FAST INFLATING SPEED - Airflow 35L/min will allow you to pump a standard wheel in 3-5min. \n▪️ 3 ADDITIONAL NOZZLES - It’s easy for you to inflate tire of cars, bicycles, motorcycles, suv, basketballs and also sport equipments and other inflatables.. \n▪️ PORTABLE AND EASY STORAGE - Mini air compressor is very compact and lightweight, it is easy to carry and store in any trunk. \n▪️If you want to you use the air compressor at home you should buy a AC to DC power adapter 110V-12V (120W) \n▪️It is for 12 Volt DC only / Do not support 24 Volt. \n\nOur high-quality, durable, heavy duty and portable tire inflator is suitable for people who value quality and excellent functionality in use.\n\n\nSpecification:\n\n▪️ Power Source: 12 Volt\n▪️ Power: 120W\n▪️ Material: ABS Plastic Heavy Duty Metal\n▪️ Display Unit: PSI, KPA, BAR, KG / CM\n▪️ Pressure: 150 PSI\n▪️ Flow rate: 35L / min\n▪️ Cable length: 11.5ft (3.5m)\n▪️ Noise level: 50db\n▪️ Continuous work time: 10 min\n\nPackage includes:\n\n▪️ 1 x Digital Air Compressor\n▪️ 1 x Storage Bag\n▪️ 1 x Piece Fuse\n▪️ 3 x Additional Nozzles\n▪️ 1 x User Manual",
    "rating": 4.4,
    "feature_bullets": [
      "🔵 HIGH-QUALITY MATERIALS - We use durable ABS plastic and stainless steel in portable air compressor pump. This allow you to use the digital tire inflator for a long time",
      "🔵 AUTO SHUT OFF - Simple and useful technology in the car air pump. When the inflator tire reaches the desired pressure, the car air compressor will automatically turn off",
      "🔵 LCD DIGITAL DISPLAY - The air compressor portable is equipped with a large high-precision and bright display that will help you to calculate the required values PSI, BAR, KPA, KG/CM²",
      "🔵 POWER & MULTI-PURPOSE - The auto air compressor inflates a standard mid-size car tire in 3-5 min. In addition the spare tire inflator has a Long Cable 3.5M to inflate the wheels of car, bike, motorcycle, suv.",
      "🔵 LED LIGHTING-COMPACT DESIGN - Tire inflator pump with pressure gauge can attract the attention of drivers in an emergency situation. Electric tire pump is lightweight and not large. GET 100% SATISFACTION AND 18 MONTHS EXTENDED WARRANTY"
    ],
    "specifications": {
      "Manufacturer": "H Helteko",
      "Brand": "H Helteko",
      "Item Weight": "2.42 pounds",
      "Package Dimensions": "9.76 x 6.46 x 4.41 inches",
      "Item model number": "4336329793",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "ATJ-1166S",
      "Special Features": "Power 12V, Auto Shut Off",
      "Voltage": "12 Volts",
      "ASIN": "B07789PTPG",
      "Customer Reviews": "4.4 out of 5 stars3,669 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#658 in Automotive",
      "Date First Available": "November 7, 2017"
    },
    "categories": [
      "Accessories & Parts",
      "Automotive Parts & Accessories",
      "Tires & Wheels",
      "Air Compressors & Inflators",
      "Automotive"
    ],
    "price": 32.96
  }
}