{
  "website_summaries": [
    {
      "verdict": "Wearing the Momentum from Black Diamond unravels the path toward ascents where comfort and breathability come in spades. Sporting this astonishingly durable climbing shoe also unlocks the gateway to a superbly grippy ascent to the top.The footgear, however, is hardly a perfect knockout as its restrictive width puts a dent in its rather stellar resume. Overall, width issues aside, the Momentum is still an impressive BD piece, what with all its excellent set of climb-focused features and qualities.",
      "pros": [
        "A great number of Black Diamond Momentum buyers swear by its super-comfortable confines",
        "Its breathability is exceptional, according to testers",
        "Gear pundits who have used it extensively say that the Black Diamond Momentum’s durability is absolutely phenomenal",
        "This rock climbing shoe has top-notch traction, according to several shoppers",
        "Some wearers who have reviewed the shoe find it a highly recommendable beginner shoe",
        "An owner finds the Momentum reassuringly stiff"
      ],
      "cons": [
        "This climb-centric offering from Black Diamond is too narrow, according to a few owners who have tried it",
        "A user complains about the cramped feeling in the toe section",
        "Based on a review, the Momentum deforms quickly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great beginner shoe",
      "text": "I'm just getting in to bouldering and got sick of using the grip-less, soft rental shoes. These work well and are fairly comfortable! I usually wear a size 12 (shoes in photo are 12) in my normal shoes because I like a more \"snug fit\" but for these I ordered a 13 and good thing I did! They are definitely an upgrade from the rentals and seem to take into consideration the \"downsizing\" people always say you should do. Seems to be a great beginner shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Jakeishness",
      "helpful_votes": 3,
      "publication_date": 20190606
    },
    {
      "title": "No Grip.. waste of money.",
      "text": "Would NOT recommend unless you want to be slipping off the rock. Honestly wish I could return them. They feel good on the foot and fit well, but have 0 grip. I was using cheap rentals at the place I climb before this and they worked SIGNIFICANTLY better than these do. Every single climb I'm slipping off which results in either a failed route or me having to use so much upper body energy to stay on the wall that I won't be able to finish longer climbs that I could with the rentals.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 2,
      "publication_date": 20190627
    },
    {
      "title": "Great climbing shoes!",
      "text": "Love these! First off, I know these are men’s but I’m a woman and these fit fine. I also want to mention about this seller that phew! They are patient! I had to return them two times to get a bigger size. Thanks for being patient! The last ones fitted perfectly. They have two Velcro straps that secure your feet without being overwhelming. There are two loops in the back that allow you to put them on with ease and secure them to a line without much movement. Worth the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Robles",
      "helpful_votes": 2,
      "publication_date": 20180628
    },
    {
      "title": "Overll all, good climbing gym shoes",
      "text": "be careful with the size, they run small, my feet measure 26cm, I ordered size 10 and the still are pretty tight",
      "rating": 5.0,
      "verified": true,
      "author": "Jess&carlos",
      "helpful_votes": 3,
      "publication_date": 20190411
    },
    {
      "title": "Great, true to size",
      "text": "I wear a size 10 in Nike. And I got these in size 10 and I don't regret it, fits super tight and I have to take them off after every climb, you could even get it in 10.5 if you don't want your foot to feel like it's going to fall off so you can leave them on longer and still be able to climb",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Denham",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Run small",
      "text": "As others stated they run small. My son is a 10, so I got 10, 10.5, and 11, after reading reviews. The 11 fit and work great! Great seller, allowed me to return the other 2 without charge. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Great for wider feet",
      "text": "First time climbing with these yesterday and they did not disappoint! I ordered an 8.5 and I normally wear a size 8 in regular shoes and they fit great! They say (most great climbers) to buy smaller because you want less room in your shoe for best climbing. But I don’t like the cramped up toe space. I would rather wear socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Crauswell",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Overall a good shoe",
      "text": "Great shoes with big advantage over rental shoes. I ordered my normal size and were very tight in the beginning but loosened up after a couple of weeks. They're still tight but not uncomfortable and feel like I have ample control when climbing. Since I don't wear socks it would be nice if the tongue had some padding or softer fabric since the material is pretty rough. Not a major issue but would be a nice to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Zachary W.",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great for beginners",
      "text": "These are great for beginners! I use them for both bouldering and top roping. Haven't run into an issue with the shoes. I would order at least a size to two sizes bigger than your normal tennis shoe size. I would and have recommended these to friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Dont order street shoe size",
      "text": "I would not recommend ordering your street shoe size. After 3 orders I finally got the right size. I started with street shoe size, they were too small. Ordered 1/2 size larger, still too small. Finally got a full size above street shoe size and they kinda fit. I have enough room for my toes now however, now the rest of the shoe is loose/baggy. I think these shoes have a bad design or I have weird feet. Seller was very difficult to work with and coordinate a return or exchange.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Bad sizing",
      "text": "I wear a 9 in shoes. I went rock climbing and rented 9's and they also fit well. I bought a 9 from here, and I couldn't fit in it. I sent it back and got 9.5's easy, but the rubber at the heel is WAY too restricting. I don't want to go up another size because the width is fine. I took a hot shower in them and I hope that they break in in the next couple of days, but if not, I'm returning them and getting a higher quality brand as the internet suggests.",
      "rating": 1.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great quality. Sizes run small.",
      "text": "Great quality shoe! Worked great for bouldering. Not too thrilled with the sizing, but after an exchange I got some that fit alright. Ordered the size I usually wear, which is an 11 1/2, and those were too tight. I exchanged for a 12, which also fit tight, but I'm working on breaking them in. I would recommend you order a full size bigger than what you normally wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin S",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Not Bad",
      "text": "Ended up getting half a size up from my normal street shoe. They work well for beginner stuff and they are very comfortable as far as climbing shoes go.",
      "rating": 4.0,
      "verified": true,
      "author": "Coop Dawg",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Good shoe for a good price",
      "text": "I really like these shoes. This is my first pair of climbing shoes and they have lasted about 6 months so far. No complaints I like how they fit and the feel good to climb in.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh H.",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Way better than my sneakers",
      "text": "I used to just wear my sneakers to the rock wall for months, until I finally bought these. I used to have to pretty much campus all routes. The difference is amazing. I feel like I can just walk up the wall without any effort, even on routes with small footholds that I could never do before. I went from a v3 to a v5. I bought the size 10.5, which feel tight as they should on my size 9 feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Go and buy better shoes",
      "text": "don’t buy. Stretched like crazy. Or size way way down I was a 9.5 if I was to buy again I’d get a 5. Seriously! If this review was helpful please let me know by clicking the “Helpful” button below the review.",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Sizing is way small!",
      "text": "sizing is way off. I wear a 10.5 in Chuck taylors.. I ordered 11 in these.. Can’t even get them on my feet.. they are like 1.5 inches smaller than chucks.. they actually look like a size 9.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimball V.",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great for beginners!",
      "text": "Great climbing shoe for beginners! Which I am. If you wanted to be more into it you could buy a slightly smaller size so it fits more snug to your feet. But I wanted more comfort then the average climber.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Crauswell",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Definitely size UP!",
      "text": "I returned them they were to small but did seem like a nice shoe though! My friend also a climber has these and loves them.",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "comfortable",
      "text": "great shoe for bouldering with my son. Gear Express is great company w great customer service. i mistakenly ordered a pair of shoes 1 size too small, my fault, and they let me return for a larger size and split shipping with me. very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Zenoj",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Amazing Shoes. True To Size.",
      "text": "Love these shoes. I’ve been climbing for about a year now, and these shoes are the best for long days at the gym. If you’re scrolling through to see the fit, they are VERY TRUE TO SIZE. I’m a men’s 13 and I originally bought a 12.5 and they were way too small. But overall, these shoes are great neutral shoes for long climbs and even outdoor climbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Sizing is off! dont order this shoe!",
      "text": "These shoes suck!! Ive worn size 11 my whole life. I get size 11 and my foot dosent even fit inside. Now im out $80. Shoe dosent follow any similar sizing pattern to major brands. There is no way to determine the right size. Dont waste your time by ordering this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg Micco",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Loved the product but not the sizing",
      "text": "I was looking forward to these shoes and loved the quality and colors. The sizing listed was men's but converting them to women's sizes was difficult and when I exchanged them twice they still didn't fit. First too small twice then way too big the third time and then the company wouldn't let me return them so now I'm stuck with these shoes that are way too big and the sizes didn't convert to women's so disappointed in this transaction.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Sass",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Tad bit small",
      "text": "Great shoes super nice but a lil small for a 9.5",
      "rating": 5.0,
      "verified": true,
      "author": "brad bond",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Great shoes",
      "text": "I bought these as a gift for a friend, and they work great. Once mine wears out enough, I will purchase these for myself as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikhail Amshei",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Great synthetic/vegan indoor/outdoor shoe",
      "text": "These are great! Synthetic/Vegan. Don’t waste your time with aggressive shoes unless you’re climbing V9. I climb V4/5 bouldering and these haven’t skipped a beat. I’m replacing my old pair because I climbed a hole through the toe after 10 months use in a gym about 2.5 days/week. Great for outdoor use too!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "really sticky",
      "text": "these are my first strap shoes and seem to be holding up well, the one issues I have with them is the back folds down when I put them on but all you have to do is readjust them after they are on. Another issue is my other pair of Joker Boreal's perform just as good and are real comfortable",
      "rating": 3.0,
      "verified": true,
      "author": "Justin mellem",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Size are way smaller than expected.",
      "text": "I am a normal Men's size 7 and the size 7 of this shoe is way too small and narrow. I recommend a full-size up. The shoe itself looks sturdy but it feels very hard. It needs some time to break-in.",
      "rating": 3.0,
      "verified": true,
      "author": "H. Lai",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Overhyped? Definitely not!",
      "text": "I thought climbing shoes were slightly overhyped when I began climbing.. but I could not have been more incorrect! After my first day using these I ran the numbers, and my climbing performance increased drastically, 9000% to be exact!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180805
    },
    {
      "title": "Not good quality",
      "text": "Purchased 6 weeks ago for my son to use at an indoor climbing / bouldering facility. They've already torn across the toe area and he has to tape them to wear them. $90 shoes should be better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "ESB16",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Runs small...",
      "text": "I absolutely love the look, but it runs small. The quality looks on point, but they’re brand new, so I can’t give an actual review about that. I have an old pair of LaSportiva in 7.5, so I decided to go with the same size with these. Once I opened the box I already knew they were smaller. Tried it on anyways and my toes were too curled up in a very uncomfortable way. Just ordered one size up (8.5). Hopefully that’ll do.",
      "rating": 3.0,
      "verified": true,
      "author": "Royce",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Runs smaller than expected",
      "text": "I bought these for my brother, and he told me to size up because they run small but we didn't think they'd be that small! He normally wears a 11.5 so we sized up to a 12, turns out he needed a 12.5. Hopefully it will fit, but so far the quality of the shoe seems excellent and he is looking forward to climbing soon!",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine Young",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Fits very small",
      "text": "Not very comfortable and fits very small. Normally wear a 9.5-10 shoe. Ordered a 10.5 and were painfully tight in the toe. Go a full fize larger than you normally wear.",
      "rating": 3.0,
      "verified": true,
      "author": "JoeStan_FPV",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Order 2 sizes too big",
      "text": "I’m a size 9 men’s and had to end up getting a size 11, they are good shoes and accepted returns but their sizing is very off",
      "rating": 3.0,
      "verified": true,
      "author": "Indy Robinson",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Comfort, fit and quality.",
      "text": "These shoes run very small. Order next size up from what you usually wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Very much a beginner shoe!",
      "text": "What do you expect for $90.00 nowadays? 1st off the shoe is very tight, i wear a size 8.5 and i ordered a 10 the shoe is still very tight i don't know who makes these but they should know to measure from the inside of the shoe rather than the outside. 2nd The rubber isint quite even under the sole and around the toe but you don't really notice it till your climbing so i cant return. 3rd the velcro comes off very easy if u brush up against it. I would only buy this if i was strictly going to stick to indoor climbing. Hope this helps u make your decision when buying this shoe.",
      "rating": 2.0,
      "verified": true,
      "author": "FriskyDingo",
      "helpful_votes": 3,
      "publication_date": 20180610
    },
    {
      "title": "Run a little small",
      "text": "Not aggressive at all great for a beginner like me",
      "rating": 5.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great starter shoes !",
      "text": "Great shows but there. SUPER SMALL. I usually wear 9.5, I had to buy size 11",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Great Product!",
      "text": "I got these shoes for my son as a gift and he is so impressed with them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great climbing shoe",
      "text": "Great climbing shoes — order a size above your normal shoe size.",
      "rating": 5.0,
      "verified": true,
      "author": "Jct",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Good traction",
      "text": "Very sticky and good balance of comfort and utility. Only climbed with them once so far but the spots at my climbing gym that were normally slippery were easier with the new traction.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Recommended to buy 1/2 size smaller, but it may still be too small.",
      "text": "Black Diamond is top of the line gear, and I alwaus recommend their products for climbing. The only particular thing about this shoe that you may need to know is that they recommend purchasing a half-size down from your running shoe size. This gives room for your shoe to expand under stress of use, creating a bit more room and comfort for your foot. I followed this guideline and they still felt too small to be able to expand after use and become more fitting. I recommend purchasing your equivalent size.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 2,
      "publication_date": 20180503
    },
    {
      "title": "Excellent quality but ran smaller then expected",
      "text": "Excellent quality but ran smaller then expected. Tried all tricks to make it fit but in the end returned it for half a size larger. That worked well then.",
      "rating": 4.0,
      "verified": true,
      "author": "Christian Schmidt",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Great shoes",
      "text": "Great quality, use for bouldering and top rope, would reccomend trying on in store first. Normally wear a size 12 and this is a little large",
      "rating": 5.0,
      "verified": true,
      "author": "John J.",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "These worked great for him - He is a size 12 sneaker ...",
      "text": "My son indoor climbs rock walls and has very big, wide flat feet. These worked great for him - He is a size 12 sneaker and needed the 14 in climbing shoes. We returned the 13 and got the 14s. He is not really a beginner climber...maybe 6 months into it and found these to work great for him. These do not have any support but climbing shoes are really just to climb not walk around in. The rubber and the material seem to be holding up great and he loved the color combo.",
      "rating": 5.0,
      "verified": true,
      "author": "LacrosseMomof3",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Order half size up",
      "text": "Definitely order at least a half size up. Shoes fit smaller and narrower",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "So I figured get an 11 be perfect. wrong",
      "text": "My street shoe is a women 9 US. The women’s in the momentum run extremely small that the 10.5 still had my toes curled. So I figured get an 11 be perfect. wrong. They don’t make a women 11 so I figured get a men’s 9 what’s the worse that can happen. They are made with a really large heel box so my toes hit the front and I spend a lot of time tapping my heel back into the shoe so my toes don’t hurt. Otherwise though they do have good toe gripping",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie Galvan",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Runs small",
      "text": "Awesome shoes for beginner to intermediate climbers. Runs smaller than a normal shoe. I would recommend knowing your size in CLIMBING SHOES before buying. I wear 11.5 in men’s shoes, but a 13 in these climbing shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180411
    },
    {
      "title": "Takes time to break into the shoes for rock climbing",
      "text": "I brought this for my boyfriend. The fit was good.",
      "rating": 4.0,
      "verified": true,
      "author": "Van",
      "helpful_votes": 0,
      "publication_date": 20180404
    }
  ],
  "product_meta": {
    "title": "Black Diamond Momentum Climbing Shoes - AW20",
    "description": "Black Diamond Momentum Climbing Shoes While the Momentum climbing shoe was built with ultimate comfort in mind; it excels in performance. With Engineered Knit Technology for exceptional breathability; and innovative proprietary molded rubber, the Momentum is the perfect entry-level climbing shoe for all-day comfort at the gym or crag. Engineered Knit Technology Constructed using an engineered knit upper, the Black Diamond Momentum Climbing Shoes provide exceptional breathability and comfort. Designed to provide the right amount of stretch with the right amount of support, the knit technology sits comfortably against the skin and moves as you do. The fabric conforms to the shape of the foot to provide a perfect fit that minimises in shoe-slippage; because a precise fit is necessary when climbing. The knit upper also ensure exceptional breathability by allowing cool air to circulate within the shoe on hot and humid days. Completing the upper are two velcro straps which pull in opposite directions to ensure added midfoot support. Soft Flex Midsole The midsole of the Black Diamond Momentum Climbing Shoes is built to ensure all-day comfort. Low in profile, the midsole is minimal to reduce weight whilst still provide an abundance of comfort and cushioning. Soft-flex combines both underfoot cushioning and sensitivity to bring you a midsole that is perfect for climbing. Sensitivity is important in climbing as it allows you to feel the rocks and boulders beneath your feet before you commit to climbing on them. The Momentum Climbing Shoes have been built for all-day comfort on moderate routes, boulders or gym sessions. Durable Rubber Outsole Developed using a 4.3mm the Momentum is built for durability and moulded for optimal consistency and performance. The stiff rubber is effective on terrain where small crevices and edging is a priority. The rigid nature of the outsole supports you during any climb by adapting to the ground below you and bearing your weight as",
    "rating": 4,
    "feature_bullets": [
      "Upper Material: Engineered Knit Technology",
      "Closure: hook-and-loop",
      "Outer Material: Engineered Knit Technology",
      "Sole: Rubber",
      "Closure: Hook and Loop",
      "Shoe Width: M",
      "Midsole: soft flex",
      "Rubber: NeoFriection (4.3mm)",
      "Last: flat"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "33.02 x 15.24 x 12.7 cm; 902.65 Grams",
      "Date First Available": "20 Nov. 2017",
      "Manufacturer": "Black Diamond",
      "ASIN": "B077ZC4KJJ",
      "Item model number": "BD570101ASH01351",
      "Department": "Unisex Adults’"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Climbing Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 111.04
  }
}