{
  "website_summaries": [
    {
      "verdict": "The OluKai Moloa has garnered a lot of fans and return-purchasers over the years. Its unique style has caught the attention of many shoppers who love that it quickly transforms appearances. You can be wearing this pair of slip-on walking shoes at the office and be ready to hit the beach without changing out of them. Despite a few hiccups, it comes highly recommended for the comfort it offers and versatility.",
      "pros": [
        "A vast majority of users rave about how comfortable the OluKai Moloa is for everyday wear",
        "Almost all of the buyers love the versatile design of this pair of walking shoes",
        "The durability of this trainer exceeds the expectations of a large number of owners",
        "Many folks appreciate the slip-on style of this footgear",
        "Numerous reviewers laud the grippy outsole",
        "A lot of people are delighted that this model can be worn during warm and cold weather without any issues",
        "The style of this footwear pairs well with shorts and pants, says multiple shoppers",
        "Several individuals find the arch support to be adequate"
      ],
      "cons": [
        "Some wearers need to wear thick socks because the boxy forefoot of the Moloa felt too roomy",
        "A few repeat purchasers wish this model was offered in more colors",
        "A commenter has complained that the sides of the footgear were too high and that they hit her ankle bones"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 7.5,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fantastic color, design, quality and comfort, but watch the sizing feedback.",
      "text": "Ordered size 10. A bit sloppy even with socks, but a great look and are quite comfortable. In comparison, I recently purchased Olukai Honua in size 10-1/2 - and are a good fit for my size 10 feet - but are still smaller than these size 10 Moloa Kapas. Pay attention to fit feedback before purchasing. Olukai are fantastic shoes, but maybe size consistency is an issue, ordering online.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Vaillancourt",
      "helpful_votes": 3,
      "publication_date": 20180608
    },
    {
      "title": "Solid and comfortable",
      "text": "Comfortable, sturdy shoe for a casual slip on. Holds up well in the wash when needed but air dry or they will shrink.",
      "rating": 4.0,
      "verified": true,
      "author": "John F. Healy",
      "helpful_votes": 2,
      "publication_date": 20180811
    },
    {
      "title": "Great Fit & Comfort...... stylish too!",
      "text": "SO comfortable with the heel(s) up and/or down. The leather pair fit better than the (tighter) canvas pair I ordered.",
      "rating": 5.0,
      "verified": true,
      "author": "Sailor Pete",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Decent Shoe",
      "text": "Happy with the purchase. Some of the bunched up material within the seam (located at heel) can be irritating at times.",
      "rating": 4.0,
      "verified": true,
      "author": "northseven5",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Great shoes",
      "text": "I have purchased this shoe over and over. I buy one pair per year. Very well built. Good quality. Perfect fit with very little break in time. I will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred H",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "He says they are super comfy!",
      "text": "Decent shoes even though there are similar much cheaper brands out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Very comfortable, just a little warm",
      "text": "Went a half size small based on reviews, and fits well. Very comfortable. Only negative is that they are slightly warm on a hot/humid day.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Way too loose",
      "text": "I usually wear an 8. There was almost a good 1\" of free space for me on these.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan V.",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Take it 0.5 size smaller",
      "text": "I ordered this pair of shoes in my usual size of 11.5 US It was little bit loose compared to another pair of shoes of the same brand.. (OLUKAI Mens Puhalu Canvas 11.5 US) After doing exchange to US 11 size it fits on me just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Dmitry Gitlin",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Love this brand",
      "text": "Love this brand, and this pair of shoes is great for work casual. Well made and designed and very comfy!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Courant",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Comfort as expected!",
      "text": "Olukai always delivers. Great looking shoe, super comfortable. I'm on my feet all day for work, and day one these didn't skip a beat. Per usual, I find sizing usually runs 1 full size larger (I wear a 10 usually, 9 fits great).",
      "rating": 5.0,
      "verified": true,
      "author": "Riggs",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "My husband loved the look of these shoes",
      "text": "My husband loved the look of these shoes, but they were big, which is saying something for a size 13! They weren't wearable, they were that big. So, unfortunately, they had to be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Great shoes",
      "text": "Love these shoes my husband has 2 pair and says it’s the most comfortable shoes he has ever owned. Stand up great",
      "rating": 5.0,
      "verified": true,
      "author": "JR-Marty",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Classy look",
      "text": "Great shoes! A little loose but very comfortable. Look great too. I wear them as work all week.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthewevans",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "A bit larger than expected, but comfortable",
      "text": "Fit is a bit wide and loose but otherwise this is a great product. I use them for wearing around the office and house mostly.",
      "rating": 4.0,
      "verified": true,
      "author": "Bret Watkins",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Favorite by far",
      "text": "This is my second pair. The first lasted 6 years. They’re so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Consistent Olukai Quality",
      "text": "This is my 7 pair of Olukai’s. Well constructed, comfortable right out of the box",
      "rating": 5.0,
      "verified": true,
      "author": "Michael G Jennings",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "How can someone be inept?",
      "text": "I usually don’t write reviews but this was a very poor experience. After the first return, this was their second try. See the picture posted. Not sure if this is Amazon’s failure or if Shoozforu is that incompetent. Last return and won’t buy again. Too bad, thought the shoes looked cool and I like Olukai alot...would have been my 3rd pair.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan D. Bramm",
      "helpful_votes": 2,
      "publication_date": 20180523
    },
    {
      "title": "Excellent quality, excellent fit..",
      "text": "I love these shoes, especially for the fact that I have wide feet. They are very comfortable, so comfortable that I purchased 4 pair.",
      "rating": 5.0,
      "verified": true,
      "author": "L Ogawa",
      "helpful_votes": 0,
      "publication_date": 20191225
    }
  ],
  "product_meta": {
    "title": "OluKai Men's Moloa Kapa Slip On Shoe",
    "description": "Revitalized and modernized, the Moloa Kapa is sophisticated and approachable; a staple for Spring and Summer seasons.",
    "rating": 4.7,
    "feature_bullets": [
      "On your feet all day? Might as well enjoy it with the laid-back and comfy Moloa Kapa loafer.",
      "Knitted textile upper.",
      "Sole: Rubber",
      "Closure: Slip-On",
      "Shoe Width: M",
      "Features embroidered 'crest' detailing on vamp.",
      "Fold down heelstay transforms the shoe into a slide.",
      "Microfiber suede lining. Rigid cellulose fiber insert for stability. Serdia™ antimicrobal and anti-odor treatment for constant freshness. Microfiber suede footbed covering with a soft polyurethane base GEL insert in the midsole for all-day comfort. Full-grain leather outsole with non-marking, molded rubber traction pads for added grip. Advanced construction technique wraps premium materials around the anatomical footbed for an elevated fit. Measurements: Weight: 13 oz Product m"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "35.56 x 22.86 x 15.24 cm; 1.36 Kilograms",
      "Date First Available": "1 Aug. 2017",
      "Manufacturer": "OluKai",
      "ASIN": "B0762GVGXM",
      "Item model number": "10368",
      "Department": "Men's"
    },
    "categories": [
      "Loafers & Moccasins",
      "Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 145.89
  }
}