{
  "website_summaries": [
    {
      "verdict": "These CrossFit gloves consist of high-end suede to prevent rips and other damage.",
      "pros": [
        "Designed to match the contours of your hands perfectly",
        "Wrist straps are equipped with plenty of padding to reduce hand irritation",
        "Finger holes are cut round to provide an ideal fit",
        "Sold in a variety of sizes",
        "Backed by a manufacturer's guarantee"
      ],
      "cons": [
        "Gloves sometimes leave black marks on the hands and tend to stretch due to extended use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "good quality and nice price",
      "text": "I love these grips, they fit snug and protect my palms profectly, I'll definitely recommend it to all of my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20181108
    },
    {
      "title": "These are great. I had calluses at serious risk of ripping ...",
      "text": "These are great. I had calluses at serious risk of ripping off--that would have put me out for about a week from the gym. These spared me that fate. They fit very nicely, make my pull up grip much more secure, and look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 3,
      "publication_date": 20180530
    },
    {
      "title": "These grips are Durable & the fit is true to size",
      "text": "My 4 year old daughter is a gymnast & was getting bad calluses on her hands. These grips are amazing! They fit her hand perfectly, it stays in place, flexible for hand movement, & still gives some support for her wrist when she's on bars. I'm going to get a pair for myself for weight lifting!",
      "rating": 5.0,
      "verified": true,
      "author": "LaTonya Curry",
      "helpful_votes": 3,
      "publication_date": 20180618
    },
    {
      "title": "Great price and value",
      "text": "Use it for pull ups crossfit daily. Easy to put on and take off. Added wrist support a plus. Not big deal for me that I have to take my watch off when using them. Can also comfortably keep them on my wrists while slipping the leather piece off if a set has pull ups in between. Been using them daily for several weeks now without issues",
      "rating": 5.0,
      "verified": true,
      "author": "FA",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "EXCELLENT HAND GRIP GLOVES",
      "text": "These hand grips are excellent. They are well made, comfortable and good looking. These grips are the best overall value and I recommend this vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "SPARROW",
      "helpful_votes": 2,
      "publication_date": 20180517
    },
    {
      "title": "Good for Crossfit",
      "text": "I like the fact they are easy to put on and quickly for crossfit. They help grip the bar for pull ups, dumbbells, or deadlifts well. It is a comfortable fit. Just FYI you may still get callouses but no rips.",
      "rating": 4.0,
      "verified": true,
      "author": "Andre",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Didn’t work for me but good customer service",
      "text": "These are well-made but they hurt my hands. Whenever I try to do pull-ups I feel like it pinches my hand at that callous line and makes it worse. I measured my hand and ordered according to the size chart, but wondering if I needed a smaller size or if these are just too heavy/thick for me. The company refunded my purchase even after the return window, very gracious.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Graham",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "CHEAP MATERIAL",
      "text": "The paint color of the gloves have left my hands black. The picture is after I have washed my hands 75 times. Horrible material",
      "rating": 1.0,
      "verified": true,
      "author": "edgardo",
      "helpful_votes": 4,
      "publication_date": 20180817
    },
    {
      "title": "Good for Crossfit",
      "text": "I had those for a while now, and it does the job perfectly. I do Crossfit and I didn’t get my hand ripped off since I have it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexia SINA",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "My first two times using them were great but then it started slipping on the bar and ...",
      "text": "My first two times using them were great but then it started slipping on the bar and hurting my fingers.",
      "rating": 2.0,
      "verified": true,
      "author": "quinn",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Possibly too much coverage??",
      "text": "Not liking the grip I have with these. I tried using them for CrossFit (pull ups, toes to bar, muscle ups, etc) and am not liking the feel. Well made though.",
      "rating": 3.0,
      "verified": true,
      "author": "Benjamin Smith",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Great gloves",
      "text": "Really good purchase, great quality, i use them almost everyday and i dont notice any flaw by now. Highly recommneded",
      "rating": 5.0,
      "verified": true,
      "author": "Santiago Montero",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Durable and protective.",
      "text": "Simple design and nice grip! The wrist wrap is double secure and the quality of material is great! Won't get in your way when changing exercises.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "and super durable. Cant beat them for the price",
      "text": "Really well made, and super durable. Cant beat them for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Dustan M.",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "a bit extravagant",
      "text": "For a beginner, this glove is a bit extravagant, just to protect the hand.",
      "rating": 5.0,
      "verified": true,
      "author": "joey",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "These are not real leather",
      "text": "These are not leather, it's some kind of pleather, artificial leather. Don't put leather in your description if your product is not. They'd probably work fine, but there is a certain feel to leather that's much, much nicer. Also, that explains why they are so cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Joey Reno",
      "helpful_votes": 0,
      "publication_date": 20201107
    },
    {
      "title": "Excellent Customer Service",
      "text": "Excellent Customer Service. Was sent a brand new pair after a sizing issue. They feel great and are very comfortable. Would buy another pair.",
      "rating": 5.0,
      "verified": false,
      "author": "Mike Geissler",
      "helpful_votes": 0,
      "publication_date": 20200608
    }
  ],
  "product_meta": {
    "title": "Nisrok Gymnastics Hand Grips, Crossfit Gloves Great for Pull Ups,Cross Training, Weightlfting,Powerlifting,Barbells,Kettlebells + Free Carrying Bag",
    "description": "Perfect Hands After Every Workout!\nNisrok grips were designed to elevate your training routine to the next level! Our specially designed workout gloves prevent rips, tears and blisters so you can rip, tear, and blister through your workout like never before! No more stinging when you wash your hands or take a shower after a workout. These grips will prevent you from having to skip another workout.\n\nProfessional design\nDesigned and tested by experienced fitness professionals in Crossfit, Gymnastics and Functional Training Programs, Nisrok grips we’re designed to maximize comfort and performance.\n\nWrist\nSpecial designed wrist strap with extra padding to prevent common wrist irritation. Other grips will dig into your wrist and cause irritation while you work out. Nisrok grips are ergonomically designed for comfort and performance.\n\nHand\nThree holes, double layered, ergonomically designed to contour to your hand perfectly. All areas of the palm are protected. Holes are cut round, not square to better accommodate your fingers. Use chalk for better grip on the bar.\n\nSatisfaction Guaranteed\nEach purchase comes with a complete satisfaction warranty. Therefore, if you’re unsatisfied for whatever reason, you’re welcome to a full refund no questions asked.\n\nSize\nTo select the appropriate size, measure the length between your wrist and base of fingers on your hand. Compare it with the following sizes:\nX-Small(Extra Small):Up to 3.5 inches\nSmall: 3.5 - 4.0 inches\nMedium: 4.0 - 4.5 inches\nLarge: 4.5 - 5.0 inches",
    "rating": 4.1,
    "feature_bullets": [
      "PROFESSIONAL HAND GRIPS: Double layered real genuine suede leather professionally designed to prevent rips, tears and calluses on your hands. Custom design that matches the contour of your hand and wrist to prevent irritation. These grips are built for comfort and performance. Includes free nylon carry bag.",
      "CUSTOM DESIGN: Nisrok design for extra motivation during your WOD! Special designed wrist band to prevent irritation on wrist and undesired movement along your palm. Durable, soft, form fitting leather will conform to each hand after they break in.",
      "PREVENT INJURY: Prevent hand injuries like blisters, rips, tears and calluses from exercises like pull-ups, muscle-ups, toes to bar, knees to bar, kettlebell swings, snatches, power cleans, deadlifts, thrusters, clean & jerks, gymnastics, functional movements, and more.",
      "EXTRA GRIP & SUPPORT: Special design to allow better grip and support on pull up bars, weightlifting bars, and gymnastic rings. Stay in the game longer with greater endurance! These grips will prevent you missing a workout because of hand injury! They will improve your stability on a pull up bar.",
      "SATISFACTION GUARANTEED: For whatever reason if you are unsatisfied with your purchase, we will refund your order or send you a new pair of gymnastic hand grips as replacements. Please feel free to contact us anytime with questions - we are customer service orientated!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 11, 2018",
      "Manufacturer": "Nisrok",
      "ASIN": "B078Y53M37",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Accessories",
      "Sports & Outdoors",
      "Hand Grips",
      "Sports & Fitness",
      "Gymnastics"
    ],
    "price": 19.95
  }
}