{
  "website_summaries": [
    {
      "verdict": "On the surface, the Hillmaster II GTX from Berghaus sports a look that can be considered a stunner. That said, the boot deserves to be taken seriously as it offers loads of comfort and super-reliable surface grip. Its almost non-existent break-in period is also a great contributor to its remarkable reputation. Unfortunately, behind such marvelous qualities lies complaints about its inconsistent sizing. Overall, the Berghaus Hillmaster II GTX comes out strong what with all its phenomenal traits dwarfing its pretty solvable downsides.",
      "pros": [
        "Numerous owners commended the Berghaus Hillmaster II GTX's outsole for performing extremely well on a variety of surfaces",
        "Scores of users made praising remarks about the boot’s exceptionally comfortable cradle",
        "Thanks to its stylish workmanship, this excellent leather boot received accolades from many reviewers",
        "According to several wearers, they were able to break in the Hillmaster II GTX in no time",
        "Experts adored the spacious interior of this boot",
        "Some critics and consumers were impressed with its brilliant waterproofing",
        "Its dependable ankle support was adored by a small percentage of the reviewing populace"
      ],
      "cons": [
        "Based on a number of reports, the Berghaus Hillmaster II GTX runs large",
        "A couple of users didn’t like the heaviness of this day hiking gear",
        "One blogger wasn’t all too hopeful about the boot’s breathability in warmer months"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Serious hillwalking boot",
      "text": "I bought there to replace a pair of Fellmasters that were wearing out. The Hillmaster is a stiffer boot and feels a bit strange at first after the softer Fellmaster, but walk around for five minutes and they're just fine. Out on the hills I noticed a big difference. The sturdy Vibram soles deal with any terrain and the upper provides plenty of support. It's a good idea to order at least half a size up from your normal fit, especially if you have wide feet, but you won't be sorry - this has to be the best three-season hillwalking boot in its price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Malc",
      "helpful_votes": 12,
      "publication_date": 20190505
    },
    {
      "title": "A good quality Boot",
      "text": "I have for my last 3 pairs of Boots been drawn to the lower cost end of the spectrum and have managed to eke out 1 year approximately from each of those boots. On this occassion I have gone for the more expensive boot and will be watching with interest to see how they perform, time can be the only judge on this.",
      "rating": 4.0,
      "verified": true,
      "author": "Viettaff",
      "helpful_votes": 8,
      "publication_date": 20181005
    },
    {
      "title": "Super comfort boot",
      "text": "I have had these on straight out of the box and done 20 miles over very wet and rough terrain. They are extremely comfortable all around the foot, no tight points, no blisters, more to the point, completely watertight as advertised. Now on day 5 with more of the same, still like new. In comparison with more expensive boots, these are a winner, I will buy nothing else. I have wide feet, these were the best out of all I have used. Go for it if you need new reliable boots.",
      "rating": 5.0,
      "verified": true,
      "author": "PK",
      "helpful_votes": 4,
      "publication_date": 20200131
    },
    {
      "title": "No complaints whatsoever.",
      "text": "Unfortunately I had to return the boots because they were too slim a fit, despite the fact that I had ordered half a size larger than my normal size, just in case I wanted to wear a thick pair of socks. Very disappointed, because they were obviously a very well made pair of boots, that looked like they would give me excellent service. If they had been a comfortable fit I would probably have awarded 5 stars. Excellent delivery and a very efficient and fair returns process. Money refunded promptly as promised. No complaints whatsoever.",
      "rating": 3.0,
      "verified": true,
      "author": "JohnWilly",
      "helpful_votes": 3,
      "publication_date": 20191208
    },
    {
      "title": "I would recommend getting a larger size .5 to 1.",
      "text": "Just started wearing them for short walks to break them in, I bought a 11.5 my usual shoe is 10.5 but with thicker sox and having a wider foot they are just right, I did originally get a size 11 which felt a bit tight, changed them for the bigger size, the return was very easy no problem getting the replacement pair and returning the small boots",
      "rating": 5.0,
      "verified": true,
      "author": "john david byrne",
      "helpful_votes": 4,
      "publication_date": 20191226
    },
    {
      "title": "Not waterproof",
      "text": "If you have wide feet as I do then you may need to buy at least a half size bigger. The size 9 boot pinched my right foot as soon as I put it on. It does seem that sizes of boots have reduced as I have had similar issues recently with other branded boots. As for waterproof, my left boot let water in the first time I went for a walk. It was a wet day and the ground was boggy but I hoped the boot would be okay. But water got in at the bottom of the tongue. All in all a disappointing outcome from a regarded brand.",
      "rating": 2.0,
      "verified": true,
      "author": "ChrisA",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "What a fantastic boot. Really impressed. So far used it twice .Very comfortable and good shape. Long lastibg stuff.",
      "text": "What a fantastic boot. So far used it twice. Very comfortable during walk. Long lasting stuff. Looks like that it will very good and comfortable for my future mountain journey for which I bout it. Protects your foot from twisting as well. If you look after this boot properly it will look after you.",
      "rating": 5.0,
      "verified": true,
      "author": "S S AHMED",
      "helpful_votes": 4,
      "publication_date": 20180914
    },
    {
      "title": "Good for the job.",
      "text": "A little bit bigger than wanted but a size smaller is too small and the larger size too big! My husband wore 2 pairs of socks to get around that. Did a big walk in the Peak District with no blisters or discomfort so happy with the boots. They were a little heavier than he liked too but for his size (12/13) a cetrain degree of compromise appears to be necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "amandanos",
      "helpful_votes": 3,
      "publication_date": 20181110
    },
    {
      "title": "Great boots, worth the extra money.",
      "text": "Fantastic boots. Love the Vibram soles (they really do almost \"stick\" to the ground). The boots took some time to wear-in and I got a few blisters - but worth it as they are now the best boots I have ever owned. Water tight, warm and supportive. I use a hose and a weekly dose of dubbin to keep them in shape. I hope these boots will last me a long time - expecting at least 5 and hopefully 10 years (I walk almost every day).",
      "rating": 5.0,
      "verified": true,
      "author": "zaz",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Every bit as good as I remember !",
      "text": "Berghaus have managed to retain the slipper-like comfort of the old Brasher Hillmasters that these boots have replaced. These new Berghaus Hillmaster II boots have an upgraded Vibram sole, feel a wee bit more robust, and require no ‘Break-in’ period.... they are very comfy n’ cosy straight out of the box. My son and I both bought a pair recently, and we are both delighted with them.... in rain, wind and sun... track, bog and hill. Great, fully waterproof boots for Hiking, backpacking and Munros.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr B.",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "My feet say thank you",
      "text": "Great pair of boots, I used them during my walks in Peak District and I did not get wet at all, no blister, nothing whatsoever. I had to replace them at first as the UK 10.5 was too small for my feet, despite being my usual size. They external layer is great in protecting you from water and mud, I walked through few water streams without issues at all, also thanks to the thick sole. Also it is easy to clean, even on the sole.",
      "rating": 5.0,
      "verified": true,
      "author": "Marco B.",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Top notch",
      "text": "There will always be those who struggle with footwear, but, for most recreational hikers and scramblers, I reckon these boots are just about perfect. I find them supremely comfortable and so light that I can run in them. The restrained styling is a bonus and my experience of Vibram soles is that they're as long lasting as can reasonably be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Cook",
      "helpful_votes": 2,
      "publication_date": 20190913
    },
    {
      "title": "Sizing is a real issue",
      "text": "I ordered these boots to replace the exact same Hillmaster boot. They looked great at first but when I tried them on they were extremely tight. When I compared the sole against my existing Hillmaster boots there was a 1.5cm difference so I am returning them. I can't bring myself to only give them one star as had the sizing been correct then it would have been a different story. Can't comment either on how robust they are because they were returned the day after.",
      "rating": 3.0,
      "verified": true,
      "author": "Aysgarth",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Quality comfortable boots",
      "text": "Comfortable, waterproof, well made, as comfy as my old boots without any wearing in. I have worn Berghaus boots for years and then tried other makes as Berghaus seem to be getting narrower in fit. Never got on with the others due to the quality. Decided to try these Hillmaster, went for 1/2 size larger than my normal fit, wasn't disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Not waterproof.",
      "text": "Bought these three months ago. Only used a couple of times before yesterday, Wednesday 12th June, where I was out in very heavy rain. Half an hour of such and my right toes were sloshing in water. Wore gaiters and wet-gear to prevent ingress from the top. I bought these boots because a top brand would give reasonable confidence in them being waterproof. Will be returning under Berghaus lifetime guarantee for which I have given a star. Meanwhile, as I plan to walk the Pennine Way from Monday 17th June, I have acquired boots from another source; they are currently in my bath undertaking a leakage test which I should have done on the Berghaus boots.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "durability",
      "text": "I walked over 1500 miles with my previous pair of Berghaus Walking Boots and they proved their worth, which is why I wanted value for money and durability in a new pair, and therefore choose the same brand. I am pleased with the style and fit and would always recommend the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur Redman",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "comfortable boot",
      "text": "The boots were on an offer too good to be missed. I am normally a size 7 to7 1/2 in shoe size. The boots are size 8, which I feel is just right, as, when walking distances, my feet swell slightly. I haven't wore them outside yet, as I want to make sure all is okay, width fit wise. I wear two pair of socks when wearing boots, (heavier walking and lighter inner). These boots seem to be fitting great. I will treat them first with 'rain and stain protector spray' before wearing them outside. They look good, and hopefully will wear well, time will only tell.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Finish of product",
      "text": "Bought as a gift but when boots were finally used they have an 'bump' on the inner sole which is uncomfortable. As they had been worn outside I felt unable to return them. Very dissapointed with the boots as they are a recognised maker and were very expensive. Can you do anything to rectify this?",
      "rating": 3.0,
      "verified": true,
      "author": "A.l.turner",
      "helpful_votes": 2,
      "publication_date": 20190310
    },
    {
      "title": "Sturdy and comfortable",
      "text": "I use walking boots for a tour round my local woods and fields every day that last just under an hour . I want comfort , grip and being weather proof . So far , so good all all fronts . In EU sizes , I am a full 48 . These at a UK 13 are in fact a 48.5 - so they are a perfect fit for me.",
      "rating": 5.0,
      "verified": true,
      "author": "C. J. Howard",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Robust but Comfortable",
      "text": "Only used them for trekking over waterlogged fields so far but they seem to do the job. No great need for breaking in as they felt comfy from day one. Fit was spot on and the same as my normal shoe size. No complaints about quality but it's early days!",
      "rating": 5.0,
      "verified": true,
      "author": "Pars",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Reliable, solid boots",
      "text": "Seemed quite tight at first , but remedied by loosely lacing up. form of the boot itself is fine. Have only been using for 8 months but have worn them on some long walks in varied terrain and conditions. They stand up to all conditions and stay comfortable, with only minimal sweat build up. A little bit on the heavy side, but its a fair trade off for solid leather boots with good ankle support.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. A. Brown",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Well made!",
      "text": "I've been walking in these boots for the last week. So far no blisters and surprisingly comfortable for new boots. The size recommended on the order page seems spot on. I can't vouch for waterproofing yet. I will update the review if I have any waterproofing issues!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Perfect fit right out of the box.",
      "text": "When I ordered the boots I was concerned re the correct size as some comments were rather off putting. My present boots are Brasher size 8, so that's what I ordered. When they arrived they fitted like a glove, or should I say \"boot\". Initial trial walk around the park, about a mile had no ill effects. p.s. didn't know that, but glad, Brasher and Berghaus have combined and they are both British companies!",
      "rating": 5.0,
      "verified": true,
      "author": "Wizard",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Genuine Article",
      "text": "Very strong boots with great support. Thoroughly reliable in the wet. Might be a bit too hard but I like these, remind me of the old \"Brasher\" boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Matty",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Very nice, strong looking boot",
      "text": "Cant give 5 stars, only just started my dog walks in these boots, but so far they are very comfy, waterproof, made with good materials, sole is very good,nice all round boot, compared with other branded boots I've had, so far I'm very pleased indeed.",
      "rating": 4.0,
      "verified": true,
      "author": "paulc",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Highest quality hiking boot.",
      "text": "Outstanding walking boots. Not heavy imho as reported in other reviews. High sided for good ankle support on uneven ground & with many well designed and well made features. Just what i required for exploring my new home in the breath-takingly gorgeous Cambrian mountains.",
      "rating": 5.0,
      "verified": true,
      "author": "stevek",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Great Boots",
      "text": "These are great boots wonderfully comfortable, waterproof and basically as good as you would expect, I did have an issue with the stitching inside and when I reported this a replacement arrive the following day. The new ones I’m wearing now whist on a walking holiday in Cumbria",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Carr",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Well made boots.",
      "text": "Extremely comfortable walking boots, appear well made, but time will tell. May be worth getting a 1/2 or one size up. The soles are a little stiff to start off with, but soften with wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Pops",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Perfect fit and very good quality",
      "text": "I have had these for a month and they had a lot wear in the snow and slush. They are completely waterproof and comfortable to walk in. I have walked a lot around towns in the snow and ice and there was good grip and warmth. They feel really snug. I am an 8.5 UK and the 8.5 UK fit me perfectly. There is no visible sign of wear yet so they appear to be very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "c lisser",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "First Pair of Boots",
      "text": "Only recently taken up walking as a new hobby, so thought it wise to invest in a decent pair of boots. These fit exactly as expected. Provide lasting comfort on longer walks, and grip really well on some of the steeper inclines I've tackled. They've kept my feet dry whilst walking through boggy ground and are easy to clean given the simple design. I couldn't have asked for much more. The quality is evident as soon as taking them out the box. Great pair of boots!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Morris",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "You get what you pay for . excellence !!!!",
      "text": "These are really the Rolls Royce of Hiking/ Hill climbing/ Dog walking boots. Good fit and very comfortable , also completely water proof. Expensive yes but well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "ANTHONY OLIVER",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Feel sturdy comfortable and waterproof",
      "text": "Arrived super fast. They are a replacement for a pair of walking boots I had for 16 years (another brand but similar style), so i hope they last as long. I have worn them in wet grass walking the dog and so far so waterproof. They are very comfortable which I was worried about when ordering online but they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Highly recommend",
      "text": "Although they where scuffed on the front within 2 times off wearing them while beating (I didn’t think the material through)... they are long lasting, memory foam material for the sole inside, decent grip on them, exactly how it looks in the picture, partner loves them",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina H.",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Sturdy, comfortable and 100% waterproof.",
      "text": "I bought these prior to a week's hiking in the Lake District, and I am pleased I did. They are sturdy over rocky terrain and so far are 100% waterproof. They were comfortable straight away, but felt better after a couple of hours walking. They are a little warm in hot conditions, and heavier than some boots, but they are a good all rounder at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dirt Biker",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great Boots",
      "text": "These Boots look and fit exactly right this is the second time I have bought these boots had to replace as the old ones they were wearing out after 4 years",
      "rating": 5.0,
      "verified": true,
      "author": "john phipps",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Most comfortable Hiking Boot , They are like a pillow on my feet!",
      "text": "Highly recommend for comfort , highly recommend for quality and highly recommend for value, What can I say? Gore-Tex? Comfort? Rugged? and Look nice as well?",
      "rating": 5.0,
      "verified": true,
      "author": "PeterTc",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great boots, but not quite wide enough",
      "text": "I would love to give these boots a 5 star review: they are great quality and looked really solid to me with a number of good features. They were just marginally too narrow though, so I had to return them. On the maximum size, so there’s nowhere else I can go. At least I know Berghaus are not quite the right fit for me. Merrell seem better for wider/larger feet.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Chapman",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Comfortable",
      "text": "These are the best walking boots we have bought. We do a lot of walking. This is my husband's second pair. He had his old ones for years. I am on my second pair too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. S",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "A very good boot.",
      "text": "It took 3 days before they felt truly comfortable, but after that they are a pleasure to wear. I walk 5 to 8 miles a day on rough tracks and wet fields and they are supportive and waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "J Jeffery",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Forest trek or rocky trail - like walking in slippers on carpet!",
      "text": "A beautiful long lasting design; they are waterproof, durable and comfortable, they look good and grip well even in slippy mud, which is easily rinsed off - if you buy them, you will agree, I'm sure. I think they may be a gnats crotchet larger than my normal size 10 fit, but nothing a second pair of thick socks couldn't fix. Say goodbye to cheap quality!",
      "rating": 5.0,
      "verified": true,
      "author": "rat weston",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great boots, even better with Black Friday price!",
      "text": "I bought these boots in the Black Friday deals for £72 which I thought was a great price. It’s more than I’ve ever paid for any other boots. I’ve used them over the last few days walking my dogs down by the river and through woodland areas. Very comfy and waterproof. Hoping they’ll last many years not like my previous ones which seeped water in after a couple of months!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Glue missing",
      "text": "So disappointing. Right shoe's sole missing some glue... Left seemed just perfect. Had to return on the same day...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200731
    },
    {
      "title": "Great boot",
      "text": "I dithered about ordering these boots, wish I didn’t waste my time. They are ace. I have no problems at all and they are super comfy. Went for half a size bigger, glad I did. Would definitely recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "Mr P Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Quality with style",
      "text": "Really nice boots , get half sise up for a good fit with room for thick socks ..",
      "rating": 5.0,
      "verified": true,
      "author": "forist1",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Tough hard wearing boots.",
      "text": "This is my 2nd pair of these boots. They are rugged and hard wearing. I still have my first pair which are still in excellent condition that I now use for work as I need waterproof boots there. To be fair I mostly wear them traveling and on urban walks but you can easily wear these boots all day and they are still comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Sinclair",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Great boots and waterproof.",
      "text": "I had a pair of Jack Wolfskin boots that looked great but let in water first time so sent them back. I’ve had these shoes 2 weeks and they have been worn daily. Not the best looking but for the fact they are walking boots they’ve performed perfectly. 100% waterproof so far",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Gr Knight",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Excellent boots, feet warm, dry & great fit.",
      "text": "Fab boots, husband loves them, feet are dry and warm. Bought his usual size & they fit perfect. Look smart too.",
      "rating": 5.0,
      "verified": true,
      "author": "sibe",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Good comfortable boots",
      "text": "Always comfortable, worn this type for years even before they were Berghaus. Always my first choice, I get through a pair about every 15 months or so - worn every day in all weather conditions",
      "rating": 5.0,
      "verified": true,
      "author": "E M.",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Shane had to get replacement after 3 weeks",
      "text": "this is the 3rd pair of these boots my husband has had, unfortunately this time after 3 weeks of wearing them to walk the dogs, two of the eyelets became detached from the leather...Amazon sent a replacement the following day, but we did expect them to last a lot longer, based on the other 2 pairs I'd give it 5 stars",
      "rating": 3.0,
      "verified": true,
      "author": "LouLou",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Great walking boot",
      "text": "These boots are simply brilliant. I was a little ner ous when I first got them that I would find one shoe slightly too low on the toe, but took the plunge, wore them outside on a couple of strolls and they have proven themselves to be fantastic. Very comfortable sole, good grip. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam W",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "A good quality product.",
      "text": "Brilliant quality as expected from Berghaus and a lovely fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Good boots",
      "text": "Very comfy, looks good, waterproof, and warm. What more could you want?",
      "rating": 5.0,
      "verified": true,
      "author": "dsxfdsf",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Excellent boots",
      "text": "I'm not a great walker but these are comfortable and very robust. I really like them",
      "rating": 5.0,
      "verified": true,
      "author": "Mr S.",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "fitted ok",
      "text": "nice design.very comfortable.I walk a lot and comfort is very important.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Good Quality boots.",
      "text": "Excellent comfortable boots that keep your feet dry, they look good and feel sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitchenwise F.",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Great shoes. Would recommend.",
      "text": "Loved the fit - comfortable lining for ankle. Totally waterproof- feet kept dry! Lovely sole - grip is great. Now looking to buy similar pair but without the ankle support.",
      "rating": 5.0,
      "verified": true,
      "author": "MR AJAY  MANDALIA",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Comfortable.",
      "text": "Have been wearing for 12 months now. Super comfortable, great for walks and hiking. Very sturdy. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Downes",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "You get what you pay for.",
      "text": "Fitted like a glove from the moment I put them on, more than impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "very good purchase",
      "text": "This is the 5th pair of boots bought and never had any of them give any issue",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Davies",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Good boots",
      "text": "Good boots, just got them so I'll update after 3 months, see if they last.",
      "rating": 5.0,
      "verified": true,
      "author": "ego",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Winter boots",
      "text": "Bought it for the rough weather conditions in Bulgaria. Whole season haven’t let me down.",
      "rating": 5.0,
      "verified": true,
      "author": "george",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Great walking boot",
      "text": "This is a great boot, does not pinch. The soles are very supportive and you feel no underfoot irregularity. I am currently walking 25-30km a day blister free and 😁👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "stan",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Very good",
      "text": "Excellent boots. Very comfortable and quick to wear in. Watertight. Sizing appears accurate - I measured my feet to get exact shoe size and the fit was spot on",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Great purchase",
      "text": "Fantastic purchase for my husband who cannot praise them enough",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Excellent",
      "text": "Got this product for national 3 peaks and it worked brilliant. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "David Ronan",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "good quality, worth the money",
      "text": "90% happy with first walk and getting better each walk as they get alittle more supple",
      "rating": 5.0,
      "verified": true,
      "author": "brian webb",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Excellent buy",
      "text": "Beautifully made. Good price. The boots were bought in a size 13 men’s for my son who struggles to buy shoes that fit him properly. 100% happy with the boots and the service from Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "waterproof",
      "text": "Actually waterproof . Spent an hour walking in long wet grass . Trousers were soaking wet up to the knees but feet stayed dry . Comfortable too .",
      "rating": 5.0,
      "verified": true,
      "author": "James G.",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great Boots",
      "text": "Perfect fit, wearing in was pain free, very comfortable boots Extremely high quality product. They are very quick to put on and off also.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Boots",
      "text": "Very comfortable and the quality is very plainly to see a very good boot",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Good quality tough boot",
      "text": "Previously had the explorer which lasted three years before the sole wore out. These have a tougher construction but consequently are not as flexible. They are however comfortable from first wear and have given me no problems on daily walks of 2-5km",
      "rating": 4.0,
      "verified": true,
      "author": "Dave S",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "High quality product, highly recommend",
      "text": "First time climbing a mountain, broke the boots in a few days before the climb just walking around the house, no blisters after the climb. Very good ankle support. In general a high quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin O'Connor",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Usual high quality Berghaus",
      "text": "Usual berghaus quality. Still breaking them in, although or the first few wears they seem comfortable straight out of the box. First long hill day in new boots coming up. Will know more then",
      "rating": 5.0,
      "verified": true,
      "author": "Ric",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Perfect",
      "text": "Very comfortable. Good quality walking boots and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss S Powell",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Stands up well on wet sandstone",
      "text": "Good comfortable fit though it did take a few miles to break them in. great on wet grass and wet stones Good sure footed boot",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Great walking boots!",
      "text": "Love the quality of the boot. The comfort is exceptional",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. James E. Lush",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "High quality walking boots",
      "text": "High quality walking boots, perfect for those autumnal strolls. Very impressed so far with the quality and overall performance with these boots. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "luke anderton",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Hikeing treats.",
      "text": "I've used the boots for a few hikes now and I am delighted with them , the wide toe suits me perfect and my feet are bone dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben.",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Like wearing slippers",
      "text": "Straight from the box out for a 5 hour walk. Felt really comfortable and good protection from the many rocks. Felt soft underfoot.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr D M Robertson",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Good product",
      "text": "As described- normally size 8 so went a big bigger for an insole",
      "rating": 4.0,
      "verified": true,
      "author": "Mick Buckle",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "A really good boot",
      "text": "Immediately comfortable; fit was just as I hoped. Look durable. Dry.",
      "rating": 5.0,
      "verified": true,
      "author": "david coldwell",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Worth every extra cent!",
      "text": "Absolutely brilliant quality product. Durable, comfortable, would definitely buy again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendon",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Decent Boot",
      "text": "Almost the same size as my old Brasher Hillmasters, comfortable, looking forward to a long trek to see how they perform.",
      "rating": 5.0,
      "verified": true,
      "author": "Nev",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Very comfortable",
      "text": "Fits like a glove. This is my third pair of these boots. Really can't fault them.",
      "rating": 5.0,
      "verified": true,
      "author": "ian wickenden",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Hillmaster 2",
      "text": "2nd pair of these berghaus boots, best boots I've ever had, and I've had quite a few over the years. Second to none.",
      "rating": 5.0,
      "verified": true,
      "author": "MicFin",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Brilliant",
      "text": "They are absolutely wonderful possibly the most comfortable fit I have ever had in a pair of walking boots",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Yes Waterproof",
      "text": "First walk included by an overflowed stream in about 3 inces af water/grass. Feet bone dry!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Loomes",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Very comfortable",
      "text": "As previously, these are just as good as last time!",
      "rating": 5.0,
      "verified": true,
      "author": "Jo H",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Walking",
      "text": "Too soon to say but very much looking forward to extended walks",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Good product",
      "text": "Really good product does what it says on the box",
      "rating": 4.0,
      "verified": true,
      "author": "J b green",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Good boots",
      "text": "Haven’t tested them properly yet but they are a study good looking boot",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Ideal for hiking",
      "text": "Very happy with the walking boots, comfy, look good would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss H.",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Boots",
      "text": "Happy with the boots really well made arrived on time",
      "rating": 5.0,
      "verified": true,
      "author": "Brian blanchfield",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Good fit",
      "text": "Perfect fit size14 and wide enough where I normally struggle",
      "rating": 5.0,
      "verified": true,
      "author": "terry barwick",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "No vat Receipt",
      "text": "You will not get a vat receipt, and good luck trying to get one",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Five Stars",
      "text": "My husband found these extremely comfortable and a fantastic fit. Very pleased with the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "McMillan",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Comfortable and well made pair of leather boots",
      "text": "Excellent well made pair of leather Gortex boots. Strongly suggest you get 1/2 to 1 size bigger than needed. First pair I received were a little tight. But these were exchanged without a problem and new pair quickly arrived. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Pops",
      "helpful_votes": 0,
      "publication_date": 20191123
    }
  ],
  "product_meta": {
    "title": "Berghaus Men's Hillmaster II Gore-Tex Walking Boots High Rise Hiking, Coffee Brown",
    "description": "A range of tried-and-tested comfort and performance features make this hill-walking boot a well-loved classic.Weight : 1416g/pair",
    "rating": 4.7,
    "feature_bullets": [
      "A range of tried-and-tested comfort and performance features make this hill-walking boot a well-loved classic",
      "Waterproof guarantee - thanks to the breathable Gore-Tex performance comfort membrane, even the wettest weather won’t reach your feet, while sweat can escape with ease",
      "Outer Material: Leather",
      "Inner Material: Textile",
      "Sole: Ethylene Vinyl Acetate",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Tailored to you - improved tongue and collar pattern with memory foam adapts to your feet and ankles for a truly bespoke fit",
      "Engineered heel support ensures stability",
      "Locking eyelets let you control tension across your arches"
    ],
    "specifications": {
      "Item Weight": "1.43 Kilograms",
      "Date First Available": "12 Jan. 2018",
      "Manufacturer": "Berghaus",
      "ASIN": "B08499KXGM",
      "Item model number": "4-21603",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Trekking & Hiking Footwear",
      "Shoes & Bags"
    ],
    "price": 184.87
  }
}