{
  "website_summaries": [
    {
      "verdict": "A versatile leather apron that can provide lightweight protection for all your messy shop chores.",
      "pros": [
        "Quality workmanship, strong and sturdy leather, unisex sizing, and plenty of pockets make this shop apron perfect for crafting, grilling, or working in the shop",
        "Clothing is protected from flames, sparks, dust, dirt, grease, and stains",
        "Headphone loop lets you listen without a cord dangling in your workspace"
      ],
      "cons": [
        "This shop apron is \"one size fits all\" and may not be suitable for wearers that are big or tall"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "An excellent leather apron for work with HOT metal",
      "text": "One of my hobbys is casting bullets from lead alloy for reloading ammunition, and now that I've had a stroke, I needed protection from spills of very hot metal. This leather apron from Leaseek fits the bill perfectly. The leather is sufficently thick to provide protection, but is still very flexible. I am a large man, but the length and width are more than enough to protect even me. Leaseek did an excellent job getting this to me quickly, and it is exactly as described (well, actually, a little better than described). Thanks again !! A great product at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 18,
      "publication_date": 20190507
    },
    {
      "title": "Protection against hot glass",
      "text": "I make glass beads and marbles and, having had one land in my lap (I set the chair on fire), wanted something that would protect my clothing and me from burns. So far, so good. Hopefully, I will never had to put it to the test on a large scale, but it's worked beautifully on a smaller scale. I had a glass rod \"pop\" when I put it in the flame and the apron kept a small shard from going down my shirt and one from landing on my leg. I would definitely buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Glass Gryphon",
      "helpful_votes": 17,
      "publication_date": 20200212
    },
    {
      "title": "Watch out for stains",
      "text": "On the clothes you are wearing, will leave orange die on them, not easy to wash out. Other than that it seems ok but I don't bother to wear it that much. Using another brand.",
      "rating": 3.0,
      "verified": true,
      "author": "arm",
      "helpful_votes": 4,
      "publication_date": 20190908
    },
    {
      "title": "Not accurate to the pic",
      "text": "Wanted something without pockets. Picked this ok ne in particular due to that reason. As you can see this apron is gonna grow two extra pockets while it's being delivered",
      "rating": 4.0,
      "verified": true,
      "author": "Jbgx7",
      "helpful_votes": 7,
      "publication_date": 20180709
    },
    {
      "title": "I think I made a great choice with this apron",
      "text": "Bought to use in jewelry workshop. The leather is supple, no odor. The straps are perfect since they're adjustable, all you have to do is fit it once, leave it like that and remove and replace it over your head. I was kinda concerned that I selected the one without pockets but now I'm not sure I needed them in the first place. Nothing about this apron to not like!",
      "rating": 5.0,
      "verified": true,
      "author": "Nadain",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Works well blacksmithing.",
      "text": "I am a 6'4' robust blacksmith, and this fits well. It wears comfortable, hangs correctly, seems to have quality leather at the appropriate thickness, and seldom needs adjustment. My experience is that overall it works well for me, and it didn't leave any type of colored residue or dye on my clothes. I like it and would buy again if needed.",
      "rating": 4.0,
      "verified": true,
      "author": "D.W.",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great product but only lasted 9 months light use",
      "text": "The product is great. I was hoping to get some years out of this. I have been using it for about 9 months now. I am only using for protection when I am deburing parts with a sanding disk. I am sad to say the stitches are giving out. I lost the front pocket last month and now the middle stiches are gone so it has a split down the middle now.",
      "rating": 2.0,
      "verified": true,
      "author": "Shawn Enos",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Easy to adjust",
      "text": "Bought this for my husband who casts lead bullets. He needed more protection from the hot lead. Its very easy for him to put on and adjust and is thick enough to protect against any splatters of lead.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara G.",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Pretty good aprons",
      "text": "These things are pretty awkward to put on, but the leather has some good thickness to them. I bought a few and they worked pretty decently.",
      "rating": 3.0,
      "verified": true,
      "author": "Keagan",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Does the job nicely",
      "text": "I’ve had many leather aprons over the years. This one is very nice quality. A thick leather. Fits well.",
      "rating": 5.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Tough!",
      "text": "I was not able to push a pin through this apron. I use it for grilling.",
      "rating": 5.0,
      "verified": true,
      "author": "Luna",
      "helpful_votes": 8,
      "publication_date": 20190904
    },
    {
      "title": "Great apron for welding protection",
      "text": "Only had a few months but it seems durable, straps design puts the weight on your shoulders not your neck, so it is more comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Charles R. Baringer",
      "helpful_votes": 9,
      "publication_date": 20200215
    },
    {
      "title": "Bueno",
      "text": "Great all around Holds up during actual welding I bought it for my dad who works as a welder and he has zero complaints He specifically appreciates the straps",
      "rating": 5.0,
      "verified": true,
      "author": "The Artist",
      "helpful_votes": 13,
      "publication_date": 20190929
    },
    {
      "title": "Picky husband approves",
      "text": "Great apron for my woodworker husband! He wears it all the times and loves the pockets!",
      "rating": 5.0,
      "verified": true,
      "author": "joelle v.",
      "helpful_votes": 12,
      "publication_date": 20191225
    },
    {
      "title": "Product Review",
      "text": "Item was packaged well, product looks like it is well constructed. Just started to use this item.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Grosse",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great buy.",
      "text": "Thick durable leather, comfortable and adjustable straps. Well worth the money...",
      "rating": 5.0,
      "verified": true,
      "author": "Enthusiast-Lite",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Good price",
      "text": "This was a gift for my husband, he likes it very much. It protects him while welding and cutting and saves his clothing also.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl L. McPherson",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Amazing Apron For MIG Welding",
      "text": "Amazing apron for MIG welding. Enough coverage, only bad thing is the leather quality. Mine had a lil tear and with me wearing it it got a big bigger but still love my apron.",
      "rating": 4.0,
      "verified": true,
      "author": "Francisco Garcia",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Good quality leather",
      "text": "It needs better straps but it very heavy duty for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Leather apron",
      "text": "Simple to throw on and does well when the sparks fly",
      "rating": 5.0,
      "verified": true,
      "author": "8o7o",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "A great cover up!",
      "text": "The apron does what I bought it for. If I was to add a feature I would add a pocket or holster for a tape measure. I'm using the apron in my small welding shop.",
      "rating": 4.0,
      "verified": true,
      "author": "Don Barber",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Smells like leather",
      "text": "As described, with a good weight of leather. Great for welding and grinding. Comfortable shoulder straps.",
      "rating": 5.0,
      "verified": true,
      "author": "Shop monkey",
      "helpful_votes": 9,
      "publication_date": 20180628
    },
    {
      "title": "Worth to buy",
      "text": "I use it welding and fabricating. It's excellent. Comfortable and simple",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Gertino",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "other than that it feels like good quality",
      "text": "I would give give it five stars if i could only stop adjusting it constantly, other than that it feels like good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "The Amazonian Taíno.",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Five Stars",
      "text": "outstanding real leather tough good for trimming my two horses",
      "rating": 5.0,
      "verified": true,
      "author": "Billy Blackmon",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great product",
      "text": "I purchased this item for my 15 year old daughter, who started welding training. Size is perfect and the thickness. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerold K.",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Five Stars",
      "text": "Excellent quality !! Good fit and comfortable straps which after a long day is important.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Osborne",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Excellent apron!",
      "text": "Excellent work apron!!!! I can see using it for years, maybe even passing it down.",
      "rating": 5.0,
      "verified": true,
      "author": "Parallel Angel",
      "helpful_votes": 10,
      "publication_date": 20180620
    },
    {
      "title": "Great buy! Would buy again!",
      "text": "Really good buy for wood working. Easy to clean and adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Awesome!",
      "text": "I work with all type of metals and heat . This product is great! I like it and Worth it",
      "rating": 4.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "very good quality but be careful of the metal rivets that ...",
      "text": "very good quality but be careful of the metal rivets that hold the pocket on, it can scratch the parts you are working on",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Good",
      "text": "Nice product I bought for a Xmas gift no rating on product yet",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Mayfileld",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Care for leather.",
      "text": "Love it. The simplicity is nice as well as the price.",
      "rating": 5.0,
      "verified": true,
      "author": "George Tabor",
      "helpful_votes": 0,
      "publication_date": 20181119
    }
  ],
  "product_meta": {
    "title": "LEASEEK Leather Welding Work Apron - Heat Resistant & Flame Resistant Bib Apron, Flame Retardant Heavy Duty BBQ Apron, Adjustable Fit M-XXXL Men & Women (24\" X 36\")",
    "description": "LeaSeek welding work apron protect your clothing and skin until the knee when you are working.",
    "rating": 4.7,
    "feature_bullets": [
      "DOUBLE STITCHED, DURABLE and LASTING: Handcrafted from Flame Retardant Cowhide Leather. Sewed with strong, heat resistant US thread. Double stitched tool pockets with Rivets.",
      "COMFORTABLE STRAP DESIGN: Prevent neck pain with our cross back strap design. Full coverage bib apron is 24 inches wide x 36 inches tall for unisex sizing. Extra long straps allow for a range of adjustments.",
      "TOOL POCKETS: 1 reinforced pockets for tools, cell phone or other work accessories. We also offer the customer great convenience as much as possible.",
      "MULTI APRON: They are not only for welding but also useful for many other work and home tasks. Idea for tool apron with pockets, utility apron, tools apron, shop apron for carpenters, woodworkers, woodshop, workshop, garage, machinists, tattoo artists, barbers, bartenders, leatherwork, metalwork, metalsmith, blacksmiths, crafts, lathe, baristas, butchers, brewers, painters, men's apron, woodworking tools, safety apron, protective apron, etc. Unique gift for adult, men, women, mothers, fathers.",
      "LEASEEK GUARANTEE: This High Quality bib apron is BUILT-TO-LAST. LEASEEK guarantee that you don't need any reason to refund or replace this apron!!"
    ],
    "categories": [
      "Protective Workwear",
      "Personal Protective Equipment",
      "Aprons",
      "Clothing, Shoes & Jewelry",
      "Tools & Home Improvement",
      "Safety Apparel",
      "Safety & Security"
    ],
    "price": 26.95,
    "specifications": {}
  }
}