{
  "website_summaries": [
    {
      "verdict": "A top of the line inflatable lounger that offers quality and a number of handy features.",
      "pros": [
        "Choice of colors",
        "Very durable and holds up to kids well",
        "Not prone to self-deflating",
        "Comes with a variety of features and add-ons, such as a pocket, water bottle holder, and bottle opener",
        "Good quality"
      ],
      "cons": [
        "Storage bag is a little small",
        "Some buyers had problems getting it to fully inflate"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome camp couch",
      "text": "The only reason that I don't give 5 stars is that it continues to slowly leak air... I've had mine replaced 3 times by the company and every single one of them has a slow air leak, I just don't understand why it is so difficult to address this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Sturtz",
      "helpful_votes": 6,
      "publication_date": 20180914
    },
    {
      "title": "Fun outdoor furniture!",
      "text": "I bought the Inflatable Lounger after having success with Legit Camping’s hammock. I have seen these air-pillow things online, too, and had always been curious if they actually worked. This is great! Took a few seconds to inflate (although I would suggest inflating outside, not inside). My boyfriend and I were able to both lie on it without any air loss. He actually took a nap on it to break it in, lol. I wouldn’t recommend trying this, but my dog did end up jumping on without any issues, too. I’m looking forward to trying it on the water!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Frick",
      "helpful_votes": 3,
      "publication_date": 20171126
    },
    {
      "title": "Misleading colors.",
      "text": "Overall, great product. I wish I could have given it while 5 stars, however I bought it especially for military field training. Unfortunately the colors advertised are very off and too bright to be accepted by the Army. I will be keeping it - after inflation (I got annoyed and just ides a pump to fill it in to try it out) it is incredibly comfortable. I spent my afternoon reading a book on the lounger instead of on the couch. It will not hold air for more than 2 days before you’ll need to refill it to have enough bounce.",
      "rating": 3.0,
      "verified": true,
      "author": "TheBarkingH0use",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "This Lounger is Legit!",
      "text": "I've been looking at these loungers for months now. When I saw Legit had I knew I had to get it. I just love the Legit products. They are well made and easy to take with you. As soon as we received it we set it up. Super easy too. It is recommended in watching the video which we did but if we hadn't I think we would've figured it out too. It is comfortable and fun to sit or lay down on. All of us had to try it out and all agree that we need to buy two more these. Worth the money especially since it has a lifetime warranty!",
      "rating": 5.0,
      "verified": true,
      "author": "GMAP",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "Excellent quality",
      "text": "For starters, the quality of this Inflatable Lounger is absolutely excellent! Similar to the Hammock material if you're familiar with that. The carrying pouch is also of great quality very compact. The only negative feedback I have with this product is that it does take a bit more than a minute to inflate and does take some practice. . . (Or some time to watch the video)But at no point did I feel like I was using this as a wind sock and was able to get a nice fill in my studio apartment. . . So I imagine outdoor use will be even better. Definitely handy, and no complaints on the beer opener either!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Comfy lounger for a big guy 6'1\" 250lbs",
      "text": "I have a legit hammock ans bug net. When I seen they were bringing out a lounger I wanted to try one. It is comfy, was watching football while lying in it. Im 6'1\" 250 and this thing didn't lose air. It may seem like you didn't get enough air. Just start wrapping it shut and it will swell up. Came with carry bag, and a stake with carabinerso you can stake it to the ground so it doesn't blow away.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 3,
      "publication_date": 20171104
    },
    {
      "title": "Great Idea, but difficult to fill with air.",
      "text": "Not very easy to fill with air. I tried it for quite a while to get enough air in it for actual use, but I don't think I have enough room with all the furniture in the way. Their instruction video was in a pretty large empty room and they made it look easier than it really is in real life.",
      "rating": 3.0,
      "verified": true,
      "author": "LTAZ39",
      "helpful_votes": 5,
      "publication_date": 20171203
    },
    {
      "title": "Easier than I thought to inflate.",
      "text": "I am excited about this product. I've always seen these inflatable loungers, but was undecided on getting one. I finally purchased this one and I love it! I am currently a 3rd year medical student on my surgery rotation. We are required to work 28hr shifts a few times during our 8 week rotation. This lounger will be perfect in the student lounge room during that 1am - 7am time period during my shift! (What a way to use this huh?!). I purchased a color that matches my Legit Camping Hammock! I can't wait to take this outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Lamere Buchanan",
      "helpful_votes": 4,
      "publication_date": 20171201
    },
    {
      "title": "I wish it worked",
      "text": "I purchased two and tried to blow one of them But noticed that stitches are coming off in the middle where two compartments are attached. I still tried to blow it according to the instructions unfortunately it’s not staying inflated. Not sure where the leak is. I am afraid to open the another one. Was hoping to use them not until spring. I am glad I opened one now. I wish it worked seems like it would have been a fun thing.",
      "rating": 3.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "**CAMO COLOR IS NOT AS LISTED**",
      "text": "I was really excited to buy this and mechanically it works great, exactly as advertised. I ordered the camo that is listed as a traditional black, brown, and green camo. However, the one I received is a very bright lime green camo that will not work for the application I indended in using it for. I reached out to the company to see if this was an packing accident or if it’s listed incorrectly. I’m currently waiting to hear back and will update this on what they say.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob Almquist",
      "helpful_votes": 2,
      "publication_date": 20190424
    },
    {
      "title": "It was GREAT until it STOPPED WORKING",
      "text": "I had the item for about 8 weeks and used it at the beach over the summer time. Because it was so comfortable and did provide several weekends of relaxation, i choose not to return it (felt i got my moneys worth). However, I'm not purchasing another one. It was nice to have but not returning every 6-8 weeks. For anyone who can not get this to inflate indoor is NOT doing it correctly. This thing took me less than a minute or two to inflate. Beach even quicker. If your having problems, get on youtube and they will show you the correct way.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric R Andrews",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "I love this inflatable lounger!",
      "text": "I love this inflatable lounger! I bought one before that was literally impossible to inflate. Felt like an idiot. I loved the idea but it just did not work. Decided to try this one because the design looked so much smarter. It is definitely easier to inflate and I love that it comes with an easy way to make it stay where I want it. The last one we had blowing around making it hard to use on a camping trip.",
      "rating": 5.0,
      "verified": true,
      "author": "A.M",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "WoW!",
      "text": "I got this as a gift for my dad who camps/travels a lot! It's really easy to pack, does not take up too much room! Inflating it can be tricky, you need a good gust of wind in order to get it fully inflated! We set up a fan to help blow some more air into it! I am not sure ho well it'd work without wind?",
      "rating": 5.0,
      "verified": true,
      "author": "Katie T",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Like sitting on air",
      "text": "Based on my positive experience with Legit hammocks, I decided to give the Legit Lounger a try. It was raining when my lounger arrived and my first attempt to inflate indoors was not very successful. The instructions gave a URL for instructional videos but the URL was not valid. After a couple more attempts I worked out a technique and inflated the lounger. It seems pretty comfortable and relaxing, so I'll have to try Sunday afternoon nap next weekend. My four stars may go to a five if I can inflate more easily out of doors. Maybe I'll get really Legit and try a lounger in a hammock. Then I'd really be floating on air.",
      "rating": 4.0,
      "verified": true,
      "author": "MattC",
      "helpful_votes": 2,
      "publication_date": 20171108
    },
    {
      "title": "Don’t buy it.",
      "text": "I filled it up only 3/4 of the way. Rolled the ends the way I was instructed, gently sat in it, laid there completely still for two mins, and when I turned my head to the side while keeping my body completely still it popped. A big hole in one of the seems at the bottom. Whole thing was ruined that easy. Total waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Patti T.",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Awesome",
      "text": "I absolutely loved this lounger! We carried them to Talladega and were able to easily inflate them on the first try!. We were able to use them as a single person lounger as well as a couch for two people. It is very comfortable both ways even though single person lounger was my favorite! With two people, it is a little low backed but still comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "sherryd",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Better than its peers",
      "text": "After being somewhat bewildered by the number of choices in this space, I bought this one and a competitor’s product that was $6 less. The fabric on Legit’s was considerably thicker than their competitors, it was slightly easier to inflate, and held its structure better when we used it. Both lost air standing overnight, but the inflation process was easy enough. In the end I would definitely choose paying the extra $6 as I think it will be much more durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Pops947",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "We keep one in all our vehicles.",
      "text": "They’re easier to inflate if you hang them out a car window and gun it real quick. We spend a lot of time outside, so always having one of these on hand is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Sterling Archer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Great lounger! I haven't tried any others",
      "text": "Great lounger! I haven't tried any others, so I don't have anything to compare it to but this one is comfortable and easy to inflate. Seems to hold air pretty well, too. It is much larger than I expected so I had some trouble inflating it in my admittedly small living room. I ended up cheating and using a box fan, but if I was able to inflate this in a larger area it wouldn't be a problem. I did get it about 60% inflated without the fan in about 3 tries.",
      "rating": 5.0,
      "verified": true,
      "author": "ixat",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Works as advertised, but take note on the camo pattern.",
      "text": "Lounger works as advertised. I'm sure I will get better at the art of trapping enough air to keep a 6'2\" me or a 4'something mini me sufficiently aloft on the 'chair'. Please Note: The one knock it gets is the camo pattern. It does NOT match the camo pattern I thought I was buying. It's too 'bright'. Not a huge concern, but needless to say I'm not 100% happy either. Looking forward to seeing how it works out on the July camping trip.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Hannifin",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Best one yet",
      "text": "I have had 3 different inflatable loungers made by 3 different companies and this one is the best. My original one was good (air nest), but popped after 2 years. The second one (pouch couch) was a piece of junk and wouldn’t hold air more than 30 minutes. This one is awesome! It has good stability once inflated and it holds air really well. The back piece is really comfortable. It is sturdy and made of strong material. I’m very happy with this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Marla K Pidgeon",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Legit chilling",
      "text": "The Legit inflatable lounger was out of the box, inflated, and ready for family testing in under ten minutes. With a slight bit of improved form, I estimate it'd take just under a few minutes next time. Everyone was sad to see it deflated and packed up (which only took a minute). It was immediately reinflated and reserved by my 12 year old daughter who designated it her new chill and read spot.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Not as easy to fill up as they claim unless you are ...",
      "text": "Not as easy to fill up as they claim unless you are 12 feet tall. Perhaps I dont have the hang of it but we wound up gerry rigging an inflable pumpo to blow it up. Limited range of motion laying on this but if you lay straight back and dont move it is comfy.",
      "rating": 3.0,
      "verified": true,
      "author": "Truth Monger",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "My boyfriend LOVES this",
      "text": "I bought this for my boyfriend as a birthday gift this past summer and he absolutely loves it. He's 6'2\" and still finds it comfortable to lay on. He takes it camping and to work for while they are hanging out around the shop. It was tricky to figure out how to fill at first, but after a few times hes got it down. Even used it as a blow up mattress for his 8 year old nephew. Super happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "AUTUMN",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "More novelty",
      "text": "This item is more of a novelty item as it is not so comfortable nor is it easy to inflate. Once you do have it inflated and lay in it, it's not very comfortable and it starts to self deflate within 5 to 10 minutes. Overall disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "M.H",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Defective/deflates within a few hours, no weight.",
      "text": "Used it once indoors to test. Next time I went to use it wouldn't hold air for more than a few hours. Left it filled without using, next morning it was halfway deflated. I own a similar item from another company, no issues after repeated use.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Logan",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "More people need this in their lives!",
      "text": "This item has so many applications. It is SO comfortable. I inflate this in my backyard, the beach, the park, where ever. Once you get the hang of inflating it, it's so easy. It also packs up so small. I have also taken this into the ocean and had a kid floating on it, I personally haven't tried to float on it, but it does float. Everyone wants to sit/lay on this that I need to get another one or two!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie J.",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Need to fold it 6 times",
      "text": "To make sure the air stays in you need to fold it at least 6 TIMES. They recommend 4 times and that was not enough to keep the air in for long periods of time. Another tip if you're inside is to first fill it using the swinging motion to get air inside. Then just use an electronic blower to fill the rest of the lounger. Again lots of reviews talk about air not staying in the lounger; fold it 6 TIMES!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Hutchins",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Hard to inflate, doesn’t hold air",
      "text": "Very hard to use. Getting it inflated takes a good amount of time and energy. Once we finally got it there it deflated within 5-10 min. We made several attempts throughout the night and it failed to hold air every time.",
      "rating": 1.0,
      "verified": true,
      "author": "Tessa",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "awesome product",
      "text": "Have bought these before, love them, kids love them, they are very comfortable and this one I bought for the boss, he's very excited to try it and said his kids tried it out and love it",
      "rating": 5.0,
      "verified": true,
      "author": "SRO",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Best gift",
      "text": "I got this for my very active son. He is always on the go doing outdoor activities and really liked this. Easy to inflate and comfy. Compact to take along with little space . Great for any outdoor places, lake, camping, bonfires and back of truck when watching fireworks or gazing at the star's.....",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Polachek",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Loungers are the best way to beach",
      "text": "I love this lounger! I went with this one because it is a reputable brand and I felt comfortable with the product I would receive. I was not disappointed! These loungers are the envied item on the beach! I constantly have people checking them out from a distance or coming up to comment! I gladly help them decide to get one! I also recently brought it on a float down an easy flowing river (I did get wet through it but stayed afloat) and it was great!",
      "rating": 5.0,
      "verified": true,
      "author": "Candace",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Fun for soccer tournaments",
      "text": "Used between soccer games at tournaments and always a hit with the kids! I wish the kids could fill it but only dad seems to know what it takes. I think comfort would be 5 stars if we could get more air into it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Love love love!",
      "text": "I bought this for my boyfriend and he absolutely loved it! We brought it to the park and set it up there. We got so many comments of people passing by, it was awesome haha. One critique I do have is that it looks a bit hard to inflate. My boyfriend ended up spinning in a million circles trying to get air into it. But if you don't fill it up all the way, it actually makes it more comfortable! Packs easily. Very portable. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Emi",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Not comfortable",
      "text": "You need a lot of wind to inflate this. Or a lot of arm power! If it's under-inflated, it's definitely less comfortable. Even when it's fully inflated, it isn't the most ergonomic for your low back. I missed the return-by date.",
      "rating": 3.0,
      "verified": true,
      "author": "Allie K.",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Dangerously comfy!!",
      "text": "I love this this thing!! Fits in a super small and convenient bag and easily blows up into a big lounger fit for you n your boo. So far I've used it in my yard and a 4 day camping music festival and it's held the air well. So happy about the lifetime warranty, although I don't feel as if I'll have to use it any time soon because it's so sturdy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger Thomas",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Perfect for camping!",
      "text": "Haven’t really gotten the chance to use it. Purchased 2 and can’t wait for a summer of beaches and camping! Tested 1 out when they got in! Super easy to assemble and comfortable. Thinking I shouldn’t of gotten black.. feeling like it will get hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Pic7kles",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Nice for lounging.",
      "text": "I used this for camping. It lasted about 30 nights before getting a leak on the inside of the liner. I would have given it a better review if it would have held up longer.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Big and comfortable",
      "text": "Huge! Wasn't the easiest to inflate the first time, but I think that was simply not being used to it. Other than that, the perfect outdoor companion! Edit: update- after using it a few more times, it's great. Just took it to the beach last weekend and it was super comfy. Super light to carry to the beach and great to lounge in. Definitely would recommend one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "fmn621",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Dont waste your money",
      "text": "My son got this for cmas. It was a complete waste of money. It is impossible to fill. And when we used the fan trick to fill it, it deflated after 5 mins.",
      "rating": 1.0,
      "verified": true,
      "author": "DLS1404",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Good lounger",
      "text": "I haven't used it outside of the yard yet, but it worked like it was supposed to. I've never used one of these before so at first I didn't think there was a way to get enough air in it without any wind, but as soon as you roll it up some, theres a lot more air in it than it looks!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynette",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Leaked right away",
      "text": "I was able to get it I floated (not easily but was able to) and as soon as I laid down I could hear that there was a hole. If I left it alone with no one on it, it would be deflated in no time.",
      "rating": 1.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Still trying to figure out if it’s a good purchase or not",
      "text": "Got for Xmas for the kids. Hard to get air in. Even watched videos and we still can’t get enough air in. But seems like a good idea if we can get it to work",
      "rating": 4.0,
      "verified": true,
      "author": "Tamara T. Williamson",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Comfortable, but hard to fill with air.",
      "text": "Difficult to fill with air. Maybe with a breeze or something. In order to use with kids, it needs to be almost 100% filled. It is very comfortable though. My kids spent all morning using like one of those blobs you launch people into lakes with. If you fill it just right and get a small kid on one side, you can send them flying.",
      "rating": 5.0,
      "verified": true,
      "author": "mkearl",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Versatile, Durable, Portable...beach, poolside, camping, or pretty much anywhere you want to sitback and relax.",
      "text": "I've purchased products from Legit Camping before and was more than pleased with the quality and functionality of their gear and their prices are much more reasonable than similar products. This lounger is no exception--I'm actually writing this review while enjoying my new lounger. The material is lightweight and seems durable (i.e., I'm not afraid the air chambers will be punctured if I used it outside). My kids thought it was great and this may become the new favorite place to sit in the house to watch TV! I definitely plan on getting some use out of this by the pool next summer, when I go camping or to the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Watch video before using!",
      "text": "Love this thing! Watch the video before attempting to inflate it, it’ll save you a lot of trouble. Made it through a camping trip in the desert. Everyone was fighting for their turn to use it. Easy to wipe off once it got dirty too. Stores nicely!",
      "rating": 5.0,
      "verified": true,
      "author": "GN",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "I love my Legit camping hammock",
      "text": "I love my Legit camping hammock, so I was excited to try this lounger! The material is good quality, the color is lovely, but I had some issues getting it to inflate. That being said, I did get enough air in there to make more of a chair than a couch, and that was quite comfortable. Didn't seem to deflate at all and I love the little pillow part. I'm looking forward to getting the hang of inflating it, because it seems like a lot of fun!",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Easy to pack",
      "text": "This was easier to inflate once I watched some you tube videos on how to inflate. It’s harder to get out of than I thought it would be. But it is comfortable and great to take camping. I took this to Alaska to relax by the river.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Abbott",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Too Legit to Quit",
      "text": "I bought Legit Camping’s double hammock this summer, and I was very happy with that product. I saw an inflatable lounger at a music festival last year and thought they were a really unique idea. This product meets my expectations on build and quality, and I’ve only tested it out indoors currently, so I’ll give it 4 Stars until I can update my review after having some more time to fully utilize this product. I enjoyed the comfort level lying on the inflatable lounger, and it definitely gives you the ability to have a couch almost anywhere you go. Great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "So dope i bought it twice",
      "text": "Got one of these for my brother this past Christmas and I thought it was so cool I ordered a second one for myself before his even got to my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob G",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Cool novel inflatable lounger.",
      "text": "Cool novel lounger. Lightweight inflatable couch (uses a liner to hold air). Once you fill it with air once, it works easy. A slight breeze would help inflate. Relaxing to sit in. I expect it will be fun at the swimming hole. Has a side pocket and a ground stake to secure it.",
      "rating": 5.0,
      "verified": true,
      "author": "El Gordo",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "JUNK",
      "text": "Bought this for my 17 year old son and not only did it fail to hold air, one of the handles began to detach.",
      "rating": 1.0,
      "verified": true,
      "author": "Funsized",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Very easy to fill to chair length, easy to put back in pouch",
      "text": "A meeting inside with only hard chairs. It's a bit tough to get out of gracefully and the plastic inside makes some noise when you move around. All in all I'm very pleased. Very comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi Dixner",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great lounger",
      "text": "I already own a Legit hammock, and was excited to try out this lounger. Compared to the other inflatable lounger I have, this one is definitely easier to inflate. You still need either a bit of wind and/or to run with the air compartment open to get it to fill, but the design of this lounger (2 compartments instead of one) really helps, because you can close one while you're trying to inflate the other. The lounger is comfortable once inflated - I love the headrest and side pocket for keys.",
      "rating": 5.0,
      "verified": true,
      "author": "bedouin dress",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Broke a sweat trying to inflate!",
      "text": "You would need a power inflator or stiff breeze to get this thing inflated. A group of us took turns trying to make it work with not any luck. After close to an hour of us running around the yard on Christmas morning like a bunch of knuckle heads, we gave up. Good though.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Tynan",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Don’t waste your money",
      "text": "Honestly waste of money. It does not inflate the way they instruct to do it and then even with power air it did not inflate. Was super hopeful for this item but it definitely does not deliver expected outcome.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeannine Moore",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "It is like I am floating!!!",
      "text": "Wow. I was very skeptical that this would support me, but it did, no problems. The most unexpected thing is that I never felt like I was going to fall out of it. I am sitting in this as I type the review and my kids are crowding around waiting for a turn. Would definitely recommend to prospective buyers.",
      "rating": 5.0,
      "verified": true,
      "author": "Wesley A Ader",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "High Quality!",
      "text": "This thing is fun! It was a bit larger than I thought when in the stuff sack, however upon removing it for the first time, I was really impressed by the quality of the materials. The buckle is heavy duty with a safety button, and the nylon feels like it can withstand a beating. It is easy to inflate and there is even an instructional video if needed. Really happy with this purchase, taking it to the woods this weekend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Easy to get air in!",
      "text": "I had bought similar items to this one before and they were SOOO hard to get any air in them. This one was much easier and I love the head pillow pouch. The bag for carrying is nice too. My dog didn't know what to think while I tried it out in the backyard. I have gotten other Legit Camping items and have loved them all, which is why I tried theirs and was very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "embiaaa",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Needs a breeze",
      "text": "This has changed the way I go to the beach/park. I love this thing BUT you have to have a breeze or it’s basically impossible to inflate",
      "rating": 5.0,
      "verified": true,
      "author": "bakeyou",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Great gift",
      "text": "Takes some time to get the air in there good, but it gives the kids some exercise lol.",
      "rating": 5.0,
      "verified": true,
      "author": "James Brown",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "An awesome fun invention!",
      "text": "These are awesome! I find myself giggling like a crazy loon as I run about opening and closing the lounger like a waving wind shark gulping oxygen. My reward, a cozy, comfy nest to read in. I love this thing so much, I’m giving them out at bdays and holidays as gifts. Great way to share the love!",
      "rating": 5.0,
      "verified": true,
      "author": "SarC",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Outer layer ripped open on first sitting",
      "text": "Concept seems neat and probably works fine for children and smaller adults. The seat itself is comfortable enough. Unfortunately our lounger started to tear on one of the corner seams after briefly supporting two average adults. Me being 6 foot 180 lbs and her being 5'4 yada yada. Luckily only the outer layer has ripped and not the air bag inside so we'll try to patch it up ourselves but I wouldn't rate a home remedy 5 stars. Additionally the inflating process requires a bit more elbow grease and/or creative thinking than the instructions would lead you to believe.",
      "rating": 2.0,
      "verified": true,
      "author": "JJK",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Legit! Comfy and easy to set up.",
      "text": "Legit! As soon as I received the box, I opened the package and set it up easily. Seconds later my kids were fighting to try it out. End of story... I'm thinking about buying another so I can get a chance to lounge. Seems sturdy and is definitely super comfy. Can't wait to take it on my next beach/camping trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Perry",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Durable, comfortable, and fun!",
      "text": "I was not sure what to expect. I love Legit products. I own several of their hammocks, sleeping pad, and now this! I'll definitely make use of this lounger next summer. My kids love it already. Fun to lounge around in. Quite easy to inflate. Just scoop up a bunch of air, and you are good to go. It has a nice pillow built in. A tie down and stake is included. Nice pouch on the side. Product seems quite durable. If you are in the market for a lounger, you cant go wrong here.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy E",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Comfort on the go!",
      "text": "I use this amazing thing all of the time at outdoor events, parks, beach, movies in the park, camping, etc.. It's easy to unpack, inflate, deflate, and repack.",
      "rating": 5.0,
      "verified": true,
      "author": "Vegatron",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Worked great until it fell apart",
      "text": "Worked great while it lasted. Unfortunately the seams came apart and now it's useless. Will buy from competitor to see if that will last longer.",
      "rating": 2.0,
      "verified": true,
      "author": "mon",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Be the envy",
      "text": "This came today so we brought it along on our camping trip. So glad I did, this thing is absolutely fantastic. I have been the envy of our friends while lounging around the fire pit tonight. Can not wait to try it out this summer on the water. Thanks again for another amazing product.",
      "rating": 5.0,
      "verified": true,
      "author": "S. FrostTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "wont hold air long",
      "text": "very comfortable and easy to inflate, but wont hold air for long. i have tried rolling it tighter and such to no avail. Its a shame because it would be 5 stars all around if it worked better.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Great chair",
      "text": "This chair is great! A little hard to inflate, but that would be the same for any other brand. I just slept on it for 3 nights while camping and it was very comfortable. The material barely made me sweat.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon Gering",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Another great product.",
      "text": "I purchased one of these after owning two of their hammocks! Their name says it all, everything they make is Legit! I never used one of these before and within ten minutes of unboxing it I had it inflated and ready to go. Took me about 8 passes to fill it with air. The only confusing part was how to buckle the end after it was filled and when putting it away. But there were only two ways so that was pretty easy to figure out when I was wrong and right.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Quality and comfort",
      "text": "My whole family loves this! It's very comfortable and doesn't lose much air at all!",
      "rating": 5.0,
      "verified": true,
      "author": "QueenB",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Next level technology",
      "text": "I like how fast you can inflate it of course. I'm thinking how easy it will be to seal a puncture with tape on the inside if that should happen.",
      "rating": 5.0,
      "verified": true,
      "author": "TPBurnett",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Love legit camping",
      "text": "This is not the first \"inflatable couch\" thing I've bought. I keep buying them because they seem cool, then tossing them once I remember how hard they are to inflate. I think this one is actually a keeper! First off the color is AWESOME so pretty, but it's not as difficult to inflate as most are and is super comfy and packable to transport. It's a winner!",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Better than an air mattress or sleeping pad for camping!",
      "text": "Used it for a weekend camping trip (Boy Scouts) and it stayed up all weekend. I am over 6 foot at 260 lbs and it was long enough and held me with no problem. It felt like I was sleeping in a recliner at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Do not buy",
      "text": "Great product if you want to go end up on the floor after 5 minutes! The air won’t stay in and it won’t last you long.",
      "rating": 1.0,
      "verified": true,
      "author": "Beyonca",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Love this lounger",
      "text": "I love this lounger.... after purchasing the hammock I fell in love with Legit products. My daughter loves the ease of use of this product. She is 12 and has no problem getting it to fill up. She can use it outside or in her room. I haven't tried other products but have heard that they were hard to fill up so I will saw this on Amazon I jumped at the chance to get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracie Long",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "MUST HAVE PRODUCT",
      "text": "Wow, what a great product! I am so glad I stumbled upon this because I will be taking this thing literally everywhere. It is like taking your couch with you wherever you go; park, outdoor concerts, camping... It is super simple to inflate and it takes minimal effort/time before you can start relaxing. The best thing about this version of the product is the pillow to prop your head up and the small pouch on the side to store things. Do yourself a favor and get one of these things; its worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Good! satisfied",
      "text": "They work perfectly! You definitely need some wind to inflate the lounger but after that they keep air for more than a couple of hours, a friend even used one to sleep and it barely lost shape. Good! satisfied! purchased the four in orange but got one in blue, doesn't really matter, but it happened.",
      "rating": 5.0,
      "verified": true,
      "author": "MARA E.",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Fun and so comfy!",
      "text": "I was a bit skeptical at first that I would be able to get this thing inflated. But what a happy surprise that it was actually easy and kind of fun to do. And it's REALLY comfy - we will be fighting over this the next time we're at the beach!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Wray",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Good quality!",
      "text": "Love the color and pockets! It is easy to transport and comes with a stake so it won’t fly away in the wind 👌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Liv",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "High Quality Lounger",
      "text": "Great lounger. Very comfortable - the main cushions are supportive and the head rest is nice and ergonomic. Great longevity of inflation - I filled it with air one evening, and the next evening, after 4+ hours of heavy lounging, it was still at about 80% inflation level. Great ease of inflation outdoors - took me 10 seconds and one try. However, you need a lot of room if you're going to inflate inside. Overall, 10/10.",
      "rating": 5.0,
      "verified": true,
      "author": "folk fan",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "It is comfortable and has pockets conveniently on the side",
      "text": "This lounger is very simple to set up. It is comfortable and has pockets conveniently on the side. It is also packable if you want to take it to your favorite outdoor locations. Since this product is so light weight once it is inflated there is a carabiner and stake included to make sure it doesn't blow away if you ever find yourself able to leave this lounger. Very happy with this purchase and looking forward to trying it out on my day hikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Great lounger in a small package",
      "text": "Took this with us this when we went camping last summer, and loved being able to inflate it anywhere (riverbanks, parks, campsites, beach) and have a comfortable & clean place to relax. A great hit with the entire family!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Keener",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Couch in the woods!!",
      "text": "Took a minute to figure out how to inflate it. The trick is to close the flap quick after you swoop the air in. It was inflated in under a minute. My 4 year old thought it was a bouncy house and started bouncing on it and jumping off the bed on it. Certainly not it's intended use but it feels very durable and I wasn't worried at all about her popping it. It seems like the same nylon material as their hammock so it's very strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Nass",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Can not fill it",
      "text": "Was unable to fill it no matter what I did. I tried waving in the air, up and down, side to side, spinning and even running with it. I tried all that with one side open and then both sides open. Nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Leigha",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Reasonable",
      "text": "Love all the features in this handy lounger! It's the perfect size for throwing into the back of the car and taking with you wherever you go. The varying strap is great and the Lifetime warrantee is even better! The only thing is that it comes with a stake that I think may be too short for some of the softer sand at the beach..",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy Block",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Love it",
      "text": "So comfortable!!! I got one for the kids.. the next day I order 3 more for gifting and one for me 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Elisa",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Kids love it",
      "text": "The 5 stars are what my 5 kids rate the Legit Lounger. They like it because it's comfy and fun. We had a little difficulty inflating it, but it would be easier next time or if we'd taken it outside and had some wind help us. It seemed to stay inflated well. We look forward to using it in the summer to chill out in the yard or to take on a camping trip. It is nice and compact and seems to be good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya Killian",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Quick and easy setup",
      "text": "Quick and easy set up. Very comfortable. My grandkids love to watch TV laying in these for Friday movie night at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Boopy",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Don't waste your money",
      "text": "This thing is virtually impossible to inflate and loses its air within hours. I had to use a blower to get this thing inflated and then once I sat on it I fell to the ground. It is a complete waste of money. I thought I could use it like an air mattress while camping. What a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "lori P.",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Comfortable, lightweight and portable!",
      "text": "We love this lounger! It’s comfortable and portable. It can be a bit challenging to inflate when there’s no wind, but worth being able to roll it up and pack it away. Also, customer service is AMAZING!",
      "rating": 5.0,
      "verified": true,
      "author": "Live Aloha",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great product, offers things others don't",
      "text": "This chair is great. This is the second inflatable chair I have gotten, the first was a Chinese off brand and I can't explain how much better this one is. The stake allows you to get up without it blowing away (a huge problem when using it a picnic or music festival where don't want to sit the whole time), it doesn't leak air, and the design gives you great head support when laying down. I am so glad I got this one and its definitely worth the bit extra from the off brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Love this company!",
      "text": "I love this company. They create awesome gear! I got some hammocks earlier in the summer and my kids and I loved them all summer. My son was super excited to try this out and said his dad had one that was super hard to blow up, so we are excited to try this out!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "My two children love it! The material is durable and can withstand ...",
      "text": "We have inflated and played with the lounger two nights in a row. My two children love it! The material is durable and can withstand quite a bit of abuse (bouncing). It stays inflated longer than other loungers my son has used, but inflates more quickly with more weight and movement. With one teen on it, it lasted about 4.5 hours, with two teens on it only about 45 minutes. This is a lot of fun and we will be ordering a second one!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "My Kids Stole my Lounger!!!",
      "text": "Great addition to the family!! I originally bought this thinking what a great alternative to a folding chair this would be but unfortunately my kids have discovered that this is by far the most comfortable option from everything from reading to iPad time to just relaxing and listening to music. Quality was what I expected (I bought a Legit Hammock earlier this year and it was awesome). I need to perfect my inflating skills but otherwise its been a solid buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Adolfo",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "The Best Out There",
      "text": "My legit camping lounger arrived super quickly. I got this because my last lounger popped, and this one immediately felt more durable. This is also the only lounger Ive seen with the ability to be grounded (a huge perk when you don't wanna pack it up quite yet but its windy), and also the only hammock with a designated bottle pocket (and bottle opener!) Overall extremely satisfies and would recommend this product and company to anyone!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Keeley",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "1 year old wins",
      "text": "Super comfortable and easy to fill up. Mine sprung a leak on the top side. My 18th month old was the culprit. My guess is her toenails penetrated the plastic. Either way... I bought it to replace a cot. Now it can't.",
      "rating": 3.0,
      "verified": true,
      "author": "Robinson Ellis",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Great Lounger!",
      "text": "Just what I expected. I can never seem to fill it as easily as the videos show, but I got there. This is the second brand of lounger I've tried, and this one was easier to fill, the material feels more durable (great since I plan to take it camping), and it packs up nice and small. My only complaint is that the bag is a bit too small, and it's difficult to get back in.",
      "rating": 5.0,
      "verified": true,
      "author": "William Harkcom",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Not the color as described!",
      "text": "Ordered the color red and it arrived a neon salmon color. Not real pleased. Will probably return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Monica Truesdell",
      "helpful_votes": 0,
      "publication_date": 20190628
    }
  ],
  "product_meta": {
    "title": "Legit Camping Inflatable Lounger by with Carrying Bag & Pockets for Indoors/Outdoors",
    "description": "The Only Inflatable Air Lounger Worth Your Time You buy an air couch because you want to kick back and chill. But, in order to use it, you have to run around looking like an idiot to blow it up, constantly having to re-inflate once you do finally get it inflated. Sick of being laughed at by onlookers? So were we. That’s why our team at Legit Camping took matters into our own hands, designing an air sofa that actually works, one that lets you enjoy maximum chillin with minimal effort. Thanks to the new technology we’re using, we make it easy to fill up your couch. While our competitors will use clever videos that make it look easy to fill up their camping couches, forgetting to mention that they’re using strong wind that isn’t usually present, the Legit Camping Inflatable Lounger actually is that easy. And it stays inflated for longer than five minutes. How’d we make the best inflatables for outdoor adventures? We tested and tested, kicking back again and again on inflatable prototypes until we found a winner, something that could be easily filled and packed for travel. And then, once we finally managed to get ourselves up and off, we got to work so that we could make it available for legit campers and adventurers like you. With all of the features we’ve included, like extra large side pockets and a built-in headrest, you will definitely have the most tricked out, comfortable air lounger anywhere you go. Take your outdoor chilling to a whole new level and trust Legit Camping, industry leaders in all things outdoor and awesome, to get you there. Use our inflatable sofa at the beach, poolside, by water, as a comfortable hangout and even as a bed for sleeping. Ditch the chairs and camping beds and go with something way cooler - no pump required! Click “Add to Cart” Now",
    "rating": 4.2,
    "feature_bullets": [
      "✅AN AIR LOUNGER THAT’S ACTUALLY EASY TO INFLATE: Tired of running around like an idiot? If you’ve ever used competing air couches, you know they can be a challenge to inflate. This is exactly why we built our own air lounger with a double inlet design allowing you to completely inflate your air hammock in under 1 minute! No need to run down hills or stand in hurricane winds to fill it up. Be lazy with better technology. No pump required!",
      "✅AND IT STAYS INFLATED: Love the idea of an inflatable sofa but hate the idea of constantly needing to fill it up? Thanks to our anti-deflation technology, our air chair retains air twice as long as other Inflatable Loungers for an experience that’s simply Legit! Our lounger is made with superb craftsmanship and high-quality Ripstop Nylon that is lightweight, comfortable and strong enough to support 400lbs!",
      "✅POCKETS, BEER OPENER & SECURE STAKES: This waterproof air hammock has 2 large and spacious built-in pockets on one side that are perfect for storing things like your magazines, wallet or iPad and the other side has an elastic strap for water and beer bottles; keeping all your important things within arm’s reach. As a bonus, we throw in a beer opener to help you have a Legit time when you hangout with your friends and securing stakes to hold the Inflatable couch firmly in place.",
      "✅GRAB A DRINK, KICK BACK & RELAX ANYWHERE! This blow up couch comes with a stuff pouch, can float on water and only weighs 3 lbs. You can literally take it anywhere and our Unique Ergonomic Neck Pillow headrest allows you to relax with maximum comfort. Just throw it in the back of your car then blow it up at the beach, parks, camping, hiking, traveling, music festivals and any other outdoor adventures. Feeling lazy? Just chill in your backyard.",
      "✅DON’T BELIEVE US? After you click “Add to Cart” on this “Legit Lounger,” search “Legit Hammock” on Amazon and read the reviews. You will see we pride ourselves on the quality of our camping gear and our customer service. If you don’t like this air hammock, then simply send it back to us and we’ll be happy to give you a full refund. 100% MONEY BACK GUARANTEE! It's the perfect gift for your mom, dad, sister or brother this coming holidays! Give your family and friends this quality lounger!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "12.52 x 8.66 x 2.83 inches; 2.6 Pounds",
      "Date First Available": "September 14, 2017",
      "Manufacturer": "Legit Camping",
      "ASIN": "B0788V6PVR",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Air Mattresses",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": ""
  }
}