{
  "website_summaries": [
    {
      "verdict": "Hassle-free wipes that cleanse and deodorize while moisturizing. Convenient travel packs of 10 make them perfect for travel and gym use.",
      "pros": [
        "One of few adult wipes that are free of latex, alcohol, phthalates, and parabens",
        "Single wipe is effective enough to clean entire body, so you won’t burn through packs quickly",
        "Resealable, lightweight packs are thin and light enough to be a regular item in any bag"
      ],
      "cons": [
        "Only sold in bulk as travel packs, so it could get expensive if you want to buy a large amount"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice wipes",
      "text": "I love the fact these are in 8 different packages with 10 wipes in each package. One wipe did a complete job of cleaning my large 260 lb. body. I purchased these in case the water is out and I haven't had my shower yet. The package arrived on time and I am satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Miller",
      "helpful_votes": 27,
      "publication_date": 20180413
    },
    {
      "title": "Superior bathing wipes than any other brand I have used",
      "text": "These bathing wipes work better than the previous brand I had been using for many years. Unlike the other brand, these do not leave your skin feeling a little sticky in the underarm area and other areas where skin rubs against skin. They are just the right thickness to enable you to use them without them slipping out of your hand. Overall I am extremely satisfied with these, especially since the price is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "MarkGunning",
      "helpful_votes": 17,
      "publication_date": 20180226
    },
    {
      "title": "They do the job",
      "text": "These are great for travel, long hours at work, and for those times when showers and baths aren't permitted because of a cast...or injury. It has a light scent, no sticky feeling left behind, and the clothes are sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Shimkus",
      "helpful_votes": 16,
      "publication_date": 20180124
    },
    {
      "title": "Not as impressive as expected",
      "text": "I didn’t find the wipes as impressive as I had hoped based upon the reviews. I researched several products and saw the positive reviews for these wipes. I found the scent of the wipes kind of off-putting. They weren’t as large or as moist as documented either. Nevertheless I suppose they will suffice if a person does not have access to water. I will see about adding some essential oils to help mask the smell. I gave the product 4-stars because the wipes provided a sufficient cleaning.",
      "rating": 4.0,
      "verified": true,
      "author": "gardengirl2",
      "helpful_votes": 6,
      "publication_date": 20190622
    },
    {
      "title": "Great product",
      "text": "I purchased this item for my father. He had back surgery and couldn't shower for three weeks. My father is such a germ-a-phobe that a simple washcloth was not going to do the job. He's pleased so that makes me pleased. I'm even going to purchase these during the summer when we go to our cabin and any other outdoor activity that you could use a nice wipe down afterwards.",
      "rating": 5.0,
      "verified": true,
      "author": "TML",
      "helpful_votes": 7,
      "publication_date": 20181017
    },
    {
      "title": "Good for a clean up after a workout",
      "text": "I keep these in my backpack to clean up with after a hike when showering facilities aren’t available. I also like to walk during my lunch hour and here in the SE it is hot and sticky. I can clean up easily with these and put on clean clothes afterward. Only drawback is that to me they smell a little like baby wipes- not as strong as a baby wipe. Maybe it is just reliving that experience. I will purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "Virginia Slim",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great for caregivers",
      "text": "I am caregiver for my 83-year old mother, who has a catheter in her chest and therefore can't shower. I have been using baby wipes when not doing a sponge bath, but I recently found these. They are nice and thick and I love that I can warm them before use (Mom always complained how \"cold\" the wipes were). They are larger, too, so they go farther than the baby wipes. They do cool quickly, and while the scent is okay, I don't love it. Those are the only reasons I don't give them 5 stars; they are definitely better than baby wipes, and I will be ordering them again!",
      "rating": 4.0,
      "verified": true,
      "author": "Cindy Caplin",
      "helpful_votes": 3,
      "publication_date": 20191113
    },
    {
      "title": "Game changer.",
      "text": "I live in a rural area of East Africa and we don’t always have running water and rarely do we have hot water for a shower. I have tried other shower wipes and these by far are the best!!! These have saved the day multiple times. Highly recommend this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "Replaced Showering",
      "text": "Gets the job done My shower head is moldy and I’m a renter. I was getting a rash every time I showered. I was taking antihistamine almost every other day. After using this, I didn’t have the rashes any more and I didn’t need to take antihistamines every other day anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Mosher",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Great Option When In Need",
      "text": "I was very concerned that these wipes wouldn’t last long, or that it would require 5+ to get the job done. I’ve been proven wrong! These are very durable, and don’t dry up after the package is first opened. In our experience, we only need two wipes per use for a full “bath.” The wipes do a great job, and don’t have a baby after smell, like some other wipes we’ve used. These are the closest we’ve found to what they use in the hospital. Thoroughly impressed!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Q.",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Great to freshen up!",
      "text": "LOVE LOVE LOVE THIS! I work at a hospital and always feel the need to wipe myself down after a long 12 hour shift. There’s something about not wanting to jump into my car feeling icky. These have worked great. These are also perfect for summer days when you just need a good wipe down to freshen up. Convenient to throw in a purse. Soft and large!",
      "rating": 5.0,
      "verified": true,
      "author": "AKD",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Perfect Cleaning Tool",
      "text": "These wipes are very convenient, great for loved ones that can no longer get to the tub. They clean and deodorize as described. I'm going to purchase more for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Thomas",
      "helpful_votes": 2,
      "publication_date": 20191124
    },
    {
      "title": "Great for soldiers, campers and that sweet messy kid.",
      "text": "My son, the Army soldier used these to keep himself clean while he was out in the middle of the mountains in Wa. State training for a month. He’s picky and likes to be clean. There were no showers. he was happy and kept him clean and healthy. Would be great for camping.",
      "rating": 5.0,
      "verified": true,
      "author": "carol wascom",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great product",
      "text": "I bought to use post-surgery, great thickness, good size, easy to pull out from package (not getting stuck to each other), but not enough wetness in my point of view, and not much “soapy” feeling compared to some other products I tried. If need to buy again in the future, will try some different brands",
      "rating": 4.0,
      "verified": true,
      "author": "Karpiksac",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Love these wipes!!",
      "text": "I am a 40 year old Firefighter/Paramedic. I have been purchasing these wipes for years, to touch up during busy shifts. After becoming disabled in 2017, I use these wipes regularly, as it is extremely tiering and energy consuming to shower. These wipes are great for \"accidents\" or \"dribbles\" and for staying fresh and clean between shower days! Life Savers!! Only issue that I have with them, is their availability. When I go to reorder, often times the 80 or even 48 packs aren't available. This becomes extremely frustrating!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Clow- Amazon Prime customer",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "They work good but they leave a weird filmy residue feel behind ...",
      "text": "They work good but they leave a weird filmy residue feel behind when they dry. They also smell like baby wipes. Overall good quality, good for camping when a shower isn't available.",
      "rating": 4.0,
      "verified": true,
      "author": "JA",
      "helpful_votes": 3,
      "publication_date": 20180922
    },
    {
      "title": "When theres no electricity and no water these are a lifesaver. Felt so clean",
      "text": "These were awesome...Large and thick! We used, give or take, 3 wipes each day (of course depending on which body part you're cleaning). Went camping with no electricity and no water for 2 days and these were great. Felt refreshed and it didn't dry out our skin. Perfect for camping, long 16hr workshift, and hot summers when you just wanna freshen up quickly. I'm going to be buying more for the kids to freshen up after P.E. class and sports activities.",
      "rating": 5.0,
      "verified": true,
      "author": "SkyDivr",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Must have for backpacking",
      "text": "Cool product, really helpful for backpacking to clean up yourself also it is disposable and eco friendly.",
      "rating": 5.0,
      "verified": true,
      "author": "Duke",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great for travel!",
      "text": "One sheet is large enough to cover half your body. They are thick and the moisture is well distributed. The scent is nice and not too heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandslamber",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Good choice",
      "text": "Bought them for post-surgery use and was glad I did! Good sized, nicely fragranced, and good coverage per cloth. Only problem is, I think I bought too many (which is no big deal really).",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Great product for the cost",
      "text": "These came in very handy on my across country train ride has a slight sent of a baby wipe but works extreamly well and it doesn’t leave any sent behind just a nice clean feeling high;y recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Arnold M.",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Good product",
      "text": "This is a strong and sturdy product with a mild clean scent to it. My only complaint is I wish they were a little bit bigger. You can use them straight out of the package or you can heat them up in the microwave. (I have not tried that yet).",
      "rating": 4.0,
      "verified": true,
      "author": "J Leav",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Great moisture",
      "text": "I like this cleaning cloth. Used it when were camping. It's soft and has the right amount of moisture.",
      "rating": 5.0,
      "verified": true,
      "author": "Shauntee",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Durable",
      "text": "I had a procedure done where I could not shower or bend or tur for a week, so I used these to freshen me up. They are a nice size and thick, so you can use both sides. They don't crumble in your hands. .",
      "rating": 5.0,
      "verified": true,
      "author": "JANINE MCCARTHY",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Great product. Good Value",
      "text": "Refreshing wipes work very well. I’m very satisfied and will reorder when I run out",
      "rating": 5.0,
      "verified": true,
      "author": "roz klein",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Very nice product",
      "text": "This is a nice product to carry on the road/keep at work/or at home to freshen up when needed. We had recent power and water outages and these came in handy. I recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Reed",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "These are great and have many uses.",
      "text": "This is a great product. It has many uses. It’s designed to be used by people who can’t shower or bathe because of injury or disability. However, it is perfect for camping, road trips, long flights etc. Eight cloths to a pack with instructions on how to use. Also, they can be warmed in the microwave as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim wenzel",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great full body bathing.",
      "text": "This product works as well as higher priced brands. They are a nice size and are thick. I like the warming feature for a full body bath when unable to use the shower or tub after medical procedures.",
      "rating": 5.0,
      "verified": true,
      "author": "GFS",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Wonderful",
      "text": "Bought these for a care package for a friend following a mastectomy. She said the was the best item in the basket from the team. She loved them!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly N. Joiner",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Excellent for my needs",
      "text": "When surgeries or dressings preclude the ability to shower or bathe, these cloths are terrific. Nice aroma and gets the job done quickly and conveniently.",
      "rating": 5.0,
      "verified": true,
      "author": "barney84",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Clean!!!",
      "text": "I use these for wildland firefighter when we don’t have the showers set up. They work great and feel clean after long days working in the mountains! I will recommend them to my fellow firefighters.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Moist but not too wet, manageable size and thick ...",
      "text": "Moist but not too wet, manageable size and thick enough to be durable, without falling apart with use. Will order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Very good.",
      "text": "Excellent for bed bound patient care. Great for freshening up when running water is not available. Very durable for cleansing. Can be heated in microwave or used at room temp.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Craig",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Big soft wipes",
      "text": "These work great for my elderly dad who does not want to take a bath. We heat them in the microwave and he will use them to wash up",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn H. Hess",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Nice",
      "text": "These are very thick and clean well. They have a subtle scent that is pleasant.",
      "rating": 4.0,
      "verified": true,
      "author": "cielbee",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Quality wipes",
      "text": "Tried Care Touch wipes this week. Quality not thin that most stores sell. Light smell is perfect and not overpowering. Recommend for long shifts working and touch ups during hot weather.",
      "rating": 5.0,
      "verified": true,
      "author": "True single",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "...",
      "text": "These are okay, but I'm not so sure about the deodorizing.",
      "rating": 3.0,
      "verified": true,
      "author": "gm",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Not individually wrapped.",
      "text": "80 total wipes. 10 packs (8 in each). When I read 80 wipes, in my head it was 80 individual wipes. I use stuff like this for my homeless students care packages. I wish they were individually wrapped since I have 77 care packages I need to make.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Finnan",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Worth it!",
      "text": "More than I just expected for price. Good quality too! Perfect for camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Waste of money",
      "text": "Don’t waste your money. These are no better than a wet wipe.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great value",
      "text": "Great for a quick clean up after work and before going out",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Smith",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Helpful and Appreciated",
      "text": "These wonderful body wipes were so necessary and appreciated when I returned home after surgery. Scent and softness were excellent. I will take a pack with me when I travel, too. Thank you for your product. PA",
      "rating": 5.0,
      "verified": true,
      "author": "PA",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Soft and thick.",
      "text": "I like that it is super soft and thick. And the sheet size is pretty good to.",
      "rating": 5.0,
      "verified": true,
      "author": "Elleninstafit",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "As advertised.",
      "text": "Exactly as advertised. Soft, durable, great for sensitive skin. A quick way to refresh from a short workout, or other activity that leaves you a bit sweaty when you don't have time or access to a shower.",
      "rating": 5.0,
      "verified": true,
      "author": "A Happy Reader",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Love this wipes",
      "text": "Great product. Used for travel and quick clean up after gym. Let’s me run errands and feel clean",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "It works great",
      "text": "Works great, enjoy taking it with and use on the go!",
      "rating": 5.0,
      "verified": true,
      "author": "Monique",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Wonderful product",
      "text": "Very pleasantly surprised by this product. I recommend them highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheena Fallows",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great for camping",
      "text": "I bought these for a camping summer music festival where showers were scarce. They actually did an amazing job of helping my friends and I feel clean between showers. They have a nice clean smell that's not overpowering.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Five Stars",
      "text": "Great for a quick clean up at home or on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley K. Ark",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "and it works wonderfully. The size",
      "text": "Purchased for use for my bed-bound mom, and it works wonderfully. The size, quality, and light scent were perfect. Overall, a great product for a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 2,
      "publication_date": 20180216
    },
    {
      "title": "cleans and is neutral smelling",
      "text": "Worked great for my wife when she came home from having surgery and could not shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "They cleanse well and are soft",
      "text": "Like what they’re for, but wish they were cut in Half.",
      "rating": 4.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "They work as advertised",
      "text": "Tested one for travel and camping wash up and worked fine",
      "rating": 5.0,
      "verified": true,
      "author": "WB",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Use a different wipe for each body part.",
      "text": "Convenient to have. Great to use after my workout if I don’t have time to go home and shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Myra C.",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Excellent product",
      "text": "Heavyweight cloth very durable. Sent isn’t over powering. Very good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Helpful for cleaning elderly, would like sheets to be more moist",
      "text": "Like the size, wish there was more wetness to sheets, not sure it deodorizes and washes as you don’t see/feel any product when using.",
      "rating": 3.0,
      "verified": true,
      "author": "eva maciag",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "A good body cleanser.",
      "text": "I like the individual packaging, that way towels remain moist without drying in the pack before usage. I bought these to use on my Mom, who is chair and bed ridden. They worked perfectly for keeping her clean and fresh. Her skin Is delicate and most products have a negative effect on her. She has not complained about any adverse reactions. Thank you for making my role as \"relief caregiver\" a lot easier.",
      "rating": 4.0,
      "verified": true,
      "author": "Joyful One",
      "helpful_votes": 4,
      "publication_date": 20180302
    },
    {
      "title": "Great for a sick room.",
      "text": "These wipes are a refreshing way to clean up while recovering from an accident and unable to walk. The are soft, durable and have a pleasant scent.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "I recommend these wipes!!",
      "text": "I bought these wipes for my invalid husband. He loves them!! Very soft and durable. Nice, light scent, too!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Houle",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Five Stars",
      "text": "Great to use when you are camping, traveling, or want to freshen up in a hurry.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Holman Philo",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Like this product.",
      "text": "This product is what I was looking for with the exception of it being a little smaller than expected. It works for its intended purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary H.",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "They're hypoallergenic.",
      "text": "I liked the size of the wash cloth and how soft they are; however, they don't smell very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Wonderful",
      "text": "I love these. They are very moist and they work perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Gaines",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Highly recommend this product!",
      "text": "Great product! Thick pads cleanse your whole body with a fresh scent; no perfume smell. Felt clean all day. Can't wait to take it on my camping trip!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "👍👍",
      "text": "Very useful. Full body clean with just one. Good buy n",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Very good quality!",
      "text": "These wipes are very good quality. I have very sensitive skin and had no problem with these at all",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Great product",
      "text": "I love these cleaning wipes! I just had surgery and have not been allowed to shower . These cloths have made me feel fresh and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "susan vance",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Four Stars",
      "text": "Great for quick and easy clean ups of out disabled teen daughter.",
      "rating": 4.0,
      "verified": true,
      "author": "krista Sweigart",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "I would putchae them again",
      "text": "I loved how they cleaned and the size... I did not like not enough in 1 pack",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "i like them",
      "text": "Sadly the manufacturer of the Ban Total Refresh Cooling Body Cloths stopped selling my favourite wipes. Got these instead. Although they are not exactly a substitute they work well. Its a quite large pack. I am not sure it is as convenient to travel with as others. They are only lightly scented. For me thats not ideal, I would like a scent to feel cleaner and fresher, but they work well. They are very thick compared to most which is nice. They are very soft. They clean my skin well after i ride to work and need to wipe down in the summer before I change clothes and start working for the day. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Alastair Battson",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Cleans with no leftover residue.",
      "text": "I originally purchased these as we were going to be camped out in the waiting room at the VA hospital in SFO while my FIL was in CICU. We were able to use these to bathe in between driving home every couple days to shower (we live several hours away). They worked great. They really clean well, and leave no residue. The cloths were surprisingly thick, like felt, and were saturated well with the cleansing solution. I have since repurchased to have on hand for camping, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "ANGELA",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "They worked well during my recovery.",
      "text": "The Care Touch Body Wet Wipes were a great help during my initial period after foot surgery when I couldnt shower often and wanted to keep and feel cleaner. The bath wipes are large, thick , sturdy wipes. There are 8 to a pack, the instructions say use one pack for a bath but I used fewer as I used them for in between showers. They dont have a particular scent, they are not soapy so they dont leave a residue or have to be rinsed. Dont think they are the same as baby wipes, they are NOT they are much nicer and a good size .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer Monica",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Must have after medical procedures.",
      "text": "I purchased these to have right after I had shoulder surgery. I wanted options to be clean since they told me I could not shower for a few days after the procedure. These did not disappoint! Each towelette is a pretty good size, thick and soft. They can be warmed up and have an extremely light clean scent, not something doused in perfumes. I like how they come in packs that can be resealed. I would highly recommend these to anyone who is having a medical procedure and unable to bathe, and to people who are bed confined or have mobility issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Big towels!",
      "text": "These are big deodorizing wipes. They are big enough to use one to wipe down your whole body. The scent is pretty good, not overpowering. I would recommend these for work, workouts, or for people who travel and don't really have time to shower.",
      "rating": 5.0,
      "verified": true,
      "author": "Chito",
      "helpful_votes": 4,
      "publication_date": 20180212
    },
    {
      "title": "Excellent valu",
      "text": "I've ordered these 4 times now and in all cases these are the best cleaning cloths around. Great value for the amount you get and they work perfectly. Just the right amount of liquid for a thorough cleaning. I would highly recommend these wipes for traveling or a quick cleanup at home or office. Update: In just three months the price increase has made me rethink my opinion of these wipes. Although I still think they are the best wipes around they are getting way to expensive to purchase on a regular basis. It is a shame too!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark S.",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Perfect for after workout fresh up",
      "text": "Perfect for after working out. Although I workout at home, I do it during my lunch break and don't like staying sweaty. So I freshen up with these and glad I have them. They smell like baby wipes and not too much moisture. I use them on my private parts and no issues. Go back to working remotely feeling fresh and my hubby can workout when he gets off.",
      "rating": 5.0,
      "verified": true,
      "author": "Fulmer",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "CLEAN LIKE A BATH OR SHOWER",
      "text": "This product was suggested to me by my daughter last week as with no bathrooms in my home available due to flood, I need to be clean. Fabulous! Each cloth in the packet is a good size and I only need one to clean entire body, including my feet. No scent so great for those with allergies like me. Would be a great accessory for outdoor people or for travel. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary W.",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Good value",
      "text": "I am recovering from surgery and am currently unable to shower or take baths. I was given a supply of something similar to these when I was discharged from the hospital. I was running out so ordered these in hopes they would work. They are strong, yet soft. They do an excellent job and I will continue to use them until I can shower again. The large pack is also a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "tt2099",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "These aren't for me",
      "text": "The sellers always want me to write reviews for products I give as gifts. Okay. I've used similar wipes, & they're adequate though not as thorough as a good hot shower w/real soap. I give these packets out to homeless folks bc I know how it feels to go w/o washing for a period of time. I was homeless three times. These are great for someone in a pinch.",
      "rating": 4.0,
      "verified": true,
      "author": "Stravo Lukos",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Absolute best adult bath wipes!",
      "text": "It's rediculous how well these bath wipes work. I feel exactly as though I've taken a normal shower when using them. My skin remains soft, smooth and completely fresh all day...every time. You can slip the packet into your purse or luggage and use them absolutely anytime or anywhere. If you or a loved one is bed ridden, I promise they will stay clean with these wipes. And, you can warm them in the microwave for a few seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise Garcia",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Perfect for elderly & those who cannot get in a shower!",
      "text": "I bought these for my mother, who cracked her shoulder in a terrible fall in the bathroom. My dad is her caregiver & this makes it easier for him to give her a \"bath\". I used these when I had a major surgery on my arm & could not get the area wet. Highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cipale",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Better than wet wipes",
      "text": "Bought for my boyfriend and I for a festival (we’re camping so showering won’t happen everyday.) These wipes smell great! They’re soft and we have plenty! They’re much larger than the wet wipes some people buy and the deodorizer really helps you feel cleaner than baby wipes do. Made getting mud, dust, dirt, and BO off much easier!!",
      "rating": 5.0,
      "verified": true,
      "author": "ES",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great for camping!",
      "text": "These are critical for camping trips! I didn't have access to showers for four days but I still felt fresh. Only gripe would be that they have a slightly off-putting \"hospital\" smell, but that's probably part of why they work so well! Very thick, and you really can clean your entire body with just one wipe (use two to feel extra fresh).",
      "rating": 5.0,
      "verified": true,
      "author": "KLcustomer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Best adult cleansing cloth out there",
      "text": "Fresh sponge bath cloths great for travel and we buy them for senior care. Great for the skin, cleanses thoroughly without dryness, large cloths for adult vare. We buy these repeatedly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B.",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Wonderful!",
      "text": "I am so pleased with this product! I have a large open wound from surgery - I am attached to a wound vac - and do not want to get it wet. These have been a life saver. I feel clean, no medical smell at all, and they are not drying to my skin. Wonderful. Thank you so much for this much needed product!!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Tschetter",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Soft and comforting",
      "text": "These wipes are very soft, strong, yet comfortable to use. They are a little smaller than I had expected, but they do the job well. I use them when traveling.",
      "rating": 4.0,
      "verified": true,
      "author": "Math Prof",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Great after a lunchtime workout.",
      "text": "EDIT: My original comment on the smell might sound like they smell bad; that is not the case. They have a \"clean\" smell that is not strong like some after-workout wipes that try to cover up the sweaty smell with heavy fragrance. Great! Keep a pack in your desk for after a lunchtime workout or biking to work. Much better than using baby wipes. Scent is fine and doesn't linger.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Good for camping",
      "text": "These are good for camping when there are no showers available. I heat these in the microwave for a bit . Very nice. I would recommend them .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Glad I found these",
      "text": "My husband currently has an own wound and is unable to shower normally. These wipes are just right for his bathing needs. He likes that they can be heated in the microwave so they are nice and warm. I'm glad we found these. Thank you for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie B. Sawyer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Works well.  Nice scent.",
      "text": "We used these when our gas was out and our water heater and other gas appliances needed to be placed. These were a godsend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Clean scent",
      "text": "Its a good product, it will never be like taking a shower but it does a good job on keeping you clean it all depends what you need it for. I ordered these for when I had surgery and they saved me for a couple of days.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Fresh Feeling !",
      "text": "We are on a sailboat a lot and in between showers these clothes keep you fresh and clean. They are nice and thick and one cloth can clean your entire body. I absolutely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jjnlc8206",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Pleasantly surprised.",
      "text": "I was pleasantly surprised at the size and thickness of the wipes. I have ordered several brands of wipes and, so far, these are the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken McArthur",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Worth every penny!",
      "text": "These are huge, soft, and durable. They are perfect for travel, hiking, or emergencies when you need to clean up but don’t have access to a bathtub or shower. 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "Aunt Vonnie",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "These work .",
      "text": "They are moist and large enough to do most of me. Very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Guysgal",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Highly recommend!",
      "text": "These are well made. Large size and cleans very well. Definitely a bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "joysjane",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Very Useful",
      "text": "These are great for using when a bath/shower is not possible. Very refreshing and nice fresh smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia A Ridings",
      "helpful_votes": 2,
      "publication_date": 20180226
    },
    {
      "title": "Perfect Wipes!!",
      "text": "Perfect size adult size wipe! Soft! Reasonable price! On time delivery!",
      "rating": 5.0,
      "verified": true,
      "author": "MPMC",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Useful",
      "text": "Purchased for traveling & be warned, they are thick & soapy but effective. Good purchase. Everyone thanked me & found them useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Need  Bath",
      "text": "I am disabled so there good to have on days you need then..",
      "rating": 5.0,
      "verified": true,
      "author": "anncampbell",
      "helpful_votes": 0,
      "publication_date": 20200227
    }
  ],
  "product_meta": {
    "title": "Care Touch Body Wet Wipes with Cleansing & Deodorizing Solution - Shower Wipes for Adults - Great for Gym, Camping, Travel and Bathing (80 Wipes Total)",
    "rating": 4.7,
    "feature_bullets": [
      "HYPOALLERGENIC, LATEX FREE and ENRICHED with ALOE VERA",
      "RESEALABLE - Reseal the package of wipes after each use to keep the fresh wipes moist",
      "MICROWAVE SAFE - Warm the wipes in your microwave for less then a minute and it will be nice and warm for a better feel",
      "CONVENIENT BATHING ALTERNATIVE - It is great to have these around when a sink, bath or shower isn't available",
      "GREAT FOR TRAVEL - Keep these rinse free washcloths on hand; in your purse, at home, at work or in your car"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "9.2 x 8.3 x 4.3 inches; 4.85 Pounds",
      "Date First Available": "November 29, 2017",
      "Manufacturer": "Care Touch",
      "ASIN": "B078C7RWL9",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Medical Supplies & Equipment",
      "Mobility & Daily Living Aids",
      "Bathroom Safety, Aids & Accessories",
      "Health, Household & Baby Care",
      "Rinse-Free Wipes",
      "Rinse-Free Cleansers & Wipes"
    ],
    "price": 27.99
  }
}