{
  "website_summaries": [
    {
      "verdict": "The most affordable set of high quality Xbox headphones you can buy without giving up good sound.",
      "pros": [
        "Over-ear design provides good, isolated sound reproduction with a larger-than-average dynamic range and presence",
        "Headset compatible with many gaming platforms"
      ],
      "cons": [
        "Cord length is too long",
        "Need to coil up the slack for better organization"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great headphones",
      "text": "These headphones look “awesome” according to my 8 yr old. He took them out of the box, plugged them into his PS4 controller and was in gamer heaven. The sound quality is great and they are super comfortable. I’m sure we will get a lot of use out of them!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey",
      "helpful_votes": 28,
      "publication_date": 20180104
    },
    {
      "title": "The sound quality was acceptable and the mic worked pretty well. I was able to talk and hear ...",
      "text": "Just received this gaming headphone today. The sound quality was acceptable and the mic worked pretty well. I was able to talk and hear my friend while I was gaming.I think 21.99 for a gaming headphone with such quality is reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac",
      "helpful_votes": 21,
      "publication_date": 20180416
    },
    {
      "title": "Great budget comfortable headset",
      "text": "Good sound quality for the price. Nice and comfortable for hours of gaming. The headset was large enough to cover my ears which is a big plus. There is a top cushion for your head so it fits comfortably. Cord was long enough for my use (mainly for PC gaming). Tested this in CS:GO and sounds was good for the price. Another bonus is that you have the on/off mic control and volume control inline on the headset. Great budget headset!",
      "rating": 5.0,
      "verified": true,
      "author": "Tria Thao",
      "helpful_votes": 6,
      "publication_date": 20180430
    },
    {
      "title": "Wonderful, hight quality",
      "text": "This is a wonderfully made 3.5mm headset. The title says \"Xbox\" but actually works with all kinds of devices, desktop/laptop computers, phones, tablets, etc. Sound quality is very good, and noise isolation works great. One thing to note is that, this is a 3.5mm headset. the USB interface is only for power supply for the LED lights. The material feels comfortable and skin-friendly. Its ergonomic design fits my ears nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 6,
      "publication_date": 20180506
    },
    {
      "title": "Teen Nephew Enjoys Them",
      "text": "Bought these for our nephew for when he comes to visit. He brings over his Xbox One S with him, and he needed a headset for party chat and gaming. These have worked perfectly so far. He says the sound quality is very good, and hasn't had any complaints from his xbox friends as far as his mic quality is concerned. We're really happy with the purchase, especially since the noise level has been reduced significantly at a fraction of the cost of other high end headsets. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 8,
      "publication_date": 20180526
    },
    {
      "title": "Awesome headset..great sound",
      "text": "This thing is incredible. I gave it to my son and he was really was a little hesitant, with the price being so low. But I'm glad I went ahead and made the purchase! I got the red pair, and he loves them! The sound quality is great! And he hasn't had complaints from his friends saying they can't hear him or that there is any feedback from the mic. My son loves these and he had friends over today and they all wanted to use the headset. Thank you for the super fast shipping too!!",
      "rating": 5.0,
      "verified": true,
      "author": "AHY",
      "helpful_votes": 7,
      "publication_date": 20180508
    },
    {
      "title": "Stopped working after one month",
      "text": "This is very poor quality. The voice stopped working and it’s very difficult to hear when chatting. I tried to exchange/return it and it was past the ONE MONTH deadline. So,in essence, it had a ONE MONTH warranty. Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Daniela Bickel",
      "helpful_votes": 4,
      "publication_date": 20180513
    },
    {
      "title": "Headset for gaming on PS4 that works great!",
      "text": "I use this headset for gaming on PS4 and it works great. I can hear fine end everyone says they can hear me loud and clear. The ear cuffs are soft and comfortable and the headset fits snugly but not too tight. It’s isn’t too heavy and I can wear it comfortable for a couple of hours of gaming with no issues. The cable appears to be about 8’ long and includes adapters for different devices such as PS4 and USB. The cable also includes volume control and switch to turn off the mic. I have no issues with it and seems like a great headset for the price, I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Cook108",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "The BEST budget headset",
      "text": "I took a gamble buying this and it worked out in my favor, crisp clear audio going in and out, comfortable to wear for long periods, appealing design plus the name says Butfulake on the side and now my husband calls me buttflake when I wear it so the humor is definitely an added bonus. If I had to find something to complain about is that the usb cable split is only couple of inches long so it’s impossible to use the lights unless you’re PC gaming. The lights weren’t a selling point for me so I couldn’t care less. I love this headset.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Cheap splitter.",
      "text": "There is the splitter that separates the 3.5 mm Jack from the USB jack. The plastic housing cracks almost immediately and shorts out the connectivity. We can intermittently use the headphones but the microphone does not work after three weeks of use. I edited my review because the company was very responsive and credited me for the faulty product. If I were to rebuy this item, I would tape the Y split where the 3.5 and usb split. That seems to be where the plastic cracks and renders the headset broken.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Peterson",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "A good choice for all the gamers out there",
      "text": "A good choice for all the gamers out there. I just bought it recently and its looks dope. The price seems quite reasonable for the such high quality headphone. The bass seems to be on the heavy side and it is quite descent for gaming due to its crisp sound with high dynamic range. Also I got the blue one which looks pretty good with your gaming desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Alvin Poudel Sharma",
      "helpful_votes": 2,
      "publication_date": 20180417
    },
    {
      "title": "My 22 year old approved this,  that says it all!",
      "text": "This was a gift for my son. Needless to say, he loved it. He said the sound quality was there, minimal back ground noise and he said the fit was very comfortable. My son is 22 yrs old, very hard to buy for and super picky. If he says he really like the headset, then it must be good. I'd give this 10 stars just because my son says so lol so definitely worth every dime paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce B",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Great headset for the price",
      "text": "I bought the headset for my 10 year old son and he uses them on his Switch. They work better than I expected. The noise canceling as well as the volume control allows him to sit in front of the TV oblivious to the world going on around him. We once had a surprise party for him and all his guests arrived and sat behind him waiting for him to notice. He was quite embarrassed once he realized what was going on behind him. The headset was the talk of the party. The lights are very cool when playing in the dark. I would recommend them to a friend if anyone would bother to ask.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Davis",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Good quality for low price",
      "text": "I bought this headset to replace my old Turtle Beach headset for my PS4. Considering this cost me about $20 vs my old set of $75, I wasn't expecting much. However, I had compared the sound quality between both, this one was superior. The mic picks up sound very well. It cushions the ears nicely and is lightweight enough. My only remark is that it is a little bulky for my style. Overall, I honestly did not expect this quality for this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandra B",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great bang for the buck",
      "text": "This is a nice headset if you are looking for an inexpensive one. I have been using it on my PC, and I am impressed. The lengthy cord is nice. I do a lot of sim racing and my Turtle Beach headset is problematic because the cord is a little short and it sometimes interferes with my shifting. This is not an issue with this new headset. While the sound quality lacks the bass of a more expensive brand, it is still much better than what I expected at this price point, and also the headset is very attractive and quite comfortable. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Forrest B. Scott",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "I like that it comes with extra connection so I can ...",
      "text": "I got this headset for my son for his XBox oneand his face was priceless when I gave it to him. He was so excited to be able to hear out of the headset as well as be able to respond to his friends. This is a heavy duty high quality head set. I was very impressed with the quality for the price. I like that it comes with extra connection so I can use it with my laptop and my husband could use it for his PS4 if he wanted to. I would recommend this head set to others for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "abby",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Great quality for the price",
      "text": "When I was buying these, I was a little skeptical of how well they would work since they are so fairly priced. When I received the package, I was impressed with the packaging as well as the product itself. It is super comfortable and has great sound. It works great for gaming (according to my husband). I would definitely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Murray",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Great for about a month. Then intermittent problems. By two months it's practically useless.",
      "text": "I guess I should have dropped the extra ~$3 for warranty. Started to drop audio occasionally after a month. Or occasionally audio would work, but mic would not. Now 2 months since I purchased and the mic never works and audio is constantly in and out. UPDATE: Seller contacted me and offered replacement product. Received two days later. Can't vouch for the durability, but certainly good to have responsive customer service. Updated to three stars.",
      "rating": 3.0,
      "verified": true,
      "author": "ProfArk3",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Affordable, good quality",
      "text": "I got these for my 15 year old daughter to go with her PS4 for Christmas. We tried them out to make sure they would work for her. The sound quality was decent. Especially for the price. The microphone works well. We tested it via a Skype chat with my mom. They're comfortable to wear for awhile. I really like that they light up when plugged in as well. This is definitely a great starter set for her gaming system. I would recommend this to anyone looking for an affordable, quality headset.",
      "rating": 5.0,
      "verified": true,
      "author": "Audie Shetler",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Doesn't work",
      "text": "After reading reviews I'm convinced 90% of these reviews are by bots. Headset didn't work for XBOX One even though I have a 3.5mm input on my controller. Saw something about needing an adapter but it seemed like that was only necessary for controllers without the 3.5mm input. Regardless of whether an adapter is required or not, not worth the hastle and the price",
      "rating": 1.0,
      "verified": true,
      "author": "Dalton redmon",
      "helpful_votes": 3,
      "publication_date": 20180622
    },
    {
      "title": "Didnt last long, but giving another try",
      "text": "Got these just two months ago. First impression was good. Solid construction with decent sound quAlity. However, just after two short months of average usage the wire connections to the adapters all split. 3 out of 4. Now sound and mic goes in and out. Would not purchase these again Update. 8/26/18 Was contacted by seller who wanted to make things right. They offered a replacement or my money back. Like i said before, they seem like really good headsets. So I decided to give another try. So far so good Changing review from 1 star to 4 due to my interaction with this company.",
      "rating": 4.0,
      "verified": true,
      "author": "WilVas",
      "helpful_votes": 7,
      "publication_date": 20180702
    },
    {
      "title": "cool starter pair",
      "text": "We got our son an Xbox and of course, he wants to be a gamer, so we got this headset for him not knowing if he would like it or not. He definitely requested a headset and this seemed like a good starter pair. It did not disappoint he love them I tried them on and there are great. The sound is good, noise-cancelling is too good he can't hear me yelling at him ha just a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeSmith",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Surprisingly Great Audio at a Great Price!",
      "text": "Considering the price, I was actually very impressed by the level of audio quality on this headset. I honestly wasn't expecting much and wound up pleasantly surprised. I will say I was a little disappointed that the USB connector seems to ONLY be used to light up the lights, but aside from that the audio came through powerfully and clearly with a nice bass.",
      "rating": 5.0,
      "verified": true,
      "author": "RaZim",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "All-in-one gaming headset for under $20? Sign me up!",
      "text": "This is one of the best value gaming headsets you could ever get for less than $20! The sound quality is great and the attached microphone is also very good. I've used this headset on my PS4, Xbox, and my PC and there was no drop in quality no matter what platform I played on. The LED only works while plugged in via USB but that won't affect how well the headset performs. All in all, if you're looking for a quality gaming headset with great value, it would be hard to find a better headset than this. I definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Vael",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Stopped working after a few months",
      "text": "These broke after a few months. I tried to contact the seller but they have not responded. Not sure they are even an Amazon seller anymore. Also the website on the side of the box doesn't bring up a usable website. These worked fine until they broke. I would recommend looking elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Poor quality",
      "text": "These broke the first time my son use them. The wire pulled out of the connection were you can turn up the volume. Also the USB plug in connection came smashed so you could not use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Great Sounding Headset | Great Price",
      "text": "This headset redefines what you should expect from a $25 gaming headset, offering a sturdy design, incredibly comfortable earcups and convenient on-ear audio controls. The headset's 3.5mm connection makes it ideal for consoles and mobile, though there's also an included headphone/microphone splitter if you want to use it on PC. It doesn't hurt that the sound quality is pretty good. If your budget is tight, you won't be cutting many corners by picking this up.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Ramirez",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "While they lasted...",
      "text": "These headphones were pretty good while they were working properly. But I have had them for less than two months and the right headphone is significant quieter than the left. I have tried a few solutions and nothing works. The games I like rely heavily on hearing I will be look elsewhere when going to buy a replacemt. While they were working properly they did everything I needed. I mike worked great and the sound was extremely clear.",
      "rating": 2.0,
      "verified": true,
      "author": "caroline pallini",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "I was pretty excited for these to come in",
      "text": "I was pretty excited for these to come in. I typically have used the Turtlebeach head sets in the past, but I wanted to change things up and didn’t want to break the bank on a decent pair. I found these online, the black on blue with blue LED’s caught my attention. After receiving this I noticed the packaging was above par, both Aux and USB ends were capped and protected. These headphone look great, sound great and feel great! Plus the flexible mic and and adjustable foam ear pieces allow for a custom fit. All this for an exceptional price, this product deserves 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "scott",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Good gaming headset",
      "text": "These are working great for gaming. I can hear the sound perfectly and the people I’m playing with can hear me great through my mic as well. I appreciate the affordable price and the good quality. I think the design is pretty fun too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer 007",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "It’s pretty good",
      "text": "Pretty good so far. The sound is great and the cord feels quite durable. You’re able to hear footsteps in games if you’re a competitive player. Update: Intermittent static coming in and out. A few times this headset has already just muted out itself (No sound coming from headset.) Update: it’s working well so far. Does not mute out anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremiah",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "I really enjoy these!",
      "text": "I really love using these gaming headphones they some of the most comfortable headphones I have ever used. The sound quality is great for the price and I love how you can controller the volume on the cord. They are amazing quality. If wanting good and reliable headphones I would get these!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Palm",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "LEDs are great visually; mic works well",
      "text": "The LED accent lighting on the outside is fun to look at. It lights up nice and bright. It was easy to plug-into the headphone jack on the controller to start using it. The boom mic picks up your voice well. The inline controls for volume and mic muting are nice to have to make quick adjustments.",
      "rating": 5.0,
      "verified": true,
      "author": "Wanpaku",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Decent for the Price",
      "text": "This isn't the most comfortable set of headphones I've used, and they occasionally have issues where the sound cuts out for a split-second, but they're good enough quality and affordable to be a good purchase for the casual gamer.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great headset!",
      "text": "Great sound quality and noise cancellation! This headset is really great especially for the price!!! I bought it as a Christmas gift for my hubby and he really likes it! Only comment was that the ear pieces are a little stiffer than his previous headset’s but it didn’t bother him. He uses it with his PlayStation",
      "rating": 5.0,
      "verified": true,
      "author": "Kenzie",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Gaming headset",
      "text": "This is a great headset. It gets pretty loud so it's perfect to zone in on gaming. This is easily compatable with my xbox one and just plugs into my controller. They are very comfortable for long time usage.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Rios",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "The sound is crisp and loud",
      "text": "The sound is crisp and loud on the headphones and microphone. I've been using it for Skype calls and general phone calls too and it has worked great. I like it because it is light, but feels very durable. Connects and works with different devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica Jimenez",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Worked for one month.",
      "text": "My son has had this headset for just over a month. He had started complaining that the sound didn’t work well because the headset jack doesn’t have a good connection to the controller. The sound breaks in and out and he has a hard time talking with his friends. I’m one week past the return window. 😢. I wouldn’t spend my money on this product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Stickmom",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Didn't last very long",
      "text": "My son had this for about a month before the mic went out. It will work at times but its not very consistent and I know he gets bothered by the inconsistency. He's asked me to buy him other headphones since these don't really work. Its unfortunate that it was a technical issue because they seemed like great headphones. How do I go about looking into the warranty on this? I've been trying to look around on the amazon website and through the seller with no luck.",
      "rating": 3.0,
      "verified": true,
      "author": "M Contreras ",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Great sound",
      "text": "The sound quality for these gaming headphones is excellent. You hear everything clearly without any interference from outside noise. They're not to tight, they're adjustable and fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendria Gilmer",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "everything the turtle beaches offer for 1/5 of the price!!!",
      "text": "Bought these for my nephew as a present and he absolutely loved them! The fact that I spent probably 1/5 of what I would of spent for some turtle beaches makes this deal amazing! I actually tried them on myself to make sure I tested the sound, connection, microphone, controls and everything worked just find! Plus! I was really surprised by the sound quality! Although you can feel the controls a bit cheap material I didn’t dock any stars as at this time I am 100% happy with this product! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ubaldo Torres",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Sounds Great!",
      "text": "Headset sounds great! Apund quality is very good for this low of price. Also, when gaming, my friends tell me the mic quality is much better than my last headset (less static). And, of course, who doesn't love some good lighting. Overall, satisfied with the purchase, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "CD",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Comfortable, great sound quality",
      "text": "The price for this headset doesn't match the quality!!!! SOOO cheap, but the sound quality and comfort is amazing. I have bought ALOT of headsets for my kids and spent way more money on them for sure and the quality of the expensive ones was terrible compared to this headset. If you don't buy this headset you are crazy. Christmas present they will love for under $20. That's hard to find. Definitely buy this one!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "John Fuentez",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Useless after 4 months",
      "text": "Shortly after my son got this, we realized the microphone only worked when the cord was positioned a certain way. About 2 months later, I had to use electrical tape because the cords were coming apart. Now we're 4 months from purchase and the microphone doesn't work at all. Complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "KimC",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Great price! Easy pairing",
      "text": "Unbelievable value!! My son needed a new one the last one just stopped pairing with the Xbox ... The sound quality is absolutely awesome! And the set up was extremely easy! My eight-year-old was able to do it all by himself. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara CT",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Great set of gaming headphones!",
      "text": "Games and music sound great! The microphone is of good quality and allows you to adjust to however close you want it to your mouth. The headphones are comfortable and completely cover your ear. The top band can be adjusted for large or small heads. The cord is super long (7 ft.) and also has a convenient volume control.",
      "rating": 5.0,
      "verified": true,
      "author": "Cami Ludlow",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "I used it once and then",
      "text": "I used it once and then my grandson took it away because it works so good. I'll have to order another one for me I guess. The sound is great and it makes you feel like you are in the game for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "I am very happy to receive this ps4 headset",
      "text": "I am very happy to receive this ps4 headset, which is very useful for me.Voice was clear, mic picked up well, sound was great and powerful stereo with bass.It's comfortable to wear,. During game play, players can hear me very clearly and no annoying white noise or weird background noise. I'm pretty certain these won't let you down.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Great Gaming Headphones",
      "text": "I ordered these for my son. At first glance he absolutely loved them! He loves the LED light up feature. Shipping was fast. They are very comfortable with padding for the top of your head & the ear muffs are very comfortable, Fits ears nicely. The mic works great, & stays in place unlike other headphones that will drop down. Reduces background sound. The cable is long which he loves. Overall great product for the price! Definitely recommend buying!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam T",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great for online gaming",
      "text": "My son loves to play Fortnite with his friends and this headset works perfectly for him. We have a PS4 and it was a breeze to connect and start playing. Great quality and sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Murray",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Quality headset!",
      "text": "I am so pleased with this headset! The ear area is soft and comfy and doesn't poke or annoy my head. They also work well with my laptop and desktop PC so anything with a multiuse is a big win in my book. Sound is clear and product came exactly as described. Definitely worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "my son just love it. there are couple of great things about ...",
      "text": "my son just love it. there are couple of great things about this head phone : it is flexible.and has all the connectors to connect it to all the different type of connectors (USB etc...). once connected it has a cool blue light. you can close the microphone and used it as an headphone only.",
      "rating": 5.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Excellent product and customer service!",
      "text": "My son has been using this headset for months now and he says it works great. We did have a small issue with the microphone not working and I was very pleased when the vendor shipped us a replacement unit within a few days, free of charge. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Very disappointed.",
      "text": "I read the reviews about the mic issues... but we went ahead and bought these headsets for our 13 year old son. He used them for one day and guess what...the mic stopped working. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "J.L",
      "helpful_votes": 3,
      "publication_date": 20180408
    },
    {
      "title": "A little uncomfortable for long periods of time",
      "text": "Well made, seem durable, but I find them a little uncomfortable to wear for long gaming sessions. The mic is awesome though, and so is the sound. I see little use for the light, but maybe some people like this feature. I found it unnecessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Works but has a short life-span",
      "text": "The first month I got it it worked wonders. The sound and everything worked perfect. I noticed a couple days later when I slightly moved the plug in I heard static. Another month later it got worse and it got inconvenient because for it to work I had to hold the cord a certain way to listen to my friends and for them to hear me so it wouldn't disconnect. Also one side stopped working as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Taco Bell",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Affordable and great!",
      "text": "These are great! They are holding up to my 6 and 10 year old well! They are rough and I've gone through a lot of these and so far its great! The sound is good. The mic works well. Great price!",
      "rating": 5.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Great gaming headphones for the price!",
      "text": "I had bought these as my default play station headphones were not as good. I wanted a microphone so I could play fortnite with my friends. These have been really helpful and for the price it’s a great deal. It’s quite comfortable too. I’ve had it on for hours. I would definitely suggest it as a buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Mithilesh Naik",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "wouldn't recommend,  break easily",
      "text": "These broke only a couple months after I bought them. Very cheap. Sound quality isn't terrible, but if they don't hold up, who cares about the quality of the sound.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Ehlers",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "and I think I made a good decision for buying this",
      "text": "I bought headset for myself to play my PC game and use it for Skype call. I was originally look for a Skype specific usb headset but turn out getting this game headset for doing both; and I think I made a good decision for buying this. I have used it for few days. so far the sound is great and still get some bass. Plus the mic is incredible clear; everyone can hear me nicely with in the meeting. Price is not bad and most importantly the Blue led light is SUPER COOL!!!! Love it! You can’t go with this a USB headset.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael chan",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Lasted about 4 months",
      "text": "My son uses this headset a lot, they finally broke after a little over 4 months. The sound started getting static. BUT because they are cheap, I'm ordering another set. It's worth it to not have to listen to the game in the background!",
      "rating": 3.0,
      "verified": true,
      "author": "C. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Poor quality wiring connectors",
      "text": "I had originally given this product a one star rating. Main reason is the materials quality. They had ripped off the connectors very quickly and by the constant use of a 10 year old Xbox gamer. Since contacting the manufacturer, they had quickly replaced the original with a new set and provided excellent customer service. I'd say their after market sales department is a good warranty of a quick replacement if so necessary.",
      "rating": 3.0,
      "verified": true,
      "author": "Gamaliel",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Great value for the price!",
      "text": "I bought these for my son's to use when gaming online with their friends. I was pleasantly surprised at how good the sound quality was. Great value, especially for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Hebert",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Not all parts included!",
      "text": "Can't use with x-box without extra peices, and not know till bought and went to use. Now have to get another peice and wait. The extra part costs $40 or more depending on where you get it.",
      "rating": 3.0,
      "verified": true,
      "author": "Recordsball",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Broke after 2 weeks - trying to coordinate return with manufacturer",
      "text": "Worked great for two weeks. Then stopped working. Our son thinking he was doing the right thing contacted the manufacturer who told him they would issue a replacement. Months have gone by and nothing. And now the window to return has closed on Amazon. Do not order this. Too many other options!",
      "rating": 1.0,
      "verified": true,
      "author": "HarborSusans",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Good qualtity, comfortable to wear and looks cool!",
      "text": "I bought this headset for playing PUBG. I really enjoy the gaming experience using it: awesome sound effect, comfortable wearing (easy to adjust to fit my big head lol), light-weighted, nice noise reduction for the microphone (clear conversation with my teammate in the game), good noise isolation (my wife never got interfered when she is working next to me). The blue logo also looks pretty cool when it lights up. I would recommend it to my friends. worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "frontier",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Great Headset",
      "text": "My son loves these. He wears for a couple hours each day and says the sound is amazing. Like the comfortable feel and the blue light is cool too. Works like the more expensive ones but at a fair price.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael N",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Nice",
      "text": "Bought these for my husband since his last pair broke. He loves them. The sound is good. Ear peices are comfortable, doesnt squash his ears. Mic works well. Not completly soundproof but does a pretty good hjob of blocking out most sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Destiny ",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Good for long sessions",
      "text": "It's comfortable to wear and provides good sound isolation. The microphone works well in picking up conversation without sending background noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Bilal pWs",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "EXCELLENT HEADPHONES!!",
      "text": "My 13 year old son loves his new gaming headphones so much that he’s been bragging to ALL of his gaming buddies. One of his favorite features is the mute button! My son has asked for another part due to he loves his headphones so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Tameia Evans",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Suitable for Xbox gaming, quite clean audio quality",
      "text": "Brought these pair of headphones for my Xbox and pairs quite well and fits nicely over the head. Audio quality is pretty neat and the sound doesn't crack at high volumes for me. Overall a nice buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ankit Dhaniwala",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Cool Headset, good quality, good price",
      "text": "Bought it for my 13 yr old son and his PS4. He says it's a great product. Longer wire, cable plugs are sturdy, mic is sleek, sound comes out good quality with VERY snug comfy ear muffs. Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great Quality and Great Price",
      "text": "Headphones are made from a high quality plastic and feature soft earcups. There’s also a pad on the top portion of the headphones for added comfort. The sound quality is really good and the mic works great as well. The cord features a volume control and on/off switch which is very handy. I’d highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Great sound comfortable",
      "text": "How amazing are this gaming headphones set from henscoqi. If you like gaming and have a PS4 or XBox1 this is for you. It can also be use for listening to music without been bothered from outside noises. Sounds very clear 💯 guarantee.",
      "rating": 5.0,
      "verified": true,
      "author": "shopunlimitex",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Large but lightweight",
      "text": "I was worried that these headphones would be too heavy but they are light weight and well made. The ear pads are comfortable. The only negative would be the mic isn't adjustable to each side but that's fine with me. Sound is comparable to my Xbox afterglow headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "D.Scott",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "First set died - company made it right",
      "text": "These worked great for 6 weeks (just looking enough that i can't send them back) then stopped working. My daughter is heartbroken. Update: the company provided a replacement headset for my daughter. I am changing my review to reflect there fact they are making it right.",
      "rating": 5.0,
      "verified": true,
      "author": "spacegirl99",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "High quality",
      "text": "Got them as a gift for my son and my nephew, they’re both addicted to video games, they loved it it’s very high quality",
      "rating": 5.0,
      "verified": true,
      "author": "Rawan",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Clear and sensitive",
      "text": "These are really great in my xbox. You can clearly hear footsteps in my FPS with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey D.",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Good product",
      "text": "As soon as it came in the mail my son was ready for it. He said the quality is perfect. He’s really enjoying it",
      "rating": 5.0,
      "verified": true,
      "author": "Toy Alexander",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "I really like this product!!",
      "text": "I ordered these to use for my PS4 gaming and let me tell you they are amazing. They have the best sound quality I have ever used which I really love. I also like the packaging it is very appealing to the consumer. I also like the light that is given with the head, it’s really awesome. I think I would recommend this to people who are looking for gaming headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Barkat Ali",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Excellent Service",
      "text": "I have decided headphones are meant to last no longer than 3 months. These quit after only two. But a replacement was provided, and we are thrilled with the service we received.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Didn't even last one month",
      "text": "First off they seemed great but then the piece that plugs into the controller broke off & is still stuck in the controller. We didn't even have them 3 weeks. Would not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "brandy",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Horrible/cheap",
      "text": "This set came broken. Never really got a chance to enjoy them. So disappointed I just got another set all together.",
      "rating": 1.0,
      "verified": true,
      "author": "Trent",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Can you really get quality for $20? YUP!",
      "text": "The sound quality on these are surprisingly good, the noise cancelling as well. They have also managed to survive a pair of 7yr olds so the build is pretty damn sound. ***UPDATE*** Nevermind. Don't buy. They lasted hardly a month.",
      "rating": 1.0,
      "verified": true,
      "author": "P. J. Arellano",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Quality headset!",
      "text": "I ordered the headset for PS4. First thing I noticed was they are really comfortable. I like the flex in the headphones so it won't break. The sound quality is awesome. The bass sounds really good. I also like that you can turn the mic on and off during game play. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great headphones for gaming and music!",
      "text": "Great headphones! My son uses them with his xbox one and laptop for gaming. Very good sound quality. Seem to be very well made. The headphones light up when plugged into a USB port.",
      "rating": 5.0,
      "verified": true,
      "author": "yankeegirl1025",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "\"Awesome\" headset",
      "text": "Grandson loved this! I can't confirm from personal use. But according to grandson, \"This headset is awesome!\" If you want to please a preteen, teen gamer, this is a great gift idea",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Anne Lavery",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "They fit well and he has a large head but it accomodates easily. He says they have great sound and his ...",
      "text": "My son ises this headset everyday with his Xbox one . They fit well and he has a large head but it accomodates easily. He says they have great sound and his teammates hear him well with the microphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Stayathomemom",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Great XBOX Headset",
      "text": "I used this as a gift for my friend's son who plays the x-box frequently. He LOVED it. I tried it just to see the quality and it was great. Loved the blue colors!",
      "rating": 4.0,
      "verified": true,
      "author": "Candie ",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "‏Awesome",
      "text": "I purchased this headset for my son for when he plays his PlayStation was with his friends. He absolutely loves it. I tried it out myself. It has good sound quality, the headset is comfortable on my ears, and it was a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "zina",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good value and good buy",
      "text": "I bought this for my boyfriend and he loves this. He uses on his PC for playing video game with his friends. He is very satisfied with the sound and speaker quality. They communicate through the online group chat with no issues. We will definitely recommend this well made product. And a plus, there's a LED light on the side which is very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Boss and Me ",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "For the price, you can’t complain!",
      "text": "For the price, you can’t complain! You don’t need to spend big money on a surround headset. You only have two ears so two speakers are all you need to hear where the bad guys are while playing games. The mic works, the sound is more than acceptable and the price is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Fantastic headset for the price. Good construction and sound quality.",
      "text": "Great deal for the price. Sound quality is really good and the Mic quality is great. They are comfortable on and block out outside noise very well. A fantastic deal at this price. I wouldn't hesitate buying another set or recommending them.",
      "rating": 5.0,
      "verified": true,
      "author": "TheBigOldDog",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Right earpiece did not work",
      "text": "I bought this for my nephew for gaming. My nephew tested it right away, and the right ear piece did not work, and the lights on the side of the headset only turned on when it was plugged into a USB port. Needless to say I sent it back for a refund, and bought a different headset instead.",
      "rating": 1.0,
      "verified": true,
      "author": "josiefus",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "spend more to get more",
      "text": "you get what you pay for and these are cheap and ok for a younger gamer.",
      "rating": 3.0,
      "verified": true,
      "author": "Dustin Knecht",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Good headset for prices",
      "text": "The head set works great if. Got them for xbox one light don’t work if using with xbox and the minimum size is a little to larg at least for my head",
      "rating": 3.0,
      "verified": true,
      "author": "sharky",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "My son loves it... me not so much.",
      "text": "My son loves these headphones. The audio sounds great, color is cool in the dark, works fantastic with the Xbox OneS. Only drawback is that it needs another adapter to make the lights work, but son found a workaround with an inexpensive battery pack. I don’t care much for them since I now have to tap him on the shoulder to get his attention now!",
      "rating": 4.0,
      "verified": true,
      "author": "Polini",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Bargain",
      "text": "I use it strictly for In-Game chat with friends. More than solid for the price, it’s 2 years old now. WTF is that brand name though",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Carriere",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Don't buy it",
      "text": "Bought this four months ago and was always glitchy. Yesterday the mic stopped working out of nowhere and the sound is still working. We have barely used this due to the limited time I have my son and the product still looks brand new. Very disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua Arrington",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "I liked this headset a lot",
      "text": "I liked this headset a lot! It worked very well and the sounds was very clear and made me feel emersed in the VR game when I played. The design looks very cool too. I also liked that it came with a splitter so that you can use it on a desktop too, because with my other headphone I can’t use the build-in mic on my desktop. A good buy for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "DP",
      "helpful_votes": 0,
      "publication_date": 20180413
    }
  ],
  "product_meta": {
    "title": "Xbox One Headset, Henscoqi PS4 Headset 3.5mm Over-Ear Bass Surrounding Stereo Gaming Headset with Mic, Noise Isolating and Volume Control for PS4, Xbox One,PC, Nintendo Switch, Smart Phone,Laptop",
    "rating": 3.9,
    "feature_bullets": [
      "SURROUNDING STEREO SUBWOOFER -- High magnetic core design brings clear and superior sound when playing games. Surrounding stereo design is superb that you could feel in gaming environment once using, like shock environment, drastic gaming situation. Perfect for plenty of games like World of Warcraft (WOW),LOL, Call Of Duty, GTA Series, Assassins creed etc.",
      "HIGH SENSITIVE MICROPHONE -- With retractable inner side and hidden tube, PS4 headset could transmit high quality with noise canceling feature to deliver accurate, clear and vivid sound.Flexible mic design makes it convenient for adjusting that it could be adjusted it to 120 degrees up and down base on your own.",
      "HUMANIZED DESIGN -- The XBOX One Headset has self-adjusting head beam base on required size and space, that is amazing for game players who are involved in a long time on the game. It weights light that usually forget the headset on your head that bringing such wonderful experience for players while using it. Furthermore the microphone is flexible to adjust. LED light design makes the gaming headset so fashion.",
      "EASY TO USE -- 3.5mm international standard (CTIA) device interface (Right channel +/ground-/left channel+/microphone+), USB interface for power supply for the LED lights, the ps4 headset is single hole interface and one to two tieline. Instruction book is attached for further operating.",
      "MULTIPLE COMPATIBLILITY -- Gaming headset (for ps4 xbox one) matches various of devices whatever pc, mobile phone, XBOX ONE, Ipad etc. You could enjoy playing games capable with these devices along with this gaming headset with no problem, as well as it could also capable for listening music, watching TV series, and answering the phone."
    ],
    "specifications": {
      "Package Dimensions": "8.6 x 8.4 x 3.8 inches",
      "Item Weight": "1.1 pounds",
      "Manufacturer": "CL-A",
      "ASIN": "B078HKZJ2H",
      "Item model number": "CLHEADSET100-HO",
      "Customer Reviews": "3.9 out of 5 stars691 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#25,107 in Video Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 10, 2017"
    },
    "categories": [
      "Headsets",
      "Accessories",
      "Video Games",
      "Xbox One",
      "Electronics"
    ],
    "price": ""
  }
}