{
  "website_summaries": [
    {
      "verdict": "Trusted golf club manufacturing name delivers another outstanding design with the latest features.",
      "pros": [
        "Delivers maximum distance results, even when you don't strike the ball perfectly",
        "Offered in several different club face lofts and shaft materials to meet the needs of your game",
        "Contains all of the latest design features for forgiveness of off-center ball strikes"
      ],
      "cons": [
        "Very pricey",
        "Takes some practice to gain a feel for the club face's responsiveness"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good club",
      "text": "Received quickly with no damage. Item was as described. Hitting the golf ball correctly is still up to the individual.",
      "rating": 5.0,
      "verified": true,
      "author": "Zappem",
      "helpful_votes": 10,
      "publication_date": 20180928
    },
    {
      "title": "Nice product",
      "text": "This product was well packaged and perfect. I received and email from the company asking if everything was satisfactory with the product. I was impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Berta",
      "helpful_votes": 6,
      "publication_date": 20181115
    },
    {
      "title": "Looks New and arrived quickly! Great Deal!",
      "text": "Item arrived quick and i am absolutely pleased. Golf club looks like it came off the shelf. Packaged very good and came with head cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Clara",
      "helpful_votes": 2,
      "publication_date": 20190605
    },
    {
      "title": "Taylormade fairway woods",
      "text": "Very flexible shaft for a slow swing, yet ball still expoldes off face..",
      "rating": 5.0,
      "verified": true,
      "author": "Jkowalski",
      "helpful_votes": 4,
      "publication_date": 20181029
    },
    {
      "title": "Excellent club",
      "text": "Have always been a low ball hitter, this club gets it up in the air and carries a long ways. Have the 5 wood and 3 wood with the regular shaft. I am 60 yrs old, love these clubs and they fly very straight...",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart D.",
      "helpful_votes": 2,
      "publication_date": 20190830
    },
    {
      "title": "Taylormade",
      "text": "Another top quality golf club from Taylormade. Got the complete set of woods they play longer than my previous set. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Shelton",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Forgiving",
      "text": "Comfortable and light 7 wood for me to swing (35 years old/5’6” and 105 pounds) but it gives nicely heavy feel at impact. Very forgiving- it replaced my Honma 7 wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Kim",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Disappointed with this product",
      "text": "I thought I was buying a 3 wood this is a 5wood witch I already have when I wanted to return it I had to pay shipping and 15 percent restocking fee this was not good",
      "rating": 3.0,
      "verified": true,
      "author": "DILLY DILLYAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "TaylorMade M4 Fairway Woods",
      "text": "Awesome fairway wood. Sound and feel is superb. Replaced an old TaylorMade r580 with the M4 and am averaging 20 yds further with better accuracy. Ultimately, golf clubs come down to personal preference - shafts are where customization really shows improvements. However, the quality of this stock option is very nearly unbeatable.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Omahen",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "A very nice fairway wood.",
      "text": "This club has a great feel to it. It feels solid and creates a nice sounding feedback when hit properly. I would recommend this club.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike voellinger",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Bomber club!",
      "text": "Purchased both the 3 and the 5 metal woods. They are a game changer. Easy to hit and longer than any I've seen. I'm a 67 year young, 2 handicap golfer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great club",
      "text": "Stiff shaft 5 wood. Great club. Came with head cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Walker",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Outstanding 3-Wood",
      "text": "This 3 wood is outstanding. I originally bought the Vixa, but I can't get the distance that I can with this club. It flies the air and the shots are just beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Love",
      "text": "Great gift! My father-in-love cried when he opened it & is very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great!!",
      "text": "Hit this about as far as I hit my drives! Beautiful as all taylormade clubs. Light weight and swings perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Rayner",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "M4 replaces my driver in tight fairways",
      "text": "M4 - 3 wood 16 degree Very easy to , consistently, hit straight From the tee box , I’m averaging approx 227 yards , straight down the pipe.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip McGrath",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Get your swing speed measured for proper shaft flex.",
      "text": "It is as hittable as it looks. Love the club. Seems to have a larger hitting area than my old Titleist 907. Not as satisfying when hit right on the sweet spot, but a small price to pay for its performance.",
      "rating": 4.0,
      "verified": true,
      "author": "greg",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Great product !",
      "text": "Forgiving and easy to hit. TaylorMade engineered some high tech into these fairway woods. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "golfn9",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Nice club/no headcover",
      "text": "Nice club. Did not come with headcover which was disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "R Menice",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Works well for 87mph club head speed.",
      "text": "The TaylorMade 3wood hi (16.5)/S was a great buy. 65gr shaft/red atmos (fujikura) feels really good. Ball flight comes out a bit higher for reaching greens. Luv it.",
      "rating": 5.0,
      "verified": true,
      "author": "JRos",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great Deal",
      "text": "Fairwy driver is all I expected to be. The delivery was faster than expected and the price was very fair.",
      "rating": 5.0,
      "verified": true,
      "author": "K & E",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great Club and Seller.",
      "text": "High quality and forgiving 3-wood - fantastic club. Fast shipping and packaging by the seller. Highly recommend both the club and seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Brudos",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "M4 5 wood",
      "text": "What can I say it’s a M4 Taylormade Wood, best in the bussiness.",
      "rating": 5.0,
      "verified": true,
      "author": "Stan Espinosa",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Try it before you buy it",
      "text": "Hard to hit at first. What is your return policy?",
      "rating": 1.0,
      "verified": true,
      "author": "Francisco Montejano",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "When you hit it square, you can’t even feel ...",
      "text": "When you hit it square, you can’t even feel the ball leave the face it’s so smooth. Not very forgiving on even slightly off centered hits. Just takes some practicing with the club.",
      "rating": 4.0,
      "verified": true,
      "author": "Anson Blackall",
      "helpful_votes": 5,
      "publication_date": 20180326
    },
    {
      "title": "Makes great clubs.",
      "text": "Here was no head cover in the shipment. The club is as advertized.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Crawford",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Beautiful looking with the action our son-in-law was looking for",
      "text": "We bought this as a birthday gift for our son-in-law. He was thrilled. He had wanted it to be \"stiff\" which it definitely is. Because we live in the Northeast, it will be a while before he can actually try it out on a golf course. Looks and feels great. My husband, who used to play golf, was impressed when he checked it out. Should last a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 2,
      "publication_date": 20180312
    },
    {
      "title": "I liked the fact that O can get the ball in ...",
      "text": "I liked the fact that I can get the ball in the air a lot easier & more often. The higher loft makes a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Joaquin O.",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Four Stars",
      "text": "Item exactly as described, can't wait to get to the range to try it out!",
      "rating": 4.0,
      "verified": true,
      "author": "Rod S.",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Improve my game",
      "text": "Hopefully this club will help my game, if I can stay on the fairway!",
      "rating": 5.0,
      "verified": true,
      "author": "NDVal",
      "helpful_votes": 0,
      "publication_date": 20190804
    }
  ],
  "product_meta": {
    "title": "TaylorMade M4 Fairway Wood",
    "description": "Overview * The M4 fairway wood combines TaylorMade's latest innovations to provide a powerful fairway club with ultimate forgiveness. * Lighter carbon materials are used in the crown and sole to save weight that's strategically repositioned to create a lower center of gravity. * A more advanced Speed Pocket boost ball speed across the face to increase distance and forgiveness. * This club is more stable thanks to split weight mass pads that increase MOI by distributing weight to the perimeter of the club head. * TaylorMade's M4 fairway is a great fit for any golfer. The combination of distance, forgiveness, and easy playability make it ideal for all ability levels. Features * Lightweight carbon crown and sole frees up weight that's repositioned for a lower, more powerful center of gravity * More advanced Speed Pocket offers more ball speed across the face for added distance and forgiveness * Geocoustic Technology optimizes playability, sound, and feel in an easy-to-launch, larger footprint * Split weight mass pads boost MOI with perimeter weighting for greater stability * Ultra-strong steel face insert is thinner and faster to further optimize ball speed * Fluted hosel improves sound and feel without shifting the center of gravity location * Includes headcover Lighter MaterialsThe 5-layer carbon crown and sole saves eight grams of weight that has been moved to create a lower, more powerful center of gravity.Advanced Speed PocketTaylorMade's signature Speed Pocket is engineered for faster ball speed all across the club face to give you more distance and forgiveness.Geocoustic TechnologyThis unique design increases playability by creating a large footprint in a low-profile shape for easy launch from all types of lies. The sole is shaped to improve sound and feel as well.Split Weight Mass PadsA pair of mass pads split weight toward the heel and toe of the club, increasing MOI with perimeter weighting for more stability and forgiveness.",
    "rating": 4.8,
    "feature_bullets": [
      "Speed pocket creates more ball speed across the club face for more distance & forgiveness; Split weight mass pads provide increased MOI & perimeter weight distribution",
      "Ultra strong ni co 300 steel face insert allows for optimized ball speed",
      "5 Layer carbon crown creates a lower CG by saving 8 grams vs a steel crown, driving higher launch while reducing spin",
      "Fluted hostel provides superior sound and feel without compromising CG location",
      "PLAYABILITY THROUGH GEOCOUSTIC TECHNOLOGY: A large footprint and low profile shape makes it easy to launch and easy to play; The sole is shaped for optimal playability and improved sound & feel"
    ],
    "specifications": {
      "Package Dimensions": "45.28 x 5.43 x 1.65 inches; 1.28 Pounds",
      "Item model number": "Parent_B1245405",
      "Date First Available": "January 29, 2018",
      "Manufacturer": "TaylorMade",
      "ASIN": "B079DCY9TW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Fairway Woods",
      "Sports & Outdoors",
      "Golf Clubs",
      "Sports & Fitness",
      "Golf"
    ],
    "price": 229.99
  }
}