{
  "website_summaries": [
    {
      "verdict": "The on-ear B&O Play Beoplay H8i headphones deliver strong, balanced Bluetooth audio and solid noise cancellation for a high price.",
      "pros": [
        "Strong audio performance with deep bass response and crisp, bright highs",
        "Good noise cancellation",
        "Transparency mode lets you hear your surroundings",
        "Free app has adjustable EQ"
      ],
      "cons": [
        "Expensive",
        "Auto-pause/play function gets old quick"
      ],
      "aspects": {},
      "publication_date": 20180308,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great sound quality but annoyingly tends to slip",
      "text": "As expected from B&O the sound quality is excellent. But, there are two irritating issues- it tends to slip off the head for any slight movement of the head and correspondingly cuts off the sound. Thus the four and not five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Njiff",
      "helpful_votes": 3,
      "publication_date": 20200215
    },
    {
      "title": "Drops bluetooth connection all the time.",
      "text": "The headset now keeps dropping it connection with my I-phone. It never used to. Updated the headphones via the B&O site but made no difference. Very frustrating. Sound quality is very good whist connected but just too hit and miss with its poor bluetooth connections. I find myself just wiring the headphones direct to my iPhone to listen to music as it's the only way to guarantee a connection.",
      "rating": 3.0,
      "verified": true,
      "author": "Snapper",
      "helpful_votes": 3,
      "publication_date": 20190225
    },
    {
      "title": "Bluetooth does not work well",
      "text": "Having previously owned a pair of Bose headphones I wanted to try a different high-end brand. The B&O headphones do not work well with Bluetooth for iPhone X. The sounds dips in and out or the Bluetooth won’t connect at all. The headphones work fine with the aux cord but not well as wireless headphones.",
      "rating": 1.0,
      "verified": true,
      "author": "charlie",
      "helpful_votes": 3,
      "publication_date": 20180731
    },
    {
      "title": "Good but could have been better",
      "text": "Enjoyed these but had to return them due to the low level of anc. The sound quality was good (not up there with b&w but close), and the choice of materials was impressive. They were a good fit and ofered pleanty of low end sound. Just not for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Go Tee Gadgets",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "5 Stars, Love them!!!",
      "text": "So happy with these, was a bit apprehensive about ordering after reading some of the reviews. No slipping off the head, no sound interruptions or sensitivity issues. Love them!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaz",
      "helpful_votes": 2,
      "publication_date": 20190526
    },
    {
      "title": "Bluetooth connection kept dropping",
      "text": "Great headphones and sound is great but I returned them as they kept losing connection with both my phone and my iPad",
      "rating": 3.0,
      "verified": true,
      "author": "PeteA",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Very good product",
      "text": "Comfort easy to connect ,,, the best thing is THE RANGE FROM MY PHONE IS EXTREEEMLY FAR N SOUNDS VERY GOOD👍👍👍👍👍🤭✌️✌️✌️😁😁",
      "rating": 5.0,
      "verified": true,
      "author": "fredrick  rukundo",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Top Brand and it shows",
      "text": "Very high quality and superbly manufactured.Comfortable to wear with very good clear sound",
      "rating": 5.0,
      "verified": true,
      "author": "rmpatterson",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Good quality",
      "text": "Good quality headphones, very happy with them. Comfortable and matching expectations. I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Marvellous",
      "text": "Absolutely marvellous, worth every penny (mind you, quite a few penny :) ) Crisp sound and great bass. The transparency function very handy. And most useful, the battery time is unbelievable. I've been wearing them for more than 9 hours and still going. A premium product with what I believe to be the unique B&O sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Dorin Claici",
      "helpful_votes": 4,
      "publication_date": 20180423
    },
    {
      "title": "Solid 4 Rating",
      "text": "Sound quality is really good on Bluetooth and even better chorded. It definitely takes a bit to get use to the controls. I am having a similar issue to other reviewers where if I lean over, the headphones will fall off. Another issue I’m having is the auto pause. I’ll be walking or move slightly and the sound will pause. I wish there was a way to turn this feature off. The headphones are really stylish and comfortable. I had trouble deciding between the h9i and h8i due to the over ear difference, but I’m glad I went with the on ear because the battery life is superior to the h9i.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 6,
      "publication_date": 20180317
    },
    {
      "title": "Awesome performance",
      "text": "Sound: very clear. The included app lets you tailor the sound. Great bass, mids, and highs. Transparency Mode: VERY clear. I was shocked at the performance - you can whisper and hear yourself very clearly. No hiss apparent. Noise Cancelling: I have to test this on an airplane - in the office, it is very effective.",
      "rating": 5.0,
      "verified": true,
      "author": "TokyoMike",
      "helpful_votes": 2,
      "publication_date": 20180906
    },
    {
      "title": "Cheap build. Best ANC in the market. Low sound.",
      "text": "Invest another $100 and get the 9i. The sand and brown leather on this model feels very cheap and off brand completely, if you do go with these just take the black ones.",
      "rating": 4.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "Great headphones and great deal",
      "text": "Most popular in this category are Sony and Bose. Where B&O shines is battery life and design. I also like the option to listen via wired connection. I have not had any issues. These headphones are comfortable, Bluetooth pairs easily, B&O app (iPad) simple and easy to use. My main use is at work to drown out ambient chitter chatter while listening to music, enjoyable and much less distracting. Excellent build. Probably will buy hard shell case. 5 stars for sound (cannot provide comparison, sorry).",
      "rating": 5.0,
      "verified": true,
      "author": "Robert K Goldman",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "head band sits on the top of skull and is weighty",
      "text": "Since this is the first pair of on ear instead of over earphones I ever had I did not like the way they shifted and the weight on top of my skull was pinned to one area instead of smoothly distributed. I somehow lost track of time and the window is closed for returns but I would return them if I could. Noise cancellation is also good but you have to turn it off to answer a call and it takes some getting used to.",
      "rating": 3.0,
      "verified": true,
      "author": "Peggy",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "glitchy",
      "text": "I've been using these for a few months and there seems to be a malfunction in the play button. The sound keeps cutting out and I have to tap the side to get it to restart. EXTREMELY annoying. I'm going to try to get a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "David Sonders",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Best best best",
      "text": "I’ve used Bose, Sony, Beats and these are my favorite. Its so light to wear which means I don’t get that head clamped feeling after long usage. The play-pause button positioned below the right headphone is often hit accidentally when I hold the headphones to reposition but that’s such a small bump in the overall experience.",
      "rating": 5.0,
      "verified": true,
      "author": "designersays",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Not for me.  Sucks the ears pop",
      "text": "Great and soft like one expect But really tiny pressing on ears and for sensitive ears. That noise cancelling hurts like a suction. Maybe for smaller kids but then needs volume max restrictor",
      "rating": 4.0,
      "verified": true,
      "author": "cruzade",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "not what expected from this brand",
      "text": "alway s it stops for no reason, volume it is not really high, if you go high with volume then you can hear sum really bad noise. i would change them right now however it is to late to send them back. i thought that will be better in time, however i was wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Tomuta Cristian",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Worst customer service",
      "text": "As many pointed out, the right headphone is easily removable to the point that you could drop it while walking in public. This happened to me several times. But, the quality of the headphones is top-notch. Unfortunately, after two years of using these headphones, I lost my charger cable. It took me a month to find a replacement and the customer service of B&O was the worst. They kept asking me to figure out where to find the charger. I will not use a Bang & Olufsen product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Hae Suk Kang",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Beautiful and great sound",
      "text": "After some time spent reading reviews and searching for the perfect pair of wireless headphones, I finally decided on the B&O PLAY, and I don't regret it at all. The noise cancellation is great, the sound is amazing, the battery life is unbeatable and the aesthetics are perfect. I tend to be sensitive when there is pressure around my ears, but I have been able to comfortably wear these for hours. The unique look and top quality of these headphones are exactly what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Didn’t live up to its luxury name and hype",
      "text": "Terrible headphones with an inefficient pause play ability that doesn’t even work well. Suddenly my music would stop playing. It’s very inconvenient and not worth the $400.",
      "rating": 1.0,
      "verified": true,
      "author": "veevee",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great quality but subpar functionality",
      "text": "Was super excited about these headphones but the auto-play/pause feature is infuriating and constantly starts and stops music (sometime up to 10 times per minute), which made me want to snap the headphones in half. Would rather had a $10 pair of headphones that just plays my music uninterrupted.",
      "rating": 2.0,
      "verified": true,
      "author": "Tyler D.",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Best sound",
      "text": "Best sound quality of all that I've tried - looking forward to my flight this week.",
      "rating": 5.0,
      "verified": true,
      "author": "PamM",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Good sound, usability problems",
      "text": "I love sound. The one thing that bothers me most is when the audio stops when I move my head slightly. I have to readjust the headphones again and then a few seconds Later the same issue occurs. Wouldn’t waste my money again. Thought B&O was better than this.",
      "rating": 2.0,
      "verified": true,
      "author": "Mister Imposter",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Complete waste of money. Multiple tries with B&O.",
      "text": "These headphones and two others I purchased from B&O are wretched. They do not last more than a few uses. They are super cheap and break instantly. They are not user friendly. Befuddling. Please do not purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "HappySweet",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Effective, light. Good Noise Cancellation",
      "text": "Easy to use and I like the over the ear approach. I uses it at coffeeshops and provide good noise cancellation.",
      "rating": 5.0,
      "verified": true,
      "author": "Fabio Governato",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Uncomfortable",
      "text": "I have a big head and these wouldn't even fit on me. Disappointing. Have to send them back",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Daniel Johnson",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Solid product",
      "text": "These headphones are a safe bid. Yet, the bluetooth connection not always works well. Battery is great and sound quality and noise cancelling are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "BV",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Buy the H9I instead",
      "text": "Returned after one week due to Bluetooth connection issues as well as music turning off and on due to bad sensors.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Chung",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great",
      "text": "There are better options for ANC, but its sound quality is decent, the design is pretty neat, and customer service is exceptionally good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Battery Not holding charge",
      "text": "Battery, no matter how long I charge, does not have the advertised 30 hours as advertised, the most I have gotten from a charge was 5 hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn S.",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Awesome sound quality",
      "text": "Very fast delivery. The product came with no damage. The sound quality of the product is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Hensley Zhang",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Luxurious headphones!",
      "text": "Way better than any other Bose headphones that I’ve had. Superior sound quality and the noise cancelling works great. It’s expensive but with the material, it’s a luxurious buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrisedu ",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Price of return is high and no support",
      "text": "The mistake I made was purchasing from Australia, as there is no phone or online support available and if there is an issue the price of return is high. The product is slightly faulty. If I lift it off my head the song does not pause as its suppose to, instead it starts at the beginning of the track. Its possible I am doing something wrong, but as I said there was no support",
      "rating": 1.0,
      "verified": true,
      "author": "Healy",
      "helpful_votes": 4,
      "publication_date": 20180319
    },
    {
      "title": "B&O has great products. Bluetooth headphones????",
      "text": "I hate to give bad reviews, but... Linked in one time, that was it. Tried for days to re-connect and never did. Had to send back. Amazon gave full refund, thank you. I have other B&O products for over 30 years that will never give up. These headphone just wouldn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "tom p militello",
      "helpful_votes": 5,
      "publication_date": 20180318
    },
    {
      "title": "Justifiably expensive.. quality comes at a price",
      "text": "Love these..firstly they don't fall of your head..unless your head is like a 50p coin..I've worn these on my bike in the wind and the noise cancelling almost removes all the sound.. beautifully clear sound with the right amount of bass when needed..fab..",
      "rating": 5.0,
      "verified": false,
      "author": "dale burroughs",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Disappointed",
      "text": "I was excited about my new bang & Olufsen Bluetooth headphones but I was quickly dissatisfied in how low the max volume was and the auto pause was just a pain and I've only had them for a couple hours smh what a huge loss of money never again and the funniest thing was before these h8i'S came I was going to order the h9i'S today because I was sure I was getting some of the best the headphones universe had to offer boy was I mistaken smh OVERRATED BIG TIME!",
      "rating": 1.0,
      "verified": false,
      "author": "Headphone enthusiasts ",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "High quality sound and easy to connect",
      "text": "As a person with hearing aids, I have to use headphones as opposed to earbuds and over the years I have had difficulty finding headphones that were lightweight and wireless that also worked well. These are absolutely perfect! I can play a video game or watch a program in the room right next to my sleeping husband without disturbing him or in the room right next to my boisterous children and they don't disturb me. High quality sound and easy to correct.",
      "rating": 5.0,
      "verified": false,
      "author": "L.A.L.",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Very good quality and sound.",
      "text": "What I like: Nice, understated and elegant design. Solid with good quality feel. Sound quality is also excellent. Connects easily. Controls are unobtrusive. Excellent battery life. What I don't like: Does not fold. Noise cancellation is good at canceling outside noise but raises the overall noise floor. The white noise of the noise cancellation generates the noise cancellation is quite loud in of itself​. Overall, good quality and pleasant sound.",
      "rating": 4.0,
      "verified": false,
      "author": "YouMaybeRightIMaybeCrzy",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "in wireless mode the sound is awful",
      "text": "I use these at the office. They are paired to my PC. When I use them in wireless (Blutooth) mode the sound is awful. The sound is very tinny, weird and compressed. I tried updating the software, to no avail. Using the supplied audio cable the sound is very good, so this just makes the wireless mode sound worse in comparison. They do fit snugly, but are very uncomfortable after a few minutes. Very disappointing.",
      "rating": 1.0,
      "verified": false,
      "author": "MA",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "This headphone does not know when it is being used",
      "text": "I strongly do not recommend this product. Unfortunately, it does not know when is being used. Constantly it turns on when is lied on the table and turn off when I am wearing it (usually at work). I am just giving up on them. regards.",
      "rating": 1.0,
      "verified": false,
      "author": "giuliz",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "B&O (Bang & Olufsen) headphones - outstanding!",
      "text": "First, yes, I have a set of BOSE headphones (that plug into my iPhone). So, I enjoy good headphones.These Bang & Olufsen? Outstanding. The sound is crystal clear and I have no complaints at all. The directions were a bit confusing (yes, I couldn't figure out how to sync it with bluetooth as it took a few tries for it to work), but the sound is outstanding. It is lightweight and the controls (on/off, volume, etc..) are on the bottom parts of the left and right headphones. They are comfortable to wear and when I put them on (before the music) I can hear no sounds around me (much like my Bose headphones). Outstanding. Five stars.",
      "rating": 5.0,
      "verified": false,
      "author": "J. Brandt",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Great product",
      "text": "I confess I had trouble setting this product up. And I could not identify all the accessories this product came with (the instructions did not indicate what they were either). The B&O website was very unhelpful, as was the instruction manual the product came with. However, once my brother figured it out and set it up for me, it worked really well and was so comfortable. I wish it came with a better storage/folding option because these would be great for travel, but I think would get really damaged in a backpack or purse. Five star product, one star off for bad instructions.",
      "rating": 4.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "If the price drops get them",
      "text": "Imma give it 5 man these are good thank you for great sound amazing quality the price needs to be a bit lower though but other than that all good",
      "rating": 5.0,
      "verified": false,
      "author": "Mosheh Malachi",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Active Noise Cancellation That Works",
      "text": "I have been used to my other Active Noise Cancellation headphones (BOSE). These B&O are very comparable, and the sound is pretty amazing for headphones. Anything I get anymore is active noise equipped, because it just makes such a big difference in sound quality. Yes, these are expensive, but the ANC works unlike some of the cheaper units that only claim ANC but don't deliver. Overall, I am happy with these and they will reside upstairs so I can quit hauling my BOSE up and down.",
      "rating": 4.0,
      "verified": false,
      "author": "RicoTX",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "I would recommend them",
      "text": "They are really good but the cushions on the ear piece are too small and when they are on your head in a bad position then the sound doesn’t sound that good, but the app works well but it is a little slow but they just made a new app and it is a lot quicker with connecting them. And that they come off of my head because the piece goes on your ear not around it and that is a problem with me",
      "rating": 4.0,
      "verified": false,
      "author": "Delete this",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Fails to deliver on the basics.",
      "text": "Bluetooth pairing just doesn't work. May as well have bought a regular pair of headphones. They just don't do what they're supposed to. Mine may be a dud set, but I have seen similar complaints online so would suggest you steer clear.This isn't even new technology. Annoyed to spend so much on this when I could have paid half the price for a brand that actually worked.",
      "rating": 1.0,
      "verified": false,
      "author": "Strength of 80 midgets",
      "helpful_votes": 4,
      "publication_date": 20180402
    }
  ],
  "product_meta": {
    "title": "B&O PLAY by Bang & Olufsen Beoplay H8i Wireless Bluetooth On-Ear Headphones with Active Noise Cancellation (ANC), Transparency mode and Microphone Black - 1645126",
    "description": "Color:Black\n\n\"With a contemporary, streamlined design and advanced features, Beoplay H8i wireless ANC headphones make it easy to enjoy rich Bang and Olufsen Signature Sound on the go.\n\nH8i features a convenient Transparency Mode that lets you tune in, or out, of your surroundings with a single click. An innovative built-in proximity sensor automatically pauses audio when you remove your headphones and then picks up the beat when you put them back on. To expand your sound, pair these high-quality headphones wirelessly with up to two devices at the same time—with an increased Bluetooth range of more than 100 feet, you have the freedom to move away from your devices while still enjoying seamless music streaming. When it's time to make a call, you can communicate clearly with these wireless headphones thanks to two dedicated microphones that are positioned at the optimal angle and distance for superior voice quality.\n\nUsing the Beoplay app, you can turn ANC on or off, adjust tonality, and select preset ToneTouch sound profiles to customize your listening experience. The updated H8i Bluetooth headphones feature a significant increase in battery capacity over their predecessor, with an intelligent battery-saving function and optimal circuit system that exceeds industry standards for up to 30 hours of playtime. When the battery eventually needs recharging, the lengthy USB-C charging cable lets listen comfortably while you wait and is compatible with all Beoplay Bluetooth speakers.\n\nDesigned by Danish industrial designer Jakob Wagner, these high-quality headphones feature a durable leather headband, smooth anodized aluminum discs, and soft lambskin and memory foam ear cushions for a luxurious look and feel. Ideal for active lifestyles, these sleek on-ear headphones are as attractive as they are functional and at just 0.5 lbs., they’re comfortable enough to wear all day, wherever your music takes you.\"\n\nBattery: Up to 30 hours with Bluetooth and ANC, Up to 45 hours with Bluetooth only, Up to 42 hours wired with ANC + control, Charging time: approximately 3.5 hours.",
    "rating": 3.9,
    "feature_bullets": [
      "NEVER MISS A BEAT: H8i wireless headphones have a built-in proximity sensor that automatically stops playback when you remove your headphones and resumes when you put them back on.",
      "Frequency response - 20 - 22,000 Hz"
    ],
    "specifications": {
      "Product Dimensions": "7.3 x 2 x 7 inches",
      "Item Weight": "7.5 ounces",
      "ASIN": "B078HQ5QQJ",
      "Item model number": "1645126",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "3.9 out of 5 stars338 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#1,189 in On-Ear Headphones#4,675 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 9, 2018",
      "Manufacturer": "B&O Play"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 279.99
  }
}