{
  "website_summaries": [
    {
      "verdict": "The K3 has above-average overall speed, but its disorganized menu and limited range on 5GHz make it only worth the price if you really like the design.",
      "pros": [
        "It's fast and consistent on 2.4GHz, and it looks relatively “normal” compared to other futuristic-looking routers"
      ],
      "cons": [
        "The web interface and app need work",
        "For the price, the long-range speed on 5GHz was disappointing, and it lacks detailed QoS to manage bandwidth",
        "It also doesn't have extra anti-malware features to protect your smart devices"
      ],
      "aspects": {
        "Setup": 7.0,
        "Features": 6.0,
        "Performance": 8.0
      },
      "publication_date": 20180331,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beware---Phones home to Chinese e-commerce website",
      "text": "I connected this router to my pihole server and noticed with alarm that it incessantly called home to ip.taobao.com. Sending it back...this is router appears to send your browsing info through China. For comparison, tp-link router does not phone home to China.",
      "rating": 1.0,
      "verified": true,
      "author": "NavyGuy",
      "helpful_votes": 27,
      "publication_date": 20190121
    },
    {
      "title": "Perhaps great for small homes and non-gigabit ISPs, not for my situation however",
      "text": "This is a great entry level router for 2-3 bedroom homes that has 100mps internet I am sure. I have relatively large home and gigabit FIOS, just like many other routers including $1K Magnolia router from BestBuy, nothing beats Quantumgateway that comes with FIOS service in power output. The issue that I have with QG is the range. Power decreases drastically on second floor so I am in need of a replacement. I am yet to find one however after trying over a dozen famously reviewed routers..this is no exception.. All the routers overpromise and underdeliver..",
      "rating": 2.0,
      "verified": true,
      "author": "Hans Blix (Pol)",
      "helpful_votes": 4,
      "publication_date": 20180810
    },
    {
      "title": "Very easy to set up, performance is outstanding",
      "text": "After connecting this Wifi router to my cable modem and the power plug, it took all of about 5 minutes to set up the 2.4 and 5ghz wifi networks and the guest network. Just followed the quick set up card that came with the router and set it up with a desktop. Then downloaded the Android app and did all the advanced stuff. Very easy to work with and the speeds are incredible. I have a 200 mb/s connection and am getting constant 230+ mb/s downloads with the 5 ghz wifi connection and with a wired connection to the router.",
      "rating": 5.0,
      "verified": true,
      "author": "G.E. from HI",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "DO NOT BUY!  Manufacture Error.  All devices are melfunctioning.",
      "text": "Price continue to drop down and You think $32 for AC1900 with Intel inside is great deal. Also looks fancy and nice functions (MIMO and others). BUT it is simply JUNK. That's why they keep drop down the price. Wired speed, Wifi signal strength, Bridging, Wifi extending.....etc, none of them are working correctly. Wifi signal is really weak (slower then my AC1200 device), continue to bounce (lost signal and regain), Wifi extention is not working with new firmware, No Bridging function, ....OMG.... it is JUNK.",
      "rating": 1.0,
      "verified": true,
      "author": "UncleJ",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Surprised",
      "text": "I hadn't heard of Phicomm routers before but at a price under $60, I had to give it a go. What is great: 1. Nifty LCD display on top of router. 2. Very fast. 3. Great style (unique) What could prove a challenge: 1. Setup wasn't easy but once completed, I found the router menu very complete. 2. WPS has made us lazy. This router doesn't have WPS, so get ready to relearn how to pair devices. What is bad: 1. No telephone customer support. 2. Only 3 LAN ports. Recomendation: BUY",
      "rating": 5.0,
      "verified": true,
      "author": "C. Krater",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Excellent router at any price",
      "text": "I got this router on sale for under $60 and it is hands down the best router I've ever owned in the 20+ years I've used wifi routers. Easy setup, easy update, solid fast connections for all my devices. I researched this router before buying it and love that it will handle over 120 devices at once thanks to mu-mimo at the maximum speed each device will handle. Gigabit input from my cable modem and output to wired devices. 600 mps on 2.4 Ghz, 1300 mps on 5 Ghz and my 4K TV gets a great picture with no buffering.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnie E McBride",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "great router at a great price",
      "text": "bought it as a replacement for old wifi router and used it to pair with my AC network adaptive. I could not believe that this installed as easily as box said it would. Connect the modem, connect the power, give it a minute, then connect wirelessly and enter to this smart wifi setup through my browser. this covers my house completely. I have wireless coverage throughout my yard and house even including the basement. How refreshing. The coverage has been quite good as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 3,
      "publication_date": 20180323
    },
    {
      "title": "Limited feature set, doesn't work for video",
      "text": "So, while this router was very very fast on WiFi performance, the range was limited and any device using a video stream was unreliable. This is probably due to WMM not being set properly. Unfortunately the firmware does not allow you to change WMM settings. For this reason, it's unreliable as a wireless device.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Hull",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Do not buy.",
      "text": "I logged into my router easly this week, and it said my firmware was two years out of date. It is only a year old. So I undated the firmware. Yesterday morning it was working just fine, then it died and would not connect to the Internet. I ordered a new router which will be here tomorrow. I am running on an old router until the new one arrives.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephen Gibbon",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "but I want to switch to something that looks better. Then I found this one",
      "text": "the design of the wifi router is one of the reason for the purchases. I used to have linksys, but I want to switch to something that looks better. Then I found this one. It is a reasonable price and it was a super easy installation process, I am not a computer person, but I am able to install it very quickly. So far, the wifi internet is stable and I am able to stream video without any interruption.",
      "rating": 5.0,
      "verified": true,
      "author": "Harry Barkley",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Inconsistent",
      "text": "I have had inconsistent results with this router over the last year. I have to reboot it about every 2-3 days. It didn't work with my old fire stick so I bought a new one. It worked for awhile then stopped. It has now stopped working altogether and I have had it just over one year. I am now buying another router :(",
      "rating": 1.0,
      "verified": true,
      "author": "Kristin M",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "It is not working after three month usage",
      "text": "purchased last Apr.2019, and it's been working ok, but it stopped working now - 7/29/2019. the light stayed orange. I did everything (unplug, reset, ...etc) but the blue light never turned on again... pls help me to connect to seller and get refund or something. It has 24 month warranty, but I do not want this product again and just want to return for refund!",
      "rating": 1.0,
      "verified": true,
      "author": "YOUNGHO Y.",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Unreliable + Zero Support Staff",
      "text": "Terribly unreliable. Multiple issues with using the AppleTV remote app which are temporarily remedied by a reboot. Old Asus router does not have this issue. Tried a factory reset and reconfigure which doesn’t help. When nightly automatic reboots don’t prevent the issue. Emailed support 3x over a 45 day period and never got a response!!!! This company is failing",
      "rating": 1.0,
      "verified": true,
      "author": "Lance D. Seabourn Jr.",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "WIFI stops working",
      "text": "The wifi turns off , you have to REBOOT daily. I have two of these (Upstairs and downstairs) BOTH of them turn of the wifi .. I will have to replace them . As these are WIFI routers it is important to have reliable WIFI reception! My coworker has one also and his does the same.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Anderson",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "After having issues with multiple cable modem & wifi routers ...",
      "text": "After having issues with multiple cable modem & wifi routers, I tried this hoping Intel's involvement would make a difference for extending my wifi access, but had no luck and had to set up the router multiple times and finally decided I was not going to invest more time. Even tried an ethernet connection with no success.",
      "rating": 1.0,
      "verified": true,
      "author": "Woody",
      "helpful_votes": 3,
      "publication_date": 20180221
    },
    {
      "title": "Crappy product, buyers beware!!!",
      "text": "I bought this router 2 years ago and all of a sudden the router needs an update, but now the app in my phone won't update and it's completely nonexistent on the Google app store now. I tried calling support but no adequate contacts are available online. This seems to be a Chinese company. This router was fine at first but very spotty connection a lot of the time. Now, I have to go buy a new router and it will not be from Amazon. Amazon has officially lost my faith in the products they sell. Often times products are coming from China and they do not disclose that.",
      "rating": 1.0,
      "verified": true,
      "author": "Kai A",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great router. No problems.",
      "text": "So far so good! The wifi works very good and was able to put out some impressive speeds. I will update my review as I continue to use it. UPDATE 1- I have had this router for about a month now. Never has it dropped a connection, and is capable of supporting 10 devices easily.",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 2,
      "publication_date": 20180729
    },
    {
      "title": "... other router always gave me headaches & was a waste of time",
      "text": "My other router always gave me headaches & was a waste of time, so I decided to get this as a replacement. I've had this router now for several days, and it works well (so far). I've experienced no issues with signal or connecting. Setup was simple, and after connecting, it automatically checked for updates. The interface shows icons during setup so that I didn’t have to dig through menus to find basic settings. We have 5 people in our house streaming, playing games, surfing, etc. This router has been able to handle all us using it at once. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Will Y.",
      "helpful_votes": 2,
      "publication_date": 20180122
    },
    {
      "title": "Inconsistent",
      "text": "When it works it works well, just never know when it will work. Not consistent, had to reboot the router several times a day. It was intermittent and inconsistent.",
      "rating": 1.0,
      "verified": true,
      "author": "Sugga",
      "helpful_votes": 5,
      "publication_date": 20180213
    },
    {
      "title": "Save your money on this one- don’t buy",
      "text": "I’ve had this wireless router for quite a while now and I do not recommend buying it. At all. It’s constantly going in and out. We reset it daily, just about.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Hunt",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Retracting 1st review - unit was defective",
      "text": "Replacement is working great so far. It's very sleek & beautiful and a great space saver! Great value for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Bird Freak",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "The router is with great outlook and perfectly functional",
      "text": "The router looks so beautiful, smooth surface and modern design. The package is also an A plus one, if you look inside, you'll find it's even better than the Apple product's packages. Also, the router is perfectly functional and easy to setup. We use it for about one week and it's much better than our former one, which was also a $100 product. I would say this one is so worth of the price, I'd enjoy it and recommend to friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Lin",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Great router.",
      "text": "My old router was ancient and was not supporting our network well. This router is very easy to setup and the connection is fast. It was simple to set it up by following instruction and it was up and running within 5 minutes. I am very happy with this purchase. It is a great router and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Do not buy it",
      "text": "The wifi becomes unstable after three weeks. Then it completely disconnected every day. I had to reboot the router every day to get the wifi working. Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Hsiang Wei",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Big bang for the buck",
      "text": "Mega cheap and very fast. Upgraded to gigabit internet and my old router could not handled the speed even hardwired with gigabit ports. This one no problem at all. Has the same chip in as the MUCH more expensive Asus router",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Easy to set up and working okay",
      "text": "Nice Design and easy to set up with my cable modem.. just one thing.. it only has 4 ports (included 1 WAN) .. other than that.. it is working good.",
      "rating": 5.0,
      "verified": true,
      "author": "dadamonkey",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Not connecting to cable modem!",
      "text": "Bought it 7 month ago, and now it wont connect to my cable modem any more.... Had to reinstall my old router...When it was working, it was really good.There is no support from the factory. Would not buy again. Th.",
      "rating": 1.0,
      "verified": true,
      "author": "Th-Man",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "ok",
      "text": "works alright. if you get disconnected from your isp you have to reset this though.",
      "rating": 4.0,
      "verified": true,
      "author": "SwBs",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "no-no",
      "text": "I am trying to use it as an AP, what means I only need to extend the main router with kc3 wifi. After finding out how to set it up, it works sometimes only. The wireless connection takes almost one minute, and then there is no internet connection. After 5 minutes, something happens and the internet connection appears. Don't buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Best for value.",
      "text": "A Very good router for the price. Great signal and speeds. Only cons for me: slowly at reboots and I wanted more lan ports.",
      "rating": 4.0,
      "verified": true,
      "author": "Rodrigo Peniche Santos",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Awesome Router !",
      "text": "This powerful router delivers highly efficient wireless connections improving our WI-FI coverage. It helps to maintain strong and clear signal on all of our devices at the same time. My son enjoys surfing, playing games and he loves it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "stephen",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Better than K3.",
      "text": "Great Router. Bought the K3 first, and returned. Better range and features. For the price it’s hard to beat. Had a ASUS TM 1900. This is as good, with slightly better range. Easy interface. Single Log in a nice option.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles F. Rouse III",
      "helpful_votes": 2,
      "publication_date": 20180824
    },
    {
      "title": "Meh",
      "text": "8yo router was better, bought another new one much better.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Does not work good 5 g",
      "text": "On 2.4 works grate my only issu was. 5g. First day it went out i re boot it was working fine then week later 5 g went out agine. See pics. I was using it on a Sharp ruku tv and x box. Tec sport no help all say",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Maybe it's nice for laptops and cell phones but not good enough ...",
      "text": "It could not handle 3 xbox ones1 laptop and 4 cell phones in a 1100sqft ranch. Xboxes got booted off line. Maybe it's nice for laptops and cell phones but not good enough for gaming. Easy set up.",
      "rating": 3.0,
      "verified": true,
      "author": "Tony M",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Very good value in a next gen router.",
      "text": "very sophisticated router for this price. Easy to set up. Also has an ios app that works well. So far so good after a few weeks of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Very easy set up",
      "text": "My friend that lives upstairs on our apartment building can get signal my old 1 couldn't do that",
      "rating": 5.0,
      "verified": true,
      "author": "amanda",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Works some times, not all the time",
      "text": "The WiFi keeps dropping, I’m supposed to have 230Mbps, and it drops to 3Mbps. I keep having to rebooting it and occasionally it works and usually it doesn’t. I do factory reset, it works for a few days then it drops again.",
      "rating": 3.0,
      "verified": true,
      "author": "Jad J.",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Four Stars",
      "text": "Overall it is a good product. Easy to setup. No drops i have noticed.",
      "rating": 4.0,
      "verified": true,
      "author": "vivian",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Five Stars",
      "text": "This router makes my internet speed much faster and stronger!! No issue so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Daphne L",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "This product is very good, and it has been tested for a period ...",
      "text": "This product is very good, and it has been tested for a period of time with excellent results, strong signals and easy installation.",
      "rating": 5.0,
      "verified": true,
      "author": "L.C",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "i like",
      "text": "This is very useful. I am using a lot of people. This is a lot faster. I am very happy. like very much",
      "rating": 5.0,
      "verified": true,
      "author": "tengkaizhu",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Works great cover large house",
      "text": "Great router very easy installation. Cover large home 2 floors. Great value for price!",
      "rating": 5.0,
      "verified": true,
      "author": "ziv avital",
      "helpful_votes": 3,
      "publication_date": 20171121
    },
    {
      "title": "Reliability",
      "text": "The signal is strong and doesn't drop. I'm satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Easy to set up and get connected with my devices",
      "text": "It’s a router. It gives me internet and doesn’t make me angry. Easy to set up and get connected with my devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "One Star",
      "text": "Bad for streaming and works in few hours not better than asus",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "nice UI",
      "text": "has an incredible amount of features for the price . Nice modern look",
      "rating": 5.0,
      "verified": true,
      "author": "jordan",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Don't waste your money",
      "text": "I bought this router and could not get it to connect to internet, after talking to technical support, it was determined that the unit was bad, they sent me another unit over night and had same issue with new one. It did not work with my Spectrum modem. Returned both units, bought me a Netgear Nighthawk AC1750 Smart Dual Band WiFi Router (R6700). Works perfect",
      "rating": 1.0,
      "verified": true,
      "author": "Lrodri",
      "helpful_votes": 3,
      "publication_date": 20171129
    },
    {
      "title": "Works great.",
      "text": "Works great. Linked easily to my wifi extender and gives me a great internet coverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Very good router. Easy to setup",
      "text": "Received on second day. Very good router. Easy to setup.",
      "rating": 5.0,
      "verified": true,
      "author": "YI",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Speed",
      "text": "Works has expected, i like this product with no problems at all in my 1 month of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Two Stars",
      "text": "Worked for a year and a half and then stopped working.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard S.",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "One Star",
      "text": "This was a mistake to have bought. Wi-Fi signal drops continuously. Major issues.",
      "rating": 1.0,
      "verified": true,
      "author": "Alrick",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "a good buy but not the best WiFi Service",
      "text": "its low cost makes it a good buy but if you want increased range it's not for you. the 5GHz band is 10dB lower than the ASUS AC3100 and 5dB lower for the 2.3GHz band. the router only has three Ethernet ports and was about as fast as the ASUS",
      "rating": 2.0,
      "verified": true,
      "author": "R. A. Majestic",
      "helpful_votes": 4,
      "publication_date": 20171023
    },
    {
      "title": "Just as described",
      "text": "This router is amazing. My old router failed on one of its channels, but no one could tell me why. This had great reviews, was low-priced, was easy to set up, and gives me WAY faster speeds than what I was getting before. I recommend this to everyone at work now. Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jian Li",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Great router for the price",
      "text": "Took barely 24 hours to get delivered. Super sleek and extremely simple to set up. Within minutes of getting it unwrapped and plugged in I had all my devices connected and streaming videos or playing games online, etc. No packet loss. Intuitive UI. Good range in both bandwidths. Great deal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Kunkel",
      "helpful_votes": 2,
      "publication_date": 20171026
    },
    {
      "title": "Great coverage area",
      "text": "Amazing router. Easy to connect. Greater coverage area all my home recived 5G network even in concrete room. Great handling with multi users no buffering on streeming video even 8 devices are connected",
      "rating": 5.0,
      "verified": true,
      "author": "Kok0man",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Super fast delivery",
      "text": "Super fast delivery. GF isn't a Tech Head but took it upon herself to setup before I got home, had zero problems. So far no problems with streaming on any devices. Added bonus it's pretty slick looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Highly Recommended",
      "text": "Just moved into a much larger home where my previous router was not providing the strength needed. One of these Phicomm routers did the job of my previous two routers. It arrived in two days and took minutes to set up. I am not a tech savvy person so the instructions and ease of use made all the difference. Not only is this a great router, but it has a great look as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Briana Prothero",
      "helpful_votes": 0,
      "publication_date": 20171031
    }
  ],
  "product_meta": {
    "title": "PHICOMM K3 AC3150 Dual Band Wi-Fi Gigabit Smart Router (Space Silver)",
    "description": "Style:K3The Phicomm K3 router combines cutting edge technology with Scandinavian design. Engineered with unprecedented know-how, it drives the concept of \"smart home\" to a new dimension. A unique chipset greatly enhances the WiFi performance through maintaining stable capacity while handling more devices. Driven by MU-MIMO technology, connections run simultanenously at stable high speed. Beamforming accurately directs signals to reduce interference and improve range. Enjoy being well-connected at home with the Phicomm K3.",
    "rating": 3.5,
    "feature_bullets": [
      "3.5\" TFT LCD screen shows WiFi connectivity and router status; 3 touch keys allow easy and accurate operation.",
      "Advanced Broadcom BCM4709 Cortex A9 dual-core CPU and 512MB RAM, allowing more devices to connect simultaneously.",
      "Simultaneous dual-band speed up to 3167Mbps( 2.4GHz 1000Mbps and 5GHz 2167Mbps).",
      "USB 3.0 with TUXERA drive, 1 Gigabit WAN + 3 Gigabit LAN with up to 1000 Mbps WAN-LAN throughput.",
      "8 Built-in high-gain antennas offer maximum signal coverage and strong reliability."
    ],
    "specifications": {
      "Standing screen display size": "3.5 Inches",
      "Wireless Type": "802.11a/b/g/n/ac",
      "Number of USB 3.0 Ports": "1",
      "Brand": "PHICOMM®",
      "Series": "K3",
      "Item model number": "K3",
      "Item Weight": "2.74 pounds",
      "Product Dimensions": "2.9 x 8.35 x 9.1 inches",
      "Item Dimensions  LxWxH": "2.9 x 8.35 x 9.1 inches",
      "Color": "Space Silver",
      "Manufacturer": "Phicomm Communication USA, Inc.",
      "ASIN": "B078WS7PHB",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 13, 2018",
      "Customer Reviews": "3.5 out of 5 stars50 ratings3.5 out of 5 stars",
      "Best Sellers Rank": "#71,702 in Computers & Accessories"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Routers",
      "Networking Products"
    ],
    "price": 189.83
  }
}