{
  "website_summaries": [
    {
      "verdict": "Desirable price point per GB for a SSD that also delivers a fast read/write performance level.",
      "pros": [
        "Allows you to select storage capacities between 250 GB and 2 TB",
        "Delivers read/write speeds up to 560 MB per second",
        "Installation is easier than with most internal SSDs",
        "Will cost less to use than many others",
        "Carries a five-year warranty"
      ],
      "cons": [
        "Some problems with longevity",
        "Write speeds are a little slower than other models"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Failed after 5 months",
      "text": "Worked fine. For five months. Then it died. Always make backups! After talking to Crucial's tech support, I found out that I would have to pay for shipping if I want to replace the drive under warranty, so keep that in mind. I also found out that Crucial wants you to connect the drive to power for 20 minutes, then disconnect it, and then try it again. According to their support person that \"very often\" fixes the drive. You can decide for yourself whether you want to trust a drive with your data if it just randomly shuts itself down and needs to be revived like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Ori Pessach",
      "helpful_votes": 470,
      "publication_date": 20180904
    },
    {
      "title": "It failed after 1 month. Spent 3 days and ...",
      "text": "It failed after 1 month. Spent 3 days and another $150 trying to figure out why it failed. go with Samsung",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 138,
      "publication_date": 20180514
    },
    {
      "title": "bad sectors",
      "text": "Ordered 12 of these for a NAS setup. order 6-25-18 arrived 6-26-18 errors reported on 6-29-18 6 Drives have unreadable sectors within 3 days of use. Afraid to ask amazon for refund due to recent users being kicked out of Prime for legit reasons - bad products such as this. Hopefully the support at crucial will be able to assist with replacement",
      "rating": 2.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 64,
      "publication_date": 20180702
    },
    {
      "title": "Cloning software is horrid and a piece of garbage.",
      "text": "Received new SSD today to upgrade my wife's laptop. Followed instructions from Crucial website on how to clone. The software that they use is astrious. Not a friendly user interface at all and it does not work porperly. I attempted to clone her existing drive 3 times and each time it would fail out after 2 hours of cloning. Finally gave and formatted SSD and currently installing a fresh version on Windows 10. I highly suggest spending to couple of extra dollars to get the Samsung SSD. They have their own cloning software that works flawlessly.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon Robertson",
      "helpful_votes": 59,
      "publication_date": 20180822
    },
    {
      "title": "Sudden death 5 months in.",
      "text": "Bought a 1TB and easily installed, performed great but like some others mentioned it died suddenly after 5 months - a Win10 freeze & then power off later, the bios wouldn't even recognize it. I tried power cycling, leaving at the bios screen, leaving disconnected, and ordered and just tried a USB to SATA adapter. It heats up but is not recognized in either my or my wife's laptops. Crucial will replace the drive, but I just don't trust it as my primary boot device, and they won't refund Amazon purchases.",
      "rating": 1.0,
      "verified": true,
      "author": "JM56",
      "helpful_votes": 27,
      "publication_date": 20190122
    },
    {
      "title": "The included Acronis cloning software does not work..",
      "text": "I have used Crucial SSD drives and included Acronis cloning sofware before and this was the reason for this repeat purchase. Acronis software does not even activate for me - it asks for Serial Number - when I enter he Serial Number on the drive it says invalid Serial Number. Cool. Buy ONLY if you are technically adept person with a lot of time to waste. Or if you already own a reliable, spyware free cloning software. For me this is only good for an external drive - a waste of $150...",
      "rating": 1.0,
      "verified": true,
      "author": "cybershopper46",
      "helpful_votes": 23,
      "publication_date": 20190115
    },
    {
      "title": "77 Mb/s read; 846, Mb/s write WHEN you Activating Crucial's 'MOMENTUM CACHE'",
      "text": "Achieve 777 Mb/s read; 846, Mb/s write Activating Crucial 'MOMENTUM CACHE' when you activate Crucial's proprietary 'Momentum Cache'. Note number may vary; AHCI must be set in your mainboard's BIOS, and all 'Prefetch' and 'SupperFetch' service(s) controls must be set to '0' or disabled at 'Startup' in the registry and 'Services' **. And 'Long File Names' *** are disabled with the CMD editor. **** Note: You may ALSO want to turn off 'Virtual Memory' if you have => 16GB of SDRAM (RAM). ** See See online video tutorials on how to do this. *** See online video tutorials on how to do this. **** See Curcial's Notes in the 'Storage Executive' App.",
      "rating": 4.0,
      "verified": true,
      "author": "Wayne Herman",
      "helpful_votes": 23,
      "publication_date": 20180911
    },
    {
      "title": "Beware.",
      "text": "Died after eight months on use. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter A.",
      "helpful_votes": 35,
      "publication_date": 20180812
    },
    {
      "title": "dud.",
      "text": "My Hard drive did not work. It was a dud.",
      "rating": 1.0,
      "verified": true,
      "author": "heather",
      "helpful_votes": 23,
      "publication_date": 20180926
    },
    {
      "title": "a MUST-HAVE for Xbox One, S & X",
      "text": "This thing is a BEAST!! I HIGHLY recommend this product if you are needing a REALLY FAST LOADING external storage for your consoles. HIGHLY HIGHLY RECOMMEND!! PS. You’ll need a 2.5” to 3.5” enclosure, Sabrent has one here for nine bucks. You’re welcome 😉😉",
      "rating": 5.0,
      "verified": true,
      "author": "PlayerUnknown",
      "helpful_votes": 18,
      "publication_date": 20180410
    },
    {
      "title": "Died after 3 days",
      "text": "Great price, but after reading the reviews - it seems the quality has dropped in the 2nd half of 2018. Mine worked fine - until it would no longer boot. This was a replacement drive for my C drive! The one thing you need in an SSD is reliability - if it doesn't work, the price doesn't matter. I've noticed, they don't even reply to complaints any longer.... not a good sign.",
      "rating": 1.0,
      "verified": true,
      "author": "John Hess",
      "helpful_votes": 12,
      "publication_date": 20190108
    },
    {
      "title": "So unlike Crucial products.",
      "text": "When I first installed this I noticed after a few minutes the system would freeze up and I had to hard boot my system. I found online that others experienced the same issue due to drivers. So I updated my system with the latest drivers for this drive. This still did not correct the problem and is still an issue until I purchased the 1 TB WD drive that is working without any issues today.",
      "rating": 1.0,
      "verified": true,
      "author": "Red_Dragon",
      "helpful_votes": 10,
      "publication_date": 20190102
    },
    {
      "title": "... another brand and purchase 3rd party software very frustrating waste of",
      "text": "not working right out of package Software hangs up Acronis suggests purchasing additonal software I'll try another brand and purchase 3rd party software very frustrating waste of time",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Rodriguez",
      "helpful_votes": 19,
      "publication_date": 20180625
    },
    {
      "title": "The only SSD with lifetime only 15 days.",
      "text": "I used this SSD for my work, 90 % with Excel 10% with PowerPoint. The SSD arrived on November 12, have it installed on November 13, and completely dead on November 28. I have lost my 11 years working data, fortunately most of it is able to be restored. If I did not backed it up first I would surely get fired. No matter how interesting this SSD is (value/price wise) don't ever rely on this SSD ever, by all means. Now I am returning it back for refund, hopefully refund is the only thing this SSD could not let you down, but who knows? Let's just see and I will update my review later.",
      "rating": 1.0,
      "verified": true,
      "author": "wisnu wardhana hendratno",
      "helpful_votes": 11,
      "publication_date": 20181130
    },
    {
      "title": "You can get a better drive for the same price.",
      "text": "The drive failed *HARD* after less than one year. I do not have the original packaging (obviously), and their online RMA process requires numbers off of that in order to honor their warranty. We'll see if they contact me back, but I have a failed MX500250GB and a failed 525GB MX300. Junk. Ass. Drive.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Lewandowski",
      "helpful_votes": 6,
      "publication_date": 20191104
    },
    {
      "title": "Great choice to install into an iMac",
      "text": "I ordered this drive to upgrade a dying mid 2010 27\" iMac. I was a little hesitant to do the replacement work myself but using online videos it was an absolute breeze! This SSD has made my iMac feel SO much faster and powerful that I am going to hold off on the upgrade that I had promised myself. If you plan to install this into an iMac that had a traditional spinning HDD, you need to purchase an adapter bracket (that is available here on Amazon as well -  so that you can place this drive into your computer. Once it is in, the computer just hums! Once you go SSD, using a traditional HDD is just plain painful!",
      "rating": 5.0,
      "verified": true,
      "author": "Fuzz",
      "helpful_votes": 30,
      "publication_date": 20180131
    },
    {
      "title": "DOA",
      "text": "Tried to get myself a decent SSD on budget for new gaming PC – that Crucial (2TB) unit seems to fit the bill and purpose. Upon receiving it, unit is not recognized by either BIOS or Windows on 2 different computers and have wasted half of my Sunday trying to make it work. I guess this is the last time I giving a try to this brand, despite all the positive reviews. Also, have to pay for packing of return shipping (Shipping itself is free, but packaging is not) – another bummer. I guess lesson learned here - don't be cheap and go with Samsung...",
      "rating": 1.0,
      "verified": true,
      "author": "Steve G",
      "helpful_votes": 5,
      "publication_date": 20190909
    },
    {
      "title": "defective out of box",
      "text": "I have previously installed two MX500 - purchased directly from Crucial, a breeze to set up and working flawlessly. This one however , a nightmare - took hours to clone (this should have been a warning ). Right from the start caused random BSOD on laptop. Reinstalled old HDD and laptop working fine again.. Generic packaging ( unlike the ones from Crucial) suspect 'B' grade / previously returned items from this seller. Suggest you buy direct from Crucial website",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20190118
    },
    {
      "title": "Needed an SSD 2TB for my Xbox 1X and PS4...",
      "text": "I bought the Samsung Evo 860 2TB for my Xbox 1X, and I needed another but Amazon would only allow 1 per customer, so I did some research found this was close in terms of performance and they are right as I saw an immediate difference in loading my games, performance, compared to the stock HDD, and also when compared to the Seagate Firecuda SSHD that I was currently using. This drive is fast load times are cut in half or better, and the price finally came down to what I was willing to pay, so I highly recommend this drive for gamers.",
      "rating": 5.0,
      "verified": true,
      "author": "H. MCGEE",
      "helpful_votes": 6,
      "publication_date": 20181125
    },
    {
      "title": "Don’t waste your time!",
      "text": "I bought this back in December and just attempted to instal the drive a couple of days ago. Drive would not show up as active drive, but showed up in device manager. Tried to update drivers, but the ssd would not show up in disk manager. Said possible issue might be because my drivers are setup in a RAID array and that is not supported by Crucial. Tried to find a work around, but finically gave up. I had a 500gb Samsung SSD so I decided to give it a shot and within 5 minutes I had it installed and working properly. Unless I can get it to work, I have a $100+ Crucial paperweight.",
      "rating": 1.0,
      "verified": true,
      "author": "BulletproofPig",
      "helpful_votes": 6,
      "publication_date": 20190307
    },
    {
      "title": "This is the Upgrade Every PC Deserves",
      "text": "I installed this drive in an old Dell E6420 laptop and increased RAM to 8GB. You will need to purchase a USB cable/adapter for the cloning process. The cable I ordered (Star Tech USB to SATA III) was less than $10 on Amazon. A spacer is also included from Crucial so the SSD fits snugly in the HDD bay. The cloning process through a USB 2.0 port is painfully slow but the wait was worth it. I am now the proud owner of a brand new i5 laptop. Excel, Word, & Photoshop now load in seconds. Boot time for Win 7 Pro is less than 20 seconds. This is the way all PC's should work.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawon",
      "helpful_votes": 6,
      "publication_date": 20180220
    },
    {
      "title": "Works for about 3 minutes then locks up.",
      "text": "I am unable to use this SSD in my Lenovo desktop computer. I am able to clone my current HD to this SSD just fne and when I initially install the SSD, the computer boots perfectly and is very fast---for about 3 minutes when the SSD stops responding and the computer locks up. I trien a number of times with the same result. All drivers and firmware are up to date.",
      "rating": 2.0,
      "verified": true,
      "author": "Tony Iovine",
      "helpful_votes": 7,
      "publication_date": 20180520
    },
    {
      "title": "DON'T BUY, Blue Screen Crash, DRIVER PROBLEMS",
      "text": "Don't buy this as once you clone the old hard disk of your laptop with this and install, your system will crash into BLUE SCREEN. This happens bcos of drivers and I did all my best and even took help from Crucial Online support but they were also not able to resolve this for 7 days and then I purchased a Western Digital HDD and it was an easy n quick task..not took more than 45 minutes to clone n replace the HDD. My laptop had Win 7.",
      "rating": 1.0,
      "verified": true,
      "author": "Singh",
      "helpful_votes": 7,
      "publication_date": 20190104
    },
    {
      "title": "Unusable for any of three different computers",
      "text": "This drive wasn't recognized by any of three different computers - one self-built desktop and two different brands of laptop.(All three had been working with standard drives.) Tried using the included software, then attempted with a third party software, because we really wanted these to work. (Bought two of them). Unfortunately ended up returning both and buying a different brand. I gave this two stars because I don't have any way of knowing if the drives themselves are bad. I just know they were unusable for us, for any of our machines.",
      "rating": 2.0,
      "verified": true,
      "author": "Twisterjester",
      "helpful_votes": 5,
      "publication_date": 20180620
    },
    {
      "title": "The MX500 has issues. Look at another drive.",
      "text": "This review is for the Crucial MX500 SSD, 2TB size (Model=CT2000MX500SSD1). I recommend AGAINST the purchase of this drive for two reasons: 1. Apparently the drive misuses SMART attribute 197 resulting in spurious CurrentPendingSector errors. This problem has existed for at least a year and been ignored by Crucial. 2. The drive ships with write caching disabled. In high load situations, drive performance suffers greatly with write cache disabled.",
      "rating": 1.0,
      "verified": true,
      "author": "Uncle Steve",
      "helpful_votes": 4,
      "publication_date": 20190805
    },
    {
      "title": "Sector Errors",
      "text": "I purchased on December 18th, 2018 and by January 10th, 2019 I started getting sector errors. This is being used as a caching drive on my unraid server. I would suggest sticking with name brands like Samsung. My five year old Samsung Pro SSD is still kicking strong.",
      "rating": 1.0,
      "verified": true,
      "author": "mackhax0r",
      "helpful_votes": 7,
      "publication_date": 20190123
    },
    {
      "title": "Don't make the mistake I did.  Not as good as 2012  original macbook pro SSD",
      "text": "Don't make the mistake I did. The MX500 was slower than the original mid/late 2012 MacBook pro's Apple SM256E SSD (pcie). pcie vs SATA -> pcie wins - I didn't realize that :(. Returned it. Novabench stats below:were about the same -> Disk score low 70's for both, write speed, 300MB/s for both, read speed 475 MB/s (vs 440 MB/s for Apple SSD). Power up -> Apple SSD - 6s vs MX500. - 45s",
      "rating": 3.0,
      "verified": true,
      "author": "ArmyAnts808",
      "helpful_votes": 5,
      "publication_date": 20181223
    },
    {
      "title": "Failed after 5 months",
      "text": "The drive worked very well for almost 5 months (installed on 12 June, 2020, died on 10 October, 2020). Then, I got multiple app crash errors, had to restart, and BIOS would no longer detect the drive. I removed the drive and tried to plug it as an external, with the USB-SATA cable. It's not detected and the drive makes a faint, but still audible (when you place your ear to it) beeping sound every second or so. I'm guessing that's not a good sign with respect to every bringing it back to health.",
      "rating": 1.0,
      "verified": true,
      "author": "Petrini",
      "helpful_votes": 2,
      "publication_date": 20201010
    },
    {
      "title": "Worth the price.",
      "text": "Hardest part was removing the 4th screw in my ASUS. Seems they put some thread tight or something. Otherwise simple installation. 1. You NEED the USB to SSD cable 2. Patience... 1 Tb takes time to copy. 3. Setting the password/encryption isn't straight forward as I would have hoped but simple once I found both admin and user passwords needed set to encrypt the drive. 4. Download the crucible utility... it really does speed things up. 5. Choose either caching or instant wipe... can't have both.",
      "rating": 5.0,
      "verified": true,
      "author": "amateur biker",
      "helpful_votes": 4,
      "publication_date": 20180715
    },
    {
      "title": "Received junk",
      "text": "I wish I could review this solid state drive but well I can't...I got the box for it but inside that box was an exposed hard disk from a HDD not even a whole drive just the internal part that holds the write head and disk. Was looking forward to it and made plans today around setting up a new sold state drive on my computer only to open a box of disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 5,
      "publication_date": 20181215
    },
    {
      "title": "Great SSD for a PS4. Slightly better load times.",
      "text": "Got it for my PS4 and have been using it for over a year now and no problems at all. Even though PS4 doesn't have the power to take full advantage of a SSD it does speed up load times. YouTube videos will show that as well. I replaced my 500GB ps4 hard drive with this and no complaints. Guess it's good I waited so long to review it so that I could give an accurate review.",
      "rating": 5.0,
      "verified": true,
      "author": "William C.",
      "helpful_votes": 2,
      "publication_date": 20200513
    },
    {
      "title": "Not happy went back to my old brand",
      "text": "What a nightmare to install it, this company relies on 3rd party software and when something goes wrong support does not know what to do. Spend 3 hours cloning my old drive. Each time I end up with same space as old drive. Never had so much problems with previous SSD brand Updated: Went back to the seller, 1 x blue screen and as mentioned mega problems cloning your info to new drive. Went with my previous brand (S.....) its a bigger company provides you an excellent in house software to clone, took instead 3 hours only 20 minutes with 2 button pushed ! Sometimes worth to spend the $10 extra and go with a more experienced company !",
      "rating": 2.0,
      "verified": true,
      "author": "LogoQRcode.com",
      "helpful_votes": 2,
      "publication_date": 20190130
    },
    {
      "title": "Purchased two, one of them had non-detectable errors from day 1.",
      "text": "Last year I purchased two Crucial MX500 500GB 3D NAND SATA 2.5 Inch Internal SSD - CT500MX500SSD1(Z)s. They were put into identical new lenovo t580 units. One of the laptops had frequent blue screens and corruptions, but the SSD passed all tests. I finally swapped the SSD 11 months later. No more problems. I had a bad drive, but neither windows nor Crucial software or support could find an issue with the HD. That left my associated with random issues for nearly a year. I don't think I will buy another cruical SSD (not because they occasionally have a faulty drive, but because a faulty drive cannot be easily detected). Disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Joel Grant",
      "helpful_votes": 2,
      "publication_date": 20190311
    },
    {
      "title": "Very snappy!",
      "text": "I installed this as a replacement drive for my older 'traditional' hard drive. I thought about upgrading my older desktop with a SSD as the boot drive and include the older hard drive as well but then decided to just use this for everything. My desktop had gotten to the point that boot up was literally taking 5 plus minutes and had me dreading that every time. I tried various things to improve that but nothing made much difference. Now with this SSD, I'm up and running in under 30 seconds! The difference is really unbelievable! Wish I had done this long ago!",
      "rating": 5.0,
      "verified": true,
      "author": "mikey41",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Died after 1 year 2 months and 15 days",
      "text": "Easy to install, rapid and fast, then locked up. Not sure if it was going to the Catalina OS system or poor quality but after reading other reviews I'm not surprised. I was using Pages and it started to freeze with the spinning colored top. It had been freezing and not responding to the mouse for a few days. Thought perhaps I had too much stuff on the desktop but perhaps not......trying a new SSD of another manufacturer......",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth Heitzenrater",
      "helpful_votes": 2,
      "publication_date": 20200211
    },
    {
      "title": "Great SSD for the $$!",
      "text": "This is a very fast SSD in read, write. Install was fast and easy. 3D NAND TLC, not MLC, but Crucial has tweaked things to improve speed and enhance durability, as shown by the 5 year warranty. Some manufacturers using TLC only offer 3 year warranty. 7.5mm to 9mm spacer for laptop installations. Acronis backup and other helpful software available at crucial.com. Stay away from Crucial DRAMless drive, the BX500. The BX500 has slow sequential write speeds and only a 3 year warranty for almost the same price as this MX500. Get the MX500! Faster speeds and 5 year warranty for just a few $$ more.",
      "rating": 5.0,
      "verified": true,
      "author": "srf",
      "helpful_votes": 2,
      "publication_date": 20190118
    },
    {
      "title": "... is in my 2012 Sony Vaio and it works great.. The other is no longer in a ...",
      "text": "I have two of these SSD's one is in my 2012 Sony Vaio and it works great. .The other is no longer in a 2012 HP Pavillion; it worked great for 4 weeks and then-the dreaded blue screen of death. Drive is dead, had to put the old slow HD back in that worked fine. In both cases the cloning of the Crucial SSD was not easy, it took several hours, calls to customer support and other freeware cloning programs to get the Crucials cloned. They installed easily but having 1 out of 2 fail in such a short time, is not acceptable. I will not be ordering from Crucail again",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Barone",
      "helpful_votes": 6,
      "publication_date": 20180420
    },
    {
      "title": "Just Keeps Going",
      "text": "I've been using Crucial drives on Macs for several years. I think this is my eighth install of Crucial SSD's. I've used them both internally and with external USB drive enclosures. The first of these installed over three years ago is still performing as it should and as it did on day one. No data loss or any other type failure. Drive information utilities show these drives transferring only very slightly slower than much more expensive drives. All of my Crucial drives have run very cool even in tight external enclosures. The consistency of performance, quality build, and good price point keep me coming back. For good everyday use high speed drive performance look toward these.",
      "rating": 5.0,
      "verified": true,
      "author": "Penfield",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Good value",
      "text": "This may not be top-tier perfomer when compared with an M.2 device, but it really works great to speed up an older laptop or desktop, and Crucial provides decent software support. If you want to enable overprovisioning, just be aware that it's much easier to do that before loading the OS onto the drive: just install the Crucial Executive software on your existing system, then hook up the bare unpartitioned drive, boot the system, and allocate the space using Crucial's utility. After that, you can use a tool like MiniTool Partition Wizard or Acronis to copy your system partitions over to the SSD and replace your old HDD.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Wheeler",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "VERY pleased I bought from an authorized reseller instead of directly from Crucial.",
      "text": "My 2012 MBP is WICKED FAST now!!! I previously maxed out the ram to 16gb; it has a quad 2.3ghz processor but with the stock 750gb, 5400 rpm hd, it was still slow. I bought the 1TB SSD drive and now it’s as fast as it should be. I’ll never order directly from Crucial again. They make a GREAT product, but the last time I ordered from Crucial directly, they mailed me an empty, never before sealed envelope. They refused to admit their mistake, which obviously originated at the warehouse (no paperwork, no product - just the empty envelope that still had he self sealing sticky covered (hence never having been sealed). From now on I’ll purchase from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "SurferChicUSA",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Bought for gaming",
      "text": "I got this mainly for my modded Fallout 4 game, since it’s notoriously known for its very long loading screens. It’s a huge difference from the hdd I was running it on and worth every penny. I’m running a desktop with an i5 skylake, gtx 1070 with 8gb of ram. The game runs much smoother and wait times are basically nonexistent compared to before. Absolutely recommend anyone that plays fallout 4 to upgrade to a dedicated ssd to run on. For wait time estimates I was getting about 40-60 seconds per loading screen on average before, and 5-15 seconds after the new installment. The installation was plug and play after a quick format w/ windows 10.",
      "rating": 5.0,
      "verified": true,
      "author": "Neeko",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Only brand (besides samsung) i would consider when looking at SSD using TLC nand.",
      "text": "Performance is better than any other name brand i had tested in the past 2 month, that were using (3D) TLC nand. Even that others had 2 caches (DDR3 AND SLC partition), most performed at half or a third of the speed i got on a 3y old ssd with only 60GB (same brand even). I needed a bigger drive for my games, and dont care about the reduced cycles vs MLC (which isnt an issue on consumer drives), but love that the MX500 series has build in power backup in case of \"unsafe shutdown\" etc (vs other brands).",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Fast, smooth sailing................",
      "text": "Got to love Crucial............. I have purchased Crucial memory in the past and always got a good product at a fair price. My original thought was to just purchase this SSD directly from Crucial. Being a Prime member I could get this drive for the same price as Crucial website plus I get free fast shipping using Amazon. Needless to say i purchased from Amazon. WOW, these SSD are super fast. My pc now boots up in no time at all and just seems to flow smoother now. Any future pc purchases will include a SSD from now on. Easy to install and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Herbert Forney",
      "helpful_votes": 3,
      "publication_date": 20180217
    },
    {
      "title": "Good value",
      "text": "I like the capacity, although I probably could have used something half the size. It was easy to install in my laptop ( HP running Windows 8). I didn’t need the supplied spacer, but I was glad it was part of the package. The cloning software worked quickly, less than an hour. I did have a problem with corrupted sound drivers, but it was easily fixed. Startup is noticeably quicker. Software like Word and Excel open much quicker. I was really impressed with the speed of Windows Updates. I’v never seen an update occur so quickly. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Died within a month.  This is the 2nd one to do so in Q3 2020",
      "text": "I'm and IT pro as my job. I have installed hundreds of SSDs in the past two years alone. Crucial SSD's have always been rock solid and the MX500 model has been my Go-to. But I have to switch horses now, because I have had two MX500's completely \"brick\" within the past month. Something is very wrong with the Quality Control at Crucial. If I were you, I wouldnt spend premium $ on a drive that has this quality track record.",
      "rating": 1.0,
      "verified": true,
      "author": "Kirk Tinsley",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Has DRAM, proven series",
      "text": "Still waiting for higher capacity SSDs to drop in price, but I bought this one because I needed to replace a smaller RAID 0. Less drives is less potential failure since RAID 1 also has no redundancy, and I was shooting for extra capacity anyways, so 2TB is fine. I haven't noticed any difference between this single drive and the 2 860 EVOs I had in RAID 0. I refused to waste money on a DRAM-less SSD - so I bought this. Great purchase so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "One Year Wonder",
      "text": "This drive worked great for little over a year then one day went to fire it up and it was totally wasted, completely nuked. There was nothing I could do to save it either. Warranty policy looks like more of a hassle than it's worth. Between paying for shipping and waiting, I might as well just buy a new drive and it won't be a crucial.",
      "rating": 1.0,
      "verified": true,
      "author": "Gordon",
      "helpful_votes": 4,
      "publication_date": 20191014
    },
    {
      "title": "2TB Drive for my Backup Needs",
      "text": "This is a 7mm thick drive. There's a 2 mm glue-on gasket included to adapt it to an older 9mm drive slot. It is not the fastest drive out there. Designed in the US and assembled in Mexico. It is adequate for my backup needs. It is connected through a 3Gb/s SATA port. I use windows 10 copy/paste for backup and am able to achive 240 MB/s which translates to around 2 Gb/s transfer speed. This drive must be initialized and formatted before use. In windows 10 go to Administrative Tools -> Computer Management -> Disk Management Initialize the drive and format. It will become visible to the OS. I will recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Jedi",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Instructions are so-so",
      "text": "Two important things: 1) You'll need a SATA to USB transfer cable. I recommend a SATA to USB-C to help with the speed. 2) The transfer software and instructions aren't very useful. Make sure you don't have any other USB storage attached, as it will confuse the application. I learned the hard way and had to buy a cable, then spent about an hour troubleshooting the transfer issue. Once I unplugged my external backup, the application was straightforward, and was able to clone my primary hard drive. The hardware instillation was easy as I was upgrading from a smaller capacity SSD, so it was literally swapping out the old drive with the new one",
      "rating": 4.0,
      "verified": true,
      "author": "kahones",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Improved Windows 10 boot time vastly.  No waiting for disk spinup to wake computer.",
      "text": "Great SSD. I cloned my laptops HDD using clonezilla. Once installed Windows did a quick boot repair and it booted. My laptop is much faster now and takes only a few seconds to boot up. I will buy another of these for my PS4. Update: Its Sept 2020 and I have not yet bought this for the PS4. I am however buying one for my wifes laptop. The drive is fantastic and reliable. I've had to take it out and put it in the laptop several times to address other issues. (Keyboard replacement and a cleaning) and its still perfect. A definete must buy if you need a 2.5 \" 1TB SSD",
      "rating": 5.0,
      "verified": true,
      "author": "JamesBlonde001",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Fast Fast Fast !!",
      "text": "After getting my HDD drive cloned (with AOMEI Backupper) to the SSD and the SSD installed, my laptop starts, loads and shuts off almost instantly. I can't believe how much faster this made my laptop [Dell 15(5579) 2-in-1 i7Gen8 16GB DDR4 RAM Win10 64bit]. Don't waste your time with Acronis (many issues with encrypted HDDs), use AOMEI Backupper freeware (worked the first time flawlessly). So far I really like this SSD, including the warranty. I will report back after I have had time to use it. the SSD weighs about 1/3 of what the HDD weighs, they are both 1TB units.",
      "rating": 5.0,
      "verified": true,
      "author": "JPM",
      "helpful_votes": 11,
      "publication_date": 20180131
    },
    {
      "title": "So far so good! Made my MacBook Pro way faster",
      "text": "I just got this a few days ago and installed it myself into my late 2011 macbook pro. Wow! I'm impressed. I bought this one because I'd seen a lot of negative recent reviews on the other popular SSDs that are usually recommended. The installation was actually pretty easy, and wasn't too hard to do it myself. I can't believe how quickly programs load now.. it's almost hard to believe! Before this I had thought that an upgrade of RAM would do this for me, so I upgraded my RAM, and was highly disappointed and couldn't really tell a difference in speed. But the Crucial SSD really has been a HUGE boost in speed.",
      "rating": 5.0,
      "verified": true,
      "author": "S J Stewart",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Great for older laptops",
      "text": "I put this 1TB SSD in an 8 year old gateway laptop. Replaced the 500gb HDD with this 1TB SSD. Wow! Speed difference is amazing. Old HDD would literally take minutes to boot up and load antivirus software. This 1tb SDD does the same process in less than 30 seconds. New life to my old system. I will get a few more years out of my 8 year old gateway laptop thanks to this great SSD!!! Laptop is basically an email/network system and the speed now is close to my thick network machine. I expected 4 to 5 times speed increase based on the SATA3 limit, but the speed difference is much more than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "gary",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Breathed new life into an OLD HP laptop",
      "text": "PROS: o Affordable solution to extend the useful life of an old HP laptop CONS: o None so far Bought this to hopefully make an old HP laptop usable for a bit longer. All of the reviews that I read said that this SSD was a good balance of price, performance, and reliability. I cloned the HDD in the laptop using this SSD and this cable (  ) that another reviewer recommended. I downloaded the Acronis TrueImage software and used it to do the cloning, everything went smoothly and I am pleased with the end result. Overall, a relatively affordable way to keep the old laptop viable for a while longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Walt",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Plug and play... Almost",
      "text": "Works great for my 2012 MacBook pro. I forgot the exact steps but after a little frustration it was in and running. I think you have to update your current iOS to the latest one and then it just does everything itself. I installed new ram first 16gb which made everything much faster in that regard. Scroll through my reviews if you want to find the ram I purchased. The combo made my old MacBook brand new again if not better. I'll get years of life out of my MacBook after about $300... Well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "MikaelDjur",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "First dud ssd",
      "text": "I have used Crucial MX500 in over a dozen applications for myself and family and friends over the years. I have them in three laptops, a desktop, and a PS4 currently in the house, and they are running flawlessly. I purchased one to install in my brother's Macbook Pro, and the system would not recognize it having any memory. Then tried it on a windows just to see if I could format it anyways. Same thing, nothing there. This is the first time I have purchased an SSD and it did not work. I knocked a star off for the fail, but kudos for Amazon for a quick resolution. Still love Crucial though!",
      "rating": 4.0,
      "verified": true,
      "author": "Lecso",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "SMOOTH! No more thermothrottling or humm.",
      "text": "After upgrading from a HDD drive to this SSD storage for my mid-2012 macbook pro and I have to say I can see and hear the difference. Start-up time is quicker and the performance speed is much faster. The SSD comes with a plastic housing that can be taped around it to keep it from shaking while inside your computer. Pretty straightforward to migrate my data into this SSD. Keep in mind of course you also need a special data port that this listing does not include! Otherwise, this is perfect for your upgrades without breaking the bank as a college student. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Danny ",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Still does not work",
      "text": "I bought the drive as it provided cloning software. The Crucial provided cloning software (from Acronis) failed to clone a system drive that would boot successfully. Crucial Support offered several suggestions and things to try, none were successful in providing a drive that would load Windows successfully. Acronis Support is terrible and takes days for a response which only asks for more information, pictures, and videos. Crucial Support's final suggestion was to try third party software some of which you have to purchase. Two out of the three suggested have also failed, crashing the system during startup.",
      "rating": 1.0,
      "verified": true,
      "author": "RRtracker",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "15% smaller than advertised",
      "text": "This Crucial SSD, advertised and sold as 1 TB, actually has only 850 TB of storage capacity. 15 per cent, 150 GB of data storage capacity, which is a huge amount of storage, is missing. This is common practice with ssd's; they're most always smaller in actual storage capacity than they're sold as, but 15% is a a very big shortfall. If it was a car, sold as having a V8 engine, but only had a V6, the transaction would be actionable. For some reason, SSD manufacturers are allowed to get away with it. Saying that \"they're all like that\" doesn't justify misleading advertisement of a storage device's actual capacity. Last Crucial disk I'll buy.",
      "rating": 2.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Works great, but...",
      "text": "...the installation videos on Crucial's site are a little misleading--the installation process isn't as trouble-free/easy as someone might be led to believe: We followed the instructions in their installation videos (for our Dell XPS 8500 desktop machine) to the letter _but_ when we booted the computer, it didn't make it out of POST--we got the black screen of death (BSOD) saying that a drive couldn't be found and to use a Windows installation disk to troubleshoot the problem...which we didn't have. What _did_ fix the problem was going into the BIOS and changing the Boot Drive assignment (Drive 1) to the newly-installed SSD--after that, it came right up.",
      "rating": 5.0,
      "verified": true,
      "author": "A 21st Century Man",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Good storage device.",
      "text": "Does what it is designed to do - store data. For me, the SSD is connected to my USB dock with a short cable - no housing / case required. I can clone my current hard drive and then replace it with the newer SSD. Not too difficult. The SSD was to be delivered by USPS but when the envelope arrived, someone had torn a hole in the envelope end and removed the SSD, then they used packing tape to tape it back together. Contacted Amazon about the theft and received the replacement a couple days later. Then I received an email asking / reminding me to return the damaged SSD. Haha!",
      "rating": 5.0,
      "verified": true,
      "author": "doctor don",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Failed cloning",
      "text": "Their software is not easy to use (compared to Samsung's), it took some thinking. Cloning kept on failing. I tried some manual settings and couldn't get it to work. It wasn't obvious if i was excluding or including directories when i was checking them. Maybe it had something with it trying to copy the recovery partition. Gave up. Returned it and got a Samsung 860 Evo for $12 more. Their software worked on first try.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20190108
    },
    {
      "title": "Excellent!",
      "text": "I bought my PC mid 2016. About a month and half ago my D drive started to do on me. I decided to upgrade my C & D drives to SSD's. I had never swapped out a C drive before. Thanks to some easy to fallow and very brief videos by Crucial I was able to first, copy my old C drive to the new SSD drive. Then, quickly installed the new SSD. I expected all kinds of issues because, it's just never easy. Something unexpected always goes wrong. But, that didn't happen. It all went smoothly. My PC is SO MUCH FASTER NOW! It had really been slowing down and now it feel brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "AbulletAway",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Crucial SSD 1TB HD quality as always",
      "text": "I have been choosing the Crucial brand for memory and SSD for years, and this one does not dissappoint. Cloning was simple and easy for me to transfer from my OE HDD with my HP 15.6 Notebook 15-ck0xx which originally comes with a 5400rpm sata HDD. Bootup is quicker and applications run much faster. Too be expected with SSD drives. I trust this brand for their warranty and reliability. I am an IT professional by trade and I recommend this brand for beginners to experts. I have not even tried to upgrade the firmware or tweak the SSD. Just running straight out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean T.",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Not sure I could but I did.",
      "text": "My 4 year old HP laptop computer had gotten slow and was not performing well. I had heard that a digital hard drive was faster than the standard hard drive so I decided to see if I could replace the hard drive in my laptop. I researched on line to see if there was a replacement hard drive and once I located one I found an online video on how to take my laptop apart and replace the hard drive. I did it and the final outcome has been outstanding. My 4 year old computer works better now than it did when new. To be honest I surprised myself that a computer dummy like me could do this task.",
      "rating": 5.0,
      "verified": true,
      "author": "LSHuck",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Rock Solid",
      "text": "Was having problems with my Samsung SSD. I like Samsung and they have an incredible overall ratings but my drive was acting up with Windows 8 installed. I have a Crucial 120 gig in my internet machine so I spring for a 500 Gig drive for my work machine. So far, so good. Easy installation and transition software. Up and running in no time. I like Crucial, I have used their memory in my computers as well. Quality brand that makes quality products. 5 Stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Red Rogers",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Fast SSD but wears out quickly",
      "text": "I bought this SSD because the MX500 is the cheapest SSD that includes power fail protection. Ordinarily you have to use datacenter rated drives to get this feature. I'm using these as a cache drive for my file server, so they get written to a fair amount. They don't publish endurance ratings but a few reviews indicated that they should be good enough for a low-use server. My experience has been different - in this use my drives show ~8% wear after just 300 hours of use. Your mileage may vary but based on this I'd expect to replace these drives every year in most desktop applications. I expected better from a drive that has a good reputation.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Good, inexpensive SSD",
      "text": "Seems to be as nice as the older enterprise grade drive crucial ssd that cane with my computer. Way faster than the old HDD that I was using for supplemental storage. No complaints, and much faster access to files. Hopefully the longevity is what they claim. My next machine will be running off of PCIE/NVMe drives, but this is a good and inexpensive way to keep an older machine competitive for a few more years. As I need more storage, I’ll slowly be replacing all of my mechanical drives with these silent and speedy solid state drives.",
      "rating": 5.0,
      "verified": true,
      "author": "toolroomtech",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Great buy!",
      "text": "I am actually happy that the WD Blue were out of stock / over priced when I bought this. The included drive duplication software (download) worked perfectly to move a Windows 10 install to this new SSD. Now the PC boots very quickly, and overall performance has improved for anything that needs to access storage. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob the palindrome.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "It Works",
      "text": "Well, right after it arrived (3 days early) went and immediately started the cloning process using Macrium Reflect. My VERY old laptop, circa 2006 was just about to die on me so knew something had to be done before that happened. As an example of how slow it WAS, took 2 hours and 1 minute to transfer 77gb of data. But it was well worth the wait! First bootup, could tell it acted like a brand new laptop! Sure was a cheap way to fix a serious problem and BTW, I'm 83 years old, so that proves how easy it is to do!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick J. Gibney",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Needed more memory. And this works fine",
      "text": "I've already bought SSD drives from Crucial so I know they work great. The last one I bought was 1TB, well I ran out of space, and had to upgrade to 2TB. I did research and saw a few lower-priced options. However, after reading reviews and learning from experience, I wanted to go with something I trusted. These work flawlessly. They are the best SSD I've ever bought. I would buy more without a doubt or concern. Pros Great Memory reasonably priced long-lasting plug n' play fast speed cons none",
      "rating": 5.0,
      "verified": true,
      "author": "Beni kim",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Oh my God... !!!  my Laptop came back to life...!!!",
      "text": "Oh my God... !!! my Laptop came back to life...!!! this small change has made a huge difference in my 8 year old laptop's performance. It took me two hours to mirror my old hard drive, but it was DEFINITELY worth it... if your laptop is more than 7 years old, you must do this... you owe it to yourself. Definitely this has been the best and most useful $63 dollars that I have spent in a long long time. It is like having a new laptop again..... HIGHLY RECOMMENDED... THIS DEVICE REALLY WORKS WELL...!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Raf",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Fastest hard drive you can buy for your desktop.",
      "text": "I just love this SSD. I bought the 2TB and I used a cloner to transfer the data from my old standard slow hard drive and it took over 6 hours to do this and it was worth the wait. When it was done I plugged in the SSD into the same cables and booted up my desktop and wow super fast boot up and super fast everything. It takes less than 10 seconds from power on to my desktop and everything is ready. I will never go back to the old style hard drives again SSD is my new choice for a hard drive and if you buy yourself one you will see what I’m talking about.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob ",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Simple and Effective",
      "text": "I used this SSD for some time and have since sold that setup to my neighbor. He is still rocking it and it has never had issues. It's fast and SSDs are the biggest push for speed for computers that I can remember since the 90s. If you are still using a mechanical HDD, immediately get an SSD or an NVMe (if your mobo supports it) and dump those mechanical drives. I've never had an SSD fail and have been using them for years. Crucial makes great products at a reasonable price so don't hesitate to pick this up!",
      "rating": 5.0,
      "verified": true,
      "author": "Choose901",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "The Provided Software is Garbage",
      "text": "Crucial provides software on their website to clone your drives onto the new one that you've purchased, unfortunately it's garbage and leaves you with driver errors that result in no audio etc. What's even more worse is that for some reason reinstalling the drivers won't fix the freaking problem. Better off just installing fresh than trying to use your old setup. Thanks for wasting hours of my time waiting for the cloning to finish and trying to see why my drivers weren't working even when I reinstall them.",
      "rating": 3.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "WELL PRICED EXCELLENT SSD",
      "text": "I bought this because every store in the area was sold out of the Sandisk that was on sale. Out of desperation, I ordered this one and I could not be happier. I believe it is every bit as good as the more expensive Samsung and Sandisk. If replacing a hard drive, I recommend getting a copy of Windows 10 on a flash drive and installing a fresh copy. Personally, I have had nothing but trouble with backup programs. When I needed them they have not performed so I have given up on them. I expect any purchaser to be as ecstatic as I was when I got my computer working with this Crucial SSD.",
      "rating": 5.0,
      "verified": true,
      "author": "Mason B. Yeaton",
      "helpful_votes": 2,
      "publication_date": 20180320
    },
    {
      "title": "Crucial",
      "text": "I opted for this Crucial SSD Sata internal drive because it was made by Crucial. I placed it in as a second drive in a new computer build. I can assure you I will be purchasing a larger capacity SSD Sata drive from them in the near future to add to this build. Wanted to see if I could add this as a second drive and make it do what I wanted. So I opted for the smaller less expensive drive to test it. It excels my expectations and I will be installing a third larger SSD Sata soon. IT WILL BE CRUCIAL",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Ray",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Super easy install",
      "text": "I bought this and have never installed a laptop hard drive. In fact, i have never taken my laptop apart to replace ANYTHING: Its a Toshiba and I love it. CRUCIALs website was super helpful and made the swap-out of my old HD very simple. So easy , a computer-alliterate could follow the directions and do this. I also bought a case for my old hard drive, so it is usable as an external portable hard drive. I am very please with this product. My machine is running so much faster, cooler, and quieter. I highly recommend it. I don't game so that is the ONLY reason i gave a lower star rating for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan J. Linning",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Easy Speed Increase for Older Computer",
      "text": "I built my current WoW rig about 8 years ago, and it has been in need of some small upgrades to run smoother. Installed this SSD, used the included cloning software, and in about 3 hours it was ready to roll. Computer boots and fully loads in about 50 seconds, compared to 4-5 minutes with my old HDD (no more \"warm up time\"). WoW runs pretty much the same, but load times are significantly reduced. For the price, best upgrade you can do for an older computer to bring it up to speed. I went with Crucial over Samsung, because I've heard Samsung doesn't play nice with AMD chipsets.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Faster Boot time",
      "text": "Installed the drive to replace a bad SATA HDD in my DELL Inspiron 3541. Easy to install and was immediately picked up by the laptop and was able to install a clean version of Windows 10. The boot time was dramatically faster than the old SATA drive. I was able to update my laptop and save on the cost of getting my wife a new laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie N.",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Excellent drive",
      "text": "The drive installation was flawless and quick. The drive performs pretty well, just feels like it heats up sometimes. I gave it 4 stars as after a month of use it froze up and there were bad sectors. The Chkdisk killed a few files including a PST file and that was a royal pain. Just surprised that a brand new drive had errors on it. Hopefully they will improve the quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick Major",
      "helpful_votes": 2,
      "publication_date": 20190221
    },
    {
      "title": "From minutes to seconds in booting",
      "text": "My first purchase of this device got lost during shipping, but Amazon shipped a new one. Installation was fairly straight forward, although one crucial step is missing from the installation instructions. When you hook up the drive (to clone the original one to this one), Windows may ask to initialize/mount the drive. DO THAT!. I didn't and they system didn't recognize the drive anymore, even after reboots. I hooked it up to another computer, did initialize it and hooked it back up and I was able to continue the cloning operation. After that, everything went seamless; didn't even need to go into the BIOS to rescan drives (Dell laptop).",
      "rating": 5.0,
      "verified": true,
      "author": "Dallas",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Good Starter Drive... Hard to Switch/upgrade to [cloning issues]",
      "text": "Right now I will say this drive is giving me allot of grief. The software they use is Acronis and it seems okay, but seems to have trouble cloning my samsung 250 gig. Pro. It is good value for money. Always buy as big of SSD as you can to prevent this from happening to you. I am sure this is a good drive to start with. Just giving me a pain trying to clone my drive currently. Also they have a good warrant to and specs are on point. Good drive.. hard to switch drives.",
      "rating": 2.0,
      "verified": true,
      "author": "SamPen",
      "helpful_votes": 2,
      "publication_date": 20180930
    },
    {
      "title": "2TB of SSD storage is life-changing",
      "text": "Thanks to this drive, I was able to merge my 100+ backup DVDs and blu rays into one big archive. I couldn't have done that without this kind of space - and speed - available. Removing duplicates and arranging folders went so fast! I found old useful files and made my house less cluttered at the same time. After offloading data I don't care that much about, I have *tons* of free space. For SSDs that means long life. $200-ish for this drive is an incredible bargain. Buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C. Haensel",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Crucial 1 TB MX500 SSD",
      "text": "If I could personally say thank you to Crucial for this SSD 1 TB MX500. I have an ASUS that is 5 years old. It was slow and I thought ready for burial. I installed Crucial RAM and the SSD MX500. My computer now operates fast. I fell back in love with the old work horse. The laptop is quick to turn on and open programs. The clone software provided by Crucial was easy to use and worked perfectly. Crucial additional installation instructions and videos on their website gave me the confidence to do the installation myself. I highly recommended this product and the memory RAM aswell.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Awesome laptop upgrade",
      "text": "MAKE SURE YOU SIZE YOUR SSD THE SAME SIZE OR LARGER THAN YOUR HDD THAT YOUR REPLACING. ACRONIS SOFTWARE WAS ABLE TO CLONE THE HDD ONTO THE SSD WITHOUT PROBLEMS. LAPTOP IS 5 TIMES FASTER NOW. BE SURE TO INCREASE RAM ALSO. I USED DDR4 SO DIMM. BE SURE TO TURN OFF AUTOMATIC DISK DEFRAG BEFORE CLONING AND AFTER SSD IS BOOTED IN SYSTEM. TURN ON OVER PROVISIONING AND TURN ON MOMENTUM CASHE. THIS INCREASES RELIABILITY AND LIFE OF SSD. LEAVE COMPUTER ON OVERNITE TO SETTLE NAND LEVEL WELL. AWESOME",
      "rating": 5.0,
      "verified": true,
      "author": "Miss",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Failed in 20 months. Of normal desk top, not home server, use",
      "text": "That's all she wrote. 20 months and I lost my complete set up - had to start from scratch with a USB made with Windows Media Creation Tool to get back up and running. Just a normal desktop for browsing. Unacceptable. From here on out its Samsung or if I can't afford Samsung, then Western Digital. It's a great price and capacity and performance, but all that falls by the wayside when you have a complete failure. Yes, I was aware of the 2004 Windows bug and Disk Optimization was turned OFF.",
      "rating": 1.0,
      "verified": true,
      "author": "MWebb",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Easy to install in an older PC, but very thin.",
      "text": "I had a spare sata cable and a spare power cable for ssd drives. I was running out of room on a 500gb crucial ssd I had a tech install in my HP Pavilion (running Windows Vista now Windows 10). I opened my case and saw I would have to unplug a lot of components to get it slotted in next to the other hard drive. So I used double sided 3M tape and stuck it to the hard drive bracket after plugging in sata and power. Detected on boot. Created MBR partition and simple volume and assigned new drive letter. Quick format NTFS and it's active. Just under 1TB available.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard and Shikha",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Probably the easiest and most productive installation of hardware ever",
      "text": "The tech support is awesome. going to their web sight is like a dream com true, they answer every question you have and have the software package available to clone your existing drive onto this one. The installation was a snap. I am using this as my bootable operating system back up and I already see the difference in the time it takes my Dell to boot up. If you have a desk top then invest the extra cash in the Newer Tech AdaptaDrive mount. Tos ay that this drive is beyond expatations says very little. If you are on the fence about Crucial, don't be.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Brooks",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Works like a charm! Just follow Crucial's directions.",
      "text": "I had read several reviews before this date indicating the instructions resulted in less-than-satisfying results and that I would need a bootable USB drive and/or take several other steps. I talked with someone at the Microsoft Store who said it was just a clone-and-swap task. I watched the instructional videos on Crucial's website and followed them. The Acronis software downloaded flawlessly and I was able to clone and swap with only one minor difficulty - laptop's cover for the drive didn't fit completely back into place. Since I don't put my laptop underwater, not an issue.:)",
      "rating": 4.0,
      "verified": true,
      "author": "daMar",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Excellent performance, poor reliability",
      "text": "I bought two of these. I installed one in my laptop, and the other in my daughter's laptop. The performance is very good - much better than the OEM SSD that was previously in my Dell XPS. After a month, though, the SSD in my daughter's laptop failed. Amazon refunded my purchase price, but it was seriously inconvenient (and expensive), as my daughter is 400 miles away at college, so I had to pay a local shop to install a new SSD and re-install the OS for her. I hope that the second MX500 is more durable, but I don't feel all that confident about it.",
      "rating": 2.0,
      "verified": true,
      "author": "642",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "SLOW SPEEDS.  NO SUPPORT.  AVOID",
      "text": "Cloned a failing SSD easily enough, by the PC is now much slower than it was with the original drive. Asked Crucial for help - never got a reply. Would not recommend product or the company.",
      "rating": 1.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 3,
      "publication_date": 20190617
    },
    {
      "title": "Great for Destiny 2!",
      "text": "Just got this 3 days ago. Very satisfied with purchase so far! Using this on an xbox one as an external SSD. Moved Destiny 2 over to it and it feels like a new game. No more interminable flights; most planets load in under a minute. Getting time back from waiting / loading and snappy inventory screens means Destiny sessions are far more productive. A definite must-get. Since this SSD is half a terabyte, I would recommend using the regular HDD for most games, and moving over just the games you play very frequently or have noticably frustrating load times.",
      "rating": 5.0,
      "verified": true,
      "author": "The Fam-azon Fan",
      "helpful_votes": 2,
      "publication_date": 20190620
    },
    {
      "title": "Thumbs Up!",
      "text": "I've purchased a several MX500s, and I've always been happy with them. They're reasonably priced drives with great performance and a good warranty (that I haven't yet needed). The fact that it's made by an industry leader in memory (Micron/ Crucial) doesn't hurt either. The Acronis True Image software available for download is also nice. Made it real easy to transfer data from old hard drives and quickly get up and running.",
      "rating": 5.0,
      "verified": true,
      "author": "iPatch",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Durable, easy, quick cloning",
      "text": "I've installed these in 4 of my computers now to upgrade from a HDDs. The difference is night and day... SSDs are the best upgrade available. My Windows 10 PCs go from 30-60 second start-up to 5-10 seconds. Programs open much faster, and background processes such as backups don't take forever or bog down the disk usage. After a few years on the first two I installed, I've not had any issues with failures or blue-screens. The cloning software is sent as a download with the disk, and copies your OS and folders exactly like your HDD, so it's a direct replacement without having to reinstall anything. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "T Lo",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "High performance SSD for the right price",
      "text": "It may not be the SSD with the highest benchmark scores; however, it's right about maxing out practical SATA3 data bandwidth. Quite frankly, it's going to be pointless to attach any SSD faster than this unit on existing SATA to expect perceivable improvement in any application/game performances. Look for m.2, if you need better performance. Momentum Cache software that essentially allow you to have RamDisk cache for the drive is also a plus for users who actually require good write performances.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "You don't have to be an expert to install it",
      "text": "I suppose the product quality is good, though I don't have much to compare it to. It's exactly what I needed to improve my computer's storage. Here's what matters: installation turned out to be well within the scope of my abilities, thanks to EXCELLENT support and guidance from the manufacturer. These guys should give other companies lessons in how to document procedures and help purchasers. Text, video, different additional support options -- first rate. Even better, while giving very minute step-by-step instructions, they never talked down to newbies or acted all high-tech. Instead, very accessible. I figure any company that puts out that kind of effort must believe in their products.",
      "rating": 5.0,
      "verified": true,
      "author": "Avery St. Clair",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Doesn't work",
      "text": "Bought this some time back and just got around to trying to install it in my 2012 Macbook Pro. The drive is not recognized by MAC OS or Windows OS. Nothing found. Tried two different USB drive attachments. Nothing. Don't make the same mistake I did and assume you have a working product just because Amazon says it's \"new\". Test it right away and ensure you can return it if it doesn't work. I waited too long to test the drive and now cannot return it. What a ripoff from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Folkvangr",
      "helpful_votes": 2,
      "publication_date": 20191027
    },
    {
      "title": "CRUCIAL SUPPORT ITS A DISASTER",
      "text": "I have waiting my RMA to change 2 SSD Crucial MX500 about 2 mouths but this people try make me forget and leave it at that, this SSD degrade to fast, i dont recommend, meaby the price look good but the quality its BADDDDD and technical support TOOOOOOOO, DONT BUY THIS SSD, Samsung EVO meaby have a little hi more price but the difference its the heart to the sky",
      "rating": 1.0,
      "verified": true,
      "author": "ALEJANDRO A. MELIAN G:",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Crucial SSD works as well as any comparable SSD",
      "text": "Installed this Crucial SSD in an HP laptop to replace the original HDD. Crucial makes cloning the internal HDD to the SSD easy by including a limited version of Acronis True Image as a download. However, it requires a USB to SATA adapter (not included but necessary if you want to transfer the system). Also, the SSD must store at least as much data as the disk you are cloning. Hardest part is removing the laptop's bottom cover to access the internal HDD. System now boots much faster, pages virtual memory much faster, and data storage should be much more secure.",
      "rating": 5.0,
      "verified": true,
      "author": "TennisBum",
      "helpful_votes": 0,
      "publication_date": 20191109
    }
  ],
  "product_meta": {
    "title": "Crucial MX500 250GB 3D NAND SATA 2.5 Inch Internal SSD, up to 560MB/s - CT250MX500SSD1",
    "description": "Capacity:250GB| Style:SSD| Product Packaging:Frustration-Free PackagingStart your system in seconds, store up to 2TB of data, and upgrade with an SSD you can count on. Join more and more people who are keeping their family videos, travel photos, music, and important documents on an SSD, and get the near-instant performance and lasting reliability that comes with solid state storage. Upgrade with the Crucial MX500 SSD, a drive built on quality, speed, and security that’s all backed by helpful service and support. Even if you’ve never installed an SSD, don’t fear – our step-by-step guide walks you through the process to make installation easy. It’s worth it. Using a SATA-to-USB cable, attach one side to the SSD and the other end to your computer.",
    "rating": 4.7,
    "feature_bullets": [
      "Sequential reads/writes up to 560/510 MB/s and random reads/writes up to 95k/90k on all file types",
      "Accelerated by micron 3D NAND technology",
      "Integrated power loss Immunity preserves all your saved work if the power unexpectedly gets cut",
      "AES 256 bit hardware based encryption keeps data safe and secure from hackers and thieves",
      "Crucial 5 year limited warranty"
    ],
    "specifications": {
      "Brand": "Crucial",
      "Series": "MX500 3D NAND SATA 2.5 Inch Internal SSD",
      "Item model number": "CT250MX500SSD1",
      "Hardware Platform": "PC; Mac",
      "Item Weight": "0.352 ounces",
      "Product Dimensions": "4.06 x 0.28 x 2.76 inches",
      "Item Dimensions  LxWxH": "4.06 x 0.28 x 2.76 inches",
      "Color": "Blue/Grey",
      "Flash Memory Size": "250 GB",
      "Optical Drive Type": "None",
      "Voltage": "12 Volts",
      "Department": "Unisex-adult",
      "Manufacturer": "CRUCIAL TECHNOLOGY",
      "ASIN": "B0781VSXBP",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 4, 2018",
      "Customer Reviews": "4.7 out of 5 stars32,114 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#89 in Internal Solid State Drives"
    },
    "categories": [
      "Data Storage",
      "Computers & Accessories",
      "Electronics",
      "Internal Solid State Drives"
    ],
    "price": 47.56
  }
}