{
  "website_summaries": [
    {
      "verdict": "Customers love the quality of the components in this set, all at a reasonable price.",
      "pros": [
        "Second generation of this kit, as manufacturer has taken feedback from medical students for improvements",
        "Realistic feel in the suture pad, mimicking human skin",
        "Everything ships in a storage case with a zipper for security"
      ],
      "cons": [
        "Durability of the practice suture pad is questionable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great experience! Better than bananas!",
      "text": "I was quite nervous performing real life suturing for the first time, and my attending physician suggested I get more practice. I have tried suturing on bananas, pillow case, chicken breast... not the best experience. I wish I knew these practice kits exist before! The kit came with full set of essential tools and nylon threads. I was able to practice all the primary knots over and over again to get a steady hand and become much more competent. The attending physician complemented me on how well I know my knots now and that my hand movement has become much more confident and techniques much more professional. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 55,
      "publication_date": 20180525
    },
    {
      "title": "Great quality kit!",
      "text": "Great quality kit! The silicone pad is more durable and much better quality than another product I bought online. The fabric mesh built into pad makes a big difference in the experience, sutures don't rip the skin if you go deep enough. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 56,
      "publication_date": 20180519
    },
    {
      "title": "Awesome kit!",
      "text": "This is awesome! I am a FNP student attending online classes. In my clinical setting we have encountered patients needing sutures but I never had any experience or practice with this task. Anyways, to help me learn I purchased this kit and my preceptor sat down with me and taught me a simple suture. She was impressed by the quality of the kit and the fact that real tools were provided. I’d highly recommend for anyone looking to enhance their suturing skills.",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 42,
      "publication_date": 20180707
    },
    {
      "title": "Terrible material. Just use pigs feet!",
      "text": "Terrible quality. Suture rips right through the material. When you apply less force to prevent rips, the edges don’t approximate. Overall, bad product to practice suturing with. You’re better off using pigs feet or bananas.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominique Durante",
      "helpful_votes": 12,
      "publication_date": 20180628
    },
    {
      "title": "Sutures, Instruments, and Life-Like Skin Pad!",
      "text": "I’m a student in a Surgical First Assistant program, and I bought this kit for the lab classes. I searched Amazon high and low for suture kits, and this is the one I bought. This kit is an excellent value! By far, I felt that I got the most sutures, nice instruments, and a life-like gel suture pad from this kit. I love the variety of cuts and slits in the gel pad, which should cover all the types of wounds I’ll encounter. It even features the different layers of skin. Great product, and I would recommend it to any surgical student.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 3,
      "publication_date": 20180709
    },
    {
      "title": "Great product for superficial suturing",
      "text": "As a dermatologist treating skin cancer patients wanted to find a practice kit for training residents/fellows. For practicing interrupted suture, running suture, matress (Donati) and other types of \"epidermal\" surface are excellent! The nylon sutures run a bit more \"stuck\" than in real skin. Silk runs well. For practicing deep dermal suture I think needs improvement since the \"dermal\" component is very stiff and no undermining is possible; hence, is hard to approximate the \"dermis\". Bottom line: I would totally use this to train first-year dermatology residents on skin suturing but it's not realistic for deep sutures.",
      "rating": 4.0,
      "verified": true,
      "author": "Cristián Navarrete Dechent",
      "helpful_votes": 2,
      "publication_date": 20190822
    },
    {
      "title": "Suture pad rips and tears :(",
      "text": "I was really excited about the “mesh layer” in the suture pad for hopeful increased durability. I’ve done about three different sutures that have all torn. Also, I’m left handed so I can’t use some of the provided tools (which I already knew when buying but was hoping the suture pad would outweigh the cons of this).",
      "rating": 1.0,
      "verified": true,
      "author": "Ally Keathley",
      "helpful_votes": 6,
      "publication_date": 20180628
    },
    {
      "title": "I just got this today and I am very disappointed in it",
      "text": "I just got this today and I am very disappointed in it. It seems very cheap. The synthetic skin I got ripped when I tried to tighten a suture. The suture itself is very cheap and and has torn multiple times when I've been using it. I used some of my own monofilament sutures, and they worked fine. It was just the cheap suture material that they supply. Totally not worth it. The tools themselves also feel very cheap. Try to find a different set cause this one is a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 5,
      "publication_date": 20180726
    },
    {
      "title": "Better off winging it in the OR, this will only reinforce bad technique!",
      "text": "I honestly can’t think of a single good thing about this suture kit—it is absolutely awful. The material is impossible to suture without ripping, and what’s more the forceps rip right through the pad before you can even think about placing the needle. Forget practicing subcuticular stitches or buried knots, this piece of garbage can barely handle a simple stitch. I have a hard time believing that anyone who gave this 5 stars has actually sewn human skin in the surgical setting before. This is awful. Will be returning ASAP",
      "rating": 1.0,
      "verified": true,
      "author": "Cust1Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20181130
    },
    {
      "title": "Realistic feel, great for practice, great price",
      "text": "I most enjoyed the included pre-threaded sutures as well as the tool kit that has everything you could ever want for practicing. This product would be most useful for people who already have some experience, but beginners may also use this kit after watching a few YouTube tutorials. The only addition I would like to see is possibly an instruction kit for those people who are beginners and an advanced knot tying instruction set for people who want to learn more techniques. Overall I think anyone interested in a field where suturing is a daily task should try out this product, the pricing is excellent for everything that comes with the kit!",
      "rating": 5.0,
      "verified": true,
      "author": "Branden E.",
      "helpful_votes": 2,
      "publication_date": 20180830
    },
    {
      "title": "Not Good",
      "text": "The suture practice kit has a ton of great reviews, which is why I bought it. I am trying to practice surgical sutures and the material keeps ripping. This is not worth $45 for something that is not even going to hold up the the things it is supposed to be used for.",
      "rating": 1.0,
      "verified": true,
      "author": "Neeri",
      "helpful_votes": 5,
      "publication_date": 20180716
    },
    {
      "title": "Great product for suture practice.",
      "text": "My wife's eyes lit up when she opened this for Xmas. Out of all her gifts, this was by far her favorite. Very well made and is the perfect way to practice. I even stitched one up, and had fun doing it. Seller sent it quick, even left follow up messages to make sure I was happy. Couldn't be happier with the product, or the seller. If you have any Nurses or medical professionals in your family, or working their way there, buy this for them. It is absolutely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "The Kit is Excellent",
      "text": "I am very delighted to obtain this practice suture kit after trying to learn the process on meat and other items. The large suture pad is especially invaluable in learning to handle properly the different kinds of wounds, something I find difficult to do in natural items. The pad made it convenient to master the various knots and the ability to create variations of wounds. It really maximized my practice time until I feel really confident about my hand coordination. It is worth noting that the entire set is very well organized. I definitely recommend this suture kit to all medical students.",
      "rating": 5.0,
      "verified": true,
      "author": "Jana ",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Great materials, not great practice",
      "text": "I got this to practice my suturing so I can keep up practicing for my sub-Is after my surgical rotation and this was pretty disappointing. The sutures and needle driver are fine, its the silicon pad. It rips way too easily and doesn't resemble skin very well- I tried doing subcutaneous stitches and it ripped straight through after I thew the third stitch. The silicon also doesn't approximate like normal skin would. Overall I am super unimpressed and I'll prob have to buy chicken cutlets for practice.",
      "rating": 1.0,
      "verified": true,
      "author": "Annalisa Lopez",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great for learning & practice!",
      "text": "My 13yo son ordered this with his birthday money. He wants to be a surgeon. He has spent countless hours practicing sutures. He is also a Boy Scout and this helps him with other things too. He says there are gaps in between the needle driver and the clamp but since it’s not on an actual person it’s ok. Also he said the mat tears easily if you pull your suture too tight but you just move on to the next space. Overall it was definitely worth the cost. He really enjoys it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer B Terrell",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "A decent product, but it has some flaws",
      "text": "My biggest issue with this kit is that the material is too rigid, making it impossible to practice certain patterns on. It is impossible to practice a subcuticular pattern on without the pad ripping and tearing because it is just too rigid. It is also very difficult to practice inverting patterns on. I liked that it came with suture and instruments, and it worked well for more basic patterns. I am a veterinary student so maybe it is better suited and more realistic for medical students.",
      "rating": 3.0,
      "verified": true,
      "author": "Kaylyn Hruska",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Most impressive kit so far 😊",
      "text": "I was so impressed when I received this Suturing Practice kit. Most kits only come with some nylon threads. But this kit has 5 scalpel blades, and 7 pack of threads. This one includes a case also unlike others that only has it in box! I couldn't believe how much they fit in this package. Suture pad is very good; it’s not easy to rip off. One other thing the company might think about is add some more thread, scalpel, and needle. I was so impressed that I tell everyone about this kit. So worth the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jevgenija",
      "helpful_votes": 2,
      "publication_date": 20180714
    },
    {
      "title": "Awesome!",
      "text": "If your thinking about getting one this set is great. the tools are fantastic quality, better than what my school had. the options of sutures are helpful and the skin holds up great. I got a friendly email after purchase making sure I was happy with the product which was a nice touch. I got this before the official suture practice day and was way ahead of the class. they all came up and asked where I got it. For the minor investment in an invaluable skill definitely pick it up!.",
      "rating": 5.0,
      "verified": true,
      "author": "jared",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Great Gift for Beginning Medical Students!",
      "text": "I gave this as going-away gift to my son who’s entering a Physician Assistant program — he was really happy to get it! He has observed lots of suturing in his present work, but hasn’t had the opportunity to do himself yet. While he will certainly receive training in his future, he will have a leg-up with the practice he gets before then with this kit. He very much liked the fact that this was completely authentic — real suturing materials, all except the real patient. But the practice skin and various skin wounds replicated were about as close as one could get without a live volunteer. And who wants to do that?!",
      "rating": 5.0,
      "verified": true,
      "author": "Marmot",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Perfect for what it’s for",
      "text": "I love that it is ideal for learning and practice. I was able to set up my kit and google videos. This allowed me to follow along. The practice skin is very durable as well. I already sutured several of the example lacerations, cut the sutures and cut the sutures. I was able to practice in the same area. The kit itself came quickly , is small and portable and fits description well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "Some parts are good",
      "text": "The skin wasn't realistic, but the tools are a good set to learn on. I would recommend buying it for the tools and sutures to use on chicken or pig products. Personally I used pig skin for learning. The set doesn't come with enough sutures to master the suturing, so expect to have to buy more separately. Overall decent product. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "TWoods",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "nurse practitioner student",
      "text": "I’m a nurse practitioner student and I used this kit along with videos I watched online to practice my technique. I was able to practice over and over on this kit without a problem. For some of my practice I would put on black dots with a marker to make suturing easier, then erase them with hand sanitizer. This is definitely much better than practicing on chicken and well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Stafford",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "Great entry level kit for suturing practice",
      "text": "As a PA First Assist of 10+ yrs, I'd say this is a great entry-level kit for anyone wanting to practice a variety of suturing techniques. IMO the accompanying pad works BEST for percutaneous suturing, I found it to be a little friable for intradermal-type closures. For the cost however, this kit has everything you need and is fantastic for getting started with basic suturing practice. I would definitely recommend this kit for anyone who's on a tight budget and doesn't like getting into using messy/raw pork feet (or belly) every time they want to practice the basic suturing techniques/knot tying.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd R. Armen",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Very complete kit.",
      "text": "Totally worth it. It’s very awesome practice and has everything I need to practice. I saw comments about the skin not being that hard. I personally found it okay because it was not too hard or too soft just enough so it holds up but can still allow needle to pass through.",
      "rating": 5.0,
      "verified": true,
      "author": "AAbreu",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "Variety of lacerations to practice",
      "text": "I really enjoy working on this training kit to practice my suturing skills! The pre-cut wounds help you practice elliptical sutures, surgical closures, flaps, etc. The tools given are great, too. You get at least an Adson, Kelly, and needle driver, along with scissors, scalpel, etc. 4-0 sutures are provided and it's great that the suture is long - usually the suture itself is shorter. Overall, great kit to practice your skills on!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Decent kit.",
      "text": "I like the pad that comes with the model however it gets kind of sticky and when trying to suture the thread will stick to the pad... My other issue with this kit is it did not come with a pair of regular forceps. Other than thoes two issues, the kit could have came with some tips/videos on how best to suture each individual cut. Overall the kit is decent.",
      "rating": 4.0,
      "verified": true,
      "author": "Elvis",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Not perfect, but does the job!",
      "text": "Bought this to practice sutures before my surgery clerkship. The suture kit contains all necessary items and are of good quality for repeated use. The practice pad itself provides a durable surface which, while not quite true to life, is a better surrogate than a foam block. I have torn through the incision edges a couple of times, but that was after 3-4 times suturing the same general location. Incision edges don’t come together perfectly, but allow you to practice your stitches, so overall the product serves it’s purpose!",
      "rating": 4.0,
      "verified": true,
      "author": "Clara R",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Great suture kit for beginners",
      "text": "I bought this fory 13 year old daughter who is enrolled in an elective SSTRIDE medical program through Florida State University. She is learning how to suture in class and asked for a suture kit for a Christmas that she can practice at home on. This kit had everything she needed and was easy for her to use. The price was great and it appears she will be able to use this for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "RKG",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great way to plant the seed!",
      "text": "My teen daughter is interested in medicine & asked for this. Coming from medical parents, I hope she chooses a field that is gratifying and not all time-consuming. But I'm all for planting and watering the seed \"subtly\" and this was a hit. My kid has had so much fun working on various stitches. She followed YouTube to learn the techniques. The skin and tools are perfect for practicing. I'm hoping the \"skin\" stays clean but so far, the quality couldn't be better. There are various \"wounds\" to suture and two different types of suture material. The tools are great quality and simulates the \"real\" simulation in any \"real\" medical program. Fun and encourages learning.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Bey",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Nice little suture kit",
      "text": "I'm currently a PA student about to start clinical rotations so I purchased this kit so that I can get additional practice. This is a nice little kit because it includes all the instruments that you would need and the skin pad has various different wounds which I think is rather nice. It is a pretty nice introduction kit for anyone who wants to get a little more practice, but does not want to go out and purchase pig's feet quite yet. The only real con of the product is that the skin is a little stiff and not easily movable unlike real skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Good Practice",
      "text": "I'm a medical student who purchased this to learn suturing a few months before my surgery rotation. The rubber skin material isn't exactly like skin, but it's good for learning. The needle driver and Adson forceps work just fine, as do the included sutures. I wish the rubber skin came with a more durable base/container not just plastic wrap. I used half the included sutures in just a few days. My box included a coupon for 12 more free sutures as well as a discount code for 20% off future suture purchases from this company.",
      "rating": 4.0,
      "verified": true,
      "author": "Asif",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Good for the price",
      "text": "These are by no means surgical grade instruments. However, they are adequate for general suture practice. I like the different layers of the \"skin\" and the suture material is good quality. Overall I am pleased but if you are purchasing for the purpose of a medical mission trip or the like, I would invest in something of higher quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole A",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "My son loves this kit",
      "text": "My son requested this kit for his birthday. As an avid off-roader and survivalist, he wanted to be able to suture a wound if absolutely necessary. As a nurse I'm very familiar with the suture materials used and think that this kit would be good practice. Hope he never needs to use it but like that he wants to be prepared.",
      "rating": 4.0,
      "verified": true,
      "author": "Sue Brown",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Seems like it will hold up well to lots of use.",
      "text": "I like that the pad has a natural suction when set on a smooth surface. It holds really well. I took off 1 star because it would be nice to have an instruction/reference book with different sewing methods and knot tying options. I'm not a medical student, just wanted to learn suturing for emergencies.",
      "rating": 4.0,
      "verified": true,
      "author": "alliclaireh",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Rips with hypodermis/deep sutures",
      "text": "This product was a little frustrating to use. As a medical student interested in surgery, I'm trying to learn more than just superficial-layer sutures. When I try to practice deep sutures, such as the simple buried suture, the suture rips right through the silicone even when I pull it through VERY slowly and gently. Makes practicing deep sutures absolutely impossible on this pad. It works alright for superficial sutures, although if you pull the suture through too quickly, it will also rip right through the top of the skin. Overall, disappointed in the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great Kit",
      "text": "I am a 3rd year medical student and got this kit to practice my sutures. It is a great kit, the practice suture pad is a great quality and has held up with multiple uses. The suture kit has all of the tools you need to practice your sutures. Finally, the suture itself is great, the best part is the nylon is 75cm so you are able to practice a lot of knots with just one suture.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Save your money, terrible product",
      "text": "This product is atrocious and I recommend you buy from someone other than Amazon. I read the amazon reviews and expected a high quality product. I bought this a year ago and took it out now that I'm on my surgical rotation. The material is so flimsy and fragile that even a 5.0 mono tore the skin while trying to practice a simple buried suture. Even moreso, the pickups are extremely poorly made and even when gripping my hardest, the space created is too big for the needle and the needle ends up falling out. When I tried using something bigger, the thick needle tore through the skin. Sorely disappointed with how much I paid for this piece of trash.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonCustomer4681",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Don’t buy this trash",
      "text": "Silicone pad is nowhere near real human skin, much less traction, less durable, more rigid, doesn’t move as easily. Comes with 2 sets of sutures, nylon and silk. The silk is okay, the nylon is absolute trash. Frays and tears just when I’m pulling on it to tie off a throw. Does not handle tension well at all!!!! The thread on the nylon is garbage. Just go into your hospital and practice on medical grade suture kits and forget these practice kits",
      "rating": 1.0,
      "verified": true,
      "author": "Oliver Ha",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Beginner Friendly",
      "text": "I love it. I am a high school student in MediClub, and my club president recommended us to buy a suture kit to practice at home. I’m glad I chose this option. Compared to the ones we use in our club, this is much more durable and doesn’t rip easily. The tools are easy to hold and efficient. I appreciate the blank space, it’s very creative. Thank you for making such a high quality kit. I recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "A.R.M.Y",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Essential for any healthcare profession beginning their career",
      "text": "One of my professors once said to me that any 1/2 wit medical professional should be able to throw a stitch on a laceration. I at first was intimidated about doing one, but after purchasing this suture kit, I am confident and no longer afraid! There are different laceration designs already molded on to the state of the art silicon suturing pad, and if you do not like them, you can make your own! If you are at all afraid of suturing, I STRONGLY suggest picking up this kit and quickly you will realize how quick and easy it is to learn.",
      "rating": 5.0,
      "verified": true,
      "author": "Noah Kosnik",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "GREAT!",
      "text": "it was really helpful. I try to use it every week (when I don't have exams). The pre-cut lacerations challenge you more than just cutting a blank piece would. The sutures go in easy and come out easy too. There are plenty of youtube videos to teach you every technique you could want.",
      "rating": 5.0,
      "verified": true,
      "author": "Josiah",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Rips.",
      "text": "It says there is a mesh to strengthen but this silicon kit lets sutures, especially the thinner silk, rip right through. I purchased this one based on excellent ratings but I feel like at times I am wasting my time.",
      "rating": 2.0,
      "verified": true,
      "author": "Veni",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "High quality company and product!",
      "text": "I researched many different kits before deciding to purchase this one. The material is great for suture practice and seems like it will hold up well. After I cut out one suture it’s very easy to reuse the same space multiple times. The tool kit comes in handy since I do carry it with me to work and school to practice on my downtime so it’s very portable. In addition to already being very satisfied with the product, the company reached out to me to send additional sutures at no extra cost to me. Very satisfied with both the product and the company itself!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Really great for practicing!",
      "text": "I found this kit to be very helpful in perfecting my stitches! Of course, this isn’t like real human skin, it’s a lot thicker and tougher.. however, the stitches don’t break through the material and rip it. I was and am able to enjoy hours of practice with my simulation pad intact! Unfortunately, due to my hours of practice, I ran out of suture. I bought more from a different seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Good value for the cost",
      "text": "Bought it as a \"just in case\" type product to learn for worst case scenarios partially out of boredom and partially out of curiosity. Great product, easy to use, quality stuff. Does not come with instructions so unless you are a paramedic, corpsman, or medical student, I suggest also getting a book explaining how to perform the sutures and knots.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "A complete kit perfect for those who are starting out and wish to practice.",
      "text": "As a future medical student, I purchased this kit in order to learn and practice sutures since a surgeon I shadowed offered to teach me so I could have some experience before entering med school. The kit arrived on time with no problems whatsoever and has everything you need to start to practice. I haven't been able to practice directly with my mentor yet, but from trying it out by myself with what I could learn by searching about basic sutures techniques, it works very well and is quite durable. Overall, I find it to have everything you need in one durable kit that I hope to get much use out off for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Emanuel J. Ortiz Hernández",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Thanks much!",
      "text": "I bought this kit to give a group of 16-18 year old LDS young men a surgical type experience. They did quite well! On 11 March, they will be back at it, this time to use their budding suturing skills as they enter a paper mache heart to conduct heart valve surgery! A defective aortic valve will be replaced with a ball and cage valve.",
      "rating": 5.0,
      "verified": true,
      "author": "Caliview",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great price for what you get!!!",
      "text": "Everything received and arrived just as pictured. Great training aid for those that want to practice suturing. The company is very responsive as well. Very pleased with the company and the product!!! Now I can practice suturing.",
      "rating": 5.0,
      "verified": true,
      "author": "Operator",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "CHEAP, CHEAP, CHEAP!",
      "text": "This product was a COMPLETE disappointment! The needle driver didn't stay closed. When passing suture through the gel, the gel would easily tear right through and the suture would pull out leaving the gel ripped and that incision unusable. The incisions that are gaped would pull the sides of the gel up when closed -- not realistic AT ALL. The needles pull away from the suture very easily wasting the entire package. The knife blade broke right in half when trying to remove it from the knife handle. This was a COMPLETE waste of money! Not at all helpful, just an incredibly frustrating disappointment!",
      "rating": 1.0,
      "verified": true,
      "author": "Alysha",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Better than practicing on one's arm!",
      "text": "Great kit and much less painful than practicing on one's own arm! Kit is complete and provides an accurate way to practice sutures. The material provides a similar resistance to real skin and can be used many, many times. When worn out, will buy again as it is a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bernstein",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Good starter kit for beginners",
      "text": "Comes with a good variety of suture sizes. Multiple 3/0, 4/0, and 5/0 of both nylon monofilaments and silk braided. As a beginner having diff options helps me to get a feel for how suture materials and size impact stitching technique. The nylons have ripped at the \"skin\" a little bit even after just a few uses. So im a little worried about how long the skin will last. Otherwise im happy with it and it seems on par with or better quality than some of the other kits my classmates got.",
      "rating": 5.0,
      "verified": true,
      "author": "gleason.em",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Good Kit",
      "text": "Like another reviewer had mentioned in the past, I was tired of the mess and odor in dealing with pigs feet I like the texture and feel of the material used in this kit. There are a variety of pre-cut lacerations as well as an area where you can create your own practice lacerations.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great investment for practicing",
      "text": "Honestly this was one of the best purchases I’ve made. The skin feels so real the muscle skin layer is very helpful for practicing. If your studying or aspiring to be a surgeon this is certainly a very wise investment to just practice suturing. The variety of gashes help to practice different methods in different scenarios.",
      "rating": 5.0,
      "verified": true,
      "author": "Emanuel",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Worst practice material - very cheap",
      "text": "Not durable at all and much smaller than my previous suture practice pads. Avoid this cheap and overpriced garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Gets the job done",
      "text": "Bought this product for suture practice before beginning vet med surgery labs. It did the job and I thought it was better than some of my peers suture pads they had purchased. More realistic in some ways but still just a slab of silicone nothing like live tissue. The one issue I had was that the suture given was very thin and not what we use in vet med so I tore through the pad a few times by pulling too fast and the suture string creating a cutting effect. Now I just get some suture from the clinic and use the pad. Works just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Excellent tool for learning and improving suturing",
      "text": "I've been using this kit on and off for months to learn suturing. Whether using silk or monofilament, the \"tissue\" really does stand up to repeated use. Even the deep and wide repairs spring back after removing the sutures. Highly recommend this to beginners and to people who want to practice new techniques with this kit before trying on your patients!",
      "rating": 5.0,
      "verified": true,
      "author": "bc",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Excellent Quality",
      "text": "I have to disclose that I bought this suture kit for my 17 year old son who will be heading off to college next year as a pre-med major. He was interested in learning/practicing sutures (self taught on youtube for techniques). But hey anything to keep the teens off of Xbox right! I am a nurse so both of us have enjoyed learning and perfecting suture techniques. The product provides multiple incision examples. This is a fantastic product whether you are a practicing med student, PA or NP or RN student or in my son's case take up a new hobby.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Stoffer",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Fantastic way to practice when your friends won’t let you practice on them!!!!",
      "text": "I bought this for my daughter who is about to go to medical school! She loved it! Of all of her Christmas presents, this stocking stuffer was her favorite by far! I will send her another one for her birthday!",
      "rating": 5.0,
      "verified": true,
      "author": "VCD",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Good but not sealed in a package....",
      "text": "One downside.... I thought there would be an instruction manual as well. Otherwise, seems to be a great product... One concerning factor.... It was not sealed or even in any additional packaging.... So i literally pulled it out of my mailbox and was able to just open the lid and get to my stuff... No tape or anything...",
      "rating": 5.0,
      "verified": true,
      "author": "Loki",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "poor quality, good for one time use",
      "text": "I bought this after reading all glowing reviews about it. The skin pad is not as durable as the product description claims. After one use, parts of the pad started ripping. Pieces of the different layers broke off even when I was gentle. I tried practicing more than once on one of the cuts, and it is essentially unusable now because the places where I inserted the needle began to rip creating a rather large crater after two tries. This pad is too expensive for single use.",
      "rating": 1.0,
      "verified": true,
      "author": "Scooby",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great practice.",
      "text": "This kit is awesome! I'd recommend this to everyone entering med school, those who just want to brush up on their suture skills or any serious camper or hiker. You never know when you might have to close a wound. Great practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms Brown",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "The only practice kit you will ever need.",
      "text": "This came with everything you need to practice. The tools are sturdy and easy to manage. They provide a few sizes of sutures with the thread attached. My favorite part of this package is the practice pad. There are so many ways to suture a wound and with all of the open designs it allows you to be creative. I recommend keeping the pad in its pouch and cleaning after every use. I recommend the purchase of this product because it is the only one you will ever need. They also provide incredible customer service. Support your small local business.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany J. Brown",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Good starting place",
      "text": "This kit is good for a very new beginner to just get some of the hand technique down. However, the material rubber used does not mimic real tissue at all. It also is very low in terms of durability as most deep stitches you try to throw will rip right through when you try go close to knot.",
      "rating": 3.0,
      "verified": true,
      "author": "Harry S.",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Not lifelike",
      "text": "The product rips easily when trying to suture. It does great with showing the different layers but it is not “skin like”",
      "rating": 4.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Great gift for medical students!",
      "text": "Love this suture kit! Bought one for my roommate who’s pre-med as a Christmas gift and he’s been practicing every day. The fact that it’s reusable is great, not to mention the amount of suture needles that it came with. The seller was very courteous and helpful. We will most certainly turn to them for more suture needles to practice with!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "High quality, challenging",
      "text": "This was a gift; the recipient, an aspiring surgeon, is hard at work mastering the knots and various techniques. He loves the challenge and the opportunity to practice on a realistic example of the real thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl3993",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "gets the job done",
      "text": "It is nice as far as all the features it comes with; however, the suture pad itself rips very easily. I will most likely be purchasing a replacement pad elsewhere once I've shredded this one up a bit. But again, overall it is effective for practicing suture skills, it just isn't very durable compared to ones I have practiced on in school.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Real tissue feel but a little messy",
      "text": "I really like the material this kit is made out of, it feels more like real flesh than other suturing kits I have practiced on. I love all the varieties of patterns you can practice with, which is helpful for learning different kinds of suturing. The only drawback I could find was the pad--which I consider the best perk of this kit, for its likeness to real flesh--can get a little sticky and would be better if there was some kind of tray or plastic piece to set it into so that it doesn't get dust or dirt stuck to it when you set it down to practice on.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie Doolittle",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "An excellent tool to teach suturing!",
      "text": "Very nice kit, perfect for teaching residents, med students, or your kids how to suture. The instruments are decent quality, much better than single use packs you find in hospitals & EDs. You get a decent assortment of suture material for practice. The artificial skin is pretty good for practice - it’s got to be really hard to simulate the elasticity and different layers of human skin / subQ tissue but they’ve done a good job. It’s much better and cleaner / safer than raw chicken, pig feet etc.",
      "rating": 5.0,
      "verified": true,
      "author": "ToddMG",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "I wish I had this as a med student...",
      "text": "Very high quality practice suture kit. I have been pleased with my purchase and find the instruments and sutures well made and easy to use in a very organized kit. I wish I would have had this as a medical student on my surgery or OB rotation or even during residency instead of suturing and knot tying on my scrubs! I keep it at work even as an attending to keep up my suture skills. Highly recommended item for anyone learning or keeping up skills.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "very good practice",
      "text": "I am advanced practitioner needed to hone my skills on suturing my new job. This kit has everything you need- suture pad, suture tools and threads, It has been very helpful. Silicon suture pad is better than orange or banana that you practice on! I have been practicing over and over and has not been broken yet. The product arrived on time and it's a very good quality. I highly recommend to people who need to practice suturing skills!",
      "rating": 5.0,
      "verified": true,
      "author": "Gena H",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great!",
      "text": "This company looks out for their customers 100%. I bought the pad and I am in love with the texture and lively feeling of the kit. I love the amount of sutures that were provided and I am looking to reorder it after praticing so much! Love it !",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Would not recommend",
      "text": "I would definitely not recommend this. I got this to practice suturing for my new position as a Cardiothoracic nurse practitioner. There is nothing I would recommend about this product unfortunately, it is not even close to closing human skin, the needle holders do not stay together and are much smaller than a normal Pair in the OR. None of the instruments truly mimic surgical instruments. The needle on the suture bent as I was trying to place a stick in the “life like” tissue. I would NOT recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer DeLong",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Ok practice tool but expensive",
      "text": "I am a medical student in the midst of clinical clerkships and wanted to get more practice with suturing so I would be at least semi-capable in the hospital setting. I like that the kit allows me to practice at home but the gel rips pretty easily and is not the best comparison to actual skin. It is also nice that the kit comes with tools and sutures but overall, I think it is too expensive for a student living off of loans. I also do not plan to go into surgery, so perhaps if I was more interested in surgery I would find this more helpful.",
      "rating": 3.0,
      "verified": true,
      "author": "Kiersten",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "What mesh...? Product rips easily.",
      "text": "I believe the suture pad provided is literally the same one provided by other sellers on Amazon, and there definitely is not a mesh layer providing any internal support to the \"tissue\". If you buy, make sure you take large bites! Save yourself $15 and buy one of the cheaper suture kits. The sutures and tools seem to be good quality and have worked so far.",
      "rating": 2.0,
      "verified": true,
      "author": "24601",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Needle driver catches on thread, doesn't lock well and deep sutures tear easily through the material",
      "text": "The silk and nylon catches easily on the needle driver, the needle driver does not lock unless I force it to to three clicks and I can't place deep sutures because the \"skin\" material is too delicate and the suture tears through when I try to pull the wound together. An ok pad, but it's cheap and it's good to practice simple superficial sutures.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Good Practice Tool",
      "text": "I think this is a great practice kit and affordably priced. For a synthetic material, it's about as close to real skin as you're going to get. It's pretty impossible to replicate the actual layers of tissue but this is a good starting point to practice throwing and get repetitions in! Had some issues with sutures pulling through with the material but again, I think that is to be expected with the silicone material. I especially like that it sticks to a counter or table so it's not sliding around while you're trying to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Great product!",
      "text": "This is a great product! And the seller was easy and pleasant to work with! The sutures to pull through quite easily so a bit different then the holding strength of skin but still a lot of fun to practice on and works great to get used to handling the instruments.",
      "rating": 5.0,
      "verified": true,
      "author": "thie0115",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Poor Quality",
      "text": "Horrible if you actually want to practice closing the lacerations provided with the kit. The material breaks off after inserting the needle or pulling the two ends together. Save your money and buy elsewhere",
      "rating": 1.0,
      "verified": true,
      "author": "Kadyn Pittman",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Amazing value for the money!!",
      "text": "I thought I would receive a small piece of fake flesh with this kit and maybe a few cheap sutures but I was really surprised when I got my kit! My preceptor and I suture all day long during our downtime in the clinic. I would definitely recommend this for any PA/NP student like myself. Worth every penny!!",
      "rating": 5.0,
      "verified": true,
      "author": "samasaxe1",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Quality",
      "text": "Really great kit. This kit has everything you need to learn and practice. I've used some cuts multiple times on the practice piece and it holds up just fine. No signs of damage after a month of use!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Great Practice!!!",
      "text": "Makes practice very easy to do. Different cut lines makes great practice. Able to remove sutures easily. And to redo! We have been practicing every day since we received this kit.",
      "rating": 5.0,
      "verified": true,
      "author": "MorningStar, Sr.",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Highly recommended",
      "text": "The quality of the kit, threads, and practice pad are amazing. The amount you get for the price makes it easy to practice and master the skill. The customer service is amazing and made sure I was satisfied with the product. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Great cheap tool.",
      "text": "It is a cheap product, you can feel it in the instruments but it gets the job done. I wish they had inside different sutures so you can practice on. I bought one for myself and two for my nurses. It’s a great tool.",
      "rating": 4.0,
      "verified": true,
      "author": "mumi",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great for practice",
      "text": "Kit was delivered quicker than anticipated. Only thing I have to criticize about the kit is that it doesn't come with any instruction (which would be helpful for beginners). I didn't mind looking it up, but it would have been nice to have it included. Other than that, I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina J",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Great kit overall",
      "text": "I am using this product for extra practice while in my surgery rotation as a medical student. It's really great for giving you the extra practice you need to shine like a star. However, this kit will not withstand buried sutures as it will tear. Overall great practice kit.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrianna",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Great Trainer",
      "text": "I got this to learn how to sew cuts. Its a great trainer but you can't really tell the different layers from what it says. But you get a code to get free more suture stitches.",
      "rating": 4.0,
      "verified": true,
      "author": "Russ",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Very nice",
      "text": "This is my first adventure into suturing and this kit has everything you need to get started. Everything seems to be very well made and is comfortable in my hands while using",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Great product for the price",
      "text": "This is a good suture practice kit for this price. The instruments come neatly packaged, there are variety of sutures included for practice and most importantly the suture surface is soft, it did not get torn or damaged after multiple uses. If needed I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Khush",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Good quality, great price!",
      "text": "Comes with everything you need to practice suturing techniques. Plenty of sutures of various types and sizes and a large practice pad that feels like real tissue. The instruments seem sturdy and well put together. I have already started using it to practice and it has been a very helpful purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "JTEE31639",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Great Product for Learning sutures",
      "text": "I bought this product for my step son to practice sutures bc he just started working at a vet clinic and is getting on the job training. I didnt get to see him use it before he went home but the material seemed perfect for learning. He loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "A.N.I.",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Med student must buy",
      "text": "Great item the artificial skin is well constructed and seems to be very durable. I like that it is large and can be molded around items to simulate actual skin lacs. I would say I wish the tools were a little larger but all in all I would definitely recommend this to med students and anyone looking to learn the techniques the practice is definitely worth the money. You can't bring a cadaver in your overnight bag.",
      "rating": 5.0,
      "verified": true,
      "author": "vincent monti",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great Practice",
      "text": "I bought this product as a gift for my pre-med daughter. She had requested it and she loves it. After finding youtube videos, she has been practicing away. While the intent is likely for med students to practice, this has gotten her very excited about surgery. We're all just worried if we get a big enough cut, she'll be pulling out the suture kit! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten Pursell",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "everything you need to practice sutures at home!",
      "text": "I bought this product to practice sutures before starting a surgical clinical rotation. it served it's purpose and I am very satisfied with the customer service from this supplier!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lester",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Excellent kit with plenty of extras",
      "text": "This is a great product! The only reason I gave 4 stars in the beginner category was because it includes everything you need to practice except a guide to the different methods. That can be remedied easily enough by online searches though. I really like that it comes with an open area on the mat that allows you to make your own cuts to suture",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Murphy",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Super awesome kit!",
      "text": "If you're looking to learn to suture, this is your kit. It comes with everything you need to get started. It comes with all the tools and sutures you need. It also comes with a very realistic practice pad. I got it on prime and it was delivered within 2 days. The company had emailed me a couple of times to make sure it arrived and to make sure it was what I was looking for. Great product, I'll definitely be ordering more from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Hines",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Great resource!",
      "text": "Excellent suturing kit to practice on. Preceptors were impressed something like this was even available. I would suggest this as a learning tool for anyone wanting to practice or just get more proficient in suturing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great for a short time",
      "text": "This product is very useful for practicing simple interrupted stitches for a short time. The tools in the kit are high quality, and the sutures are of a quality suitable for practice or for beginners. After only a few bites in the same area, however, the pad begins to break down. Some of the wider practice wounds are essentially unable to be brought together due to the pad material breaking down or tearing from the tension.",
      "rating": 3.0,
      "verified": true,
      "author": "Tara Kuper",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "So far, So good",
      "text": "Christmas present for my sister going to vet school. So far, so good. She said it didn't come with the razor that they use at the clinic, but other than that it came with everything she needed. Beautifully done. I only wish it all came in a carry case and with an ebook for sutures and techniques.",
      "rating": 4.0,
      "verified": true,
      "author": ".kj",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Good for learning",
      "text": "Can do about 10 different sutures because of this. The rubber however cannot hold subcuticular nor buried sutures very well - it may tear. The sutures themselves aren't optimal for learning, 4-0 sutures are rather small for beginners (but doable).",
      "rating": 5.0,
      "verified": true,
      "author": "Arutha",
      "helpful_votes": 0,
      "publication_date": 20200209
    }
  ],
  "product_meta": {
    "title": "Complete Suture Practice Kit for Suture Training, Including Large Silicone Suture Pad with pre-Cut Wounds and Suture Tool kit (25 Pieces). 2nd Generation Model. (Demonstration and Education Use Only)",
    "description": "Our large suture pad (17 cm x 17 cm) is a great suture practice tool and can be used for extra practice, study or teaching. The suture pad is made of the highest quality silicone material, comes with three layers of tissue: skin, muscle and fat, providing the next best anatomical simulation to practice on, after an actual human flesh or a dead animal. There are 14 cuts of various types (10 types), width and depth and lots of space to add additional cuts. \n\nOur suture pad has been redesigned and improved after medical students used it and came up with ways to improve the product - students are the primary users of our product, so who to trust if not the actual user? Our latest product update features a built in \"mesh layer\" between the skin and the fat layer, making the pad more durable and long lasting. \n\nMoreover, you are getting a complete package of tools needed to practice suturing and no need to look for other essentials. For a moderate price you get a great value! In the suture kit you get: \n\nLarge suture pad with wounds \nHegar needle holder \nAdson forceps \nSuture scissors \nScalpel blades (3-pack) \nSuture thread (16-pack) \nStorage case with zipper \n\nSo convenient and helps to keep you organized in a world of exams, study and school life chaos! \n\nThe suture practice set can be used for: \n\nExams and study practice \nTeaching demonstrations \nPractice before starting a real job or residency \n\n\nNOTE: This product is for demonstration purposes only and is not intended for use on humans or animals.",
    "rating": 4.7,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "8.2 x 7.6 x 1.95 inches; 1.34 Pounds",
      "Date First Available": "December 28, 2017",
      "Manufacturer": "ARTAGIA",
      "ASIN": "B078NZMQKF",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "610877723997"
    },
    "categories": [
      "Professional Dental Supplies",
      "Sutures & Suture Needles",
      "Industrial & Scientific",
      "Implants & Surgical Supplies"
    ],
    "price": 39.95
  }
}