{
  "website_summaries": [
    {
      "verdict": "Multiple weights, lofts, and shaft flexes available in a driver that has all of the latest bells and whistles.",
      "pros": [
        "Provides weights you can move around the club head to help you change the spin or trajectory of the ball flight",
        "Club head design is aerodynamic to gain more speed and distance off the tee",
        "Club face reduces spin on off-center hits"
      ],
      "cons": [
        "It's pricey, but in line with other new drivers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "What can it hurt to have a new driver?",
      "text": "I was very leery to order this driver, after all I have perfectly great Callaway Raz X driver, but I thought I could use a change. This new/used Rogue SZ driver is exactly what the Dr. ordered; It came in excellent condition and looked as good as new. Callaway even followed with an email w/ a nice cert., how cool is that. After several rounds, I have put my old driver aside and have gone totally Rogue!",
      "rating": 5.0,
      "verified": true,
      "author": "Gorilla47",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great purchase",
      "text": "Great club! Perfect condition. Almost could not discern from brand new. So happy I went with a previous year model and pre-used; I’m an average golfer at best, and was able to save a lot of money. The picture is of the Rogue next to my 20 year old Big Bertha Steelhead Plus - what a difference!",
      "rating": 5.0,
      "verified": true,
      "author": "J.C. ",
      "helpful_votes": 3,
      "publication_date": 20190610
    },
    {
      "title": "Definitely Used",
      "text": "The correct club came as described, and arrived on time. I knew I was getting a used club, but this one was very used and not well taken care of. There are chips/marks all over the club head like it never lived in a cover and the previous owner made no attempts to protect/maintain the club; and it's less than two years old (2018 club). All that being said, I used the club (one round) because I didn't feel like any of that would affect it's performance. The club seemed to work fine and I'm going to keep using it for now. I just wanted to temper other buys expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "KARL WAGNER",
      "helpful_votes": 2,
      "publication_date": 20190829
    },
    {
      "title": "Heavily Used",
      "text": "I was expecting a used club, but I was not expecting it to be totally hammered. This clubhead has been swung thousands of times, and appears to have spent much time rattling around without a cover.",
      "rating": 2.0,
      "verified": true,
      "author": "Allan Overmeyer",
      "helpful_votes": 2,
      "publication_date": 20190830
    },
    {
      "title": "Awesome Driver!!!",
      "text": "Gained 20 yards on my drive. I absolutely love this driver! It has a great sound, which may sound strange, but is important to me for confidence. Pretty forgiving, since I’m a relatively new player. Please note, it came looking great from amazon, and I haven’t cleaned it since taking these photos and multiple rounds of golf.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire Brady",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Love this Driver!",
      "text": "Replaced my M2 with this Driver. Man this thing is hot. For the average golfer will allow for mis hits and maintain distance and decent control, but for those that can center the face be ready for some added length off the tee. Did have to replace the shaft, went with the Hz. Yellow",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great club",
      "text": "I got this club to replace a Titleist 915D. It's added distance to my swing and it's much more consistent.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph S.",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Lives up to the hype",
      "text": "Forgiving club with a lot of pop, The shaft did not test out stiff, more regular. Had a stiff shaft put in and it's the bomb, no pun intended",
      "rating": 5.0,
      "verified": true,
      "author": "Preston S.",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "EXCELLENT!!!!!",
      "text": "Great product and delivery. Driver was in excellent shape and came with head cover and adjustable tool. Would Definitely buy again from this company. 👍🏼👍🏼👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "rob martinez",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Team Rogue!!",
      "text": "Great driver at a great price! For a used club, it had less play wear than I had expected. Only complaint I may have, though not that concerning, is it didnt have the original Rogue headcover. Did come with a Callaway headcover.",
      "rating": 5.0,
      "verified": true,
      "author": "BDevine",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Just buy it. Game changer.",
      "text": "Hit this thing 20 yards further than my previous driver. Spin rates are in the low 2000s. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan L. Bohlen",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Five Stars",
      "text": "Super Long and forgiving with a little fade. Amazing driver",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Murcia",
      "helpful_votes": 2,
      "publication_date": 20180306
    },
    {
      "title": "This thing basically hits itself.",
      "text": "I like to say that clubs these days basically hit themselves. This could not be more true with the rogue sub zero. Fantastic driver that does everything advertised. Moveable both directions, very satisfying sound, sleek and gorgeous. Highly recommended for good players.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Underwood",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "This Callaway Rogue Driver is absolutely awesome",
      "text": "I liked the service and the driver is great. I hit it with confidence down the fairway.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Boler",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Mint shape",
      "text": "Club came in mint great shape. Didn't look like it was used at all. Came with cover. First impressions are it is pretty forgiving and am hitting it consistent.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Weare",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Way better condition than expected",
      "text": "Was iffy buying this used but for the price and coming with the shaft I needed this driver was perfect. Driver looks brand new and plays well for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Frick yes",
      "text": "Couldn't believe the condition of the driver truly exceptional, head cover and tool both brand new just a great purchase .. head down swing hard..",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Nice",
      "text": "Pretty nice Driver for the money, I would but it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Pink",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Amazing",
      "text": "Absolutely amazing so shocked with how prestine condition the club came in it said good condition but it looked like mint",
      "rating": 5.0,
      "verified": true,
      "author": "Ryne C.",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great product",
      "text": "Great product and will be getting hybrid clubs as well..",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Phillips",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Swing easier and let this club do the work.",
      "text": "This driver was a major game changer from the start. In my first round I was I in the fairway 12 out of 15 holes. I could swing easier and still get the distance. My drives are longer than with my other Calloway and it feels great.",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny S. Arizona",
      "helpful_votes": 0,
      "publication_date": 20181008
    }
  ],
  "product_meta": {
    "title": "Callaway Golf 2018 Men's Rogue Sub Zero Driver",
    "description": "Golf Digest 2018 Hot List Gold Medal Winner! Rogue Sub Zero is an extraordinary achievement: a powerful, extremely low-spinning, Tour-level driver packaged in a high MOI shape.",
    "rating": 4.5,
    "feature_bullets": [
      "Jailbreak Effect for Exceptional Ball Speed",
      "Triaxial Carbon Crown for Increased MOI and Lower Spin",
      "Interchangeable Weights for Increased Spin- and Trajectory-Control",
      "Industry-leading Boeing Aero Package",
      "Premium Shaft Selection at Multiple Weights"
    ],
    "specifications": {
      "Date First Available": "January 3, 2018",
      "Manufacturer": "Callaway",
      "ASIN": "B078RYJJRK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Drivers",
      "Golf Clubs",
      "Sports & Fitness",
      "Golf"
    ],
    "price": 399.99
  }
}