{
  "website_summaries": [
    {
      "verdict": "The most affordable suspension trainer currently on the market, able to support individuals up to 400 pounds.",
      "pros": [
        "A no-frills suspension training kit that comes with only the essentials: handles (with foot loops), straps, instructions, and travel bag",
        "This model costs considerably less than comparable suspension trainers and it comes with a limited lifetime warranty"
      ],
      "cons": [
        "The materials are not as thick and sturdy as you may like, but it does the job"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great!",
      "text": "I'm a personal trainer who actually purchased one of these before. Loved it so much I had to get another one. Surprisingly I prefer these over the TRX. They go through a ton of abuse by me and my clients and they hold up really well. Extremely easy to set up. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "apetro",
      "helpful_votes": 12,
      "publication_date": 20180716
    },
    {
      "title": "Great Quality at a Great Price",
      "text": "I've been shopping around for a suspension trainer and came across the NOSSK TWIN PRO. What caught my attention first was the price. At over half the cost of the leading brand it was a no brainer. The second attention grabber was all the positive reviews it had. Reviews comparing it to, or even better, than TRX. When I received this product you could tell right away that it is a quality product. The instructions on how to set it up were easy to follow. I am extremely satisfied with this product and would recommend it to anyone who is looking to take work outs outdoors or for those that travel a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 4,
      "publication_date": 20180808
    },
    {
      "title": "Effective TRX competition",
      "text": "Fantastic piece of exercise equipment that is great for supplementing Bodyweight/calisthenic styled workouts! Also a great bargain compared to TRX.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Shives",
      "helpful_votes": 3,
      "publication_date": 20190609
    },
    {
      "title": "foot straps a could be a little larger",
      "text": "Shipped fast. Like them a lot except for all the exercises that require you to use the feet straps. I wear a size 12 and it takes along time to get your shoes in them. Not impossible but very slow. I don't have that problem with the TRX bands at the gym. If not for that they would get a five star.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronnie G.",
      "helpful_votes": 3,
      "publication_date": 20190519
    },
    {
      "title": "Love these",
      "text": "I love these suspension straps. They are as good as the more expensive brand. They are easy to anchor and are very portable. I would recommend these if you are looking for suspension straps at a fraction of the cost of the more expensive ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Gyingst",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great quality",
      "text": "NOSSK Twin Pro is awesome. I was looking to purchase a second WOSS trainer and was bummed to hear it was no longer available, then I found this product. Great quality, durable piece of equipment. A great buy for anyone looking to purchase a suspension trainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppa",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "just used it for 15 mins to try it out and I absolutely LOVE it! Quality build - feels really sturdy and ...",
      "text": "Just got it. Set up took 2 mins, just used it for 15 mins to try it out and I absolutely LOVE it! Quality build - feels really sturdy and safe. Great find for a fraction of the cost compared to \"bigger\" names. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Ikonen",
      "helpful_votes": 3,
      "publication_date": 20180523
    },
    {
      "title": "Great product!!!!",
      "text": "Great product. Put together with no problem. Sturdy good quality straps. Great price. I just got them and tried them out if I have any problems I will let you know.",
      "rating": 5.0,
      "verified": true,
      "author": "Tee",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Solid Purchase",
      "text": "A very good product. Handle feels better than other straps I have used. It is sturdy and adjusts easily. I am comfortable having these for my gym members to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Squires",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Just perfect!",
      "text": "I attached to my old TRX mount and works perfect for my routines, it seem very solid construction and better than TRX for single arm / foot exercises.",
      "rating": 5.0,
      "verified": true,
      "author": "Manuel Arteche",
      "helpful_votes": 4,
      "publication_date": 20180906
    },
    {
      "title": "Amazing",
      "text": "Amazing product. Easy to set up, easy to use, excellent quality. My buddy has a higher priced brand and these are just as good for a quarter of the price. Was a little hesitant to buy but very happy I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan P.",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "good for truck drivers",
      "text": "These work like they're supposed to. I'm a truck driver and I use them on the road to get some kind of work out into my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Silinus Vers",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Top quality, excellent price = you can't go wrong!",
      "text": "Just received the NOSSK TWIN PRO Bodyweight Fitness Strap Trainer yesterday and tested it out in my home. I have no complaints! Very versatile and excellent quality! I read other reviews on this product and pretty much agree! I've made a couple of d.i.y. suspension trainers and the worked fine yet never had 100% confidence in them. With this NOSSK suspension trainer you feel and see that this is a quality product!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Very happy with the quality of this product",
      "text": "Very happy with the quality of this product. It adds variety to my workout routine. Great for many exercises, but I mailny use them for tricep extensions and rows. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Franke",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Exactly what I hoped they would be. Can't see ...",
      "text": "Exactly what I hoped they would be. Can't see how there could be any difference from the much more expensive \"name brand\" unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Pratt",
      "helpful_votes": 2,
      "publication_date": 20180423
    },
    {
      "title": "Great Quality!",
      "text": "Great product. I use TRX straps regularly at Orange Theory fitness but after quarantine I found myself in need of some. I was shocked to find out how much real TRX straps are. The price was good and the quality is excellent. Easy to adjusting and set up. My husband weighs 220lbs and was very surprised with how sturdy they are. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Thor",
      "text": "I use them every day. Durable and resistance is as as marked on tubes. Not the case with some brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Petersen",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Very happy! I attached both carabiners to a single support ...",
      "text": "Very happy! I attached both carabiners to a single support (from an old heavy bag) on the basement ceiling.. works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Casey",
      "helpful_votes": 2,
      "publication_date": 20180729
    },
    {
      "title": "Easily packable and durable strap!",
      "text": "Well made product! Strong durable, easily adjustable. Worked great at a resort that doesn't have a gym. Easily packable. Have not used the over the door strap adapters yet but they are awesome. Great product at half the cost of other options!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "good for truckers",
      "text": "I use this to exercise while on the road along with bands.",
      "rating": 5.0,
      "verified": true,
      "author": "leon",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "High quality and easy setup",
      "text": "I set up my straps in less than 5 minutes, and that included installing a screw eye in a ceiling joist to hang them from. I've used them a couple of times and couldn't be happier. They work just as well as the ones at my gym for a fraction of the price. In fact, I think its easier to adjust the length on these.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Extremely high value suspension trainer",
      "text": "Nice, sturdy hand grips and straps. Strap length is easy to adjust. Fits well in door frame. For being 1/2-1/3 the price of the leading brand of suspension trainers the Nossk Twin Trainer holds up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Great quality at great price",
      "text": "I just started working out with these suspension straps. I wanted something different for my daily workouts and this is a great option. I was looking at TRX but they were very expensive. These are great quality at a great price I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Very good product for the money.",
      "text": "Work great. Very comparable to TRX. Only thing they don't have is self leveling between the 2 straps like TRX. I don't mind for the price. Glad I added these to my home gym while on quarantine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Works great, seems high quality",
      "text": "Works great, seems high quality. Been thinking about getting a suspension trainer for a while, glad I got this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha Miles",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Great value, well made",
      "text": "I use TRX at the gym and these are just as good. I attached the straps to a pull-up bar. This works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Great Product!",
      "text": "Solid, great quality, and what I'd expect to pay for these bands (not 3 times more!).",
      "rating": 5.0,
      "verified": true,
      "author": "Z C",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Quality workout straps",
      "text": "I am very impressed by the quality of the straps and handles. They dont feel cheap at all.",
      "rating": 5.0,
      "verified": true,
      "author": "DrRichardHurts",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "quality suspension trainer",
      "text": "I am happy with the Nossk suspension trainer/fitness strap. I have not had this for very long, but the webbing seems to be good quality and will last a long time. Attaching and removing from a door or bar is very easy. Attached is a picture of it attached to my pull up bar. Adjusting the length of the strap is very easy also. If your in the market for a suspension trainer, this one is a good bet. Especially since it is less than half the price of the other guys.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam H.",
      "helpful_votes": 7,
      "publication_date": 20180118
    },
    {
      "title": "Great product",
      "text": "I am using this to build up strength to be able to do a pull-up and push up on my own. It's very easy to use and I can already tell I am getting stronger from it. The only complaint I have is it's hard to hang on your door by yourself. I have to have someone help me. You have to be able hold the straps over the door and also close the door all at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "j. bailey",
      "helpful_votes": 5,
      "publication_date": 20181221
    },
    {
      "title": "Very Very good Suspension Trainer.  T -R- Who?",
      "text": "Excellent product and construction. High quality and best buy compared to similar products. This is my second set - bought specifically for my home gym to hang from a ceiling anchor point. The first set is a door frame set I use when traveling or if it's more convenient to use in another part of my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Dino K.",
      "helpful_votes": 2,
      "publication_date": 20180601
    },
    {
      "title": "New favorite suspension trainer, great versatility and durability at an even better price!",
      "text": "I have a new favorite suspension trainer. My previous favorite is the Jungle Gym XT, but the NOSSK Twin Pro Trainer has separate straps like the XT (great for varying the width of the straps), it's just as durable, and two additional points: the NOSSK is more portable, fits more easily into a suitcase and it's half the price of the XT (and a lot cheaper than TRX but with more features).",
      "rating": 5.0,
      "verified": true,
      "author": "JLBrown",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Really happy!",
      "text": "Great piece of equipment at a fraction of the price of TRX. Would give it 5 stars if they had something to connect the two bands together at the top (like the TRX does).",
      "rating": 4.0,
      "verified": true,
      "author": "Gwendolyne Echenagucia",
      "helpful_votes": 3,
      "publication_date": 20180820
    },
    {
      "title": "Incredible quality - just as good as the brand you've heard of!",
      "text": "Incredible quality for the price, NOSSK is the real deal. The cam system makes adjusting straps quick and easy, and the handles are very comfortable. Just as good, if not better than TRX. Will definitely recommend to friends and family, thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "vanillaROBOT",
      "helpful_votes": 3,
      "publication_date": 20180701
    },
    {
      "title": "great US product",
      "text": "excellent made in the USA suspension product. very comfortable handle, strong and secure - feel very confident using this for any suspension type workouts. NOSSK has been very prompt with any questions regarding this - actually bought a second for my wife. Great stuff!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180424
    },
    {
      "title": "Ok, Don't spend a ton of extra cash buying those other systems!",
      "text": "Why spend a ton of extra cash for some of the other systems just like this one? This is a well made sturdy set for the affordable price of $39.95 so just buy it and save the extra cash!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine Southgate",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "love",
      "text": "needed to have my own at home and easy to bring to the gym... love it",
      "rating": 5.0,
      "verified": true,
      "author": "LONZtheMUA",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Sturdy system.  Highly recommend.",
      "text": "Great durable product that is basically identical to a better known brand, and in my opinion, less obnoxious looking. It’s a clean black functional design. Also had a slight supply chain issue when I ordered, and this company stepped up with great customer support.",
      "rating": 5.0,
      "verified": true,
      "author": "horatio",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Excellent",
      "text": "Love this set. I have had two friends buy it after trying mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Very good",
      "text": "Good product. Everything feels well made. Easy to set up with the different attachment options",
      "rating": 4.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Great buy, great product and great company with the best customer service",
      "text": "Awesome product. Bought a work out system from NOSS's previous models, they were just as good. I have bought these for all my famiky memebers for xmas and birthdays. Excellent quality and made in the USA! In my opinion, far better sysrem than the more expensive, counterparts. Thanks NOSS!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "These are great for my studio",
      "text": "These are great for my studio! Easy to use and hang from the mounts I already had. Great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "KeithK",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Set up is hard",
      "text": "Good but the weights don't stay I the door. Hard to screw them in",
      "rating": 3.0,
      "verified": true,
      "author": "Stephy",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "High quality product",
      "text": "Works great! Love using it and appears to be high quality",
      "rating": 5.0,
      "verified": true,
      "author": "Prp",
      "helpful_votes": 0,
      "publication_date": 20190302
    }
  ],
  "product_meta": {
    "title": "NOSSK Twin PRO Bodyweight Fitness Strap Trainer (Black)",
    "description": "This black NOSSK TWIN Bodyweight Trainer is made of many US components such as US made 1st Grade Military webbing. Set-up your own Home Gym, Train for a Spartan Race or for Cross Fit with this NOSSK TWIN Pro Body Weight Trainer. No need for an Ab Roller, Free Weights or bulky workout machine. Two separate Straps allow a narrow or wide Strap set-up - perfect for dips etc. For One-Arm Exercises simply grab one Grip – No need to turn the Trainer into Single Handle Mode. The height of the Grips are easily adjusted with the 2 Cam Buckles – no need to open and close the door to re-set the height of the grips as is needed with some other systems. Get started today. We are sure you'll love it, if not return it no questions asked. 100% SATISFACTION GUARANTEE from NOSSK, Inc. – a California, USA company.",
    "rating": 4.8,
    "feature_bullets": [
      "WORKOUT FROM HOME!! MANUFACTURED IN THE USA – EXTRA DURABLE – Using US and global components. Made with 1st Grade US Military Webbing and other professional grade components. The Straps lay flat on your arms – very comfortable. This PRO Trainer comes Standard with extra strong and comfortable (Latex Free) RUBBER SLEEVE GRIPS with soft, non-marring and non-scratching Foot Loops. No hardware that will scratch your shoes, or your hands or feet.",
      "VERSATILITY: Use the Trainer indoors or outdoors – ATTACHES IN SECONDS to most fixtures such as a door, bar at the gym or tree in the park – even use it on a vertical post! – securely. Two separate Straps allow a narrow or wide Strap set-up - perfect for dips etc. The height of the Grips are easily adjusted with the 2 Cam Buckles. Trainer is up to 8ft long and for people up to 400lbs.",
      "PROTECTION – Using the soft loops on the webbing of the Trainer will not rub when used on say a bar. Use the included carabiners for split seconds set-up. The INTEGRATED DOOR ANCHORS are light-weight and non-intrusive, yet allow you to use your Trainer on a door without additional hardware - it will not indent the door by the plastic portion of oversized and intrusive door anchors of other models",
      "ENVIRONMENTALLY FRIENDLY – Each Trainer is made in-house right here in California, USA. No wasted money for shiny boxes, no DVDs to collect dust. Just what you need - FIRST CLASS FITNESS SUSPENSION STRAP GEAR. Reach us at the touch of button with any questions. Comes with 2-sided full color EXERCISE SHEET so you can workout as soon as you get it - indoors or outdoors. LOSE WEIGHT, TONE MUSCLES, IMPROVE STRENGTH AND FLEXIBILITY Quickly and Easily!",
      "BEGINNER to EXPERT. 100% SATISFACTION GUARANTEE from NOSSK – a California, USA company. We are so confident that you will love your new Trainer that should anything not be to your liking – no worries - we will even pay for the return shipment to us (if not provided through Amazon directly - US customers only) over the next 60 days. Thousands of NOSSK Trainers sold to gyms, fitness centers, schools, and individuals globally! Buy with CONFIDENCE and join the NOSSK Team. Limited LIFETIME WARRANTY"
    ],
    "specifications": {
      "Package Dimensions": "10 x 7.87 x 3.15 inches",
      "Item Weight": "2.39 pounds",
      "Manufacturer": "NOSSK",
      "ASIN": "B0787N14TX",
      "Customer Reviews": "4.8 out of 5 stars87 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#41,453 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Accessories",
      "Exercise & Fitness",
      "Home & Kitchen",
      "Sports & Outdoors",
      "Exercise Bands",
      "Sports & Fitness"
    ],
    "price": 47.99
  }
}