{
  "website_summaries": [
    {
      "verdict": "The same bold results as the original Better Than Sex mascara but now waterproof.",
      "pros": [
        "Truly waterproof formula holds up against rain, sweat, swimming pools, and even stays put in the shower",
        "Provides all the volume and pigmentation of the original Better Than Sex mascara",
        "Volume and curl last all day"
      ],
      "cons": [
        "Waterproof formula takes a long time to dry"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "False claims as usual...",
      "text": "Whoever named this must still be a virgin. Not waterproof and will leave a mess of flakes and smudges under your eyes within two hours of applying without even working up a sweat or getting caught in the rain. CAN ANYONE PLEASE RECOMMEND A WATERPROOF, SMUDGE PROOF, FLAKE PROOF MASCARA THAT ACTUALLY STAYS PUT UNTIL REMOVED? ...EVEN WHEN APPLIED TO LOWER LASHES? I feel like I have tried them all and they all flat out lie.",
      "rating": 1.0,
      "verified": true,
      "author": "Aurora D'Orable",
      "helpful_votes": 28,
      "publication_date": 20190221
    },
    {
      "title": "Very disappointed.",
      "text": "I’d heard that this was a good mascara and I’d never wear anything else. I can say I was very disappointed. I’m in my 40’s and looking for a mascara that looks full without being clumpy. I applied several coats without much affect. I later looked and it was clumpy. By the evening it was flacking off and getting in my eyes. It was as if the mascara was very old and dried up. I’ll be trying something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa444",
      "helpful_votes": 11,
      "publication_date": 20190215
    },
    {
      "title": "Waterproof???",
      "text": "First time buyer of BTS mascara. Wanted a good waterproof version for summer (swimming and allergies). Love the way my lashes look. The wand takes a few tries to get used to. Not liking the \"waterproof\" as it seems to come off easily. Will most likely buy again though. Pricey so I would buy the travel size again.",
      "rating": 4.0,
      "verified": true,
      "author": "Homeychick",
      "helpful_votes": 2,
      "publication_date": 20190719
    },
    {
      "title": "I have used this a few times and its great. Its easy to apply and don't not get ...",
      "text": "I purchased this for my hospital bag for when I give birth to my baby girl! With my son all my pictures had smeared mascara and I wanted that to be different this time around! I have used this a few times and its great. Its easy to apply and don't not get messy after some tears!",
      "rating": 5.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 4,
      "publication_date": 20180620
    },
    {
      "title": "Great waterproof mascara",
      "text": "Love this mascara! Stays on, no smudging and it gives great length to my lashes! It is definitely waterproof. Iust use coconut oil to remove it at night. Just wish it was a larger tube! I will be purchasing this again.",
      "rating": 4.0,
      "verified": true,
      "author": "jamie",
      "helpful_votes": 3,
      "publication_date": 20180330
    },
    {
      "title": "No better than a less expensive supermarket brand.",
      "text": "I'm not sure what the big deal is about this stuff. It didn't give me sexier lashes than an inexpensive supermarket brand. It stayed put, but no better than an inexpensive supermarket brand. And by the end of the day, my lashes felt like they were clumped together with cement, just like an inexpensive supermarket brand.",
      "rating": 3.0,
      "verified": true,
      "author": "AKinOR",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "It may be for you it may not",
      "text": "I e heard so many good things about this product found had it in my save for later most got it when it went on sale. So for the price not bad but it wasn’t as awesome as I expected but I do have very faint natural lashes so maby the coverage for me, was all I can get right now. It may work better for someone with at least a descent amount of lashes to use it on. Came off easily with makeup remover not like most of the tar like waterproof mascaras I’ve used before. So Clinique waterproof is still my favorite.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Disappointed",
      "text": "I’m very upset that I wasted my money. I love better than sex mascara but this came dry as heck. It hardly wanted to coat my lashes. I could have just bought an $8 one at the dollar store for what quality this came in",
      "rating": 1.0,
      "verified": true,
      "author": "Juno",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Favorite mascara ever!",
      "text": "This is my absolute FAVORITE mascara ever. I gave it only 3 stars for easy to remove, because it isn't, but thats a huge plus for me! This mascara does its job and then some! I ran out, and started using my It Superhero mascara, which i used to love, only to find it didnt compare in the slightest to Better Than Sex waterproof!",
      "rating": 5.0,
      "verified": true,
      "author": "James chavez",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Love this mascara!!",
      "text": "My favorite mascara I've ever bought. Makes my lashes look long and pretty without looking like I have too much on. Doesn't get clumpy and thick looking. Just a natural look. I'm sure if you put extra layers it would give a different look.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "worked great",
      "text": "Kept my makeup from running at my daughter's wedding! Used micellar water to remove.... it wouldn't come off with regular eye make up remover. But applied beautifully and was just what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Williams",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Best mascara out there",
      "text": "Makes my lashes so full and it doesn't get goopy. My eyes tear alot so waterproof is a must. It does come off with face cleanser.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen H",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Too hard to remove, not much volume or length",
      "text": "Not much volume, it is so hard when it dries and impossible to remove, the look is not worth the trouble removing it, I would not recommend this. I will stick with Maybelline and Loreal",
      "rating": 4.0,
      "verified": true,
      "author": "gin",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Lashes look great, for a few hours.",
      "text": "This mascara makes my lashes look great, but it does not seem to he waterproof in the slightest. It smudges easily, and often times it is off of my bottom lashes before the end of the day. It makes my lashes look amazing, however. I can count on it if I'm only going to need it to hold up for 4-6 hours.",
      "rating": 3.0,
      "verified": true,
      "author": "Jamie W",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "GREAT SIZE FOR BEING MINI WAS SUPRISED",
      "text": "IT WORKS AWESOME AS ALWAYS AND WAS SUPRISINGLY ALOT LARGER THAN I EXPECTED. ESPECIALLY FOR THE PRICE. CAME WAY FASTER THAN IT SAID AS WELL",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Makes my lashes look super long",
      "text": "This is my favorite mascara every I always buy the mini so it doesn't dry out After twelve his or so it does begin to flack a bit",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "My all time favorite mascara",
      "text": "It’s definitely waterproof! After going through so many drugstore mascaras I finially found my favorite! No smudging even spending all day at Disney on a hot Florida summer day!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenni",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "BUY IT!",
      "text": "This is my go-to mascara! It gives amazing volume and works wonders, I use this during vacations and when I do makeup for weddings and it has not let me down. I found that after a period of time the original (non-waterproof) Better Than Sex will start to flake but the waterproof does not. It is definitely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Destinee",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Recieved used product",
      "text": "The box I received was damaged and the mascara had no protective seal of any kind. I'm pretty sure I received a used product so I returned it without trying it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Not worth it",
      "text": "It took several coats to get the desired effect and even then, I still was not happy with the length of my lashes. The product is way too wet and stays wet for at least 10 minutes therefore smudging all over my eye lids until it was dry. The brush is too fat and unwieldy. I will be returning for a full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny M",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Dry",
      "text": "I love this brand but very disappointed with the product it's dry don't know if it was old or what to bad I would have kept ordering",
      "rating": 1.0,
      "verified": true,
      "author": "lulu",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Mascara I received was dried up",
      "text": "I ordered 2 of these mascaras.. 1 was dried up.. so that is why I rated low quality. I have never ordered this product through Amazon before, but usually I love this mascara.. doubt if I order again thru here.. There is a No Return Policy on makeup.. so you are taking a chance..",
      "rating": 3.0,
      "verified": true,
      "author": "Chey",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Gentle to your lashes",
      "text": "Really love this product! Long last thru day! Gives depth, volume, fullness!! The best brand I’ve ever used!",
      "rating": 5.0,
      "verified": true,
      "author": "Thru my eyes!!!",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Clumpy",
      "text": "It was thick and clumpy the first time I opened it. Seemed to be old",
      "rating": 1.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Doesn't come off!",
      "text": "It's impossible to get off, will not come off with make up wipes. I had so many eye lashes come out because of it. I'm afraid to use it agian!",
      "rating": 2.0,
      "verified": true,
      "author": "KayCe",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Good Product",
      "text": "I love this product. The wand is great for applying. However, the most recent one I bought seems dry and a little old. Watch your dates before you throw out the box",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn Cartagine",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Smears under eyes",
      "text": "This mascara smears under eyes and comes in a very small tube, a little larger than a sample size",
      "rating": 1.0,
      "verified": true,
      "author": "Danice",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Love this product",
      "text": "I can work out at the gym hard core and my mascara is still perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Lita Singh",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Sexy lashes",
      "text": "Love this mascara! Makes my lashes look thick and full. Definitely waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Yuck",
      "text": "Clumpiest mascara I have ever used. Will not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "stacey s chaney",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Very Clumpy",
      "text": "The mascara is very clumpy and FR from waterproof. I gauge my mascara on how long it stays on. This did not even last until noon and looked like I had been out all night partying.",
      "rating": 3.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Pay for quality",
      "text": "First time trying this product and I love it. Still expensive for my taste, but I’d say so far it’s worth the extra money.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Hanna",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Love it!",
      "text": "Great mascara- very wet and heavy for the first few uses - and expensive but well worth it after first few uses !",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "The Best-Finally!",
      "text": "Truly works! It’s about time I found 1 that really works! No more searching and paying for poor quality of others!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisamari Pena",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Easy to apply and waterproof.",
      "text": "First time using the waterproof version. Bought it for a funeral and it worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Product received was not the same as advertised",
      "text": "Barely any mascara came out on the brush and when I applied more then one coat it clumped my lashes together and added no length. I purchased the sample size to see if it was worth buying the large size because of all the great things I had heard online but I'm glad I didn't now",
      "rating": 1.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Love it",
      "text": "Waterproof isn’t a joke! Make sure you have babyoil or makeup remover to get it off. Really great coverage and color.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180707
    },
    {
      "title": "Waterproof not waterproof",
      "text": "This product came highly recommended. However, the waterproof mascara, is not waterproof. Pretty disappointed about that, but satisfied with it in all other aspects. Unfortunately because its not waterproof, it was a waste of money and I will not be buying it again.",
      "rating": 2.0,
      "verified": true,
      "author": "T Jones",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Loved it!",
      "text": "Love the brush! I did use primer with it so I think that really helped the volume. My roommate also got one. She agreed with me! I will buy the large size when this runs out",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi C.",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "PERFECT",
      "text": "All time favorite mascara!!! Bought this travel one because I don’t need waterproof often, but this gets the perfect amount!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicoya Hall",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Favorite!!",
      "text": "Since I first used it 3 years ago, I will not use any other brand. Too faced mascara is awesome! Lasts through sleeping & a shower!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca West",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Branding on Point",
      "text": "After rave reviews from my sister-in-law, I decided to give “Better Than $ex” a go, although I was dubious of their name claim. Ladies, this mascara is MUCH better than a bad or even mediocre encounter so I dub the name is accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Verified Purchase- Southern US",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Expected greatness from the reviews but...",
      "text": "I didn’t care for the brush. It did not apply smooth and even. The mascara itself burned my eyes. There is something in the ingredients that did not agree with me.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda Cooper",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Didn’t work as expected.",
      "text": "It doesn’t stay on my eyelashes like waterproof mascara should.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Very Disappointed",
      "text": "I received this waterproof mascara and it seemed like it was dried out when I apply it to my eyelashes is almost a prickly feeling there is product inside but seems used",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Disappointed",
      "text": "While I liked the overall volume it gave to my lashes, it would run. By the end of the day, I had raccoon eyes. Not acceptable for a product at the cost.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "BEST MASCARA IN THE WORLD!",
      "text": "This is the best mascara on the market, period!...said this makeup guru.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Leaks color anyway",
      "text": "This product is not waterproof it stays on but somehow still leeks black it’s very weird",
      "rating": 1.0,
      "verified": true,
      "author": "Juliya M.",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Bought this for my Papa's funeral. I sobbed ALL day and it did not smudge.",
      "text": "Headline says it all. If you have some crying to do, this is the only mascara for you. Amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Historia ",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Too thick",
      "text": "It was way too thick and goopy. Didn’t use it.",
      "rating": 2.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Dried out",
      "text": "It was dried out!! I always heard good things about this mascara! Very disappointed, especially for it to be dried out!!",
      "rating": 1.0,
      "verified": true,
      "author": "Chelsia",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Didnt work for me.",
      "text": "Didnt stay on all day. It was very clumpy as well. Wouldn't purchase again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "invest in this product if you are looking for a long lasting waterproof mascara!",
      "text": "great product and works like magic ! definitely going to repurchase !",
      "rating": 5.0,
      "verified": true,
      "author": "katie",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "do not purchase!",
      "text": "the mascara is completely dried up can i can’t even use it. do not purchase, waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Brittanee",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Not my favorite",
      "text": "It was too chaulky and didn’t really give the look I was looking for. Not dark enough",
      "rating": 2.0,
      "verified": true,
      "author": "Alissa Panzieri",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "NOT waterproof!",
      "text": "This product is NOT waterproof at all or sweat resistant! Terribly disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "Stacy Kraft",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Disappointed",
      "text": "I love this mascara...but not this order. It was all dried up. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia baxter",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Scam",
      "text": "Do not buy this. It is a sample size but they make you pay full price.",
      "rating": 1.0,
      "verified": true,
      "author": "Laudrey Lamadieu",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Waste of Money",
      "text": "Ridiculously small for the money. What a waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "allyson rotan",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Brush",
      "text": "Not a huge fan of the brush. I feel like it’s too thick and can leave your lashes clumpy",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Definitely waterproof and the brush is great.",
      "text": "smaller than i expected, but i kind of prefer that because this brand tends to dry out quickly. The smaller it is the less i have to throw away because of how goopy the end gets. Definitely waterproof and the brush is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Priddy",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Not Better Than Sex but got the job done",
      "text": "Its worth the money. I used only 1 coat on top and bottom and I was satisfied my lashes looked extended with no clumps. I was proud to do my IGTV video after doing my make up. @sirentherocker for results Topic: Rich vs Broke",
      "rating": 5.0,
      "verified": true,
      "author": "Ceo",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "I was not impressed.",
      "text": "This mascara clumps so easily. I bought 2 at the time and I stuck with the other brand and I gave this one to my daughter. She loves it but walking around with clumpy eyelashes is not my thing.",
      "rating": 2.0,
      "verified": true,
      "author": "Wreck_Tangle",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "NOT Waterproof",
      "text": "I bought this product because I've heard people rave about this mascara... my experience with it wasn't great. This product claims to be waterproof, however, by the end of the day, I resembled a raccoon with dark circles under my eyes. If you don't mind that it's not waterproof, I'm sure it would work fine. If you're looking for actual waterproof mascara, I suggest looking elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "NIJ",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Thickens lashes",
      "text": "Nice thick mascara that goes on smoothly and instant thickens lashes. I don’t find my lashes much longer though. Doesn’t flake.",
      "rating": 4.0,
      "verified": true,
      "author": "Julia's Disciple",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "How to get compliments frequently",
      "text": "Great product. Very easy to use and is as described. Seems to get compliments about my eyes when wearing it. Will definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie T. Tomlinson",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Raccoon eyes",
      "text": "Product is really bad for people with dark eye circles. Does not work well with concealer or realty much of anything. Not impressed and won't purschase again",
      "rating": 1.0,
      "verified": true,
      "author": "Princess of quite a lot",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Its waterproof. Have a good eye makeup remover.",
      "text": "Love the non-waterproof so I got this for my wedding and it worked perfect. I definitely but it to the test!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Very nice",
      "text": "Really lengthens and thickens my lashes it is not better than sex, lol!",
      "rating": 5.0,
      "verified": true,
      "author": "BriggsGirl",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Must be an old bottle or something? Very very ...",
      "text": "Must be an old bottle or something? Very very clumpy and thick. I added some saline to it to thin it out but still clumpy. Had to order another from somewhere else.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Jamieson",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "User error? Unimpressed...",
      "text": "I saw this product presented on a You Tube video. I was not as impressed with it as the model who used it.",
      "rating": 3.0,
      "verified": true,
      "author": "J B",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Holy Grail",
      "text": "Love it!!! Works great even if your lashes aren’t curly. Best mascara EVER!",
      "rating": 5.0,
      "verified": true,
      "author": "Marie P",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Smudges easily",
      "text": "My lashes definitely look longer and fuller, however, it smudges very easily and I am constantly having to wipe under my eyes throughout the day. I won't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Bottle is half empty.",
      "text": "Work well! Lashes appear thicker and long. But bottle is only 25 percent full.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Does what its supposed to",
      "text": "I love this mascara. It really does make my eyelashes look longer .",
      "rating": 5.0,
      "verified": true,
      "author": "HoneyBeeGracious",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Five Stars",
      "text": "wife loves it and going to order more when this gets low.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Tidwell",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Dried out.",
      "text": "Too much money for the product to be dried out. Will update after I receive a new product.",
      "rating": 1.0,
      "verified": true,
      "author": "tameka hicks",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "The feel!",
      "text": "It's ok. I had better mascara than this. It cracks and flakes off",
      "rating": 3.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20180728
    }
  ],
  "product_meta": {
    "title": "Too Faced Better Than Sex Waterproof Mascara Black Mini 0.17 oz",
    "description": "Take this mini waterproof mascara with you everywhere and literally anywhere. Conveniently sized to fit in purse or pocket. Apply to lashes and reapply if needed.",
    "rating": 4.1,
    "feature_bullets": [
      "Buildable coverage",
      "Easy twist off applicator wand",
      "Perfect travel size for on the go",
      "All skin types",
      "Waterproof"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "5.9 x 3.2 x 1.2 inches; 0.8 Ounces",
      "UPC": "717936246357 717936246364",
      "ASIN": "B078919VBD",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Mascara",
      "Eyes",
      "Beauty & Personal Care"
    ],
    "price": 11.0
  }
}