{
  "website_summaries": [
    {
      "verdict": "A budget option that can hold and heat the small basics - and help you monitor your popcorn supply, thanks to Alexa.",
      "pros": [
        "Compact, 700-watt unit that's Amazon Alexa compatible",
        "Features 10 power levels, a kitchen timer, turntable and child lock",
        "Can fit a coffee cup, small plate, bag of popcorn and other small items"
      ],
      "cons": [
        "Not as powerful as some other microwaves in its class"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Whether you have a smart home or just love the latest technology, this microwave's ability to connect to Alexa is designed to impress. However, it won't work if you need a larger model.",
      "pros": [
        "Distances itself from the pack for being controllable by voice, as this smart appliance is compatible with Alexa through your Echo device",
        "Easy for most people with a little tech know-how to set up",
        "Small design saves space"
      ],
      "cons": [
        "The downside of the small interior space is that it won't work for preparing large amounts of food",
        "Only 700 watts of power",
        "Tends to cook a bit unevenly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Using your voice to control a microwave is a natural fit, and Amazon's competitive pricing essentially puts no premium on the Alexa-powered smarts. Even if you never use the voice commands, this microwave is a low-risk investment for one or two people in a smaller living space.",
      "pros": [
        "Alexa voice commands add some convenience and give you some additional hands-free time in the kitchen",
        "The popcorn replenishment feature is handy if you're really into popcorn",
        "Amazon says it can add and improve features via software update"
      ],
      "cons": [
        "You'll need to adjust recipes and settings for prepackaged food to account for the 700-watt power rating",
        "Some of the preset cooking commands via Alexa produce poor results"
      ],
      "aspects": {
        "Performance": 6.0,
        "Usability": 9.0,
        "Design": 8.0,
        "Features": 8.0
      },
      "publication_date": 20181114,
      "rating": 7.5,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good Small Microwave",
      "text": "This is a good small microwave for someone in an apartment.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert McMurrer",
      "helpful_votes": 730,
      "publication_date": 20181120
    },
    {
      "title": "Uneven heat",
      "text": "This microwave is not powerful and heats food evenly. Very low quality product. It is cool that it is voice activated with Alexa, but you need a product that actually works, you can't just add voice to a crappy product.",
      "rating": 1.0,
      "verified": true,
      "author": "J.N.",
      "helpful_votes": 628,
      "publication_date": 20181118
    },
    {
      "title": "Perfect for those visually impaired",
      "text": "My mother has Macular Degeneration Disease. This microwave is perfect for her. Since it is voice controlled with short simple commands she has no problems cooking the food. Being an \"echo\" owner, she is familiar with the voice commands. Prior to this type of microwave, she had many problems finding and pushing the correct buttons to prepare the food to the point that she wouldn't use the microwave. The voice activation has returned some autonomy for her!",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Schmidt",
      "helpful_votes": 317,
      "publication_date": 20181117
    },
    {
      "title": "Piece of junk.",
      "text": "After three minutes, my cold cup of water was warm at best. Food never gets hot. Shipping back today and buying a real microwave. Also, dimensions of the unit are completely wrong on the site. Cannot fit a standard dinner plate in the thing. Alexa, tell me to press 30 and then start on my microwave, cause I don’t need you doing that for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey A. Gayle",
      "helpful_votes": 141,
      "publication_date": 20181117
    },
    {
      "title": "Won't be found, bad as a regular microwave",
      "text": "The only reason to own this Amazon microwave is to show off to your friends with the voice control. Sadly it won't be found on the network or find on its own. So its just a microwave..... a job at which its adequate at best. The dimensions aren't correct & the heating power is weak for its advertise strength. All in all... its seems like a rushed product with bad connectivity problems.",
      "rating": 1.0,
      "verified": true,
      "author": "@IdeaJason",
      "helpful_votes": 127,
      "publication_date": 20181118
    },
    {
      "title": "Convenient",
      "text": "Just received it today. Size was what I expected it's a smaller microwave but I am able to place a large coffee cup inside. WiFi set up was super easy. I find it really convenient that I can tell Alexa to microwave for however long I need!",
      "rating": 5.0,
      "verified": true,
      "author": "Cac",
      "helpful_votes": 121,
      "publication_date": 20181116
    },
    {
      "title": "Ok for a microwave",
      "text": "As far as microwaves go it's not bad. The Alexa feature, however, is not exactly what I expected. Instead of having as built in mic to listen for commands, it uses your echo device to listen. Mine is in another room, so this feature is useless to me unless I buy another echo. Would've been nice to be able to use this feature standalone without having to use a separate echo device.",
      "rating": 3.0,
      "verified": true,
      "author": "Slesher",
      "helpful_votes": 100,
      "publication_date": 20181116
    },
    {
      "title": "Cheaply made and possibly rushed to market.  Replacement unit caught on fire.",
      "text": "Unfortunately this is not a great device. I've had it less than three weeks and three of the buttons are already popping through the flat plastic finish. I'll be returning this. UPDATE: While Amazon was great to work with and quickly sent a replacement unit, the replacement started on fire within a month - the fire was in the little panel on the inside of the microwave. I verified that the dish used said \"microwaveable\" on the bottom. I see that this particular kind of fire happened to other customers as well. I will be requesting a refund this time, not a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan M. Ott",
      "helpful_votes": 61,
      "publication_date": 20181208
    },
    {
      "title": "CAUTION! FIRE HAZARD!! Exploding appliance!!",
      "text": "This microwave has been barely used at all and today it caught fire, filling my apartment with smoke. There was just a bag of microwave popcorn in it. The Alexa feature never really worked but I didn't care about that...but this is just dangerous!!",
      "rating": 1.0,
      "verified": true,
      "author": "A. Michaud",
      "helpful_votes": 48,
      "publication_date": 20190513
    },
    {
      "title": "This is a miniature microwave  Beware of size",
      "text": "Received m/v and couldn't fit a regular dinner plate in it. a saucer plate would work and or a cup of coffee but a regular sized bag of popcorn would be pushing it. Not impress at all and sent it back the next day. FYI",
      "rating": 1.0,
      "verified": true,
      "author": "Don k",
      "helpful_votes": 45,
      "publication_date": 20181119
    },
    {
      "title": "It does not actually cook food",
      "text": "Such a crappy microwave. It has absolutely no power. Something that I cook regularly at work just fine takes literally 4 times longer in this microwave and still doesn't fully cook. The alexa integration is cool, but not cool enough to make up for not being able to actually cook your food. If you are looking for a giant expensive way to reorder popcorn, this is perfect for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Mic",
      "helpful_votes": 40,
      "publication_date": 20181123
    },
    {
      "title": "Only works with wifi.",
      "text": "I bought this for my 80+ parents. I liked it because it was small. I saw that it worked with Alexa, but figured we could just ignore that. Well, you should know that this only works when it’s connected to the wifi. That’s no good for old folks. I don’t need to talk to my microwave. We are returning this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 36,
      "publication_date": 20181202
    },
    {
      "title": "terrible",
      "text": "Refuses to be \"found.\" Can't even set the time without being connected. What a waste...",
      "rating": 1.0,
      "verified": true,
      "author": "P. M. Keating",
      "helpful_votes": 29,
      "publication_date": 20181118
    },
    {
      "title": "Perfect Guestroom Add-on",
      "text": "It’s all very Gene Roddenberry. Talking to the appliances. Actually, it’s a fun option. Perfect size for a guest room. Very easy setup/install. Just plug it in. Finds the WiFi connection through the Amazon connection; sets the clock. Identify the nearest ECHO device in the Amazon Echo App and the handshake quickly occurs without complications. So far works perfectly. For the current price, highly recommended gift season purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Simon Sez",
      "helpful_votes": 19,
      "publication_date": 20181116
    },
    {
      "title": "Great for Sparks and Danger",
      "text": "Fire hazard! Was melting butter in it yesterday and bright flashes of light started to emit from the microwave side! I took the cup out and inspected it for any stray metal and tried it again. More Sparks and flashes from the side (inside) of the microwave. It is black in that area now and looks slightly melted. I contacted Amazon and they won't replace even though I just purchased it a few months ago.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Mills",
      "helpful_votes": 12,
      "publication_date": 20191201
    },
    {
      "title": "Connect problems fixed",
      "text": "I can’t get it to connect. 😕 Here is an update 11/18/18. I had plugged the microwave into a surge protector. When I plugged it directly into the wall, it connected immediately. So now it works fine. No where did the directions give any clue what to do if it didn’t connect. I thought to try this and it worked. The microwave works very well with Alexa. I really like it. However, the microwave is on the small side and it took longer to microwave things then it did in my old microwave. I still like it and would recommend it. Please consider the size to make sure it suits your needs.",
      "rating": 4.0,
      "verified": true,
      "author": "SharonR",
      "helpful_votes": 12,
      "publication_date": 20181116
    },
    {
      "title": "Fire hazard🔥",
      "text": "Total safety hazard!!! Granted I’ve been using this item for about a year, I don’t use it daily and only use it for a minute or two max to reheat items. To my shock it started making some crazy noise, sparking and totally smoking like it was about to catch fire in all of about 7 seconds! I opened it and it was all smoky smelling... piece of junk! I’ve never had a problem with a microwave, I’ve had them for years never a problem... I cannot believe all of the reviews with the same problem. Very scary if you have kids home alone or elderly parents using this microwave ...total disappointment 😔",
      "rating": 1.0,
      "verified": true,
      "author": "sassy",
      "helpful_votes": 7,
      "publication_date": 20200625
    },
    {
      "title": "Good microwave but on the smaller side",
      "text": "My only complaint is the size. It is small bit it is not a deal breaker. It fits most our dishes except the dinner plates. I have used it for reheating coffee, cooking frozen vegetables and defrosting meat. It performed as it should.",
      "rating": 5.0,
      "verified": true,
      "author": "rangerand daisy",
      "helpful_votes": 12,
      "publication_date": 20181121
    },
    {
      "title": "I DON'T TRUST THIS MICROWAVE",
      "text": "Purchased this microwave. Used it normally heating up food. Didn't cook a turkey or anything in it. Noticed this today. Returning for refund. Another customer review said something about the inside panel catching fire. I believe it.",
      "rating": 1.0,
      "verified": true,
      "author": "ArmedMikeL",
      "helpful_votes": 9,
      "publication_date": 20191116
    },
    {
      "title": "It okay but not what I thought",
      "text": "Microwave works great. A little on the smaller side. That said I was expecting my children to be able to press the button and say warm up soup and Alexa would know how long to warm it up. She does not know how long to warm so she ask which is fine but defeats the purpose since my 5 1/2 year old can not read the directions on the soup can. Perhaps Alexa will learn this information as we keep using. Other than that I think it was a great buy at a very good price.",
      "rating": 4.0,
      "verified": true,
      "author": "Dnic95",
      "helpful_votes": 8,
      "publication_date": 20181116
    },
    {
      "title": "Rusty fire hazard",
      "text": "Okay so we've had this a few months. It's small. Like extra small for even a tiny microwave. Okay. We'll live. We noticed that it really wasn't cooking things great. Too cold too hot, all over the place. We started to notice condensation build up was insane. Like the thing would be dripping water inside. I bagan wiping it down after every use but didn't help. Included is a picture of what the entire top portion of this things is doing--cracking and rusting. Didn't even know a microwave could do that. Mine have always last year's so it's beyond disappointing this one lasted such a brief time. Fire hazard.",
      "rating": 1.0,
      "verified": true,
      "author": "Lionheart",
      "helpful_votes": 4,
      "publication_date": 20201011
    },
    {
      "title": "You Have to Have Alexa to Use This",
      "text": "I can't rate the performance at all. I was looking for a simple low-cost counter-top microwave. The description says this one works with Alexa, but it doesn't say that it won't work WITHOUT Alexa. You cannot even set the clock without Alexa, and I had no intention of buying Alexa just to run what I foolishly expected to be a simple, basic, low-cost microwave. As a result, I returned it as soon as I realized what I had gotten. I'm sure this is a bargain for anyone already having Alexa set up, but not if you don't.",
      "rating": 1.0,
      "verified": true,
      "author": "Peggy J. Hicks",
      "helpful_votes": 7,
      "publication_date": 20190607
    },
    {
      "title": "Can be very helpful to the disabled",
      "text": "When I first saw this my first thought was how lazy can people get. Then I thought about my sister who is losing her eye sight,so I got it for her. She is still using her older one and as not gave me any feedback on it as of yet. But I can see this being every every every helpful to anyone who can not use their hands well enough to push the smaller buttons but can still work the larger open door button on the oven. Or anyone that has trouble seeing like my sister.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 4,
      "publication_date": 20200904
    },
    {
      "title": "Amazon customer service is not helpful",
      "text": "I have other Amazon devices and it seems none of them can connect to this microwave. It states while trying to set it up that it needs an update. But the microwave won't connect to my devices. I called customer service and get tossed around from one person to another. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "jdrfez ",
      "helpful_votes": 7,
      "publication_date": 20181120
    },
    {
      "title": "This is stupid",
      "text": "Honestly I’m not sure what the point is. I’ve never been able to control the microwave with Alexa because of the door being closed for too long issue. It’s literally minutes between when Alexa is useful and when it is not. If I have to open the door every time why not just stand there and plug in the numbers myself? It’s so stupid. I can’t even put something in the microwave and walk away for more than 5 minutes and start it with Alexa. Other than the fact that there’s no point to an Alexa control feature it’s a fine microwave. Small.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Gallagher",
      "helpful_votes": 6,
      "publication_date": 20181209
    },
    {
      "title": "MICROWAVE CAUGHT FIRE!!!",
      "text": "We've owned this for over a year now and the microwave just caught fire! I heard a loud pop and there were flames coming from the side panel. Thank GOD that my kids weren't home alone using this faulty equipment. From reading reviews, it appears this is a big issue. AMAZON NEEDS TO FIX THIS!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Pandagirl",
      "helpful_votes": 4,
      "publication_date": 20200827
    },
    {
      "title": "Fire danger",
      "text": "I bought this is April 2020 and 6 months later it is junk. About 2 months in it would sometimes make a buzzing sound and flash and once it burned a spot on frozen muffin. I kept a close watch though, not leaving it alone for fear of fire. Several weeks ago a fire broke out inside it with flames and the food was just ashes. We moved it outside and opened all the windows but the house smelled for days. Scary. This happened with another little cheap microwave years ago but I thought they were better made now. I hate the danger and waste so I’m fine with reheating in the stove etc from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "PatriciaKathleen",
      "helpful_votes": 3,
      "publication_date": 20201011
    },
    {
      "title": "EXTREME SAFETY HAZARD",
      "text": "We bought this 1 year and 3 months ago. Just now we had it running and it began to spark like crazy. I unplugged it and searched for metal, first in what was being cooked then in the microwave itself...nothing. on further inspection i found the problem...the insanely thin coating between the inner chamber and metal housing had become warped and cracked! I have never seen this happen and im SO lucky we didnt set the microwave and walk away...the house would have burned down! Appliances such as this SHOULD have a longer shelf life... at least 3 or 4 years, this is terribly disappointing, as is the fact that amazons \"product support\" for this item ended last september.",
      "rating": 1.0,
      "verified": true,
      "author": "Owen T Ambrose",
      "helpful_votes": 2,
      "publication_date": 20200821
    },
    {
      "title": "Microwave started making a loud buzzing noise after a couple weeks or so",
      "text": "The microwave started off great, but after a couple weeks or so, the thing would start making a loud buzzing noise which freaked me out like I thought the thing was going to explode and the light inside started flickering on and off rapidly like crazy. Needless to say, I stopped the microwave after 15 seconds or so of that happening worrying something terrible was going to happen, opened the door, and saw smoke coming out the right side of the machine (the food had not been cooking very long and was still cold). Terrible microwave, terrible product. Save yourself time and worry and buy a better product.",
      "rating": 1.0,
      "verified": true,
      "author": "MechE",
      "helpful_votes": 4,
      "publication_date": 20191229
    },
    {
      "title": "Not a Fan",
      "text": "This microwave does not vent steam. If you don't leave the door open after using it the steam becomes a pool of water at the bottom and that can later turn into mold. Yum. The buttons are starting to peel off and I have only had the thing for about two months. You have to microwave everything about 5 minutes because it takes forever to get hot. I bought this mainly as just to have a microwave while I wait for my over the range microwave to be installed so I knew it wouldn't be the best but really didn't think it would be all that bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 4,
      "publication_date": 20190205
    },
    {
      "title": "Only worked for a year",
      "text": "We purchased this microwave on December 8, 2018 and used it successfully for nearly a year. On December 2, 2019 we heard a loud pop and saw a flame inside the microwave as we were melting butter. The microwave had died :( Amazon Customer Service was great, they issued a refund (minus an $8.00 restocking fee) and emailed me an address label so I could drop it off at UPS. I'm disappointed because it was cool to be able to tell Alexa to microwave something, but I expect appliances to last longer than a year, so I won't be buying another one.",
      "rating": 2.0,
      "verified": true,
      "author": "GCD",
      "helpful_votes": 3,
      "publication_date": 20191205
    },
    {
      "title": "Smaller than you think",
      "text": "I ordered this and didn't think to measure it out. This is half the size of my previous small microwave. Good for a coffee, or a bowl of soup. a plate won't even fit in here.",
      "rating": 2.0,
      "verified": true,
      "author": "L. Shepherd",
      "helpful_votes": 7,
      "publication_date": 20181119
    },
    {
      "title": "Nice addition",
      "text": "For me the Alexa touch is a necessity. I have problems due to a disability that will only get worse. This appliance aides me in being more self functioning. It microwaves the same as my old one really no difference. Yes occasionally Alexa and I argue when using a microwave command but that serves as great entertainment for compI look forward to future applieces that are Alexa enabled.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Naran",
      "helpful_votes": 4,
      "publication_date": 20181117
    },
    {
      "title": "Confusing, needless Alexis technology.",
      "text": "Its JUST supposed to be a microwave oven folks!! Not some NASA technology! I open the darn thing out of the box, it tells me something about Alexis!!! WTF??!! All I want to do is plug it in and heat up some food!! I don’t CARE about some stupid new technology that interferes with something that previous microwave ovens did easily. I literally threw this microwave on the sidewalk for the trash guys to pick up. I’ll go to Walmart and get a microwave oven that actually works.",
      "rating": 1.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 2,
      "publication_date": 20191213
    },
    {
      "title": "Perfect for an old guy like me",
      "text": "I’m an elderly widower who lives alone and has trouble reading the fine print on the buttons and symbols on the front of a conventional microwave. Now I just ask Alexa to work it all out for me. Nice lady, that Alexa. And smart too. She even resets the time automatically after the power goes out. One thing I don’t understand is why some folks are complaining that the unit is smaller than they expected. The size and power are clearly stated on Amazon. Maybe when they get older and wiser they will start noticing things like that before they order something.",
      "rating": 5.0,
      "verified": true,
      "author": "Vespertilianman",
      "helpful_votes": 2,
      "publication_date": 20191127
    },
    {
      "title": "COULDN'T BE EASIER TO SET UP",
      "text": "I absolutely love this microwave! My husband and I are both visually impaired, so I'm always hesitant when I buy something that needs to be paired with something else in order to get the full benefit of it. Sometimes, something on the screen needs to be entered which we can't see. There might be on-screen prompts or what-not. This microwave had none of that. It was a cinch to set up and works beautifully. It's not big, but for our purposes, I consider that a good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Morales",
      "helpful_votes": 3,
      "publication_date": 20181124
    },
    {
      "title": "Smart Life",
      "text": "First off, I love having a smart home. Alexa alone has made my life a lot more easier being a mom to two little ones. The first generation microwave is a bit small and only 700 watt; however it has already been much more helpful in the kitchen when I’m getting both babies food ready preparing other dishes at the same time. A simple Alexa button on the device allows me to conviently heat food by using my voice to heat up whatever I need while preparing something else at the same time. So far I’m digging it.",
      "rating": 4.0,
      "verified": true,
      "author": "Hobbit099",
      "helpful_votes": 3,
      "publication_date": 20181118
    },
    {
      "title": "Falling apart after 3 weeks",
      "text": "Extremely disappointed with this item. The start button is already peeling off after only 3 weeks of use. It is probably being used twice a day. Not sure if it's returnable. EDIT: within a few hours of writing this review I received a call from Amazon offering me the return of the unit. I accepted, and sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Juan Pelotas",
      "helpful_votes": 4,
      "publication_date": 20190531
    },
    {
      "title": "Didnt last 1 year, but decent before death",
      "text": "Microwave started sparking after 10 months. Unusable. Says there is 1 year warranty but it is not easy to find or place a claim. Sort of weak for a 700w microwave but it got the job done while it was alive. About 2:45 for a normal bag of popcorn. Unit looks small but interior space was never an issue. The Alexa button dosent make it work faster and you can spend more time speaking to Alexa than just pressing the buttons since most microwave uses are not that complicated. Also your Alexa needs to be in the kitchen to even make this button useful at all.",
      "rating": 1.0,
      "verified": true,
      "author": "EZF",
      "helpful_votes": 2,
      "publication_date": 20191021
    },
    {
      "title": "It's not all about Alexa",
      "text": "Cheapest microwave I could buy, so I did. I have nothing to say for the Alexa aspect other than it's not needed. The onboard sticker info and instructions are Alexa biased but it's so simple without that it's not important. Popcorn button is great as long as you only but the small portion bags. This microwave is small! I wanted small but it doesn't turn with my square plates and I can't use any dinner plate so far. We use salad plates which is a helpful psychology aid to portion satisfaction anyways. Win win. We are a Google house and I'm not about to be swayed by my microwave. LoL",
      "rating": 5.0,
      "verified": true,
      "author": "Lilred",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Yea. It Smells",
      "text": "This little guy was great for a few months. But now it just smell. It's actually unbearable. It smells like an old gym bag or something. I recently read about a possible fire hazard on the amazon microwaves so we're not taking chances. We've planned to throw it out for something else.",
      "rating": 1.0,
      "verified": true,
      "author": "RAB3",
      "helpful_votes": 3,
      "publication_date": 20201011
    },
    {
      "title": "condensation and a horrible stink",
      "text": "In less than four months, after very frequent cleanings of both the tray and the interiour surfaces, there is a horrible stink that I cannot get rid of. I think it is due to the considerable condensation that this thing produces it. I always cover my food. The inside produces SO MUCH WATER that I believe it is causing some rot in the vent holes that I cannot access. I only got this because it was small and inexpensive; I have no desire for Alexa to cook my popcorn. I wish I had spent a ilittle more money.",
      "rating": 1.0,
      "verified": true,
      "author": "Raven Creature",
      "helpful_votes": 2,
      "publication_date": 20190806
    },
    {
      "title": "Wouldn't buy again.",
      "text": "Well we've had it less than a year and it's toast. The tray doesn't revolve anymore. It's also a very weak microwave. I expect some weakness since it's smaller, but it's REALLY weak. Get what you pay for in this case... cheap price, cheap microwave. Size-wise it was perfect as I don't like a huge microwave sucking up space. But I'm very upset that the turntable stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Every",
      "helpful_votes": 2,
      "publication_date": 20191129
    },
    {
      "title": "Does not meet my expectation. UPDATE: Alexa is mute, and deaf",
      "text": "Now Alexa is mute, and deaf. My echos ignored it, and the button on this microwave is numb ( does not feel anything ). I was expecting Alexa to figure out time/minutes needed to microwave a frozen pizza, popcorn.. so on. I quest I was believing in Alexa so much, I was wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Lian",
      "helpful_votes": 4,
      "publication_date": 20181121
    },
    {
      "title": "Decent, Alexa wouldn’t work. Bad heating!",
      "text": "Updated review 3 months later Ok we wasted our money on this microwave. The Alexa functionality isn't great but it works. The worst part is that the microwave heats terribly, with popcorn it can somehow burn the bag but yet it cannot pop most of the kernels! I wish I could return this machine and buy a different one! Original Review ”Decent microwave for the price, I mean $60 bucks not many at this price point. Couldn’t get Alexa to connect for the life of me, probably tried twenty times using 30% of my phones battery.”",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff smith",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "Convenient in price and footprint but not a good investment.",
      "text": "Microwave is compact, seems durable and has great integration with Alexa, making it easy to use if both of your hands are busy cooking. The functionality, however, leaves something to be desired. The microwave, at first, would constantly overheat. I tried to relocate the microwave to see if things would change, they didn't. Recently the microwave gains a lot of condensation on the inside, which if left over night, formed mold. I keep a clean household, however, do not find it convenient to wipe down the microwave or leave door open to dry out after each use. Good price for what you get, however, I would make a bigger investment on a more consistent and quality appliance.",
      "rating": 2.0,
      "verified": true,
      "author": "C.M.",
      "helpful_votes": 2,
      "publication_date": 20201007
    },
    {
      "title": "December 2018: My second AmazonBasics Microwave:",
      "text": "I'm hoping I'll be able to return this microwave. Amazon helped me out with the first one I had which was faulty. This one I have given it a chance but it seems not to heat high enough. I'm not looking to make dinner in it of course but I cant even get fully cooked bacon crispy no matter how long I leave it in. Needless to say I'm disappointed. I really wanted it to work as I love all things Alexa. Hope I'm leaving this msg under the right platform. Please let me know about a return. Thanks.",
      "rating": 2.0,
      "verified": true,
      "author": "James Gunerard",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "Not safe!",
      "text": "I brought this Microwave for my dad on March 13. It came on March 15. It was smaller then expected. We had trouble connecting it with Alexa. My dad is totally blind and I thought this would be an awesome birthday gift. Anyways months later we still having trouble with connecting it to Alexa. Which does not matter anymore. This morning my dad was heating up a cup of water. The micowave started to make a funny noise and smell funny. My mom came into the kitchen to see sparks coming from the micowave. I am very thankful she was home because the damage could have been worse. I called amazon and they are giving me a full refund!",
      "rating": 1.0,
      "verified": true,
      "author": "bookworm101",
      "helpful_votes": 3,
      "publication_date": 20190710
    },
    {
      "title": "Avoid this mess of a microwave!",
      "text": "DO NOT BUY! I purchased this microwave a few months ago due to the Alexa integration and small space. It collects water condensation inside the top of the microwave! No matter what I hear up, water will pool inside the microwave. It has even rusted already after only 6 months. Plus, standing water in hot environments is a breeding ground for bugs! Gross! Plus, it retains smells. I am throwing this out today.",
      "rating": 1.0,
      "verified": true,
      "author": "Robyn Lee",
      "helpful_votes": 2,
      "publication_date": 20200106
    },
    {
      "title": "Doesn’t work",
      "text": "I bought this microwave because I’m on quarantine and can’t leave my room. It is so frustrating because it’s not working. The hassle of unboxing and reboxing the product for return upsets me. Of the thousands of people who bought good working ones, I have to be the unlucky one to get a bad one. It allowed me to heat one sandwich and I thought it was finally going to work but then that was it. That was all the life it had, I guess. It is frustrating that a simple microwave you wait a few days to get finally comes and then doesn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "steve2233",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Love my AmazonBasics Microwave",
      "text": "I have had an Alexa for a few years, but this is my first Smart appliance (though I use her with my Smart television and Amazon Firestick). So far I have used the reheat and defrost features and both have worked great. I told Alexa to defrost 10 ounces of bacon and she figured out the correct amount of time, defrosted the bacon, and had it ready to fry in a pan in minutes. This takes away the trial and error of the past. My AmazonBasics Microwave is going to be great for me, and since I name all of my appliances, I named him Chef Geoff!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi Bancroft",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Terrible Microwave",
      "text": "It's small so it seemed nice because where I put it, there is not a lot of space. Unfortunately, it should not be considered a microwave. It takes at least 2 minutes to warm coffee. Popcorn setting is 1.75 minutes so you can forget using that as it barely pops at all. Even at 4 minutes, the bag is not entirely popped. Very disappointed. Other Amazon products are much better. Buy any other brand instead of this one. You'll be happier. Wish I had sent this one back as it's pretty much useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharecat",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Worked fine until it started sparking.",
      "text": "It worked as it should for the first 7 months. In month 7, the microwave started sparking on occasion while in use producing a burnt spot on the inner right side of the microwave. I've never had a microwave start malfunctioning so quickly, hence the low rating. I expected better than that for a microwave, even a cheaper one. It should at least last a few years.",
      "rating": 2.0,
      "verified": true,
      "author": "Tigerlilly",
      "helpful_votes": 2,
      "publication_date": 20190914
    },
    {
      "title": "I recommend you keep looking..",
      "text": "This microwave has the hardest time heating up anything. Whether it be asparagus or a potato, it takes twice as long as any other microwave I have ever owned. I have also never had a microwave build up a huge amount of condensation inside after heating something up oh, so much that I have to use a rag to draw out all the moisture. The top of the microwave gets incredibly hot, so if you do end up getting one of these I highly recommend not putting anything on top that could be damaged.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Hawley",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Catches on fire, warranty is a joke.",
      "text": "Don't bother. It wont last more that a few months before it starts trying to catch on fire. And if you purchase the peotection plan, they literally do everything they can to not replace the stupid thing. It works great at first and amazon customer service is always friendly but there are so many hoops to jump through just to prove you bought something FROM THEM. its been a very frustrating week in regaurds to this piece of crap and its going to take at least another week before this mess is over. Its not worth the hassle.",
      "rating": 2.0,
      "verified": true,
      "author": "richan anderson",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Basic Microwave.",
      "text": "A simple and basic microwave. Cheap and works perfect for anyone who just needs a basic microwave. It is a very low wattage, food will take longer, so take that into account when purchasing this microwave. Alexa worked great, I believe I misread that it was useable ON the device so she didn't need to be RIGHT at the microwave. As far as I've gotten mine to work, they need to be in the same room. I really can recommend this for college dorms or small apartments.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer W.",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Save your money!!!",
      "text": "If I could give negative stars on this, I would. This is the 3rd one I’ve had and it’s done the same thing. Runs 5 seconds and quits. The first 2 at least lasted a little while. Not this one though. Just plugged it in, set it up and set the timer for 2 minutes. Hi start and it ran for literally 5 seconds and shut down. The only reason I replaced it twice was because of the protection plan I bought. I will say this, amazon does make returning these very easy.",
      "rating": 1.0,
      "verified": true,
      "author": "marc m.",
      "helpful_votes": 2,
      "publication_date": 20200826
    },
    {
      "title": "Spend your money on a better microwave",
      "text": "Bought for the size, needed something small to fit on top of the fridge to free up counter space. The Alexa features work great and it is simple to use however.... the microwave does not heat well and really holds in condensation. If I microwave say a breakfast sandwich for 2 minutes upon opening the microwave I’m presented with a rain shower. I have never had condensation issues with any microwave I have owned. Also things take double the recommended time to heat. I’m considering replacing the microwave after only a few months of use.",
      "rating": 1.0,
      "verified": true,
      "author": "JCHPDX",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Good basic microwave, but Alexa can have issues",
      "text": "I thought this microwave was great and would have recommended it, until Alexa feature stopped working and I can’t get it to work again. No big deal because the microwave still works and is simple and easy to use. When Alexa was connected and working it was very easy to just pop something in and say “Alexa microwave for 1 minute 30 seconds” and it would work. Pros -simple and easy to use -inexpensive -easy initial set up -adjustable power levels -Alexa feature is pretty cool Cons -personally had connectivity to Alexa issues - limited troubleshooting options",
      "rating": 3.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Worst customer service ever",
      "text": "UPDATE I’ve spent several thousand dollars as I buy EVERYTHING at Amazon. Have for years. So when this product failed so miserably, I asked Amazon for a credit of $50 to purchase another microwave. No response other than to walk me through resetting. I’m NOT taking a chance of an electrical fire! May 2019 Worst product I’ve ever bought Anywhere Ever! After one month, continuously fails to work! There is Event an electronic message I’ve never seen on any appliance. It’s says FAIL. Can’t find anywhere to report this. Have stopped using because I’m afraid of an electrical fire",
      "rating": 1.0,
      "verified": true,
      "author": "Anna F.",
      "helpful_votes": 3,
      "publication_date": 20190529
    },
    {
      "title": "Don't buy it!",
      "text": "This microwave is defective. It never connected to the Alexa app that was on my phone or tablet. It recently started making popping and cracking noises. The microwave still made the noise while it was EMPTY. I do not support purchasing this microwave since it may start a fire and conveniently broke after the return deadline. NEVER EVER AGAIN!",
      "rating": 1.0,
      "verified": true,
      "author": "Ralph J.",
      "helpful_votes": 2,
      "publication_date": 20200116
    },
    {
      "title": "the little microwave that could",
      "text": "I was sad moving into my new apartment and realizing it didn't come with a microwave. The counterspace in the kitchen isn't very tall from counter to under cabinet, so I needed to get a small enough one to fit that space. Saw this one had Alexa and pulled the trigger. It works remarkably well, and looks nice and has a clock. I thought the lower wattage would be an issue but it's really not a big deal. I'll update once my internet is turned on and I test Alexa, but as it stands it works great, looks clean, and heats up leftovers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Sparks with mircowave safe dishes or anything for that matter",
      "text": "Be careful, this products sparks and will catch fire if not closely monitored. I've nit had it long enough nor does it do major work. I'm truly disappointed. I was all too excited about the connection to Alexa. Bad choice. I had it less than a year before it started doing this.",
      "rating": 1.0,
      "verified": true,
      "author": "DJ Jackson",
      "helpful_votes": 2,
      "publication_date": 20200826
    },
    {
      "title": "You get what you pay for",
      "text": "Plugged the microwave in and it immediately connected to the WiFi. The clock automatically set itself. It was awesome. We’ve had it a little over 2 months and the WiFi no longer works. The clock says 00:00 all the time. Since it no longer shows a WiFi connection, Alexa no longer works. The microwave it small and still cooks so at least we can microwave. I could not find a reset. I unplugged the microwave for over 48 hours hoping maybe that would reset it. O’well.",
      "rating": 2.0,
      "verified": true,
      "author": "April M. Sandoval",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Don't bother",
      "text": "I let myself be fooled because this was an amazon product. I have not had this microwave for even one year and it has started to turn itself off when i heat things. The weird part is, the timer keeps going after it cuts itself off. So if I walk away from the microwave it's roulette on whether or not my food will be warm when I come back. Save your money and buy something that will at least last longer than a year.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 2,
      "publication_date": 20200113
    },
    {
      "title": "Run! Do not buy!",
      "text": "This is the most disappointing appliance I have every purchased fro amazon. My 700 watt Emerson microwave mdied afer five years. Bought it at Walmart for about $60. What cooked in four minutes, cooks in this POC FOR FIVE PLUS MINUTES. Sometimes, “d” comes up in the barely visible digital screen which means nothing, except that the simple command for two minutes cooking time is voided. Forget the the Echo and Alexa crap. Just want a basic microwave that heats, warms, cooks and gives me a cup of Joe, a snack or a meal. Stay very far away! Total crap!",
      "rating": 1.0,
      "verified": true,
      "author": "Gary Lucas",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Quit after 7 months of use",
      "text": "This appeared to be an excellent buy until today when the interior plate went with popping and quite a show of sparks. The unit is not useable now and I did not get the extra warranty....Thus I do not recommend. Update: Amazon contacted me to make good on the product. I did not realize it had a limited one year warranty and it went with the garbage. Even so, Amazon has refunded a part of the price of the microwave. Had I kept the microwave, I think Amazon would likely have replaced it.",
      "rating": 1.0,
      "verified": true,
      "author": "lola",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "I am Very satisfied with this product!",
      "text": "Easy to use. Small, but with enough space/room to warm up a plate or a cup of coffee. The Alexa button makes it stand out from the other Microwaves I have had. I had to reconfigure it or re-connect, because I upgraded my Internet service. At first I thought that Alexa was failing. Amazon offered help before making the return. They guided me through the right path. Now Alexa is back! Thank you guys.",
      "rating": 5.0,
      "verified": true,
      "author": "Heriberto Ibarra",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Caught on fire warming up coffee!",
      "text": "Well when I first got it I thought it was really small! But figured what the heck! Set up with Alexa was easy! Now about six weeks ago, I’m heating up my coffee and it caught on fire! Unplugged it and threw it in the trash! I had no real problem prior other than the size but not even a year old and it’s just me and I don’t microwave very much and usually is a minute warm up and usually my coffee in a microwave safe mug!",
      "rating": 1.0,
      "verified": true,
      "author": "Mary M3",
      "helpful_votes": 3,
      "publication_date": 20191124
    },
    {
      "title": "Expectations are Important",
      "text": "For all of the complaints that this doesn't perform like a heavy-duty microwave: guess what? It's not. This is a small, 700-watt microwave, and it acts like it. But, it acts like it WITH Echo integration. And that's what I like. I like being able to put something in the microwave, and turn to my next task speaking my instructions without having to wash and dry my hands to hit buttons. I like being able to use English sentences to reheat a cup of coffee or defrost 2 lbs of chicken. Most importantly, and what I believe is the VERY MOST undersold feature of this 1st generation mash-up product: NO BLINKING \"12:00\" AFTER A POWER FAILURE!!!!! WIN! WIN! WIN!",
      "rating": 5.0,
      "verified": true,
      "author": "regularg0nz0",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Frustrating so far.  And, when they say small, they mean SMALL!",
      "text": "Been 'playing' with this for a day now. By the time Alexa figures out what I'm asking her, I could manually input time myself MUCH quicker. BARELY fits a standard dinner plate. BUT, I got it for $68 with the DOT. I'll ride this learning curve and get some use out of it. It's fun to show off Alexa's tricks--even if it's a bit embarrassing at first because everyone so far has stared at me like, 'Really?! You could have just hit some buttons a LOT faster!'. I'm hopeful for the future of this technology, but needs some tweaking! Looking forward to the Super Bowl Ad tomorrow!",
      "rating": 4.0,
      "verified": true,
      "author": "CaponeandCompany",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Didn't work for me. Customer support couldn't help either.",
      "text": "For some reason, the setup for the microwave failed in the first step. I actually got a big FAIL show up on the LED screen. I have no idea why. It still works as a regular microwave, as far as I know, though. Customer support tried to reach me, but they sort of gave up on me. Stay away. Far away.",
      "rating": 1.0,
      "verified": true,
      "author": "William J. Callahan",
      "helpful_votes": 2,
      "publication_date": 20191004
    },
    {
      "title": "LOOK FOR SOMETHING ELSE. VERY LOW END.",
      "text": "Why waste technology on junk? I've only had this pint size microwave for 3 days and it's already making a strange noise. Heating is never consistent due to this being such a low end microwave. There are PLENTY of other microwaves for the same price or cheaper but because it said it was a AMAZON brand I expected quality. Far from it. It's so cheaply made I'm afraid to continue using it. SMH.",
      "rating": 2.0,
      "verified": true,
      "author": "B Aka",
      "helpful_votes": 2,
      "publication_date": 20200908
    },
    {
      "title": "Dont bother with this microwave",
      "text": "Super small (but I knew that when buying) Does not heat evenly. Near the light there is a piece of material built in (not hard material like the entire microwave and other microwaves I have owned have had this same piece I am talking about) this one has a burn mark on it so something clearly has happened in the usage that caused a piece of the microwave to burn. I have not used the Alexa capabilities to say how that works. I actually returned one and was shipped another free of charge and have the same exact issues as the 1st one. Normally, I like Amazon Basics but not this microwave, spend another $20-30 and get a better microwave.",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Pretty cool little microwave",
      "text": "We were not expecting much out of this microwave. We got it for the living room specifically for snacks for the kids and popcorn on movie night. It works very, very well for all that. There's not a single complaint I can come up with. I've tested it with other stuff just because I can... It does well if you remember it's a 700w microwave. I'm a tech nerd, so I thought it would be cool to have the Alexa feature, we actually use it a lot now. When the big microwave goes out, we'll probably look into replacing it with another Alexa enabled one. Hopefully they have a more powerful version by then.",
      "rating": 4.0,
      "verified": true,
      "author": "Vargr",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Microwave started sparking",
      "text": "I had this microwave for 1 year and 3 months. A couple of days ago the microwave started to spark when making popcorn. Yesterday I tried to reheat some food, and I had the same issue. This microwave has become a fire hazard. I got out my old microwave (at least several years old) and it worked well. The old microwave might be ugly, but it is relaible. I won't be buying another Amazon microwave again. I am so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Therese",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "It caught on fire",
      "text": "I didn’t really use the Alexa integration so I just gave it 5 stars. The microwave looks nice and fits into smaller spaces. However, I’ve had it for less than a year (didn’t use it for the first 6 months because it was in storage) and it’s started catching on fire. My fiancé went to microwave a small plastic bowl with some butter and it burst into flames on the inside. Not sure what happened. We haven’t put any kind of metal in it.",
      "rating": 1.0,
      "verified": true,
      "author": "Morgan Rae",
      "helpful_votes": 2,
      "publication_date": 20200826
    },
    {
      "title": "Don't you just love getting a shiny dented...",
      "text": "Can't stand when you start a new purchase and it comes dented right off the bat; already things aren't going to good(delivered by Amazon). Second the microwave seems to work, haven't tried it yet, wondering if there will be radiation leaking because of the dent lol. The Alexa integration was difficult, I'm guessing because my echo is in room next door. Even after connecting, seems that the microwave actually needs your Alexa device in order to process the command. In other words I thought that the microwave listened to your command, it's not, the echo had to listen to your command & send instruction to the microwave. Works, but awkward if echo device in other room",
      "rating": 1.0,
      "verified": true,
      "author": "Shark",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "DO NOT BUY",
      "text": "This microwave is TERRIBLE!! It has ONE job - to heat up food. Well let me tell you, this microwave isn’t smart enough to do that. After 40 mins of trying to heat up some rice, my daughter gave up and popped her food in the oven. Being small, and easy to use (including Alexa integration) doesn’t matter if the thing doesn’t work. It’s going back after only 1 night of “use.” I don’t know what the people who love it are talking about. Don’t buy it. Don’t buy it. Don’t buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Cy",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Stopped Responding to Alexa Devices",
      "text": "Worked great for a few weeks then stopped responding. Now the microwave cannot be found by the Alexa app after resetting and power unplugged per instructions. Purchased it for the voice remote. The only reason it didn't get one star is for being a decent microwave. Would have looked at other brands had I known the voice activation would fail.",
      "rating": 2.0,
      "verified": true,
      "author": "M D McCallum",
      "helpful_votes": 3,
      "publication_date": 20181218
    },
    {
      "title": "Didn't even last a year",
      "text": "I'm not sure what the expectation is for the life of a microwave but less than a year is not okay in my opinion. We pre-ordered this as soon as it was available as we love all our Alexa devices and use them constantly. The microwave is small but meets our needs perfectly. About a month ago we noticed it was very slow to warm things and today it took two and a half minutes to warm up half a cup of lukewarm coffee on full power. We wipe it down daily and keep it meticulously clean so it's not for lack of care on our part. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole Maki",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "The Alexa feature seems like a silly gimmick. I wanted a basic cheap microwave & this is that.",
      "text": "It's a good, basic microwave. Has the look and feel of the older basic GE microwaves- magnetic door lock, glass turntable, flat membrane controls and digital display. The 700W of power makes a standard microwave popcorn in just over 2 minutes without burning it, and can heat up a small plate of food in under 2 minutes. NOTE: It will only accommodate small plates, and round plates work best. Square plates tend to get bogged down while rotating and thus heating can be uneven.In short its a good microwave for the small dollars. Letting them cram Alexa into it is fine with me if it keeps the price low.",
      "rating": 4.0,
      "verified": true,
      "author": "Area Man",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great for people with limited vision",
      "text": "We bought one of these on sale, wondering if it would work as advertised. Yes, it does! With my eyesight getting worse with age and microwave ovens getting more complicated, this is perfect for me. I basically use it as I would any microwave oven but I don't have to press any buttons. Yes, that matters to someone with limited vision. Defrost two pounds of chicken? No problem. Just give the command and walk away. Reheat coffee, make popcorn, even cook frozen foods. BTW, we are running this via off-grid solar power. 2000 watt inverter and 400ah of batteries. It works like a champ!",
      "rating": 5.0,
      "verified": true,
      "author": "AuthorByNight",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Caught fire",
      "text": "Have owned this microwave for a year. Never loved it. Didn’t realize how small it was which is on me. Alexa integration never worked despite multiple attempts to set it up and Alexa claiming it was correctly set up. It didn’t heat foods super evenly. But today, the final nail in its coffin was that the interior right side of the microwave caught fire 15 seconds into normal operation!!!! Won’t be buying this model again.",
      "rating": 1.0,
      "verified": true,
      "author": "S. S.",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Does the trick for the price and frees counter space",
      "text": "I never knew I had so much counter space until replacing my massive Cuisinart with the AmazonBasics smaller model microwave. The excessively sized microwave is totally unnecessary. While this microwave is not as powerful and does not have the inverter capability. The savings you get on buying this microwave is more than one would save on the yearly electric bill due to the inverter many times over. It takes longer to cook items. I wouldn't dare put my salmon in this one, because it doesn't have as many features and capabilities, but in the end, I just need to pop my popcorn, prepare ramen, steam veggies, defrost, and warm.",
      "rating": 5.0,
      "verified": true,
      "author": "AY.",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Caught Fire - Not worth the cheap price",
      "text": "We had this for under a year and used it a normal amount. The small size was great but the Alexa integration stopped working within the first month. That is fine because the buttons still work but we used it last week to make instant oatmeal (was on for ~2 minutes) and it caught fire on the inside, melted a big bubble in the plastic on the side and melted the metal panel on the inside as well so it just crumbled on the inside. Definitely will not buy again since it is such a hazard. I don't recommend anyone purchase this.",
      "rating": 1.0,
      "verified": true,
      "author": "HT",
      "helpful_votes": 2,
      "publication_date": 20200623
    },
    {
      "title": "DON'T BUY | CAN CAUSE FIRE | TESTED BY ENGINEERS TO BE A HAZARD | LOOK UP ON GOOGLE",
      "text": "It started making noises, then started sparking.. I had to rush to turn in off. Purchased on 10/2019 with very limited use, started burning up and sparking Jun 2020. I contacted Amazon since I had insurance and received a replacement. Now I see my situation was not isolated, many people have had fire damage even when appliances are off. Now I'm afraid this microwave will start a fire. People are speaking up, CNN has done a personal investigation. I was surprised to see the same microwave with the same issue I had being tested, and how a fire hazard it is. No more Amazon Basics Products, Period.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "\"Ask Alexa\" button periodically but predictably and continually stops working.",
      "text": "And now, I go from 2 stars to 1, as the Ask Alexa continually fails and has to be reconnected, often taking as many as six attempts, and sometimes requires removing and reinstalling the device, and several times I've had to reset the router. What a pain. No good for people who don't know how to do this stuff - which is presumably the very people who want a microwave they can talk to, such as the person for whom this was purchased. I might add, this is the second amazon basics microwave I've had, both of which have had the same problem with the disconnected ask alexa button. Sheesh. Nice idea, but...",
      "rating": 1.0,
      "verified": true,
      "author": "Phil Rich",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Great product but read the description",
      "text": "Great product, provided you read the description and know that this is a small microwave. Integrates with Alexa for fun ;) but in actuality it cooks very well and has all the features you expect from a microwave with the addition of self setting clock (even after a power outage) I wish Amazon would provide even more integration with Alexa like an Alexa reminder when the food is ready or left in the microwave for an extended period of time, but those are tiny details that I hope Amazon will add from the server side anytime soon. In summary: a great product, works very well and I am happy with it. Good job, Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "duchski",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Stoppedm working and no warranty",
      "text": "This microwave stopped working today and amazon has made it impossible to contact them for warranty service. I will be purchasing things more local from now on. I was a good run, but eventually it catches up to them. Bye amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Aswaldo Diddles",
      "helpful_votes": 2,
      "publication_date": 20191205
    },
    {
      "title": "Electric hazard",
      "text": "Bought this last year cause we moved and needed a new microwave, bit small but worked well enough, didn't use the Echo integration all that often after setting it up, but a while back we noticed it stopped working with our echo dot, and now the microwave SHOCKS you if you touch the top or sides with your hands wet, I don't see any other reviews with this issue, so I'm guessing it could just be a one off, though I did see a couple that mention other electrical issues.",
      "rating": 1.0,
      "verified": true,
      "author": "Tbwulf",
      "helpful_votes": 3,
      "publication_date": 20190622
    },
    {
      "title": "Not for large families",
      "text": "This microwave was not a good fit for my large family. I bought it in July 2019 and I have already had to replace it. It wasn't large enough or powerful enough for us. There was always moisture on the inside after we used it and after awhile it smelled funky. Then it just died, 6 1/2 months after I bought it. I did love the Alexa integration for my husband who is blind in one eye and sometimes has trouble seeing buttons. It was very easy to use and very compact. However, if you have a big family and/or you are microwaving mac and cheese frequently I would stay away from this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Stacy Young",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Poorly designed interface",
      "text": "I don't like this microwave because a button doesn't activate on press, but on release. It's small things like this that kill a product. It is also difficult to set the time if the microwave isn't integrated with Alexa. A clock/time icon on the 5 button would have gone a long way... This is an immature product. Perhaps the next gen Amazon microwave will be better.",
      "rating": 2.0,
      "verified": true,
      "author": "Dean Cutlet",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great product for quadriplegic",
      "text": "I have a physical disability and this microwave is a godsend. It makes so much sense to have a product like this available for people who struggle physically to touch the buttons and the price point is great. I had a similarly sized microwave before this and the Amazon microwave cooks food much better. Just remember that it is 700 W and you have to adjust the time for the items to cook properly. As for the Alexa connection I had no problem hooking it up and there are no connection issues. The commands are easy such as Alexa microwave three minutes. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Harrigan",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Defective Item",
      "text": "This is not a review, this is a warning, FIRE HAZARD, my microwave almost caught fire while warming a dish, looking at feedback for this product I found that similar items had the same problem, there is a metallic sticker on the inside right wall, the metal part when exposed sparks like a fire cracker, I m very disappointed at Amazon and their brand products that had not have recalled this item, please investigate why so many customers have posted pictures of the same problem and we haven’t a courtesy notification from their part. Please be responsible.",
      "rating": 1.0,
      "verified": true,
      "author": "luis fajardo",
      "helpful_votes": 2,
      "publication_date": 20200619
    },
    {
      "title": "Not Made To Last",
      "text": "The microwave lasted only a little over a year. We bought it for the Alexa features, but never really used it. It was easier and faster to do all the commands yourself by punching in the minutes of cook time. These microwaves are not made to last. Ours literally blew up after just a little over a year. Not a microwave I would recommend until Amazon can perfect the product.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Haworth",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Caught fire!",
      "text": "My Amazon Alexa microwave oven worked fine for about two months, as I purchased it as part of the Black Friday sale. The other day, we were using it to defrost and it began to shoot flames into the center of the unit. Luckily, no product damage occurred, but I will be seeking some sort of reparations. USE AT YOUR OWN RISK people.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh Norberto",
      "helpful_votes": 3,
      "publication_date": 20200112
    },
    {
      "title": "Quick Winter Meals",
      "text": "While I haven't tried the Alexa integration (I'm just not big on giving verbal commands to technology--including my smartphone), this microwave works excellent as a microwave. Big enough to fit a normal sized dinner plate, it heats water for tea in.under two minutes. I bought it for on-the-go moments, when heating leftovers must be done quickly! For the price, it is a quality product. I really like using this microwave, and think it would be an excellent gift for any college student! In fact, I purchased this for use by my roommate who is a full-time student since she has very little down time!",
      "rating": 5.0,
      "verified": true,
      "author": "CCrystals121Top Contributor: Star Wars",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Great Apartment or Dorm Microwave",
      "text": "Microwave works great! I love how I don't have to reset the clock if the power goes out. Heats up food just like it should. Remember, this is a smaller 700 watt microwave so its perfect for 1 person, or an apartment or dorm room. Alexa works great with it, I do not like I have to say the actual weight of the item for some things, but I understand you have to do that so it knows how long to run. Overall though, great proof of concept and works great!",
      "rating": 4.0,
      "verified": true,
      "author": "smeltn",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Great!",
      "text": "I avoided buying a microwave for years just due to a lack of counter space, but this little one is perfect. Keep in mind larger plates and dishes might not fit inside, but most things do, and for my family it's plenty. I use the Alexa feature much more often than I expected. You still have to open the microwave door yourself so your there anyway, but it's nice to have a hand free, and no lie it's just kind of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Richy K",
      "helpful_votes": 0,
      "publication_date": 20200425
    }
  ],
  "product_meta": {
    "title": "AmazonBasics Microwave, Small, 0.7 Cu. Ft, 700W, Works with Alexa",
    "rating": 4.2,
    "feature_bullets": [
      "Now it’s easier to defrost vegetables, make popcorn, cook potatoes, and reheat rice. With an Echo device (not included), quick-cook voice presets and a simplified keypad let you just ask Alexa to start microwaving.",
      "Automatically reorder popcorn when you run low and save 10% on popcorn orders—enabled by Amazon Dash Replenishment technology",
      "Compact size saves counter space, plus 10 power levels, a kitchen timer, a child lock, and a turntable.",
      "Alexa is always getting smarter and adding new presets.",
      "External dimensions (Width x Height x Depth): 17.3 in. x 10.1 in. x 14.1 in. ; internal dimensions (10 7/8 in. x 6 7/8 in. x 10” in.); Turntable (Diameter): 10 in. ; Maximum Popcorn bag size: 3 oz"
    ],
    "categories": [
      "Amazon Devices"
    ],
    "price": 59.99,
    "specifications": {}
  }
}