{
  "website_summaries": [
    {
      "verdict": "A surprisingly healthy mix for the price, which excludes commonly added junk foods; and instead uses tastier and more nourishing bits of bananas, coconut, and blueberries that your bird will love.",
      "pros": [
        "Safflower, white millet, oats, red milo, wheat, and canary seeds are the first 6 ingredients",
        "No high-fat sunflower seeds or peanuts",
        "No artificial colors or preservatives",
        "Affordable"
      ],
      "cons": [
        "It would be convenient if this mix of cockatiel food was available in larger bag sizes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bugs",
      "text": "I ordered 2 bags and Itune for pellet - I open the bags and place them in sealed containers and place them in the freezer - one of the bags had bugs - very upset since I mixed the food so unfortunately the $21.00 bird food is wasted. Not happy very disappointed and unable to send back since I mixed them and cut the bags in order to put them in another container",
      "rating": 1.0,
      "verified": true,
      "author": "angela d",
      "helpful_votes": 6,
      "publication_date": 20190823
    },
    {
      "title": "My conures love it.",
      "text": "We have two conures and they both seem to really like this food. We initially got it to avoid the fatty sunflower seeds and peanuts, the birds seem happy and the vet says their healthy so we've stuck with it. The only thing about this being \"natural\" I don't think it's treated to kill the mouth larva, if you leave unused seed in the bottom of the cage you can get those little pantry moths. Just remember to keep the cage clean and dispose of the waste food accordingly and you'll be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Faster Tomorrow",
      "helpful_votes": 3,
      "publication_date": 20190427
    },
    {
      "title": "Good Product for Parrots",
      "text": "I have bought the Higgins Safflower Gold Natural Food Mix for Conures & Cockatiels in the past. My parrots love it and the two pack pricing was very reasonable. This particular product is hard to find other places. The main reason I buy this particular product is that it does not contain any peanuts or sunflower seeds which in excess are not good for parrots. I would recommend this product for any type of parrot.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank A",
      "helpful_votes": 2,
      "publication_date": 20190528
    },
    {
      "title": "The only food that I feed my babies.",
      "text": "I have two Quaker parrots and they like this food a lot. I gave it 4 stars because the price increased a lot from the last time I ordered.",
      "rating": 4.0,
      "verified": true,
      "author": "Luis Del Valle",
      "helpful_votes": 3,
      "publication_date": 20190306
    },
    {
      "title": "My picky parrot loves it!!!",
      "text": "My parrot can not get enough of this food! I love that it does not contain any sunflower seeds or peanuts as other foods do! She really loves this blend and I hope that they never stop making it, she is a very picky eater!!!",
      "rating": 5.0,
      "verified": true,
      "author": "SPA.1313",
      "helpful_votes": 2,
      "publication_date": 20180807
    },
    {
      "title": "For my Cockatiel, Quaker, Sun Conure, and Love Bird.",
      "text": "My birds love this seed. I’ve tried others but it’s all yuk. They eat this with veggie chop plopped on top with Mazuri Small Pellets on the side.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Thompson",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "My parrots love this!",
      "text": "I give this to my parrots, in addition to pellets and fresh fruits & veggies. It’s a special treat for them and the love it. I have ordered it several times. It has always been fresh. I keep it in a Rubbermaid container and have never had a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer K. R.",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "my birds love this",
      "text": "i have picky eaters and i was looking for a food for almost a year without sunflowers as they are bad for birds diet but i found this and my birds love it",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "quaker food",
      "text": "This is about the best food i have found for my quaker. he loves it. no waste. i supplement with baked chicken, vegies and fruit.",
      "rating": 5.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Not recommended by vet",
      "text": "My bird really likes the sea combination so that’s why am getting in at three but my vet said it is not very nutritious and that they pick out what they want and don’t eat all of the variety contained in the bag. That makes for a situation where they are deficient in certain vitamins. He highly recommends pellets and that is when I’m switching my bird too.",
      "rating": 3.0,
      "verified": true,
      "author": "Sushiyaya",
      "helpful_votes": 5,
      "publication_date": 20180918
    },
    {
      "title": "Skittles loves it",
      "text": "I don’t know about flavor but I know Skittles loves it and that’s al that matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Great product",
      "text": "It's a great value for the price and Charming loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Must buy!",
      "text": "This is a great buy. I spent $14.99 for one in a store, so I saved some money buying it on here. My parrotlets also love this kind.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "My parrot food",
      "text": "Well my parrot love this food. And since he is eating it, a lot new feathers are coming up. I'm happy with this food.",
      "rating": 5.0,
      "verified": true,
      "author": "Helia Miranda",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Packaging sliced wide open but still sent! Shameful!",
      "text": "Packaging, the bag came to me cut wide open, seed everywhere. I REFUSE to feed my birds tampered with product!",
      "rating": 1.0,
      "verified": true,
      "author": "Ginny Watts",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Supplemental variety in diet.",
      "text": "Bird treats. Just wish it didn't have sugared dried fruts.",
      "rating": 5.0,
      "verified": true,
      "author": "grace",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Terrible Birdseed",
      "text": "Awful, birds were not impressed. Now I have two feeders full of gunk and seedlings sprouts",
      "rating": 1.0,
      "verified": true,
      "author": "David P Milligan",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great product",
      "text": "Very happy so far. Product is as claimed and shipping was fast!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie Couture",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Good product, shipped quickly",
      "text": "I can't buy this locally and the conure loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "jill",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Will purchase again.",
      "text": "My love birds just love this food. I have purchased more than once. When you open the bag you can tell the freshness of the seeds. Great price and no sunflower seeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201120
    }
  ],
  "product_meta": {
    "title": "Higgins Safflower Gold Natural Food Mix for Conures & Cockatiels",
    "description": "Size:6 LBSSafflower Gold for Conures/Cockatiels is our gourmet, fortified, natural safflower seed blend. Safflower Gold does not contain artificial colors or preservatives and is free of sunflower seeds and peanuts. Plant-based DHA Omega-3 fatty acids are added to",
    "rating": 4.7,
    "feature_bullets": [
      "Enriched with DHA, balanced with Omega fatty acids as well as digestive probiotics",
      "No artificial colors or preservatives",
      "Gourmet bird seed blend offers more variety, nutrients and fun for your parrots"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "11.97 x 8.11 x 5.12 inches; 6.1 Pounds",
      "Date First Available": "December 18, 2017",
      "Manufacturer": "Higgins",
      "ASIN": "B078HF31KN",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Birds",
      "Pet Supplies",
      "Food"
    ],
    "price": 22.44
  }
}