{
  "website_summaries": [
    {
      "verdict": "A premium shorty wetsuit touted for its comfortable, breathable, and bendy neoprene material, warmth conservation, and lightweight design that is well-worth it if you’re going to be in the water all day.",
      "pros": [
        "Available in an impressive array of sizes to deliver the perfect fit",
        "Available in an array of colors",
        "High-performance fit",
        "Features a hidden key pocket",
        "Flexible design",
        "Neckline keeps water out"
      ],
      "cons": [
        "While O'Neill is a quality brand, this is a fairly expensive shorty wetsuit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "L = great fit (33 waist, 6'2\")",
      "text": "Hart to choose the right size, so to add a nugget of information: the Large is a great fit for my frame (6'2\" / 187cm, 165 pounds / 33 waist). Wouldn't want it any tighter (or looser).",
      "rating": 5.0,
      "verified": true,
      "author": "Groundhog Day",
      "helpful_votes": 52,
      "publication_date": 20121208
    },
    {
      "title": "Great quality, comfortable",
      "text": "I bought this for a Bahamas Cruise and some light snorkel and snuba excursions. Worked excellently and would highly recommend this. I don't plan on doing any deep or cold trips so the shortie worked perfectly. I am about 6\", 160lbs, 34' waist and a large fit me very well with some breathing room. Worked great while I was in the water. I had tried the medium too but I don't think their size chart is too accurate--I couldn't even squeeze into it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Mellon",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Perfect for swimming in colder water",
      "text": "I like to swim outdoors when I can so the water can be much colder than an indoor pool. I used the size chart and other reviewers comments to purchase mine and it fit perfectly. The 2mm wetsuit provides core warmth for swimming on colder days. The design allows for unrestricted movement for all types of water activities. I am really happy with this wetsuit and recommend it. UPDATE: Been using it for a month now and I have nothing but positive things to say. I have no problem swimming laps in it, no rashes, and no discomfort. The rubber lining at the edges prevent cold water from getting underneath. Truly an excellent spring suit. Worth every penny.",
      "rating": 4.0,
      "verified": true,
      "author": "BluesHawk707Top Contributor: Pokémon",
      "helpful_votes": 13,
      "publication_date": 20130707
    },
    {
      "title": "Except for the small of my back, I was fine",
      "text": "I wanted to see if I could swim in a pool that was too cold for me to swim in without a wetsuit. This suit did the trick. I cannot say it was totally comfortable. Cool/cold water kept sloshing around the small of my back. I am not sure if that's just the way wetsuits work or if I put the suit on wrong. But the cold was a far cry from having my whole body exposed and I swam for as long as I wanted. Obviously, I'm not a pro at this, but maybe you are not either.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Bob",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "SMELLS LIKE A SKUNK, and so will you if you wear it",
      "text": "This wetsuit STINKS horribly like a skunk! We tried washing it several times, and it still stinks. We ordered a replacement and it too stinks horribly. We have bought dozens of wet suits through the years that don't smell like this, so it is not the neoprene. Believe me, you do not want to buy this stinky thing...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170927
    },
    {
      "title": "Fits my Build well",
      "text": "Great quality. Just for the record here’s my build for those of you unsure about the size: I’m 5’9”, 205lbs. Bigger than normal thighs, carry my weight around waist, broad shoulders. Very forgiving. I was nervous about how it fit....I don’t look like those young skinny waisted Surf dudes. This suit is tight as a glove, but not uncomfortable. I have full range of motion.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel D. Cash",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Great quality for the price",
      "text": "It was $59 when I bought it, which was a steal. Great quality for the price. The fit was in line with O'Neill's other wetsuits. And I found it was perfect for those snorkeling days when you think the water's warm enough to go without a wetsuit, but you think you'll enjoy it a bit more with a wetsuit.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam In LA",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "Great fit",
      "text": "I am 5 - 10' , 215lbs. I have a long torso, inseam is 29\". I got the XL and it fits great, easy to get on and off. My wife really likes the way it looks as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie S.",
      "helpful_votes": 34,
      "publication_date": 20130608
    },
    {
      "title": "Info from the sizing chart was perfect for me I ordered and 3XL even though I'm ...",
      "text": "Info from the sizing chart was perfect for me I ordered and 3XL even though I'm only 5-10\" because that was the right size for me on the other dimensions. Was a little surprised that the label inside the suit said not for diving (bad on me for not researching more), but I read several reviews here saying people had used it for diving/SCUBA, so I just went with it. I've done 6 dives in the suite and have no complaints. I'm sure it would make a great suit for other activities as the freedom of movement and overall comfort are quite good.",
      "rating": 5.0,
      "verified": true,
      "author": "John Karnes",
      "helpful_votes": 2,
      "publication_date": 20160305
    },
    {
      "title": "great fit",
      "text": "I had bought a large from another company and to big, read your reviews one fella stated he was my size (medium) and how well it fit, hit the nail on the head fits great also easy to get off, will not be using it this year but march of next, will send report of how it works in water, PS I am 5/9 173 a little pouch but fit otherwise",
      "rating": 5.0,
      "verified": true,
      "author": "ken jelinek",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "O’Neill men’s large short wet suit",
      "text": "Bought this short sleeve wet suit for my ride on s jet ski from my recent cruise. I didn’t get to use it cause the jet ski excursion was cancelled. But I’ve tried it enough to know that although it’s tight, it offers the protection on the water I was looking for riding a jet ski. It appears to be well made and thin enough for a mild water temperature. Only time will tell how long it’ll last for my purpose use.",
      "rating": 5.0,
      "verified": true,
      "author": "obetsr51",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Good fit",
      "text": "This name brand wetsuit is nicely made. It fits a 30\" waist with 17\" shoulders perfectly. You want that airtight seal to keep you warm. My main issue is the packing of the wesuit wrinkled the neoprene. Neoprene has memory and once wrinkled, it will stay wrinkled, so folding it during packaging and shipping caused this problem.",
      "rating": 4.0,
      "verified": true,
      "author": "jmumv",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Tall sizes are great for tall men",
      "text": "Haven't yet worn in the water, but a review of sizing in case helpful to others. I am 6'4\", 190 lbs,, and a Large Tall fits me like a glove. Spot on sizing. Snug, as wetsuits are supposed to be, yet very comfortable. Not overly tight in the crotch as is often the case with brands that don't make tall sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "J Kraus",
      "helpful_votes": 2,
      "publication_date": 20180120
    },
    {
      "title": "Comfortable and well made",
      "text": "I never used these before, but decided to get one before our Hawaii trip, since water can get a bit chilly during winter. I felt perfectly comfortable in the water, basically, I could stay in the water indefinitely (I wish I could). It's well made, no pinching or comfort issues anywhere, including around the seams, zippers or neck strap, great design and quality. I am 6'1\" and around 195lbs, I got the XL size, and it fit like a glove.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Riva",
      "helpful_votes": 32,
      "publication_date": 20130225
    },
    {
      "title": "Good for 60F degrees and up",
      "text": "Good for 60F degrees and up....Wore it in Lake Huron in June and it was still in the mid-high 50s and wasn't too bad if you can take a bit of chill but if you are looking to be completely comfortable you might want to invest in something a bit thicker. Works great for what i need it for!",
      "rating": 4.0,
      "verified": true,
      "author": "Betsy",
      "helpful_votes": 2,
      "publication_date": 20160724
    },
    {
      "title": "It's not over yet!",
      "text": "Fits fine(XXL) except very tight in shoulders(5'10\", 215 lbs). And, I'm still navigating the back zipper and trying to get it up. My guess is that if O\"Neill would shorten the zipper ribbon even further no one would be able to zip it up without dislocating their shoulders. But, I will keep trying and see if I can get it by myself.",
      "rating": 3.0,
      "verified": true,
      "author": "cal",
      "helpful_votes": 3,
      "publication_date": 20160307
    },
    {
      "title": "Great shorty!",
      "text": "I'm 5'8\" and 190 and this fit perfectly. I ordered the XL Short. Having a 44\" chest and short it is impossible to find stuff that fits right. Large or XL is always too long or big. This fits me perfectly and did great in the surf!",
      "rating": 5.0,
      "verified": true,
      "author": "Anacott",
      "helpful_votes": 2,
      "publication_date": 20180515
    },
    {
      "title": "I like O'Neil as I have always had good experiences with ...",
      "text": "I'm 5' 10\" and approximately 162 lbs and the medium size fits very well. I like O'Neil as I have always had good experiences with the quality of their products and this wet suite is certainly no different. The length of the arms and the length of the legs are appropriate for my measurements. If your'e looking at a shorty then you know what you are getting you self into with a wet suite of this 2mm thickness.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Good suit.  Order larger than you think you'll need",
      "text": "I'm 5'11\" and 230 lbs with a muscular build. I ordered the 2XL and the 3XL... Both are a little tight around the neck and shoulders. The 2XL fits me snug around my legs and torso, feels good. The 3XL is pretty baggy around my midsection... I feel that it will take on a lot of water so I'm returning that one.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Prazen",
      "helpful_votes": 7,
      "publication_date": 20150804
    },
    {
      "title": "Fun and flirty",
      "text": "The medium was a little small on me (I'm 6', 180lb) but kept me warm for long days in Belize. The neoprene doesn't degrade (that much) and was perfectly comfortable to snorkel and dive in sans bathing suit. Would definitely recommend to a friend or anyone who's trying to be flirty.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer Dan",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "This brand runs a tiny bit wider under the arms ...",
      "text": "This brand runs a tiny bit wider under the arms than the other major brand, so it doesn't pinch. I got a Large-Tall. I'm 6-2, 173lb",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Great suit...order a size larger for this suit",
      "text": "This is a good wet suit. I've had very good luck with O'Neal suits. Everytime I try another brand I come back to O'Neal. I find that I needed a XXL with this particular suit when every other suit I'm an XL. So go up a size...or don't and return in after the first one is too small.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommywallbanger",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Excellent springsuit for jet skiing",
      "text": "I am quite pleased with this spring suit. I used to wear a Jet Pilot model for riding stand-up PWCs. The O'Neill is softer, more supple and just more comfortable to wear, even if it is not specifically designed for PWC use. I am 5'9\" and 160 lbs and the \"large\" fits me well. This is a quality bit of kit that I think will last for many years. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew McCarthy",
      "helpful_votes": 2,
      "publication_date": 20150726
    },
    {
      "title": "Men’s size XXL for 6’ man with 46 size jacket",
      "text": "Didn’t know what size to get. I’m 6’, 200lb with 46 in chest and 34 waist. Went on the larger size of XXL. Fits perfect. Also chose the option of getting one that was “reconditioned”. Looked new to me. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "wingsofgold",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Cant get smell out",
      "text": "The suit was fine but absolutely stinks and i can't get the smell out. Not only that but the smell sticks to whatever it touches. A real shame because suit is fine. I'd return this but I wore it once thinking that would get the smell out.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Pritchard",
      "helpful_votes": 2,
      "publication_date": 20171125
    },
    {
      "title": "the Oneil sizing chart is spot on!",
      "text": "OMG the Oneil sizing chart is spot on. My 15 year old spring suit barely made it over my knee caps....have put on a few pounds since then. Was skeptical to mail order but heard Oneil does it right and I have to agree. Fits perfectly and is working great to keep me warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott D.",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Go up a size",
      "text": "Large was too small for a 190 lb 5’11” man. Returning was very easy though. Delivery was prompt. Priced very well and seems very well made.",
      "rating": 4.0,
      "verified": true,
      "author": "LindaG",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Weird fit.",
      "text": "Arms are super long for a spring suit. I love the O'Neill brand and have been wearing their fullsuits for the past 20 years, but this one was not the best fit for me. At least it was priced low.",
      "rating": 2.0,
      "verified": true,
      "author": "GU",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great for Kitesurfing",
      "text": "Great shorty. Used the first one for a couple of years, then it got stolen and bought the same one again. I use it for kitesurfing in 78F and above weather. Anything colder I use my 4/3mm. And if its in the 50s I throw this shorty on top of the full suit and it works great :)",
      "rating": 5.0,
      "verified": true,
      "author": "GEC",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "Good enough for San Diego, but maybe not somewhere colder.",
      "text": "It works really well in cool, but not cold water. The zipper doesn't seal this suit as well as you might need in cold water, but the sizing is accurate. It's comfortable and easy to put on. It does everything I need it to.",
      "rating": 4.0,
      "verified": true,
      "author": "David L. Franck",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Excellent",
      "text": "I used this in Mozambique on a number of dive trips over a few months and it performed great. Good fit for the xtra large person and just warm enough at the bottom and for the ride out to dive and then back in to the beach. Am taking it with me to other spots as well as it is more than worth it to lug along for the fit and convenience.",
      "rating": 5.0,
      "verified": true,
      "author": "RayBey",
      "helpful_votes": 0,
      "publication_date": 20131012
    },
    {
      "title": "Didn't work for me",
      "text": "Tried several of the O'neill wet suits, even different sizes and none of them seem like a fit - one was tight in the armpits area, one was tight down below. Not manufacturer's fault, even thought O'neill fit perfectly for my kid.",
      "rating": 4.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Great shortie at reasonable price",
      "text": "Bought to swim in Wakiki in December and it was perfect. Fit well. Kept me warm without getting hot. Let me stay in the water 3 times longer than I could have otherwise",
      "rating": 5.0,
      "verified": true,
      "author": "T. Deyoung",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "good fit for men M",
      "text": "i'm 165-170. mostly fit except for a little beer gut. my pants are normally 30in and my shirts Medium. I bought a medium mens and it fits like a glove.",
      "rating": 5.0,
      "verified": true,
      "author": "ipn8bit",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Recommended:",
      "text": "Quality appears excellent. Can't tell how the performance rates as we can use it until the lakes are ready but the suit feels excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "TML",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Great suit",
      "text": "Great fit, and I like how it's stitched (I am 170 lbs and 6'). Easy to put on and take off. I have only used it a couple of times but couldn't be happier so far.",
      "rating": 5.0,
      "verified": true,
      "author": "esukseus",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Two Stars",
      "text": "Lower back panel is binding and the neck is to tight the rest fits alright.",
      "rating": 2.0,
      "verified": true,
      "author": "ben rhynsburger",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "... O'Neil wet suits in the family and they are superior quality and fit for us",
      "text": "We own several O'Neil wet suits in the family and they are superior quality and fit for us. This fit our sturdy built 13 year old boy perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "KF",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "great suit for use on spring break with the kids",
      "text": "Fit really well except tight aroung the knee. I purchased as a female, 5,5 132lbs as I coukdnt find a womens wetsuit that fit well. I have a longer torso. Otherwise, great suit for use on spring break with the kids.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda C.",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "5 star",
      "text": "5 star O'Neill and seller Peter Glenn Ski & Sport Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "gemstones",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "bought it to go to an indoor water park because I hate being cold",
      "text": "keeps you very warm, bought it to go to an indoor water park because I hate being cold.",
      "rating": 5.0,
      "verified": true,
      "author": "sharkcage",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "THEY ARE THE ONLY WEBSITE THAT CARRYS 4XXXXL AND BIGGER.",
      "text": "Thanks goodness a suit that fits big men 250 lbs give or take a few pounds THANKS",
      "rating": 5.0,
      "verified": true,
      "author": "Gemma",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Great wetsuit for spring time pool use",
      "text": "I purchased this wet suit to use during those early months of spring when summer swim league is starting up. This suit is not too hot to wear on the pool deck and keeps you warm when the pool is still cool in May and early June.",
      "rating": 5.0,
      "verified": true,
      "author": "TomC",
      "helpful_votes": 5,
      "publication_date": 20140604
    },
    {
      "title": "Happy with product",
      "text": "Fast shipping. Happy with product. 6-3 270 fits great. XXX-Large",
      "rating": 5.0,
      "verified": true,
      "author": "Frank M. Wirth",
      "helpful_votes": 6,
      "publication_date": 20141218
    },
    {
      "title": "Looks Great",
      "text": "Haven't had it in the water yet but as many reviewers say ... The size runs just a little to the small size. I am 6'1 and 200 pounds. I ordered the extra large and the fit is great but snug. The quality looks very good and the shipping was excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Newton",
      "helpful_votes": 6,
      "publication_date": 20131227
    },
    {
      "title": "ME LIKEY:)",
      "text": "i'm 6ft 180lbs with a very long torso. (i'm chinese) M tall did the trick. fits better than some custom wetsuits i have had made.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac C. Hou",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Poor quality",
      "text": "This isn't a quality suit. The zipper doesn't stay up and the seams starting unsowing only after 2 sessions. There's already a hole in the armpit area. Unfortunately, I missed my return window. I don't recommend this.",
      "rating": 2.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Comfortable, quality suit",
      "text": "Very nice, comfortable, lightweight suit. I enjoy wearing this as opposed to my full suit that is thicker and more restrictive feeling. Seems to be a quality suit that will last fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Good fit, kept me warm for snorkeling.",
      "text": "I am 6ft and 168lbs. Was a little snug, but a good fit and kept me warm for snorkeling and boogy-boarding in HI.",
      "rating": 5.0,
      "verified": true,
      "author": "SeattleRes",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Not so great...",
      "text": "Not only does it smell really bad, the zipper started coming unstitched after once use.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim McCormick",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Beautiful and High Quality Wetsuit",
      "text": "This wetsuit has made very high quality of material. I am 5ft10 and weight 177lbs and fit on size Large. I like it",
      "rating": 5.0,
      "verified": true,
      "author": "HENRY",
      "helpful_votes": 3,
      "publication_date": 20160623
    },
    {
      "title": "The XXXL is rad for fat dudes.",
      "text": "I'm a fat guy, 5'10\" 260 and the XXXL fits great. There is a little room but I definitely do not have any problems getting in or out.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul S GC",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Zipper broke, Amazon bailed",
      "text": "Good suit at a good price until Zipper broke on 3 wearing. Amazon bailed on the product - wouldn’t support it. Frustrated and disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret Feldmeth",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great suit",
      "text": "This suit fits me like a second skin. Nice seal at neck and knees. Padding around zipper is a little finicky. Very comfortable otherwise. I highly recommend this suit, it is the best I have found.",
      "rating": 5.0,
      "verified": true,
      "author": "aninonymous",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Perfect fit, looks good!",
      "text": "2X extra large fit me perfect at 6'3\" 220lbs. I've been using it for swimming in springs and lakes in Texas winter. Perfect for that, probably need something thicker if you're going for anything colder.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel ",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Perfect for a winter in Hawaii",
      "text": "This suit worked great for the warm ocean waters in Maui in January.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Busch",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Really great from June-August in the Northeast",
      "text": "I'm just learning how to surf, and because of that I spend a LOT of time in the water trying to practice. I found with the full wetsuit past June, I would be sweating by the 2nd or 3rd hour out. And without it, I would be freezing. This fills that need perfectly, plus (BIG plus), it's super easy to get in and out of at the beach, contrary to the full wetsuit. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "RNR",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "The fit was great and the performance was also great",
      "text": "Took this scuba diving in Mexico for a week. The fit was great and the performance was also great. I am 5 ft 8 inches, 180 lbs. and ordered an x-large. This suit forced me to add an additional 2 pounds of weight to by BCD (went from 18 to 20 lbs.).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Will be able to use my lap pool until December!",
      "text": "Works Great! The small amount of water that gets into the suit, creates a thermal barrier that keeps you warm! awesome quality and it lets you move freely! I am using it to swim in my lap pool during fall and it is working great! I think i'll be able to continue swimming all the way to December.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Villasenor",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Love my spring suit",
      "text": "I found this to be a great spring suit. I used it snorkeling in the Caribbean just off Belize. The water there isn't cold but isn't hot either. The suit made snorkeling more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Hiker1 Santa Fe",
      "helpful_votes": 0,
      "publication_date": 20150206
    },
    {
      "title": "It fits",
      "text": "It fit like expected. It did have an odor that most wetsuits don't have. Had to rinse and hang it outside for a few days.",
      "rating": 4.0,
      "verified": true,
      "author": "Reed ",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Make sure to order one size up!",
      "text": "Had to reorder in extra large despite being 5-10\", 175lbs. Great construction, now fits great. Have not water test yet.",
      "rating": 5.0,
      "verified": true,
      "author": "RK",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "the sizing was spot on - medium",
      "text": "This is good for cloudy day in warm water. Good for sun block and helps protect against abrasion other wise . When you need a little more heat in your core.",
      "rating": 5.0,
      "verified": true,
      "author": "robert massa",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "excellent product, quickly delivered at a reasonable price",
      "text": "snorkeling and surfing in both Hawaii and Southern California; can't wait to use it for the latter next summer!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel J. Price, Rev.",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "The suit worked as advertised and is great suit for the money",
      "text": "The suit worked as advertised and is great suit for the money. Can't comment on durability as I have only used it for the first weekend, but the fit and finish and zipper all seemed to be of good quality and the suit fit well.",
      "rating": 4.0,
      "verified": true,
      "author": "esquire1001",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Really nice wetsuit gear",
      "text": "Really nice wetsuit gear. Light enough for water sports, but seems durable. Bought two of them for our 19yo and 13yo to go jet skiing / tubing / etc. 19yo is 6'4\" - Tall size provided correct length. Seems true to size. May buy more...",
      "rating": 5.0,
      "verified": true,
      "author": "DMac Detroit ",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Fits and easy to put on and take off",
      "text": "Fits and easy to put on and take off. Can't wait to try it out on my next trip to the Caribbean.",
      "rating": 5.0,
      "verified": true,
      "author": "RobJeffDC",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Excellent value, well built",
      "text": "Great lightweight wetsuit for canyoneering - holds up well and is very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Apopleo",
      "helpful_votes": 2,
      "publication_date": 20140630
    },
    {
      "title": "perhaps even a tad snug (which is good! )",
      "text": "6'6\" 240lbs, the XXL fits well, perhaps even a tad snug (which is good!). Thank god I checked with other reviews first, as XL is usually fine for me. This should be a good bit of exposure protection while diving in the deeper tropical water, and on slightly cooler days in summer for water sports in Puget Sound.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Harder",
      "helpful_votes": 0,
      "publication_date": 20141128
    },
    {
      "title": "Great deal!",
      "text": "The wetsuit was true to the size measurements. The medium tall fit my tall but thin son perfectly! It arrived quickly and was well packaged. Great deal for the price. I used the O'Neill website for height and weight size determination. The wetsuit was true to what the website information had. A great wetsuit at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Salvadori",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Happy with purchase",
      "text": "Nice shorty wetsuit. Zipper lash needs to be about two inches longer or I need to be more flexible. After reading the reviews I went with a 2XL. I normally wear an XL Shirt. 5'11 and 225 works its way into this suit.",
      "rating": 5.0,
      "verified": true,
      "author": "therres",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "back in the game.....",
      "text": "I have not been out in the ocean for years, needed a wetsuit to teach my kid how to boogie board. After hours of wearing this suit- no rash, no seams cutting into me, no problems, no complaints.... hang loose brudda.",
      "rating": 5.0,
      "verified": true,
      "author": "TBOT",
      "helpful_votes": 0,
      "publication_date": 20140521
    },
    {
      "title": "fits perfect and was great in 70* water",
      "text": "I'm 6'2\" and 215 and got the 2xl... fits perfect and was great in 70* water. Used it a few times so far",
      "rating": 5.0,
      "verified": true,
      "author": "primered54",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Four Stars",
      "text": "A Little snug. Quality matches the price. Not incredible. Would buy again though.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve L.",
      "helpful_votes": 2,
      "publication_date": 20151027
    },
    {
      "title": "Great wetsuit. Very warm for southern Cal",
      "text": "Great wetsuit. Very warm for southern Cal, also for central Cal. Solid stitching and very comfortable. Good fit, too, and I followed the fitting chart.",
      "rating": 5.0,
      "verified": true,
      "author": "Duderonomy",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Great item. No problems with the size",
      "text": "Great item. No problems with the size. I just got one size bigger because I don't like the super snug fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Darin",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "great product. 4.5",
      "text": "A little itchy. Be careful when choosing a size. Mine fits well but wouldn't want it any tighter. Only one minor pulled thread after 5 uses.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam B",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "Husband loves it!",
      "text": "Bought this for my husband and he loves it! Uses it for east coast surfing. Fits him like a glove.",
      "rating": 5.0,
      "verified": true,
      "author": "Upstate NY lady",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Met all expectations",
      "text": "This is a well made suit and it helped keep me warm while snorkeling. The only drawback is that it does take a long time to dry",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Rose",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Three Stars",
      "text": "rear end part is way to tight and hard to take off if u need to take a leak",
      "rating": 3.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Five Stars",
      "text": "great fit. I'm 5'8 and about 220#, and this suit in XL is just right",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Quality Control ?",
      "text": "The wet suit fit was very good. The deep creases across the chest however make it appear as if it is a manufacturing defect or a used wetsuit! I may have to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "michael j. walsh",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Order 2size bigger",
      "text": "I am 510 210lb usually wear large clothes this one I have to go with xxl if possible order xxxl",
      "rating": 5.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Good deal!",
      "text": "Great price for a basic men's spring suit! Bought for a gift for my dad for waterskiing, so nothing thick required. It's just right.",
      "rating": 5.0,
      "verified": true,
      "author": "MJB",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Five Stars",
      "text": "Fits like a glove. Keeps me warm. Have a nice day.",
      "rating": 5.0,
      "verified": true,
      "author": "MDarb",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Five Stars",
      "text": "2XL-Fits perfect in chest/shoulders, a little loose in waist, pretty good in legs, been using a lot, very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Don E.",
      "helpful_votes": 0,
      "publication_date": 20140805
    },
    {
      "title": "Five Stars",
      "text": "Love it!! Looking forward to using again this spring. Great fit, nice product",
      "rating": 5.0,
      "verified": true,
      "author": "Russell Peck",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Size as expected",
      "text": "Look at the Oneil website to check for the sizes and it was right on the spot. Havent used it yet, waiting for a chance to go Scuba diving!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20130919
    },
    {
      "title": "Four Stars",
      "text": "Good quality overall- however some of the stitching has started to come out along the side.",
      "rating": 4.0,
      "verified": true,
      "author": "Charlie Mulligan",
      "helpful_votes": 0,
      "publication_date": 20150201
    },
    {
      "title": "Exactly As Advertised",
      "text": "The fit was as described in the fitting chart and the quality is what you'd expect from O'Neill. Perfect for those days when you don't need a full suit.",
      "rating": 5.0,
      "verified": true,
      "author": "The Dude",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Great shorty",
      "text": "Used it for a few dives in Belize a few weeks ago. Perfect for warm water diving in which you suddenly go below 70 ft and start feeling a bit of a chill.",
      "rating": 5.0,
      "verified": true,
      "author": "MrPsctt",
      "helpful_votes": 0,
      "publication_date": 20130525
    },
    {
      "title": "LOVE IT.",
      "text": "I love it. Fit perfectly, worked perfectly. Next up is a full body version!",
      "rating": 5.0,
      "verified": true,
      "author": "JKR",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "O'Neil wetsuit",
      "text": "The wetsuit fits my husband just right. He likes the fit and quality of the suit. I would recommend this suit.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Wellman",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Perfect fit.",
      "text": "Arrived promptly. Worked very well for a Dominican Republic dive. Perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Alaska-Island",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "SIZE, SIZE, SIZE",
      "text": "Okay, this appears to be a well made, lightweight wet suit. However, my husband is XL and so, after reading the reviews and their comments about size, I figured it would be best to order him XXL. As it happens, he can only just fit into it ... I should have ordered XXXL. There is one other thing I would mention. This wet suit zips up at the back. It is therefore impossible to get in or out of this wetsuit without assistance. This was not something I considered when picking this wetsuit.",
      "rating": 4.0,
      "verified": true,
      "author": "Ana Marie Gonzales",
      "helpful_votes": 2,
      "publication_date": 20151108
    },
    {
      "title": "works better than i surf",
      "text": "as advertised, the science of wet suits allows more flexibility with less mass.",
      "rating": 5.0,
      "verified": true,
      "author": "Stony",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Good for tropical and subtropical zones",
      "text": "Very well made wet suite. Good for tropical and subtropical zones.",
      "rating": 5.0,
      "verified": true,
      "author": "Mubrapon",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "Runs a smaller size so buy one larger.",
      "text": "Runs a smaller size so buy one larger. Also bought for warm water diving and it says not intended for diving",
      "rating": 3.0,
      "verified": true,
      "author": "Hg",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Love this wetsuit!",
      "text": "Love this wetsuit! I would recommend it to anyone! Fits just right and is toasty warm. Soft and flexible as well. Get one for yourself!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "Five Stars",
      "text": "I love this suit for use in uncold temperatures. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocco J",
      "helpful_votes": 0,
      "publication_date": 20140904
    }
  ],
  "product_meta": {
    "title": "O'Neill Men's Reactor 2mm Back Zip Spring Wetsuit",
    "description": "The O'Neill reactor spring suit is a highly technical, warm water full wetsuit. Get a full se of performance technology at an incredible price. The reactor series utilizes our exclusive fluid flex in the shoulder and sleeves, a fully adjustable super seal neck, and Krypto knee pads. The O'Neill reactor utilizes O'Neill exclusive fluid flex in the shoulders and half-sleeves to keep you mobile and comfortable for hours of fun on the water.",
    "rating": 4.4,
    "feature_bullets": [
      "2mm FluidFlex (tm)/Fluid Foam",
      "Single Superseal Neck",
      "Flatloc Construction",
      "Back Zipper"
    ],
    "categories": [
      "Diving & Snorkeling",
      "Outdoor Recreation",
      "Wetsuits",
      "Sports & Outdoors",
      "Diving Suits",
      "Clothing, Shoes & Jewelry",
      "Full Suits",
      "Water Sports"
    ],
    "price": 44.97,
    "specifications": {}
  }
}