{
  "website_summaries": [
    {
      "verdict": "Despite a few noted stitch and sizing issues, these socks offer notable performance and are a great choice if you need 2 pairs.",
      "pros": [
        "Colorful designs",
        "Unisex sizing",
        "Mid-calf design",
        "Waterproof yet warm and breathable",
        "Suitable for almost any activity – from skiing to hiking to running and more",
        "2 pairs"
      ],
      "cons": [
        "Sizes often run too small or too large",
        "Stitching occasionally comes loose with normal wear"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The best socks",
      "text": "Best socks we have ever purchased. They were worth every penny, and we originally thought they were over priced. My husband ran the 24 hour Spartan Ultra World Championship in Iceland, which was in brutal conditions. These socks kept his feet comfortable and warm through 20 straight hours of running in the snow/wind through the iclandic mountains. He was totally impressed and commented a lot about how much he loved the socks. We would purchase again if need be. Thanks for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Keri Fox",
      "helpful_votes": 14,
      "publication_date": 20181210
    },
    {
      "title": "My feet were warm and comfortably dry throughout my run",
      "text": "I wore a pair yesterday for the first time. The fit was loose, but not so much that I had any concerns while running. I ran for almost 2 hrs on frozen ground, in the wind, and it was never above 20 F (-6 C). I did wear a very thin nylon sock liner with it. My feet were warm and comfortably dry throughout my run. Normally, on a run this cold, my feet would be numb with cold and just pounding it out. I'll try them out with my xc ski boots, next. I'm expecting good things.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave S",
      "helpful_votes": 13,
      "publication_date": 20180115
    },
    {
      "title": "Must Have if You Work Outdoors!",
      "text": "If you have boots that are no longer water resistant these socks are life savers! I wear a cotton sock under mine, and my feet rarely sweat so that is not an issue I encounter with them as far as I can tell they breathe well. They keep my feet dry all day at work being outdoors against morning dew, puddles, rain, etc. The knee high ones keep my legs dry also when its pouring rain and my pants are soaked much easier to get through the work day.",
      "rating": 5.0,
      "verified": true,
      "author": "KittenBitten",
      "helpful_votes": 10,
      "publication_date": 20180816
    },
    {
      "title": "Unbelievably amazing! Great buy!",
      "text": "I of course was skeptical about these socks. Because how can they be waterproof right!? Well my brothers in the navy and they make them march in even the pouring rain and they step through puddles. And they do this for hours. He would show us his feet in video calls. And I was worried about his feet being wet for so long. So I thought I’d try these out for him. He video called us and was so impressed with these socks! He was so thankful! His boots were filled with water but his feet were not wet AT ALL! I couldn’t believe it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jme",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Keeping Dog's Leg Dry",
      "text": "Bought this pair of socks for a dog with a wrap on her foot and lower leg that needs to stay dry. She leaves the sock alone far longer than a plastic e-collar or a fabric e-collar, and it stretches on better than dog booties. Also very durable. Fitting will depend on some luck, since your vet's wrap may vary. Liked them so well we bought some for humans to use, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Meggie",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Not actually 100% Waterproof.",
      "text": "These socks are interesting. I took them creek hiking, and they actually held up! I was literally in the creek for the whole 7 mile hike and they kept my feet pretty dry, that was until water got in over the top, then they were useless. However if you don't plan to be getting into deep water, these work perfectly. I also recommend wearing thin sock liners with these, because the inside isn't the most breathable, and the liners help. The biggest problem is that when the inside gets wet, they stay pretty wet. For the price, these socks are pretty great!",
      "rating": 4.0,
      "verified": true,
      "author": "Nikole Brasch",
      "helpful_votes": 2,
      "publication_date": 20181019
    },
    {
      "title": "Yeah WATERPROOF!!!",
      "text": "I bought the socks for trail running in winter. I was struggling to keep my feet warm and dry running through freezing cold puddles of mud and snow. I wore these and my feet were warm and waterproof the entire time. I would highly recommend these. I did not have waterproof trail shoes but I could use these socks and I kept my feet dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20190117
    },
    {
      "title": "Great for camping in the rain!",
      "text": "Cannot write enough about how much I love these socks. I took them camping in a northern Arizona pine forest, and in addition to keeping my feet bone dry (even during monsoon season), nothing from the forest floor stuck to my feet. I mean *nothing*. I am used to spending a min or two dusting off my wool socks before I get into my tent, but with these, I could easily walk around the camp site with no shoes then get straight into my tent, bringing nothing with me. I was leery of the price at first but I’m definitely going to buy a few more pairs before my next camping trip. These were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Hudson",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Definitely waterproof",
      "text": "The socks were purchased to keep my feet dry while working in wet weather since my work boots aren't waterproof. the exterior of the socks got wet, feels soaked and holds water on the outer layer only. The inside stays dry and warm. Your feet do not feel sweaty and are breathable. the material feels somewhat of a wetsuit a surfer would wear. I tested the socks on feet while standing in bathtub of water for 5 mins. Incredible. complaints and highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "James Horner",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "They really work!",
      "text": "My husband works in the oilfield in all kinds of weather. We have spent $200+ on boots that claim to be waterproof and for a couple of months are, but the first real rain, my husband would come home with soaking wet feet. These socks are an answer to prayer. The insides of his boots are wet, but his feet stay dry!! Thank you for an amazing product!! I have bought more for my dad and brother!",
      "rating": 5.0,
      "verified": true,
      "author": "J. D. Kincheloe",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Really useful!",
      "text": "Put them on and got right in the tub. Worked to keep the water out! The fabric does get wet but not through all layers to your skin. Would recommend and absolutely buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 3,
      "publication_date": 20180727
    },
    {
      "title": "These work great. Have used others in past but they were ...",
      "text": "These work great. Have used others in past but they were tight and no room. These feel soft and warm inside, slight elastic stretch feel on outside. Have used in snow and find that othey work well as a medium weight insulator. Just layer if need more heat without sweaty or wet feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "N",
      "text": "Feel kinda like neoprene covered in sock material but very well made, stylish, and waterproof in the tub. They weren't too bulky in my shoes and flexible. Just don't know if they breathe as advertised as I haven't hiked strenuously enough to get sweaty feet. But will take to Camino",
      "rating": 5.0,
      "verified": true,
      "author": "Amac",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Best Disney Socks Ever!",
      "text": "In Florida, it rains every day at 1pm. When you're out in the park, stepping in puddles, it is no fun with wet feet. I used to take a spare set of socks in a ziplock bag with me, but now I just wear these. I can stand in 6\" of water and my feet don't get wet at all! I highly recommend these to anyone who has to deal with wet weather. I do wish they came in regular colors, though. These gray ones aren't too bad, but I don't really want my socks to be the brightest thing I'm wearing. Still worth five stars because they work and feel great!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "HE LOVES THEM",
      "text": "I have never seen someone so excited about socks. I gave these to my boyfriend for work and his face LIT UP, he threw one on his foot, ran to the bathroom, stuck his foot in the sink and turned on the water and yelled 'HOLY SH** BABY THEY WORK!!\" I felt the socks after and they were completely dry. Best. Purchase. Ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Mumbach",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great product!",
      "text": "My boyfriend loves these for the winter. He works outdoors and any warmth/water resistance he can get he will take. I wore them outside after it had rained just to test them out; and no rain came through what so ever.",
      "rating": 5.0,
      "verified": true,
      "author": "kelsea.",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Water resistant, not waterproof",
      "text": "6 miles in light rain all was well, super warm and dry. 31 miles in nonstop slogging mud and they did a decent job. Kept out major water but did ultimately allow my feet to get wet. Overall still happy with them. Maybe just a tad large but mostly true to size. They are not super tight and stretchy - more like an over sock.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "My feet stay dry and don't sweat",
      "text": "I needed waterproof socks for my work boots. I water an acre of plants every other day. These socks ARE waterproof and my feet don't sweat. They seemed pricey but they aren't like normal socks. They are sturdy. I don't expect them to wear out anytime soon.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Dwyer",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Saved my trip and my feet!",
      "text": "Took on trip to Madagascar during rainy season, saved the day, week, and my feet! These are so much better than the old seal skins, actually fit and feel like socks. Get a little damp from sweat, but much better than using baggies in wet boots! Worth every cent AND good looking, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne E. Carpenter",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Too big for average female foot",
      "text": "Nice idea but the small size was way too big for my female feet. I wear a 7.5 in street shoes and a 8.5 in running shoes. There is no way that my feet in these socks would fit in my hiking shoes. It wasn't the length of them as much as it was the width that was too big.",
      "rating": 3.0,
      "verified": true,
      "author": "CarolH",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Nice waterproof socks",
      "text": "Like it very much. I bought it for my son for the obstacle race. The socks keep his feet at least dry throughout the mud ride. Even the shoes are completely soaked with mud. Very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 2,
      "publication_date": 20180910
    },
    {
      "title": "Warm feet!",
      "text": "Used for road cycling on a winter day. 40 degrees? Feet were way warmer than using my wool socks. I plan on using with trail runners for hiking and was pleasantly surprised that i can also use on my bicycle rides. Good product and green grey color is very nice looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Zombro",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "AMAZING",
      "text": "Read the size and it matches what it says! I almost bought bigger couldn’t believe I was a size small. Wore them at a mud run and they were AMAZING",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree stang",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Great for hiking & wet winter trails",
      "text": "I wear liner toe socks underneath them for toe chaffing reasons (I’m a long distance trail runner). But my liner socks are always sweaty but not soaked. My feet aren’t covered in mud. My socks are two years old and going strong.",
      "rating": 4.0,
      "verified": true,
      "author": "Pearl",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Great Item",
      "text": "These are some of the best socks that I have worn. I am very active as a soccer coach and the field is always wet. With these socks I have no issue. I now wear them on hikes and hunting. Great socks.",
      "rating": 5.0,
      "verified": true,
      "author": "6KBSTay",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Waterproof for only a week of use.",
      "text": "I work outside and come into contact with water on a regular basis. I thought these sock would be a great investment to keep my feet dry throughout the work day, but after a week of use, they were no longer waterproof and instead would allow the water to come in the sock and stay trapped in the interior of the sock as I wore it.",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren Granger",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Good product",
      "text": "I gave this product as a gift to my daughter and son-in-law. So far they have not said any disagreeable issues with this product. I am sure it will serve its purpose for them when they are snowshoeing this winter. Thank you",
      "rating": 4.0,
      "verified": true,
      "author": "Dana L",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Good for wet climates",
      "text": "Got these for a friend doing fieldwork in Indonesia and she said she liked them",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "It is not for summer",
      "text": "It looks good and it is real waterproof, but it is hot on it and thus it is not for summer as it was claimed.",
      "rating": 4.0,
      "verified": true,
      "author": "Onethurd",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "He loves them and I'm very glad I came across this product",
      "text": "My dad works in pool construction and would always get his feet wet, I always make sure he packs a couple of these when he travels far. He loves them and I'm very glad I came across this product. This is definitely waterproof, and according to him allows his feet to breath as well.",
      "rating": 5.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Excellent socks for hiking",
      "text": "These were perfect for our hike during the winter at Havasupai, AZ. We had hiked through mud and water which was mid way up our hiking shoes. Our shoes got wet but our feet stayed dry. If you plan on hiking in inclement weather, get them.",
      "rating": 5.0,
      "verified": true,
      "author": "Dual citizen",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "dry feet",
      "text": "I work in a dish room at a college, lots of water on floor, MY FEET STAY DRY..",
      "rating": 5.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Bulky",
      "text": "Too bulky to wear shoes over. I wear them for winter kayaking and they are not quite warm enough. Going to try layering socks underneath.",
      "rating": 3.0,
      "verified": true,
      "author": "Employee #427",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Cozy",
      "text": "Love these comfy socks especially in the fall and winter.",
      "rating": 5.0,
      "verified": true,
      "author": "angeleyes",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Awesome",
      "text": "Bought them for my husband who is a UPS driver and they keep his feet dry even on the rainiest day when his boots are completely soaked through.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "DONT SUBMERGE FOOT WITH THESE",
      "text": "Submerged my foot into water and it was waterproof for about 10 seconds before my entire foot was soaked. FYI. Purchased for the polar plunge.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Got these for my fiance who works in a kitchen ...",
      "text": "Got these for my fiance who works in a kitchen and always had wet feet after he was done working. Even working all day in the hot kitchen his feet stay dry!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Keeps my feet dry!",
      "text": "My ASICS have air vents but wearing the Randy Sun socks keeps the moisture off my feet. Great for walks early in the morning after rain or heavy dew. I am very pleased with them & plan to buy another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Burton",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "RANDY SUN Men Knee Length Ultralite Waterproof Socks",
      "text": "4/22/2017 Great sturdy socks, air breathable but waterproof. Chased a friend's dog into a shallow body of water and my feet remained dry (can't say the same thing for my pants legs). Suggested washing instructions: wash twice, inside and out, drying twice. Medium high wash, medium dry. Sturdy, very comfortable (wearing them now @work), comes in a variety of neato nutty colors. RECOMMEND: Buy a few (I did).",
      "rating": 5.0,
      "verified": true,
      "author": "Allen NakagawaTop Contributor: Camping",
      "helpful_votes": 8,
      "publication_date": 20170422
    },
    {
      "title": "Warm",
      "text": "Kept my feet warm sitting in the stand hunting! Nothing like sweaty cold feet in your boots for hours, but these kept everything toasty. Worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "xaghce",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Only good if you want dry feet",
      "text": "I’m in the Florida national Guard and let me tell you, not a lot can make trudging through a swamp more comfortable, but being knee deep in green water with dry feet is a pretty good feeling. They work very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Required name",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Dry feet through a 32 mile snowy, slushy hike!",
      "text": "These are a little big, but i wore socks underneath. They really protected my feet through 32 miles of snow, puddles and slush.",
      "rating": 5.0,
      "verified": true,
      "author": "victoria adams",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Excellent",
      "text": "Just be careful how you wash and dry them! Accidentally turned a pair of my husbands socks into mine....",
      "rating": 5.0,
      "verified": true,
      "author": "Spring K.",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "They are waterproof",
      "text": "I love these I am going to get some for my kids too. They are great for Washington beaches that are never warm.... I usually wear then with a pair of woolbsocks and they still fit in my shoes!",
      "rating": 4.0,
      "verified": true,
      "author": "S.pony",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Just ok",
      "text": "They are very difficult to get off after sweating in them.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike prete",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "This is truly waterproof. I purchased them to use ...",
      "text": "This is truly waterproof. I purchased them to use for gardening. It keeps my feet and lower legs dry. I have washed them several times and they have so far maintained their integrity and grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Re-design please",
      "text": "The seem goes down the center of the sock. Like awkward sandals. Hopefully I can get past how uncomfortable they are.",
      "rating": 3.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Great product",
      "text": "My son works outside & this winter has been very snowy & wet.....these socks have been a great addition to his cold weather wardrobe!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Highly recommend!!",
      "text": "Greatly waterproof!!! Feet stayed warm and dry the whole time during our hiking and camping trip. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Waterproof!",
      "text": "I took them to Iceland with me and I'm glad I did! You can also wear them on top of regular socks and I didn't feel cold in my feet",
      "rating": 5.0,
      "verified": true,
      "author": "Chuska",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Definitely not waterproof",
      "text": "I used these socks on a hike during which I had to wade through sections of a river. They quickly filled up with water and when I took them off at the end of the hike, the tip of the sock was like a balloon filled with water. Maybe they're water resistant, but fully submerging your feet for more than a few moments is more than the sock can take.",
      "rating": 3.0,
      "verified": true,
      "author": "Magda Michalowicz",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Comfortable",
      "text": "They are a good fit. Price was good and the colors are fun. Bought a pair for myself and for my husband. We have only tired them on, haven’t tested them in a creek crossing yet.",
      "rating": 5.0,
      "verified": true,
      "author": "raebaby88",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Kept my feet dry",
      "text": "Bought these for a girl scout trip I was going on with my daughter's troop. Sure enough, it rained like crazy. Wore these socks with breathable running shoes. Feet stayed dry and the shoes dried out overnight. The socks run a little large so I was able to wear small athletic socks underneath. It also helped that my running shoes are on the large side as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeepsue",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Water resistant",
      "text": "Was waterproof until i was submerged then the whole sock got soaked",
      "rating": 4.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Great",
      "text": "YES! they are great for our very rainy walks. Feet totally dry!",
      "rating": 5.0,
      "verified": true,
      "author": "colleen smith",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Best Socks for Hiking",
      "text": "Keeps you dry and doesn't sweat your feet. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Kiser",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "They’re very comfortable.",
      "text": "Really liked the fit and my feet didn’t perspire in warm weather. I haven’t had a chance to test if they’re 100% waterproof but definitely feel like they’ll be perfect for a trip to Iceland in August.",
      "rating": 5.0,
      "verified": true,
      "author": "Yo Momma",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Worked!",
      "text": "Worked crossing ankle high stream without wet feet. Were comfortable as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas CoffeyTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "I never wore waterproof socks before, it's kind of ...",
      "text": "I never wore waterproof socks before, it's kind of odd feeling wearing stiff socks. It's for sure a bit bigger, not snug on the feet.",
      "rating": 4.0,
      "verified": true,
      "author": "Stinky",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Good product",
      "text": "Very efficient at keeping my feet dry! I am a size 10 and the large was a little tight but I’m glad my feet weren’t wet!",
      "rating": 4.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "These work well.",
      "text": "Warm, dry comfortable and easy to get on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "carpenter",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Review",
      "text": "work as stated. Is there a 1/2 sock with a non slip bottom? Would be perfect for boaters.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Gordon",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Wonderful socks",
      "text": "LOVE THESE. Work 12 hour shifts at a factory and they keep my feet dry the entire time",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Arnett",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Really waterproof!",
      "text": "Husband complained about his feet getting wet at work so I bought these to try out. They work wonderfully! He has bragged on them since he first wore them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Oyler",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "So worth it",
      "text": "AMAZING SOCKS. I buy these every Christmas and with being worn every single day they last until the following Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "william",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Great Socks warm and dry",
      "text": "Keep feet warm and dry, not too thick for normal shoes. I coach soccer in the wet cold winter season, theses socks are great. I will be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Clavier",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Perfect pair of waterproof socks",
      "text": "Fits perfect and keeps my feet dry. I live in a country and walk 10 miles a day on the wet grass and this pair of socks keeps my feet dry. I really love it .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Actually waterproof",
      "text": "My husband wears them all the time and they’re actually waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabetha Sadolsky",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "These are functional but still very comfortable",
      "text": "These are great socks. Did a creek crossing in my mesh-top hikers, and my feet stayed dry and warm. They are comfortable socks, and while you might expect your feet to sweat in waterproof socks on long hikes, they don't!",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Five Stars",
      "text": "These are spectacular! we use them for hiking and skiing and the haven't failed us!!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Great for keeping your feet dry!",
      "text": "These were perfect - absolutely 100% waterproof - thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S. Kroeger",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Great waterproof socks.",
      "text": "Used these socks on a long day of hiking in wet conditions worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Keeps his feet dry and comfortable.",
      "text": "MY husband loves these socks. Keeps his feet dry and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Taylor",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Truly Waterproof",
      "text": "My husband loves these socks. They keep his feet dry and warm. After washing, they do take a day to dry thoroughly, so plan ahead!",
      "rating": 5.0,
      "verified": true,
      "author": "fischy61",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Great socks",
      "text": "I wore these socks on a Spartan Race in the mud and snow and they kept my feet dry! Will definitely use again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Works great!",
      "text": "Great! Will def buy these for the rest of my fam",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Comfortable too!",
      "text": "Used during paintball where we played in damp grass and crossing creeks! Inside of boots got wet but never soaked through the socks! Comfortable too!",
      "rating": 4.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "waterproof worked",
      "text": "seems to run a bit big but worked for what i needed",
      "rating": 5.0,
      "verified": true,
      "author": "EB",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Not heavy duty",
      "text": "Worked well for about 2 weeks then stitching in sock ripped",
      "rating": 2.0,
      "verified": true,
      "author": "Jacob Snyder-scipio",
      "helpful_votes": 3,
      "publication_date": 20180131
    },
    {
      "title": "Excellent product!",
      "text": "LOVE these socks! I was skeptical about them being waterproof but I've hiked thru streams, puddles and mud and my feet stay dry. The 3-layer construction does make the sock really thick so I'll buy shoes a half size larger for best comfort. AWESOME product! Gonna buy my wife a pair...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    }
  ],
  "product_meta": {
    "title": "100% Waterproof Hiking Socks, [SGS Certified] RANDY SUN Unisex Ventilated Breathable Skiing Trekking Sock",
    "description": "RANDY SUN Men's Mid-Calf Waterproof & Highly Breathable Socks Athletic Socks.\n\nThe waterproof socks can make your feet enjoy freedom of movement all the time, and it is not only wind proof and water proof but also highly moisture and perspiration .\nIts special three layer design ingeniously solved the contradiction between water proofing property and air permeability.\n\nThe strong adhesive three layers structure can prevent the external water molecules into socks, meanwhile spread feet sweat during the movement quickly to the outside of the socks.\nEven in mountain climbing, hiking, running, outdoor cycling, water sports, snow sports, adventure, hunting, fishing, outdoor gardening and so on all kinds of bad environment, it could still keep your feet dry and comfortable. It is also a good choice to use as rain socks in rainy day.\n\nOur waterproof and breathable socks is the first choice for outdoor enthusiasts, as well as military personnel, postal personnel, even some special outdoor operation of protective equipment.\n100% seamless, comfortable, dry and warm, so our breathable and waterresistant socks also can be used for daily wearing, change daily beriberi due to the foot sweat and cold feed caused by bad warmth retention property footwear and so on all kinds of discomfort.\n\n\nSize:\nthe Extra Small size socks fit US men 5-7 and women 6-8;\nthe Small size socks fit US men 7.5-9.5 and women 8.5-11;\nthe Medium size socks fit US men 10-12.5 and women 11.5-13.5;\nthe Large size socks fit US men 13-15 and women 14-16.\n\nGuarantee\nWe stand behind our waterproof socks with a money back guarantee. If you are not happy with your socks, feel free to return them for a full and prompt refund. If you have questions about our waterproof socks, we would love to hear from you.",
    "rating": 4,
    "feature_bullets": [
      "Outer: 61% high waterproof nylon, 32% polyester, 7% elastane;Interlayer: a high performance lightweight function of waterproof and breathable membrane, Lining: 66% coolmax, 30% polyester,4% elastane",
      "☞ RANDY SUN’S DIFFERENCE☜ RANDY SUN Unisex Waterproof Hiking Skiing Socks is a new patent product that has been certified by SGS Corporation.100% Waterproof, 100% Inspection and 100% Seamless.",
      "FOUR SIZES: Extra Small Size - fit for US men 5-7 and US women 6-8; Small Size - fit for US men 7.5-9.5 and US women 8.5-11; Medium Size - fit for US men 10-12.5 and US women 11.5-13.5; Large Size - fit for US men 13-15 and US women 14-16. Please refer to images on the left for more detailed size information.",
      "Daily Wear,foot care,especially suitable for outdoor sports and activities of various kind of harsh environments",
      "Keep your feet dry and health.",
      "Ultra-light cushion sole provides comfort and great fit,suitable for biking,walking and running during warmer seasons when there is a need to keep dry feet",
      "Hand wash under normal temperature,water temperature should be below 40 degree centigrade if machine wash, do not iron, dry clean or tumble dry but hang to dry after spin-dry in ventilated place"
    ],
    "categories": [
      "Winter Sports",
      "Skiing",
      "Men",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Clothing, Shoes & Jewelry",
      "Clothing",
      "Socks"
    ],
    "price": 23.99,
    "specifications": {}
  }
}