{
  "website_summaries": [
    {
      "verdict": "The Asics Cael V8.0 is a wrestling trainer crafted to support nimbleness on the court. Its split-sole outsole provides the right amount of flexibility for natural movements without compromising the grip on the mat. It also has features that promote in-shoe comfort like collar padding and mesh panels.An overwhelming amount of people has given this pair a resoundingly positive review for its style and performance.",
      "pros": [
        "Almost all of the reviewers claim they did not experience any discomfort wearing the Asics Cael V8.0",
        "A majority of wrestlers are satisfied with the lateral and ankle support provided by this model",
        "According to many users, this wrestling shoe from Asics remains intact even after several seasons of use",
        "Based on the quality, numerous shoppers believe this trainer is worth the price",
        "The grip provided by the outsole surpasses the expectations of a lot of folks",
        "The use of light and flexible materials permit agile movements, says a good number of owners",
        "Multiple athletes commend the versatility of this footgear as it can also be used for boxing, mixed martial arts, weight training, and more",
        "The Cael V8.0 is described as smart-looking by plenty of buyers"
      ],
      "cons": [
        "A few testers note that the shoe requires a break-in period of several uses to achieve a comfortable fit",
        "One person didn’t like how easily this pair attracted dirt"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice shoes, but wrong picture in listing",
      "text": "Normally I wear a size 10, many reviews said these shoes run small, so I ordered a 10.5 and they fit perfect. Only issue I have is that the shoes I received do not match the pictures in the product listing. Pictures showed a red/blue/white shoe, and the shoes I received have far less red in them and might be a totally different model all together, based on the tongue. I still like these shoes though so I’m going to keep them, just be aware when buying for yourself.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 12,
      "publication_date": 20180928
    },
    {
      "title": "These run extremely small...",
      "text": "These will feel like a full size too small, but will stretch a half size after your first or second workout. Buy a half size larger than you wear. These are fantastic shoes and remind me of the Dan Gable Split Soles from the 80's. I'm old.....",
      "rating": 5.0,
      "verified": true,
      "author": "polaris1",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Ran small",
      "text": "Bought from my son. We have had to order all of his wrestling shoes and he is a size 10. This is a different styly but same brand wrestling shoe we get for him. Reviews I read recommended buying a size bigger since they run small. We stuck with the same size and it was 1/2 a size to big, possibly 1 full size. Very confusing but it was easy to return and get a half size down before his tournament.",
      "rating": 4.0,
      "verified": true,
      "author": "Dominica Lee",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "the will stretch to perfect comfort. My Son loves them",
      "text": "I read the reviews and ordered accordingly. Buy a half size larger than normal. They will still be a little tight. After wearing an hour or two, the will stretch to perfect comfort. My Son loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Talbot",
      "helpful_votes": 4,
      "publication_date": 20171205
    },
    {
      "title": "Great Shoes at a Great Price Fast Shipping - Order a Size Up",
      "text": "Someone walked off with my son's wrestling shoes at a home tournament when we were rolling up mats. I had 72 hours to get him a pair of new shoes and this place did it. Not only a great price for these high-end shoe's they made it to me in no time. There ASICS so not much to say there other than the best shoes out there! (Added) I was reading the other reviews and realized there were lots of comments about the size. We were replacing an ASICS shoe so we knew what to order. That being said ASICS traditionally runs a size smaller so order a size up!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Customers may need to purchase a size bigger",
      "text": "Great shoes and lightweight. I would say they are made somewhat small. I went up from full size from what I normally wear and they were still snug but I would imagine they will slowly fit more comfortable after a couple more wears.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180127
    },
    {
      "title": "These run really small",
      "text": "I bought these for my din while wrestles professionally, the run pretty small, had to send them back and get a size bigger. He says they feel comfortable although he has not wrestled in them yet....",
      "rating": 4.0,
      "verified": true,
      "author": "Sue C",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Does not fit wide feet",
      "text": "After reading reviews about wide feet they didn’t fit or “give” sizing is accurate but to small",
      "rating": 3.0,
      "verified": true,
      "author": "Robin B.",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Very Good wrestling shoes",
      "text": "We bought these for our son. He likes how the look and feel. Good quality shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Shan",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Very Comfortable",
      "text": "I'm flat footed and it's hard sometimes to find comfortable shoes that you actually like. This shoe is very comfortable. I HIGHLY recommend going one size up though. You will regret it if you don't.",
      "rating": 5.0,
      "verified": true,
      "author": "Lionel Walker",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Runs Small",
      "text": "Bought these shoes for wrestling. As a female I thought they ran a bit small but overall a good shoe once you figure out the right size.",
      "rating": 4.0,
      "verified": true,
      "author": "Lysmith2",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Narrow",
      "text": "Had the original version in 8.5. Had to get the 9 in this one and it’s still too narrow! Really wanted there to be good.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Fit my son like a glove",
      "text": "Only one on the mat with these shoes would have liked the Dan Gable model I thought I was getting but who can argue with Cale Sanders.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Groff",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Run small n narrow",
      "text": "I wear a 10 in every other shoe no problem these shoes Probably run a full size small hard to tell because they were so small and narrow Even without a sock on I could not even take a step in them i would recommend buying in store only to try on first for sizing not true to chart!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Fits WAY small",
      "text": "The 2-star rating is due to the fact that the shoes fit so small that I could barely get them on my feet. Otherwise, looks like a decent quality shoe. Also, returning them to Amazon from Canada was quite the ordeal; once I finally found the cheapest shipper I still lost money sending them back!",
      "rating": 2.0,
      "verified": true,
      "author": "Liz T",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Super comfortable and great quality!",
      "text": "We went a full size up ,as recommended by other and the fit was perfect! The quality, comfort and are super! I will update after a month or so of wearing for hours everyday wrestling as to the durability, but looking at the stitching, and placenta of stitches and the rubber soles they seem like they will last awhile!",
      "rating": 5.0,
      "verified": true,
      "author": "jesse",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I ordered the Cael Sanderson's but received the Dan Gable's",
      "text": "Fits small so buy a half size larger than your US shoe size. Not a good shoe for a wide foot. The arch support is good but if you have flat feet try the Asics Aggressor it has better overall support. These wrestling shoes have a good gripping sole and support my foot. I am happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "James L.",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "9. 5US everywhere is 43 europe but here it ...",
      "text": "9.5US everywhere is 43 europe but here it is 42. Too small",
      "rating": 3.0,
      "verified": true,
      "author": "Dmitriy Rostovskiy",
      "helpful_votes": 2,
      "publication_date": 20171117
    },
    {
      "title": "WAY TOO SMALL",
      "text": "The size 15 Dan Gable shoes are the same size as my old size 14 wrestling shoes which I don't fit into anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Butch Bobcat",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Sons Wrestling Shoes",
      "text": "Sons wrestling shoes. They are great. He likes them. Just wish I could have gotten a size .5 or one size larger. But they were not available. These are the ones he wanted. This is the second time ordering from Amazon for his wrestling shoes and he has Always been satisfied with them",
      "rating": 5.0,
      "verified": true,
      "author": "Connie N.",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Good for the price",
      "text": "It's better than the pair I had before, great grip and the ankle support is decent. Material on the front wears and fades after a while though.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Great fitting durable shoes.",
      "text": "Great fitting durable shoes. Use these almost daily for practice and they are holding up great.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Doblado Jr.",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great shoe, order a size bigger than normal",
      "text": "I had ordered and returned the shoe twice because fit was smaller than my usual. Shoe looks great and feels great only issue was the size but that's fixed now!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Marafioti",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Dan Gabel EVO’s",
      "text": "Great shoe always fits snugly at first but stretches out in a few days",
      "rating": 5.0,
      "verified": true,
      "author": "ABM",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "NOT Dan Gable EVO!",
      "text": "Beware! Picture and description are for the Dan Gable EVO, but they send you Cael V8.0. Still a good shoe but NOT as advertised!",
      "rating": 1.0,
      "verified": true,
      "author": "Trampis",
      "helpful_votes": 2,
      "publication_date": 20181108
    },
    {
      "title": "Nice looking and well made",
      "text": "My son loves them. They are well made and supportive.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Pagotto",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Peferct fit",
      "text": "I end up using it instead of returning it, good quality but they didn’t have other size available",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great shoe/Runs a full size too small",
      "text": "Love the shoe and I use it for weight lifting. Only problem is the shoe runs a full size too small and is very narrow",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Very nice shoes",
      "text": "Very good quality! It was a gift for my brothers son. He loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Love them!",
      "text": "Great for body weight workouts. Good support and traction. Minimal. 0 drop. I use them for calisthenics, mild boxing, and kettle bell days. I use lifting shoes or metcons for lifting days but I love these for other workouts.",
      "rating": 5.0,
      "verified": true,
      "author": "One Life",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Great shoe for wrestling",
      "text": "Bought for my teenage son for high school wrestling. He loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "creativeinsocal",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "The wrestler loves them!",
      "text": "Teenage boys are hard to shop for. But we scored with these wrestling shoes for his athletic talent.",
      "rating": 5.0,
      "verified": true,
      "author": "JoAnn Everson",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Do not believe in the size chart!",
      "text": "Brought US 8 but turn out it was a EU39.5 It was just too small! The shoes was with good quality. I guess I will get a new one with correct size.",
      "rating": 3.0,
      "verified": true,
      "author": "GC",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Good grip and nice fit around the ankle.",
      "text": "Very good grip and nice fit around the ankle. I have tried many shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Great value",
      "text": "Great quality for the price... perfect fit for size 14 which is not always a sure thing.",
      "rating": 5.0,
      "verified": true,
      "author": "erok2323",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Shoes didn't last 2 months",
      "text": "The shoe fit good and liked the product. The only bad part is the sole inside the shoe started falling apart. Didn't even last two months.",
      "rating": 2.0,
      "verified": true,
      "author": "Keith ",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "I know Amazon has the shoes I want",
      "text": "I like it the most because of its style but I don't like that they are hard to put on.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Fit great based on guidelines.",
      "text": "Shoe fits perfectly. Did research ahead of time. Normally we eat an 8 or 8.5. Told to try size larger so went with a 9 and it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Morett",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Great shoe",
      "text": "Great shoe but order a size up because they seem to run small.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Order a size bigger but great shoes.",
      "text": "These are great shoes but they run a full size small.",
      "rating": 5.0,
      "verified": true,
      "author": "trippingbillys",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Very comfortable snug fit",
      "text": "Shoe fit a little small. But did stretch a little after broken in. Very comfortable snug fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Wayne Pouliot",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Excellent!",
      "text": "Son, 7th grade, loved these shoes! Very comfortable, with good soles and flexibility. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Midwest Rebels Coach",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "High quality at a lower porice",
      "text": "Great product, great price, fast shipping. Came in new box with tags attached as expected!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon From ME",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Not true fit",
      "text": "Son is size 6 adidas fits perfect these ASICS size 6 are 1 1/2 size too small",
      "rating": 1.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great Purchase",
      "text": "Purchased as a gift for my son. They fit him great and they Look great. 👍🏻👍🏻 Received them quickly just in time for his birthday 👍🏻👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Fast shipping",
      "text": "Shoe was a solid size too small. but good looking shoe, fast delivery, easy returns, reordering a size bigger",
      "rating": 5.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Five Stars",
      "text": "Absolutely loved shoes just too tight! And amazon service to return was phenomenal ...",
      "rating": 5.0,
      "verified": true,
      "author": "dave bright",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Good quality!",
      "text": "I didn’t like how tight they were at first but they became more comfortable as I used them",
      "rating": 4.0,
      "verified": true,
      "author": "Scorpio ",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "One Star",
      "text": "Way to small need to return in. Ordered a men’s 11.5 got a men’s 7",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Overall pretty good",
      "text": "Not sure I like the tounge being connected, it’s also a little tight around the toe area.",
      "rating": 4.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Five Stars",
      "text": "They have a great grip, good flexibility and extremely comfortable even with a wider foot!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Three Stars",
      "text": "The shoes are a size smaller than my Adidas wrestling shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "South Central Electric",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Decent shoe but not really impressed. Gable 2 is superior!",
      "text": "They are nice but lack a bit of sole on the middle belly of the shoe and kind of fold inward when maneuvering. They have decent support but ASICS really should step up their game in the technological design application for their flagship shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "J.Demarco",
      "helpful_votes": 0,
      "publication_date": 20180318
    }
  ],
  "product_meta": {
    "title": "Asics - Mens Cael V8.0 Shoes, 10.5 UK, Black/White",
    "description": "New look, same impressive performance. A revamped upper offers a fresh update to Cael Sanderson's legendary Cael V8.0 wrestling shoe. The innovative split-sole design allows for maximum flexibility while the Ortholite sockliner keeps feet dry and comfortable no matter how hard you work. An improved lace garage keeps laces out of sight and out of mind, while unique ankle padding provides additional comfort and retro style.",
    "rating": 4.6,
    "feature_bullets": [
      "Ortholite Sockliner: Moisture management (Ortholite is a registered trademark of ATP Manufacturing LLC).",
      "Integrated Lace Garage Technology: Complies with rules regarding laces.",
      "Outer Material: Synthetic",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Ankle Padding Support"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "27.89 x 10.21 x 17.81 cm; 254.01 Grams",
      "Date First Available": "12 Feb. 2018",
      "Manufacturer": "ASICS",
      "ASIN": "B078875FJL",
      "Item model number": "1081A002",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Wrestling Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 129.56
  }
}