{
  "website_summaries": [
    {
      "verdict": "Extremely popular for a reason. You can't find better for the money.",
      "pros": [
        "Excellent build quality",
        "Can be used with right or left hand",
        "Trenching option"
      ],
      "cons": [
        "Occasional motor problems (should be covered under 2-year warranty)"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The built-in trencher makes creating the initial edge a breeze, and the impressive power and useful cord retention technology to keep the edger plugged in earn this model top marks.",
      "pros": [
        "Cord-retention technology locks the cord into the extension cord so it doesn't come unplugged and users can keep working",
        "The unit is lightweight enough to make clean cuts around curves as well as straight edges",
        "Powerful enough to cut through any thickness of grass",
        "Built-in trencher"
      ],
      "cons": [
        "While offering 3 cutting depths, the blade angle is not adjustable, so no bevel cutting"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This model does double duty as an edger and trencher. It makes a crisp edge to your lawn along the driveway, and the trenching setting can cut a nice line for gardens and borders.",
      "pros": [
        "12 amp high torque motor",
        "Pull-up edge guide easily sets the power tool to edging or trenching",
        "3-position blade depth adjustment",
        "Cord retention helps from unplugging from extension cord when in use",
        "Comes with additional heavy-duty replacement blade"
      ],
      "cons": [
        "Difficult to use on a narrow curb"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "only needing a new blade to keep things edging fine. This new one edges great",
      "text": "My old Black + Decker EdgeHog worked for many years, only needing a new blade to keep things edging fine. This new one edges great, but throws dirt around ALL OVER THE PLACE !!! B+D made \"Cost Savings\" by removing the inner ring dirt shield that prevented dirt from flying out in front of where you are edging. I'M sure B+D management will say the new design is a \"Product Improvement\". I will say it's a Profit Improvement !! I swapped out the black plastic blade shield part from the old one into the new one, and now it works just fine like the old one !! Shame on B+D Management !!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "REK",
      "helpful_votes": 21,
      "publication_date": 20180728
    },
    {
      "title": "A great lawn edger for under 100.00",
      "text": "For less than 100.00 this is a great little edger. Light weight and powerful it edged my fully curbed yard and sidewalks with ease. It features a neat sharks fin that when extended assists you in making nice straight lines along sidewalks, raise it up when doing along garden edges or when trenching. My old gas powered edger was never “easy” to use, this Black and Decker on the other hand was a snap to use and the finished edges look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Freeman",
      "helpful_votes": 3,
      "publication_date": 20200625
    },
    {
      "title": "Not bad at all.",
      "text": "I've been using a gas powered traditional edger for years. Worked great--when I could start it. Needed a new carburetor, so I decided to try something different. I was very pleased at the power of the B&D, it zips through much faster than I expected. It is a little hard to keep straight at times, and I don't think it was as deep as my prior edger (but I can set it deeper than I did). Handle could be a little higher or better support for the L hand. SO far, I'm very pleased. We'll see how long it lasts!",
      "rating": 4.0,
      "verified": true,
      "author": "Saucy",
      "helpful_votes": 4,
      "publication_date": 20180828
    },
    {
      "title": "Worked wonders",
      "text": "My sidewalk & apron for the driveway hadn't been edgedin over a decade. The pics are after 1st use on 1\" setting In one of the pictures you can see how much 'extra' sidewalk we gained (compared to neighbor). We've had numerous compliments on how much better it looks and how more people in town should do the same. Very easy to use. I've gone back over my 1st time use and went deeper to clean up the 'rough edges' It should now be easy to maintain now that it's not overgrown. I love the Edger!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "This is a great edger. However",
      "text": "I must agree with other buyers that they have downgraded the handle to thinner tubing and removed the D shaped handle grip.The edger mechanism appears to be identical to the older model however they have removed a major gripping handle and replaced it with a knob that is not as convenient to grip and removes a major control point.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 2,
      "publication_date": 20200630
    },
    {
      "title": "Machine is different from what was \"Amazon's Top Choice\"",
      "text": "I was expecting it to be as advertised: 2-in-1 string trimmer/edger-trencher. There's no string trimmer. Shame on Amazon for poor advertising. It worked well and easy to put together. It'll take some time to totally understand how to get the best results from it, but I'm happy with the 'beginner' results so far. Price was right. Arrived quickly. I'm happy!",
      "rating": 5.0,
      "verified": true,
      "author": "macks2opie",
      "helpful_votes": 2,
      "publication_date": 20200626
    },
    {
      "title": "Easy to use and works well!",
      "text": "I love how easy this edger is to use. We've had gas edgers in the past and my husband thought I shouldn't buy this because of the need for an extension cord-- I am so glad I read the reviews and followed my gut. This edger does a great job and is much less of a hassle than the gas edger. I look forward to edging (I'm one of those odd people)-- it's very satisfying when the results are so good and the tool is so easy to use. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180902
    },
    {
      "title": "Stopped Working NO Customer Service!",
      "text": "I’ve use this edger / trimmer four times and on the fifth time it stopped working. Was trenching good and the motor just stopped. contacted the seller, Black & Decker and no response in three tries. I guess they don’t stand behind their products and would suggest you look elsewhere for a better product. Ive had a similar Black & Decker trencher and it lasted me for over eight years. However, this one was barely pushing six months and only used it four times before it died.",
      "rating": 1.0,
      "verified": true,
      "author": "D E Cuda",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "This is a must for Florida lawns",
      "text": "We have this thick, rope like vine that grows in our yard. Under the grass. I honestly believe it originates in my neighbors yard. We rent so I’m not looking into eradicating a problem that is expensive and was there long before I moved it. Plus, I don’t know what can be down aside from tear the whole yard up and replanting. This stuff grows fast and thick. It grows onto our side walks. I tried weed eater. Fail. A manual edger. Next to impossible. Took forever and killed my back. This is a lifesaver. Takes less than 20 minutes to do the entire front yard.",
      "rating": 5.0,
      "verified": true,
      "author": "C.C.K.",
      "helpful_votes": 2,
      "publication_date": 20190307
    },
    {
      "title": "Good old fashion edger that does a better job than any other method",
      "text": "I have been using this type of edger for decades. While it is inconvenient to have a dedicated machine for the task and to have to get out the extension cord, the quality of the job makes it worth the effort. My last one lasted 25 years and I suspect it was the same Black and Decker model. Hopefully this one lasts as long.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 2,
      "publication_date": 20200625
    },
    {
      "title": "Just what I have been looking for",
      "text": "I got this for Fathers Day and it worked really well. It is easy to use and cut nicely into the turf. I've only used it once so far, so I don't know about the sturdiness. I hope it keeps working like it did the first time.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard D. Behnke",
      "helpful_votes": 2,
      "publication_date": 20200629
    },
    {
      "title": "Cheaply built",
      "text": "This is definitely cheaper built than the Black and Decker I purchased a few years ago. The shaft is a smaller diameter and does not fit together snugly so when you push forward, the shaft will give at the connection points. I give this about a year of use before it snaps half. They should be embarrassed by the cheap quality fit and feel. I will return.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Perfect for everyone",
      "text": "We are in our 60's and even though we are fit and active this is a lifesaver. We used to do all our edging by hand but this makes it super easy. You can adjust it to edge or to trench so you can use it in a variety f ways. Very lightweight and very easy to run, balanced nicely when you use it. Well worth much more than we pain for it",
      "rating": 5.0,
      "verified": true,
      "author": "cinders",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Good for along sidewalks and driveway",
      "text": "So I bought this as a way that I can help my husband out with the lawn care. Using a weed eater for edging is too hard on me. This is MUCH easier, however, it’s only good along cement (like driveways and sidewalks). We still need to use the weed eater around trees and bushes and mulched areas. Just keep that in mind. Also,.....it doesn’t do as goo a job as my husband does with the weed eater,....which is apparently an art form or a skill that it takes time to get good at. But with this, I am able to at least help out a bit and cut down on the amount of time he has to spend trimming.",
      "rating": 4.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Good for small jobs",
      "text": "I bought this edger for my son-in-law to replace a string trimmer that wasn't getting the edging job done. It was easy to put to together and easy to use once I figured out the depth adjustment and wheel placement in relation to the intended cut. It has a small electric motor so you shouldn't expect it to adequately perform in tougher, extended applications but for edging the grass adjacent to a curb and driveway on a standard city size, you will find this an adequate tool. As a bonus, it came with an extra blade.",
      "rating": 4.0,
      "verified": true,
      "author": "TimberlineCruiser",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Highly Recommended... But Read The Directions",
      "text": "My first edging experience was not ideal. I found the graphic depicting edging vs trenching confusing which resulted with sparks, flying stones and dirt. After I played around with it I saw where my mistake was. READ THE DIRECTIONS. I tend to “intuitively” assemble and use with the underlying belief... how difficult can this be. I am very satisfied and recommend. There is a YouTube posting demonstrating proper use.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel W. Richardson",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great tool",
      "text": "Great tool to use for cutting the edge, works very well, plug and play. I used it for about an hour non-stop and did not experience any problems. CUts at a straight line or circle. All you need to do is to guide it in the right direction. The reason why I gave 4 vs 5 stars, is that I thought it would cut deeper. it cuts about 2-3 inches deep. Other than that unfortunate difference, would highly recommend this product if you are looking to cut only 2-3 inches deep..",
      "rating": 4.0,
      "verified": true,
      "author": "franky",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Gets the job done",
      "text": "This guy worked great. I needed a way to keep my bermuda grass from overgrowing the sidewalk. My line trimmer has the ability to do edging, but it wasn't robust enough to cut through the thick grass. This edger did the trick, and it was much faster and less frustrating than the line edger. As others have stated, the handle is strangely low, but I believe that is to encourage you to push the unit out in front of you, keeping all the wheels in contact with the ground. The handle angle forces you to push forward instead of down.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin M",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Edger/Trench Broke",
      "text": "First time using this product and thought it was going to be great. But the edger/Trimmer detached from the unit and is now broken and can't get it to work at all. Instructions don't help with this and trying to find a picture to see what is wrong is hard. Looks like washer broke when using, which caused the edger/trimmer piece to dislodge. Cannot use as that is what guides the edger and the blade keeps hits the edger/trimmer guide.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda A. Steele",
      "helpful_votes": 2,
      "publication_date": 20180808
    },
    {
      "title": "Be careful",
      "text": "This device did not go well when I tried to edge my driveway. It stopped on me ( overheated I suspect ) and could not re -use until at least an half hour had passed. There is NO guide that you can see to help you keep the blade near the edge of the cement, so needless to say I hit the cement a lot of times during the use. If your driveway edges are high as mine, you can't even adjust the cut down far enough to put an edge. Bad vibes, I can only hope for the best..",
      "rating": 3.0,
      "verified": true,
      "author": "Robert E. Merritt",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "sadly i had to return it do to damage in shipping then out of stock.",
      "text": "what it had was a guide between the blade and the curbing which the one i ordered to replace it does not have . when i was putting it together i noticed the wires were cut down to bare metal and almost through the wires but otherwise it seemed well built and i was dying to give a run but really did not wish to die while doing it. it seemed well put together but shipping took a toll on it.",
      "rating": 4.0,
      "verified": true,
      "author": "R. L. Wyrwitzke",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Basic edger",
      "text": "No this is not the fanciest edger and yes the cord is a bit cumbersome but I have a VERY long driveway and manage to deal with it. Sure beats using a weed whacker. Would recommend. Can't beat it for under $100.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "They used hard",
      "text": "I use mine under hard usage, mainly because most of the cutting is backward. It's hand on the motor - but if it last all season I figure I have got my moneys' worth out of it. Speedy delivery, and super easy to put together. Thank you for your time and consideration.",
      "rating": 5.0,
      "verified": true,
      "author": "louise a rhinehart",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Broken iten less than two months old.",
      "text": "It broke. Front wheel is broken. Edging. I purchased this April18th. It is already broken. I buy hundreds of things from Amazon every year. I want my account credited for the full amount or a replacement. This the second one of these I purchesed in the past three years. I am not a happy camper at this moment. Please resolve asap. Thank you",
      "rating": 1.0,
      "verified": true,
      "author": "jayne",
      "helpful_votes": 2,
      "publication_date": 20200608
    },
    {
      "title": "satisfied with the results",
      "text": "I like the quality of this edger. I'm a complete novice and have used it to edge the lawn and to create a trench for a border so I could push in plastic fencing. It's pretty intuitive to use, and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Almost perfect",
      "text": "I love this thing. Finally I have reclaimed my driveway and walkways! My only complaint is that it IS somewhat awkward to operate on a curb, since its design makes you hold it up in midair as you buzz your curb. Not a deal breaker (though I don't know if my wife would say the same) but its an odd problem for a device designed to do this very job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "It does every bit as good a job as my McLane did before it needed ...",
      "text": "When I first put this edger together (some assembly required) I was skeptical of it's ability to handle the job. I was pleasantly surprised with how well this unit edges. It does every bit as good a job as my McLane did before it needed parts that totaled more than what this B&D cost. It's light weight but gets the job done. Even on grass that had grown up and over the sidewalk for a year.",
      "rating": 4.0,
      "verified": true,
      "author": "p.w.e.",
      "helpful_votes": 2,
      "publication_date": 20180730
    },
    {
      "title": "Easy to Use",
      "text": "I ordered the B&D Trencher / Edger to trench some of my garden areas. It worked exactly as I had hoped. Easy to use and adjust depths. I completed trenching the garden area around my above ground pool within a half hour and now ready to put down mulch. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick W. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Does a good job",
      "text": "We have quite a bit of concrete that I needed to trim the grass away from the edges. I had been told the first time is the hardest and was prepared for it to be a lot harder than it was. It did take a while, but the edger worked great and did exactly what I needed to be done. I would definitely recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "PeggyM",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "It arrived with instructions that were missing figures, a ...",
      "text": "It arrived with instructions that were missing figures, a section in figure 1, and 2 extra figures without explanation in text. Parts are not identified in any of these figures except for screws or other obvious parts. The text describes an auxiliary handle that I have no idea what it is. I didn’t use it yet, but wonder why didn’t they include updated instructions appropriate for this model?",
      "rating": 1.0,
      "verified": true,
      "author": "Lotus",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Completely Unwieldy",
      "text": "For an edger, maneuverability is the absolutely most important thing -- it doesn't matter how well it cuts, if it's cutting in the wrong place -- and this edger is like a brick on the end of a pole. I eventually learned where to put my left hand to maximize my control (hint: not on the built-in hand hold), but that still doesn't help that the thing is practically engineered to get stuck on the grass. Next time, I will look for two things in an edger: the motor at the top, and a guard and wheels that are out of the way of the path.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "It is a good value for money",
      "text": "It is a good value for money. My yard is small enough to allow a cord but big enough to wish it was cord-free. The trimmer worked well but I do wish the trencher worked a little deeper.",
      "rating": 4.0,
      "verified": true,
      "author": "RAP",
      "helpful_votes": 3,
      "publication_date": 20180630
    },
    {
      "title": "This edger gets the job done",
      "text": "I like the power of this edger, and its ability to move easily along the sidewalk. Ergonomic feature makes it less stressful on the old guys joints, too. In some ways I am still learning how best to maneuver it to get the blade closer to the sidewalk edge. But I love it and would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "NCJack",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Easy to handle. Very powerful.",
      "text": "I LOVE this edger. It's light and easy to handle but very powerful. Easy to put together right out of the box. Only had to attach the handle. It has 3 heights, 1\" 1-1/2\" and 2\". Only takes a short time to do quite a bit of area. I used the 1\" first then went over the same area with the 1-1/2\".",
      "rating": 5.0,
      "verified": true,
      "author": "R B",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Disappointing",
      "text": "While this edger works, the quality of the results are lacking. The edger doesn’t penetrate deeply enough to my liking. In fact, I will sometimes forgo this one to go back to the 25 year old b&d edger that this one was supposed to replace. It is more difficult to use because it doesnt have as much power, but the resulting edge was much more deep and defined than this one. I wish I could return this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Esteban",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Not a professional tool",
      "text": "Difficult to use. The electrical cord its a hazard, the extension cord cant be use in rain, wet, damp conditions or allow extension cords to run through water as a matter of fact extension cords should be used only as a temporary source of power. bottom side it so difficult to move the tool over the lawn with the extension cord.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Arrived damaged",
      "text": "Mine arrived with a bent - and therefore impossible to assemble - handle. Had to get a replacement from SBD (manufacturer). The review reflects my disappointment with Amazon shipping a defective product, not my delight with the replacement model that I got, which should get 4+ stars in all categories.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris A",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Not reliable",
      "text": "Worked about 200 ft and motor burned up. Cutting shallow line in grass to put dogs electric wire. Would have returned but had several months before getting to project",
      "rating": 2.0,
      "verified": true,
      "author": "GWC",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Fescue vs Bermuda",
      "text": "If your yard is nicely manicured and have a decent thickness (fescue) it will he difficult to use. I found that the higher the grass this machine doesn't work well in it. My neighbor has Bermuda grass and worked well there. Sold it to them.",
      "rating": 3.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 2,
      "publication_date": 20200425
    },
    {
      "title": "Hacks the grass rather than cuts the grass",
      "text": "Difficult to haul an extension cord to the sidewalk (and a long one at that); the blade is not sharp enough to cut the grass cleanly, rather I would call it \"hacks\" the grass off. In order to make the edging look sharp, I have to edge it 2 or 3 times to get that clean look. Should have bought a gas powered model with a sharp blade and a beveled cut option. Just not worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Katherine C. ",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "good product but",
      "text": "if you have a good weed-whacker it will do the same thing....its a good product but probably wont use that much, maybe once a year....its basically a mini-saw....prefer my weed-whacker in the veritical position vs this for edging...",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Revellese",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Excellent product",
      "text": "I have used this only one time since purchase. This is also my first such trimmer. This got through overgrown grass and created an excellent path on the sidewalk/driveway. I even was able to use it to prep the soil in the garden so that I coud add a border---though it is not really for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Too heavy",
      "text": "The machine is pretty heavy to hold. The instruction isn't clear enough in regards to the edging and trimming. You have to push it really slow to keep the wheela in a straight line. If not, you will see patches.of accidental cut to the edge of the grass.",
      "rating": 3.0,
      "verified": true,
      "author": "tanya huynh",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Not a string trimmer!",
      "text": "Does not work well for Bermuda grass or St.Augustine grass. This edging tool has a rotating blade that does not adjust deep enough to cut the roots/runners of these grasses. Any runners that get clipped wind themselves around the blade. I tried using this tool around the edges of a concrete patio. Didn't work. Returned it and will get a string trimmer instead..",
      "rating": 2.0,
      "verified": true,
      "author": "C. J.",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Works well",
      "text": "Works well and well made. It's easy to handle and does a nice job although I thought it would cut a cleaner edge. The only other thing is it keeps running for a few seconds, even after you take your hand off the handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby McIlroy",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "String Trimmer???",
      "text": "Why does it say 2-in-1 string trimmer/edger? It’s just an edger...not a string trimmer.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 3,
      "publication_date": 20200607
    },
    {
      "title": "Crap, Junk, Garbage, not worth cardboard shipped in..move on.",
      "text": "Piece of complete and total junk. Plastic \"guard\" exploded on first use. Wheel snapped off and well...yup. That was on try one of, plug in cord,move forward, 6 feet.",
      "rating": 1.0,
      "verified": true,
      "author": "RichterBox",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Very bad product I had high hope when I recieved it",
      "text": "POS failed in about 15 minutes of normal use only edged about 40 feet of driveway. Product is extremely fragile. Now failes to turn on. Returned it after one 15 minute use haven't even had it for a week.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "Don't waste your money.",
      "text": "Don't waste your money. I would give it a zero if I could. Does an extremely poor job edging and the trenching claim is really misleading. This item is so bad, I will never buy any Black and Decker item again.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill hutson",
      "helpful_votes": 2,
      "publication_date": 20180529
    },
    {
      "title": "Terrible trencher - burned up motor",
      "text": "We used this as a trencher which is a supported use but the motor gave up after a few yards of use. Unfortunately we missed the return window because we didn't use it immediately and now we have an expensive paper weight.",
      "rating": 1.0,
      "verified": true,
      "author": "S. K. Hunter",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Very pleased!",
      "text": "I was very pleased with this edger that is replacing my old one. Despite the comments, I did not have to use some of my old parts to replace the newer parts. I am using it 'as is' and it does a good job!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbwp46",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Awesome edger!!!",
      "text": "This thing is awesome. I tried a few different brands and had to send them back because the lawn didn’t have that professional look I wanted. This thing does the job and it’s super easy. The instructions said set to trim on the lowest setting but I’ve found the highest setting does the best job. If want that neighbor envy lawn this is the tool for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Good product.",
      "text": "I got this for my dad and he loves it. It works great as an eddger and we have already used it to dig some small trenches for a couple of electrical cords. He is already planing on using it so he can bury exention cords this Christmas.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "20 minutes every two or three weeks is what it takrs",
      "text": "Edger does all that I want, it's quite powerful, we'll, when used for what it's intended. For those who cannot master the trim with a weed eater like the pros do, it's a valuable tool.",
      "rating": 5.0,
      "verified": true,
      "author": "RayL.",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "you get what you pay for",
      "text": "I didn't expect much for less than $100 but given the size of the area I needed to edge/trim and how often I figured this would be perfect. On the second use the handle bent in half from trying to push it forward and when trying to straighten it out it snapped. Now the tool is useless. Would not recommend unless a VERY small job.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Works pretty well! Great value for the price.",
      "text": "This worked pretty well! My yard hadn’t been edged in months so first go round was a little rough. Once you get the hang of it was pretty easy to use. Much easier then trying to use my weed eater. Only gripe was blade came loose 2 times so I used some lock tite on the bolts to remedy the problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Troy Stephenson",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great Edger",
      "text": "I purchased this after not being completely happy with the results, or the effort involved, of using a string trimmer for edging. I am impressed with this machine. It is easy to handle and does a job with results far better than a string trimmer. I particularly like the fact that cuttings and mud stay on the ground and don't get thrown all over you. Wish I had purchased this sooner.",
      "rating": 4.0,
      "verified": true,
      "author": "Karl H.",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great addition",
      "text": "This product is as advertised I’m 6’6 so leaning over a little was expected. Before you start to edge make sure it’s in place blades start quick and strong will snag your concrete use the guides near back wheel . Definitely a buy plus an extra blade",
      "rating": 5.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Not all items included",
      "text": "I received the item , however advertisement says it includes a replacement blade. When received... no replacement blade included Not sure how to resolve. I don’t want to return the whole item",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Gave it a tough work out, right out of the box.",
      "text": "used it to trench about 175\" along front of property and along the driveway. It would occassionally get clogged from too much grass and dirt, but I would just push down on the handle and let it spin free to unclog itself. For the price, I found it a great value because of how well it worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Hrntphxr",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Much better than expected",
      "text": "Wasn't crazy about getting an electric edger again, but VERY happy with its performance. Excellent power. I used to cut through vinca that had grown out onto to sidewalk. Cut right through it without a problem first time.",
      "rating": 5.0,
      "verified": true,
      "author": "bob0won",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Works and makes a huge difference in appearance",
      "text": "This was easy to put together. Its also easy to change the setting from edging to trenching. It’s kind of easy to use however if you plan on cutting through really thick weeds that have grown it’s a little harder to work with but it still works. We edged our fairly large yard and curb pretty fast and there’s nothing else that could have done a better or faster job. I would definitely recommend the item for thin grass along your curb. It’s a great tool for the price I paid!",
      "rating": 3.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "trimmer",
      "text": "after a short trial, I am sure that this will do the job. I'm an older guy and the gas weed eater just got too heavy for comfort. This is good for drives & sidewalks. I still use a battery powered string trimmer for flower beds, fences, etc. It is also a B & D that I bought extra batteries for.",
      "rating": 5.0,
      "verified": true,
      "author": "Alvin R. Werchan",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "They do a great job",
      "text": "This is the third one I have had. They last about 5 years. They do a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "TOM TYLER",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Works well But....",
      "text": "Had to rework the wiring a bit as it was too long to allow handle to be assembled. Once working it does what I intended. I am 5'11 on a good day, even at that the handle is too low and is not adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "Leon in Boise",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "I Like It",
      "text": "I like it. Easily edges my St. Augustine grass. I'm surprised how powerful it is. Very glad I can ditch my 2 cycle gas edger. No more container of mixed oil and gas for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaded",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "edging easy as can be",
      "text": "Been edging on my hands and knees for years. This tool makes the job so much easier and far less time consuming. Was finished in 45 minutes, start to finish, including cleanup.",
      "rating": 5.0,
      "verified": true,
      "author": "tatdude",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "I like the adjust ability and option to turn it into ...",
      "text": "The string trimmers were loading up with dirt and shorting out when trying to edge my walk of about 120 feet, this tool rips right through it. I like the adjust ability and option to turn it into a trencher",
      "rating": 5.0,
      "verified": true,
      "author": "James E Zastawniak",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Should have bought this sooner.",
      "text": "I have been using a string trimmer to edge but since switching to this its so much faster using this tool. For best results make one pass forward and then a second pass backwards to clean up anything left behind. It's cheaper to operate since I'm not grinding up line, it's easier to keep a straight line, and doesn't strain my back like the string trimmer does. Overall I can't recommend this enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Kukla",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Easy to use",
      "text": "Great power, nothing slows it down. I first did my lawn and half of what I was going through was mud and it did just fine. Just make sure there are no vehicles in front or near it does throw materials pretty far",
      "rating": 5.0,
      "verified": true,
      "author": "Robert hansen",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Good Trimmer, could use improvements.",
      "text": "An overall good unit. However, BD needs to improve on how well the plastic handle (grip) holds in place with the main shaft. When edging on sloped curves, the unit will slip within the plastic grip. The depth wheel is flimsy at times leading to inconsistent depth of the edging. I'm still happy with it, even if I have to make the improvements myself.",
      "rating": 4.0,
      "verified": true,
      "author": "R. D. Layton",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Good edger.",
      "text": "This replaces the same B & D model edger that I had for eight years... Bearings in the old one had worn out. In considering a replacement, extra cost of a cordless wasn't justified and the thought of gasoline, oil and starting an engine wasn't appealing.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilbert Scott",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great value",
      "text": "This works surprisingly well. Better than our $400 gas powered edger that this one replaced. Nice straight edge - nice a quiet. The extension cord can be a little annoying, but it's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Dishonest title",
      "text": "The seller sold this product under the title \"BLACK+DECKER 2-in-1 String Trimmer / Edger and Trencher, 12 -Amp (LE760)\" - a title they have since changed to reflect the fact that they are not in fact selling a product that has string trimmer capabilities. I opened the product after the return window had closed, which is my fault, but this is still false advertising and basic dishonesty.",
      "rating": 1.0,
      "verified": true,
      "author": "Cristina Popa",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "So far so good",
      "text": "So far so good. I have used this several times to edge around the driveway. Works well, but is showing some minor wear. Not sure this is going to hold up in the long run, but I was so tired of small gas engine maintenance that I decided to go electric.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Blacklock",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Works well!",
      "text": "This edger is exactly what I was looking for and it works very well. I had thought about a battery powered edger or trying to use a string trimmer as an edger, but I am very happy that I chose this edger. Although I have to plug it in and watch the electric cord, it works so well that it's worth the little inconvenience.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Patten",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great edger",
      "text": "This edger is GREAT!!!!! worked on my 40 ft double driveway and walk to front door and walk to back yard. Very easy to use and powerful enough to do the job easy and right. used a 100ft yellow heavy duty extension cord and worked like a champ. Have used it 2 times and going about 330ft around the drive, front walk, and back walk each time, and the blade is still in good shape, a little worn, but not enough to replace it. Hope this review helps anyone who is thinking about buying one.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Hepp",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Easy Use",
      "text": "Me and my wife have both used the edger. It works great and has multiple settings for ease of use. It seems to be sturdy so far with no issues on built or how it edges.",
      "rating": 5.0,
      "verified": true,
      "author": "John Sherman",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Just OK",
      "text": "It will cut an edge in Florida grass but rather difficult to maneuver. Miss my old gas powered unit in Michigan.",
      "rating": 3.0,
      "verified": true,
      "author": "William J. Roberts",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "It does the job.",
      "text": "It took me a little practice before I could get the edging to look nice. It does a nice clean cut. I have not used it as a trench digger yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharie",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Very pleased",
      "text": "I got this so that I would be able to easily edge my new lawn. It works great and moves smoothly. I enjoy mowing and doing my own landscaping but have had some tools in the past that are too hard for me to maneuver, this is not.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Engelhardt",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Works great!",
      "text": "Handy edger for trimming the yard. It also functions as a trench digger. I haven't tried using it for a trench yet, but, I'm sure it will be fine. Product is good quality, sturdy and works as anticipated. We're very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Sherman",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Not what I was looking for",
      "text": "Used it to dig a small trench for an invisible dog fence. It was doing a good job for about a 1/2 hour then broke",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Black and Decker Electric Edger",
      "text": "This is PERFECT for me to use. I have lots of issues with my spine. This is great for me. Thank you a good product. Brenda Skinner",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda J. Skinner",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Works great",
      "text": "I was surprised at how well it works! Our lawn had never been edged before, worked like a champ. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Kor",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Easy to Use",
      "text": "Little hard to use at first, but once you get the hang of it, ITS EASY. Does a GOOD JOB",
      "rating": 5.0,
      "verified": true,
      "author": "Red",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Perfect for St Augustine Grass",
      "text": "Works great on St Augustine Grass. I use it every two weeks and it keeps up well. No issues at all as long as you’ve got a long enough extension cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Berger",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "works but with difficulty",
      "text": "Set very low and I am a tall person. It works as it is supposed to with some improved skill set. A regular weed eater works better for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill Whaley",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Not worth it",
      "text": "Poor cutting depth and poor power, constantly cloggs with dirt and grass.",
      "rating": 2.0,
      "verified": true,
      "author": "Tracey Parrish",
      "helpful_votes": 2,
      "publication_date": 20200410
    },
    {
      "title": "Sperator plate doesnt lock",
      "text": "I device I received was not locking the bottom separator plate. It kept pushing back once start . Ended returning it",
      "rating": 2.0,
      "verified": true,
      "author": "Dinesh",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Makes edges",
      "text": "If you have a lot of overgrowth it will take another pass to get a clean edge. Price is good, but I would say the handle configuration could have been engineered better.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Died first day of use.",
      "text": "Bought in winter to be ready this spring. Unboxed today and started edging. About an hour of use on and off as I did other things in different parts of the yard and it just stopped. I keep trying to get it going thinking maybe it overheated but it's dead.",
      "rating": 1.0,
      "verified": true,
      "author": "John Byrne",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Monster",
      "text": "This bad boy lines them edges excellent. Just hold on to it because it will yoke you when it starts off.",
      "rating": 5.0,
      "verified": true,
      "author": "lil tate",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Love this edger!",
      "text": "Love this edger. Easy to use and yard looks great with the clean edges.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane S",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Great little edger for the money.",
      "text": "Plenty of power. Cuts through the grass edge easily. Maybe a little difficult to hold a straight line along the cement edge, but I'm happy that I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Does Great with both trimming and trenching",
      "text": "Easy to assemble. I bought this edger to replace another Black and Decker edger just like it. After 5 years on the old edger (without doing any maintenance), I finally burned up the motor. I probably should have taken better care of it to make it last longer. But I love the new one. I hope to get as much life out of it as the old one.",
      "rating": 5.0,
      "verified": true,
      "author": "David R Rogers",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Basic edging is okay, not up to the task for overgrown areas.",
      "text": "Works, but is not very well suited for tough jobs.",
      "rating": 3.0,
      "verified": true,
      "author": "joe zielbauer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Very good edger",
      "text": "Lite weight but does the job. So much easier to use then my previous edger and it came with zn extra blade.",
      "rating": 5.0,
      "verified": true,
      "author": "tloch",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Work’s Great!",
      "text": "Great edger! Cut through heavy overgrowth with two passes. Powerful, easy to use machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jazzbo",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Good product",
      "text": "Very good product, I have both trenched and edged. The handle is a little loose after a few uses, will probably drill additional holes and use some bolts to firm it up.",
      "rating": 5.0,
      "verified": true,
      "author": "David ",
      "helpful_votes": 0,
      "publication_date": 20200721
    }
  ],
  "product_meta": {
    "title": "BLACK+DECKER Edger and Trencher, 7.5-in, 12 Amp (LE750)",
    "description": "Style:EdgerThe BLACK+DECKER LE760FFAM 12 amp 2-in-1 landscape edger & trencher features a 12-amp, high-torque motor that helps this electric landscape edger power through tough overgrowth & dig clean-looking trenches. Easily converts from edger to landscape trencher. Comes with additional BLACK+DECKER eb-007 edge Hog heavy-duty edger replacement blade.",
    "rating": 4.4,
    "feature_bullets": [
      "Note : includes the BLACK+DECKER LE750, EH1000 blade, and EB-007 . Item model number will be included in right bottom corner of the carton",
      "Exclusive pull-up edge guide converts from edger to landscape trencher",
      "Three-position blade depth adjustment lets you control the cut",
      "Built-in cord retention keeps Extension cord secure; Hardened Steel Blade: 7-1/2 inches",
      "Tool-free assembly is quick and hassle-free.RPM:4700 rpm",
      "Comes with additional BLACK+DECKER eb-007 edge Hog heavy-duty edger replacement blade.",
      "12 amp high torque motor tackles tough overgrowth creating a defined Trench"
    ],
    "specifications": {
      "Product Dimensions": "23 x 10 x 12 inches",
      "Item Weight": "14.05 pounds",
      "Manufacturer": "BLACK+DECKER",
      "ASIN": "B079PD1TNF",
      "Item model number": "LE760",
      "Customer Reviews": "4.4 out of 5 stars812 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#40,312 in Patio, Lawn & Garden"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Hand Tools",
      "Hand Edgers",
      "Gardening & Lawn Care"
    ],
    "price": ""
  }
}