{
  "website_summaries": [
    {
      "verdict": "The Vionic Bryant was considered reasonably priced for its quality build and comfort. Its arch support also helped to relieve foot pains. Commenters were also pleased that it was easy to put on and remove. Though there were claims that the fit and length were as expected, a few purchasers noted that the trainer ran short and narrow. It was also not as comfortable for some buyers because of chafing and poor cushioning. But in the end, most buyers ended up being delighted with their purchase.",
      "pros": [
        "Almost all of the reviewers appreciated the comfort delivered by the Vionic Bryant",
        "A majority of the owners liked the arch support on this model with some stating that it relieved their foot pain",
        "The length and width of the trainer were deemed perfect by numerous wearers",
        "Several testers enjoyed the fact that this footgear was easy to put on and remove",
        "Because of the quality build of the shoe, some shoppers thought it was worth the price",
        "A few folks enjoyed how lightweight this model felt on their feet"
      ],
      "cons": [
        "A minority of consumers ranted that the Vionic Bryant ran short and narrow",
        "The underfoot cushioning and arch support were deemed insufficient by several users",
        "A couple of individuals complained that the back of the shoe chafed their hindfoot"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great comfort",
      "text": "My husband has plantar fascitis and these really support his feet. He was wearing sketchers and they could be folded up which meant there was little to no support. The Vionic shoes feel great and give plenty of support. My husband loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "rbeez",
      "helpful_votes": 8,
      "publication_date": 20181001
    },
    {
      "title": "Gross, nasty, previously owned shoes",
      "text": "Right out of the box I could tell that these shoes had been previously returned. When I removed the footbeds, there was a scaly, oily skinned foot imprint, on both shoe footbeds. Obviously the previous owner had worn them for quite some time and barefoot. Doesn't say very much for the quality control of returned items. It's a shame too, because I really liked these shoes. I'll be returning them, but am leery about reordering another pair, for fear I will get some more of the same.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 5,
      "publication_date": 20190727
    },
    {
      "title": "Highest arches I have ever experienced.",
      "text": "These things had ridiculously high arches. They hurt the moment I put them on. I tried very hard to walk around for a few minutes but it was excruciating. The soles were also quite hard. Not at all like described. For someone with high arches, perhaps they might work but I feel they were not as advertised and they didn’t help and actually made my pain worse.",
      "rating": 1.0,
      "verified": true,
      "author": "Sage B",
      "helpful_votes": 2,
      "publication_date": 20190915
    },
    {
      "title": "Support and comfort",
      "text": "I bought these as indoor only shoes /slippers and they are great. Often I'm on my feet for many hours a day and my plantar fasciitis doesn't flare.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190404
    },
    {
      "title": "Great for my husband’s plantar fasciitis!",
      "text": "These shoes look great, fit great and are very comfortable! My husband has been struggling with plantar fasciitis for a few months and finally found some relief with Vionics. These shoes are really nice looking and the price is so much better than the local store that carries them. Such a great find! He loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "DENICE P.",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Don’t hesitate- if your feet hurt but these!",
      "text": "I always wear Vionic shoes so I decided to buy A pair for My husbands achy feet & legs. He’s had them several months now & loves wearing them. He says they’re the most comfortable shoes he has & Very supportive. I actually just ordered another pair for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy L",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Bought two pairs",
      "text": "Liked the first pair so much I bought a second to use for lawn & garden work. Great foot support. Vionic shoes have helped with my plantar fasciitis over the last couple years. These are priced right and are great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "YoBro",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Comfortable and supportive",
      "text": "Got this shoe after reading reviews and much searching for a good, sturdy, walking shoe. Very comfy right out of the box. Ordering another pair now!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Russ",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Right for you?",
      "text": "This shoe is designed to give side support, so is noticeably restrictive or intentionally intensely supportive thru the sides. Might be perfect for someone who needs or wants that kind of design.",
      "rating": 5.0,
      "verified": true,
      "author": "Jupiter 2",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Great Shoes.",
      "text": "These shoes are much like Birkenstock’s in that your feet must adapt to the foot bed. So the first several times you wear them do it for a short period of time. I Wear mine around in the house until my foot becomes accustom to them. Once you have they will be your best friend. Definitely will be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Heavenly",
      "text": "These are the best shoes ever. They even cured my head ache and receding hairline the first day I put them on. I went to the lake the other day and I was able to walk on water with these shoes. Fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Pearlina B.",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Good arch support",
      "text": "Good value for a shoe that provides good arch support and stability.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernard Nisenholz",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Vonic makes great shoes",
      "text": "I'm a Vonic fan and have converted my husband - the arch support in their shoes is fantastic and the fit is great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Rysa",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Most comfortable shoes I have ever owned.",
      "text": "My wife told me about this brand and I am so glad she did. These shoes fit more like a glove than a shoe. They look great and fit even better. I will be buying more soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Allen",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Plantar fasciitis friendly",
      "text": "I have plantar fasciitis and have been wearing Vioic for about 6 months. They all work great but I really like these being slip on. They fit great and have the same support as other Vionics.",
      "rating": 5.0,
      "verified": true,
      "author": "William Evans",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "My New Favorite Shoe!!",
      "text": "Its been very difficult to find nice shoes with great arch support. Loved them so much that bought another pair on a different color. Only issue is that they are not breathable enough for my super sweaty feet, but they are so comfortable that I can forget about that issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "GREAT SHOE! GREAT STYLE ! AND UNBELIEVABLY COMFORTABLE-------NOT just for. Your feet",
      "text": "Love it entirely! Fit comfort, it is a little pricey, worth it! EVerything is just so expensive these days!",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Reese",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Not impressed",
      "text": "Was too tight on jus at the top of my heal and gave me a blister",
      "rating": 1.0,
      "verified": true,
      "author": "steven goldman",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Great shoes for plantar fasciitis",
      "text": "Great shoes if you have plantar fasciitis. Helped to relieve pain quite a bit. Fit is normal.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Bukh",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Good shoe",
      "text": "Hard to get used to the arch but feel like the fit and comfort is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Took away foot pain",
      "text": "Stylish, extremely comfortable and took away my plantars faciaitis pain. Well worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Good looking comfortable slip on shoe",
      "text": "Bought for my husband. He likes that they slip on easily & are very comfortable. True to size. As with all Vionic shoes, nice arch support.",
      "rating": 5.0,
      "verified": true,
      "author": "Danna V",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Husband sells another pair of vionics....",
      "text": "Now I can’t stop my husband from telling all his friends about his vionics...fit, comfort, walking, standing, and would be jumping if he wasn’t 73!! YES HE’S SOLD. Oh you need more tennis shoe colors he is a shoe addict",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila M Martin",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Excellent Choice",
      "text": "Arch support is great. Shoe fits great. My husband loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Golden",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "My new favorite shoes",
      "text": "My new favorite shoes. They are very comfy. Went on a long weekend trip. I brought along another pair of shoes just incase my feet got tired in these, but I didn't need the spare pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Baker",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "too small.",
      "text": "order a size bigger. good shoes, just too tight for my wide feet.",
      "rating": 4.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "The shoes are not broken in yet. Can't add a headline",
      "text": "Still breaking shoes in. So far they are very comfortable and feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Bradford",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Problem with these shoes",
      "text": "The top where the side is sewn to the top has become unsewn and has come apart. I bought these shoes mid March 2019. Could I return the shoes and receive a replacement. My husband likes these shoes",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Alert!",
      "text": "This is NOT a mans size 8! Its a womans!",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great buy",
      "text": "These shoes are comfortable and look good. Bought a second pair in both colors as the price is terrific",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Suprizing comfort.",
      "text": "So very comfortable that you forget you have them on.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Lessans",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Good support and casual shoes",
      "text": "Great shoes to wear around with good support or add soles",
      "rating": 4.0,
      "verified": true,
      "author": "Kosta Makrodimitris",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "At first a bit narrow",
      "text": "Nice casual \"slip-on\". I'm still in the process of breaking them in. A bit narrow at first fit but am assuming with a bit more wear they will stretch a bit. Great arch support for my collapsed left arch, I wear Vionic sandals as well, really make a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Anderson",
      "helpful_votes": 2,
      "publication_date": 20190712
    }
  ],
  "product_meta": {
    "title": "Vionic Fulton Bryant Greige Men's Trainer",
    "description": "The VIONIC® Bryant is the ideal sneaker for enjoying the great outdoors. Soft suede upper. Easy slip-on style features twin gore panels for a comfortable fit. Pull tab at the ankle. Soft textile lining for all-day wear. Removable mesh EVA insole for optimal comfort. The podiatrist-designed Orthaheel Technology provides superior orthotic support, relief, and stability which helps realign the feet back to their natural position. Durable rubber outsole for a pleasurable walking experience. Imported. Measurements: Weight: 8 oz Product measurements were taken using size 9, width M. Please note that measurements may vary by size. Weight of footwear is based on a single item, not a pair.",
    "rating": 4.4,
    "feature_bullets": [
      "Suede Upper",
      "Removable Mesh Covered EVA Footbed",
      "Outer Material: Suede",
      "Sole: Rubber",
      "Closure: Slip-On",
      "Heel Type: no-heel",
      "Material Composition: suede",
      "Shoe Width: Medium",
      "Durable Rubber Outsole",
      "Biomechanically designed to hug your arches",
      "Vionic brings together style and science, combining innovative biomechanics with the most coveted trends."
    ],
    "specifications": {
      "Date First Available": "20 Jun. 2018",
      "Manufacturer": "VIONIC",
      "ASIN": "B07F45WK4M",
      "Manufacturer reference": "BRYANT GREIGE",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 66.49
  }
}