{
  "website_summaries": [
    {
      "verdict": "There’s a lot to like about this OfficeJet printer, including above-average levels of performance, print quality, and value.",
      "pros": [
        "Ships with a built-in 2.2-inch touchscreen display, so you can control the printer easily",
        "Offers fax, scan, copy, and print functions in one device",
        "Seems to maintain its WiFi connection better than most inkjet printers",
        "Supports many different sizes of paper and envelopes",
        "Has a 100-sheet paper tray"
      ],
      "cons": [
        "Not a fast performer",
        "Uses a tri-color cartridge, which is not as efficient as single-ink cartridges"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Other than that it prints great!",
      "text": "I received it and added it to my computer. However, every time I print and leave the computer for a while I keep getting an error and then I have to turn it off by pulling the plug and then plugging it again. It works until the next time. I have never been able to use the on/off button on the printer. Wish I knew who to talk with about this problem. Other than that it prints great!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 178,
      "publication_date": 20180529
    },
    {
      "title": "Printer continually shows an error code",
      "text": "Twice I have sent this printer back because of an error code. When talking to HP they told me it was a hardware issue. So I was hoping my second one would work.... nope after a week, the error code was on this as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Louise Kizer",
      "helpful_votes": 180,
      "publication_date": 20180501
    },
    {
      "title": "printer color cartridge did not work. Kept telling us ...",
      "text": "printer color cartridge did not work. Kept telling us to reinstall. In general the printer itself feels cheap and not as high a quality as I would expect of an HP product.",
      "rating": 1.0,
      "verified": true,
      "author": "jaspal bhasin",
      "helpful_votes": 75,
      "publication_date": 20180519
    },
    {
      "title": "I dig it!",
      "text": "Love this new model! It’s bigger than I’d expected! But very sleek looking despite the massive size. It’s for home use! I’m a new business woman! So it’s great! We can’t scan. But the App scans and emails/prints. I’d recommend this printer. It’s pretty darn good.",
      "rating": 5.0,
      "verified": true,
      "author": "Tessa Allen",
      "helpful_votes": 66,
      "publication_date": 20180520
    },
    {
      "title": "Don't waste your time with this piece of crap",
      "text": "This printer was dead out of the box! As soon as I plugged it in, it flashed an error message across the screen. When I looked into the support page, it did not have the error code listed and instead gave me a list of verified support technicians that could service my device for a minimal charge. I am not going to pay to \"service\" a printer that only came out of the box 15 minutes ago! The HP customer service is a virtual assistant search tool and has no option for live support other than their list of support technicians. This is already headed back to Amazon. Don't waste your time with this piece of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Klow",
      "helpful_votes": 38,
      "publication_date": 20180724
    },
    {
      "title": "Easy set up, compact design, AWFUL photos",
      "text": "Set up was extremely easy. Good, space saving design. The alignment page printed correctly, but the photo I printed came out HORRIBLE. I selected glossy 4x6 in paper settings, but the picture was beyond terrible, and the ink smeared all over me. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 32,
      "publication_date": 20181125
    },
    {
      "title": "Easy to use easy to install",
      "text": "I am computer stupid. I am the person that failed at most compute stuff. I on my own set this up and used it!! On my own!! The quality is amazing! I so love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "rhywnn",
      "helpful_votes": 30,
      "publication_date": 20180521
    },
    {
      "title": "Cannot stress enough how bad it is",
      "text": "Edit: after owning this for a couple of years, I simply cannot stress enough how bad it is. I would not even recommend this product to my worst enemy. Software installation was a disaster, there was a screen that made it look like I couldn't even finish the installation without subscribing to ink delivery, and it only works 50% of the time with my laptop. There seems to be some compatibility issue. The hardware itself is also not great. Despite having lots of ink in it and having followed all cleaning procedures, it just does not print a single form clearly.",
      "rating": 1.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 29,
      "publication_date": 20180606
    },
    {
      "title": "Very poor experience and waste of money",
      "text": "Very poor experience and waste of money. After using it couple of days a week, it stopped printing giving \"Cartridge Problem\" messages. Tried all the recommended maneuvers including buying and installing new cartridges to no avail. Had to throw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Ali Dowlatdad",
      "helpful_votes": 21,
      "publication_date": 20180611
    },
    {
      "title": "Very functional, very affordable...and it's wireless!",
      "text": "This is a nice and truly wireless printer that is easy to set up and easy to use....right out of the box. While I am no fan of HPs expensive ink cartridges, other manufacturers have caught on and are not much cheaper. The printer's price was right...about $60... and the unit has loads of useful features. Print quality is good. Print speed is ok, not stellar but acceptable. The only thing I find a bit cheap on this printer is the use of a pull out tab to catch the printed papers instead of a tray. The functionality of this printer outweighs this small disappointment, however.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Richards",
      "helpful_votes": 12,
      "publication_date": 20190108
    },
    {
      "title": "Impressive overall.",
      "text": "Easy easy set up. I like the instant ink. I signed up immediately. Paper tray is within the printer. No paper sticking out. The HP smart app does wonder. I can also send prints to my printer from anywhere in the world. During setup, you will get the printer email address. Oh yes, it has an email address.",
      "rating": 5.0,
      "verified": true,
      "author": "ndu adighibe",
      "helpful_votes": 16,
      "publication_date": 20180728
    },
    {
      "title": "Great little printer",
      "text": "I purchased this as I dont have much space and I'm just starting school up again and needed a printer. I didn't know what to do because I really had No space to put it, even considering that it's wireless and I can place it a anywhere in my house with access to a plug. Finally creatively thinking I thought hmmm does it fit in a drawer so I pulled up the specs and measured my drawer and it looked like it might fit. I purchased it and right out of the box I put it in my drawer and it's a perfect fit. It prints wonderfully. I just wish the toner was cheaper lol.",
      "rating": 4.0,
      "verified": true,
      "author": "ABC1 Amazons Best Customer",
      "helpful_votes": 13,
      "publication_date": 20180827
    },
    {
      "title": "Smooth, smart and compact",
      "text": "I have it for a couple of weeks and it works perfectly with my Mac and iPhone. It comes with an offer for a subscription but it didn't seem fair paying a monthly fee to use my own printer. And the buttons to deny the insisting offers where hidden, so beware or you'll think is part of the installation process. Sometimes I have to print a lot in a week and then I spent another month printing absolutely nothing, the subscription options were not for me. But still, why should one be charged for using their own printer if we are already paying for the printer, paper, and toners? It seems absurd to me!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190907
    },
    {
      "title": "Very poor connected experience.",
      "text": "The connected behavior of this printed is annoying, poorly designed and intrusive. Using with Windows 10 each time I print I receive 9 disrupting HP Smart notifications. It won't let you dismiss them and they are not reporting any issue or condition. Also the printer reports a Kernel error 3 times a day rendering it useless unless I power cycle it. HP supports guidance? It's going back and I'm going back to Epson.",
      "rating": 1.0,
      "verified": true,
      "author": "CMarty",
      "helpful_votes": 24,
      "publication_date": 20180501
    },
    {
      "title": "Nice for the price",
      "text": "Very easy to get this printer up and running. It is necessary to go to the HP website to download the software, and that was an easy process. I like the easy access to the ink cartridges and the copies are nice and clear. For the price and for home use it's a great copier.",
      "rating": 5.0,
      "verified": true,
      "author": "Ghost Of The Great Highway",
      "helpful_votes": 11,
      "publication_date": 20180627
    },
    {
      "title": "Worthless piece of plastic",
      "text": "Never had such a disfunctional printer. I bought this one because Epson was changing their cartridge policy and HP still works with recycled cartridges... however I’m over fighting this printer. The HP does not work well the MacBook/Apple products and keeps changing its settings so the computer can’t find it. Perhaps the biggest issue is that it continues to completely crash when it runs out of paper and the only way to fix it is to complete unplug the thing and start over. The worst printer I’ve ever owned. Period. 1 stars for price and print quality.",
      "rating": 1.0,
      "verified": true,
      "author": "MessSF",
      "helpful_votes": 8,
      "publication_date": 20190211
    },
    {
      "title": "I' going to donate this piece of POOP to the GOOD WILL after two months",
      "text": "HP use to be a great company, but this latest printer probable was designed by HO employees after a hard night of drinking. First, you have to use THEIR brand new ink cartridges, or get stuck in some over price con they have as a money making way to sell ink. Second, if you have time to wait an hour or two, then you MAY get your printer to print out your photos. I'm sure glad that I DON'T own stock in HP if this is what their line of computer products have come to. Have been a HP printer user for 35 years, but not any more",
      "rating": 1.0,
      "verified": true,
      "author": "D. at LLRC",
      "helpful_votes": 9,
      "publication_date": 20181201
    },
    {
      "title": "Disappointed",
      "text": "It works nicely with both my iPad and desktop. Installing the ink cartridges the first time was extremely frustrating as there were no pictures in the instructions about which end goes in first, how far they needed to go in, or what position the latches should be in afterward. There is nothing to catch the printed pages when they come out; I’ll have to put a basket or something there. In decades of using various printers this is the first once since the days of the continuous fanfold paper that my printer doesn’t have some kind of tray for the output.",
      "rating": 3.0,
      "verified": true,
      "author": "T. W. Carrigan",
      "helpful_votes": 10,
      "publication_date": 20180913
    },
    {
      "title": "Picture printing very Frustrating",
      "text": "I cannot hide my frustration with this product. I was happy with it in the beginning, the set up was easy, quality acceptable and the fact was multi functional very attractive. But when I printed pictures in photo paper that was a mess; I could remove the picture just using my finger, first I thought that was because I was using a non-hp glossy paper then I bough the hp one and get the same result. I made several trials try to change configuration and did not work. Is kind of frustrating because I was expecting to print pictures of my family and now I can’t do it. I can remove the color just by passing my finger",
      "rating": 3.0,
      "verified": true,
      "author": "Adrian Estuardo Cruz Rosas",
      "helpful_votes": 9,
      "publication_date": 20190108
    },
    {
      "title": "Surprisingly Decent - Per given 4eviews.",
      "text": "- I was nervous buying the product when I received it. - I was reading all of the reivews, but it seems to be corrected. - I followed the installation instructions, connected the wifi and it automatically updated it's software. - I was able to connect the Android software without issue, as well. - So far no major issues. A few things I don't like... - When printing double sided pages, it doesn't print the footer of documents. - The scanning feature only allows to save as PDF or JPG. I would love to see a BMP or TIFF option. - I'll update more as I use more of it's features.",
      "rating": 4.0,
      "verified": true,
      "author": "Armando",
      "helpful_votes": 7,
      "publication_date": 20190314
    },
    {
      "title": "This printer is extremely slow! If you want to ...",
      "text": "This printer is extremely slow! If you want to print or scan anything in a hurry then this is not the printer for you. Also, when scanning multiple pages you have to feed each page through one at a time or it will take all of them at once and jam the scanner. If I would have kept the box I would be shipping this printer back to get a refund. Unfortunately, I threw the box away so I'm stuck with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Paige",
      "helpful_votes": 10,
      "publication_date": 20180710
    },
    {
      "title": "Junk",
      "text": "Piece of junk. First time I tried to change the ink, the holder snapped off. Slow printer. Very slow. I will get something faster and better. I was trying to replace my old printer and this is the newer version. It stinks",
      "rating": 1.0,
      "verified": true,
      "author": "Don Custer",
      "helpful_votes": 7,
      "publication_date": 20190212
    },
    {
      "title": "Totally disgusted update",
      "text": "Purchased in August 2018. Tried several times but can not setup Fax. Now after four months I get the error message to remove and replace the ink cartridges. After that I can print one time and the message reappears. Ink level is good in both cartridges. Not very happy with this printer, would not recommend to anyone. Jan 2019 get a full page of colored lines when trying to copy or scan. Warrantied for 1 year?? Warranty ran our in September 2018 - what happened to the year??",
      "rating": 1.0,
      "verified": true,
      "author": "Reggie",
      "helpful_votes": 7,
      "publication_date": 20181220
    },
    {
      "title": "This HP printer is saweeet!",
      "text": "Very easy to set up. Many options to connect and print - cell phone, multiple computer platforms, through the app, or through the web. You can even email it in a pinch! Beautiful photo prints. Instant ink is a great deal. 15 pages for free each month, then $1 for extra sets of 10. Ink self orders, and lets you know when to change. No worries, no hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. Calderon",
      "helpful_votes": 8,
      "publication_date": 20181112
    },
    {
      "title": "WiFi Connection Issue, Touch Screen Issue",
      "text": "This printer constantly drops off its wifi connection and require you to mannually reconnect it every time. It takes a long time for it to reconnect so it's a huge headache. It has a USB connection, but using USB connection it won't let you scan documents. You can only scan documents with WiFI connection. In addition, this printer sometimes forces all Wifi devices on the network offline for some strange reasons. Touch screen is also not sensitive enough. You have to press repeatly for the screen to register your touch.",
      "rating": 1.0,
      "verified": true,
      "author": "Jun",
      "helpful_votes": 6,
      "publication_date": 20190430
    },
    {
      "title": "The printer is nice. The big problem was not being able to ...",
      "text": "The printer is nice. The big problem was not being able to set it up to print. We never did get the wireless set up and struggled with the USB . Finally the USB kicked in and we have a very nice printer. The confusing thing was the model number on the printer was one number and the number on the box and instructions were another. It turned out well with little fuss.",
      "rating": 4.0,
      "verified": true,
      "author": "PKing",
      "helpful_votes": 24,
      "publication_date": 20180420
    },
    {
      "title": "Instant Ink program not available for Puerto Rico",
      "text": "If you, like me, live in Puerto Rico and are, like me, interested in the Instant Ink program, I have bad news for you. It is not available for us. It is available for all 50 United States, Canada, United Kingdom, Germany, Spain and France, but not for Puerto Rico. It is available for Hawaii which is farther away, but it is not available for Puerto Rico. This is an unfortunate treatment to a market that buys millions of dollars in HP products and supplies. There is even a very large HP manufacturing operation on the island. Shame on you HP.",
      "rating": 3.0,
      "verified": true,
      "author": "Edmundo Ramirez Semprit",
      "helpful_votes": 7,
      "publication_date": 20180713
    },
    {
      "title": "Garbage",
      "text": "The only thing this device does as described is print. it refuses to connect to my computer when I try to scan or even install updates to the device. Called Tech support and they had the nerve to say that tech support isn't free and that I would have to pay extra because the product I bout like 3 months ago and used like 4 times is not working as described... I have since sen numerous issues described online regarding HP printers... This is the last HP product I will every buy.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Dineen",
      "helpful_votes": 6,
      "publication_date": 20190528
    },
    {
      "title": "Garbage...printed 3 pages then quit working completely",
      "text": "Biggest piece of garbage I have ever purchased. Worked for printing three (3) simple pages then quit working all together. Can't even print a simple Word page. Save your money. I could have put our $70 to better use buying a box of crayons. HP is total garbage now, used to be good but now steer clear of this printer.",
      "rating": 1.0,
      "verified": true,
      "author": "j-mess",
      "helpful_votes": 9,
      "publication_date": 20180705
    },
    {
      "title": "Easy to set up and use for phone, printer etc",
      "text": "Easy to set up, works great even with my older lap top. Now I can print from my phone or PC w/ out the wires. I'll be getting a second one for work. They try to get you to subscribe to ink purchases. I opted out so I don't have an opinion on if that's a good idea or not.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Proctor",
      "helpful_votes": 7,
      "publication_date": 20180624
    },
    {
      "title": "Super easy set-up.",
      "text": "Not sure about the mediocre reviews. This is a low budget printer, there are going to be some compromises. This was very easy to set up. I scanned a code and completed all set up on my phone. Cool. I like that the paper tray slides into the printer. Small footprint. Print quality seems good. I am a low volume user and the Instant Ink Program seems like a good deal. I hate running out to buy printer cartridges when I run out in the middle of a print job.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil M.",
      "helpful_votes": 6,
      "publication_date": 20181004
    },
    {
      "title": "HP 5525 printer a Winner",
      "text": "We have had 4 HP printers over the past 15 yrs. needless to say we love HP! Our last HP lasted 5 yrs.....when it came time to replace, we did compare several brands but decided to buy the HP Officejet 5525 All in One. We are very happy with it: it arrived on time, easy to set up in all areas: wireless networks, mobile devices, etc., print choices & qualities are very good, print speed actually better than advertised, print cartridges are reasonably priced & overall we love it. We did purchase an extended warranty. Will buy from Sellers again",
      "rating": 5.0,
      "verified": true,
      "author": "PK",
      "helpful_votes": 4,
      "publication_date": 20190627
    },
    {
      "title": "CRAZY PRINTER",
      "text": "This printer is insane for the price, it hooks up via HPSmart Print, can instantly send you ink, print from your phone and wirelessly print easier than anything. My mom has struggled printing from her chromebook to her non-wireless capable printer for years, it required taking her old super slow no battery laptop and plugging it into the non-wireless printer then printing from the chromebook. It worked I guess but it was a lot of work to only print return labels. Her colleague suggested this and I set it up, literally technology at its best. I'm considering get one for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 4,
      "publication_date": 20181030
    },
    {
      "title": "Perfect - works great, attractive price. Highly recommended.",
      "text": "Setup was easy using HP's \"Smart App\". It automatically synched with my WiFi. The quality of the color and B&W printing is excellent. I decided to sign up for the \"occasional\" Instant Ink program (50 pages per month at $2.99/mo, after a 4-month free period). Time will tell whether that is a good deal for my usage - if not, I will change to the \"light\" program or cancel altogether and just buy cartridges when needed. Print speed is a bit slow, but plenty fast for the way I use it for home usage. Scan, copy, fax, and print modes work flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Criner",
      "helpful_votes": 3,
      "publication_date": 20191126
    },
    {
      "title": "good printer",
      "text": "we needed a basic Bluetooth printer for the house, so this seemed like a good option for the money. the set up was relatively easy, it was a little tricky figuring out the codes to connect it to the smartphones through the HP app, but now that everything is connected right, it works perfectly. we are still on the original ink cartridges that came with the printer because we really dont print much, so at this time its hard to tell how long they last and how easy it will be to install the replacements but for now- no complains.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 3,
      "publication_date": 20191224
    },
    {
      "title": "does the simple jobs for me",
      "text": "i print for information and documentation of purchases... not photos or full color pages. this smaller model fits my space better and does the job for me. fine print is crisp and clean. it's relatively quiet, but on the slow side... not an issue for my uses. small volume paper tray. ding'ed one star because vendor sent me an apparently obsolete model, and i bet they knew it. HP Support was *awesome*. i had a replacement of same model machine within a very short time (2-3 days) and sent prepaid shipping label so no shipping cost to return defective unit. i'm very satisfied with them but not amazon vendor.",
      "rating": 3.0,
      "verified": true,
      "author": "spark*l",
      "helpful_votes": 3,
      "publication_date": 20190817
    },
    {
      "title": "Shipping cost to return",
      "text": "Printer wouldn’t move past the printing printer alignment page. Printer alignment page printed once and then printer registered a paper jam even though no paper was stuck. Attempted soft and hard reset of printer. Paper wouldn’t feed and printer never went past alignment printing. Wanted to return it but Amazon will only pay up to 3.99 for shipping. I don’t understand why I have to pay to send back a defective item. I’m currently stationed in Okinawa Japan. The cost of shipping could match the purchased price of the printer. My husband has decided to call HP for help.",
      "rating": 1.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 6,
      "publication_date": 20180907
    },
    {
      "title": "BEWARE!!!  Only Returnable for 30 days",
      "text": "I ordered this printer on January 27th. My return window ended on February 27th. It stopped working on March 14th. I had two new OEM Ink Cartridges in the printer and I keep getting an error that says \"Remove and Reinstall the cartridges making sure they are correctly installed. If this message continues to appear, replace the indicated cartridges.\" First of all, these cartridges are very expensive and these two are brand new. I have tried 50 times to remove and reinstall and I am still getting the error. I am working from home and this printer is crucial to my business. It infuriates me that I cannot return this printer.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucy G. Hodnett",
      "helpful_votes": 2,
      "publication_date": 20200408
    },
    {
      "title": "Slow. Slow. Slow.",
      "text": "I bought this cheap printer to replace another that died. Setup was fairly simple with Windows 10. Easy to transfer my instant ink subscription to it. It works with Linux but it wasn't so easy to set up on there. (Using Mint 18) Printed things look nice. But it's SO SLOW. Copying a page (in black and white, even) took several minutes. One page. And it doesn't scan the entire page in one go - it scans a small section, then s-l-o-w-l-y prints that thin strip, then scans another section, etc. Printing directly is a little faster, but not by a lot. I didn't expect a lot for the price... but I expected better than this.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Swank",
      "helpful_votes": 4,
      "publication_date": 20190119
    },
    {
      "title": "If I could give it a negative rating, I would",
      "text": "100% do NOT recommend this printer. It takes FOREVER to print, if it even prints. It cancels almost every one of my printing after printing a page or 2. It takes literally 10 minutes to print a colored cardstock page. It will only print one cardstock page at a time without jamming and having to open everything up. It only prints on paper and cardstock, for me. Everything else I tried, did nothing. I have a ton of prints from HP but the darn printer won't print so I can't use any. I will be getting rid of this printer ASAP and switching to a better quality one.",
      "rating": 1.0,
      "verified": true,
      "author": "Krista K",
      "helpful_votes": 5,
      "publication_date": 20181204
    },
    {
      "title": "Great Printer for the price",
      "text": "I needed a reliable printer/scanner to be able to work from home and this was a very cost effective solution. HP products have always been reliable for me whereas some other common brands have not. I'm not a heavy printer so this basic setup works well. It prints nicely, scans clean, and performs as expected. Having the auto document feeder and the ability to print duplex are convenience items that were well worth spending a few extra bucks over some of the more basic models. Setup was very simple. Very pleased with this printer!",
      "rating": 5.0,
      "verified": true,
      "author": "NHTFR",
      "helpful_votes": 2,
      "publication_date": 20191126
    },
    {
      "title": "Good basic AIO HP printer",
      "text": "This is a relatively good AIO printer, scanner, copier, fax for the HP OfficeJet series. I like it because of the low profile of the chassis. The touch screen hierarchy and operation could be improved. However for the price, it should cover most of your basic printing jobs. If you do more graphic, photo printing you may want to purchase the higher HP series 7000-9000 Office jet series which will give you a better resolution and print quality including more features. But expect to spend at least double the price for such print quality, but it would be worth it to you for better graphic and photo quality for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Ll",
      "helpful_votes": 3,
      "publication_date": 20191107
    },
    {
      "title": "The “ support” was useless. I am NOT going on Facebook or tweeting ...",
      "text": "I have a similar older HP 5200. This is a 5250. The new one in setting up stalled out at “only one set of hp instaprint cartridges can be used at a time” No other options given. Replacing the brand new cartridges with ink I was using on my old printer was equally unsuccessful, but we know they were therefore not counterfeit, one of the possible explanations given under help. The “ support” was useless. I am NOT going on Facebook or tweeting for support. Will never bother with HP again. The manual is written by Martians",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry Davis",
      "helpful_votes": 7,
      "publication_date": 20180724
    },
    {
      "title": "NOT RELIABLE & TOO MANY COMMERCIALS TO SELL INK!",
      "text": "This is the 4th HP printer I have had. 3 in the last year. All are more problems than service. I think HPs only concern is selling Ink but someone in the company isn't understanding that to sell ink the printer HAS TO BE WORKING PROPERLY. I'm done with them. Their product isn't reliable. I'll try another company & hope they're better. The most satisfactory day I will hav with this HP 5250 printer is tomorrow when I throw this worthless piece of garbage and source of endless disappointment & frustration into the compactor at the county DUMP!",
      "rating": 1.0,
      "verified": true,
      "author": "Allan",
      "helpful_votes": 3,
      "publication_date": 20190519
    },
    {
      "title": "Bad cartridges right out of the box, unable to download app on anything but my phone.",
      "text": "Right out of the box it told me that one of the cartridges was bad but it wouldn't tell me which one it was. I finally figured it out by myself as there is no way to contact customer service. Then it wouldn't let me log on to the website because it said my computer and my kindle were to old. My son has one that he hasn't had any problems with and he feels horrible that it won't work for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 4,
      "publication_date": 20180910
    },
    {
      "title": "6 months and gone.....",
      "text": "I owned the product for 6 months and the black ink print head died. Not good.... Maybe this is why the print quality was so bad as the head may have been defective from the factory :-(",
      "rating": 1.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 5,
      "publication_date": 20190314
    },
    {
      "title": "NOT an \"easy setup\"",
      "text": "\"Setup is easy as 123.hp.com\" This is not at all true. After getting the run around from the system for an hour I still have not been able to get the printer up and running. It keeps trying to get me to subscribe to the ink replenishment system. Very frustrated and angry. I suggest another printer if you want something easy.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris H.",
      "helpful_votes": 5,
      "publication_date": 20190313
    },
    {
      "title": "Excellent Replacement Printer",
      "text": "Replaced old HP Deskjet that still works, but this model is more convenient, faster and COST LESS than my old printer's ink cartridges. Cartridges for this model are comparable. Easy wireless/ Bluetooth connectivity; no need for HP tech (who take you on a world tour in a phone call). I setup in less than 10 min from android and connected with other androids as well. A friend used their iPhone to print from this one. Hope this lasts as long and is as dependable as my old printer. Quality is excellent in both color and B/W. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "kei.Top Contributor: Nail Polish",
      "helpful_votes": 2,
      "publication_date": 20200210
    },
    {
      "title": "cannot scan",
      "text": "Cannot scan. Message said to download scan app. Asked for computer password. What? Asked for serial number, but when I entered the serial number HP did not recognize it. So if you want an all-in-one printer, don't purchase this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Pacific",
      "helpful_votes": 4,
      "publication_date": 20190313
    },
    {
      "title": "HP PRINTER IS JUNK!!!!!!!!!!!!",
      "text": "I installed this a month ago. HP new program. You don't get a disc with driver or anything. Now they are not talking and it has become useless. My last HP had the disc with the driver so you could uninstall the printer and then add it back on with driver from the disc. Now they don't give you a driver so when it quits. YOU ARE DONE. Have to buy a new printer because my NEW HP Printer is toast.",
      "rating": 1.0,
      "verified": true,
      "author": "wirefoxie",
      "helpful_votes": 2,
      "publication_date": 20191208
    },
    {
      "title": "DONT BUY THIS PRINTER",
      "text": "THIS IS A HORRIBLE PRINTER AND CERTAINLY HP123 EASY, ANYTHING BUT. I downloaded aps to laptop and I phone plus printer docs. It connected to WIFI and same as IPhone WIFI but cannot find printer when try to print. HP support useless after on phone over one hour. My neighbor is IT expert with 13 years experience and he could not connect it either, too late to return so going in trash and will buy another, but not HP - one start only cause it is sleek design",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190319
    },
    {
      "title": "I bought it because it prints 2-sided on card stock.",
      "text": "I had a 5200 before, and I really liked it, but gave it away to a friend because I bought the 9000 series for the 2 paper trays and faster printing. I do a lot of 2-sided card stock printing. Unfortunately, the 9000 doesn't do that (and that's super hard info to find that it doesn't do cardstock.) I like the 9000 but I really needed duplex card stock. Since my previous 5200 did it, I got another one. This one lists as not being able to do duplex card stock just like the 9000, but the 5200 does. Problem solved...except I now have two printers in my office. Oh well, it makes me look more important. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Bordon",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Color reproduction",
      "text": "Product arrived on time and was easy to set up. However, I needed decent color production and was very disappointed. I waited until I got my full ink cartridges and tried again. First color copy was OK but the 2nd and 3rd were faded (hazy) and darker than the first copy. With the 3-in-one color cartridge there was no way to adjust. Color copies also took a lot longer than specifications - almost 1min per page. Doing my best to get this returned. Have used HP printers for over 25 years and always been happy. Very disappointed with this one.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Long",
      "helpful_votes": 3,
      "publication_date": 20181101
    },
    {
      "title": "Lemon",
      "text": "This printer is crap. I have had it for two months and no one can figure out how to get it working. It keeps saying something is wrong with the cartridge by no matter what you can’t fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "toniT",
      "helpful_votes": 4,
      "publication_date": 20190207
    },
    {
      "title": "Next to impossible to connect to wireless networks from place to place",
      "text": "We purchased this printer to use at special events involving hundreds of people. We went to our venue two weeks in advance to test connecting to the wireless network. After two hours of ridiculousness, we finally did. When we returned to the same venue two weeks later for the event itself, another two hours and no connection to wireless. We had to resort to someone going to a nearby office to get a wired connection. We had another event the following weekend, at the same venue, and again resorted to a wired in connection, forever plugging in from one computer to another. Wish we had gotten the same Epson we had before.",
      "rating": 1.0,
      "verified": true,
      "author": "Lilli B",
      "helpful_votes": 4,
      "publication_date": 20190521
    },
    {
      "title": "Instant ink program not for me thank you",
      "text": "I loved this printer and I don’t print very much but I made the mistake of joining the “Instant Ink” program. Don’t do it! You can’t get out. You will get lots of notifications from HP and charges to your credit card. I have always went to Staples and replaced ink when needed. I don,t know what I was thinking of. I ended up throwing out this perfectly good printer and buying a cannon printer from Walmart. So relieved to be out of HPs grasp. The HP printer worked great.",
      "rating": 1.0,
      "verified": true,
      "author": "tbs",
      "helpful_votes": 2,
      "publication_date": 20190909
    },
    {
      "title": "it was a great printer",
      "text": "This was the perfect printer for my college student. After being left unused for the summer, it no longer works. We have tried everything. It will print the test page but will not print from computer, tablet, or phone. We will be investigating the warranty since we are barely within the year.",
      "rating": 1.0,
      "verified": true,
      "author": "mommypeppy",
      "helpful_votes": 3,
      "publication_date": 20190901
    },
    {
      "title": "Warning- Must use HP ink cartidges",
      "text": "Nice printer, but you must use must buy new HP ink cartridges. Off-Brand or refills probably wont work. Dynamic security enabled printer. Intended to be used with cartridges using only HP original electronic circuitry. Cartridges with modified or non-HP electronic circuitry may not work, and those that work today may not work in the future. Look for printers without that HP design.",
      "rating": 4.0,
      "verified": true,
      "author": "wazz99",
      "helpful_votes": 4,
      "publication_date": 20181212
    },
    {
      "title": "disaster",
      "text": "I have been unable to use this printer I have spent hours reading and following suggestions from HP the lap top does not communicate with the printer. as far as I understand HP suggest to disable windows firewall. isn't that dangerous.. I have yet to be able to solve issue via on line help once I calm down I will pursue speaking with a tech person from HP Buyers be where set up is to complicated.",
      "rating": 2.0,
      "verified": true,
      "author": "patricia farrington",
      "helpful_votes": 3,
      "publication_date": 20180604
    },
    {
      "title": "Don’t expend your money",
      "text": "Ok. Here I come. Before I bought this printer I made some research and omg, was a mistake. Has been long time since I bought this and I regret. Quality of the copy is bad and don’t matter from where I try print something, never work. Don’t expend your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 5,
      "publication_date": 20190201
    },
    {
      "title": "Best all-in-1 bluetooth wifi printer!",
      "text": "Needed a printer for so long and decided to order this one for my home. I can honestly say thank you HP for having such a great product (and Amazon for getting it to me the next day). Easy to setup manually or with the hp app. If you're looking to set it with the app please make sure you sign into your wifi first before anything else. If not manual set up is just as fine and takes about the same time as through the app. When connecting to your app it is the oj5200 series.... I love my printer and couldn't be happier, you can print from anywhere and send prints to the printer email the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Chynee",
      "helpful_votes": 2,
      "publication_date": 20200216
    },
    {
      "title": "I like it!",
      "text": "I've had the printer since February and so far I haven't had any issues with it. It suits my needs especially for the price. So far I've printed documents and pictures. The quality is beautiful. Though I will say having good paper is also important. I use HP paper both for printing and for photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190419
    },
    {
      "title": "Do not waste your money. DO NOT WASTE YOUR MONEY. Believe the bad reviews",
      "text": "G A R B A G E !!! Worst printer I’ve ever came across! Prints from my phone but not my computer. Prints half the page and then stops. First try of printing is ALWAYS unsuccessful! I always have to send docs to my email and print from my phone for a successful print. Disconnected the wifi and and it again and now it WILL NOT print from my computer. Complete junk!",
      "rating": 1.0,
      "verified": true,
      "author": "Warriorkid",
      "helpful_votes": 2,
      "publication_date": 20191103
    },
    {
      "title": "Printer with great features if you know how to use them",
      "text": "Everything I wanted in a printer fax and copier. Love the fact that I can print from my phone. The color is vibrant. I had no trouble with faxing. And the best feature is scanning documents from printer which are then sent to my phone through the HP app. This makes emailing documents such as resumes super easy without going to the library. I just insert my resume in the printer hit scan on my phone and the document saves to my phone I then attach to email and send. To unlock all the features watch YouTube or look through the manual",
      "rating": 5.0,
      "verified": true,
      "author": "Rocky B",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Pure Garbage",
      "text": "I used this printer a grand total of 3 times since i bought it and now the print head is locked in the right hand position and won't move, I can't get hp on the line to try and get some customer support and finally I'm done trying ....HP has failed me every time that I have taken a chance on them learn from my mistakes and stay far away from their garbage products",
      "rating": 1.0,
      "verified": true,
      "author": "keith",
      "helpful_votes": 4,
      "publication_date": 20190501
    },
    {
      "title": "Good HP Printer for the price; Ink cartridge is tempermental",
      "text": "I had an HP 4700 series forever and loved it!. I got a new laptop and it stopped scanning and was over 8 years old so I decided to get another HP. After doing research, I decided to get this one versus the older version. So far, I like it except that I have a little trouble getting the ink cartridges in. With my old printer, you just drop them in and snap them secure. This one, you have to jiggle it a bit otherwise I'd give it 5 stars. Really easy set up.",
      "rating": 4.0,
      "verified": true,
      "author": "M3 in Seattle",
      "helpful_votes": 2,
      "publication_date": 20190223
    },
    {
      "title": "PERFECT PRINTER FOR THE PRICE",
      "text": "I work from home and this was the perfect printer I needed! Not too big (which is what I wanted since it is sitting out in my home office), scanner, and document feeder as a few of the many features. Prints reasonably fast for a compact printer and the ink lasts quite a while.",
      "rating": 5.0,
      "verified": true,
      "author": "JE",
      "helpful_votes": 4,
      "publication_date": 20190224
    },
    {
      "title": "KEEP LOOKING FOR A BETTER PRINTER THAN THIS!",
      "text": "This POS printer makes me so annoyed! I have to unplug it almost every day to re-boot it. It freezes, it drops of network, it stops printing. It may actually be the WORST HP Product I have ever encountered. I will probably not even get 6 months out of it before I replace it, just because keeping it working is such a giant TIME SUCK!",
      "rating": 1.0,
      "verified": true,
      "author": "Kent Taylor",
      "helpful_votes": 3,
      "publication_date": 20180721
    },
    {
      "title": "Much nicer than my Canon",
      "text": "I wasn't expecting to like the HP, esp after so many bad reviews. It's been a month so far, and this is the best + cheapest printer I've owned. I've already used the tray feeder to scan multiple pages at once (neat!), it's low profile, quiet, fast, and it tells HP when to ship more ink. I wasn't expecting to like that either, but it's cheaper to operate than the Canon 6300 it replaced. Hope it lasts!",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Calzone",
      "helpful_votes": 2,
      "publication_date": 20190510
    },
    {
      "title": "Avoid this piece of junk",
      "text": "Brand new HP cartridges will not load. HP help says update the firmware, but we can't update without first getting the cartridge loaded.",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 6,
      "publication_date": 20190206
    },
    {
      "title": "Fast set up!",
      "text": "This was a replacement for my HP2600 series only because I needed a printer with a document feeder. Installation was really fast; I had it up and running in 10 minutes or less. Simple set up and clear, easy to read touch screen. Not sure how long the ink that came with it will last, but I ordered replacements today and they are really reasonable. Highly recommend this printer for small office/home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannie Snow",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Setup and software loading was slow, but so far it works ok",
      "text": "Took forever to connect to the wireless and software load kept getting hung up on checking my laptop for existing drivers. Once all connected, it scanned in some docs quickly and easy to understand the software, same for printing. After printing some black and white documents, they print great, even on the lowest print setting. Speed is objective. For me the few documents I print a month speed is not a consideration.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "good home printer",
      "text": "Solid, easy to set-up and use home printer. kids use it for homework assignments, which taxes the ink cartridges; but, I’ve yet to see a printer of any price range that doesn’t make profits via ink (kinda like concessions at the movies). Pros: reliable relatively quiet very good color prints Inexpensive Cons: paper tray too small Ink is very expensive Overall, a good home printer if not heavily used",
      "rating": 5.0,
      "verified": true,
      "author": "JRB3",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "DO NOT BUY THIS PRODUCT !!",
      "text": "Hp printer works well until you need to replace ink. Even when you use \"Genuine HP Product\". So if you want a disposable printer this will work great. When the ink is replaced the first page only partially prints out. Page 2 - remainder print fine. If you only have one page you must print 2 copies. The first is junk and the 2nd one is good. All this does is waste time, ink and paper. DO NOT BUY THIS PRODUCT",
      "rating": 1.0,
      "verified": true,
      "author": "Drew A. Monardo",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "Good mid range printer.",
      "text": "Received this morning, unpacked, setup in less than 5 min. Replaced my Envy 7640 with this one. My Envy kept giving me error, remove and reinstall ink cartridge, did that many times, still no work. I saw reviews on the Office Jet 5255 and noticed some users had same problem as I did with my Envy. So now maybe I'm thinking it's a software issue (same basic drivers and 2 different machines). So think I'll hold on to Envy and occassionally check for updates. So far Office Jet 5255 is working as advertized.",
      "rating": 5.0,
      "verified": true,
      "author": "John D",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "CONSTANTLY JAMS",
      "text": "Usually satisfied with HP products but this one is unacceptable. Had it less than three months and I'm ready to buy a replacement. Will not work for my tax business.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Agnello",
      "helpful_votes": 4,
      "publication_date": 20181106
    },
    {
      "title": "Meeting my needs working from home during COVID 19",
      "text": "I bought this because I can’t go into my office for scanning, printing, and copying because of COVID 19. I needed something quick and it wasn’t outrageously priced. I received it this week and being a bit technologically challenged I waited until I had no interruptions from work to set it up. It went very smoothly. The instructions appear sparse but they work. Copies are crisp, scanner worked very well. Happy so far, but I am not a person to keep hard copies. If you do massive amounts of copies, this may not be the product for you. If you want an fairly inexpensive all in one this works.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Schuler",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "WIFI ready printer for multiple devices",
      "text": "I bought this printer to replace an older one. The printer is a multi device printer for my home network. It was easy to set up for my computer. Unfortunately, when it came to getting tablets and cell phones to print it was a different story. It took numerous tries, alot of patience, and about 3 hours to get 2 different tablets and cell phones ready to print. The print quality is great. The touch screen is ok if you have small fingers.",
      "rating": 4.0,
      "verified": true,
      "author": "L A Cahoun",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Shipping Labels to print??? ... a waste of time unless you've got 5+ minutes per label.",
      "text": "While the unit installed fine - including printer drivers - and also prints basic documents alright, it is very, very slow to print out a shipping label. It took over 5 minutes just to print a 4 1/2 x 6 3/4 label. I was updating my shipping equipment and everything was going good until this. After initially printing slowly, I re-Installed the printer drivers right off the HP website, still printed just as slow afterwards. Had to go back to my 6 year old HP 8100 which typically prints a label in about 15 seconds.",
      "rating": 2.0,
      "verified": true,
      "author": "V.W. House",
      "helpful_votes": 2,
      "publication_date": 20190129
    },
    {
      "title": "Frustrating",
      "text": "This thing has issues it gets hung up when shutting down all the time. I have to unplug the unit. Cant figure out how to copy double sided. I follow the set up but one side copies only. The company does not provide readily a support number.",
      "rating": 3.0,
      "verified": true,
      "author": "Destressed & Chic",
      "helpful_votes": 3,
      "publication_date": 20180725
    },
    {
      "title": "Uses a lot of ink and it is expensive!",
      "text": "This product uses a lot more ink than expected! Print quality is good, had a paper jam recently and was easy to fix. I purchased this because I have always used HP, but since the ink is so expensive and is used so fast I don’t think I will buy HP next time. I think I will purchase the refillable tank that Shack advertises. I wish I would have done that to begin with!",
      "rating": 3.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 2,
      "publication_date": 20200114
    },
    {
      "title": "I knew better",
      "text": "I knew better than to buy HP but the price fit my budget. The tri color ink cartridge ran out within a day of very little printing. Tried a generic brand of ink that didn't work and so had to buy the HP name brand for top dollar. When it arrived it wasn't recognized. Anyway I am not happy with the quality of the printer. It feels cheap and not the quality of my old Canon printer. I knew better but thought I would save money.",
      "rating": 2.0,
      "verified": true,
      "author": "Map Man",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Best printer I have ever had",
      "text": "Love that it is wireless! This is the best printer I have ever owned and one of things that is awesome is you can add other phones, lap tops, tablets and send it to your printer! If my kid needs to print something from her phone or laptop she can and I can print from my stuff too! I would recommend this printer! Follow the instructions and it should set up just fine. It even has a follow a long after you pair it with blue tooth!",
      "rating": 5.0,
      "verified": true,
      "author": "Well Read Human",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Buggy firmware",
      "text": "When unit was left on for a while there is a firmware error. Requires a power cycle to fix. Firmware updates didn't fix the issue. This applies to HP Instant Ink. Use up the included cartridges before signing up for service. Otherwise what ink is left in the included cartridge will be part of the Instant Ink program. So you essentially lose what you paid for. Also buy another set of cartridges for big print jobs like during tax time so you can use the free tier service as much as possible.",
      "rating": 3.0,
      "verified": true,
      "author": "HBMaGneT",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Easy to setup and use",
      "text": "Most printers have very average ratings and for good reason; they fail to perform when needed or don't last and the quality of printing leaves a lot to be desired. This printer was easy to set up (in about twenty minutes) with multiple devices. I have had no difficulties printing, scanning or copying. Based on past history with printers I would say this one has delivered at higher level than expected. Actually it has completely met my expectations because it works as expected when needed and that's not easy to say with many printers I've used in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Finley",
      "helpful_votes": 2,
      "publication_date": 20181019
    },
    {
      "title": "Save your Money... Try Brother or Epson.",
      "text": "Constantly has to be reconnected with the WiFi Network. HP App is a waste of time... recognizes the Printer, then doesn’t recognize the Printer ? When trying to Print from IOS (Air Print), the App indicates.... “ No Printers Found” ? On a rare occasion, when I was able to Print... Font size was about 20 or 30 ! No instructions on how to adjust size. Save your Money... Try Brother or Epson.",
      "rating": 1.0,
      "verified": true,
      "author": "Rizz224",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "HP OfficeJet 5255 Wireless All-in-One Printer was easy to install",
      "text": "HP OfficeJet 5255 Wireless All-in-One Printer was easy to install. I needed to scan lots of pictures and documents and this new HP made it go much smoother and faster.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane Banks",
      "helpful_votes": 5,
      "publication_date": 20180502
    },
    {
      "title": "Easy and Quick Setup Mac and iPhone",
      "text": "Setup was straightforward and fast on all my Apple devices (iPhone, Mac, etc). Ran through on screen menus and connect to wifi. Took maybe 15 minutes to setup and connect to devices. Both scans and prints were nice. Happy with price and features.",
      "rating": 5.0,
      "verified": true,
      "author": "DBH2",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "DO NOT BUY THIS PIECE OF JUNK",
      "text": "I am beyond disappointed with this printer. I barely get it out of the box and get it set up and it keeps saying there is a paper jam. I have opened it all the way up multiple times and there is NO paper jam....I had a HP 5520 and I got rid of it because it kept saying the same thing.. That printer lasted 7 years.. this one didnt even make it through 1 job.",
      "rating": 1.0,
      "verified": true,
      "author": "tylor",
      "helpful_votes": 5,
      "publication_date": 20190309
    },
    {
      "title": "Defective unit",
      "text": "The unit we received never worked. It has some cheap little cover that is supposed to lock the ink cartridges into place. On our unit, it was not securely fastened and would pop out of place when the ink cartridges were installed. Without it, the ink cartridges would not sit in the right position, and the printer would not detect them. So the whole thing was useless. Luckily Amazon has a good return policy...",
      "rating": 1.0,
      "verified": true,
      "author": "Anh",
      "helpful_votes": 3,
      "publication_date": 20180819
    },
    {
      "title": "Great Printer",
      "text": "Printer prints & scans quality copies. Did not have to sign up for instant ink. Bought my own ink at Walmart. Took a bit to set up. You have to use the instant ink they supply you with at first. But only until you set up printer & decline Instant Ink program. Then I removed Instant Ink cartridges & put in non instant ink cartridges I had purchased. Very happy with product.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura A.",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Almost Perfect",
      "text": "Printer delivered in original packaging. Set-up was easy until we got to inserting the ink cartridges. This printer comes with 2 setup ink cartridges, one black, one cyan/magenta/yellow combo. They were easy to install but I kept getting an error that there was an ink cartridge problem. Removed, cleaned contacts, and re-inserted several times and kept getting the error. It was unclear what the specific problem was but finally figured out that the black setup cartridge was defective. Had to go out and purchase a standard black ink cartridge and once that was installed everything was good. A couple hours wasted trouble shooting the problem and going out to get a replacement ink cartridge. Printer working well otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie S. Smith",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Good printer; reliable; easy to connect and use",
      "text": "This printer provides high quality printing and easy connections from computers and mobile devices via Wi-Fi. The copier/scanner and its feeder work well. So far in four months of moderate use, we have had only one paper jam; one of my children had tried to load the paper, and I suspect he didn't do it exactly right. The one thing I would change is that the printer does not seem to have a manual feeder for printing on special paper or envelopes. You have to load those into the main paper tray. But that's a small inconvenience in an otherwise great home printer/scanner/copier.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary S.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great for the price!",
      "text": "Extremely easy set up for the printer. In no time I was printing from my phone. Shortly later, I added the laptop which was also easy (I use all Apple products). I rarely use a printer at home that much, however, the scanning feature will be nice to use. The only negative thing I have to add, is that HP really wants you to subscribe to an ink replacement plan. This was more annoying as they ask you more than once, and make it difficult to navigate away from.",
      "rating": 5.0,
      "verified": true,
      "author": "SC76",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Failed scanner after about 1  year",
      "text": "At first the printer was great, it scanned and printed. Slowly at first, then more and more often it would not connect to my macbook pro. I got a new app to force the scan and that seemed to work for a little bit. I am the only person using this printer. I use it about once a week to print 2-3 pages. Now it prints (about 95% of the time) but it will not scan at all. It tries really hard, the noises are all there, but says it can't EVER find the original. No reinstalled drivers or restarts will fix it. I guess for <$50 thats what you get.",
      "rating": 1.0,
      "verified": true,
      "author": "MarieKT",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Would not connect to wifi",
      "text": "I couldn’t get this printer to connect to my wifi. Spent hours trying to get it to connect, followed the troubleshooting guides, and still nothing. HOURS. I have to return it. I’ve always had unreliable wireless performance with HP printers. Maybe I’m doing something wrong, but I can’t figure out what that may be. I’ve installed wifi cameras and video doorbells successfully before. Don’t know why HP printers are giving me issues.",
      "rating": 1.0,
      "verified": true,
      "author": "JS 1",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "Super Easy Set Up",
      "text": "Admittedly, I have had this printer for less than 24 hours, but the set up was a breeze and it worked like magic. It is awesome to be able to print from all devices (iPhones, iPad, laptops) in any room of the house. Print quality is amazing and the double-sided printing option is also AWESOME. Honestly I was expecting some bumps as I set the printer up, but it was up and running and printing from all devices in less than 30 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Adams",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "MY NEW BUSINESS PARTNER",
      "text": "Gave this 4 star's due to a couple of issues with getting it to reconnect to the internet after the initial setup.... HOWEVER I do love this printer as an upgrade to the Brother I had. I haven't tried printing pictures with it yet but I have printed colored shipping labels and designed thank you cards that turned out great on the first try. Also had no problems with the copier or scanner thus far. Printed easily from my phone and my PC (as long as the blue light was on). Needed a good safe bet and it seems I bought one!",
      "rating": 4.0,
      "verified": true,
      "author": "IC",
      "helpful_votes": 2,
      "publication_date": 20181002
    },
    {
      "title": "NOT a printer for beginnings",
      "text": "Used to be you could plug in a printer, plug it in and copy....This is not that kind of printer. Gripe: No printed information is provided -- all information goes through a tiny screen which is hard to read, you end up on line looking for better information anyway....could not comment on print quality.... Gripe: this machine needs a sturdy place to reside. My table currently is too small/ rickety for the printer. I will have to buy another printer stand, or sacrifice another already owned piece Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "sun27cap",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Disappointed in HP",
      "text": "When this printer decides to print the quality is good but it gets stuck in \"spooling\" on any big jobs. Tech support is on line and I have run the tool about 3 times. I do NOR recommend this printer.Ireturned to HP because the previous hp had been great. I have had this product for less than 3 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Jackie G",
      "helpful_votes": 2,
      "publication_date": 20190514
    }
  ],
  "product_meta": {
    "title": "HP OfficeJet 5255 Wireless All-in-One Printer, HP Instant Ink, Works with Alexa (M2U75A), Black",
    "description": "Style:PrinterGet more done in your day: Print, scan, copy, and fax at fast speeds, and keep tasks moving with the HP office jet 5255 All-in-One printer. Expect vivid color, crisp, sharp text, and borderless photos every time you print, plus breeze through Print jobs using the 35-page ADF and automatic two-sided printing. Easily set up your printer, scan documents with your smartphone camera, and print from social media or a number of cloud services with the HP Smart app.",
    "rating": 4.3,
    "feature_bullets": [
      "Replaces the HP OfficeJet 4650, HP OfficeJet 5255 comes with Bluetooth Smart, improved Wi-Fi connectivity, faster print speeds and more",
      "Accomplish everything in your home office – This all in one wireless printer adapts to everything your work day requires: print, scan, copy and fax efficiently with a 35-page auto-document feeder, automatic two-sided printing and touchscreen",
      "Ink delivered to your home: get your first 2 months free when you enroll in HP Instant Ink (optional) during printer set up; plans starting at $2.99 per month after the trial period, shipping and recycling included",
      "The power of your printer in the palm of your hand – The HP Smart app allows you to easily set up your wireless printer, scan documents with your camera, and print from social media or the cloud, such as iCloud, Google Drive, and Dropbox",
      "A new level of wireless connectivity you can count on – Get a stable, reliable wireless connection with dual band Wi-Fi, and go from box to set-up fast with Bluetooth Smart",
      "Your device, your choice – Print PDF, email attachments, flyers or business presentations from your mobile devices, laptop and desktop computer, or directly from the USB port; send/receive faxes with rear phone port",
      "Wide range of paper size support – This color printer works with letter, legal, 4 x 6 in, 5 x 7 in, 8 x 10 in, and No 10 envelopes",
      "One-year limited hardware warranty – 24-hour, 7 days a week FREE HP Web support"
    ],
    "specifications": {
      "Manufacturer": "Hp",
      "Brand": "HP",
      "Item Weight": "14.44 pounds",
      "Product Dimensions": "17.52 x 14.45 x 7.52 inches",
      "Item model number": "OJ 5255",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Material Type": "Plastic",
      "Number of Items": "1",
      "Size": "One size",
      "Sheet Size": "3 x 5 to 8.5 x 14, Letter, Legal, Envelope",
      "Manufacturer Part Number": "5255",
      "ASIN": "B07997C366",
      "Customer Reviews": "4.3 out of 5 stars3,956 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#4,382 in Office Products",
      "Date First Available": "April 1, 2018"
    },
    "categories": [
      "Printers & Accessories",
      "Office Products",
      "Electronics",
      "Printers",
      "Office Electronics",
      "Inkjet Printers"
    ],
    "price": 124.13
  }
}