{
  "website_summaries": [
    {
      "verdict": "One of the best camera flashes to choose when you want something wireless and remote controlled.",
      "pros": [
        "2.4G wireless radio is compatible with most Canon DSLR cameras for advanced remote controls",
        "Flash includes an auto zoom and exposure compensator that work directly with the camera’s settings",
        "Offers three groups of light control and 16 channels"
      ],
      "cons": [
        "Wireless radio can experience connection issues with certain Canon cameras",
        "Canon compatibility only"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quality for a flash beginner",
      "text": "After much research, I purchased the ESDDI Flash Speedlite for use with my Nikon D7200. I am a photography enthusiast/hobbyist who is a beginner in the realm of flash. So many reviews, so many opinions are available; I was unsure of the quality I would receive at this price point, and was considering a higher-priced unit. However, I decided that the ESDDI Speedlite should suit my needs just fine. I find that the ESDDI Speedlite is well-made, with features available on higher-priced flash units, and works great. I look forward to more practice with the flash, and great results.",
      "rating": 5.0,
      "verified": true,
      "author": "JBelgard",
      "helpful_votes": 12,
      "publication_date": 20181124
    },
    {
      "title": "It's good",
      "text": "I don't know why but in spite of the good reviews I still expected this product to be completely horrible. I guess it's because I've had such horrible luck with cheap camera equipment (you can thank neewer for that). To my surprise, everything works as advertised so far. You can believe that I will be keeping a close eye on it and updating this review if it has any quality issues though, as my experience with cheaply made camera equipment is it works really well for a very short period of time then it begins having serious issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Kamel",
      "helpful_votes": 7,
      "publication_date": 20190524
    },
    {
      "title": "Incredible feature-rich flash for a low price",
      "text": "This flash works seamlessly with my Canon DSLR via the E-TTL metering, and I couldn't be happier with the result. It has so many features I'm still learning, but it allows great portrait photos inside and outdoor low-light scenes such as subjects with a sunset in the background. I originally hadn't thought about setting up a master / slave for some of my shots, but this flash makes it look so simple and inexpensive I may just have to get a softbox and give it a try. Good on ESDDI for creating a solid feature-rich product.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveA",
      "helpful_votes": 6,
      "publication_date": 20190516
    },
    {
      "title": "Read the instructions and / or watch video of product",
      "text": "I am a novice when it come to camera and flashes. I'm my family historian when it come to events. Under normal circumstances, I take decent photos and videos but because of lighting in some venues, I need an external flash. I didn't want to spend a lot of money on my first flash and this fit the bill. It does everything I needed it to do and more. My pictures and video looks much better and I don't need to use software to correct lighting issue which takes time. If you a novice like me make sure you read the instructions for the camera and the flash, this will help with setup.",
      "rating": 5.0,
      "verified": true,
      "author": "KennyG",
      "helpful_votes": 4,
      "publication_date": 20181206
    },
    {
      "title": "AF assist does not work on newer model Canon cameras",
      "text": "Pros: - feature packed, and holds its own against flashes that are hundreds of dollars more. Cons: - Autofocus assist beam does not work properly with Canon 6D mark ii OR 1DX mark ii. Overall, well worth the money if your camera is old enough to be compatible (seems to be 2015 and older) or if you never plan on needing the AF assist beam. I personally do, so I will be returning it.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe Fadden",
      "helpful_votes": 2,
      "publication_date": 20190825
    },
    {
      "title": "GREAT FLASH FOR THE PRICE!",
      "text": "It works great, I like that it uses regular batteries so I can always have them ready no need to charge them. It comes with a stand and a wireless trigger. Both nice extras. I purchased another flash from Godox for DOUBLE the money and that flash was a dud! This flash is a GREAT VALUE, packed with features and has held up so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie amzshpr",
      "helpful_votes": 3,
      "publication_date": 20190410
    },
    {
      "title": "Great gift for start to mid level photographer",
      "text": "I am Professional photographer and huge fan of Nikon but my nephew is Cannon user moving forward in Photography from beginner middle level. I purchased this flash because it fulfills his need with the features i wanted him to start with and price is also under my budget, using this he will gain mid level expertise in taking flash based photography both indoor and outdoor.",
      "rating": 5.0,
      "verified": true,
      "author": "Waqas Ahmed",
      "helpful_votes": 2,
      "publication_date": 20190904
    },
    {
      "title": "Great until it stopped",
      "text": "I got this flash at the end of last year n it was working great! It would had been 5 stars but as of a few days ago it stop working in right in the middle of a event i was working! Changed batteries and it was nt running hot!. Only did a few events with it, nothing full power n the flash just quick. Soo now its a 2 star cause it was great flash whiled it work",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Croom",
      "helpful_votes": 2,
      "publication_date": 20190421
    },
    {
      "title": "Works great with my Canon M50",
      "text": "I am a beginner, so figuring out what works best for my camera took a little practice but now I'm taking inside photos that look better than ever, and I didn't have to spend a fortune on equipment I wasn't sure I'd ever learn how to use. Bouncing the flash off the walls and ceiling makes the light appear much more natural. Most of the time I set it to E-TTL and let the camera and flash do the work. You can adjust it manually also. And, since it works remotely too, you don't have to mount it to the camera to use it. It's awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Nance",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "GREAT Inexpensive Flash Speedlite For My Nikon D5600",
      "text": "I have the Nikon D5600 that I use for food photography and other photos for my websites/blogs. Since natural light is not always available I have been trying different ways to get artificial light for my photos since lighting is extremely important for the photos that I take. I finally decided to order a Speedlite and give it a go! This was the FIRST Flash Speedlite that I have used and so far I love it! It also is super affordable compared to the Nikon flashes I have seen. This flash comes with a carrying case and a wireless trigger which means I can take photos without the flash on my camera and on the go!",
      "rating": 5.0,
      "verified": true,
      "author": "Stefani Tolson",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Absolute Joke",
      "text": "If you choose to buy this product, trash all the instructions. They are completely useless, the pictures don't line up with reality and it simply will not help you. In fact, they are so bad, I sent this item back as defective the first time I got it. Just go straight to YouTube for direction on how to operate this flash. If I could, I would send this one back as defective and buy a different brand. But my conscience won't let me. My recommendation, save yourself the hassle and just by a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Noble Fisk",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Would have given less stars of it wasn't so cheap",
      "text": "Even for a low priced flash this isn't very good. · Firing is unreliable. Have to constantly turn it off & on again to get it to respond. · HSS does not work on slave mode, or with remote, HSS ONLY WORKS ON CAMERA. I purchased 7 different cheap speedlights to see what's the best bang for the buck, and this is the worst one. If it cost more I'd have given it 1 star.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott Newton PRO PhotoGuy",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "A great affordable choice",
      "text": "This one is affordable and the quality is really good. As a photographer, using flash is a must with me, especially in dark areas. I used YN968N flash before but it is double the price of this one for just some small additional benefits, so I think this one is more in value. The thing I may complain is the build quality looks cheaper and more flimsy and somehow I feel I get less flash counts compared to the YN968N (maybe 10% less). However, for the money, I think it is a great affordable choice.",
      "rating": 4.0,
      "verified": true,
      "author": "Florian",
      "helpful_votes": 4,
      "publication_date": 20190913
    },
    {
      "title": "Best Flash for Price",
      "text": "I am an amateur photographer and I have been using this flash for just about 4 months and thus far it has worked flawlessly. I use it mainly for portrait shoots and weddings. The main reason for purchasing this flash is because of it's HSS capability and affordable price. I mainly use the flash on camera, however I've also used it with the included trigger. The trigger works without issues but it should be noted that HSS is not supported in this mode. In short, I fully recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Smith",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Why did I wait so long?",
      "text": "I've been reluctant to try off camera flash because I thought they were complicated and difficult to use. Why did I wait so long? This unit is great in my opinion...granted I have nothing to compare this to. I found this flash easy to setup and use. I also found it to be durable - dropped it from about 4 feet by accident onto a hard floor and it still works! One thing that has been a plus from using this flash is that I started to use the manual setting on my camera! I've attached a photo of my pups taken with off camera flash and remote transmitter.",
      "rating": 5.0,
      "verified": true,
      "author": "MAC2WDE",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "This particular unit was not recognized by my Canon 7D.",
      "text": "Upon opening the package it became very apparent that this item had been unpacked before, so someone already returned it once. I decided to try it anyway on my Canon 7D. Manually triggered, the unit flashed, but my camera didn't recognize the flash unit. Just didn't see it. Returning it as defective, waiting a while, and trying another one, hoping it was just this particular unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Claessen",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great Flash.",
      "text": "I wanted to try out a new sub $100 flash and this here did not disappoint. Syncing with my D750 was excellent and after a couple of hundred fires, it still worked great. I will have to test battery life a bit further but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 3,
      "publication_date": 20180904
    },
    {
      "title": "Buy this and save some money",
      "text": "I was skeptical of a cheap import, but this flash has been great. The mounted TTL mode works fully with my Canon SL2.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel B.",
      "helpful_votes": 3,
      "publication_date": 20190407
    },
    {
      "title": "HSS On Camera/Hot Shoe Only",
      "text": "Purchased this flash because of it's HSS abilities and was disappointed to find out that it's only HSS when attached to the camera's hotshoe. Otherwise it's a great flash, 4AA batteries lasted me about 3 shoots which would be approximately 700 flashes. Wouldn't personally buy again because shooting HSS is a priority for me in my next steps in photography but if HSS is not a priority or is something you want to tip top into check it out.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Best affordable speed light",
      "text": "This is the best speed light you can get for this price. The sturdy and perfect finish of this product is a plus point. I could not believe I got this product for this price since canon speed lights are quite expensive. I am photography student and am using this speed light quite often now for indoors as well as outdoors sometimes and the results are awesome so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Suraj",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Amazing for the price!!",
      "text": "At first I was worried about the product with all the negative reviews, but it has been working flawless and its amazing! Its really easy to use in iTTL and 90% of the time it gets the right config by itself, the results are stunning and I get almost no over exposure with this, Im planning to buy another 2 to use the wireless settings at their full potential. Overall its a very complete and functional set for the price! Definetly worth buying!",
      "rating": 5.0,
      "verified": true,
      "author": "Javier Venegas",
      "helpful_votes": 6,
      "publication_date": 20190808
    },
    {
      "title": "basically the same as Geekoto GT65N",
      "text": "this flash has the same innards as the geekoto gt65n which i have. the geekoto 2.4 wireless trigger (TTL/HSS) works for the ESDDI flash as well. tested manual, ttl and HSS grouped with the geekoto flash and the trigger worked great for both. highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "gearheadskyTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Great Speedlight for the Price",
      "text": "Very nice flash especially for the price. I don’t have the expensive Nikon speedlight which costs a few hundred dollars because it is too expensive. This is a lot cheaper and it works well. I also tried the wireless trigger with another speedlight that I have and it worked so it doesn’t just support the one it came with which is awesome. Both the trigger and speedlight fits well with my Nikon D750.",
      "rating": 5.0,
      "verified": true,
      "author": "William Ng",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Well worth the money",
      "text": "I have used this now for 2 months on my Canon SL2. Excellent refresh rate and above average battery drain",
      "rating": 5.0,
      "verified": true,
      "author": "James Par-Due",
      "helpful_votes": 2,
      "publication_date": 20190417
    },
    {
      "title": "Really cool flash!!! 100% satisfaction.",
      "text": "Really cool flash. Feels solid, looks great. Fires like a pro and cost much much less than Nikon ones. I own Nikon cameras and the flash is fully compatible with them (iTTL, manual, multi; master flash or slave flash). Comes with wireless transmitter, a diffuser and build in white card. Even the case is great. I'm excited with this product and definitely buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Rus Z",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Great Affordable Flash for Nikon",
      "text": "We got this for our first real DSLR camera, and its worked great both indoors and outdoors in a multitude of lighting conditions. The pictures came out fantastic. Its easy to use and comes with an instruction book that is easy to follow.",
      "rating": 5.0,
      "verified": true,
      "author": "JonINY",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Love this speed light!",
      "text": "I love this speed light. Easy to operate, and syncs great as a master/slave set .ETTL works as you would hope and had a quick reboot time. Rapid fire works great!",
      "rating": 5.0,
      "verified": true,
      "author": "mamanance",
      "helpful_votes": 2,
      "publication_date": 20190409
    },
    {
      "title": "Not that good quality",
      "text": "It works but is very cheaply made my defuser came melted. I used ones and didnt like the fact that looks too cheap. It does not look profetional using a expensive camera with so cheap made flash i had for 7 year neewer for the same price. I'll get the same flash again",
      "rating": 2.0,
      "verified": true,
      "author": "Tecopose",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Liked it so much I bought a second one",
      "text": "Was going to buy a Nikon Speedlight, but before the doctor was about to take my kidney I decided to try this one out. No regrets. How Nikon or Canon get away with highway robbery or why their fanboy/girls spend the $$$ is beyond me. Ok, I have to get stitched back up. Crisis averted.",
      "rating": 4.0,
      "verified": true,
      "author": "JinSA",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Awesome flash",
      "text": "It is an amazing product, I had to figure out by myself how to use it to capture the perfect picture. Consider for the price this product is very reliable. I love it l. Easy to install and it came with a little bag to put it in",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin C.",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Exceptional performance",
      "text": "Was sceptical at first due to price and unfamiliarity of brand, but this flash is quite awesome. Purchased to have as a backup to my speed light when traveled out of town for an outdoor wedding, and now its the only one I use. Exceptional performance and quality!",
      "rating": 5.0,
      "verified": true,
      "author": "j.m",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "good product",
      "text": "As a beginner I wanted a flash with E-TTL mode for my Canon 1300d. In this mode, the camera and the flash can do everything completely automatically. And it works and has a good performance. Try out the manual features after watching some tutorials on Youtube. The build quality is good. comes with a WiFi remote and some accessories. Holds 4 AA batteries that are not included. Definitely recommended for beginners to learn the lighting.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Not worth it!",
      "text": "First of all... i am a beginner... i bought brand new batteries and it did not evwn lasted 2 hours and need it new ones!! Whatt!!!!!! Good batteries and brand new!! Awfal!!",
      "rating": 1.0,
      "verified": true,
      "author": "LINA ♡",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Fantastic Flash",
      "text": "I love the wireless accessory for this! The flash is super easy to operate. Also the screen serves as an additional readout for photo information. The auto focus is outstanding. I haven't used it for portraits, but I don't imagine it doing poorly.",
      "rating": 5.0,
      "verified": true,
      "author": "AlexanderTop Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Nice",
      "text": "This was a super deal. I have used it once and it was pretty easy to use. There is so much that the flash can do. Have not had the opportunity to work with all of them. I have a Canon DSLR and it was compatible with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Great value!",
      "text": "I've been hesitant to find a good speed lite as a secondary source. I am using a Canon 1DX and the ESDDI fits perfectly. I can't compare this speed lite with the Canon products but this gets the job done. It has a sturdy quality built. This is a light that I would take with me just in case. It gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Flash trigger is not working",
      "text": "I used the flash trigger and ESDDI PLF-650 camera flash accordingly, and following the detailed instruction on YouTube for the same product, but the flash trigger and the speed light is not cooperated. The don't work together. Please help. The speed light flash itself is working well. but the trigger is not working with the flash.",
      "rating": 2.0,
      "verified": true,
      "author": "Tselo",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Nice Speedlite. Good value for money",
      "text": "I brought this speedlite for my Nikon camera. I am really satisfied with this speedlite. It syncs with the controller and the camera very nicely. No issues occurred so far. Recently I went for a road trip with my family and I took some low light pics. It really helped me to capture the beautiful moments with my family in the low light conditions. Thank you for this nice product. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sijin",
      "helpful_votes": 6,
      "publication_date": 20181227
    },
    {
      "title": "Amazing product",
      "text": "I bought this for my wife and she loooove it. It work great and she is truly happy with the performance of this product.",
      "rating": 5.0,
      "verified": true,
      "author": "G.Perez",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Good value for the money.",
      "text": "This is what I got using the flash to in a portrait for my friend's cat. Low light condition indoors on camera flash manual trigger condition. I am getting very satisfied result -- please refer to picture. The color temp is consistent so I didn't need to do a tons of adjustments to get this result. Really great value for this product. Highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Honeymoon",
      "helpful_votes": 4,
      "publication_date": 20190721
    },
    {
      "title": "Better pass on this one.",
      "text": "Its okay for the price but it is not intuitive or simple to use, the instruction manual is very lacking. Im buying a couple more but not from this brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Cali",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Excellent quality Flash",
      "text": "Professional flash with all the latest features you could expect from large brands but at a fraction of the price",
      "rating": 5.0,
      "verified": true,
      "author": "GerrryM",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Beautiful Awesome",
      "text": "I love everything about it. I had to resend it back because after 30 days it stopped working and I contacted the seller and they took great care of me and sent me another one in 3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "yasin abdul",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Does not work for Canon 80d",
      "text": "Does not have the auto focus assist feature for a Canon 80D camera.",
      "rating": 1.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "I have upped my photography game!",
      "text": "I love this flash. I had never used a speed light before. This was easy to figure out and use. I would buy again. Great value for the money",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Deaton",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "GOOD ALTERNATIVE TO THE BRAND FLASHES",
      "text": "This is a very good product, easy to adjust, easy to operate and affordable. I have not yet come across any problem with it. It is a good alternative to the brand flashes at least for general purpose flash photography. Recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "masood",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Perfect low-cost flash for beginners",
      "text": "I was looking for a good flash for a beginner in photography and after several research i landed on this one. Decided to give this ESDDI flashlight a try and no regrets. First thing i noticed was the build material quality, it's good for the price and doesnt look cheap! It has some of the features (HSS 1/8000, i-ttl, to name a few..) that many top brands have and doesnt cost a leg. Only thing that could be better is the battery indicator, other than that, i would say it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Manuel Ribeiro",
      "helpful_votes": 5,
      "publication_date": 20190602
    },
    {
      "title": "Unexpectedly stopped working",
      "text": "I bought this for a wedding which was successful. Then later when I tried using it at home it stopped working. I tried using 3 different types of batteries and still nothing. I'm guessing the bulb broke? I'm kind of upset because I wanted it to last a long time.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica DeSmet",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "NOT HSS",
      "text": "I bought this flash specifically for HSS. It is not, however a HSS flash. It maxes out at 1/200 shutter speed. It’s useless and being returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Lewis",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Not bad!",
      "text": "This flash is not bad for the price. It does what it is supposed to do. It is easy to attach and remove. However, it is heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Product did not work.",
      "text": "The flash did not work. I will immediately return this flash. I am extremely disappointed with this flash.",
      "rating": 1.0,
      "verified": true,
      "author": "Elvira",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Ok for the money",
      "text": "Love the flash and it works, but I can't get it into hss mode for slave. It will only let me do it for master. The godox flash is only a few dollars more and was easier to work",
      "rating": 4.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Highly Recommend it.",
      "text": "I tried it on my Nikon D5500. Works very well. It fires a very bright light. You do need buying rechargeable batteries if you are a heavy/intense photo-shooter .",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Royes",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "A Perfect Choice",
      "text": "Although I'm still an amateur, I like to think I picked a great product. I took pics at my cousin's party this past Saturday and this, ESDDI Speedlite delivered.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn L. Rogers",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great until it stopped!",
      "text": "I bought this flash in June of 2018 and here it is May of 2019 and it stopped in the middle of my shoot. I had shot 200 images by then, but that had not been a problem with previous shoots. I checked my settings, changed the batteries, but it will no longer fire. Looking for a replacement!",
      "rating": 2.0,
      "verified": true,
      "author": "Anita Hocker",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Wonderful",
      "text": "This is exactly what I was looking for. It's so easy to use and pairs nice with my canon",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Use it less than 100 pictures and gone😌",
      "text": "Use it one time half event and gone!!!! - 5 stars. Never but this again or anything related to this brand.",
      "rating": 1.0,
      "verified": true,
      "author": "phill",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Works good",
      "text": "Very nice has. Use with d750 24-70 mm 2.8 and ..yeah I think it's good, let's see how long this lasts.",
      "rating": 5.0,
      "verified": true,
      "author": "missiefae",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Good value for basic extra light.",
      "text": "This flash works as says. Bright, similar to the much more expensive speed lights and basically same operation. Lite in weight and seems to lock in place ok so far. Good beginner flash for the price and definitely works for regular use. I've only used a few times in TTL mode.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly S.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Fine flash as a good price.",
      "text": "This is a great flash for the money. I've only used it a couple of times and it did not disappoint. Most of all the TTL feature made for some excellent shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikey V",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "It works great! Why purchase anything Else?",
      "text": "It is well made with quality materials. The User Manual could be a little better but I had no trouble figuring it out. FYI, using it with a Nikon D5600.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Very nice flash.",
      "text": "So many options. I'm having fun playing with all of the settings. Takes professional pix...",
      "rating": 5.0,
      "verified": true,
      "author": "Nix",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "2nd order worked well.",
      "text": "Edit: Replacementproduct works as intended. You'll get a better review when I get a working product.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Charles Loper III",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Tried triggering it with my canon flash simultaneously and it worked well",
      "text": "Have not tested it yet to give five stars on portrait",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Good flash but cannot use remote in hi speed sync",
      "text": "Remote sync speed limited to 1/250th of a second. High speed synch requires mounting on camera. Otherwise works fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff Cullman",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Love this Flash!",
      "text": "This flash is very easy to operate. It is solid in construction and works great. It has a very professional appearance. As a side note, the seller was great to work with regarding my questions and I would not hesitate to purchase products from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Judi S.",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Very good service.",
      "text": "Vendor performed extremely well, delivery and product were as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Duncan Hills",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Excellent customer service",
      "text": "After having an issue with my product, ESDDI support promptly addressed my issue. I really love the product and will definitely purchase more. Great value for money and customer service is A+++++",
      "rating": 5.0,
      "verified": true,
      "author": "raymond",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "The seller backs the product",
      "text": "Although the product died on me, the seller was very easy to deal with in getting a replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "jackalope",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Amazing flash and a great price",
      "text": "Was the perfect flash for a wedding . Love how easy it was to learn how to use it .",
      "rating": 5.0,
      "verified": true,
      "author": "Mattie Ann Lozano",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Easy to operate",
      "text": "I lost the manual the first day, but with a little internet research I have been able to take some good pictures especially using the remote and adding a snoot to it to aim the light accurately. It’s added a lot to my photography repertoire.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Ok",
      "text": "Good product still going to try a different brand to see if I get a better effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Very Unhappy customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Good price and easy to use.",
      "text": "I like the product. It works with my Nikon D3300. Easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "arnaldo",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Flash",
      "text": "Works perfectly. Just wanted a flash unit. I'm not an expert",
      "rating": 5.0,
      "verified": true,
      "author": "James Dowling",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "The remote didn’t work on mine",
      "text": "Works great for the price , only issue is the remote would not work",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Kimbrell",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great product!!!",
      "text": "Great product!!! I am new to this type of cameras and flash. This flash is friendly use and reliable",
      "rating": 5.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Excellent value for the money for wildlife photography",
      "text": "The reason I purchased this flashlight is for wildlife photography in the woods when additional light source is needed. This flashlight provides adequate power for my task. The HSS function works which is essential for photographing fast moving objects when additional light is needed. I highly recommend this unit given the functionality/price ratio.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Nova",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "strobe",
      "text": "Works good but you need a degree to operate it",
      "rating": 4.0,
      "verified": true,
      "author": "Gunfixer",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Great price for a well made light.",
      "text": "Works really well. Excellent value. Looks like it’s made as well as some of the more expensive brands.",
      "rating": 5.0,
      "verified": true,
      "author": "George M.",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Junk! Only lasted for 2 photo sessions.",
      "text": "Junk! Used it twice and it quick working. When it worked it was good but the flash will not fire anymore at all no matter what I do. Beware. I would not recommend this to anyone, waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn Reamer",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Works well....trigger not always reliable",
      "text": "Works great except for the trigger. It's not consistently reliable. It doesn't fire with some shots (even way less than 15m away) but I try until I eventually get the shot. Can be a bit embarrassing in front of clients though.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Works on my Nikon D7000",
      "text": "Cannot use rechargeable with this flash.I suppose the voltage is too low. Synch well with D7000. Does what I bought it for very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Nale",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Stop false advertising",
      "text": "I am very upset that this was supposed to come with batteries for the remote and for the flash and I did not receive the batteries... The AAs don't make me so mad but it's the special custom battery for the remote... Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Denise Bone",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Good flash",
      "text": "Works as advertised. You need to practice to get good results",
      "rating": 5.0,
      "verified": true,
      "author": "Perit Hakuz",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Easy to use",
      "text": "Easy to use and setup, didn’t even need to read manual",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Lyons",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Amazing!",
      "text": "This is honestly an amazing flash! Compatible to most high dollar flashes. Originally feels a little cheep but quickly redeemed itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Connor White",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Flash",
      "text": "Used this for Christmas pictures and they turned out great!! Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Sustaire",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "It’s ok for the buck",
      "text": "Slow flash execution not suitable for me when shooting music gigs and need a fast flash otherwise it is ok",
      "rating": 3.0,
      "verified": true,
      "author": "tentacion",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "External Flash for my Camera.",
      "text": "I love my new external flash I bought on Amazon. It works perfectly and never fails me.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Schmit",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Great Flash Unit",
      "text": "Takes a little getting used to but when you get the hang of it you notice a real improvement to your photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Gets the job done",
      "text": "Great product did take a few days to figure put but it worked!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "I could it make the wireless remote to work",
      "text": "I tried all the channels specified in the document, but the wireless controller doesn't work. I even had to spend on the A23 battery to check it.",
      "rating": 1.0,
      "verified": true,
      "author": "Refi",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Great value for money!!!",
      "text": "This is a great flash for a beginner or an experienced photographer with both auto and manual settings! It is a great deal for the money with a bounce card, diffuser, and a remote trigger all included!",
      "rating": 5.0,
      "verified": true,
      "author": "Wyatt Warkenthien",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Works/ Compatible with triopo 2.4 ghz G1 wireless systems",
      "text": "Everything works perfecto, one complain it takes a weird Battery in the trigger. But if you have a G1 trigger from triopo, Andoer or neewer it Will match its wireless system flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "J-GA",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Helpful customer care",
      "text": "Great speed light for the money. Easy to use. Also customer care Rosie was helpful getting me a replacement wireless trigger. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "tim",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Really Good!!",
      "text": "This ny first external flash, is easy to use, easy to connect to the camera. The quality of my photos in low light are better now, using the external flash. I recommend if you need one, this will be the perfect flash to start-up with.",
      "rating": 5.0,
      "verified": true,
      "author": "william camacho",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Beginner's joy",
      "text": "It's a great beginner's use for flash. I use it especially for events and nightclub photography.",
      "rating": 5.0,
      "verified": true,
      "author": "Rivy-Major",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Trigger doesn't work, eats batteries",
      "text": "Trigger doesn't work at all. Tried everything recommended and it's still not working. This thing also eats batteries, even fancy expensive ones. Poorly executed.",
      "rating": 1.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "AWFULL ! DONT BUY IT",
      "text": "Its wireless DOES NOT WORK. Forget about the wireless trigger. USe batteries 4 AA.. and they are consumed crazy fast. its a waste of money. Also Hard to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Guido Adrian Blanco",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Does A GREAT JOB!!",
      "text": "User friendly and does a great job in both on the camera or with the trigger..",
      "rating": 5.0,
      "verified": true,
      "author": "george ayala",
      "helpful_votes": 0,
      "publication_date": 20200120
    }
  ],
  "product_meta": {
    "title": "ESDDI Camera Flash for Canon DSLR Camera, E-TTL 1/8000 HSS GN58, Multi, Wireless Camera Flash Set Include 2.4G Wireless Flash Trigger, Cold Shoe Base Bracket and Accessories",
    "rating": 4.4,
    "feature_bullets": [
      "【Updated version】: Compatible with most Canon DSLR cameras with standard hot shoe. ▲: Not compatible with Canon 250D (SL3), 750D (T6i), M50. And Canon 2000D (Rebel T7), 4000D cannot use 2.4G wireless trigger",
      "【Auto/Manual Zoom, E-TTL/MULTI】: Automatic intelligent accurately measure and adjust the quantity of light, realize record multiple actions in the same photo",
      "【Supports 1/8000 HSS, Front-curtain, and Rear-curtain Sync】: ▲ You can get the HSS by inserting the flash into the camera hot shoe or use two ESDDI flashes to get the HSS through the main and auxiliary control modes, but you cannot achieve HSS when using the trigger",
      "【Master/Slave/M/S1/S2 Flash Modes with GN58】: Three groups of light control and 16 channels for option, brighten the beauty of every inch",
      "【Accessories and Guarantee】: ESDDI PLF-650C Speedlite Flash for Canon, 2.4G Wireless Trigger, Mini Stand, Hard Flash Diffuser, Protection Pouch, User Manual. If you encounter any problems or need support, please feel free to contact us"
    ],
    "specifications": {
      "Package Dimensions": "9.45 x 4.02 x 3.31 inches",
      "Item Weight": "1.45 pounds",
      "ASIN": "B0797SK72R",
      "Item model number": "948637",
      "Customer Reviews": "4.4 out of 5 stars172 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#36 in Shoe-Mount Flashes",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 23, 2018",
      "Manufacturer": "ESDDI"
    },
    "categories": [
      "Flashes",
      "Shoe Mount Flashes",
      "Electronics",
      "Camera & Photo"
    ],
    "price": 69.99
  }
}