{
  "website_summaries": [
    {
      "verdict": "Add some glam to your look with this vibrant glitter makeup for the face and body.",
      "pros": [
        "It instantly infuses sparkle and style to any look, day or night",
        "Comes in a variety of colors",
        "Easy to put on and take off",
        "Great price point",
        "High-quality"
      ],
      "cons": [
        "Some have said the colors online don't exactly match what arrives"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "So pretty",
      "text": "Very pigmented. Super shiny (which I love) it shows up well in pictures with or without flash. The only thing I don’t like is the fall out after a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsia",
      "helpful_votes": 40,
      "publication_date": 20190825
    },
    {
      "title": "Love this product",
      "text": "Used this to add glitter for my mask on Halloween",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 30,
      "publication_date": 20181121
    },
    {
      "title": "Love!",
      "text": "Love, love, love this glitter eye shadow! So bright, bold and best of all, long lasting!! It stayed for hours and hours and was easy to come off with a make up wipe too! Would definitely purchase in other colors.",
      "rating": 5.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 20,
      "publication_date": 20191030
    },
    {
      "title": "Definitely would recommend!",
      "text": "I was super impressed with it! We used the Nyx primer and wore it to an outdoor Kesha concert in mid July and it managed to last!",
      "rating": 5.0,
      "verified": true,
      "author": "Dalton",
      "helpful_votes": 25,
      "publication_date": 20180811
    },
    {
      "title": "5 stars hands down!!",
      "text": "LOVE LOVE LOVE this glitter!! I've never used glitter like this before and I love it so much I can't wait to buy more colors. My friends loved it so much they're buying some too. The application is pretty easy. Just know that less is more. Put on a little at a time or you'll have a lot of fallout while applying. But once applied it stayed on for HOURS of dancing with very little fallout. I definitely give this 5 stars and plan to buy more colors in the very near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Shelton",
      "helpful_votes": 13,
      "publication_date": 20191204
    },
    {
      "title": "I shone bright friends",
      "text": "I used this for a New Year’s Eve look! Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Cass",
      "helpful_votes": 17,
      "publication_date": 20190107
    },
    {
      "title": "Long lasting with amazing pigment!",
      "text": "This glitter is absolutely amazing. I used it in a makeup look for my local Pride festival and it stayed on all day long (12+ hours) with very little fallout. I've used it with NYX's glitter primer as well as without it and it still holds up! Perfect for when you want to take your look to next level or just want a little touch of glitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Muller",
      "helpful_votes": 18,
      "publication_date": 20180709
    },
    {
      "title": "Get that perfect glitter finish for your makeup look",
      "text": "I’m obsessed with glitter and this is the perfect, most affordable must-have loose glitter. It’s a little tricky to apply but as long as you don’t mind the glitter-all-over look and have the NYX glitter primer, it will work perfectly and stick the whole day! The small cap makes it easy to control the amount that comes out, and this Rose color is so cute on top of the pink eyeshadows or lipstick. I must collect all of their colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Colin L. Zollars",
      "helpful_votes": 4,
      "publication_date": 20191212
    },
    {
      "title": "Standard gold glitter",
      "text": "Standard gold glitter - great for use with a costume. Don't forget to buy glitter primer!",
      "rating": 5.0,
      "verified": true,
      "author": "Lea",
      "helpful_votes": 6,
      "publication_date": 20181110
    },
    {
      "title": "Need the adhesive and practice to get it to stay where you want.",
      "text": "Used these for cheer makeup. Need the glue to make them stick and kind of have yo push them into adhesive. Once on the shadow looks great and stands out on stage. Just takes time to get used to applying it.",
      "rating": 5.0,
      "verified": true,
      "author": "JilleeannAmazon Customer",
      "helpful_votes": 3,
      "publication_date": 20191120
    },
    {
      "title": "Cute..",
      "text": "Cute, but not as glittery as I would have liked. Have to be careful or it just looks like you have dirt on your face",
      "rating": 4.0,
      "verified": true,
      "author": "Kelsey Maurer",
      "helpful_votes": 6,
      "publication_date": 20180815
    },
    {
      "title": "So pretty!!",
      "text": "Oh I love this shade! It’s so pretty 😍 definitely would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ry",
      "helpful_votes": 5,
      "publication_date": 20190209
    },
    {
      "title": "Great! Very fine glitter!",
      "text": "This is a great glitter...I used lash glue on my lids...then put the glitter on that and the glitter is so fine it came out super smooth and lasted until I took it off with makeup remover! So pretty! I got a lot of compliments for my glitter eyeshadow",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 3,
      "publication_date": 20190305
    },
    {
      "title": "Great for festival/parties",
      "text": "Great fun. Used on top of lotion/primer for my face and sprinkled some in my hair. Glitter came out relatively fast in the shower. So fun. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Lombardo",
      "helpful_votes": 4,
      "publication_date": 20180705
    },
    {
      "title": "Yay for sparkles",
      "text": "I used this with NYX pigment to put glitter around my eyes. The glitter goes on easily and you don't need a lot to notice it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah K.",
      "helpful_votes": 5,
      "publication_date": 20180731
    },
    {
      "title": "Product looks good, shade not for me.",
      "text": "Color more brick red than expected. Didn’t open so can’t review actual product. Did try NYX shimmer down pigment & if it’s anything like that sure it’s great. This is More sparkly than shimmery versus the shimmer down. Might try another shade Bc I love sparkles!!",
      "rating": 3.0,
      "verified": true,
      "author": "N9nerrr",
      "helpful_votes": 2,
      "publication_date": 20190706
    },
    {
      "title": "Must have!!!",
      "text": "I am absolutely addicted to Nyx glitter!!!! I now have 3 different colors, I always use it...alone or over a shadow this stuff is amazing! I do however advise buying the Nyx glitter glue, it holds it in place perfectly and a little goes a long way!!! If you enjoy adding sparkles to your life then you need this, in like every color (I'm working on that 😄)!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren B.",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Good For Rich Tastes",
      "text": "I bought this for an old and very rich boss of mine who protested again and again about how \"cheap\" this was when I told her about it and asked constantly if it would give her a bad skin condition. Long story short she loved the versatility of the product and she didn't have any adverse effects from it. I use a silver version personally and it's great for special events.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Glitter is kind of large, doesn't stick well",
      "text": "Much chunkier of a texture than I was expecting, I thought it would be much finer of a glitter for use on body and eyes. Poor adhesion so you'd have to use glue if you don't want it to fall off and get absolutely everywhere. Color is nice and accurate, but the largeness of the glitter pieces make it tough to use, wish I had gone with something else that would be easier to use",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah Allison",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "I have silver, blue and gold",
      "text": "So silver and pink are probably my fave glitters. And these are so fun I got blue and gold first for football games and it worked so well I expanded my collection. The glitter glue helps but is not essential. People always seem to like it, but kids especially",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "Beautiful colors, primer needed",
      "text": "I purchased the beauty beam as well as the bronze, both metallic. They're both beautiful colors, and I'm happy with my choices. Only problem is had I not known to purchase a glitter primer I'd of been less than thrilled. It doesn't hold well by itself but does work with a primer. The package arrived one day earlier than expected, with everything in one piece. Price is a little high for the size, but it also does go a long way. Over all I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Coreigh Q.",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Beautiful and Holographic!",
      "text": "This glitter is GORGEOUS!! I had the silver, and wanted the violet, but didn't expect it to be holographic! I LOVE IT!! Super pretty!! I recommend pairing this with the NYX glitter glue to make a statement! STUN NING, and SUPER AFFORDABLE !! GREAT VALUE! Highly recommend this..100%.",
      "rating": 5.0,
      "verified": true,
      "author": "TaraTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great Value",
      "text": "It is a small container but it is also fairly cheap. I've bought smaller containers at a similar price. It is a nice glitter you can use anywhere on you. Always be careful using it around the eyes, a brush helps the application process easier.",
      "rating": 5.0,
      "verified": true,
      "author": "JayC",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Beautiful Color",
      "text": "I purchased this thinkink this was sparkle eye shadow. When I opened it, it did not come with an applicator. I am not sure how to apply it. It is a beautiful color. I would give it a 5 star if I knew how to apply it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mysterious outlook",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Beautiful",
      "text": "Loved this product so much I went and order more colors. Just make sure you have double sided tape under your eye to catch what falls. Setting powder isn’t enough still sticks to your face . And keep away from the eye . They are still kinda scratchy if it gets in the eyes . Which can be damaging",
      "rating": 5.0,
      "verified": true,
      "author": "The Hopewell’s ",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Love the product and color",
      "text": "Love it!!! Goes on easily and doesnt make too much of a mess. If you use a small tipped application brush you can apply with ease and it stays on all day and night. No need to reapply and its not messy like most glitter. Great product and fast shipping. Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren Constance",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "I am so shiny!!!",
      "text": "I just got this in the mail yesterday, and oh my! It is so shiny and glittery. I feel like the prettiest pig at the county fair!!! I am going as a sun for Halloween, and this will be perfect. I have sensitive skin, and so far the glitter has not irritated my skin in the slightest. My only gripe with this is that the bottle is sooooooo small, and the package that it shipped in was really big. Amazon, please make smaller bags for your products! There's no need to waste that much plastic. Have a good day guys!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Marie Speech",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Long last",
      "text": "Loved this used with nyx glitter primer and stayed on all night for New Years.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexi palbicki",
      "helpful_votes": 2,
      "publication_date": 20190117
    },
    {
      "title": "Love NYX glitter 😍",
      "text": "I really like the glitter and surprisingly, it not messy to put on my lids ( I am new to make up and had a easy time). I will be purchasing other glitter colors from this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Natural Beauty ",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "LOVE!",
      "text": "I LOVE this glitter!! I use it as eye shadow when I am wanting a bold look, and it is perfect. When used with primer first, it stays on all night through all the sweat and fun. Love the look this gives. Will for sure buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Hailey ",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Love it!",
      "text": "I love this product. People gave me a lot of compliments. Must buy! Also, buy the NYX glitter primer.",
      "rating": 5.0,
      "verified": true,
      "author": "jonny2tim3",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Glitter me not!",
      "text": "nah! I love make up and was very disappointed when I used this . very sheer ! had to pack my eyes 3x to get the look I like",
      "rating": 3.0,
      "verified": true,
      "author": "sandra",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Great glitter for body gels or cosmetics",
      "text": "Added this to make shimmer gel ( aloe Vera + glitter)...fine grain tiny particles of glitter, perfect for body.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Difficult to apply on skin",
      "text": "It is loose powdery sparkles, you d need To apply some oils to keep them on skin for awhile. In my case didnt work great, messed my dress",
      "rating": 2.0,
      "verified": true,
      "author": "Uni Brown",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Nice",
      "text": "Me and my friend used this glitter for a concert and it was really pretty The glitter seemed to change the color of the glitter glue so the skin around the glitter was pink, kind of like when you get a sunburn but besides that the color was nice and nice on the skin.",
      "rating": 4.0,
      "verified": true,
      "author": "clover",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Beautiful glitter.",
      "text": "Such a beautiful rose glitter color. Will definitely be doing many looks with this glitter. I like how the glitter isn’t so thick like other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Pretty and sparkly",
      "text": "Not sure how to use loose glitter yet but it's nice to have for costumes! I have no problems with my order and the glitter is gorgeous!",
      "rating": 5.0,
      "verified": true,
      "author": "Mikayla Nuszkiewicz",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Another great NYX product!",
      "text": "Very pretty gold color and alot less messy than I anticipated! At the bargain price I got, I would definitely buy more colors!",
      "rating": 3.0,
      "verified": true,
      "author": "Chezby",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Great Value!",
      "text": "Super affordable considering this is specifically \"face\" glitter. Very sparkly and easy to apply with lash glue (which I recommend over glitter primer).",
      "rating": 5.0,
      "verified": true,
      "author": "Lokii",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Looks just like the picture.",
      "text": "I bought to use in pour painting but it isn't fine enough for that. It does look just like pictured though.",
      "rating": 3.0,
      "verified": true,
      "author": "Carol C.",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Worth every penny",
      "text": "I love this glitter the color really pops its amazing and it sticks forever with the nyx glitter glue even through a meal on my lipstick.",
      "rating": 5.0,
      "verified": true,
      "author": "christopher/Amanda lavezzo",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "very disappointed",
      "text": "does this look like this picture?! No! 😑 it's pitch black,not as glittery and not as silvery as in picture it's black, very disappointed 😕",
      "rating": 1.0,
      "verified": true,
      "author": "ketiman",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "super beautiful, but very messy",
      "text": "pretty good glitter. you need something for it to stick to and be careful cause its mad messy. but I do think the way it looks is extremely beautiful. not for someone who has never used loose glitter though.",
      "rating": 4.0,
      "verified": true,
      "author": "cherryfairyy",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "It was ok.",
      "text": "It was okay. Didn’t have as much color pay off as I thought it would have.",
      "rating": 3.0,
      "verified": true,
      "author": "Phallen",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Sparkly!!!",
      "text": "Great glitter... I knew better than to try to use this without \"glitter glue\" but tried it with a sticky lip gloss...it worked great! Perfect for my Halloween/cosplay costume. I Definitely need other colors to do other costume ideas!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "No dry time",
      "text": "Vary pretty glitter ,i used the nix glitter primer it stuck really well ,no real dry time i will use eyeshadow under it my next aplacation. All in all love the product",
      "rating": 5.0,
      "verified": true,
      "author": "DanaBallard",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Perfect glitter!!",
      "text": "I use this with the NYX glitter primer and it is awesome!! Gorgeous glitter that stays on until I wipe it off, which comes off very easily. Fine powder, with tons of sparkle! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole B",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "All that glitters is gold",
      "text": "Used this for a kids aerial dance show. It really helped make the kids eyes pop and super easy to apply.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Lindblade",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "A++",
      "text": "I applied it with lash glue with aloe like I do all my other glitter. This glitter is perfect and would compare it to StayGolden cosmetics glitter, same quality. A++",
      "rating": 5.0,
      "verified": true,
      "author": "Kb",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Good",
      "text": "It was for my daughter’s skating competition make up. It worked great. You just add some special glue (for eye shadow), then apply this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kuniko K. Carpenter",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Definitely recommend",
      "text": "So pretty! I used it with the NYX glitter primer and it went on really well, didn't have a ton of fall out, and lasted all night.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Very nice product",
      "text": "Love this product. Will purchase more colors. May different ways to use this very fine glitter. Make up, nail color and crafts.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Palmer",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "I didn't like this product",
      "text": "it is not small enough and doesn't look good. Falls all over and doesn't stick well. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "doesn't march description",
      "text": "isn't anything like ice color ...appears as ice and silver but it's neon green",
      "rating": 1.0,
      "verified": true,
      "author": "Kristina Peeva",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Pigmented and easy to apply",
      "text": "So pretty! Pigmented and finely ground. Perfect for an extra glittery pop of color in an eye look. Will definitely buy more colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin B.",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Cute color!",
      "text": "Such a cute color! It’s like a deep pink and it looks great with a nice brown Smokey eye or pink makeup! And it lasts all day when you use the right glue!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great product!",
      "text": "I love this! Great color and very neutral so you can use it with any color eyeshadow and lipstick! It’s perfect for mixing up my look every now and then!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Thick Flakes",
      "text": "The flakes are a little thick. I was hoping for more of a powder. Not sure if I’ll ever use it.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Does not stay put",
      "text": "Disappointed with this color. Did not even last half the day and its gone.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Doesn’t flake",
      "text": "This eye glitter worked well, stuck to the primer , and did not flake off in her eyes .",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberley Dawne",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Not even close to good",
      "text": "I'd u could give 0 stars i would it is the worst ever",
      "rating": 1.0,
      "verified": true,
      "author": "lalalamb",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great item",
      "text": "Use this with NYX glitter glue and wow what a look— lots of compliments",
      "rating": 5.0,
      "verified": true,
      "author": "Gail White",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Tiny tiny bottle",
      "text": "I was thinking it would be a little bigger but it tinnie tiny!",
      "rating": 4.0,
      "verified": true,
      "author": "jerre white",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Good price",
      "text": "Good price I loved this só shine to sex girl 😍❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Stays all day!",
      "text": "My daughter does competitive dancing, which requires heavy makeup. This is perfect and stays all day!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Cary",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Pretty and worth the money",
      "text": "I love it! It’s super sparkly and pretty. I bought the glitter primer to go with it, stays on all day. I rub my finger across it and barely any comes off. Gorgeous! Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Eye",
      "text": "So in love with it. Very bright and goes on great",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Swindle",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Kinda messy",
      "text": "Great price but it’s kinda messy. Otherwise it would be a good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene Jean Hoemberg",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Best product",
      "text": "NYX is just great when u compare quality and prices",
      "rating": 5.0,
      "verified": true,
      "author": "pete",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Fine and not bulky glitter",
      "text": "Considering I got this for 1$ on sale I think it’s pretty nice. The glitter is smooth and fine, and is not itchy! Perfect to mix with a spray!",
      "rating": 4.0,
      "verified": true,
      "author": "Lye",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Awesome",
      "text": "Very pretty! Used for Mickeys Very Merry Christmas Party! Stays on for hours with the glue.",
      "rating": 5.0,
      "verified": true,
      "author": "Britt",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Beautiful",
      "text": "Love love love— the colors are great and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Gail White",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "good glitter, very fine",
      "text": "I used glitter glue to apply but it went on easy and came off easy. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Edie K",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Beautiful!",
      "text": "The rose gold is a really pretty color and the glitter is fine which looked great on skin and in our hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Pretty. Large loose glitter",
      "text": "Very pretty. It is loose larger glitter so have an application plan in place lol",
      "rating": 4.0,
      "verified": true,
      "author": "Amy M",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Life is Better with Glitter!!",
      "text": "I love this product! I have it in my purse at all times so that my outer sparkle reflects my inner sparkle.",
      "rating": 5.0,
      "verified": true,
      "author": "MOJO",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Your going to need the glitter primer if you want to get that shiny look!",
      "text": "It’s totally rainbow fire glitter your not going to need much!",
      "rating": 5.0,
      "verified": true,
      "author": "Tat2 J-me",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Just the right glow",
      "text": "Very pretty got it for new year eve can’t wait to wear it",
      "rating": 5.0,
      "verified": true,
      "author": "cora travis",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Amazing Product",
      "text": "This product does what it says - and it does it well! It is easy to use, it lasts in water & it looks great! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Lola Vaddour",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "It’s glitter",
      "text": "Looks pretty. Haven’t used it yet but I’m sure it will work good",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly tinsman",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "3 bottles!",
      "text": "The seller sends 3 bottles not just 1....After reading someone else's review, it wasn't an accident!!! Awesome!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "ITEM NOT AS DESCRIBED",
      "text": "I don’t know why I wasted my time buying this after reading someone else’s review below about this !!! This glitter is not NYX nor is it even holographic as claimed it’s silver , disappointed & refunded",
      "rating": 1.0,
      "verified": true,
      "author": "Makayla Duncan",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Beautiful",
      "text": "Beautiful, just pretty in every way. Not too much or less . I love it .",
      "rating": 5.0,
      "verified": true,
      "author": "Annie The Kinderklown",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Great product!!",
      "text": "Used it once it seems pretty good quality. I love how it sparkles and with the glitter primer from NyX it stuck on rather well!!",
      "rating": 5.0,
      "verified": true,
      "author": "Yaryna C.",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Good stuff",
      "text": "Glitter stayed put all day for my vow renewal ceremony and looked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss B",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Costume-ready!",
      "text": "NYX is always bomb. This glitter did the job with the help of some glitter glue.",
      "rating": 5.0,
      "verified": true,
      "author": "Oni",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Color payoff!",
      "text": "My daughter ordered this to use for golden knights games. The glitter is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Mills",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Glitter Awesomeness",
      "text": "I LOVE NYX product! Not too cheap and not too pricey. Absolute great quality! Super glittery!",
      "rating": 5.0,
      "verified": true,
      "author": "Yours Truly",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Great buy",
      "text": "My daughter used it on me for my baby shower. Was the bomb",
      "rating": 5.0,
      "verified": true,
      "author": "Sibrina",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Came with 3 .08 oz glitters",
      "text": "I must have not read it bc it came with 3 .08 oz glitters.. Awesome wasnt expecting that..",
      "rating": 5.0,
      "verified": true,
      "author": "chars8383",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Worth the price",
      "text": "Beautiful glitter, the color is beautiful. Can't wait to try it.",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Lee",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Not a lot of pigment",
      "text": "The product is okay if you want to add a little sparkle to a look, but it does not give an intense pigmented glitter look. (Face & Body Glitter, Ice)",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "💗💗💗",
      "text": "Used for cheerleaders for competition. Goes on great with NYX glitter primer. Has a bit of fall out, suggest using setting spray.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "nope",
      "text": "never again , black , it’s just black holo looks silver holo in the pic to me",
      "rating": 1.0,
      "verified": true,
      "author": "Maryah",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "perfect",
      "text": "super fine which I wanted. recommend buying a primer to ensure it stays on longer",
      "rating": 4.0,
      "verified": true,
      "author": "Grace Mansen",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Hair and makeup",
      "text": "Used this on my cheekbones and in my hair on Halloween! Loved it",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth ",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Works great",
      "text": "Works great shows up great don’t have to use very much atall",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina Laymance",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Pro Glitter",
      "text": "First time I wanted to try I was so pleased will definitely recommend,I got so many compliments!",
      "rating": 5.0,
      "verified": true,
      "author": "Frances",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Shine!!",
      "text": "I used for my face makeup and body and I’m in love with this product! It sticks to your makeup and isn’t messy.",
      "rating": 5.0,
      "verified": true,
      "author": "Raini",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Wrong color",
      "text": "It says it's a teal color like in the picture. What I got is almost black with a green tint",
      "rating": 1.0,
      "verified": true,
      "author": "Desi",
      "helpful_votes": 0,
      "publication_date": 20200611
    }
  ],
  "product_meta": {
    "title": "NYX PROFESSIONAL MAKEUP Face & Body Glitter, Ice",
    "description": "Color:Ice| Style Name:SparkleGlam things up a notch and shine like the star you are with our sparkling Face & Body Glitter, available in light-catching shades ranging from ruby red and multi-colored purple to bronzy brown and yellow gold. Pair with our Glitter Primer for a sparkle-perfect look.",
    "rating": 4.5,
    "feature_bullets": [
      "SAY IT WITH SPARKLE: Shine bright with our Face & Body Glitter. Our loose glitter pots are easy to stick anywhere on the face or body with our creamy Glitter Primer. Create everyday glitter looks to festival trends with this loose glitter",
      "GLITTER SHADES FOR DAYS: Our Face & Body Glitter comes in a wide variety of shades to compliment any makeup look or occasion. Glitter makeup from every angle, in any shade, and never miss a festival with our Face & Body glitter",
      "FACE FROM FOUNDATION TO FINISH: Complete your makeup look with our full line of NYX Professional Makeup face products to aid in color-correction & coverage from blush, bronzer, foundations & contouring concealer to palettes powders & setting sprays",
      "CRUELTY FREE COSMETICS: We believe animals belong in our arms—not in a lab. All of our makeup is certified & acknowledged by PETA as a cruelty-free brand. We don't test any of our products on animals",
      "DISCOVER NYX PROFESSIONAL MAKEUP: Try all of our professional makeup & beauty products today, from eyeshadow, eyeliner, mascara & false lashes to lipstick, foundation, primer, blush, bronzer, brushes & more"
    ],
    "specifications": {
      "Product Dimensions": "0.95 x 0.95 x 1.69 inches; 0.54 Ounces",
      "Item model number": "GLI07",
      "UPC": "800897846794",
      "Manufacturer": "NYX Professional Makeup",
      "ASIN": "B079DDCNJY",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Body Glitter",
      "Body",
      "Beauty & Personal Care"
    ],
    "price": 5.85
  }
}