{
  "website_summaries": [
    {
      "verdict": "A multi-purpose table with ample storage space and a worktop that is easy to adjust. If you need an affordable drafting table that's packed with features, this is the one to buy.",
      "pros": [
        "Angle of the top is very easy to adjust",
        "Lots of storage space for supplies, thanks to 3 side drawers and a roomy shelf that's conveniently situated under the tabletop",
        "Even comes with a stool"
      ],
      "cons": [
        "Assembly is a bit time-consuming, especially when it comes to aligning the pieces of the stool",
        "Some complaints of bent components/misaligned predrilled holes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for homework desks",
      "text": "My wife and I were trying to figure out a better arrangement for our kids to do their homework. Our dining room table was getting way too cluttered. We saw these at a big box craft store for considerably more money. When we found them on Amazon, we went ahead and bought two. These are pretty easy to put together. All of the parts were labeled, and the directions were clear. Because they are art desks, the table top will lay flat or lift up to an angle. Each of the kids chose a slightly different angle. The canvas drawers are handy for keeping their supplies organized. Overall, we're very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mwthet",
      "helpful_votes": 5,
      "publication_date": 20180629
    },
    {
      "title": "Perfect for a 12 year old",
      "text": "Reasonably easy for one person to assemble. Mine was missing one screw. My husband was able to find a replacement. The desk looks nice in our 12 year old daughter’s room. It would be small for an adult, unless they want a small desk for a small room. But plenty big for a 12 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Maxeroni",
      "helpful_votes": 4,
      "publication_date": 20190322
    },
    {
      "title": "Great product at affordable price!",
      "text": "I'm an artist and a crafty mom. I have to start by telling that it wasn't difficult to assemble it, just follow the steps and it was pretty fast as well. The table is perfect for a smaller space, it is very comfortable and I love the fact that it can be an art table and a sewing station (that's what i use the table for).",
      "rating": 5.0,
      "verified": true,
      "author": "Valeriya Forbes",
      "helpful_votes": 9,
      "publication_date": 20180323
    },
    {
      "title": "Great for the price",
      "text": "Bought this for my stepsons birthday, we are so excited for him to see it. Great quality for the price. The drawers are basically fabric bins though, not sure how those are going to hold up and the stool is kinda meh - which I had planned on getting him another stool for it at some point anyways so not a huge deal. Overall very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Tabletop came broken",
      "text": "I was so excited about this desk. My roommate and I assembled all the metal parts together and the instructions were easy to follow. Took us about an hour. We got near the end and unboxed the tabletop for the last few steps and found that despite having packaging protectors, one corner was completely broken. The outer packaging doesn’t show any signs of damage. I’m also not able to get the screws tight into the stool - not sure why. The desk regardless looks really great and feels sturdy - but had to give a 3. I’ve contacted the seller and I’m hoping they’ll send me a replacement top soon! Excited to get started.",
      "rating": 3.0,
      "verified": true,
      "author": "Swetha",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Good quality desk for art, crafts, drafting.",
      "text": "The art desk is wonderful. Easy to build, solid table, drawers are perfect. Heavy duty! Desktop stays up, does not fall down when angled. Great price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Msimplestott",
      "helpful_votes": 2,
      "publication_date": 20180503
    },
    {
      "title": "Shipping beware",
      "text": "I loved the way this came together looks damn good small compact but the shipping company tossed the box up and unfortunately the corners were damaged so I gotta give it 3 ⭐️",
      "rating": 3.0,
      "verified": true,
      "author": "Dario G",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Sturdy and easy to adjust.",
      "text": "I like to color and diamond paint. This table is perfect for both! Sturdy, plenty of room and easy to adjust. I have two actually. The only thing I don't care for is the little stool that comes with it. I threw it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Nice working table for the money",
      "text": "I do really like this drafting table. It is almost exactly what I had hoped. I would have given it 5 stars if the drawers were better supported. A support in the front corner would add stability and I would be able to put my books in it without worrying it would collapse.",
      "rating": 4.0,
      "verified": true,
      "author": "kstephens",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Overall great with a few minor drawbacks to consider.",
      "text": "This is a great starter desk. Had no issue with it both in building and using. The chair isn't amazing, but it works and doesn't break. I recommend getting a more comfortable chair if you plan on using this desk as often as I do. The drawers are not solid, they're fabric so be mindful of that, but again, it's a starter table and the framework itself is very sturdy. That's all you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "This desk was pretty easy to put together",
      "text": "This desk was pretty easy to put together. The desk has made our resident artist very happy. The drawers are perfect for art supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "falenedeon",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "way too heavy!",
      "text": "So many parts, so so heavy. Just not right for me!",
      "rating": 2.0,
      "verified": true,
      "author": "Christina W.",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Horrible quality non worth any money!!",
      "text": "It’s just a horrible quality!!! I can’t return it because threw the box away.. but it’s going to the trash! Can’t even work on it because if the cheap non flat surface already scratched..",
      "rating": 1.0,
      "verified": true,
      "author": "Catalina Schultz",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Excellent drawing board",
      "text": "It was easy to assemble, good quality. My grand daughter loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Good but could be better",
      "text": "Good table but the stool sucks. Easy to put together.",
      "rating": 3.0,
      "verified": true,
      "author": "P. G.",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Easy to assemble. Very practical.",
      "text": "Our son has taken a strong interest in drawing, so we purchased this desk for him. He now can keep all of his supplies organized and he uses it daily. It was a great price and took about 30 minutes to assemble. Both the stool and desk were light and simple to put together and the drafting adjustment works great!",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Good quality!",
      "text": "I bought this for my husband as a gift for his birthday and he absolutely loves it. Good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya Lambert",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "I was very happy with it.",
      "text": "It was a surprise for my husband and he loves it, after he put it together... lol",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie S.",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Easy to put together",
      "text": "Some of the pieces were bent but not a big deal. But the stool is not very padded an is off balance. My daughter loved the desk.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany R Thompson",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Cheap and also cheaply built",
      "text": "It’s ok in general, you are getting what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "MARIWI",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Good Buy",
      "text": "We love this desk. Have had it about 6 months and still good as new.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Value for the money",
      "text": "My daughter loves it.. it’s pretty flexible and very easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Edin Herrera ",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Great value",
      "text": "The table was a gift for my Mom and she needs a chair with a back. Other than that she loves the table",
      "rating": 5.0,
      "verified": true,
      "author": "Joy R",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "True to size in pictures online.",
      "text": "Only addition would be a light. My daughter duct taped one on.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Perry",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Nice...",
      "text": "Nice drafting table... very sturdy and has a lot of space. I use this every day!",
      "rating": 5.0,
      "verified": true,
      "author": "Wulfgar",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "easy to assemble",
      "text": "We were looking for something simple, easy to assemble, small and manageable.It might not be the fanciest drawing table but it is perfect for a beginner artist.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Chavez",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Product care and presentation was not great.",
      "text": "Product arrived with scratches. Torn/ ripped cardboard base for the drawers. Paper catching bar was is bent.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Dock",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "This item is for  Young adults",
      "text": "I bought this for my granddaughter for Christmas she is going to love it",
      "rating": 4.0,
      "verified": true,
      "author": "Vickie L Siess",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Very easy to put together and very good quality",
      "text": "This was exactly what I was looking for. Very easy to put together and very good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Old purchase from Michael's",
      "text": "I've had this for years now, I bought it used from a Michael's so it wasn't a surprise that it was damaged, however, over time the drawers sag. Don't put books and collectively heavy items in the drawers. It's good for crafting, not drawing/paints/papers. I had to replace the stool because it was not comfortable. I suggest buying for yarn crafts or a material assembly station.",
      "rating": 3.0,
      "verified": false,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20181007
    }
  ],
  "product_meta": {
    "title": "Best Choice Products Drawing Drafting Craft Art Table Folding Adjustable Desk w/Stool - Black/White",
    "description": "Artists, architects, and creatives: invest in your inventiveness and productivity with this adjustable workstation. Focus on keeping your creative juices flowing instead of worrying about a hunched back and aching neck. You can perfectly angle the table and set it to a height that's just right for you. Don't interrupt your work to find what you need; quickly and easily access your things via the attached shelf with 3 drawers and an additional shelf under the table. Inspiration awaits you. \n\nSpecifications:\nOverall Dimensions: 47\"(L) x 23.75\"(W) x 30 - 45\"(H)\nMain Tabletop: 35.5\"(L) x 23.75\"(W)\nSide Tabletop: 14.25\"(L) x 13.25\"(W)\nDrawers: 13\"(L) x 12.75\"(W) x 3.5\"(H)\nShelf (Underneath): 25.5\"(L) x 6.5\"(W) x 3.5\"(H)\nStool: 11.75\"(Dia) x 20.5\"(H)\nDesk Capacity: 110 lbs.\nSide Table Capacity: 22 lbs.\nStool Capacity: 198 lbs.\nWeight: 48.5 lbs.\nColor: Black, White\nMaterial: Steel, MDF\nAssembly required (with hardware and instructions)\n\nPackage Includes:\nAdjustable workstation w/ extra shelf and drawers\nPadded stool\n\n\n\nBCP SKU: SKY4379",
    "rating": 4.3,
    "feature_bullets": [
      "Increase productivity as you create, draw, or build at the perfect height and angle with this adjustable workstation",
      "Work more efficiently with easy access to any materials or tools you need using 3 drawers and an extra shelf attached to the table",
      "Conveniently store any books or materials on an additional metal shelf under the table that keeps items out of the way",
      "Stay focused on your work/studies on a comfortable padded stool for the perfect finish to your workstation",
      "Overall Dimensions: 47\"(L) x 23.75\"(W) x 30 - 45\"(H); Desk Capacity: 110 lbs."
    ],
    "specifications": {
      "Item Weight": "48.5 pounds",
      "Product Dimensions": "47 x 23.75 x 30 inches",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B079YYGQ4Y",
      "Customer Reviews": "4.3 out of 5 stars71 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#883,910 in Home & Kitchen",
      "Date First Available": "February 19, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Home Office Furniture",
      "Home Office Desks",
      "Furniture"
    ],
    "price": ""
  }
}