{
  "website_summaries": [
    {
      "verdict": "The shoe possesses a name that is only fitting. This tour-ready piece is packed with different technologies that help arm the golfer with what they need on the turf and more. Wearers specifically noticed a huge difference with its comfort, craftsmanship, support, and stability. It is no wonder that the majority claimed that they would recommend this item.",
      "pros": [
        "Many users claim that the Footjoy Tour S provides the right balance of comfort and performance",
        "The comfort of this Footjoy golf shoe is the next level",
        "It feels as if it has been broken-in for a long time",
        "Several consumers like the wide set of cleats because it grips the ground",
        "Plenty of users attest to this trainer’s stability",
        "It improves the stance and prevents the foot from shifting on the inside when doing a swing",
        "Though its price is a bit steep, a high number of reviewers find that it is worth it",
        "Some testers claim that it is durable and well-made"
      ],
      "cons": [
        "Several commenters have experienced issues with the laces",
        "They do not stay tightly tied, and some had encounters with the eyelets ripping",
        "A couple of commenters complain about the spikes falling off during play"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Toe box is narrow...",
      "text": "These run a little bit large and the toe box is definitely not generous. That being said, the shoes were immediately comfortable to walk and play in, but 1/2 size down would have probably worked a bit better for me. Great looking shoe and the platform is very stable.",
      "rating": 4.0,
      "verified": true,
      "author": "Podqueen",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great golf shoe",
      "text": "Had to return first pair. Upper portion of the tongue on right shoe tore off when putting them on. A replacement pair was shipped immediately and so far they have been a great shoe. Whether or not the first pair had weak stitching or I pulled too hard putting them on, I don’t anticipate having the issue ever again and thus am very happy with these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Dumptruck9",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Tongue torn in 4 months of owning.",
      "text": "Shoes only lasted about 20 times out and then part of the tongue torn off on it. Didn’t even last 4 months. I would not recommend buying this model.",
      "rating": 1.0,
      "verified": true,
      "author": "Lee Huelskamp",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Good fit. Good shoe. Good cleats",
      "text": "Shoe size matched up with my running shoes well. 11.5 4E normal shoes and these work well. Played a few rounds already in very wet grass and havent noticed any water in my shoes. Look great and thr cleats feel good in the turf. Very happy. Looking forward to many more rounds.",
      "rating": 5.0,
      "verified": true,
      "author": "Proc N",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Order a half size to a size smaller",
      "text": "The only reason I gave 2 starts is because I never wore them. They were way to large out of the box. I read a lot of people saying this but I didn't listen...should have. Always been a 8.5 in all Foot Joys as well a 8.5-9.0 in most other shoes. Thinking I might lust go back to the classic dry joys at 8.5 and be done...it's a GREAT shoe but a lil pricey. Hope this helped...order small or return them like I had to.",
      "rating": 2.0,
      "verified": true,
      "author": "Marty Franklin",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Good golf shoes",
      "text": "Great shoe for the price. FJ, shoes are (for me) the best shoes for the money. A little more expensive, but worth it. I have 2 pair and rotate them as I play 2 to 3 times weekly.",
      "rating": 5.0,
      "verified": true,
      "author": "scraig",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "The possible defect",
      "text": "This is my second pair,after returning the previous pair because a cleat broke after one day of use and the second pair has the same cleat in the same location that has broken on the shoe after only two days of use. I will be returning this second pair shortly.",
      "rating": 3.0,
      "verified": true,
      "author": "rick woulfe",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Great golf shoe",
      "text": "These run a bit large so I always order a 1/2 size smaller. Got these and for the waterproof outer material, solid base and replaceable cleats. I play golf 6x a week and I rotate this shoe and another every other day. High quality and would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Durand",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Perfect golf shoe!",
      "text": "My husband loves these shoes! Plays golf a least once a week and never complains about his feet. True to size and best support",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Skolaut",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Best golf shoe made.",
      "text": "This is one of the best shoes produced by foot joy. Very comfortable and really is waterproof. My feet don’t hurt after walking 18 to 36 holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Doland Miller",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Fit true to size",
      "text": "I have not warn them to golf yet but next month traveling to Florida . They seem comfortable though and I expect they will be very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Great Shoe",
      "text": "Product arrived as promised in perfect (new) condition. The shoe fits perfectly (runs identical to other FJ golf shoes) and very comfortable. Traction as excellent and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold P. Carter",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Nice Golf Shoe",
      "text": "One of the best Footjoys I have had. They do tend to run a little narrow but I ordered 10.5W and they are perfect! Very stable shoe! Have already played 3 rounds in them! No breakin at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin ",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "True to fit",
      "text": "Good shoe fits good. Toe box is slightly narrow but seemed to stretch out during first round of play.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great shoe at discounted price",
      "text": "Like the stability, where the spikes align to the balls of my feet, lightweight and comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice looking shoe",
      "text": "My husband loves these new golf shoes. They kept his feet dry on the wet grass and look sharp",
      "rating": 5.0,
      "verified": true,
      "author": "mom to 2 boyz",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Joy for the Foot",
      "text": "Looks great and fits great! They give me better stability when hitting the ball. Very glad I bought them.",
      "rating": 5.0,
      "verified": true,
      "author": "J Matar",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Another great foot joy product",
      "text": "Foot joy continues to impress me. Right out of the box ready to wear. No break in period necessary. Great grip out of them as well",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Should I return them?",
      "text": "I used the shoes for the first time today. And When I was done I was missing 4 spikes. Should I return them or can you get footjoy to send me bee spikes?",
      "rating": 2.0,
      "verified": true,
      "author": "dennis giordano",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Very classy",
      "text": "Very impressed so far. Great looking shoe and will get you compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Satisfied",
      "text": "Foot joy always fits and size is always true. Never know about other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald S.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great golf shoe!",
      "text": "Perfect fit - this shoe immediately improved my golf game!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Anderson",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Very hard sole shoe.",
      "text": "My pevious pair of FJ Originals where far more comfortable. On these the hard plastic sole gives no cushion and spike plate extend wider than the foot print/tread and so every once in a while I clip myself with a spike in the ankle as Im walking along and it hurts. These shoes run narrow size wise. Im wearing a half size larger than I normally wear and they still pinch the little toes. Although they are like torture devices on my feet they are great as far as power transfer and stability through the swing.",
      "rating": 3.0,
      "verified": false,
      "author": "Bill",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "broken eye hole",
      "text": "the top eye hole to lace your shoe will break it is made of cheap plastic",
      "rating": 1.0,
      "verified": false,
      "author": "raymond rocha",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Best shoe on the market",
      "text": "Awesome shoe if you walk. These shoes have tremendous arch support and are worth the money. I have 2 pair and rotate them. Trust me, after walking 18 with these shoes, your feet will love you. They also perform as advertised.",
      "rating": 5.0,
      "verified": false,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great fitting and water tight FootJoy golf shoes",
      "text": "Awesome shoe right out of box. Wet grass in 39 degree weather and not a drop made it through. Really comfortable and fit perfectly.",
      "rating": 5.0,
      "verified": false,
      "author": "Douglas S.",
      "helpful_votes": 0,
      "publication_date": 20191229
    }
  ],
  "product_meta": {
    "title": "Footjoy Men's Tour S Golf Shoes",
    "rating": 4.6,
    "feature_bullets": [
      "Proprietary Pebax Powered Chassis by Arkema",
      "Carbon Fiber Heel Cup and Outsole Plate",
      "Outer Material: Other Leather",
      "Inner Material: Manmade",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "100% Waterproof",
      "PPL - Pure Performance Luxury",
      "FJ Launch Pods"
    ],
    "specifications": {
      "Date First Available": "16 April 2019",
      "Manufacturer": "FootJoy",
      "ASIN": "B07QS2RTW4",
      "Department": "Men’s"
    },
    "categories": [
      "Golf Shoes",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}