{
  "website_summaries": [
    {
      "verdict": "You won’t feel overly dressed at happy hour when you’re wearing the OluKai Kulana straight from work. Its simple yet elegant style easily fits in any boardroom meeting, but because of its light construction, it can also be used on boats or beaches. However, the bottom structure of this walking shoe may be something you need to get used to. But in the end, it still comes highly recommended for its design and performance.",
      "pros": [
        "A majority of the owners find the OluKai Kulana comfy to wear in the office or on the beach",
        "The flexible construction of this slip-on walking shoe makes it easy to traverse uneven surfaces, says many reviewers",
        "According to a bunch of people, this model fits well",
        "Multiple buyers commend the arch support on this model as their feet don’t quickly get tired",
        "The sophisticated aesthetics of this product appeals to a lot of gentlemen"
      ],
      "cons": [
        "Some consumers have ranted about the durability of the Kulana because the seams unraveled, and the top material quickly got scuffed",
        "A few users felt unstable because of the shape of the rubber pods, especially at the heel"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 7.5,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Long search may be over",
      "text": "The comfortable, durable, well-designed slip-on moccasin is must-have for travelers. We live in these things. How many pairs that looked solid came apart inside of a year? These Olukai Kulanas look to be the solution. Incredibly well-built and supremely comfortable, couldn't be happier. Particularly grateful for perfectly shaped toe area. No constriction! Only worn them a month, but anticipate no durability issues. Clearly made by people that care.",
      "rating": 5.0,
      "verified": true,
      "author": "MAntv58",
      "helpful_votes": 6,
      "publication_date": 20190201
    },
    {
      "title": "Scuffs terribly in just one day",
      "text": "I was so excited that these shoes fit my husband and bought them in several colors but sadly these have a horrible defect. I second the other reviewer who pointed out the critical design flaw of these shoes. The rubber does not extend to the toe or the heel so after my husband wore these for literally 1 day indoors the edges of the toe and the heel were already scuffed and leather wearing down. That is completely ridiculous. The arch support and look and fit were great bc he’s a 14 wide and very hard to buy for but at the end of one day they already looked like he had had them for years... not ok. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen Davis",
      "helpful_votes": 3,
      "publication_date": 20190905
    },
    {
      "title": "This is their dress shoe, and you can wear it all day long...very comfortable",
      "text": "I love Olukai shoes, and I have flat as a pancake feet. This particular model is their flagship model and is elegant enough for any night out, and comfortable enough to wear all day and into the evening. The workmanship on these shoes are exceptional. Yes I wish the front toe of the shoe was better protected for wear, but these are so elegant that you are not going to wear them to go rock hunting.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Rodrigues",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Don’t but these shoes they wear out due to lack of a sole",
      "text": "I’m really disappointed in these shoes. I have other Olukai shoes and flip-flops. Love them all. But I wore those 4-5 times and you can see the wear.",
      "rating": 1.0,
      "verified": true,
      "author": "BC_PCola",
      "helpful_votes": 3,
      "publication_date": 20190611
    },
    {
      "title": "Worth the price",
      "text": "I wear US mens size 12 and these were a little loose. The quality and craftsmanship is real, nice looking slip on loafers. Leather is soft and looks amazing, stitching is outstanding, so far they have been very sturdy. Full leather with no ventilation so prepare for some hot feet in tho.",
      "rating": 4.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Really nice",
      "text": "I have a wide foot (4E with some brands) and these fit like a glove. These can be used with dress casual attire, no problem. Very comfortable and they look nice.",
      "rating": 5.0,
      "verified": true,
      "author": "USC88",
      "helpful_votes": 2,
      "publication_date": 20190401
    },
    {
      "title": "feels like a slipper",
      "text": "Love olukai's cloth shoes - ordered this leather one. It feels smooth and supple. Great shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Cohen",
      "helpful_votes": 2,
      "publication_date": 20190122
    },
    {
      "title": "Very nice shoes!",
      "text": "Ordered these for my husband as a nice, comfortable slip on for work and he loves them. Says they are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris J.",
      "helpful_votes": 2,
      "publication_date": 20190107
    },
    {
      "title": "another Olukai winner!",
      "text": "Casually dressy - if that makes sense. Same great quality and fit. definite 5 star!",
      "rating": 5.0,
      "verified": true,
      "author": "Chiefajr",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "These shoes were the best Birthday present ever",
      "text": "These shoes were the best Birthday present ever! Fit like a glove, so soft and comfortable! Couldn't be happier with them!",
      "rating": 5.0,
      "verified": true,
      "author": "EugenieKahle",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great product",
      "text": "They shou is extremely comfortable, Almost feels as though you wearing your bedroom slippers. Very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "M.  Becker",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Not enough heal - wears out leather prematurely.",
      "text": "I love this Brand - the shoes fit and extremely comfortable. These shoes run smaller than the other leathers models and the sole on the heal doesn't extend back far enough. After only wearing them 4 times the leather on the heal is already showing what I would consider excessive signs of wear.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Great shoes",
      "text": "Great shoes, I just bought the wrong size, returned them and re-purchased the correct size.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Most comfortable shoes ever!!",
      "text": "Use for daily use, they are great shoes, my third pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great shoes!",
      "text": "Husband was a fan of their flip flops & loves his new loafers!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great shoe",
      "text": "Louisiana Kulana is a great dress/casual shoe. Well constructed and comfortable. Get these!",
      "rating": 5.0,
      "verified": true,
      "author": "KO",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Not happy thank you",
      "text": "We have bought two pairs Can’t get happy From the original pair we bought in the pass Please help to return these Thanks Marie Webb 678-576-4539",
      "rating": 2.0,
      "verified": true,
      "author": "chadcolin",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Cheaply made",
      "text": "Cheaply made for the price - stitches coming out after a single wear.",
      "rating": 2.0,
      "verified": true,
      "author": "slushbox",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Worth the money",
      "text": "This is my first shoe, I already own a pair of sandals. The leather is really soft and the shoe is as comfortable as expected with this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Grant Wolak",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Amazing shoes",
      "text": "They are awesome, leather is soft, the shoe is super comfortable. The brand is superior to most shoes in that arena but worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "RALPH GOMEZ",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Could not be more satisfied.",
      "text": "Versatile go to shoe for ultra casual to business casual to low key dress. Very supple and comfortable. A high quality shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald L Corbett",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Packaging contaminated with probable detergent",
      "text": "Box and shoe contaminated with what appears to be dried out laundry detergent. No evidence of detergent on secondary shipping box.. disappointing product was fulfilled in this condition.",
      "rating": 3.0,
      "verified": true,
      "author": "SAMMY MASRI",
      "helpful_votes": 0,
      "publication_date": 20201208
    },
    {
      "title": "Love these shoes",
      "text": "Great shoes, I’ve bought them multiple times over the years",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Moore",
      "helpful_votes": 0,
      "publication_date": 20201118
    },
    {
      "title": "Order a size larger",
      "text": "Olukai’s Have an excellent foot bed and arch support and cushioning. And they last forever. I just bought the Kulana’s and love them. But be advised, buy a full size larger as these run small. Maybe it’s just me, but I wear an 11, ordered an 11, and couldn’t get into them w/o a shoehorn. You shouldn’t need a shoehorn with Olukai shoes, comfort is the selling point. If they were true to fit, this would be a 5 star review. (I returned them for a 12.). And this is the first time this has happened to me with Olukai.",
      "rating": 4.0,
      "verified": false,
      "author": "Joe Danville",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "These are NOT the big toe box Olukais that I have gotten used to.",
      "text": "Gorgeous, high quality leather shoes from Olukai. However, these shoes are much narrower than the Nohea, Moloa, etc. that I have worn for years. I thought these would be a good followup to my favorite shoes, the Olukai Puhalu, which are starting to get worn out. However, as beautiful as the Kulanas are, they are on a completely different last and are much narrower. Therefore, I have to send them back.",
      "rating": 5.0,
      "verified": false,
      "author": "Emil",
      "helpful_votes": 0,
      "publication_date": 20190316
    }
  ],
  "product_meta": {
    "title": "OluKai Kulana Shoe - Men's",
    "description": "Features leather upper, slip on style, and leather footbed cover. Durable non-marking rubber wrapped in smooth leather and embossed upper logos. Anatomical PU footbed with gel insert and laser-etched pineapple artwork on footbed",
    "feature_bullets": [
      "Features leather upper, slip on style, and leather footbed cover",
      "Durable non-marking rubber wrapped in smooth leather and embossed upper logos",
      "Anatomical PU footbed with gel insert and laser-etched pineapple artwork on footbed"
    ],
    "specifications": {
      "Age range": "Adult",
      "Color": "Dark Wood Dark Wood",
      "Size": "8 UK",
      "Style": "Kulana",
      "Height": "0.7 inches",
      "Item display length": "11 inches",
      "Weight": "907 Grams",
      "Item display width": "14 inches",
      "Material type": "Synthetic-and-mesh",
      "Batteries Included?": "No",
      "Brand": "OLUKAI",
      "Department": "Men’s",
      "Manufacturer": "Olukai",
      "Manufacturer reference": "10380-6363",
      "Product Dimensions": "12.7 x 12.7 x 1.78 cm; 249.48 Grams",
      "ASIN": "B07942TKZV",
      "Date First Available": "21 May 2018",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Shoes",
      "Sandals",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 197.15
  }
}