{
  "website_summaries": [
    {
      "verdict": "Nice picture quality by a top name in TVs that proves you don't have to spend thousands to enjoy 4K technology.",
      "pros": [
        "This smart TV delivers excellent picture quality, combining 4K with High Dynamic Range",
        "Great television for the money, with easy setup",
        "Voice control remote works with Alexa"
      ],
      "cons": [
        "Stand durability issues have been raised by some owners"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best TV I've ever had, for the price, this is a no-brainer!",
      "text": "The first one they sent to me was broken, I was really bummed out... But after I got on the phone with Amazon customer service I was amazed. In a five minute phone call they already had the new TV ordered and on it's way. When I got the TV it was easy to set up right out of the box, phenomenal picture quality... It makes standard television shows burst right out of the screen with crisp vivid color and detail. For the price, this is a no-brainer buy, very pleased...",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Searles",
      "helpful_votes": 82,
      "publication_date": 20180715
    },
    {
      "title": "Great bang for the buck!",
      "text": "I am completely blown away by the picture and sound quality .. especially considering the price point. It did take a bit of tweaking to calibrate the screen to my liking (I also like the fact that you can have different picture settings, per HDMI input device), but I cannot be happier with the overall results. It upscales normal HD to UHD wonderfully. I saw some negative comments about the stand quality, but in all honesty .. I didn’t use it. I needed a pedestal type stand and ordered that separately (PERLESMITH Universal TV Stand - Table Top TV Stand for 23-49 inch LCD LED TVs - only $26.99). I’m quite happy about that too.",
      "rating": 5.0,
      "verified": true,
      "author": "tPet",
      "helpful_votes": 21,
      "publication_date": 20180907
    },
    {
      "title": "Can't beat it for the price",
      "text": "A CR Best Buy, which is why I bought it. Can't beat it for the price, and attaching accessories is really easy using the \"magic remote\". The little legs make me nervous as they do not hold the TV as steady as I would like (it is on a console table), but on the other hand the gap between the legs has allowed my to put the soundbar directly under the TV.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenda Sugarbean",
      "helpful_votes": 13,
      "publication_date": 20180830
    },
    {
      "title": "My life has changed!",
      "text": "A smart TV at an amazing price with great sound and picture quality delivered FREE by Amazon! The remote is cheap and cumbersome. I downloaded LG TV PLUS app on my phone, which is more user friendly. You can also buy a smart remote from LG, I believe. I watch my favorite Youtbe channels and Amazon movies everyday!",
      "rating": 5.0,
      "verified": true,
      "author": "julie",
      "helpful_votes": 8,
      "publication_date": 20180912
    },
    {
      "title": "Decent TV, not great customer service",
      "text": "The TV worked well for a few weeks. Then a piece one of the plastic feet that came with it snapped and the whole thing tumbled off the table it was sitting on and smashed the screen. Amazon told us that because we were past the return window, we should contact LG, LG told us a broken screen was out of warranty despite the fact that a faulty LG part caused the breakage. I won’t be buying any more expensive electronics from LG.",
      "rating": 2.0,
      "verified": true,
      "author": "rockwren",
      "helpful_votes": 8,
      "publication_date": 20180924
    },
    {
      "title": "Perfect purchase",
      "text": "I really like the picture quality. I have very basic needs for a Tv so this Tv is perfect for me. Quick shipping. Volume is perfect. Have it in my Bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy Kuhnau",
      "helpful_votes": 8,
      "publication_date": 20190112
    },
    {
      "title": "Great Picture, Great Features",
      "text": "This 49\" is very impressive. The setup is a little time consuming as the instructions are very poor out of the box. But once you find the settings button on the remote, and especially if you use YouTube to watch how it's done, getting the picture quality is a breeze. I'd certainly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Wiley",
      "helpful_votes": 4,
      "publication_date": 20181114
    },
    {
      "title": "HDMI or curcuit board issues.",
      "text": "After all the great reviews for this TV, I got it for a Black Friday Sale to replace a 32 inch Samsung. Took it out the box, connected my PC, PS4 and Xbox One consoles. PC color washed out the next day and connected that to my 49 inch TCL Roku TV. Installed a software update 3 weeks later and found the sound and color improved for the consoles. A week after, the signals from the consoles don't register but do work on my TCL Roku TV. Disappointing product from LG. I guess I'll get another TCL Roku TV. Once I get my refund. Or maybe they may offer to replace the same item for one that works.",
      "rating": 2.0,
      "verified": true,
      "author": "Theodore Kane",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Best purchase this year",
      "text": "I love, love, love this TV. After setup, it took about a week to get the picture how I wanted it. Between the soap opera effect and the dark color of the screen...I was so close to returning it. But I finally figured out my perfect setting and I LOVE IT! Best purchase made this year.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 4,
      "publication_date": 20180916
    },
    {
      "title": "Five Stars",
      "text": "Great screen quality. I've never had an HD/4K tv before and it's very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather G",
      "helpful_votes": 5,
      "publication_date": 20180806
    },
    {
      "title": "Cheap plastic legs - be prepared to purchase an after market stand.",
      "text": "So, received this tv yesterday - haven't been able to hook it up - the legs are definitely cheap plastic as posted in other reviews. One even kept just falling off when I was trying to set it on the surface. And, they are so wide, it didn't fit on top of my dresser that I planned to use. So, I now had to order a center table top tv mount & am waiting for this to arrive, hopefully Saturday. Once i get this tv hooked up and turned on, I will amend my review.",
      "rating": 3.0,
      "verified": true,
      "author": "Marie R",
      "helpful_votes": 9,
      "publication_date": 20180719
    },
    {
      "title": "So Far So Good - Life IS Great LG",
      "text": "TV is perfect size for our med/large bedroom. Didn't like the type of leg supports it came with, as so many do these days so, I ordered a separate adjustable, back mounted, swivel TV support stand which works GREAT. Picture is VGood. I used the HDMI plug/hook-up option. Set up TV functions to our liking and integrated with my local cable carrier like a duck to water. No Problems. I did get warranty insurance for it though, just in case. - Murphy's Law.",
      "rating": 4.0,
      "verified": true,
      "author": "G.D.C.",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Thanks amazon 👍",
      "text": "It came a day late but it was worth the wait this is my first smart tv and all I can say is woow I got me a 49 and this is a nice size it shows a great picture too I love it all ready and if I have any problems I will let y’all know also it was a great price it doesn’t come with a magic remote so don’t get mad",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Stewart",
      "helpful_votes": 3,
      "publication_date": 20181107
    },
    {
      "title": "First came smashed, second good.",
      "text": "First one arrives all smashed up even though packaging was fine. Second one was fine, and it's a good TV. The sound-out is a bit fiddly and audio delay range isn't enough (goes positive but not negative).",
      "rating": 4.0,
      "verified": true,
      "author": "samuelnathanrichards",
      "helpful_votes": 2,
      "publication_date": 20181212
    },
    {
      "title": "Worth every dime😃",
      "text": "Very nice tv, delivery was fast, it arrived securely packaged by ups. The view is clear and the sound is amazing. Includes games, music, etc. Setup was simple as well, I am very happy with my new tv.",
      "rating": 5.0,
      "verified": true,
      "author": "Star leone",
      "helpful_votes": 3,
      "publication_date": 20190314
    },
    {
      "title": "DO NOT BUY",
      "text": "Do not buy this TV - I do NOT write reviews but feel the need to do so because this TV is THAT bad. As far as picture, sure, it looks good. As far as internet connection..... its nonexistent. You will have to constantly reconnect to the internet every time you turn your TV on, and that's IF your TV even recognizes any WiFi network around. I have another TV in my bedroom, far away from my WiFi router, that has absolutely no issues with connectivity. It is not an LG. I have never in my life been so disappointed in an electronic device. It is not worth the money, or time on the phone with LG.",
      "rating": 1.0,
      "verified": true,
      "author": "CMS",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "It’s horrible",
      "text": "It looks amazing and I can use it to play my pc games. However, that’s all I can do not it!!! The hdmi only wants to work with my pc and works with my switch whenever it feels like it and I can’t even connect to the internet on it like it’s supposed to",
      "rating": 2.0,
      "verified": true,
      "author": "wingking",
      "helpful_votes": 3,
      "publication_date": 20181220
    },
    {
      "title": "Excellent TV for the price",
      "text": "We purchase this TV in December and are quite pleased. In the beginning, the picture takes a little time to adjust but eventually settles down. The set-up is a bit more complicated than necessary but quite workable. I disagree with some reviewers that criticize the \"Smart\" media. Personally, I kind of like all the added channels and had no issues with Netflix, Hulu, You Tube or Amazon Prime movies. The TV quickly linked to my 2G but did not recognize my 5G wireless network. Still, the speed seems plenty adequate",
      "rating": 5.0,
      "verified": true,
      "author": "mrj",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Can't Recommend",
      "text": "Nice TV but every day it loses cable, sometimes several times a day. We have to unplug it from the cable box to get cable. Amazon prime always work. I know it is the tv because we have another smart tv and it works with cable just fine. We changed settings and we .are still having the problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Toni Butrico",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Not very durable",
      "text": "I bought this tv to replace my 7 year old one. Unfortunately, I’ve had this for only a few months and already one of the hdmi ports occasionally doesn’t work and the power supply is causing the tv to sputter about once an hour.",
      "rating": 2.0,
      "verified": true,
      "author": "Kara R.",
      "helpful_votes": 6,
      "publication_date": 20181028
    },
    {
      "title": "Same Issue with 2 TV’s",
      "text": "Ordered this TV and it worked for about a day when a 1 inch flashing bar came across the top. It was clearly a defective device so I exchanged it. 2nd TV arrived and within 2 hours of use, same issue. I’m not sure if this is a known issue but I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20190316
    },
    {
      "title": "Excellent TV",
      "text": "Why would anyone need to spend more than $320 for a TV. I bought this as an emergency backup for my 2nd TV which was on its last leg. I was shocked to find out how nice it is for a $320 TV. Don't get misled by all the specs and tech spec BS. The difference is much smaller than you think in real life usage.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Chung",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Best value for money",
      "text": "Picture and sound quality gives a new experience to any content being viewed on it. Had it for more than a year and haven't had a bad experience with it.",
      "rating": 5.0,
      "verified": true,
      "author": "OG",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Defective tv",
      "text": "Tv is defective, top of the tv has a few lines that keep on flickering. Google assistant has minimal support, heck it can only increase the volume, and that also barely works. It can't even turn on the tv.",
      "rating": 1.0,
      "verified": true,
      "author": "Hijakilan",
      "helpful_votes": 2,
      "publication_date": 20190328
    },
    {
      "title": "I Love This TV",
      "text": "I do not have cable or a dish. I have an inside antenna, YouTubeTV and Amazon Prime and the picture is excellent with all. I have had no problems and I love my new TV.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Colours are deep rich and vibrant",
      "text": "Love my TV just what I expected from Lg, the colours are deep and beautiful, my tv stays on for most of the day so I needed a high perfomance TV which I usually get from Lg. Legs seemed a little flimsy but no problem mounted it on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "One of the HDMI ports doesn't work on a brand new TV.",
      "text": "We saw this in a store and everyone was out of stock on the size we wanted. We really liked the picture so we searched online and found it here on Amazon. After setting up the TV we noticed the sound wasn't great but that was easily fixed with a sound bar. What we found most disappointing is that only 2 of the 3 HDMI ports work on a brand new TV.",
      "rating": 3.0,
      "verified": true,
      "author": "Sean N.",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Awesome picture, easy setup",
      "text": "Bought 2 of these, one 49\" and one 43\" ... both have great picture, and both have Bluetooth audio out (which for us was a must have feature). Docked these TV's one star due to their claim of being compatible with Alexa ... was never able to make connect the TV to Alexa ... gave up trying.",
      "rating": 4.0,
      "verified": true,
      "author": "TStrange",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "LG 3",
      "text": "Love the tv. It’s a wee bit difficult to set up without a magic remote, however. I’ve ordered one. Hopefully we’ll have smooth sailing after it arrives.",
      "rating": 4.0,
      "verified": true,
      "author": "KMH",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Its ok for the price",
      "text": "Love the packaging.. Its ok for price.. I expected to be of better quality.. Make out of some cheap plastic.. Light weight..was no LG logo at the back.. My mom first lg tv is make out of better quality",
      "rating": 5.0,
      "verified": true,
      "author": "Odin Henry",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Great Garage TV",
      "text": "This TV is great for the value. Not top of the line but has all of the features you need. I mounted this in my garage to watch sports while I am dinking around and my only regret is that I didn't go quite big enough. You get the bang for your buck here. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Unbeatable for the price",
      "text": "Very solid TV with excellent picture and (if you invest in the Magic Remote), a joy to operate. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Carsten M.",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great tv",
      "text": "This is my first “smart” tv. I really like the sound and quality. The actual dimensions were given in the description which helped tremendously in deciding on the purchase. It had to fit into a built-in unit and it’s true to the given dimension.",
      "rating": 5.0,
      "verified": true,
      "author": "reader10",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Awesome tv for the price and features!",
      "text": "Love this TV! Built in Netflix and amazon prime have been great! Also works fantastic w/ my Apple TV!",
      "rating": 5.0,
      "verified": true,
      "author": "Justinwphoto",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "great product",
      "text": "Even though it is not expensive, but everything about this TV is beautiful. Scrreen, sharpness, sound, control. It is just a gorgeous TV. It is such a great deal to have this TV at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "WISPLIN",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Works with Alexa",
      "text": "The picture quality is great. Bought this model due to sales on prime day, 2018 model and work with alexa. The cons side will be the tv is shaky with the leg mount fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Joeson.K",
      "helpful_votes": 2,
      "publication_date": 20180804
    },
    {
      "title": "Great TV at the right price",
      "text": "The picture and sound are superb and the TV is small and light enough to be carried by one person. I highly recommend the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hartley",
      "helpful_votes": 2,
      "publication_date": 20180810
    },
    {
      "title": "Did not last a month",
      "text": "Had it for 30 days and the screen just died. Went black on one side and spread across the screen",
      "rating": 1.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great price",
      "text": "LG fan. Had a 12 year old LG that retired to the bedroom. Fantastic picture and features for the price. would highly recommend. there is no TV out there with great sound-that's why everyone makes sound bars.LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Easy to use and connect devices",
      "text": "I love this TV. It is very easy to use ( much easier then my Samsung TV) and it has a connection for a VCR or DVD. I wish my other TV was also LG",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Thorn",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "LG tv",
      "text": "High quality shipping, high quality TV, very happy, good product and price",
      "rating": 5.0,
      "verified": true,
      "author": "4sewahz",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "NOT HAPPY",
      "text": "I HAVE TWO COMPLAINTS: 1) THERE ARE 1/2 CIRCLES ON THE RIGHT SIDE OF TV. 2) I HAVE A HEARING PROBLEM SOMETIMES. I USED WIRELESS HEADPHONES WITH MY FORMER TV. THE HEADPHONES DON'T WORK WITH THIS TV.",
      "rating": 2.0,
      "verified": true,
      "author": "darryl peisner",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "DO NOT BUY!!!",
      "text": "After 120 hours use, the TV stopped working -- will not connect to the internet. Issue is the TV, not the ISP. IG sent someone to repair. Part they ordered was also defective. One month later and TV still not repaired. Will never buy LG again -- stick with Samsung and Sony! Also, the screen was cracked when it arrived but Amazon replaced. Box not damaged and TV was well packed so no idea how that happened.",
      "rating": 1.0,
      "verified": true,
      "author": "Texas Mom",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "nice tv",
      "text": "So far so good...it's been a couple of months and my last LG went 7 years...hopefully this will last longer in this disposable world...",
      "rating": 5.0,
      "verified": true,
      "author": "bigstick",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Love it!",
      "text": "After reading a lot of reviews, I was hesitant to purchase this tv, but I'm really glad I did...Arrived on time and totally intact. Easy set up out of the box and works perfectly with my Echo Dot! I have had it over a week and no problems at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Merten",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great tv",
      "text": "I installed this tv in my bedroom and it’s great! I have never had a problem with it. It’s no OLED tv, but it has a great picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "The stand is designed for large table.",
      "text": "No problems. I watched a couple of old movies and saw things I missed before.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles L. Shaffer",
      "helpful_votes": 2,
      "publication_date": 20181208
    },
    {
      "title": "Excellent TV",
      "text": "Bought this as a second TV for a Den. Picture quality is excellent with just a little tweaking.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Mackie",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Love my TV",
      "text": "My son mounted my new TV for me in nothing flat. it is clear and just what i wanted to replace my other that had a backlight go out.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Average TV !",
      "text": "Average TV. Very user friendly, and remote is updated from previous versions.",
      "rating": 3.0,
      "verified": true,
      "author": "MV",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "Good deal for price",
      "text": "I'm not a television expert, but this TV has worked fine for me so far. The stand that it came with was pretty lame, but works okay. If I had the motivation, I would probably opt for a wall mount.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Great Conference Room TV",
      "text": "We've bought 5 of these for our basic conference rooms and larger offices. The best feature is the wireless display connectivity to a mobile device. Easy to connect and great screen quality when viewing presentations.",
      "rating": 5.0,
      "verified": true,
      "author": "John Elledge",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "LG SUCK",
      "text": "TV was a dud!!! Tried to speak with LG but they were terrible luckily Amazon support much better and let me return it. Won’t be buying any more LG products in the future",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Fabulous picture",
      "text": "It’s the biggest screen we’ve ever had. It’s brought my family great delight.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Rodgville",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Great tv",
      "text": "Works awesome. Good size for a large room! Looks good mounted on the wall!",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac Newton ",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Screen died after 3 days. Recieved replacement today",
      "text": "Screen died after 3 days. Replacement sent immediately. Picture quality of the new on already looks better. Will review the new one through its review link.",
      "rating": 1.0,
      "verified": true,
      "author": "don shengle",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Not as good tv as described",
      "text": "Not as well as described hard to e installing had to hire an adjuster",
      "rating": 2.0,
      "verified": true,
      "author": "boaziz",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Easy install. Beautiful picture.",
      "text": "I replaced the 40\" in my livingroom with the 49\". This picture is awsome! The apps are so easy to get to.",
      "rating": 4.0,
      "verified": true,
      "author": "BARBARA",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "2nd LG we've purchased",
      "text": "These tv's have beautiful color.. Like the brand better than any other tv we have ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Urban",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Quality product @ good price",
      "text": "My second LG TV.....good quality product at a very competitive price point.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Love it",
      "text": "Tv is absolutely amazing. Love the picture quality. Came double boxed but it protected it from being broken in anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladii Jae",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Lg",
      "text": "This was for my son, so I'm just passing on opinions heard from him. He loves this tv, but it was to replace a broken one just out of warranty. Also an LG",
      "rating": 5.0,
      "verified": true,
      "author": "Andy V",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Great product tv",
      "text": "Tv for bedroom - nice price for the size. Includes the Amazon app. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey M",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Amazing",
      "text": "Received this TV yesterday. It is amazing. I have been using a hd 1080p tv but the LG set blows it away. It's like being outside and seeing things in their natural color and clarity. I also have an Xbox one x and the games now are amazing. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "SmokeyKolegrove",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Quality",
      "text": "My son is enjoying the TV. Her likes the apps that came with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Alba",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Legs are set very wide. Be sure your table is large enough if using one. Mine was not",
      "text": "Good picture. Easy to set up and use smart tv functions.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Claussen",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "We are very happy with this TV",
      "text": "We are very happy with this TV. Just set it up yesterday 08/03/18 so haven't had much time to use it much. the set up was very easy with on screen guidance and the color and picture clarity superb. connecting the DVD and other services like Netflex Amazon was easy. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack D",
      "helpful_votes": 4,
      "publication_date": 20180804
    },
    {
      "title": "A ok set.",
      "text": "Get the 2018 model like I did. This one had light bleeding",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick Dillon",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "great tv",
      "text": "Really like the TV. Great picture. Easy to setup and to adjust the Picture. Love it!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Guess",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Great picture!",
      "text": "I wanted a larger screen and a smarter tv. This LG met all my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "martha o.",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Good TV but Dark",
      "text": "The overall picture is sharp but somewhat dark. I have tried adjusting every setting, but still just does not seem bright enough. Otherwise good tv.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Horrible WiFi Connection",
      "text": "The wifi connection on the tv is horrible and it keeps disconnecting. Save yourself the money and get a better tv",
      "rating": 1.0,
      "verified": true,
      "author": "Huigtu",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Great TV!",
      "text": "This is my first smart tv it is excellent great picture easy to set up and a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Returned, NOT Alexa compatible",
      "text": "Bought this off Amazon prime specifically BECAUSE it was advertised as working with Alexa. It does NOT. neither Amazon nor LG customer support could or WOULD even begin to help at all.",
      "rating": 1.0,
      "verified": true,
      "author": "skydyverjym",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "4K UHD",
      "text": "Very bright. Good energy consumption. Lower price. Excellent screen size.",
      "rating": 5.0,
      "verified": true,
      "author": "Rui",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Chose this one because of Alexa feature and simply does not work!",
      "text": "I am very annoyed, just wanted to get home and turn on the TV without the remote, apparently it is impoossible!",
      "rating": 1.0,
      "verified": true,
      "author": "Marcia",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Great picture and functionality",
      "text": "Great tv love the picture and all the other functions. A major upgrade from my past tv, love how advanced this tv is",
      "rating": 5.0,
      "verified": true,
      "author": "kdub951",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Good TV for the price",
      "text": "The stand is not ideal, but the picture quality is good. Getting the screen settings just right is a little tricky.",
      "rating": 4.0,
      "verified": true,
      "author": "DAVE C.",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Do not buy",
      "text": "Do not buy from day one it had issues. It is still under warranty but LG USA and LG westafrica keep tossing. The screen has gone bad in exactly 2 months",
      "rating": 1.0,
      "verified": true,
      "author": "Chijioke Mokogwu",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Unique",
      "text": "My remote control is damaged, is there a app I can use.",
      "rating": 5.0,
      "verified": true,
      "author": "Naurel Fearon",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "TV broke after a month.",
      "text": "The TV worked for a month and the screen went blank. Had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Love it",
      "text": "Beautiful tv and easy to use. So many great features and the quality is fantastic!",
      "rating": 4.0,
      "verified": true,
      "author": "Kayla ray",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great TV with Bluetooth!",
      "text": "Love this TV!! I was specifically looking for a TV that had Bluetooth so I could listen with my headphones. Very few TVs have Bluetooth. This one does and it works perfectly for me as I am a night owl.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Gunderson",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Product quality for a decent price.",
      "text": "Great T.V. at a great price. Fast delivery from vendor. Quality picture, I'm happy with my purchase. And it's just in time for March Madness.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim R.",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "good for the price",
      "text": "Good TV for 14yrs old now with his own room.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Gibbs Jr",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Five Stars",
      "text": "Great TV and mounted easily to the mount I ordered. Smart features are a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant Udell",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "A top notch smart TV.",
      "text": "Affordable price and prompt shipping was most appreciated. Everything works well. I'm very satisfied with the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "David E Hagler",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Does not have 4 HDMI inputs",
      "text": "Does NOT have 4 HDMI inputs as it says in the product description. It has 2.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick K",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Poor quality",
      "text": "Had this for one year. The volume stopped working. Not impressed.",
      "rating": 2.0,
      "verified": true,
      "author": "Sherry Mallory",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Quality product for its price!",
      "text": "It works great, was easy to install, and hasn't given me any problems yet",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Renninger",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Cool tv damaged product",
      "text": "Product damaged contacted seller lets see what happens right side black shadow is the damage u cant really see in pic but can see better in person",
      "rating": 5.0,
      "verified": true,
      "author": "jeffrey",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Very easy to set up the Smart Features!",
      "text": "Great picture quality and a super receiver for over the air broadcast TV!",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Marland",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "good tv",
      "text": "good picture,good price,ease of use. only dislike -supports seem flimsy",
      "rating": 4.0,
      "verified": true,
      "author": "crow",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Damaged upon Arrival",
      "text": "I waited over a week to open this until my cable was set up, only to open the box to this. Extremely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Ted D.",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Great buy for the price!",
      "text": "Met expectations, only little complaint is that wi-fi direct connectivity can be a bit finicky.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul M.",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Fast, Great Sound, Great Picture Quality",
      "text": "I am loving it for last 1 year. It's Awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anil Yadav",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "LG 49UK6300 49inch Smart TV",
      "text": "So far so good. Easy set up including the easy on screen programming. Picture and sound is wonderful. The shipping packaging was really excellent. TV arrived on time and in perfect condition. The price was also a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Rich",
      "helpful_votes": 2,
      "publication_date": 20180719
    },
    {
      "title": "Great moderately priced tv!",
      "text": "No complaintes, great to for the price. Easy set up!",
      "rating": 4.0,
      "verified": true,
      "author": "laurie",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Tv works great no damage or complaints",
      "text": "Everything I expected. Tv works great no damage or complaints. Great job.",
      "rating": 5.0,
      "verified": true,
      "author": "johntucker",
      "helpful_votes": 6,
      "publication_date": 20180610
    },
    {
      "title": "Confusing set up.  Don't use the verbal setup assist!!!",
      "text": "Great picture but setting up was bi\\ of a challenge. . I used the verbal assist while setting up which was awful. She sounded like a robot on steroids. Spoke 3 times faster than a normal human. Reminded me of those radio commercials where some legal stuff must be disclosed. where the announcer speaks fast at the end of the commercial. Awful! I finally figured out how to shut her up. I do wish that a manual had been included. The TV does so much but I will probably miss a lot. The least they can do is put a link to a PDF manual",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20180707
    }
  ],
  "product_meta": {
    "title": "LG Electronics 49UK6300PUE 49-Inch 4K Ultra HD Smart LED TV (2018 Model)",
    "description": "The UK6300 is crafted with a slim, seamless body that’s ideal for any room aesthetic. This new LG UHD TV with AI (Artificial Intelligence) ThinQ becomes the hub for the smart home: Using Intelligent Voice control, speak into the LG Magic Remote* to pull up family photos, control light settings, check the weather and more. The UK6300 uses a powerful quad core processor that minimizes video noise, enhances sharpness and assures accurate colors for a remarkably lifelike 4K picture. This LG 4K TV supports multiple formats of HDR content, including HDR10 and HLG, both optimized with scene by scene picture adjustment.\n\n*Service limited to certain languages. Some features require 3rd party service subscription. Requires LG Magic Remote, sold separately.",
    "rating": 4.3,
    "feature_bullets": [
      "Dimensions (Wx H x D): TV without stand 43.7\" x 25.6\" x 3.2\", TV with stand: 43.7\" x 27.8\" x 9.3\"",
      "LG UHD TVs with AI (Artificial Intelligence) ThinQ become the hub for your connected smart devices. Beyond apps and entertainment, LG AI TV uses intelligent voice control to create a hub for the smart home and beyond",
      "The multi format 4K high dynamic range support includes HDR10 and HLG, both with LG’s advanced tone mapping technology that provides scene by scene optimization",
      "The IPS technology in LG TV uses in plane switching to deliver rich colors and a strong contrast Ratio that remain Consistent at wide viewing angles",
      "Inputs: 3 HDMI, 2 USB, 1 RF, 1 Composite in shared with component, 1 Ethernet, 1 Optical and Audio Return Channel Support via HDMI.Bluetooth:4.2",
      "Refresh Rate - TruMotion 120 (Native 60Hz); Wi-Fi Built In: Yes (802.11ac)"
    ],
    "specifications": {
      "Brand Name": "LG",
      "Item Weight": "24.9 pounds",
      "Product Dimensions": "9.3 x 43.7 x 27.8 inches",
      "Item model number": "49UK6300PUE",
      "Batteries": "2 AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "Brown",
      "Specification Met": "",
      "ASIN": "B079V3HQ4Y",
      "Customer Reviews": "4.3 out of 5 stars275 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#54,412 in Electronics",
      "Date First Available": "February 13, 2018"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "LED & LCD TVs",
      "Televisions"
    ],
    "price": ""
  }
}