{
  "website_summaries": [
    {
      "verdict": "A simple-to-use phone with a very loud, adjustable ringer; great for people with hearing problems or who like classic phone style.",
      "pros": [
        "Single-line telephone",
        "9-foot cord",
        "Loud, double-gong ringer with volume control",
        "Works with hearing aids",
        "Works without electricity",
        "Compatible with caller ID and answering machines",
        "Large, easy-to-read numbers"
      ],
      "cons": [
        "No call waiting"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hangs up cleanly, sound is excellent",
      "text": "This phone is old school, but really does the job. My 96 year old father was not hanging up calls properly sometimes on his cordless phone, making him unreachable for hours. We needed a phone that would be pretty foolproof when it came to hanging it up. It has satisfied that requirement very well. As a bonus, the handset, although an old style, works much better than the typical cordless phone. The earcup is large and covers the ear nicely, and with the volume adjustment, really improves my Dad's ability to hear. The microphone is closer to his mouth, making his speech clearer to the other party. We are very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart K",
      "helpful_votes": 32,
      "publication_date": 20190106
    },
    {
      "title": "Very good phone.",
      "text": "I delivered this phone to an elderly friend today. She is very hard of hearing. We turned the volume up on the receiver to loud. She wears a hearing aid but still had trouble hearing on a regular phone. She could hear every word on this phone. Her eyes lite up and she was so happy to be able to hear on the phone. I would definitely recommend this phone for some one who is hard of hearing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Turner",
      "helpful_votes": 24,
      "publication_date": 20180627
    },
    {
      "title": "DIDN'T WORK!",
      "text": "I was so excited to receive this \"old-timey\" phone for my 97-year-old mother. I took it to the installation appointment of Comcast. THE PHONE DIDN'T WORK! It would receive a call but not dial out. I'm out the cost of the phone and the installation fee! So darn irritating!",
      "rating": 1.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 16,
      "publication_date": 20180729
    },
    {
      "title": "Phone with Phantom ringer!",
      "text": "Name: Clive Romig Email: salty505@hotmail.com Message: Need technical support on a desk top telephone purchased from Amazon. The ringer bell is almost impossible to hear. Have adjusted the 2 position switch on the bottom of the phone . Only 2 sounds very low and low. Need help. Have contacted numerous people and so far no solutions offered. If I don’t get an honest concerned answer by 8/19/19 will request a refund so can return this lemon phone with it’s “Mickey Mouse” ringer.",
      "rating": 1.0,
      "verified": true,
      "author": "Salty505 ",
      "helpful_votes": 9,
      "publication_date": 20190812
    },
    {
      "title": "Great for hearing impaired!",
      "text": "My mother needed a new phone next to her chair. She wanted something simple. This phone fit the bill. She is 82 years old and had trouble hearing anyone on a modern handset. She loves this phone because she can hear everyone so much better. I think it's due to the way the speaker cups around her ear.",
      "rating": 5.0,
      "verified": true,
      "author": "McShorty",
      "helpful_votes": 7,
      "publication_date": 20190105
    },
    {
      "title": "Nice volume control",
      "text": "Needed phones for an uncle that needed a traditional phone rather than the cordless type. He is a senior that has a hard time seeing the buttons to hang a cordless phone up and would actually be hitting the start call button. When attempting to call him, the phone would almost always be of the hook and we would have to go to check on him as the phone wouldn't be hung up. He has a hard time hearing and the volume control on the handset was a blessing and the phone is now always hung up. I always liked the wheeled volume control for finer volume control but this works great as the wheeled controls are no longer available.",
      "rating": 4.0,
      "verified": true,
      "author": "William Matschulat",
      "helpful_votes": 3,
      "publication_date": 20181229
    },
    {
      "title": "Phone",
      "text": "Easy to dial ,easy to hear, and good loud ring. Looks good also",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A. Phillips",
      "helpful_votes": 7,
      "publication_date": 20180521
    },
    {
      "title": "WHY Ship Out A Phone That Doesn't Work?",
      "text": "I am beginning to wonder if there is any concern for quality left in the Market. WHY Ship Out A Phone That Doesn't Work? This phone has you hearing yourself twice as loud as the person speaking to you, with a reverb in your ear. I returned it for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "KIF",
      "helpful_votes": 4,
      "publication_date": 20190529
    },
    {
      "title": "EXACTLY WHAT I WANTED!",
      "text": "EXACTLY WHAT I WANTED. Beautiful color , sturdy, has clarity of sound. As usual I am THRILLED with my Amazon purchase. This phone has a bit of the vintage style. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Suz",
      "helpful_votes": 4,
      "publication_date": 20180524
    },
    {
      "title": "overpriced",
      "text": "this is nothing more than an overpriced hotel phone from the early 90s. ringer is no louder than a $10 phone from walmart. i bought this for my grandmother hoping itll be louder than a standard phone since she has a hard time hearing. definitely not worth the money if youre hoping for it to have a loud ringer.",
      "rating": 2.0,
      "verified": true,
      "author": "stupickles",
      "helpful_votes": 2,
      "publication_date": 20181016
    },
    {
      "title": "RINGER DOESN'T WORK!!!",
      "text": "I love the phone style was excited. everything on this phone works excellent EXCEPT THE RINGER!!!! the phone does not ringer at all! got two thinking the first was just a defect, but the second one didn't work either! SO DISAPPOINTED! and you can't even let home intuition know you have to go through amazon which really sucks cause I don't like going to the middle man, although amazon did refund me. not happy about this",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Serves me well",
      "text": "I am glad to find your phone. The handset serves well, no more complaints from callers that they can't hear me. Most modern phones require you to hold the device in an exact position. As an added bonus, I like the ring. I used to work on a high pressure environment and phone calls still set me on edge. This phone's ring is different and does not remind me of past stress. Thanks.",
      "rating": 4.0,
      "verified": true,
      "author": "Otterhawk",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Perfect phone for the elderly.",
      "text": "Bought this phone for my 87 year old mother in law who s in a nursing home with dementia. Phones are so complicated and frustrating for her. This phone is just like the phones she remembers using when she was younger. She can finally pick up the phone and answer when we call her.",
      "rating": 5.0,
      "verified": true,
      "author": "jryan856",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Bought this for my older Mom",
      "text": "So far it is perfect! It looks JUST LIKE her old dial phone, color and all, and she is very pleased. We checked the ring and she could her it in the kitchen when on loud-perfect! The 9' cord is so helpful and it is light weight but solid. Thanks So Much from us both :-) Cyndy",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Lee Black",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Wonderful! I can hear!",
      "text": "Wonderful. Can hear perfectly! It is a solid phone. Perfect for an elderly person.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Price",
      "helpful_votes": 3,
      "publication_date": 20180726
    },
    {
      "title": "FOR THE HEARING IMPAIRED, THIS IS THE ONE TO GET",
      "text": "I TRIED SEVERAL PHONES BEFORE FINDING REPLACEMENTS OF THE SAME BRAND THAT I HAD FOR YEARS. THE RING ON THIS PHONE IS OF A LOWER DECIBEL WHEREAS MOST OFFERED HAVE A HIGH PITCH THAT I DO NOT HEAR. THE SELLER ANSWERED ALL MY QUESTIONS BEFORE I PURCHASED IT AND AM REALLY HAPPY I DID. WOULD BUY AGAIN.",
      "rating": 4.0,
      "verified": true,
      "author": "SMILES",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Easy for Elderly Parent to Use",
      "text": "My Mom is 95 and suffers from dementia. I wanted a phone that addresses her hearing problems, but is simple to use. Her previous phone, she had to press special buttons to \"Send\" (talk?) or \"End\", and the sound amplifier was too complicated for her to understand. This phone is identical to the home phone she had for years. Just pick it up and talk, hang it up when done! Both the ringer and earpiece loudness are enough for her needs.",
      "rating": 5.0,
      "verified": true,
      "author": "William F Marting",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Finally, clear sound and ease of use!",
      "text": "I ordered this phone for a nearly blind senior citizen who has had endless problems with the sound on newer styles of phones. With this, the sound is crystal clear, and he appreciates the \"heft\" of the phone and how securely the handset cradles... which were also troublesome with newer phones. We miss the speakerphone, but all the good things outweigh that one loss. Thanks for making these \"good old phones\" available at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "E.T. Sim",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "A fine uncomplicated telephone.",
      "text": "A telephone for making and receiving telephone calls. Simple \"installation\"; just plug the handset to the body and the body to the wall! Nothing else to program or adjust! I bought this because I wanted telephonic connection even without electric power. I have a battery back-up on my cable to telephone modem.",
      "rating": 5.0,
      "verified": true,
      "author": "Corn Cob",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "incoming voice was not loud enough",
      "text": "the overall phone is good and the loudness of the ringer is good, but when you get a call in, the voice is not loud enough even bringing the volume up...i bought this phone for my mom who has hearing problems and wears hearing aids but she doesn't sleep with them so if anyone calls in the morning she doesn't hear the phone....she did hear the ringer on this phone but not the person speaking so unfortunately it did not do as described for my mom.",
      "rating": 3.0,
      "verified": true,
      "author": "cg gonzalez",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Good \"old school\" phone.",
      "text": "I bought this phone for my 71 year old mother-in-law to use in her apartment, because she was struggling to use both a flip style cell phone and a digital land line phone. This \"old school\" phone was simple to plug in to the phone jack and begin using immediately. It was a familiar style of phone from her past. It has been a life saver for staying connected with her. I highly recommend this for anybody who is \"new\" technology challenged.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Mom loves it!",
      "text": "My mom has trouble with the new digital land line phones. I can't tell you how happy she was to see this phone!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Calhoun",
      "helpful_votes": 3,
      "publication_date": 20180515
    },
    {
      "title": "Receiver switch did not function.  Returned",
      "text": "Did not work. The switch for the receiver would not work most of the time, so you could not make or answer a call. Returned to Amazon without any difficulty.",
      "rating": 1.0,
      "verified": true,
      "author": "PP",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Perfect for Parents",
      "text": "This corded phone is perfect for my parents. The phone unit is sturdy, so it stays in place. (Previous trimline phone they used was so light it easily fell off the stand.) The buttons are easy to see and use. No extra buttons or lights which can confuse. Volume is wonderful. My hearing impaired dad can hear it. Great basic telephone.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally V",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "For my Dad",
      "text": "I purchased this phone for my dad because he wears hearing aids and was having trouble understanding conversations on his old phone. It works great he can hear and understand what is being said with or without his hearing aids because you can adjust the volume on the handset, also with the extra loud ringer he can hear the phone ringing.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Hess",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Defective switch hook",
      "text": "The first phone was defective. The switch hook didn't work and you couldn't dusconnect a call by hanging up. I returned it. I looked at the reviews and saw most were very positive. I decided to order another one, hoping I wouldn't have the same problem. I received the replacement phone a couple days ago. The switch hook on this phone seems to be mechanically sound. This phone is for my mother, however, and I won't know if it works until I test it at her house.",
      "rating": 1.0,
      "verified": true,
      "author": "Diana Snodgrass",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Missing incoming calls",
      "text": "Phone does not ring loud enough. It is set on the highest loudness but it can’t be heard more than a few steps away. The information given says the ringer is extra loud. That is very misleading. No, I am not hard of hearing.",
      "rating": 1.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Not as advertised.",
      "text": "This phone was advertised as having voice amplification for the hard of hearing. It is a regular phone but even with the volume on high, it is little louder than any ordinary phone. Since this was ordered for an elderly hard of hearing person, it is very disappointing and not as advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Joan",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Buttons Too Small",
      "text": "The phone was for my 96 year old mother who is quite deaf. She did not ever use it, however, because the push buttons were too small. Therefore cannot provide a valid review. If you want to sell a phone for the deaf frail elderly may I suggest designing it with oversized large buttons.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Dale",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Convenient",
      "text": "I live in an area that has frequent power shut downs, therefore my cordless phone doesn't work and reception for my cell phone is spotty, at best. When this occurs I'm able to plug the Single Line phone into the land line plug and have a working phone in case of emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "dianthus",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Good phone at great price for hard of hearing",
      "text": "I bought this because I have moderate hearing loss and was having trouble hearing on my land line. The volume increase is \"on-off\" as opposed to variable, but the sound is loud enough to make me able to hear when talking on the telephone. The design is just like the \"old school\" AT&T phones of the 1970's. The only thing that is odd about this telephone is the ringer. It doesn't make a ringing sound. It's more like a soft buzzing or vibrating. There's only a sliding switch to increase the volume of the ringer. Otherwise, great product at a reasonable price.",
      "rating": 4.0,
      "verified": true,
      "author": "Gordon W",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Piece of Made in China CR*P!!!",
      "text": "This piece of junk was broke of itself inside the first 4 uses. If you want to throw away money at Amazon for the MADE IN CHINA garbage, then light up a cigarette or candle with a couple twenties for at least some enjoyable satisfaction. If you want a good phone, AT7T has professional grade cheaper and far better made stuff. Don't waste your money or time with this absolutely worthless purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian B.",
      "helpful_votes": 4,
      "publication_date": 20181011
    },
    {
      "title": "Ringer Didn't Work and Call Quality is Poor",
      "text": "I was quite surprised that this phone failed on every count. From the get-go the ringer didn't work. The sound on the receiving end was good, but NOT on my end. Very unclear. This one goes back.",
      "rating": 1.0,
      "verified": true,
      "author": "Roberto BTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "Total Garbage",
      "text": "I have never seen such poor quality in my life. Only one of the two buttons in the cradle worked. The other one was not connected to anything. Could call out but could not call in. I called a number that had a recording and when I hung up the phone you could still hear it.",
      "rating": 1.0,
      "verified": true,
      "author": "Don E.",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "May need set up for elders.",
      "text": "This phone comes with 2 line locations on the back of the phone and has a handset volume switch on the hand held receiver. After giving this phone to my Mom she called on her cordless and said she couldn't get it to work (she had the cord plugged in the data port), she then said it was too quiet and could hear the caller but didn't realize there's volume setting on the receiver, after changing the volume switch all was well.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Thompson",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Older people love it!",
      "text": "This phone was bought for my 92 year old father who is slightly hard of hearing. My father was having a hard time hearing on his cell phone and not staying connected to his family so I purchased this phone for him to use and now he can hear the people who call him and he loves that he has a handle with the earpiece and mouth piece on it. So much better. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "theresa p.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "I am able to hear this phone where I cannot hear my other phones.",
      "text": "Used this for home phone and love the amplified volume adjustment. I like this phone. MIstake I made was I should have gotten a speed dial phone but I can hear this phone and cannot hear on my previous phones. I would recommend for hard of hearing.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Charles",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Handset volume stopped working after 3 months",
      "text": "Purchased for my 84 year old father. The first one delivered was missing the cord from the handset to the base. The second one worked ok but only for 3 months. Don’t waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Melinda",
      "helpful_votes": 3,
      "publication_date": 20190127
    },
    {
      "title": "Ringer still NOT loud enough",
      "text": "Maybe I got a bad one, but the ringer is not even as loud as the standard desk phones were years ago, even with the \"loud\" switch on the bottom of the phone turned on. The earpiece volume is good. I had to add an inline enhanced ringer to get the volume loud enough",
      "rating": 3.0,
      "verified": true,
      "author": "weedz",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Perfect!! Exactly as described. A simple hardworking phone.",
      "text": "Absolutely perfect. My mom wanted a phone that was JUST A PHONE. This absolutely fits the bill!! She was SO HAPPY! It's simple, you can hear clearly, it works even when the power goes out (very important!) and rings loudly (adjustable). Thank you so much. This made my mom's day!",
      "rating": 5.0,
      "verified": true,
      "author": "LP",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Great phone",
      "text": "This is a great phone for my 83 year old mother who constantly had issues with the cordless phones she had in the home. I can finally call her and have a conversation without any problems or dropped calls.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul J. Bergman",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Ringer didn't work",
      "text": "The ringer didn't work at all. I tried the switch on the bottom of the phone that's supposed to adjust the ringer volume, but that didn't fix it. Definitely not worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Ragsdale",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Easy for my 93 year old mother to use",
      "text": "This phone is what my mother (93) was used to - she didn't have to push an off button after talking on the phone, she just hung up the receiver. We bought three phones for her and she does well with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "I'd buy it again.",
      "text": "Purchased for my father. He has a harder time hearing so when his phone died I thought I'd look for one with good volume control. This is the perfect one. Worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "NewEnglandMom",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Old school the best easy to go",
      "text": "I am so excited that I found this phone! The clarity is absolutely amazing... I plan on buying another one for my mother because she has a hard time hearing and this phone will definitely help her better with her phone calls... I do wish there was a Ringer off button but that's OK. I totally recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "East Coast Girl",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "A Real Phone",
      "text": "This phone is just what my father needed. No confusing bells and whistles. Clear sound that is great for him being hard of hearing. Nice to know that these are still available!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven E.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "phone",
      "text": "The phone came really fast which was good because we were down to one working phone. The ringer is still loud but not really a problem. My husband likes having a phone like his old one so he dosn't have to learn something new. Overall we are pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Roberta Jefferies",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great quality, great price!",
      "text": "My aunt, who is 96 years young, was forgetting to charge her cell phone and it was alarming to family members when we couldn’t reach her. She asked for a traditional phone line with a traditional phone. Nearby retail stores had shipping dates of 2-3 weeks so I looked on Amazon and found the exact phone with free overnight delivery. Good quality, quick to install and easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Just what she needed",
      "text": "I bought this for my 97 year old mother who was forever not placing the princes phone on the cradle properly. This phone will make that improbable.",
      "rating": 5.0,
      "verified": true,
      "author": "dlary9890",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Great Phone",
      "text": "I bought this phone for my elderly mother. It was easy to set up, I liked the color and most important, my mother loved it. There was nothing I disliked about this phone. It was just what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Sound",
      "text": "Bought this for my dad who has hard time with cordless phones and being able to hear. He said he can hear me clear and knows how to dial this one and hang up.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn  M Martin",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Good phone for elderly parent",
      "text": "My mom is in a memory care facility and has not been able to consistently use the cordless phones I have gotten for her. I tried to find the least complicated versions, but even having to push a button when picking up the phone was a problem. The corded, desktop phone that mimics the traditional button dial type that was the standard for decades works well, and it use is intuitive.",
      "rating": 4.0,
      "verified": true,
      "author": "majjg",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "This phone will not work with Ooma",
      "text": "This phone will not work with Ooma or the phone is bad. It would not ring on an incoming call. The Ooma worked with other phones, but not thin one.",
      "rating": 3.0,
      "verified": true,
      "author": "stevemc",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Not loud",
      "text": "My Mom is unable to hear this phone. While I can hear it, I do not find it to be loud at all.",
      "rating": 1.0,
      "verified": true,
      "author": "SGW",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Junk",
      "text": "This product is for display only. The mouthpiece does not pick up your voice no matter how loud you yell into it. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Avis Albritton",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Happy with choice",
      "text": "I have purchased more phones than I care to admit, trying to find one that would be useful for my mom. Finally found one! Easy for her to use and hear callers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "broke after 6 months of use",
      "text": "I bought this phone for my mother who lives in assisted living and has loss of hearing and has trouble seeing. After just 6 months when I phoned her, I could hear her ,but she could not hear me. I did like the feature of this phone that you did not have to press talk or end ,you simply pick it up and keep talking. However, I cant buy a new phone every 6 months.",
      "rating": 1.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Bought this for my 84 year old mother. She ...",
      "text": "Bought this for my 84 year old mother.She loves it. The ringer is loud and the ear piece is crystal clear. I can hear her very clearly too!",
      "rating": 5.0,
      "verified": true,
      "author": "DAT",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Okay",
      "text": "Like the volume control on the handset. But the phone doesn’t ring loud enough for my 95 year old father to hear.",
      "rating": 4.0,
      "verified": true,
      "author": "pamela whiteside wing",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "The perfect desk top phone.",
      "text": "We were very pleased to find a phone like this,we wanted a desk top phone and this one is perfect.,so for that , we thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer.  awesome reading a must for all.  awesome",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Very happy!",
      "text": "Bought this for my husband who is very hard of hearing. He can hear clearly on this phone. Would strongly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Poor Quality",
      "text": "I bought two of these phones for my restaurant. The second was for a backup. The first phone lasted two months. You could not hear the person calling in. I replaced it with the backup and the same thing happen after only two weeks! I wish I could find a quality built desk top phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 3,
      "publication_date": 20181211
    },
    {
      "title": "Can’t  always hear it ring",
      "text": "Bought for my 96 year mother who uses hearing aids. Old fashion type phone , easy to lift. Everything great but ...the tone of the Bell ringing is too high .She can’t hear it ring always , even on the highest setting.",
      "rating": 4.0,
      "verified": true,
      "author": "First time user",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Nothing Phoney here-great product!",
      "text": "Great product and greta company providing this equipment. It works great and packaging was superb. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Bearie",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Loud Ringer ?",
      "text": "No it does not have an extra loud ringer. That was why I bought it..and I am sorely disappointed..but I love the old style of it. Worth the money ? Not in my opinion. Would I recommend ? Not if you are looking for an extra loud ringer.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon Russell",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Very good loud ringer",
      "text": "We use xhordless phones where I work but it gets very loud and they are hard to hear ringing. This one is not. Dont actually talk on it but hooked it up next to cordless list for the loud ringer.",
      "rating": 5.0,
      "verified": true,
      "author": "sarah dunbar",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "very satisfied",
      "text": "Thia phone is perfect for my mom who is 85! She is hard of hearing and with this phone she had no trouble understanding what was being said. The phone has an old fashioned look and feel, so she felt familiar with it. I recommend this for anyone looking for a phone for elderly people, or just because they want something simple and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Schneps",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Bought this for a brother that is very hard of ...",
      "text": "Bought this for a brother that is very hard of hearing but refuses hearing aids. This will allow him to hear the phone and maybe have a decent conversation with him. Sure sounds much louder to me!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan M.",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "I returned this in error",
      "text": "This ringer was not loud enough so I returned it. Later I realized I had not turned up the volume. This is a great phone and I am returning the new phone they sent me. As always appreciate the serve from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "C. remus",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great phone. Easy to use and hear",
      "text": "Very easy to use. I bought this for my 84 year old aunt. The volume is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Jax777",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Easy To Use Old Time Phone",
      "text": "Love this phone. Easy to hang up correctly, and heavy enough to stay put. Amplifies so it's possible to hear the person calling.",
      "rating": 5.0,
      "verified": true,
      "author": "LMoon",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "If you are old, like me.  :)",
      "text": "I like a sturdy, old fashioned phone. It certainly is. Good volume control. Wish it would have had caller ID built in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "It works on voip as well",
      "text": "It's a phone I needed for an analogue modem for cardiac clinic calls, works great, albeit a tad old school, it goes with the clinic's technology",
      "rating": 5.0,
      "verified": true,
      "author": "T W PRZYBYLINSKI SR",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Just what I was looking for.",
      "text": "Bought this for my 98 year old mother who is very resistant to change. It is almost identical to the phone she has been using for the last 40 years with the exception of the volume control. It appears to help her hear a bit better!",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Simple and Easy to Use",
      "text": "We purchased this for my 86 year old mother in law who has become totally confused with modern phone technology. It is perfect for this situation. No confusing bells and whistles, just a sturdy, well made telephone with a loud ringer.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Murphy",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Could hear the person you called but they couldn't hear you",
      "text": "Useless. bought this for my Dad. Although we could hear the people on the other end, they could not hear us. Didn't return it - threw it in the trash. He died a week and a half later (before another phone he knew how to use arrived.)",
      "rating": 1.0,
      "verified": true,
      "author": "CCS",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Ringer problem with networked phone system",
      "text": "This phone is a very solid \"land line\" with clear sound and options to adjust ringer and volume. The problem we had was it has a \"bell ringer\" that does not activate within the networked phone system at my father's nursing facility. We ordered the same phone with an electronic ringer and hoping it will work.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Important during a power outage",
      "text": "Brought back a touch of our youth but, more importantly, kept us in touch with friends and family after we lost power following a recent hurricane. Definitely belongs in any home emergency kit.",
      "rating": 5.0,
      "verified": true,
      "author": "LKG Courtney",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Excellent phone",
      "text": "I am pleased with this phone. It looks nice and works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Russo",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "oldie but goodie",
      "text": "everyone needs one of these for when the power goes out",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Old phones are cool",
      "text": "Works perfectly as expected and like the old ringer sound",
      "rating": 4.0,
      "verified": true,
      "author": "Cmj2b",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Old and new",
      "text": "I like it replaced my mom's 30 year old ones",
      "rating": 5.0,
      "verified": true,
      "author": "VICTOR THOMAS",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Good Business Phone",
      "text": "We like the loudness! And it can’t be knocked off the table!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180615
    },
    {
      "title": "Good phone",
      "text": "All in all the phone is great. Not 5 stars because the face plate doesn't quite fit right. there is a small bulge that keeps it from fitting right. It does stay on,I just know that if I drop it will pop off.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Fast easy done",
      "text": "Just what my grandmother was looking for to replace a slimline phone she was having trouble using",
      "rating": 5.0,
      "verified": true,
      "author": "garret r gabriel",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Perfect for the older folks in your life who need a little extra volume",
      "text": "My folks are hard of hearing and with this phone you can adjust the volume to where they can hear clearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison C. Fowler",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Good solid telephone",
      "text": "It functions as a telephone and nothing more...... A great attribute in its simplicity. The ringer does the job. If this what you want then look no further, I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Lazenby",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Mom is happy with the phone",
      "text": "I ordered this for my mom. She has dementia, so anything complicated is beyond her. But she just needs to lift the receiver to answer and put it down when she’s done.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Disappointed",
      "text": "Ringer would not work, volume control would not work. I sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan Walter",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Ability to increase the volume.",
      "text": "Used while Aunt was in Nursing Home because using a normal phone she could not hear very well. This phone corrected that problem.",
      "rating": 5.0,
      "verified": true,
      "author": "patsy soper",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "A Good Old Fashioned Phone",
      "text": "This is an excellent phone. It doesn't have the amazing build quality of old Western Electric phones but that isn't a big drawback. Remember boys and girls, land lines work when the power fails and your cells and wireless phones are useless!",
      "rating": 4.0,
      "verified": true,
      "author": "Jon Harwood",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Loud phone",
      "text": "This was a gift for elderly relative and she liked it",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "A good old-fashion push button corded telephone",
      "text": "Just like the old days. The ability to modulate the ringer and volume is very nice feature. Extremely nice product and I enjoy using it. I am one to never give up my landline! Thanks for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "John Blackburn",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Not what i wanted.",
      "text": "Ringer was to weak to hear 10 feet away. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Frederick",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Phone ringer review",
      "text": "The phone is good in that you can plug in a voice mail unit into the back of it. The ringer is not extra loud. Actually it is softer than my cell phone. That was a feature I was looking forward to so I could hear the phone from another room in the house without a problem. That is not the case.",
      "rating": 3.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Not what expected",
      "text": "Couldn’t hear on it. Would have sent it back but too much work. Am not using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "No Ring",
      "text": "Would love the phone 100% if we could get it to ring.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri ptacek",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Does not work",
      "text": "The phone is defective: When you put down the receiver it does NOT disconnect.and keeps ringing. I don't have the enrergy to repackage it and send it back. It would be nice if you would send me anotherland land line telephone -- can be the cheapest one available.",
      "rating": 1.0,
      "verified": true,
      "author": "Meir Pachter",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "works good so far",
      "text": "I have a hearing problem and bought this phone so I can turn up the volume when certain people call me.....works good so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Marjo",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Get  back to a solid phone with a cord.",
      "text": "I was getting tired of cordless phones. I found this phone and immediately knew I had to have one. I now have order four of them for most of the rooms in the house. Great phone at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "James Winston Phillips, MD, MBA, JD, LLM",
      "helpful_votes": 0,
      "publication_date": 20200520
    }
  ],
  "product_meta": {
    "title": "Home Intuition Amplified Single Line Corded Desk Telephone with Extra Loud Ringer, Ash",
    "description": "The Home Intuition Single Line Corded Desk Phone is the perfect telephone for basic use. Also great to have as a backup for unexpected power outages. Works with just a phone line no power needed.",
    "rating": 4,
    "feature_bullets": [
      "Vintage old school retro style single line telephone with 9 foot cord",
      "Double-Gong Ringer with Volume Control",
      "Works with Hearing Aids",
      "Great as a Backup Phone for Power Outages",
      "Compatible with Answering Machines and Caller ID"
    ],
    "specifications": {
      "Product Dimensions": "9.25 x 7.25 x 4.75 inches",
      "Item Weight": "2.4 pounds",
      "ASIN": "B079JWJ2KJ",
      "Item model number": "CP08476",
      "Customer Reviews": "4.0 out of 5 stars319 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#14,787 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 2, 2018",
      "Manufacturer": "Home Intuition"
    },
    "categories": [
      "Office Products",
      "Telephones & Accessories",
      "Landline Phones",
      "Electronics",
      "Office Electronics"
    ],
    "price": 39.95
  }
}