{
  "website_summaries": [
    {
      "verdict": "A 4K TV of impressive size and audio-visual quality. Excellent theater-worthy picture and smart features.",
      "pros": [
        "This TV supports High Dynamic Range and delivers superb contrast and brightness with more colors, perfect for movie buffs and gamers",
        "Built-in intuitive Roku TV platform with voice search"
      ],
      "cons": [
        "Vertical banding screen issues have been reported by some owners"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "With superb picture quality that rivals TVs costing twice as much, TCL's 6 series is the best TV value we've ever reviewed.",
      "pros": [
        "The affordable TCL 6 series has excellent overall image quality, with deep black levels, very good brightness, rich contrast and accurate color",
        "Its Roku smart TV platform is the best available, with a simple interface and extensive streaming app support",
        "The TV handles both HDR10 and Dolby Vision high dynamic range sources"
      ],
      "cons": [
        "Brightness and video processing fall short of some more expensive TVs"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 9.0,
        "Performance": 8.0,
        "Value": 10.0
      },
      "publication_date": 20190629,
      "rating": 8.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Obvious defect",
      "text": "Vertical banding noted, like all the other reviews. Messaged TCL about it with no answer. Will return. Sucks because I was waiting for a while for this TV to come out. Sad day.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Hebert",
      "helpful_votes": 260,
      "publication_date": 20180515
    },
    {
      "title": "SDR Rendering Artifacts Even If You Get a Pristine Condition Panel",
      "text": "The unit has consistent rendering artifacts during mostly solid black imagery (Netflix, Amazon). The behavior exists only for SDR content, so I'm nearly certain it's a chipset/firmware problem. This unit has the latest firmware loaded on it. R617 has been out six months already, so I expect if TCL was going to fix this behavior, they'd have done it already. Yuck. I don't even know the proper term to describe this kind of rendering artifact, yet if anyone can offer insight as to if the behavior may be fixable I'd be immensely appreciative.",
      "rating": 1.0,
      "verified": true,
      "author": "Professor J Schlesser",
      "helpful_votes": 40,
      "publication_date": 20180901
    },
    {
      "title": "This Roku TCL TV is very low quality",
      "text": "I bought this TV set in June 2018 with a 4 years extended warranty and after a few months, now I have this horrible lines invaded all my screen. TCL, the manufacturer neither Square Trade accepts responsibility someone on Amazon can tell me what to do?",
      "rating": 1.0,
      "verified": true,
      "author": "Oscar W. Revilla",
      "helpful_votes": 25,
      "publication_date": 20181117
    },
    {
      "title": "Quality sucks!",
      "text": "So I bought this t.v. and was very disappointed. The picture had a dirty screen effect and banding issues which made the edges of the tv black which is very distracting. I figured that perhaps I got a bad one and asked for a replacement due to the picture quality being so poor. Well,I got the 2nd one and while it wasn’t as bad as the first one it still had dark edges. This tv costs too much money for the edges in the television to be black.",
      "rating": 1.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 22,
      "publication_date": 20180911
    },
    {
      "title": "Yet another vertical banding / dirty screen effect unit",
      "text": "Add me to the list of many others here that has the terrible vertical banding and dirty screen effect. If you are considering this TV, read the 1 to 3-star reviews, as many of the 3-star reviews also have this problem (not sure why they bother ranking it so high). Watching anything that has a light background or lots of panning (think sports) and this problem is incredibly distracting. I don't care how good the HDR is if you have crappy backlighting you have a bad TV. Trust me, spend a few more $100 dollars and move up to a better TV.",
      "rating": 1.0,
      "verified": true,
      "author": "mw",
      "helpful_votes": 43,
      "publication_date": 20180708
    },
    {
      "title": "DON’T ORDER",
      "text": "Took a day off work to stay home and wait for UPS in order to sign. This was mine and my kids big splurge after a REALLY tough year. Finally get legs on it and get it up on the stand... both kids so excited. Plug it in and it’s busted. No idea how we will get it back in the box and shipped back. And amazon is out of stock. SO, I wasted Cyber Monday deals on a busted tv that I can’t even replace. I should have listened to the other reviews and gone with a local store. As a single mom, this was a HUGE mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "Keisha Shelton",
      "helpful_votes": 15,
      "publication_date": 20181130
    },
    {
      "title": "Plum Pitiful",
      "text": "It didn't work right out of the box... screen would go on/off and TCL Support couldn't get it working either. Can't give less than 1 star but if the product doesn't work when you get it there should be a ZERO. The box had been treated poorly also... like it came from China on a donkey. It gets great reviews though... maybe I got a lemon. Will try one more.",
      "rating": 1.0,
      "verified": true,
      "author": "Robo",
      "helpful_votes": 14,
      "publication_date": 20181116
    },
    {
      "title": "Corrected false statements in other reviews:",
      "text": "What you need to know that was incorrect in other reviews: VESA Compatible 100% -- what a joker earlier.... even provides two sets of screws Motion blur is from the SOURCE MATERIAL-- NOT THIS DISPLAY AMAZING DISPLAY WELL PACKAGED... SNAPPY OS WELL ORGANIZED OS ARC WORKS FINE IF YOU KNOW WHAT YOU'RE DOING. BOOM!",
      "rating": 5.0,
      "verified": true,
      "author": "joMamma",
      "helpful_votes": 11,
      "publication_date": 20190609
    },
    {
      "title": "Significant black banding issues",
      "text": "Like some of the other reviewers, our TV had significant vertical dark bands in the middle of the screen, which were obvious any time the image panned over a light-colored, solid background. Super obnoxious in things like surf or ski movies. We exchanged it once, but the second TV had significant issues as well. Not pleased.",
      "rating": 1.0,
      "verified": true,
      "author": "Anne-Marie Schwarz",
      "helpful_votes": 12,
      "publication_date": 20180925
    },
    {
      "title": "Garbage",
      "text": "I read the reviews before purchasing this model and was really looking forward to getting it hooked up. The first one I ordered lasted less than a week before the picture crapped out on me. I had a replacement in 3 days and AGAIN experienced the same issue after less than a week of use. I'm not going to give it a third chance.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott D. Lent",
      "helpful_votes": 17,
      "publication_date": 20180903
    },
    {
      "title": "Broken on arrival, be cautious.",
      "text": "Received the tv box was obviously treated roughly in transit. Large holes, dents, and gouges covered the box. I opened the box to a TV that looks like a very large spider had made a home on it. The TV was needless to say very dead. The packing materials just don’t seem to be enough to survive a rough transit. I would be cautious buying large electronics like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20181014
    },
    {
      "title": "Guess I lost the panel lottery",
      "text": "Decided to upgrade my TV. After a glowing review on CNet, I decided to go with this model. I was aware that banding is an issue, but decided to roll the dice in the hopes that I would get a decent panel. As can be seen in the photo, I certainly lost the panel lottery. It is very noticeable in lighter and darker scenes. The audio is also pretty crap. It will randomly get pretty low then really loud. You'll definitely want to get a sound bar with this tv. Banding aside, picture quality is actually pretty decent.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20180913
    },
    {
      "title": "The Vertical Banding is real.  And that's sad.",
      "text": "The Vertical Banding is real. And that's sad. Because everything else was sweet gravy. But back she goes. :-( At least Amazon's return policy is awesome when your gear is not.",
      "rating": 1.0,
      "verified": true,
      "author": "MD",
      "helpful_votes": 18,
      "publication_date": 20180713
    },
    {
      "title": "Horrible TV save your money",
      "text": "My TCL has a bug behind the screen that has killed 20 pixels in the middle of the screen. You guys want to replace my brand new tv with refurbished and tell me that I’m lucky you are even doing that. What kind of customer service is that ? This whole process has taken over a week now with 0 results. I was excited to buy this tv but it just goes to show you should never cheap out and buy a premium “budget” tv",
      "rating": 1.0,
      "verified": true,
      "author": "Mike244",
      "helpful_votes": 8,
      "publication_date": 20190301
    },
    {
      "title": "Cheap screen prone to breaking",
      "text": "I’ve had r617 on the wall for less than 10 weeks and there appears to be a scratch or crack in the screen. The screen feels like a soft plastic that is prone to breaking or scratching. I’ve never let go of a tv in less than a decade. My tv, a top of the line Panasonic plasma, was in perfect condition when I replaced it after 12 years. This one is already due to be returned or replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam ",
      "helpful_votes": 8,
      "publication_date": 20181030
    },
    {
      "title": "Great TV!",
      "text": "This is the biggest bang for your buck. This tv has all the features I need and at a great price. I understand that people are getting defective products like I did last year with TCL P6, so I was worried how this one was going to turn out. Amazon gives you like month to return it (better than bestbuy 14day). For me, this tv turned out great and I prefer gaming on it than on my LG C17 OLED. P.S. cable/satellite always sucks on 4K displays.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerardo Chavez",
      "helpful_votes": 8,
      "publication_date": 20180531
    },
    {
      "title": "Why didn't i buy this sooner?",
      "text": "I don't write reviews very often, but had to stop and let everyone know. Don't pass up this TV if you are in the market. I have watched several fast action movies and I just can't stop saying.. \"Look at that picture!\" I am just an average Joe TV watcher and this TV is perfect!. Only thing i would change is the mounting feet. You need to have a very wide and long TV stand. I may look into a center base in a few weeks. So, stop delaying and put this TV into your cart!",
      "rating": 4.0,
      "verified": true,
      "author": "J J.",
      "helpful_votes": 6,
      "publication_date": 20190416
    },
    {
      "title": "Vertical Banding",
      "text": "Based on the fact that this TV is rated at 4/5 stars I decided to risk the vertical banding issue. This was a mistake. The vertical banding apparently exists on every one of these TVs and is noticeable when watching sports. I now have to deal with the hassle of returning this enormous TV. Learn from my mistake and AVOID THIS PRODUCT. I've done my part in trying to lower the score.",
      "rating": 1.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 7,
      "publication_date": 20190530
    },
    {
      "title": "Could have been a great TV but seemingly nonexistent QC makes this a dud.",
      "text": "Like many others the first one I recieved had a busted panel though the shipping materials were not damaged at all. I sent it back for a replacement which I am now returning for a refund. Everything you've read about the picture on this is true, it looks amazing. However, this thing has the worst uniformity I have ever seen and the vertical bands are so dark I can see them on almost all content. I should tell you that I am not the picky type when it comes to TV's and I could not bare watching an entire movie on this thing.",
      "rating": 1.0,
      "verified": true,
      "author": "shanetd1113",
      "helpful_votes": 9,
      "publication_date": 20180729
    },
    {
      "title": "Do Not Buy: Vertical Banding Issue is \"Expected Behavior\"",
      "text": "This issue is, sadly, well documented within the reviews, and I wish I had listened. I called up TCL Support about a year after buying this TV to explain that, when watching hockey, baseball, or even HGTV, this issue of having subtle vertical bands -- which are especially distracting with fast motion (think sports) -- is very noticeable and distracting. I was told that the series 6 TCL TVs are backlit, and that, therefore, this is expected behavior. Basically, I feel like I wasted my money on this TV and wish that I had spent more on either a Samsung or LG. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "ELJ",
      "helpful_votes": 5,
      "publication_date": 20190528
    },
    {
      "title": "LED panel issue overshadows otherwise great TV",
      "text": "UPDATE: Recieved 2nd TV and it was worst than the first so lowering my review to one star. Going to they one more and then move on to another brand. Lost the panel lottery. Screen has significant dark spots that result in dirty screen effect. Roku TV is great feature. Other features and tech are pretty great but defective panel overshadows an otherwise really good tv. Getting a replacement and hope it's better but not holding my breath based on other reviews. I see other people are on their 3rd tv. TCL really needs to address this issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam Cohen",
      "helpful_votes": 6,
      "publication_date": 20190615
    },
    {
      "title": "TCL 65R617 dead after 13 months, TCL won't fix it",
      "text": "This TCL 65R617 I bought June 2018 just died. It won't turn on anymore. I called TCL support and they instructed me on several reset procedures but nothing work. TCL says they could not help me because it is out of warranty. Devices are not suppose breakdown 1 month after warranty expires especially for a TV with a replacement cycle of more than 10 years. Be warned, do not buy TCL products.",
      "rating": 1.0,
      "verified": true,
      "author": "Jun T.",
      "helpful_votes": 7,
      "publication_date": 20190706
    },
    {
      "title": "Don’t purchase TCL products!",
      "text": "Had the TV for 3 weeks and the backlight went out. Unfortunately I didn’t read other reviews on TCL products before purchasing, it seems their products are riddled with issues. CNET gave the TV its highest marks which is why I purchased it but now I really question CNET’s reputation. It took a month for my original TV to be delivered and now it’s going to nearly another month before a replacement is delivered. Very frustrating and disappointing. Amazon customer service has been great to deal with but unfortunately the product itself is junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Gregg Rothenberger",
      "helpful_votes": 6,
      "publication_date": 20190828
    },
    {
      "title": "Vertical banding not totally resolved",
      "text": "I was hoping that the vertical banding issues would have been resolved by now, but I'm seeing banding across a few areas of the screen when its displaying white (lower right quadrant and upper left quadrant). There is also some noticeable vignetting at the corners. The dirty screen effect and vertical banding are most noticeable while playing video games, although in some panning shots of TV shows it is noticeable too. Definitely a letdown. I would have bought a Vizio. The TV otherwise feels premium. The motion and colors are very nice. I'm a let down by this quality issue though.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 3,
      "publication_date": 20190709
    },
    {
      "title": "Bad LED panel. Buy with caution",
      "text": "Horrible display quality. LED banding/blooming on anything other then dark colors. Horrific grey scale uniformity and just nasty “dirty display effect.” I would not recommend until quality control is actively checking every single display. No more display lottery.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Kaiser",
      "helpful_votes": 46,
      "publication_date": 20180515
    },
    {
      "title": "Nine months. Great picture quality. Just died and no customer service.",
      "text": "Without any physical touching of the screen and hooked up to a TIVO, it now will only show the power button flashing. Tried to do a reset as manual recommends, and the flimsy rubber part for the reset button just dropped out. So I tried calling TCL - each time I got the recording telling me that the wait time was over 60 minutes thanks to their wonderful promotions. I'll update this if I get more results from TCL.",
      "rating": 3.0,
      "verified": true,
      "author": "Some Body",
      "helpful_votes": 7,
      "publication_date": 20190419
    },
    {
      "title": "This thing is a piece of junk",
      "text": "Happy with it at first, but after just a a month Netflix and prime both quit working. Had to uninstall and reinstall both of them to resolve the issue. We’ll see how long that lasts. And now six weeks in, the “enhanced remote” is on its third set of batteries. Had to delete Netflix and amazon again. Apparently this will be a monthly thing. Have to to delete netflix on a weekly basis now when freezes up. This thing is a piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon machula",
      "helpful_votes": 5,
      "publication_date": 20190301
    },
    {
      "title": "Will never purchase TCL again. Unreliable and poor service.",
      "text": "After a few months the TV started powering off by itself. TCL replaced a part and issued a software update that seemed to make it better for a while. Now that it's just over a year old it's happening multiple times per day, and TCL has said they will not repair it under warranty even though the issue appeared well within the 1 year warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt L Willems",
      "helpful_votes": 5,
      "publication_date": 20191121
    },
    {
      "title": "Vertical Banding... With my Original and Two Replacements",
      "text": "My TV starting showing vertical bands within the first year. (seems longer than most people lasted). TCL sent a replacement with WORSE banding. TCL then sent a replacement with just bad banding. I'm not sure whether I will try a 4th or just get a different brand TV. Also the remote sometimes doesn't work and needs to be reset/re-paired, but who cares compared to the banding problem. I don't write many reviews but felt compelled to on this occasion. Unfortunately I made this purchase before enough time had past to see what this TV was like. Your money is better spent elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Shane Murphy",
      "helpful_votes": 4,
      "publication_date": 20190909
    },
    {
      "title": "Dont buy this TV if you watch sports or fast action movies",
      "text": "the picture is very good when viewing a still image, and slower moving video. When watching sports its horrible. Amazon's return policy is equally bad. They force you to use there designated carrier, Pilot Freight. Pilot has had the TV for a week, even though they are only taking it 3 hours away, and Amazon still hasn't returned the money saying they will not until it arrives, which is expected to be 10 days. I have already purchased another TV and did not use Amazon. Fair warning.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary Hayes",
      "helpful_votes": 5,
      "publication_date": 20191004
    },
    {
      "title": "Great colors and true HDR. Huge improvement over the 75C807",
      "text": "I upgraded to this, 75R617 from a 75C807. I will say that for half the price of what my 75C807 cost in 2017 TCL has come a long way in a short amount of time. Pros compared with the previous model this one has: True HDR with localized dimming. Something the previous model did not support. Far more vivid and accurate color reproduction. Brighter panel in general without washing out the colors. No vertical banding. This is something that seriously bothered me about the previous model. Cons compared to the previous model: No audio jack on the remote. Still only 3 HDMI ports. Still requires settings workaround to get HDR to work on game consoles.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Glenn",
      "helpful_votes": 2,
      "publication_date": 20191106
    },
    {
      "title": "75” TCL screen dies after 15 days.",
      "text": "Ordered January 2nd, 2020. After 20 hours of total use, the TV died on January 17th. A replacement is coming tomorrow. The screen turn on as if the back light panel fails. Only very dim lighting appears from the edges of screen...the rest is dark despite the LED and audio showing it’s turning on and off. I have read countless replies from others experiencing the same issues on reviews from here and other retailers. TCL does nothing but ask you to perform basic factory resets. I’m hoping the replacement will yield positive results. I’ve owned 5 TCL TVs, and this 75” 6 series might be my last.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg Barnes",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "I LOVE TCL TV's! The picture quality, the built in Roku, they're great value for money!",
      "text": "I bought this to replace a 2017 55\" TCL smart TV which I really love (it's now up in my bedroom and this one is in the lounge). I am not at all disappointed. The picture quality is fantastic for the price (yes, OLED for 3x the cost is better). The built in Roku system is great; smooth and fast and all the \"channels\" I want. The wifi works great, it's great for gaming. Sound quality, like most TV's is so-so, but I use a sound bar so I don't mind. Would buy this again in a heartbeat, and when the time comes to upgrade next time, I'll definitely be looking at TCLs again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Evans",
      "helpful_votes": 2,
      "publication_date": 20191213
    },
    {
      "title": "TCL 65R617.. GREAT PICTURE AND VALUE!",
      "text": "Excellent picture, easy to use Roku operating system, fantastic value, factory settings we're almost ideal. I've had the set for a month and I'm more than satisfied. Haven't seen any of the ghosting or picture lines that some reviewers noticed. Only issue involved remote unable to turn on TV twice after being off. I called customer support (easy to contact) and they said to try turning on set manually using on-off button on lower right of screen. That worked and diced the problem. No further issues at all. The factory sound/speakers are only adequate, but after connecting to my 5.1 surround AV receiver using optical cable, sound is outstanding. Highly recommend this system. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Deal Pilgrim",
      "helpful_votes": 2,
      "publication_date": 20180904
    },
    {
      "title": "Regretting this purchase",
      "text": "I am really hating this tv. Since day 1, this tv turns itself off. I thought it was a simple update issue. Nahhh. Nothing is causing this issue outside of it's own faulty hardware, maybe an overheating issue, but I had this tv for ablut 6 months and this problem has not been resolved. I am now regretting this purchase and wish I had went with an alternatve maker.",
      "rating": 1.0,
      "verified": true,
      "author": "MICHAEL R.",
      "helpful_votes": 5,
      "publication_date": 20190313
    },
    {
      "title": "Love it",
      "text": "I was really hesitant about this TV because of all of the \"dirty screen\" things I've read about. I did a test on youtube and sure enough I can see it a little bit. But I've never noticed it in day to day use. I have a few nitpicks--the headphone jack on it disables the internal speakers, which means I can't use it to hook the TV into my whole house system. And the TV speakers face down/back so they sound reflected, because they are. I will likely get a sound bar because of this. Still, I'm very pleased for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "greenpad",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "Dirty Screen Effect",
      "text": "I, like many others, had the vertical banding issue. I will be returning and buying from a new company because this is my second go around with TCL.",
      "rating": 2.0,
      "verified": true,
      "author": "Jon Britton",
      "helpful_votes": 6,
      "publication_date": 20190113
    },
    {
      "title": "Poor Quality Control = Dead Pixels",
      "text": "Poor Quality Control like everyone said. My 75\" came with dead pixels, which is unfortunate because I'm dreading the whole process of returning or possibly exchanging.",
      "rating": 1.0,
      "verified": true,
      "author": "Erwin G.",
      "helpful_votes": 5,
      "publication_date": 20190907
    },
    {
      "title": "Thin Green Line",
      "text": "After one week of use, a thin green vertical line appeared on screen in all modes. It's too late to send back to Amazon because I didn't unpack and hook it up for a couple of months. I contacted TCL and I did a factory reset to no effect, and they said they will send a replacement soon. So we'll see if it's a good one this time. Otherwise, I like the TV and streaming apps, but the quality issue remains as a concern.",
      "rating": 1.0,
      "verified": true,
      "author": "M. White",
      "helpful_votes": 4,
      "publication_date": 20190207
    },
    {
      "title": "It is big!",
      "text": "It is easy to set up, but takes some time. It is also heavy, so you need someone to help unpackage it and move it around. I have only used it for a couple of hours, but enjoy the bright detail and color. I have not monkeyed with the settings yet but realize there may be some room for improvement. Some colors appear a bit over saturated depending on the particular program I am watching, but mostly it is very good. I like the fact that there is a phone app to use, as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Solarsailor",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Picture quality horrible unless you watch it straight on",
      "text": "Picture is only decent if you sit directly in front of the middle of the screen. Color fades as you move to either side. Tried multiple times to work with Technical Support. Nothing worked. Returned TV as \"defective\" for a full refund. We then went to Best Buy to look for another TV, and the same model TCL was on display. The picture quality was exactly the same - looks horrible from off-center.",
      "rating": 1.0,
      "verified": true,
      "author": "Efrain M. Padro",
      "helpful_votes": 4,
      "publication_date": 20190818
    },
    {
      "title": "Poor picture quality",
      "text": "The picture quality of the tv had numerous problems. I immediately noticed all four corners were really dark. When I did some tests with different videos/background, I noticed that there was a solid discolored line almost in the exact middle of the TV running from top to bottom. When I put a pure white background on the screen, I noticed what others have referred to as it looking \"dirty\", like really smudgey and not even colored. Really disappointed with the TV and will be looking at more mainstream brands when I purchase after I return this.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam C",
      "helpful_votes": 4,
      "publication_date": 20190216
    },
    {
      "title": "Best Bang for the Buck!",
      "text": "I bought the 55' TCL 617 because of the good reviews it received from Amazon, YouTube and Rtings.com. I was concerned with the reported grayscale issues with the TV so I waited till the end of July to purchase mine. I'm sooo glad I did, The picture is absolutely GREAT! I can only see the a muddiness around the outer edges of the TV when the screen is completely white (during commercials) but that's forgiven by the BLACK this TV produces. I used Rting,com's recommendations for obtaining the best picture quality and I can say this TV is a steal at $650. The sound is mediocre, so I bought the Visio soundbar and subwoofer SB3621N-E8 which sounds Great!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyrax7",
      "helpful_votes": 3,
      "publication_date": 20180915
    },
    {
      "title": "good for price.",
      "text": "No bad vertical banding like a lot of the other reviews. corner of screen the picture is a little darker but hard to notice. picture does look great. watched alot of the marvel shows on neflix that are dolby vision and looks amazing.blacks are about as dark as you can get without spending 3k on a OLED. tv screen does show some of the glare from you windows or anything to bright.",
      "rating": 4.0,
      "verified": true,
      "author": "daniel",
      "helpful_votes": 4,
      "publication_date": 20180710
    },
    {
      "title": "Not for me, not worth the dice roll to get a good panel",
      "text": "I lost the panel lottery. This TV is on all the reputable review lists as one of, if not the best value 4K 65” tv under $1000. What they don’t tell you, is the lack of quality control for screen quality. Mine arrived with random shadows that would change every time the tv was powered on. A good example is in the bottom right of the photo I uploaded. That is not an external shadow. That is coming from the tv itself. And that’s not including the silhouette and vignetting at each corner and the overall lack of luster on the screen. It appears “dirty” with light colored content.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 3,
      "publication_date": 20190725
    },
    {
      "title": "Great TV for the price",
      "text": "I just upgraded after 10 years from a sony but this is a great starter point for 4k. I have only the slightest dirty screen I think I kinda lucked out on that. But all and all its easy to use, setup and looks great. I got it for 499. but durning superbowl time you could get the 65 inch for 499 wish I would have got that but still wow. wont knock a star off but I hate roku remotes they are easy af to lose or slid right down the sofa hell I could see a larger dog just gulping one. wish they had like a upgrade for that lol",
      "rating": 5.0,
      "verified": true,
      "author": "Gamer",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "Amazing picture and sweet price!",
      "text": "I spent a ton of time researching before making a decision to get a 75-inch display and couldn't be happier with this TCL. The price point ($1,399 for me in October 2019) was hands down the best deal out there. I ended up relying on CNET for their comprehensive reviews and they were dead on. The picture quality is top notch, having gone from a 60-inch Samsung 4k (series 6 non-QLED from 2016) to the TCL, and the difference is remarkable. No issues and no banding as some have reported after a month of use. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "JD in the PNW",
      "helpful_votes": 2,
      "publication_date": 20191119
    },
    {
      "title": "Spectacular Value",
      "text": "This TV is replacing my 2017 LG OLED. The OLED became unwatchable with horrible red pixel death after 6500 hrs. I purchased this TCL as my family’s “workhorse” TV and I am very happy with my decision. The picture is very good and MUCH BRIGHTER than the OLED. Amazon delivery was perfect and the box was pristine. The Roku interface is simple and clean. My family and I are so happy with this TV and it’s 1/3 the price of the OLED!",
      "rating": 5.0,
      "verified": true,
      "author": "Michigan Man in his 40s",
      "helpful_votes": 5,
      "publication_date": 20190525
    },
    {
      "title": "Buyer beware",
      "text": "Firmware updates destroy functionality. Screen had odd bright spots all over from the start. Remote only responds 1/5 of the time and replacements do the same. Complete buyers remorse after owning this trash. I'll never support this company again and will do all I can to turn others away.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter G. Sawtelle Jr.",
      "helpful_votes": 5,
      "publication_date": 20190525
    },
    {
      "title": "Horrible Television!  Read the reviews and don't take a chance.",
      "text": "We bought this TV based on CNET's recommendation like so many others. We actually loved the TV for the first year, but now that it's been 13 months, the thing has turned almost unwatchable. The splotching and vertical banding are just ridiculous. See our photograph, and you'll see what I mean. TCL should be ashamed. A $1000 TV should last more than a year. Going to call them tomorrow, not expecting much help.",
      "rating": 1.0,
      "verified": true,
      "author": "ScottieMac",
      "helpful_votes": 3,
      "publication_date": 20191209
    },
    {
      "title": "Amazing TV for the Price",
      "text": "The TCL 65\" 6 series TV is amazing. It's everything the raters at CNET and other websites say it is. The picture is absolutely incredible and I love the ROKU feature, it is so easy to use. I've read many positive and some negative reviews regarding this TV and cannot think of a negative thing to say. I highly recommend to anyone that is looking for a great TV under $1000.",
      "rating": 5.0,
      "verified": true,
      "author": "J. C. Reed",
      "helpful_votes": 3,
      "publication_date": 20190204
    },
    {
      "title": "Dirty screen. Warranty not great.",
      "text": "Amazing picture quality, but my screen had several dead pixels in a cluster near the center of my tv screen. Contacted TCL, sent pictures/clips, and said they only see ONE dead pixel and won't do anything about it. Horrible warranty... Luckily it's not too noticeable, but the customer service is definitely lacking...",
      "rating": 2.0,
      "verified": true,
      "author": "Calvin",
      "helpful_votes": 4,
      "publication_date": 20190621
    },
    {
      "title": "Wonderful TV for the price, absolutely happy!",
      "text": "I have been using this TV since it released and have absolutely loved it! The picture quality is fantastic and the Roku platform is very smooth. Update 2018/08/08: I've hooked up a sound bar to the TV and one word of advice. Check your HDMI Cable! I was frustrated with the TV at first because it wasn't recognizing the sound bar fully (I could sometimes control the volume and turn it off, but no sound was being produced), but my issue was the HDMI Cable I used that was SUPPOSED to be compatible with ARC and CEC. Swapping the cable for another one and it worked right away!",
      "rating": 5.0,
      "verified": true,
      "author": "David P.",
      "helpful_votes": 3,
      "publication_date": 20180525
    },
    {
      "title": "Poor Quality Control",
      "text": "Like many others, I received a subpar panel. One corner was noticeably dimmer than others, the backlighting was very uneven throughout, and some parts of the panel looked \"dirty\" (vertical banding). Very unfortunate.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan C",
      "helpful_votes": 4,
      "publication_date": 20190703
    },
    {
      "title": "Great TV",
      "text": "Perhaps I got lucky but banding is very minimal on my set, barely noticeable in a grey screen test and doesn't show at all in normal usage. The vignetting in the corners is pretty noticeable though. Black levels are great, and I'm coming from a plasma so I was expecting to be disappointed. HDR looks awesome. Default settings are a little over-saturated for my taste. The Roku OS is a pleasure to use. All in all very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "WTFrak",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Terrible",
      "text": "Horrible experience. Arrived with missing screws for stand and NO POWER CORD! Amazon customer support was great, they sent me a power cord right away. But the the horrible experience continued - I plugged it in and the TV DID NOT TURN ON! Confirmed it was getting power because it was making sounds and LED lights were flashing but the screen was completely blacked-out. Amazon support to the rescue again - they are sending me a replacement. Hope the second one works.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank J. Mihail",
      "helpful_votes": 5,
      "publication_date": 20181208
    },
    {
      "title": "Great picture, low price",
      "text": "Great picture, low price, integrated ROKU, single remote, allows me to cut the cord, has an OTA tuner.... What's not to love...",
      "rating": 5.0,
      "verified": true,
      "author": "jeff galway",
      "helpful_votes": 6,
      "publication_date": 20180526
    },
    {
      "title": "Backlight banding",
      "text": "My TV has horrible banding on the screen. TCL support told me this is normal and I have to deal with it. This is a television with a poor quality picture. That's the only thing it has to do and it does it poorly. If you buy this TV and experience picture problems, return it immediately. Don't make the same mistake I did and try to deal with tcl support.",
      "rating": 1.0,
      "verified": true,
      "author": "twowheeler",
      "helpful_votes": 4,
      "publication_date": 20190706
    },
    {
      "title": "Disappointed Customer",
      "text": "This TV has had issues since I bought it. I am not happy with the TV or the TCL customer service. Because I inadvertently damaged the serial number on the back of the TV, TCL would not honor my year warranty on this flawed TV set. Since the beginning, the TV has stopped mid-program and the screen goes black and then snow. Turning the TV off and on again will temporarily fix the problem, but it re-occurs frequently. I am probably going to have to buy a new TV, but it will NOT be a TCL.",
      "rating": 1.0,
      "verified": true,
      "author": "George Ball",
      "helpful_votes": 3,
      "publication_date": 20200422
    },
    {
      "title": "Incredible Value for Performance",
      "text": "Very happy with the television although we’ve had it for only a few days. The packaging was a little worse for wear but all components were accounted for and undamaged. The television itself is very attractive with the slim design and brushed gunmetal bezels. Picture quality is fantastic. This is our first 4K tv, but after streaming some 4K programming there’s no complaints. Very bright and vivid colors with deep blacks. Setup is a breeze and the Roku interface is so easy our kids have no problem finding Netflix. Very good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Landon Satterly",
      "helpful_votes": 3,
      "publication_date": 20180509
    },
    {
      "title": "At best a fair product.",
      "text": "Can’t get youtube. Can’t get the CNBC app though the channel is in my cable package. Roku is as “wonderful and smart” as my 6yo Samsung. So you get a big...exceptionally heavy (hard to find a stand for the weight....once you can find the weight posted anywhere) monitor with a built in dongle and a remote with no numbers so changing channels is an unnecessary hassle. The picture is not noticeably different from my old TV.",
      "rating": 2.0,
      "verified": true,
      "author": "Munrow",
      "helpful_votes": 2,
      "publication_date": 20190802
    },
    {
      "title": "Speech not in sync with picture",
      "text": "The picture, speech especially, is not in “sync” with the sound. You hear the voice after you “see” the spoken word. Unacceptiable. Manufacturer is of no help. Web resources do not help. Don’t buy it if this bothers you.",
      "rating": 1.0,
      "verified": true,
      "author": "S. J. Bomba",
      "helpful_votes": 5,
      "publication_date": 20190228
    },
    {
      "title": "Best 4k TV for the money, but has some issues",
      "text": "Overall this is a pretty good TV, but for the price it's an excellent TV. Yes it does suffer from dirty screen effect and some vertical banding but those are only noticable when panning on white and very light scenes, hockey games are especially bad fyi. I have stopped noticing it although I'm sure if I watched more hockey it would really bother me. However the colors and black levels are amazing, so all the 4k content I've watched so far has looked really good. The Roku OS and remote are also great IMO. If you want a better TV you'll have to spend double what this one cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "Awful.",
      "text": "We tried 3 of these. Each one had obvious banding and what looked to be goop or something stuck between the filter and the screen. No matter what scene they were always there. Unacceptable. I didn't really care too much about PQ because this was a bedroom TV but dark scene's look like garbage compared to my OLED in my theater room. TCL is cheap for a reason. The reviews are wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 3,
      "publication_date": 20190629
    },
    {
      "title": "Best bang for your buck!",
      "text": "This tv exceeded all expectations, especially for the price. I have also had \"value\" tv's that were light on some of the more advanced picture settings, but the 120 local zone dimming really makes a huge difference in the quality of the black levels on this tv. The tv also looks very nice in the living room. There is a high quality brushed metal frame that has a premium look. I haven't had any issues, and no banding on my set. Don't think twice about spending more, or getting a lessor tv, go with the 6 series from TCL.",
      "rating": 5.0,
      "verified": true,
      "author": "SevenLink",
      "helpful_votes": 2,
      "publication_date": 20190609
    },
    {
      "title": "Nice for the Price",
      "text": "I replaced a 2005 or 2006 Pioneer in my LR because I wanted a Roku Smart TV. The expensive Pioneer has the best picture I've ever seen so while I don't like that it's non-smart and 150lb+, I couldn't part with it and relocated it to my BR. If I didn't have the Pioneer experience, I might not have thought the video quality was lacking and it's good enough. I like everything else about the TCL better. I have it hooked into a receiver and home theatre system with external speakers so can't vouch for the internal speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "JulzGaye",
      "helpful_votes": 2,
      "publication_date": 20181120
    },
    {
      "title": "Panel problems at 8 months",
      "text": "After 8 months of use, suddenly there is a bright horizontal line of pixels and a faint vertical line as well. The TV was not even physically touched. Because my TV has been used over 6 months, warranty will only replace with a refurbished TV, and that TV will only have a warranty of 90 days, which is shorter than my original warranty should have lasted. The replacement should carry the same warranty. Why spend $1000 to use. TV for 8 months...? I will not be buying from TCL again.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 4,
      "publication_date": 20190509
    },
    {
      "title": "Amazing picture but Banding issues(mine have disappeared)",
      "text": "A lot of the reviews mention the vertical banding, mine was no different. But you can always return it and play the panel lottery. I did notice it when I got the tv. But after a few months of owning it I don’t know if I’m just used to it or if it evened out because I honestly don’t see it anymore. It used to always catch my eye but it has disappeared as of lately. The picture quality is absolutely amazing though. That’s why I kept it. The local dimming really works and improves movie and tv watching always much! The gaming mode is perfect too. It completely eliminates the input lag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190625
    },
    {
      "title": "Good overall; need to monkey with the settings to optimize",
      "text": "Bright scenes in vivid mode are shockingly realistic. 4k is ridiculous good! Tales a while to get used to, kind of makes movies look like soaps. Blacks and dark scenes I have found to be so-so at best. Recent GOT looked horrible during the fight with the night walkers in movie mode. Switched to normal mode for the much brighter Bells episode and it looked great. Maybe I just havent found the best settings for darks yet. For the price, I'm very happy after 1 month. First TCL purchase, so will see how it holds up. I love the roku interface and remote, which was the real reason I chose this TV in the first place.",
      "rating": 4.0,
      "verified": true,
      "author": "LElliott",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Good image but does have banding",
      "text": "Bought this TV with knowing about the banding issues. The product was unavailable for a couple weeks and I was hoping TCL was fixing some of their manufacturing or quality control issues. When it was for sale again I quickly bought one. Image out of the box is amazing. Really can not ask for anything more for how cheap the TV is. However I do notice the banding issue with some scenes. Its not enough where I am upset and want a refund, however it is easily noticeable in some scenes.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Hobby",
      "helpful_votes": 3,
      "publication_date": 20190102
    },
    {
      "title": "Would be great if the remote didn't continually lose pairing",
      "text": "I'm having some issues with the TV. The primary issue that the remote loses its pairing daily. Once that happens, you have to take the batteries out, turn the tv off, turn the tv back on, replace the batteries, etc. If this happened once every 6 months, it wouldn't be a big deal, but it happens frequently. There are also HDMI ARC issues with how it communicates with an AVR. That issue can be mitigated slightly by turning things on in a certain order, but honestly, watching TV shouldn't be like the Apollo 13 mission every time.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt Heatley",
      "helpful_votes": 3,
      "publication_date": 20180905
    },
    {
      "title": "Great TV and great customer service",
      "text": "I'll start off with saying I did have the vertical banding on my first TV but Amazon customer service was amazing and fast to send me a replacement. I was very happy to see that there was no vertical banding on the new replacement and the TV looks great! I'm using CNETs recommended picture settings for dark room and I'm very impressed with the black levels and pop of the picture. So very great experience and happy with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Gossage",
      "helpful_votes": 9,
      "publication_date": 20180519
    },
    {
      "title": "Beautiful TV, Great Price",
      "text": "I've had this for a few weeks now, and I'm thrilled with the purchase. The Roku interface is fantastic, and I have not had any of the \"banding\" issues other reviewers have noticed. My only complaint (and it's nitpicky for sure) is that the remote has designated buttons for certain apps (e.g., Netflix, Sling). This is all well and good, but it's not great when someone sits on the remote and you get immediately taken out of what you're watching and thrown into an entirely different app. But if you're disciplined enough to leave your remote on the table (obviously, I am not), I can't see a reason not to grab this TV.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Worth the money",
      "text": "Great value for the money. I can't turn it off like I used to do with my Chromecast on my Vizio and Samsung but I can turn it on using my Google Home. It doesn't have a Spotify app available but that's not a major issue to me. I love the OS and it is very easy to use and customize. Fast startup is also nice and it has great picture quality and nice blacks. Definitely recommend getting a sound bar though.",
      "rating": 4.0,
      "verified": true,
      "author": "William Gardner",
      "helpful_votes": 3,
      "publication_date": 20180525
    },
    {
      "title": "Amazing picture",
      "text": "The picture quality on this TV is so amazing I actually got nauseous from motion sickness while watching a movie. Movies and sports look like they are 3D. I am impressed. You'll need to buy a sound bar. The speakers are not great. Roku offers speakers now. I haven't hooked them up yet so I can't comment, but you'll need something for better sound. But who cares. Speakers and sound bars are inexpensive and easy to use. The picture is astounding and not just for this price point.",
      "rating": 5.0,
      "verified": true,
      "author": "ETG",
      "helpful_votes": 2,
      "publication_date": 20181125
    },
    {
      "title": "Broke after 3 months. No picture and no TCL support. Wish I had bought another product.",
      "text": "Thanks to my fellow reviewers I bought the 75 inch TCL. It was easy to setup and I was surprised at the sound. I was expecting to hook speakers up to it. After mounting it on the wall we just started watching and forgot all about adding external sound. It's that good. Being a musician I only like quality sound. Don't get me wrong it's not professional grade like my music studio. However I'm not fussing with other gear when I sit down to watch tv. Highly recommended and for the price it's a win win.",
      "rating": 1.0,
      "verified": true,
      "author": "Brain ForAreason",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "No vertical banding, just a whole lot of cracks.",
      "text": "Was hesitant to order due to the negative reviews but took the plunge anyway. I was so excited when it arrived however we noticed that the box had holes on the side (back part of the TV, not screen side) so I’m like, maybe it’s okay since the screen side was protected. NOPE. The screen was cracked so bad. So, I guess no vertical banding to worry about, just a whole lot of cracks. Had to return immediately. I received it last week and returned the following day. I am still waiting for the refund. Edit: Finally got the refund",
      "rating": 2.0,
      "verified": true,
      "author": "Ci",
      "helpful_votes": 3,
      "publication_date": 20181127
    },
    {
      "title": "TV shuts off randomly, all the time. No fix available.",
      "text": "This tv looks great and sounds great/fine. I love Roku and I love TV's. The problem with my TV is that is randomly shuts off all of the time. In any app I'm watching, it will shut off. There is no fix and support hasn't been able to help. 1 star because it doesn't function properly as a TV.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff Stark",
      "helpful_votes": 4,
      "publication_date": 20181029
    },
    {
      "title": "Good Price, but Buyer Beware",
      "text": "The specs of the TV are great, and the tech in it is fine. But the back lighting has serious consistency issues, that the manufacturer is aware of and does not hold under warranty. They consider \"significant levels of banding, normal and not showing any defect\". which means they are aware that the banding is an issue and arent going to help you at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 3,
      "publication_date": 20190614
    },
    {
      "title": "Excellent TV",
      "text": "I’m very pleased with this TV, the picture is outstanding it’s as if you are looking through a window while watching the movie or show. During the setup it give you the option to set up different programs; Netflix, HBO now...etc, I found it easier to just set it up afterword. Set up was pretty easy and adjustments to picture and sound were easily adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Musselman",
      "helpful_votes": 4,
      "publication_date": 20190610
    },
    {
      "title": "Arrive damaged",
      "text": "I wish that I had the chance to see the tv works as it arrived damage aside from the blue red light on the screen I guess it was worth the wait for the return I’ll stay with the knowing brands for now",
      "rating": 1.0,
      "verified": true,
      "author": "orlando",
      "helpful_votes": 3,
      "publication_date": 20190628
    },
    {
      "title": "Bad vertical banding",
      "text": "I took a chance and the vertical banding is way too bad to watch. Not worth the low price. Unwatchable",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 5,
      "publication_date": 20181019
    },
    {
      "title": "Unbelievable picture for the price",
      "text": "I’ve had this TV for about 3 months now and I couldn’t be happier with it. I had a 4K Vizio that started getting dark zones, so I figured I’d upgrade to something a little bigger that wouldn’t break the bank. The difference in picture quality between this and my Vizio is ridiculous. The blacks are pitch black and the colors really pop. My parents have a $3k+ Samsung TV they recently purchased and this thing looks much better. The source does matter though, I’ve found the quality is much better when watching Netflix through my Xbox instead of the native app. Can’t speak to durability since it’s only been a few months, but it feels solid.",
      "rating": 5.0,
      "verified": true,
      "author": "austin",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Mandatory online account after software update.",
      "text": "I updated the tv, and now it is completely useless without creating an account with them. Can not use hdmi in until you login, give your personal info and credit card (which they promise they won’t ever use. Hard to trust when this is suddenly mandatory) I’ll probably cave and make the account but this is ridiculous, and I would never buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "SuperDesk",
      "helpful_votes": 2,
      "publication_date": 20190915
    },
    {
      "title": "Amazing tv for the price",
      "text": "I was a little worried after reading some reviews but I jumped in and do not regret. The picture is amazing. I’m not a huge fan of Roku but it’s not the worst and it’s growing on me a little. I wish it came with the remote with programable buttons. I bought 75in because... go big. 75in is way bigger in your living room than Sams Club. I am completely satisfied. My wife is not.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeramy ",
      "helpful_votes": 3,
      "publication_date": 20191024
    },
    {
      "title": "Don't buy this tv",
      "text": "This tv is absolutely terrible it stopped working after 3 days and just had a green screen. Amazon and TCL Customer service were terrible. It took 10 calls to have Amazon arrange a pick up for a defected tv. Not to mention you need to supply either the box it came in or for those who don't like to hold on large boxes purchase one to send it back for a refund. There is also a 5 hour pick up window for weekdays only. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "jj2349",
      "helpful_votes": 4,
      "publication_date": 20181130
    },
    {
      "title": "WOW! Just WOW!",
      "text": "I’ve had this TV now for almost 3 months. All I can say is: WOW! Stunning Picture and Vibrant Colors. Love watching certain shows in HDR or Dolby Vision. I’ve always own Vizio TV’s in the past (last one was a 60” M Series) but always hated their limited OS. Love the Roku interface built into this TV. Very smooth and the ability to add countless channels (unlike Vizio). Ability to change picture quality through Expert Settings on the Roku App on your phone is awesome. So happy I got this TCL and didn’t waste more money on a lesser quality picture. No issues whatsoever as others have noted in negative rewiews . Fantastic picture and TV!",
      "rating": 5.0,
      "verified": true,
      "author": "The Digital Guy",
      "helpful_votes": 2,
      "publication_date": 20180823
    },
    {
      "title": "Great Value, great performance, all the hdmi connections you need",
      "text": "I was looking at online reviews and this came up as a great buy. Awesome product, great picture. All the Hdmi connections you need including the ARC. Doesn't have the latest eARC though. It took several tries to connect to the wifi. Arrived in an extra box from The shipper so no worries about getting damaged during shipping. I'd buy this again as it compares to TV features, picture quality of TVs twice the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Awesome picture; small crack ruined 2 inch by 1 inch area at screen bottom",
      "text": "Awesome picture that's better than a movie theater. However, there was a small crack that ruined a 2 inch by 1 inch area at screen bottom. Also, delivery instructions said 2 men would help set it up. There was only one man, and he gave a 2-man excuse when I said he was supposed to help me setup it.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Atkinson",
      "helpful_votes": 3,
      "publication_date": 20190113
    },
    {
      "title": "AMAZING PICTURE",
      "text": "Remote sometimes does not turn on the tv, and sometimes does not move left or right even when pointing it at various points at the tv. I had a Panasonic plasma tv, my kid threw something at it and it broke the screen so I had to buy this tv. I did my research but I didn't think it could match it. I was wrong, this tv is way better! wanting to control the tv with my Comcast remote as I did with my Panasonic, I can't, it just does not work. Just received a new dvr from Comcast, remote now works with tv. I’m real happy with this set.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Anglada",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Wow. Incredible picture. Just incredible.",
      "text": "I was a little nervous reading about some of the early quality control issues with this model but TCL seems to have figured that out. I’ve had the tv for 2 months now and it’s a ridiculously good tv with crystal clear 4K and the truest black levels I’ve ever experienced. The kids love gaming on it, the size is great for split screen play. The Roku tv works great and we ditched the cable box. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "So far, so good",
      "text": "Seems to be a great tv. I was a bit worried after reading some of the other reviews about the banding, but when I ran a solid color test, I didn't have any issues. The remote leaves a bit to be desired. The voice search function is especially limited. Also, having the mute button on the side is kind of annoying. I tend to hit it accidentally. However, the tv itself is great. All the services load really quickly. The sound is decent, but I have hooked up to my home stereo system now.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 2,
      "publication_date": 20190505
    },
    {
      "title": "Great TV !",
      "text": "I am furnishing 4 beach condos and purchased 12 of the TCL 55R617 televisions based on reviews I read in CNet and Wired magazines. I am very happy with the picture quality and sound on these TVs. I purchased all of them from Amazon and all arrived in good condition even though a couple of the boxes looked a little beat up. I also purchased 3 of the 65\" version. Happy customer even with delivery being later than I was told.",
      "rating": 5.0,
      "verified": true,
      "author": "Barney",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Awesome TV!",
      "text": "I bought the 65\" Sony X900F and 55\" LG C8 Oled but returned them both to Best Buy. I am not sure if it was the tv or something else, but the picture quality was not good enough! Then I got this 55\" TCL, and it's the best! I don't know how it beat the other TVs. I have a small apartment, so I didn't notice anything bad about the angle or sound. Actually, it even looks good from an angle. I had this TV for one and a half months.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake K.",
      "helpful_votes": 3,
      "publication_date": 20190107
    },
    {
      "title": "Love it.",
      "text": "Installed it yesterday and have found no issues. Did a white test for banding and found none. My testing showed everything works fine. Gave sound quality three stars because all TVs with rear-facing speakers sound awful. I immediately hooked up to my SONOS Playbar. I bought the 617 model for voice control but the remote uses RF to control the TV. Unfortunately the Playbar requires an IR remote for volume control. Minor issue. Delivery company did a good job. Bottom line is I highly recommend this TV and am very satisfied with the whole experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Great picture quality, poor quality control.",
      "text": "Incredible picture quality for the money. The corners have a slight dimness but considering the price, I can overlook it. The back of the tv was scratched up—I assume from shipping or perhaps from the factory. But because I’m wall mounting, it didn’t matter to me and wasn’t worth the hassle of returning. If it weren’t for the scratches, I would have given five stars for the picture quality for price ratio.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan K",
      "helpful_votes": 2,
      "publication_date": 20181122
    },
    {
      "title": "The best TV under 100$",
      "text": "To be 100% transparent this review is of the second TV I have as the first TV was returned because of issues. Online reviews often say this is the best value TV under 1000$ and I wholeheartedly agree. The color accuracy and clarity is far and away better than other TVs at the same price point.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh King",
      "helpful_votes": 2,
      "publication_date": 20190213
    },
    {
      "title": "Great TV for the price",
      "text": "Amazing 4K HDR TV for the price! The only issues I had with the tv (which I can live with for the price) was that reds seemed to be too much sometimes and the advanced settings in the tv could only do so much to make it right. Luckily since this is a Roku TV you can download the Roku app and fine tune the colors from there. Very happy with this tv!",
      "rating": 4.0,
      "verified": true,
      "author": "shaun bailey",
      "helpful_votes": 3,
      "publication_date": 20190629
    },
    {
      "title": "Stunning",
      "text": "I was a little bit concerned about the “panel lottery” but I got a good one. This tv is absolutely amazing. I had an old Vizio 1080p and replaced it with this. Popped in a 4K ultra hd blue ray and my mind was blown!!! It’s the best looking TV I’ve ever seen inside a real home. Xbox one x games look awesome too. I’m over the moon. What a fantastic tv at an amazing price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "guy",
      "helpful_votes": 3,
      "publication_date": 20180928
    },
    {
      "title": "Vertical Banding Issues",
      "text": "From the first day I got this TV I had the vertical Banding issue others have mentioned. The entire right hand side of the screen had 6 vertical bands that were very noticable with any light colored background. I contacted TCL support and they were very professional trying to help with the issue but eventually told me to return the TV back to Amazon. I am going to try the 65\" to see if it has the same issue. This TV does have a beautiful picture even in a brightly lit room. I just couldn't get past seeing the row of bands with every show I watched.",
      "rating": 3.0,
      "verified": true,
      "author": "JTFC6",
      "helpful_votes": 2,
      "publication_date": 20190617
    }
  ],
  "product_meta": {
    "title": "TCL 65R617 - 65-Inch 4K Ultra HD Roku Smart LED TV (2018 Model)",
    "description": "Size:65-Inch| Configuration:TV onlyTCL's 6 Series combines stunning 4K HDR picture performance and the award winning Roku TV smart platform in a bold, brushed metal design for a superior TV experience. Dolby Vision delivers greater brightness and contrast, as well as a fuller palette of rich colors. TCL?s Contrast Control Zone technology individually optimizes the image across up to 120 zones to yield striking contrast between light and dark areas. The 6 Series models? iPQ Engine provides precise color replication while HDR Pro Gamma significantly improves HDR performance in any setting. Powerful picture performance is complemented by the Roku OS, providing seamless access your cable box, Blu ray player, gaming console, and other devices without flipping through inputs or complicated menus. An enhanced remote makes it easy to find movie titles, launch or change channels, and even switch inputs, all with your voice. The minimum bandwidth requirements to stream 4K content vary by content provider. For example, Netflix and Youtube state their recommended minimum speed is 25Mbps. Vudu states its minimum is 11Mbps, Amazon recommends a minimum speed of 15Mbps. We recommend that you check with your preferred 4K content provider to see what their requirements are, as they may change from time to time. HDMI Ports: 3 HDMI 2.0 w/HDCP 2.2 (1 ARC); Resolution: 3840 x 2160; USB Ports: 1 USB 2.0. Display Resolution UHD",
    "rating": 4.2,
    "feature_bullets": [
      "Your purchase includes One TCL 65R617 65-Inch 4K Ultra HD Roku Smart LED TV (2018 Model), One voice enabled remote control with batteries and One analog audio/video input adapter.",
      "TV dimensions without stand: 57.1\" W x 32.9\" H x 3\" D. TV dimensions with stand: 57.1” W x 35.7” H x 10.7” D. Stand separation distance: 55.5” TV weight without stand: 51.2bs",
      "Our Contrast Control Zones (CCZ) is part of the powerful performance package available on our new six series TV. Simply put, and LED TV with Full array and contrast control zones is the only way in LED TV can have the blackest blacks and whitest whites on screen at the same time, delivering an amazing contrast, bright vibrant white, and deep rich blacks.",
      "The 120 Hz clear motion index uses a combination of the TVs need of 60 Hz panel and back like scanning to deliver clear fast action. This technology prevents the “soap opera effect”.",
      "While TCL Roku TVs do not include Bluetooth, you can connect this TV to external audio by using either HDMI ARC, a digital optical audio out, or an analog audio out in the form of a 3.5 mm Jack.",
      "Compatible with Alexa and Google Assistant"
    ],
    "specifications": {
      "Brand Name": "TCL",
      "Item Weight": "52.3 pounds",
      "Product Dimensions": "57.12 x 10.7 x 35.65 inches",
      "Item model number": "65R617",
      "Batteries": "2 AAA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "Dark Grey",
      "ASIN": "B079NJMFL8",
      "Customer Reviews": "4.2 out of 5 stars1,794 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#50,822 in Electronics",
      "Date First Available": "March 16, 2018"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "LED & LCD TVs",
      "Televisions"
    ],
    "price": ""
  }
}