{
  "website_summaries": [
    {
      "verdict": "Extremely lightweight dog wheelchair that allows dogs to move freely without wearing down too quickly.",
      "pros": [
        "Six sizes available to accommodate dogs from two to 132 pounds",
        "You can take the wheelchair apart easily to transport it to wherever it's needed",
        "Height and length can be adjusted to create a more precise fit for the animal",
        "Not a bad price point versus some other options"
      ],
      "cons": [
        "Won't work for dogs with hind leg amputations, as it supports the back legs, rather than replacing them"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Well worth the learning curve!",
      "text": "This has changed our little dog's life! He is almost 16 and recently lost the use of his back legs entirely due to a disintegrated spinal disk. He can walk, almost run in it and learned to maneuver it very quickly! The harness system had quite a learning curve but now we figured it out. Our little Chuck is worth the effort!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda M. King",
      "helpful_votes": 107,
      "publication_date": 20191111
    },
    {
      "title": "Highly recommend!!!!",
      "text": "This cart gave my Yorkie his spunk, sassiness and mobility back. He had lost the use of both back legs and with the cart, laser therapy and accupuncture he has made an amazing recovery. I like that this cart allows the option to use it simlilar to a walker. He is also able to do all of his business while in the cart with no problem. If he wears this one out I will definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 37,
      "publication_date": 20190309
    },
    {
      "title": "Perfect rehab tool that allowed my dog to walk again.",
      "text": "Okay so our doxen experienced paralysis of his back legs. The vet said he didn't think he would regan use after about a week of trying different things. I ordered this wheelchair and used it along with water ROM for him and in 2 weeks he could walk again without the wheel chair. I credit his recovery to this chair and will keep it as a rehab tool in case we need it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 32,
      "publication_date": 20180607
    },
    {
      "title": "I put them on him he looked like..",
      "text": "My little Maltese has been down and had to drag himself around for over a year. . First day I got these wheels in.....I put them on him he looked like...WHAT TOOK YOU SO LONG TO GET ME THESE! They are perfect and he loves them. GREAT PRODUCT.",
      "rating": 5.0,
      "verified": true,
      "author": "akalouise",
      "helpful_votes": 27,
      "publication_date": 20180802
    },
    {
      "title": "Great doggie wheels",
      "text": "Our dog is about 75 pounds, paralyzed from discospondtlylitis. It’s been 3 months, this doggie wheel chair has been awesome and now when our dog runs, he moves his back thighs like he’s running so he’s getting better!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B Kosderka",
      "helpful_votes": 37,
      "publication_date": 20200309
    },
    {
      "title": "he was happy to be mobile again",
      "text": "Initially it was a little tricky to put on the dog, as he has never worn a harness but once got it on him, he was happy to be mobile again. I like the flexibility of the wheelchair, meaning it's great that are so many height and width options. Additionally, I was surprised to see that a leash was included. I don't think you could ask more of an affordable wheelchair.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 15,
      "publication_date": 20180506
    },
    {
      "title": "Tiny wheelchair is a JOY",
      "text": "So affordable and a perfect fit for my 7 pound Coconut. It is SO lightweight. She loves zipping around in it. It has improved her life dramatically. I had ordered a larger one, that was heavier, and she was not happy to use it. (I donated that to a rescuer of handicapped dogs.) This tiny, super light weight one is like an extension of her own body.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly I. Jacobs",
      "helpful_votes": 4,
      "publication_date": 20200113
    },
    {
      "title": "Great buy!!!",
      "text": "It has been a great purchase. Gave my old girl her mobility back. It is sturdy and easy to put on. It was easy to assemble. It’s very affordable compare to others out there but quality is great!",
      "rating": 5.0,
      "verified": true,
      "author": "luisa",
      "helpful_votes": 3,
      "publication_date": 20200829
    },
    {
      "title": "this is a good product",
      "text": "It is kinda of annoying to adjust especially when the animal is strapped in. i adjusted it to recommended height and length before putting animal in and had to make further adjustments once he was put into it, as is to be expected. he was diagnosed with Degenerative Myelopathy about a year ago and he still can walk very well, just wanted to get him used to it before he can no longer walk, he is a 13 year old pug! just keep in mind your animal will pretty much need to relearn how to walk to use this.",
      "rating": 4.0,
      "verified": true,
      "author": "Billy Q.",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great product",
      "text": "Easy to assemble and it made our recently disabled dog soooooo happy to be able to be mobile again. He has hind leg paralysis and this allows him to go for walks and sniff around outside like he used to. Keeps him mentally very happy. The large wheels roll easily over uneven terrain. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200909
    },
    {
      "title": "Helped our disabled dog run again❤",
      "text": "This wheelchair helped our little senior Chihuahua remember why she loves life. It ignited her fire and has brought back the twinkle in her eye. She is able to walk and run now without any issues. She figured out how to use it very quickly. She really does love it and I'm just so happy that it was able to help her.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianne Martinez",
      "helpful_votes": 2,
      "publication_date": 20191212
    },
    {
      "title": "I highly recommend",
      "text": "This wheelchair is wonderful. My dog took to it RIGHT AWAY! It’s lightweight, easily adjustable, and comes with the little wrench tool you need to put it together (which was also easily and quickly done). For reference, my dog is about 22lbs and 16in tall. He has a condition where his back legs are slowly going paralyzed but he still has use of them, so he just needs a little support.",
      "rating": 5.0,
      "verified": true,
      "author": "krista",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Absolutely Incredible!!",
      "text": "WOW, hands down a amazing product. We have a FlemishGiant who has spinal issues and back leg issues. This product is going to save her life and keep her Lumbar from collapsing. It rolls smoothly and fits her perfectly. She probably weighs 5ish-6pounds. Assembly was very quick and almost effortless. If she gets bigger we will order another one in a bigger size.",
      "rating": 5.0,
      "verified": true,
      "author": "T.Hink",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Love it",
      "text": "My dog is paralized from the back legs recently, he was super sad and in pain the first 2 days until I got this wheel chair along with a back brace (little breakers) he is in less pain and hes super happy with his wheelchair (hot wheels) hes been super active and acting like a dog again",
      "rating": 5.0,
      "verified": true,
      "author": "Esther c.",
      "helpful_votes": 2,
      "publication_date": 20200322
    },
    {
      "title": "Wonderful product.",
      "text": "What little time I had left with my sweet girl , she loved the freedom this gave her for such a short time. If you have a dog with mobility issues, give them the gift of movement. Blessings",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Larson",
      "helpful_votes": 3,
      "publication_date": 20191106
    },
    {
      "title": "May need to make adjustments like longs rods, and different front harness.",
      "text": "Once we modified the wheel chair with longer rods took the harness harness off and put on a jacket type that we use with a lease that so it wouldn't choke him, sewed on straps to fit the front rods through the jacket , then we had to lower the wheels, and those blue back leg straps so that our Schultze's back legs could touch the ground, once adjusted we put him in and he took off with a little encouragement from those that love him so. Sorry, I do have pictures of him in the wheelchair, but I don't know how to get them on the computer. Thank you",
      "rating": 4.0,
      "verified": true,
      "author": "J R Shewmaker",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Better life for my dog",
      "text": "Our dachshund has limited mobility due to a back injury. We are easily able to put him in and take him out. He likes it! We don't lift his back feet up because we want him to gain strength in them. He does like it and runs around easier with it. Like other reviews, it's not easy for him to lay down in it so we bought him a big pillow and he rolls on over and rests on it when he wants to. We do NOT leave him in it all day or overnight.",
      "rating": 5.0,
      "verified": true,
      "author": "poofs",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "The best money I’ve ever spent.",
      "text": "I’m so grateful that things like this exist. My 14 year old beagle has neurological issues with her hind quarters and cannot walk. She has been so very frustrated not being able to get around and go out for walks. She took to the wheelchair quite quickly and after about a week, is a pro. Watching her be able to “walk” outside again and run around the yard and house literally brought tears to my eyes. Maggie’s spirit and attitude has improved so much by giving her, at least mostly, back her mobility. The best money I’ve ever spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy Groat",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great for dogs with hind leg issues. Great for older dogs.",
      "text": "This is perfect for my daisy. She is 18yrs old and her hind legs are very weak. It’s easy to assemble and not hard to put on. Through repitition it gets easier to put on. So far so good on sturdiness. She comes up the driveway halfway pretty good then tires out. Just the right size for her. 9’’s high. Looks comfortable and she gets around with it very well. Love seeing her walking instead of dragging her hind legs. Looking to get some more time with her.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Keep looking not a good chair for your best friend",
      "text": "This chair is difficult to get my dog in and he can’t maneuver in it very well. It’s better than nothing but the harness needs work",
      "rating": 3.0,
      "verified": true,
      "author": "stevenakeller",
      "helpful_votes": 2,
      "publication_date": 20200215
    },
    {
      "title": "My disabled dog loves this!",
      "text": "My 2 rescued disabled dogs loves, loves this so much! Got another one as well. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "April and Deb",
      "helpful_votes": 2,
      "publication_date": 20200211
    },
    {
      "title": "Crippling carrier",
      "text": "Looks pretty but it is not able to be adjusted enough so my dog does not end up on his face. According to specs it is the correct size for my old pug. But it is far from a help for my poor old man. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Yarberry",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great buy",
      "text": "Great little cart foes it's job. Seems quality. Got it for our old little doggy with a herniated disk.",
      "rating": 5.0,
      "verified": true,
      "author": "kjmeyers",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Really good wheelchair for the money",
      "text": "Very nice product. The harness that holds the dog or cat to the chair could be attached a different way that would be easier. Have to keep the harness pretty tight around your pet to keep it from getting unhooked from the wheel chair.",
      "rating": 4.0,
      "verified": true,
      "author": "Chumly&Peewee",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "Didn't work for us",
      "text": "I really wanted this to be the solution to our pug's inability to walk more than a few steps due to degenerative myelopathy. Unfortunately, he kept falling backward - even though his front legs work. Because there's nothing to stop the back wheels from rolling backward or stopping, he just couldn't get moving forward. I'm glad it works for some, but it just didn't for us. I would return it, but just found out I'm past the return window.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie Houston",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "My Bichon is learning too walk again!",
      "text": "He ruptured a disc. Came home from the vet and couldn't use his back legs for a week. We used this to help him move around and he started to use his legs. After a week he can walk on non slippery surfaces for a couple of yards without it. He's making great strides. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "ROCG",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "A lifesaver!",
      "text": "I have a 15yo,13 lb Pekignese and the xxs fits perfectly. Het has weakness in his back and hind legs making it hard/painful to walk. He hated being strapped in the first time, but when he realized this was helping him he zoomed faster than I have seen in a long time! Easy to put together and strap on too. The quality for the price is so worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Easy to use!",
      "text": "I bought this for my 7lbs Maltese-Shih Tzhu dog. It was easy to assemble and it is very easy to get my dog in it. She’s now mobile and looks comfortable while using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Astrid",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Not as pictured in the instruction booklet",
      "text": "Assembly was easy, however, the wheels as pictured in the instruction booklet show measuring lines. The ones that came with mine are completely blank, so in order to get the wheels level I used a level. Hoping it will work out for my dog.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathleen A. Calarco",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "Pay attention when you 1st figure it out putting it on, can be confusing the 2 time around",
      "text": "My dog LOVES this, he is so happy to be able to get around on his own. The assembly is easy but can be confusing, great product, thanks for making my dogs world better",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra English",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "It was exhausting to use, for both us and our pup!",
      "text": "By the time we figured out how to get it together, it was time to get our pup in... it was not easy and we have only used it once. At this point, I am considering reaching out to the seller to return it, because it just was way too much for a paraplegic dog that is anxious and two owners who are not mechanically savvy enough to use...",
      "rating": 1.0,
      "verified": true,
      "author": "Angelita Aguilar",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Easy to assemble",
      "text": "We got this for our cat who has paralyzed back legs. It works perfectly and is easy to adjust to your pet's size.",
      "rating": 5.0,
      "verified": true,
      "author": "DEBORAH",
      "helpful_votes": 2,
      "publication_date": 20190422
    },
    {
      "title": "Rickety piece of junk",
      "text": "This product is a flimsy, poorly-designed piece of junk. The rods come out every walk. The parts are weak and bend. The neck strap is shoddy and always falls off. The little allen bolts that hold the rods in are totally inadequate. Do not buy this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Not stable",
      "text": "Took over 30 minutes to figure out how to even assemble it. Not easy. Then another 20 minutes Or more getting our dog in it. Needless to say we sent it back. Not very stable.",
      "rating": 1.0,
      "verified": true,
      "author": "Jimmy Waites",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "helpful item",
      "text": "our puppy is happier now with wheels ,able to get around much better..actually beginning to try to walk again since she has mobility",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Measure your pet for a perfect fit!",
      "text": "My heart swells with joy seeing my poor, old pug walk again! Be sure to measure your pet to ensure a perfect fit!",
      "rating": 5.0,
      "verified": true,
      "author": "MizMangum",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Dogs are family too.",
      "text": "Will use it to help my mini-dog Bromnny with right back leg amputated to enjoy her dog life at full speed again.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Good product",
      "text": "Seems like a good produce. The dog wasn't so sure about it but I think getting her used to it slowly will do the trick. And lots of bribes with treats.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "sturdiness",
      "text": "It seems like it would work well but unfortunately, our little guy also has a neurological problem and couldn't manouver it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dog Mom",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Meh",
      "text": "It’s okay, but it’s cheaply made. Don’t expect it to be something that lasts if you have a bigger dog.",
      "rating": 3.0,
      "verified": true,
      "author": "Wbgregg",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Beware",
      "text": "Missing parts, broken parts, no instructions. Human hair tangled in parts.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt S",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Its light",
      "text": "Great cart but difficult to put on especially with an older dog Not the easiest thing to do. We are still working with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Ysee gaudel",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "My Weener dog is now Rollin swift",
      "text": "Turns a defective dog into a sufficiently mobile animal with added charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandess Sorrels",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Two Stars",
      "text": "I should have returned... didn’t fit as expected and parts kept coming apart",
      "rating": 2.0,
      "verified": true,
      "author": "shay",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Perfect",
      "text": "Bought it to rehab my dog. It works great but he hated it. Luckily he got better all on his own. Guess I'll sell it now lol",
      "rating": 5.0,
      "verified": true,
      "author": "KaelinasMom",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "It really works!",
      "text": "Our little 3-pound chihuahua girl lost almost all of her mobility in her hind legs due to degenerative spinal disease. This fantastic wheelchair made her a power walker again. Her confidence and independence are back and she couldn't be happier. It's extremely light and maneuverable.",
      "rating": 5.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Great product and company.",
      "text": "Fortunately our dog is getting better so we haven't had to use this product. Still gonna keep it though, just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "not the right product for our dog",
      "text": "Have a large shepherd with degenerative mylopaphy it was difficult with two people to put back legs in support and caused our dog pain, it wasn't the right product for our dog",
      "rating": 3.0,
      "verified": true,
      "author": "charlene bradley",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Can’t beat the price or quality of this product.",
      "text": "The wheelchair is well built. I am super satisfied with this product. You can’t beat the price or the quality of this products.",
      "rating": 5.0,
      "verified": true,
      "author": "Daly",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Just a little difficult to get the dog into the chair.",
      "text": "My only complaint is getting my dog into the chair. Otherwise it is a great product. I honestly didn’t think my dog would use it but it was worth the purchase. It’s more of a therapy tool for him he has limited mobility in his hind legs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly Routzahn",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "We purchased an XS that is perfect for our pug",
      "text": "My dog loves this product! We purchased an XS that is perfect for our pug. The only thing that I do not like about this product is that it is hard to put the dog into it with just one person.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Harris",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Durability",
      "text": "This saved my ex mothers in laws fur baby life At furst was unsure but then discovered she could take off again",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Going on walks again!",
      "text": "This has given our Corgi an amazing new chance to feel young again! It did take a few weeks to get her comfortable with it but now she's keeping up with her brothers on our walks. It was well worth the money for us!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "I felt it was too heavy for my dog to maneuver",
      "text": "Product was more difficult to assemble and heavier than expected. Too heavy for my small dog to maneuver in. Product was nicely designed just not as light as we expected. We did order appropriate size for my dog’s weight & size",
      "rating": 3.0,
      "verified": true,
      "author": "Bea  Pappas",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "It works, and it's great to see her running around again.",
      "text": "We bought the 'doggie wheelchair' for our pet who is dragging her back legs. It seems to work pretty well, and we just need to adjust it to fit her properly. She is a tiny dog and we bought the smallest size.",
      "rating": 5.0,
      "verified": true,
      "author": "scot1",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Works",
      "text": "This wheelchair did everything we needed it to do. unfortunately I had to put my dog to sleep the day after we got it. :(",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Five stars",
      "text": "has helped him so far , good product --good price Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Not sturdy",
      "text": "I used this for my 13 year old disabled Pug. She would slip out of it too much and had to stop using it. It doesn’t hold her and the straps and metal frame do not stay locked. This may be a better product for very small dogs.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Lopresti",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Measure your dog before buying",
      "text": "This was very well built but our dog couldn’t get the concept.",
      "rating": 5.0,
      "verified": true,
      "author": "C.r.",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Wheel chair",
      "text": "Was not suited to a Chihuahua as stated in ad.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Bell",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "didnt work in my dogs case",
      "text": "might work for someone elses dog. Didnt work for mine. She kept falling over and her and the whole thing would be on its side. Not enough support.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca B.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Not convenient",
      "text": "Very difficult to put together, and unstable. Come apart very easily. Would not recommend this product. Only used it once. Total waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Jabari jaami",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Happy. Well made.",
      "text": "Very happy with my dog’s new wheels. She liked them right away!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbnie",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Not happy",
      "text": "Was wondering if you had the grey harness that was pictured in the picture cause that is not what I received in my package",
      "rating": 1.0,
      "verified": true,
      "author": "Clowe81",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Very sturdy",
      "text": "My little buddy passed away before we got to use it. It came very quickly & was a very sturdy wheelchair.",
      "rating": 5.0,
      "verified": true,
      "author": "Randal P.",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Flimsy!!!!!",
      "text": "Dont waste you money's.... very weak and cheap products. You get what you paid for....",
      "rating": 1.0,
      "verified": true,
      "author": "Gwen Brown Lewis",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Enjoy walks again",
      "text": "Easy adjustment for size and support needed as the dog’s needs changes",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnie Hon",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Excellent",
      "text": "Our kitty is able to run and play! Thank you very much!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Roman",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Your Puppy  Matters🐶",
      "text": "I loves that it was easy to put together and the best part my Baby can now run without dragging her feet!🙂",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Worth it",
      "text": "At times a little difficult to get my pup in, but has definitely made a difference in his quality of life!",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Perfect!!",
      "text": "My 2 year old pup is enjoying his new cart and is able to walk again freely and happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Castellon",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Easy",
      "text": "Great product adjustable to fit properly and easy to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "Pedro",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Best thing out there",
      "text": "Was perfect for my little guy. Runs around like he is a pup again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Campbell",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Nice but my baby didn’t like it",
      "text": "Nice but my teacup chi was not happy about it.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn Libretto",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Only gave a star because it made me.",
      "text": "Very poorly made. Very complicating to put on your dog. These dogs are scared of it to begin with, it shouldnt take a brain surgeon to put on. May return it within the time frame.",
      "rating": 1.0,
      "verified": true,
      "author": "dblue1",
      "helpful_votes": 0,
      "publication_date": 20180704
    }
  ],
  "product_meta": {
    "title": "HiHydro 6 Types Cart Pet Wheelchair for Handicapped Hind Legs Small Dog Cat/Doggie/Puppy Walk Stainless Steel XXS-L",
    "description": "Size:XS Height: 7.5\"-13.75\"\n\n Size chart: \n\n Size: XXS With Wheel Bearing Shafts: No Height: 6.25\"-9.5\" (16-24 cm) Width: 3.5\"-6\" (9-15 cm) \n\n Size: XS With Wheel Bearing Shafts: No Height: 7.5\"-13.75\" (19-35 cm) Width: 5.5\"-8.5\" (14-22 cm) \n\n Size: XS+ With Wheel Bearing Shafts: No Height: 7.5\"-13.75\" (19-35 cm) Width: 7\"-10.25\" (18-26 cm) \n\n Size: S With Wheel Bearing Shafts: Yes Height: 10.5\"-17.25\" (27-44 cm) Width: 7.08\"-11\" (18-28 cm) \n\n Size: M With Wheel Bearing Shafts: Yes Height: 16\"-20.5\" (41-52 cm) Width: 8\"-10.25\" (20-31 cm) \n\n Size: L With Wheel Bearing Shafts: Yes Height: 19.75\"-24.5\" (50-62 cm) Width:10.25\"-15.75\" (26-40cm) \n\n Size: New XS purple:Height:7.87\"-13.77\"(20-35cm) Width:5.11\"-7.87\"(13-20cm) \n\n Size: New S purple:Height: 13.7\"-19.6\" (34.7-49.7cm) Width: 7.08\"-11\" (18-28 cm) \n\nSize: New XS（PU wheel):Height: 7.5\"-13.75\" (19-35cm) Width: 5.5\"-8.5\" (14-22 cm) \n\n NOTE: \n\n 1.Please make sure you do not mind 1-3cm error due to manual measurement before you buy \n\n 2.Please manual your pets and check the size details to chose the wheelchair suit to your pets \n\n 3.Wheels wheelchair can help the handicapped pet walk, but can't for the waist injured pet. Some pet like rabbit or too weak dog may not suitable for this wheelchair! \n\n 4.NOTICE: Please measure the size of your pets according to the picture shown!! Choose the right size wheelchair for your pet!! This dog wheelchairs only provide mobility assistance for dogs with inconvenient hind legs, No therapeutic effect. If the dog is in a critical state, it is not recommended to buy this type of wheelchair. Wish your pet gets well soon. \n\n What is included: \n\n 1 x Pet Wheelchair \n\n 1x User manual",
    "rating": 4.1,
    "feature_bullets": [
      "The wheelchair is specially designed for dogs and cats with hind legs, so that they can walk and run even as normal young fellows do.The use of user-friendly design, as far as possible in detail to avoid friction with pets, causing two injuries, and the length and height are adjustable range, it is recommended to choose according to the specific size.",
      "Our pet especially dogs needs lot of sports, but when they handicapped they can not play out side ,it will make they fell lonely.It is not good for their treatment. The wheelchair is specially designed for dogs and cats with hind legs, so that they can run and play with you.",
      "Our wheelchair is so light that your pet will walk easily with it.The height\\width and length of the pet wheelchair all can be adjustable, it can suit to your pet within limits.",
      "Our wheelchair is easy to be taken apart and put together, you can install it by yourself. 2-wheel wheelchair is only for the pet hind leg disability £¬you can raise it's hind leg,if it can walk use it's forelegs our wheelchair will help it walk",
      "Pets are our families, when they handicapped don not give them up,one wheelchair will give them the second life. Wish your pet gets well soon.Friendly notice:Measure your dog before buying!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "17.5 x 8.9 x 4.3 inches; 3.45 Pounds",
      "Date First Available": "January 15, 2018",
      "Manufacturer": "HiHydro",
      "ASIN": "B0792SQ663",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Exercise Wheels",
      "Pet Supplies",
      "Small Animals"
    ],
    "price": 89.99
  }
}