{
  "website_summaries": [
    {
      "verdict": "A streamlined robotic model from Shark with 2 extra side brushes and 1 extra filter, when compared to other models.",
      "pros": [
        "Like other Shark robotic vacuums, this model is one of the best you can get for under $500",
        "Avoids hazards, gentle on floors and furniture, sucks up everything you don't want around"
      ],
      "cons": [
        "Some reviewers felt it sometimes gets stuck going over the same place"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pretty Great!! Highly recommend.",
      "text": "This little bugger is great! Tested it by sweeping and vacuuming my best, then turning it on....wow! It sure does pick up a lot. Great suction! We have a puppy and it instantly cleans up the flowing fluffiness that collects on the floors. We chose this brand based on the great ratings and lower price compared to similar, more popular brands. Thankful we did. The timer feature is great too. Set it up to run while you're asleep or gone for a time. It instantly docks itself when finished. Make sure your socks, cords and small items are off of the floor. It will choke on them. Easy to clean. Easy to use. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dory",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "AMAZING product! Everyone needs this vacuum!",
      "text": "There are so many things I have to say about this vacuum! I love how quiet it is, the battery life, the Alexa features, the ability to start from phone and schedule to run automatically, the price! So many things. We actually had our first one start making a wired sound about 6 months and when we called they tried to trouble shoot it and when they couldn’t immediately replaced it for us and have had zero problems since!",
      "rating": 5.0,
      "verified": true,
      "author": "Brady",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Not worth it- just get a new one!",
      "text": "So this worked decent for about 5-10 minutes and then started to randomly stop in the middle of the floor and I’d have to push the clean button again. It would start back up, but shortly after started to make a loud rumbling tractor noise. I checked filter and emptied a bunch to check for anything that might be stuck. Nothing appears to be stuck anywhere from what I can see. I requested to return a few days ago and have not heard from the seller. I won’t be purchasing anymore ‘renewed’ items from Amazon after this.",
      "rating": 1.0,
      "verified": true,
      "author": "Mel C.",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Purchased Shark RV700 for $230 and only worked a handful of times - Don't buy",
      "text": "I purchased the Shark RV700 because I need some extra help cleaning hardwoods with 2 big dogs at my house. I had always heard that Shark had a good reputation. On Jan 4th 2019, I received the product and it worked great the handful of times I have used it. I just found out that because it was refurbished, the warranty is 90 days from the seller I bought it from. Very disappointing that Amazon or the seller won't fix/replace something that was hardly used before having issues. I would not recommend buying the Shark vacuum.",
      "rating": 1.0,
      "verified": true,
      "author": "eric b.",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Good seller, great product",
      "text": "Bought this for my girlfriend, she loves it. It really cleans well, she has cats and it gets that hair up well.",
      "rating": 5.0,
      "verified": true,
      "author": "None ya business",
      "helpful_votes": 3,
      "publication_date": 20190119
    },
    {
      "title": "Awesome",
      "text": "I purchased this as a gift for my daughter for Christmas. She loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dachshund mom",
      "helpful_votes": 3,
      "publication_date": 20190203
    },
    {
      "title": "Perfect!",
      "text": "this is simple setup and great! the price was very fair!",
      "rating": 5.0,
      "verified": true,
      "author": "jen",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Durable little squirt",
      "text": "I run this thing into the ground twice a day and it just keeps going. Grest little vacum.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "The price is great and it is a go getter done vacuum.",
      "text": "I love it but I did not receive a remote with mine. Other than that missing it is wonderful",
      "rating": 5.0,
      "verified": true,
      "author": "Rita Ketterl",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Good Value",
      "text": "It's extremely handy especially with 3 pets running around. My only suggestion would be if you have long-haired animals, maybe go for one with the Max feature. The suction on this is good but with a long-hair black cat, I do still have to go over some spots with the Dyson.",
      "rating": 4.0,
      "verified": true,
      "author": "Katey",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "Such a great investment",
      "text": "I absolutely love this thing! I have three children and they sure are messy I’m a single mom and do not have time to vacuum everyday with owning my own business and working full time. We’ve had this a little over a week now and it’s the best investment I’ve made as a mom so far! The kids call it robo and they know to pick up their toys so robo doesn’t get them and my three year old loves to turn it on and pick up things so robo doesn’t eat them 😂",
      "rating": 5.0,
      "verified": false,
      "author": "ItsAliciaNicole",
      "helpful_votes": 11,
      "publication_date": 20181202
    },
    {
      "title": "Uses a remote to control (No privacy issues)",
      "text": "Uses a remote to control (No privacy issues), strains mightily on deep plush carpets. Has problems with certain furnishings, extension cords, and pet toys. Utilize boundary strips to best effect. Avoids cliffs like a champ, does work great if used frequently. Long hair pets and people will require frequent cleaning of all moving parts and watch the trash hopper like a hawk for fullness.",
      "rating": 5.0,
      "verified": false,
      "author": "borgrabbit",
      "helpful_votes": 4,
      "publication_date": 20190129
    },
    {
      "title": "Arrived looking like it was taken out of the trash!",
      "text": "The packaging was horrible. The box was on bad shape and the actual product packaging was torn and taped up with clear and black tap. This was suppose to be a gift and looked like it came out of the trash!",
      "rating": 2.0,
      "verified": false,
      "author": "Indiayola ",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Did not receive the correct model",
      "text": "I previously purchased this model and like it so much, I wanted to buy another one. I could only find a certified refurbished Shark Ion Robot 700 Vacuum as it is an older model. Sadly, when it arrived it was not the one I ordered, but instead a model RV850. Instead of the delightfully simple remote that comes with the 700, the RV850 requires the use of a crap App. What a bummer. I hope to be able to find another 700! Its exceptional performance and simplicity would be hard to beat.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201125
    },
    {
      "title": "Wow was our floor dirty.",
      "text": "Just used it for the first time. Let it fully charge (about 4 hours). Assembly took about 5 minutes. And turned it loose. It's quiet. Navigates pretty well. There must be a better algorithm other than random. But it hit 99% of the tile kitchen and hardwood livingroom. It found the dock fine. You can't hide the dock and expect it to find it. So far yeah she likes it.",
      "rating": 5.0,
      "verified": false,
      "author": "JoShawn",
      "helpful_votes": 6,
      "publication_date": 20181225
    },
    {
      "title": "Worked for 20 minutes then stopped working, garbage",
      "text": "I'm sick of these products being sold as refurbished, this was essentially a used item somebody repackaged and sent out with zero quality control. did anyone even inspect the product!?!? Literally worked for 20 minutes and then it stopped working altogether, waste of time and money. AVOID, unless you want to take your chance buying a used barely fair condition product repackaged as \"refurbished\"",
      "rating": 1.0,
      "verified": false,
      "author": "murdog",
      "helpful_votes": 0,
      "publication_date": 20191025
    }
  ],
  "product_meta": {
    "title": "Shark ION ROBOT Self-cleaning Vacuum with Smart Sensor Navigation for Surface Floors & Thin Carpets and Easy Scheduling Remote (Renewed) (RV700)",
    "description": "f you have pets, kids, or just a habit of eating all over your home, your floors could always use a quick cleaning. You don't have to bust out the big vacuum every day though you can just press a button and bring out this certified refurbished Shark Ion Robot 700 Vacuum. This robotic vacuum cleaner does all of the work for you. Either press a button onboard and tell it to get to work or schedule cleanings throughout the week with the remote control. This little guy has a low profile design, edge cleaning, and a smart sensor that all help it navigate around obstacles and underneath furniture while still picking up all the debris it can find. When it's all done cleaning, it'll head back to its charging station. Instead of startling the little ones in your house, send our your secret agent to clean your home on the sly - the certified refurbished Shark Ion Robot 700 Vacuum.",
    "rating": 4.3,
    "feature_bullets": [
      "SMART SENSOR: Smart sensor seamlessly navigates around room and obstacles.",
      "CONTROLS: Simple on-board controls and easy to use remote control",
      "BRUSHROLL: Spinning side brushes with edge cleaning and self-cleaning brushroll for powerful suction cleaning",
      "PROGRAMMABLE CLEANING: Start cleaning right away or set a recurring schedule with the remote control",
      "INCLUDES: 1 easy scheduling remote, 2 AAA batteries for remote, 2 side brushes, 1 HEPA filter, 1 hair removal tool, 1 lithium-ion battery, charging dock, 9 feet of BotBoundary strips, and 2 BotBoundary connector"
    ],
    "specifications": {
      "Item Weight": "9.28 pounds",
      "Manufacturer": "SharkNinja",
      "ASIN": "B07B8Y2HJ9",
      "Customer Reviews": "4.3 out of 5 stars32 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#607,353 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Carpet",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Vacuums",
      "Robotic Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": 139.99
  }
}