{
  "website_summaries": [
    {
      "verdict": "The SteelSeries Arctis Pro Wireless is a remarkably full-featured wireless gaming headset, with a handy transmitter with its own controls and display, and both Bluetooth and wired connectivity as backups.",
      "pros": [
        "Excellent audio quality",
        "Comfortable",
        "Lots of connection options",
        "Two batteries with charging compartment in transmitter"
      ],
      "cons": [
        "Expensive",
        "Doesn't feel quite as premium as similarly priced headsets"
      ],
      "aspects": {},
      "publication_date": 20180316,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Don't Work - First and last SteelSeries Purchase",
      "text": "Bought these as they were the highest recommended wireless gaming headset on the market, unfortunately, the SteelSeries software wouldn't work with the headset and just caused errors when trying to do so. I contacted SteelSeries support about this but they were unable to resolve the issue and advised buying a set directly from them (don't do it!!) I went ahead and bought a second set from SS but unfortunately these also wouldn't work and I got the luxury of paying to return them (£30 with insurance as they don't have a location in the UK). This will be my first and last SteelSeries purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "UnluckyXIII",
      "helpful_votes": 100,
      "publication_date": 20181006
    },
    {
      "title": "Audio randomly cuts out which ruins an otherwise superb system",
      "text": "I have updated this review as the previous problem with the audio randomly switching off has been resolved with a firmware update. I'm now happy to give them a solid five stars. They are super comfortable and the battery charge/swap system is great. I use a Blue Turtle mic so I can't talk about the chat quality from these but the audio is great. I really like the way that you can mix the chat / game sounds. I'm using this with PC and PS4 Pro and have had no problems apart from the cut out.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 29,
      "publication_date": 20180807
    },
    {
      "title": "SteelSeries Arctis 3 - The comfiest headset around?",
      "text": "To summarise: Pros: + Great headset for gamers on a budget + Comfortable (after initial break in - demonstrated in video) + Great overall sound stage + Designed with gaming in mind + High quality mic + Same build ass the other Arctis lineup + Price Cons: - Could do with deeper Bass - Requires propitiatory cable to connect (included) - Takes a while to 'break in' to your head shape (well it did in my case) That's it for my brief review - will update if any issues occur in the meantime. Will definitely recommend the Arctis 3",
      "rating": 4.0,
      "verified": true,
      "author": "Th3rm-O",
      "helpful_votes": 12,
      "publication_date": 20190327
    },
    {
      "title": "Great headset hampered by connection issues.",
      "text": "They headset is very comfortable. Large cups, with loads of space for my lugs, without being too large. The sound is great. But the connection. That is terrible. Used mainly with phone (Huawei Mate 20 Pro). I am getting constant reconnects and beeps from the headset. After about 20 mins all audio is lost. The phone continues playing music but I get nothin. I have to turn the headset off and back on and reconnect the dongle to the phone (neither action alone fixes the issue). My wired usb c earphones work flawlessly. Haven't tried more than 5 mins with the switch. Can't speak about the mic, as I never tried it. Pity as they are excellent when they work.",
      "rating": 1.0,
      "verified": true,
      "author": "Gourangaman",
      "helpful_votes": 4,
      "publication_date": 20191115
    },
    {
      "title": "179.99 should be 17.99",
      "text": "I bought these thinking that the price tag would mean that the quality would be worth while however these are absolutely awful they randomly disconnect and I'm lucky if I get 3 mins of connection whilst talking to my friends in party chat I even sent for a replacement pair thinking that would solve issue but it hasn't... I've boxed them up and sending them back for a refund... AVOID BUYING AT ALL COSTS",
      "rating": 1.0,
      "verified": true,
      "author": "craig",
      "helpful_votes": 6,
      "publication_date": 20190905
    },
    {
      "title": "Get these over the Pros",
      "text": "I've had the original version of these and I've had the Pros. Now I have these. The build is solid you don't get the metal hinges and yoke like with Pros but I wouldn't say it's a bad thing given it's less weight. Sound quality of both the Pro and Actis 7 are fantastic. Both have quite a flat frequency curve which enables them to reproduce fantastic audio quality. The Pros NEED some EQ love but the 7s are good straight out of the box. Overall if you don't need bluetooth and don't really need changeable batteries then the Arctis 7 is THE headset for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 2,
      "publication_date": 20191106
    },
    {
      "title": "Amazing headset, perfect for my needs.",
      "text": "Over all a brilliant quality headset. Good materials used very comfortable to wear and sounds amazing. The software steel series engine is great and easy to use and i have had no trouble with it so far. Some minor things come to mind when i think of other people wearing this, is the size. If you have a very large head i could see you having some trouble as the headset does not have adjustable sides like most, instead there is this tension strap that can be adjusted slightly for different user’s although not as much as a sliding sides are able to. Perfect for my needs and i would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Hunt",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Normal gamer chuffed to bits",
      "text": "Having got a little fed up of trying to find a review from a 'normal' person who isn't a headphone snob before actually buying these, I thought I'd write this! I really like them is the long and short of it. The sound quality is really good in comparison to the 35 pound wired pair I was using before (not a major brand). According to my friends, the mic quality is infinitely better and improves their experience when gaming with me. Set up was super easy and they also work on my galaxy s20 ultra and will, I guess, with any USB C device. For 80 pounds, I'm really chuffed and would happily recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Etheridge",
      "helpful_votes": 2,
      "publication_date": 20200525
    },
    {
      "title": "Perfect Product",
      "text": "I purchased the SteelSeries Arctis 1 wired headset for gaming on my laptop and it hasbeen perfect. My friend on noticed the sound quality improvement compared to my previous headset i used for discord. I perosonally like the sound quality good balance between bass,treble and clarity. The headset is very comfortable The headset is extreme comfortable no issues with the headband and earcups. The earcups i believe are breathable so it doesn't leave your ears too toasty after long hours for gaming. No complaints from me it's been a perfect product so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "A strong 4 star after mess around for 3 hours",
      "text": "Got these for a upgrade and there pretty good. Bit expensive but very good. Note. Out of the box they are poor in sound quality. Playing fps games like pubg and cod I like to hear footsteps but is very hard. Once I have played around with the settings and done some research wow. Brill headset hearing footsteps from a long way off that give me that tactical advantage. A strong 4 star review. Lost a star dew to me messing around for 3 hours trying to get the right settings. Surprisingly comfortable too.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh92",
      "helpful_votes": 2,
      "publication_date": 20200325
    },
    {
      "title": "amazing sound, but 2 things need improving",
      "text": "The sound quality is out of this world, both for music and with the microphone. People said I sounded like a radio broadcaster with this mic. However, I found the cloth strap (underneath the hard plastic connector between ears), to be annoying. The ear cups felt really tight and I wear eyeglasses, so that was uncomfortable. In the end I had to return these because the microphone mute/unmute button stopped working. It worked great at first, then started only working intermittently. For a set of headphones at this price, the quality should be extremely high and these should least for years. The switch that controlled the mute button obviously gave out well before its intended wear-out date.",
      "rating": 4.0,
      "verified": true,
      "author": "Connell F.",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "Don't buy if you want to use with a docking station.",
      "text": "When I bought these headphones I wasn't aware that it came with some limitations. After several emails back and forth with their technical support, they have advised that it may or may not work with docking stations and there's nothing they can do about it. I bought this mostly because my previous headset was getting worn out and u wanted to upgrade to a better one. Unfortunately I've had to go back to the worn out cheaper headset which at least works with the docking station. My advice is to stay away from this headset if you plan to use it with any kind of docking station, which is a shame as the audio quality isn't terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Aris",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Excellent gaming headset with amazing audio quality",
      "text": "Great sound quality and fidelity. Great for gaming and music listening with its high res audio. Footsteps are loud and clear (directional audio) great comfort although might be too snug in the first time. Wont suggest turning 7.1 surround on for gaming because it pushes things far away but its actually the best 7.1 surround sound ive heard in a gaming headset compared to like cloud flight S or razer nari. Worth the price tag and no buyers remorse",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Wahjudi",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Dreamy",
      "text": "The 2019 edition of this (only one I’ve owned and purchased recently)... simply wow, the quality is sharp and clear, the comfort of the earcups and band that latches onto your head makes the headset feel weightless. It really is impressive for its value, feels and looks really well made and what more could you expect at this price for a steelseries headset, they are the best I’ve owned. Last but not least did I mention they’re comfortable af?! Well then. Works with every platform so lots of potential usage. I wouldn’t live in earcups as most I find uncomfortable but these are the first to not give me ear cartilage pains over long hours of sitting and playing.",
      "rating": 5.0,
      "verified": true,
      "author": "James Talbot",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Massively disappointed - Sound quality extremely poor",
      "text": "The sound quality was extremely poor including the ‘breathable’ ear cups my ears got very hot after around 1 hours of playing. Massively disappointed with the microphone it picks up any background noise and picks up very light breathing and my friends ask me to turn up and down my microphone constantly and I’m not but any headsets from steelseries ever again !",
      "rating": 1.0,
      "verified": true,
      "author": "Miss R. Griffiths",
      "helpful_votes": 3,
      "publication_date": 20190417
    },
    {
      "title": "DO NOT BUY FROM AMAZON Market place - shocking warranty not valid even after 4 months use",
      "text": "These products failed after 4 months of use and are not covered by the warranty DO NOT BUY THESE ITEMS - after several weeks of back and forward sending photos and receipts we receive this response from Steel - Unfortunately, any purchase fulfilled by the Amazon market place (not \"Sold and Shipped\" by Amazon) are not covered under manufacturer's warranty. Your receipt says your product was through Amazon EU SARL which is a Fulfilled by Amazon purchase. For more information, please refer to this web page:",
      "rating": 1.0,
      "verified": true,
      "author": "Albert Einstein",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Love them. The two batteries seal the deal.",
      "text": "Love these. They have amazing range (I can wear them out into the garden and still stay connected to the office on the 1st floor at the front of the house). They are light and comfortable, and have a good quality microphone that is detachable. The thing I love the most, though, is the two batteries which means you can instantly swap them around (takes about 10 seconds). Just remember to turn Sidetone down or off in the hub settings if you don't like hearing yourself or your surroundings. The only downside is that they have a tendency to slip off if you have shiny hair like me and move too quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Better than expected",
      "text": "So far I’m really liking these. Sound quality is just spot on and there is plenty of base unlike some say. if you use Dolby atmos app on Xbox one your notice a big improvement. Your need to pay for the atmos app but it’s worth it for sure as windows sonic is crap and sounds tinny. Very comfortable and battery lasts well. Mic monitoring could do with being higher but it’s still good. I’ve used the online app/software to set them up better then stock. I play call of duty a lot and these are a game changer. I’ve also got turtle beach stealth 700 and they are nowhere near as good as these steel series ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Jmax",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Good sound and no more wires to Xbox or controller",
      "text": "So far so good. Bought for 10ur old avid Xbox gamer who has managed to break last three \"cheap\" headsets with twisted Cabela's being the culprit and damaging the connection to the controller. No such problem with these. They sound great and connect by syncing just like a controller (9x version for Xbox). Heavy price you might think but if they last a few years then it's worth it and he was over the moon when opening the box on his birthday. This is the kind of present people actually want lol",
      "rating": 5.0,
      "verified": true,
      "author": "Critical Critic",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Gamer very happy. Highly recommended.",
      "text": "My teen gamer son is very pleased with these. Bluetooth connection works all over the house. Got handy features that make this stand out such as a fabric band inside the adjustable over head part so they don't slip, the ear pads cradle your ears like angel's hands and the sound quality is excellent. I think he said there's an automatic music pause feature and the fact that the mouthpiece goes in a hole when not in use is really good. I must have bought 5 or 6 pairs of various headphones and wish I had just spent more money for a better wireless set. He's really happy and if you are looking for headphones just get these.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss A. J. Wright",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Wow!  Just wow.",
      "text": "Had these badboys for 2 hours before raising an RMA. So disappointed. Pros: Optical in/out Cons: Feel cheap Sound cheap Counter intuitive Bad design I took a chance and ignored the bad reviews as I thought £280 would at least have some quality. I was wrong. The sound is very poor. My £30 sennheiser headset set sounds better. My daily driver are my Sony WH-1000X-M3, so my expectations were high to start with. But I wanted something I could also use with the PS4. Avoid these at all costs, utter garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "cdstealer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great headset with a few small flaws",
      "text": "I bought this (Arctis Pro Wired) to replace my old Arctis 5 which my partner could use. They sound great, slightly better than the Arctis 5. They're also really comfy, the earpads feel a lot thicker on these and it feels like a higher build quality. The volume wheel on the headset protrudes more and feels nicer to use, haven't accidentally moved it with weeks of use. Only a few minor cons: - Still comes with the (in my opinion) useless volume dial on the cable - Mute for the mic on the headset is super easy to press without meaning to - Cable is slightly shorter",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth ",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Read if console player.",
      "text": "If you're a PC player then these will be amazing. They are cosy and you get to use all the little extras the headset provides. If you're a console gamer then there are 2 minor drawbacks for me. 1. The Wire going from the console to the headset can be a bit annoying. 2. The option to turn down or up the volume between chat and the game isn't there. Other than that, the sound and the mic are brilliant and you won't be disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "cbnthfc",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Amazing in every way",
      "text": "I'll keep it short. Build: Great Sound: Amazing features: Very Good These headphones are amazing. Not only are they wireless & bluetooth, but it comes with 2 rechargeable batteries that can be changed on the fly and you can charge one battery WHILST using the headset. Battery change takes about 10 seconds at worst..... so you never need to STOP playing while you wait for a charge. You'll have to stop playing games and charge most other brands.... even the top ones. No problem here. I have this plugged into my PC and PS4 at the same time and can switch between both in a matter of seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "Simeon L",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Do not buy",
      "text": "They look great and are comfortable but thats where the pros stop the audio is awful for a headset of this price it has next to no bass with tinny sounds and a microphone that didn't work on my ps4 and times when it did it made me seen distant and very quiet. I was excited to recieve them as I heard really good things about them and read some good reviews but I was still let down by the headset and it just underwhelming id advise not buying this headset and by the Razer kraken as they are much better but sacrifice looks but other than that they are probably the best for their price",
      "rating": 3.0,
      "verified": true,
      "author": "Jane m",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Fantastic quality headset",
      "text": "I've been using a low price headset for a while now and upgrading to this one really has made all the difference. Firstly, the audio is super clear and crisp, second with my old headset my friends could hear the gameplay and reverb from their own voices in the headpiece, now with this SteelSeries one it's completely clear, and last of all it looks fantastic, the sleek design and retractable mic make this headset one of the best on the market for the small cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Clouston",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Good heaphones, poor durability",
      "text": "My main complaint with these heaphones is that after 14 months the swivel that connects the left headphone to the headband has broken. + Excellent sound quality for a gaming headset + Headband and strap is very comfortable + Retractable microphone works well and has ok quality - Broke after 14 months - Volume and game/chat balance controls are easy to adjust by mistake when putting on and off., - Software quality wasn't briliant - Auto power off kept powering off while I was using them so I had to turn it off",
      "rating": 2.0,
      "verified": true,
      "author": "C. J. Richardson",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Amazing headphones",
      "text": "This is the 2nd pair of these I have bought, one for home and one for work. Sound clarity is brilliant, even over 10--15 metres of office space, no bluetoth to worry about its all private wifi. The additional functionality of being able to take calls and listen to podcasts etc from your phone, by simply plugging it into the arctis controller on your desk is a great touch. You can also be on a call and listen to music at the same time, lovely option for those boring calls.",
      "rating": 5.0,
      "verified": true,
      "author": "chillfire",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Awful Quality, Disgusting Price",
      "text": "Disgraceful price for a product that barely works, constant disconnects, regular interference and now the microphone no longer works. Disgusted that these cost so much, do not buy and avoid at all costs.",
      "rating": 1.0,
      "verified": true,
      "author": "angel",
      "helpful_votes": 5,
      "publication_date": 20191001
    },
    {
      "title": "First impressions",
      "text": "I bought this product instead of the astro a50 as I wanted something sleek that isnt just for gaming, it was easy to set up and it fit very nicely, so much that I forget they are on, I've seen people say the sound is very tinny which on default sound it does sound like that but after messing with the settings in the app I have a managed to get a nice sound, I can also listen to music from my phone aswell as take phone calls and watch videos which is a plus. I would recommend these headphones. If I have any problems with these I will edit and list them below in the future",
      "rating": 5.0,
      "verified": true,
      "author": "Reece bartlett",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Excellent sound, rubbish mic",
      "text": "At the price I really thought I was treating myself only to be told by my regular gaming group I sounded tinny and unclear compared to my old (really cheap) headset. To be fair the sound quality to me through the earpieces is excellent and it's pretty comfortable to wear, though not immune to getting hot ears still. I think it's supposed to automatically detect when your speakers are on and shut off, but I can't get it to do so. If it was half the price I'd be happy but for £125 it's not good enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Harrison",
      "helpful_votes": 2,
      "publication_date": 20190131
    },
    {
      "title": "Amazing headphones (apparently!)",
      "text": "I bought these for my husband who has not stopped raving about them. He games a lot and joins with other people so a headset that allows him to communicate is important to him. He says they're really comfortable. The features he's specifically talked about are the microphone, the way it goes away, lights up when muted so you know with ease, the lights on the side, the dial to adjust the volume balance between your game and voice chat. He thinks they're amazing and has already recommended them to a number of people.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline Campbell",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "AMAZING HEADSET",
      "text": "I was expecting to send these back after reading a few of the reviews below, however I have to disagree about the claims of bad sound quality. Very easy to set up and use, the firmware updated immediately and then I played destiny 2 whilst listening to some drum and bass and they are AMAZING! every note is crisp and down low the bass was excellent with no distortion. Well worth £100",
      "rating": 5.0,
      "verified": true,
      "author": "BantosaurWrecks",
      "helpful_votes": 2,
      "publication_date": 20200625
    },
    {
      "title": "Amazing comfort and great sound quality... after changing the ear cups.",
      "text": "At first, I was disappointed with the sound quality and the headset having no bass like a lot of other reviews point out. However after replacing the ear cups with zmf sheepskin ones I love this headset and there is plenty of bass now too. If anyone else has this problem I'd recommend changing earcups. Brainwavz I'd more affordable than the ones I got and not as thick. Also this headset is very very comfortable for long periods of time. Just a little bit annoying you have to buy different ear cups when the headset is so expensive already.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Decent set of general-purpose headphones.",
      "text": "After coming from a pair of Razer Threshers this pair did feel a bit cheaper, which they are. The sound quality is very good, and the pc software lets you tweak the equalisers and mic settings etc. The cloth cups are not as nice as leather, but are comfortable none the less. They connect to the pc wirelessly pretty much instantly and I have yet to experience any disconnections or drops. They fall down a little when using on the Xbox, and they must be plugged into the controller and the chatmix dial will not function. Microphone is okay quality, however you have to talk a bit louder to get them to register than other headsets i’ve tried.",
      "rating": 4.0,
      "verified": true,
      "author": "James Hughes",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Great gaming headset.",
      "text": "I've had these for a while now and they felt funny at first because they don't let a lot of noise in like my old budget headphones did, the microphone blocks out outside noise as well, you get 360 sound so you can hear footsteps from where your target is so you don't get flanked, they aren't high bass so don't expect music to boom, the clarity of sound is very crisp and good, they are comfortable to wear, they look good. One small thing on my headset is that the right adjustment makes that adjustment click when you extend the headphone band and the left one doesn't but it still works exactly the same.",
      "rating": 5.0,
      "verified": true,
      "author": "Blazer",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Fantastic product!",
      "text": "My mum bought these for my sons 8th birthday after I did a lot of research on wireless headsets. The reviews on this brand were fantastic. We've not been disappointed at all, he absolutely loves them. He says they are really comfortable (I've tried them on and agree!) The sound quality is great too apparently. I've added photos so you can see how they fit an average 8yo. He has them on the tightest setting, so plenty of growing room. Highly recommended this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylansmama",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Good entry level gaming phones.",
      "text": "The sound quality on these is very good and although only stereo you do hear sounds all around you clearly while playing games. Primarily use them on PS4 but also easily plug and play on my Mac. If you have a Mac or PC then you can download the app and play around with the settings which makes sounds according to your personal taste. Well made and comfy to wear these entry level Steelseries are well worth a look if you have the facility to connect to PC or Mac.",
      "rating": 4.0,
      "verified": true,
      "author": "George Reid",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Very good headphones with one only drowback.",
      "text": "Those are bass heavy out of the box same as Logitech and Corsair ones i have tried. It needs a decent equalizer to bring clarity to those headphones. The problem is that the official equalizer provided from SteelSeries within the app is TRASH! The worst equalizer i have tried so far. When i combined it with the razer THX software equalizer and also the surround spartial sound of it, the headphones shined! I am very pleased now with the performance and the clarity.",
      "rating": 5.0,
      "verified": true,
      "author": "Kostas",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Too many niggles",
      "text": "Bought these after reading the various good reviews of the Arctis series. Unfortunately I didn’t find them comfortable (itchy ear pads), and the sound quality wasn’t a noticeable improvement over an old and creaky pair of Beats solos I had. As I wasn’t desperate for a microphone, I ended up returning for a more music - orientated set of headphones. Pros : not too garish design; handy microphone storage; fun headband design Cons: made my ears / head itchy with the scratchy polyester ear padding; cable was too long and proprietary so couldn’t be easily replaced with a shorter one; Sound quality not great",
      "rating": 3.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Tip of the spear",
      "text": "The sound quality on these is incredible from gaming to watch Endgame on Disney+ is the most incredible experience with a headset I've ever had, I've not tried Bose stuff but these are by far the best I've used, my last headset was my favourite which was my Stealth 600. These aren't only amazing but they can be used with the new X series so it covers all bases. With my Elite series 2 and these I should be the greatest player ever, unfortunately they don't help that I suck lol",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan R. Taylor",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Insane sound",
      "text": "Simply incredible! I bought a used pair and had a gift card for Amazon so didn’t pay full price. The sound through these both linked via Bluetooth to my phone and when gaming is incredible, I watched a lot of reviews prior to buying and everyone says the same, they are incredible!! Would I pay the full asking price, probably not but I’m reviewing my experience so 5* from me.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Good for PC gaming",
      "text": "The sound quality is good, especially after a bit of tweaking in the free software downloadable from SteelSeries' website. Latency is extremely low (as you'd expect with a gaming headset). However, the pair I received (which I've now returned) had an issue whereby the right ear would randomly stop working. This never happened when connected to my PC, just my phone, so probably wouldn't be a problem for most but I really wanted some headphones I could use for more than just gaming.",
      "rating": 3.0,
      "verified": true,
      "author": "GeekJosh",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "2019 Edition sound amazing and a lot better than the old version",
      "text": "Loving the Arctis 7 2019 Edition wireless headset - I've Install the steelseries app and left on default and the sound is really nice , bass is just about right and not to punchy - mid tones are nice and handle everything , battery last long enough maybe charge every couple of days. well worth the 125.00 I paid for them direct from Amazon...... Really happy with the headset Note : I did try the old version of these and I hated them so yes theses are very different ! To my ears anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "SmileWithJason",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Really really good Headphones",
      "text": "I use them for office wear. Between music, teleconferences, and phone calls, I think its a great solution. I thought about getting other competing products, and I ended up paying more for this one. I thought it would offer more robustness. I was right. Solid metal headband with comfy padding. I have bought a travel case for it, as it does spend the commute in the laptop case. But for most knocks, I feel confident it will survive. I had a pair of wired headphones that id class as 'Good' and these surprised me by being notably better.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex Eastabrook",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "OK for gaming but sound quality poor",
      "text": "As per title the sound quality was so-so. Therefore I've returned them. They've fit nicely and we're comfy to use. Mesh-cloth ear cups was a welcome and change from the usual memory foam once which I find too hot after a while. Pinning my hopes on the arctis 7 (which just arrived) at nearly double the price. Arctis 7: Straight off the bat I see its MICROUSB charging instead of USB C 😞",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Addict",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great value",
      "text": "Basically the Arctis 7 in a cheaper shell. Quality is amazing, sound is very good. Battery life is good as well. Use this daily for work meeting (as well as music) and nightly for gaming without issue. Ear cups are a bit shallow so your ears do occasionally press against the speaker. Doesn't annoy me at all but it might annoy others. Great product and definitely worth it if you need a good wireless all-rounder.",
      "rating": 5.0,
      "verified": true,
      "author": "Duncan",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Brillant headset ,soundquality and very comfortable",
      "text": "Great headset .Plenty of game time per charge sound quality is brillant the headset is light and comfortable have used this for gaming aswell as listening to music on my phone even great for discord .I love how the mic can be pushed into the headset when listening to music .I have used astros A40s and wireless turtlebeach in the past and these are just as good if not better will diffently be sticking with steelseries from now on",
      "rating": 5.0,
      "verified": true,
      "author": "stuart corbett",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Son very Happy",
      "text": "Sone very happy with these. Tells me some of the best sound he's had. They seem well made and so far pretty sturdy - he's had them about a month and other more expensive ones have fallen apart in that time so much kudos",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. R. Williams",
      "helpful_votes": 2,
      "publication_date": 20191109
    },
    {
      "title": "Good sound but a little heavy on the head.",
      "text": "Very easy to set up and get what I feel is a good quality sound when listening to music and videos online. Microphone easy to use but star lost as I feel the quality of the sound track created on my videos is not as clear as I would like. Overall a good purchase and hopefully will last well.",
      "rating": 4.0,
      "verified": true,
      "author": "David Pye",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great Upgrade",
      "text": "I already own the Arctis 7 and have never had any problems with the headphones, they have been the best I have owned (I have alot of gaming headphones) until now!! The Pro wireless are brilliant and just what I was looking for in headphones the dual battery saves alot of hassle trying to charge the headphones while using them and the build quality seems alot stronger then the previous models. The surround sound is good but I do use 3rd party software on my PC to get the best quality of sound from the headphones. Please note I use these for gaming and I have bose headphones for listening to music.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "A great product, but I couldn't live with the slight delay when streaming",
      "text": "I thought the very slight delay of a wireless headset wouldn't be noticeable, but it was like a constant reverb on my voice, which, of course, I hear instantly in my own head and slightly later through the side-volume. Would have to endure that or switch off side volume and neither was good enough. I'd be surprised if *any* wireless headset could avoid this issue, though. An awesome product, though, if you *could* endure that.",
      "rating": 5.0,
      "verified": true,
      "author": "Disposalist",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "perfect for streaming and gaming xbox pc and mobile",
      "text": "I wish there was some kind of indicator if you are on mute or not but apart from that people say the microphone is nice and clear and doesn't pick up too much background noise. No static or feedback sounds. People in the party or discord chat are impressed with the sound. Perfect for gaming and party chats on my xbox. Great headset for my pc and phone too! Feel free to check out me using it and ask questions on twitch youtube or facebook just search for KatAndGirls",
      "rating": 5.0,
      "verified": true,
      "author": "KatAndGirls",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Pricey, but add a lot of options with great sound quality",
      "text": "No pure audiophile will buy wireless headphones for listening to their favourite bands.. but these are surprisingly good with excellent range and clarity. They are extremely expensive but oddly I feel like they are worth it, you get a lot more for that premium especially on PC with the ability to auto mute speakers plugged into the wireless transmitter when the headphones are turned on and switch back when you power them off. You can also take phone calls on a paired phone etc lots of little touches like that allow you to rearrange your workspace and throw in options should you want them. One of those rare occasions where you pay for what you get..",
      "rating": 5.0,
      "verified": true,
      "author": "P. Penman",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Brilliant purchase",
      "text": "+ brilliant wireless connectivity + works well with ps4, pc, xbox, phone etc + battery genuinely lasts 20+ hours + spares readily available, with customization options + comfortable, even with bigger ears - sound quality although good, doesnt match wired ones in the same price bracket - have to plug in usb transmitter, with multiple consoles this is annoying to change around unless you buy an extra transmitter, available direct",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Lane",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Sound Quality",
      "text": "I'm not sure if I got a dodgy pair, but this is probably the worst sound quality I have ever had in a headset. The voice playback is super sensitive and picks everything up, even my cat purring across the room, small scratches etc... My ears were touching the back wall of the headset making it super uncomfortable so I either have huge ears or it's a design flaw. I messed around with all of the settings, different cables for the mixamp and still the audio was really bad, it seemed as if it was distant almost... I am now back to my trusty old astro a40s and I can say after this experience I'll probably never try another headset...",
      "rating": 1.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "90% perfect",
      "text": "90% perfect. Very comfortable, great sound, good quality mic and great battery life. But randomly looses connection to the Xbox One X.. roughly one every few weeks.. I switch them off and back on and they are fine. Would love a Bluetooth puck, attached to the controller to adjust the volume settings, like my Astros, rather than having to take my hands off the controller to try and find the controls on the ear cups.",
      "rating": 4.0,
      "verified": true,
      "author": "Scot Gray",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Fantastic quality, especially the Microphone.",
      "text": "My partner has a YouTube channel and I had bought her 3 microphones and none of them sounded good, so I was searching and found these, the reviews said they had a great Microphone, and wow, the mic is superb, no hiss, no background noise just very clear dialogue. The sound on the headphones is also superb, not as good as my Bose, but damn close. If you want good clear sound and voice, you will not go wrong with these!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Procter",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Expensive but worth it if wireless is important",
      "text": "Update - After 10 months I've had major issues with the transmitter with some pretty shoddy support. My review has been updated accordingly. For a premium price product it shouldn't be having after such a short period of time. First things first, it is a high priced headset, there is no denying that. If you are happy with a wired headset stop reading and buy one, you will save at least £150 and get an equivalent sounding headset. If you are wanting a great sounding headset with excellent sound and a smart way to keep it up and running without the need to charge it (twin batteries) then this is perfect. 4 weeks in and I am loving it",
      "rating": 3.0,
      "verified": true,
      "author": "Silk",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Usb c slot for wireless",
      "text": "I've had this about a week now and I'm impressed with the sound. Quality of the build is mainly plastic but it's so lightweight I don't have an issue with it. The durability feels solid. Only thing is the charge on this doesn't feel long. Also unless using the app u won't know how much battery is left. The USB on this is a USB c slot so unless ur pc has one of those take that into consideration.",
      "rating": 5.0,
      "verified": true,
      "author": "Fujiphu",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Nice quality for Nintendo Switch",
      "text": "This is one of the only wireless headsets you can use with a switch and you feed a dongle into the console and link it up. There is no lag or anything and it sits comfortably. The sound quality is fine and there is an on off mic switch and adjustable volume headset. Charging cable is temperamental and the mic is quite delicate. Charge lasts quite a while around 8 hours? just a bit over priced.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Clear sound quality 5 stars",
      "text": "I play online gaming most of the free time, i used many headsets before but the sound quality always bad. I have friend use exactly the same one i use and he always has crystal clear sound. I never enjoyed the sound of the games before, as much as i do now. I never will use the tv sound again. Good sound quality 5 stars The reason for the 4 stars is that when talk to my friends online sometimes they lose me for like a minute maybe or less. I just need now to connect to the tv. Over all I’m very satisfied costumer. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "M.D",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Looks nice, but the connection is terrible.",
      "text": "Good - Looks nice - Comfortable - Sounds good Bad - No battery level indication - Terrrible, terrible connection....terrible. I ordered this from amazon as it was the best reviewed headset out there. I can't think for a minute why. The first headset's sound popped every couple of seconds, technical support weren't able to fix it so I got Amazon to replace it. Unfortunately the second headset did exactly the same thing. I'm really sorry, Amazon but this one is coming back too.",
      "rating": 1.0,
      "verified": true,
      "author": "James ",
      "helpful_votes": 2,
      "publication_date": 20190924
    },
    {
      "title": "Super comfortable mid range sound at a high end price",
      "text": "These are the most comfortable head phones I've ever tried, super light weight. Nice cups, thick and soft. Loved the look and feel of them. The sound is ok but lifeless; no depth at all. If you want any good sound you'll need to install a thirdparty eq software. Very poor bass and when it does come through it sounds rattle-y rather than smooth and deep. Sadly returning these.",
      "rating": 3.0,
      "verified": true,
      "author": "R. HINES",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Almost perfect but one big issue for me.",
      "text": "I really wanted to like these, they were to replace my turtlebeach headset. They sounded really good and they were very comfortable but I had to send them back. They ticked so many boxes for me when I was trying to find a new headset, the only thing I didn’t realise was that they didn’t have any way of controlling the game chat audio separately to the game audio. This got super annoying really quick and within the first couple of hours I got fed up with fiddling with the Xbox and game settings all the time. Perhaps they would work better on PS4 or PC but for me they are just let down by one feature. Shame.",
      "rating": 3.0,
      "verified": true,
      "author": "A. WHITNEY",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Comfortable but disappointed by sound quality",
      "text": "Very comfortable (even with glasses), sturdy and durable headset however, I am very disappointed by the sound quality. This is an expensive headset and it really lacks \"punch\" and bass specifically, even more if you wear glasses as the bass leaks out of the ear cushions (doesn't resonate as well as with sealed cushions) so you basically lose 50% of bass... Note that you need a great sound equalizer software with this headset otherwise the out-of-the-box sound is just too weak... and it doesn't come with Bluetooth! (on the Artics 7).",
      "rating": 4.0,
      "verified": true,
      "author": "Florian",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "More than rubbish!",
      "text": "These were rubbish! I cannot even use the language I would have to describe how incredibly terrible these are. You see, these never operated wirelessly for one, they do not charge and they refuse to sync. These were a valued Christmas present which we spent a lot of money and time on to ensure we were getting a good product for our money and here we are with the typical \"thanks sons crying\" moment. I hope that we can arrange a refund so we can invest in some that work.",
      "rating": 1.0,
      "verified": true,
      "author": "Duckquak",
      "helpful_votes": 3,
      "publication_date": 20190218
    },
    {
      "title": "Can't even go 15 feet away from receiver",
      "text": "I got this so I could go into my kitchen, or answer the door, without having to stop listening to what I was listening to. My kitchen is literally the room next to the one the receiver is in and it cuts out even if I go into there, which defeats the whole point because I could just get a 15foot wire for my wires headphones instead for half the cost. Sound is fine when it works, mic isn't the worst thing ever.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Seymour",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Highly recommend and clear why they won awards",
      "text": "I bought these as my astro a50's are not compatible with my ps4 but I've now relegated the Astros to my backup set as in my opinion these have better audio Base is crisp and clear and even at full volume does not distort, miss and highs come through crisp too and not tinny at all, I like the charging / volume dock and the fact it comes with two batteries so I never have to plug a cable in just simply switch out the battery my only minor complaint would be that they are a little and can start to hurt after many hours of use",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Bambro",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Good all-rounder",
      "text": "For the price this is a pretty reasonable package - good audio quality, good wireless performance, and the chat mix feature is pretty interesting though I don't use it myself. The microphone is acceptable, maybe not as amazing as claimed, but I like the fact it retracts into the headset so it stays out of the way, and it avoids a hinge mechanism which is likely to fail after a few years of use (or a few weeks, in the case of my old Logitech headset). You can definitely find better sounding headphones for the price, but they won't be wireless - you're paying a premium for that feature. For gaming, these are perfectly fine.",
      "rating": 4.0,
      "verified": true,
      "author": "DaveW",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Did not work - had to return for refund",
      "text": "Product description said some marks too accessories. But there was actually a few very minor marks on the headset itself (barely noticeable - nothing that you wouldn't have done within the first week of owning and using the anyway). More importantly however, the headset had a fault in that the battery was holding no charge whatsoever. They would only work if you kept them plugged in. Returned for refund and purchased brand new ones instead.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Avoid if you are a PS4 user",
      "text": "Admittedly it’s my own fault for not doing enough research into this headset, but I am extremely disappointed considering it is marketed as a PS4 headset. The Gamedac included in this product requires your headset to be attached directly to it, and in turn attached directly to the console, which means that you can only be a few feet away from the console at most. This is pointless for a PS4, as a console is attached to a TV which is almost always across the other side of the room from the user. No-one wants to be sat with their nose pressed to the screen and physically tethered to their machine.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "very good headset for gaming however made static noises on first day.",
      "text": "very happy with what I received initially, however after 2 hours of use it already started making static noises, to which I have to unplug and plug the audio jack. i do like this product, maybe I was sent a defective pair. they are very comfortable and for the first time I've worn headphones for more than 5 hours without being bothered (but I haven't worn many headphones) nevertheless, I am going to return these as the static noises occurred more frequently in the second day of use. it is really upsetting that this has occurred on the first day of it being delivered.",
      "rating": 3.0,
      "verified": true,
      "author": "Berkem",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "March 2019 - I cannot recommend them (PC users)",
      "text": "Got my headset yesterday, the look and feel is amazing and they sound great!... expect one small issue. For my set, I could notice a clear volume difference between my left speaker and my right. Doing a quick Google found many people with the same issue. Some report the issue from the Windows 10 Creators Update onwards... Id expect a company the size of SteelSeries to have fixed this by now! (older reports go back 2 years!). Dont bother to RMA them back to SteelSeires either as people have reported getting the same or worse issue back. No known fix. Such a shame for a great headset.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Andrew Stevenson",
      "helpful_votes": 2,
      "publication_date": 20190323
    },
    {
      "title": "Bluetooth needs work, mic hisses, speakers tinny",
      "text": "The delay on Bluetooth is crazy long.. like talking to the moon.. I bought these because of all the great reviews... they are by far the worst sounding headphones I have in the house!.. and you can hear constant mic hiss unless you turn the mic off... the pros are the Xbox integration splitting sound and chat with two volume nobs. but honestly I don’t know what all the reviewers got.. but these are terrible sounding headphones..",
      "rating": 3.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Wireless performance is really good",
      "text": "They are light and very comfortable. Sound is good but not great. I find the default sound on pc to be slightly tinny. On ps4 they are good. Setup wasnt strait forward had to faf about a bit but now they working fine. Mic quality is very good. Wireless works very well. Mic mute function is good as is the blend knob between game sound and chat volume. I recommed these especially at £99.99 Amazon special deal",
      "rating": 4.0,
      "verified": true,
      "author": "Jason G",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Good all round headset",
      "text": "Purchased for £46.00 primarily for use with PUBG on Xbox one X. Great spatial sound, you can hear exactly which direction shots are being fired from. The highs are clear and bass is loud (although not super bassy). Great for gaming. I upgraded from a budget headset. The Arctis 3 is decent for general music listening also. Disappointing that there are no EQ customisation options. The microphone is loud and crystal clear, it doesn't need to be right in front of your mouth as other reviews state! I'm happy with the price I paid, not sure I'd pay anything higher for what is a lower end headset from Steelseries.",
      "rating": 4.0,
      "verified": true,
      "author": "Guy Pittard",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "My son is very happy",
      "text": "My sons headphone at first he didn't want them then read reviews and quickly changed his mind, Just like last pair , he can't hear squat and will certainly not answer me even if he could hear me , for the nine weeks of isolation he's been on x-box morning , noon and night. , but hes loves the headphones with any luck I will see less of him cept when he is hungry.",
      "rating": 5.0,
      "verified": true,
      "author": "ritchie",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "To much going on",
      "text": "I am used to a plug and play, wireless is something I haven't been interested in before. The buttons on left ear are easily hit all the time, muting your mic or playing with volume, then the box it comes with for set up isn't easy to navigate. I've had to re-tune my headset twice and once missed out on playing because the mic was working but the sound was not and it took me hours to figure out why. Its a real nice clean headset, not worth the price in a million years though. My old siberia's wired at half the price were 100times better and no fuss.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "SIMPLY AMAZING, THE BEST.",
      "text": "Sound: Top quality. Especially when you adjust the EQ to your preference. When playing FPS games like Call of Duty, it's like you're in the game and can clearly hear every footstep from left, right, sides, above and underneath. Comfort: To me it's super comfortable. I have a shaved head and with this headset I can't feel it on my head. Convenience: Very convenient as its wireless and can also use Bluetooth connection to hook it up to your phone. Price: Quite expensive, but you do get what you pay for and with this headset you get it all.",
      "rating": 5.0,
      "verified": true,
      "author": "Fame",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Warehouse headphones broken.",
      "text": "It might well have been a great item I bought it from the warehouse and although it said it was very good it came in a scruffy condition and more importantly it was completely broken. They would not work either wirelessly or wired and they would not hold a charge. They were a present for my son he was very disappointed after initially being thrilled. Obviously no one bothered to check them- very unsatisfactory. I contacted customer service they offered me 25% off them or a return, I explained 25% off something that is completely useless but they said they were the only options they had. I suppose it is more about buying from the warehouse than the headphones themselves.",
      "rating": 1.0,
      "verified": true,
      "author": "J Canavan",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Highly recommended!",
      "text": "I absolutely love these headphones for listening to music, media and playing pubg on my iPad Pro. They're lightweight, really comfortable, sleek and stylish. The virtual surround sound is brilliant for those planning to use for gaming. Sounds are crisp and balanced with a rich bass. If you plan to use these with an iPad Pro or other device which has a USB-C port. You will need a 3.5mm to USB-C adapter. Be careful because some adapters can lower the volume. After trying many adapters, I recommend this one, which also allows you to charge at the same time:",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Rogers",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Good quality product, but came with slight damage.",
      "text": "The headset itself is fantastic. Clear audio, comfortable(although took longer to get used to vs other headsets) Microphone is clear as well! The GameDAC is handy and functions as describes also. Unfortunately, it arrived with an open/damaged box, and the gameDAC had some minor scratches, as well as dust on the headset, which leads me to believe it was a returned item and not properly cleaned/inspected before being sold on to me. Apart from that, very pleased with my purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Cheap plastic brakes.",
      "text": "I was happy with these. they sound decent and fit ok. I brought my pair in February and its not October and a crack has happened between the headband joint and the left ear cup. So the left ear cup is loose and close to falling off now So these aren't long lasting headsets (if this is a common problem.) And its not like I abused them or anything. Hell my old Logitech ones lasted me 2 years before the driver in one ear died. So yeah the most expensive headset I have ever brought only lasted like 7 months... I may steer clear of steel series products from now on.",
      "rating": 2.0,
      "verified": true,
      "author": "Phil R",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Good for the price",
      "text": "Sounds quality is good for the price and the earphones are very comfortable. I like the extension cable so I can easily disconnect the headphones however this only has a 2 x 3.5mm jack connection. If I wanted to plug the headset into a single, combined audio/microphone jack the cable would be too short (although would work fine with xbox controller as it is long enough for that).",
      "rating": 4.0,
      "verified": true,
      "author": "Fettlintyke ",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Classy",
      "text": "So I treated myself to this and think it is really nice. The fit is smooth and unnavasive. It's super light and soft on your head. The microphone is super cool and you can use it for calls on your phone which usually isn't compatible with gaming headsets! Very convenient for volume control. Just a all round classy, nice looking, neat wireless headset. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Can't hear my wife anymore lol",
      "text": "Super comfy, great audio (literally can't hear my wife upstairs shouting to me when I have these on.) The charge life is really good. It is rated at 16 hours of usage and I'd say it is about that. Charging is easy. And you can charge them whilst still using them as the cable is more than long enough to stretch. Definitely would buy again :)",
      "rating": 5.0,
      "verified": true,
      "author": "D. Henwood",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "expensive but teenage son loves them and says they work great",
      "text": "ok, so for me the idea of spending this much on a headset for gaming was nuts but i also realise there are plenty more much more expensive ones out there ... and what would a middle aged parent know anyway. So he got these as a birthday present and absolutely loves them, i did stick them on briefly and have to say they are exceptionally comfortable so whilst i'm still not convinced games need this level of investment the recipient was delighted and rates them very highly. He did a lot of research to choose these ones in this sort of price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "All day comfort and good sound quality",
      "text": "There are loads of great reviews for this model of headphone and I don't really have any new info to add to them. If you need a headset with good sound, good wifi range, excellent mic and comfortable even if you wear glasses then put these on your short list. These are my second pair, I liked the ones I bought for work so much I bought a second pair for use at home. My own use is for a home office, lots of long skype calls. The lack of skype integration is the only downside for me but I knew that when I bought these so they still deserve the 5 star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "I. Welsh",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Decent headset",
      "text": "Bought for playing on a Nintendo Switch. Generally really happy with the wired headset, sound and microphone work well (though I'm no audio buff). The fit is really comfortable and the build quality seems good so far. The reason I'm not giving 5 stars is that the write up says the cable length is a decent 3m (one of the reasons I bought this version). However, this is the total length of cabling including the adapter cable for the PC. Hence if you're using the headset for the Switch, the length is just 1.2m. Annoying!",
      "rating": 4.0,
      "verified": true,
      "author": "Andy F",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "My son loved these.",
      "text": "Got these for Christmas for my 12 year old son for his PS4. He does use them with the cable for his phone Iphone 5 and Ipad 4 I think. The sound quality is great and he gets so immersed in his games he can't hear me shouting him (or he chooses not to!). Only little thing I would say is the lights don't work unless they are plugged directly into the PS4 which is only a little thing but it would of been a nice feature to have without all the wires. Overall I and my son highly recommend these headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "goldgirl",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Dissapointing",
      "text": "Audio quality is ok Wireless is great Headband is good but earcups are made of a uncomfortable material that I dislike Battery life is decent however because there is no battery indicators you don't know it's running low until it randomly turns off midgame I also have issues with the wireless drivers not being compatible with some games forcing me to use the headphones wired which is dissapointing Overall I am using them as my daily driver but I would not buy again",
      "rating": 2.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Very light, yet sturdy build.",
      "text": "Very light feel on the head, you sometimes forget it’s there. Sound quality is very good, and don’t be afraid that the speaker cushions aren’t faux leather/leather, they prevent my ears from overheating actually, and gives more of a weightless feel. The cloth material strap auto adjusts on the head, and doesn’t strain or hurt the head over time when in use. Mic gives off overall decent quality voice. I enjoy this headset through and through.",
      "rating": 5.0,
      "verified": true,
      "author": "Proudhusky",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Definitely buy these!",
      "text": "Xbox/PC user. Bought to replace problematic old headset; loved these from the moment I opened the box. Brilliant sound quality (comes in useful for both gaming and listening to music, often at the same time) and supreme build quality. Mic is very good, picks up everything it needs to and doesn't register noise from the headphones like my old pair did. Very comfortable to wear, too; I can wear these for hours on end without sweat or other issues. 10/10 would recommend to anyone viewing these.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "PC sounds being recorded through mic despite being muted/off.",
      "text": "Despite the speedy delivery, the sound quality of the headset, whilst not amazing, was at least passable and something I could deal with. However the headset seems to be having issues picking up sounds from music that i'm listening to EVEN whilst the mic itself is completely muted, mic boost at 0, listen to this device disabled, and stereo mix disabled. The previous headset, The Steelseries Siberia 200 were far better in quality. Not worth the money, try another headset.",
      "rating": 1.0,
      "verified": true,
      "author": "MarcusTherion",
      "helpful_votes": 3,
      "publication_date": 20190118
    },
    {
      "title": "Missing features",
      "text": "Really good headset, however some of the features are stripped away when you use it on anything but the PC 😔, the 7.1 surround is completely gone, you aren’t able to customise the sound profile and the chat mix dial just becomes another volume control dial. Apart from those minor setbacks, the headset is really comfy and light on the head, I have games with it for hours on ends with it and don’t get any discomfort, even though some of the sound features are stripped away you can still pinpoint where someone is when you are playing games like Call of Duty",
      "rating": 5.0,
      "verified": true,
      "author": "Ho Yew William",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Decent headphones but mic output is only average.",
      "text": "A nice wireless headset that at first can be tricky to set up. For the first hour my mic seemed not to be working and then suddenly it started to work and still dunno how! Its comfortable to wear but the voice dosent sound too clear a bit distant at times. Sound coming from the headphones is good. Lasts about 4 hrs before charging via USB.",
      "rating": 4.0,
      "verified": true,
      "author": "M. E. Doney",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "PC sounds being recorded through mic with muted/off.",
      "text": "Firs of all didn't come with any keys for the steelseries software. I am using a pc and every little sound I have goes through the microphone and everyone else can hear it. Nothing helps, no boost lowering, no sound cancellation. Absolute garbage",
      "rating": 1.0,
      "verified": true,
      "author": "Dazzl",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great!",
      "text": "For the price bracket I really love these, the included ‘hub’ is SUCH a nice addition enabling you to divert sound from your pc to your headphones when they’re turned on and to your pc speakers when they’re turned off. The range is immense, nice clear audio which can be fettled in settings with EQ and some other goodies Very well built too, can’t see these breaking any time soon",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Plaisted",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Comfortable, Durable and High Quality!",
      "text": "I got these as a Donation and they are amazing! I don't think there is a comparable headset out there for the same price and the same build quality! They feel strong but light, Sound amazing and having a large range which allows me to walk downstairs and into the kitchen without cutting out or degrading the sound quality! If you are a gamer and have never had a wireless headset, nothing can beat these for the price! <3",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis-Ray Watson",
      "helpful_votes": 0,
      "publication_date": 20191001
    }
  ],
  "product_meta": {
    "title": "SteelSeries Arctis Pro Wireless - Gaming Headset - Hi-Res Speaker Drivers - Dual Wireless (2.4G & Bluetooth) - Dual Battery System",
    "description": "Colour:Black| Size Name:Arctis Pro Wireless| Style Name:WirelessSteelSeries Arctis Pro Wireless - Gaming Headset - Hi-Res Speaker Drivers - Dual Wireless (2.4G & Bluetooth) - Dual Battery System. Arctis Pro Wireless features rock solid dual-wireless technology with lag-free 2.4G wireless lossless audio and Bluetooth mobile audio, combined with 40,000 Hz capable hi-res capable speaker drivers and a Clear Cast mic making it the ultimate gaming audio system. Plus, Arctis Pro Wireless is designed with luxury materials like polished steel and aluminium alloy, and the exclusive Arctis ski goggle headband and Air Weave performance fabric ear cushions. The multi-input wireless transmitter with an OLED screen and included swappable rechargeable batteries make the gaming audio system as flexible as it is powerful. Note: The customer should ensure the latest firmware is installed Note: The customer should ensure the latest firmware is installed\n\nBOX CONTAINS\nHeadset, info guide, cables, wireless transmitter, batteries",
    "rating": 4.4,
    "feature_bullets": [
      "Dual-Wireless technology provides rock solid, 2.4G wireless lossless audio for gaming, combined with Bluetooth connectivity for mobile devices",
      "Premium Hi-Res speakers with high-density neodymium magnets reproduce a full, expansive frequency range from 10 - 40,000 Hz with stunning realism and clarity",
      "Luxurious polished steel and aluminum alloy construction offers maximum durability and a consistent fit",
      "Two included swappable batteries allow you to charge a battery in the base station, while using the other for more than 20 hours of gaming",
      "Widely recognized as the best mic in gaming, the ClearCast microphone delivers studio-quality voice clarity and background noise cancellation",
      "The Year that is on the product is manufacturing Date"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Batteries": "2 Lithium ion batteries required. (included)",
      "Rated": "Not PEGI rated",
      "Product Dimensions": "16.63 x 8.99 x 18.71 cm; 687 Grams",
      "Release date": "1 Jan. 2020",
      "ASIN": "B07B819VMQ",
      "Item model number": "61473",
      "Delivery information:": "We cannot deliver certain products outside mainland UK ( ). We will only be able to confirm if this product can be delivered to your chosen address when you enter your delivery address at checkout.",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Gaming Headsets",
      "Computers & Accessories",
      "Accessories",
      "Mac"
    ],
    "price": 372.39
  }
}