{
  "website_summaries": [
    {
      "verdict": "This inexpensive rearview mirror screen is a great way to retrofit your vehicle with a backup camera.",
      "pros": [
        "The rearview mirror operates as a touch screen, which allows you to switch cameras",
        "A front and rear camera are included in the package",
        "Automatically switches on when you go in reverse",
        "Installation is easy",
        "Fits over your existing mirror",
        "Records while driving and can record when your car is off",
        "Bigger than many pre-installed mirrors",
        "Clear picture on the camera"
      ],
      "cons": [
        "The screen can be hard to view in the sunlight or daytime hours",
        "It also does not automatically show the backup camera full screen"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Amazing Quality, easy installation, parking back up perfect, and monitor dashcam awesome",
      "text": "Really good product and excellent quality. Cheap price for the quality. I do install this in my cargo ford transit connect van. And is working perfectly, is monitoring for teaf, fron and back up vamera. Also is perfect for the parking, you will happy with this",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael S.",
      "helpful_votes": 15,
      "publication_date": 20181016
    },
    {
      "title": "A very bad product with too much flops!!",
      "text": "This item is not sensitive to current date and it often misread data. It is a very bad product. I think most of the reviews are fake because that was why I bought the item. The image quality is bad and most of the settings are misrepresenting. I will advice buyers to stay away from this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Co",
      "helpful_votes": 5,
      "publication_date": 20200106
    },
    {
      "title": "Rip Off",
      "text": "Its ridiculous that there isnt any instructions included with this product. I don't know one thing about wiring and electronics or cars for that matter and they expect me to just know how to hook up the camera. After a lot of independent research I discovered I am going to have to remove my tail light and remove the reverse lamp light which I dont feel comfortable doing myself because I might wind up with no camera and no taillight. This means I have 2 options which are either pay a lot of extra money for a mechanic to do it for me or send the camera back. Rip off.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200218
    },
    {
      "title": "Works good",
      "text": "Works for me as a backup monitor. Installation was easy and painless.I spliced the rear view mirror cam into my back up lights positive side and the reverse feature works as advertised.The front camera clarity is fine. Clear and clarity is great. The back up came is a less than impressive. The rear cam is very helpful when i parking my car.The touch screen is easy to use and this is the feature I love best. Nice cam, I love it, Would recommend it to anyone who is looking for a backup camera what is less than $40. Worth every penny that is spend on this backup camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20181025
    },
    {
      "title": "Toguard BackUpCam",
      "text": "I ordered this back in March, but just had it installed today, works like a charm. My install guy asked me where I got it and said that he had installed several other backup cams from amazon but because of the brand they were in essence garbage and the quality of those cameras were bad. I like how clear the resolution and how effective and easy to understand the instructions were, even though I didn't personally install this myself, based on all the previous reviews its definitely worth the money and the quality is up there with the higher price merch.",
      "rating": 5.0,
      "verified": true,
      "author": "ashley Robinson",
      "helpful_votes": 3,
      "publication_date": 20191026
    },
    {
      "title": "GHOST COMPANY",
      "text": "ZERO PRODUCT SUPPORT from TOGUARD MIRROR CAM COMPANY. NOTHING. AMAZON: 5 stars for help with bad purchase. TOGUARD: 0 stars. ZERO. Website offers no way to make contact for help or info. Email attempt got ZERO RESPONSE.",
      "rating": 1.0,
      "verified": true,
      "author": "haruyozkid",
      "helpful_votes": 6,
      "publication_date": 20190404
    },
    {
      "title": "Good with a few quirks",
      "text": "Its great for recording footage during the day. I have two major complaints: The backup camera cannot be flipped from the software. frustrating because it is so basic of a feature. My other complaint is the night time footage is grainy and borderline useless. Now some info: the backup camera records constantly. The actual mirror is a little tinted and hard to see in. Overall its a good product. i may buy another for my other rig",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180624
    },
    {
      "title": "Affordable solution to add a backup camera to any car!",
      "text": "This is a great solution for cars that don’t come with the backup camera installed. This kit came with everything needed and it’s neat that the mirror just fits on top of your factory mirror. The picture is clear and easy to use — neat that this unit offers both front and rear cameras. We really like this unit and it was very affordable!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric C.",
      "helpful_votes": 5,
      "publication_date": 20181120
    },
    {
      "title": "Rear Camera Doesn't Last",
      "text": "I purchased two of these for both of our vehicles and the rear cameras stopped functioning within a week of each other after only two months following all the effort to install. The front cameras are still working, so I contacted the seller in an effort to obtain at least a partial refund considering I only received half of the product and essentially just received the instructions and suggestions that came with it in the first place and that's it.",
      "rating": 1.0,
      "verified": true,
      "author": "ITStudent613",
      "helpful_votes": 5,
      "publication_date": 20190713
    },
    {
      "title": "It’s great.",
      "text": "It is a friendly dash cam. I was spending more than 2 days test it. Video recording at 1080p looks great, especially in bright sun,cloud and night, and it does a fantastic job of recording audio inside the car and installation of dash cam is straightforward and fairly easy. It is automatically turns on/off when your car charging port powers on/off, so there’s not a lot of work involved once you have it installed. Many languages to choose from.",
      "rating": 5.0,
      "verified": true,
      "author": "Zhouzixiang",
      "helpful_votes": 4,
      "publication_date": 20180620
    },
    {
      "title": "720p front and VGA back camera in 2019",
      "text": "I wanted to return this but after that much work on my car removing trims and slicing reverse light wire, I guess I'll just stick till it breaks. I have an older Yi front dashcam that I wanted to replace since this comes with reverse camera but super disappointed with the video quality of only 720p. And I have to unplug the reverse camera to get into 1080p, well that's the whole point of me getting this unit, it's for the reverse camera. The older Yi dashcam takes superb 1080p even at night time.",
      "rating": 1.0,
      "verified": true,
      "author": "fred",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Not my fave, returned...",
      "text": "Found it difficult to operate, and since the mirror fits on top of your existing mirror, it was odd that the camera was placed on the back which practically sandwiches it on top of the mirror, blocking some of the camera lens.",
      "rating": 3.0,
      "verified": true,
      "author": "Brie Gifts",
      "helpful_votes": 3,
      "publication_date": 20180701
    },
    {
      "title": "Good camera for the price!",
      "text": "This is a very good product for the price. The installation was relatively easy and everything works as advertised. There are some changes I would like to see, perhaps in new versions of the firmware: 1. You should be able to disable start-up and shut-down sounds. 2. You should be able to set a default view for the display. I would rather not have the Picture-in-Picture as the default. 3. I wish the clock could be set to 12 hour mode instead of 24 hour mode. Other than that I like the unit very much.",
      "rating": 4.0,
      "verified": true,
      "author": "Commodore Primous",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Both froent and rear cameras stay on 100% of the time",
      "text": "I purchased an extra 29.5FT power cable for my rear camera. The Toguard charger (output 5V 2.6A) can power both front and rear camera without any interruption. I have used this Toguard dashcam and Soekoa power cable for three months. I have been very happy with both products. I don't power the reverse light since I don't want to mess up my old vehicle. The touch screen proves to be very helpful than the other brand. Both price and product quality and design are very good. Here is the backup power cable I purchased from SoeKoa. Backup Camera Cable, 5Pin to 2.5mm Jack Cable Connector Video Extension Cable, DVR Video Cable for Backup Camera Mirror (9M/29.5FT)  by SoeKoa",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Seetao",
      "helpful_votes": 6,
      "publication_date": 20190309
    },
    {
      "title": "Great cameras at a great price!",
      "text": "This worked really well. The picture quality is really good and it certainly gives peace of mind to know that my nephew has a little extra help backing up and the dash cam is extra bonus! It took us a bit of time to figure out how to hide the wires for the backup camera in an old Explorer but once we figured out how to pull the cover panel, it was a breeze. YouTube helped! I am ordering another one of these today for my other nephew’s car!",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi R.",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great Product,Great Customer Service!",
      "text": "Starting with the dash cam itself, I'm overall pleased with it. The video quality is OK, and the touch screen interface is easy to use.Easy to install. Very small and stealthy. Easy to use. This is my first dash cam. I reached out to the seller and company. They responded very promptly and with a detailed reply on things I can do to get it working. Overall I'm extremely happy, and definitely will recommend it to anyone who is looking for a good dash Cam.For the price, I still think this is a fair purchase. Love this rear view mirror cam setup. I would just hope in the future that we have an option for an upgraded camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "50-50 chance of working product",
      "text": "I was fine with overall quality of product,but item broke down literary on 2 nd day. As soon as item powered up it shows video from back camera. Video is all blurred,tried to fix-no luck. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Bakhrom",
      "helpful_votes": 3,
      "publication_date": 20190315
    },
    {
      "title": "Pretty amazing actually and easy to set up",
      "text": "So I had no idea what I was getting into when getting this product. I didn't know how to do any wiring what do ever and was honestly just a little scared. The instructions weren't very clear in what you had to do so I did some research on my own and cut part of my break light wire and put in the reverse camera wire I was really scared that I messed the whole thing up but it worked flawlessly. I just wish the wire was a bit longer cause now the wire is visible through my car but over all amazing!",
      "rating": 4.0,
      "verified": true,
      "author": "awesome",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Sleek, slick and affordable!!I",
      "text": "This is my go to setup as I enjoy older vehicles that don't have the in dash display option. I'm a claims adjuster for a major auto insurance company and the evidence this unit provides is priceless. Great value. Now I have piece of mind that I can avoid the arguments that many deal with trying to prove a liability case. This unit arrived quick, well packaged and with easy to install directions. The pricepoint of this unit is key. Handle the job I need and understand I have bills to pay. Very affordable. The rear mode camera allows me to monitor my trailer while hauling items that could shift in transit.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Great product!!",
      "text": "This camera is awesome! I’ve had several dash cameras and so far this is the best one. I haven’t hooked up the backup cam yet. It’s easy to work and is very clear. The box it came in was like a iPhone box good quality to protect the product. I thought the dash cam would be a little cheap looking for the price I paid compared to all the hundred dollar ones that look like it. It looks good and the quality is there. Looks no different than the expensive ones. I see this will be good for gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "1",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Excellent. I would recommend to anyone.",
      "text": "Got this for my 98 Grand Cherokee. Easy to use and great for insurance claims and video surveillance for evidence. Holds 32GB of data with micro SD card. Easy installation and you can easily hide the wires to make it more permanent after you install an internal cigarette lighter under your dash panel. I loved it so much I bought 2 more. One for my Dakota and one for my Mustang.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Vybiral",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Good Dash Cam for the price",
      "text": "Picture quality and installation are overall pretty good. The only downside of this product is that you can only adjust the camera angle physically. Therefore, when you place it on your rearview mirror, your camera is always aiming at an angle slightly to the right instead of striaght ahead. Just imagine how is your rearview mirror is positioned in your vehicle for the driver to see the back view of the car and you will know what I meaned. Again, you are paying for what you get. I am sure some other dash cam will allow you to adjust the camera shooting angle but certainly you will be paying more money than you are paying for this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Bao",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Not Well built.",
      "text": "After few months of using it. I finally got to review this product. Item arrived on time, package was good and the wires were long enough for a sedan. Easy to install with clear instructions. After 7 months of using and installing it, its stops recording and will turn off suddenly. And dash cam wont record at all. I did not used the back up camera because my car got one. After a year of using here is the results.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerald A.",
      "helpful_votes": 2,
      "publication_date": 20190320
    },
    {
      "title": "Cheap POS",
      "text": "It works like they say but within a week it started separating then 6 months later it would no longer read a sd card. It's a cheaply made product. You get what you pay for. Next time I will go higher end.",
      "rating": 1.0,
      "verified": true,
      "author": "5'star",
      "helpful_votes": 4,
      "publication_date": 20180930
    },
    {
      "title": "Double Vision!!?!?",
      "text": "I haven’t been able to install the back up camera myself yet so I’ve been driving around for a couple weeks with the mirror mounted. I’m struggling getting past the double vision of the mirror. I have to close one eye to see the images and it’s really irritating. Front camera works great, clear & nice wide view. I will update my review if I install the rear camera.",
      "rating": 3.0,
      "verified": true,
      "author": "AngR",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Updated review",
      "text": "Shuts off constantly while driving. Back up view cam stopped working shortly after we purchased it. Haven't even owned it 6 months.",
      "rating": 1.0,
      "verified": true,
      "author": "m. york",
      "helpful_votes": 3,
      "publication_date": 20181222
    },
    {
      "title": "Good product",
      "text": "I purchased one for me and one for my brother. I had a Dash Cam that suctioned to your front car window. It worked fine but it would loosen and I would see videos of the sky. One issue is that the rear camera needs to be wired to a reverse light in the back of the vehicle. It would be much better if the rear camera was wired into the front somehow.",
      "rating": 5.0,
      "verified": true,
      "author": "King",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Night vision",
      "text": "Problem is night vision ...It’s very bright and can’t see clear if anything in like any vehicles or people or animals in the accident. Impossible to show proof to the police situation. Very bad ....and don’t don’t buy it. Not worth for your money go waste ...",
      "rating": 1.0,
      "verified": true,
      "author": "Sandra Goulart",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Nice camera",
      "text": "I really actually like this camera. My friend bought one and loved it so I got one also, super easy to set up although I didn’t hard wire the back up camera yet but you can still use it without hard wiring it. The camera quality is what you would expect for the price. But I’m really liking it so far menu is super easy to navigate also.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany ",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Problem resolved, camera replaced by manufacturer",
      "text": "Crazy camera, the rear view only works some times. I need to turn of and on multiple times to make the rear view image to come, otherwise it is only the front Update in Nov 7th Been exchanging emails with the manufacturer and they want me to first change my review to 5 stars BEFORE they resolve my issue ! Ridiculous customer service After some discussions, the manufacturer sent me another device free of charge. So, problem solved !",
      "rating": 5.0,
      "verified": true,
      "author": "Julio",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "not 1080 if you use front and rear camera and it does not have night vision",
      "text": "Picture quality is poor because it is only 720 when you use both cameras which I would not have bought it if I know that, for the money it is a deal. It does not have \"night vision\" it has what they call \"enhanced night vision\" that is a little misleading it should say \"enhanced night recording\" using the word night vision makes you thing it will record in the dark, night recording is poor more so at a set of lights.",
      "rating": 3.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Works fine at factory settings",
      "text": "Works fine at factory settings, when we choose different options like parking recording, 3 minute file recordings, lock files etc, results in many damage files Take in count that works at 1080p just with the front camera, when it records both cameras resolution is forced to just 720p My recomendation, Use just at factory settings",
      "rating": 4.0,
      "verified": true,
      "author": "Paula Laguna",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Poor recording quality",
      "text": "For $35 buck, the quality is not that great for day and night recording. I do like that the screen is on the right side of the rear view mirror, less distraction and not blocking my view using the mirror to look for cars behind me. The 2D glass not as clear as a real mirror. Due to the poor recording quality, I returned it after a few weeks and purchased the KDLinks for $150, much better recording quality (to catch the license plate of those hit-and-runs).",
      "rating": 2.0,
      "verified": true,
      "author": "C. M.",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Great Value for the price!",
      "text": "Best gift I got for my husband. Easy to install and so much fun to be able to see the scenery when road tripping. And for safety reasons in case something happens on the road ahead of you you can prove it on camera. Good quality for the price! The only thing you would have to take into consideration is that it has to be connected with the wire to the car outlet at all times. And sometimes it would turn off out of nowhere, so make sure to turn it back on if you want it to record at all times.",
      "rating": 4.0,
      "verified": true,
      "author": "Sa",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Rear camera guidelines problem",
      "text": "This is a good front view camera. It's easy to install and operate. Good picture and video playback as well as good customer service when I reached out to seller. My problem with this camera is the guidelines for the reverse camera in the rearview screen cant be adjusted up or down. This makes the rear camera useless for judging how far you are to a car or object behind you. This is a big deal.",
      "rating": 3.0,
      "verified": true,
      "author": "Ky",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Pleasantly surprised",
      "text": "I was skeptical at first about this dashcam since most over-the-counter dash cams cost pretty much anywhere between 100 to $300. It was extremely easy to install, however I have not yet tried to install the rear dash cam yet since I am not that mechanically inclined and will probably opt into having someone install it professionally. It is practically a dashcam in Disguise since having it installed over the mirror makes it seem as though there is not a dashcam in the car at all. I used a flat head screwdriver to hide the power cord in the trim.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Nice product but......",
      "text": "This could be the best product you can add to your vehicle only it is works as it suppose to! My issue is that the device keeps freezing and restarting on it own at least twice a day for no reason! Also while screen saver is on, the device screen turns on all the sudden as if I touched the screen to wake it up!! Very disappointed !!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tatsiana",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "Careful with install, tapping into the power source.",
      "text": "Constantly telling me to remove files or reformat the card. I cannot figure out how to stop it from locking files. Still worth it for the price and was not difficult to install... One caution though. Be careful with newer cars splicing wires for the power (to use as a backup camera) can trip the computer, and cause some headaches. You need a special tap in to avoid this problem. It still works as a recording device without the backup camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Harmony Lowry",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Overall a great buy!",
      "text": "I was a little disappointed for having to buy an additional cable for a truck, my opinion would be to make the cable the same length for all purchasers! Also, it starts recording every time I start my truck. And sometimes locks up and restarts. Otherwise it seems to be a great product and pretty easy to install and use.",
      "rating": 4.0,
      "verified": true,
      "author": "PG615",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Good Product with good image quality",
      "text": "This rearview mirror is indeed everything it said it has a good image quality and the handy features such as loop recording and parking monitor which can produce a short video if some touches your car. The only downside is that it doesn’t come with an SD card. Packaging was adequate and installation straight forward if you’re a little technical and used to DIY automotive jobs.",
      "rating": 4.0,
      "verified": true,
      "author": "John Blijd",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Power cable broke after 1 month",
      "text": "I was not pleased with this product. It made my rear-view very shaky and difficult to see. The power cable broke within a month and it is useless without it. The internal battery lasts literally 5 seconds. I was going to return it but my friend sat on it and squashed it. Glad I didn't go through the trouble to install the backup cam but I do wish I had my $40 back.",
      "rating": 1.0,
      "verified": true,
      "author": "Snarf",
      "helpful_votes": 2,
      "publication_date": 20190401
    },
    {
      "title": "It was so easy to install",
      "text": "I have other dash cam but they have small monitors. This one has a big and clear monitor. The power cable is long enough to go around the dash, so as the cable for the back camera. It was so easy to install. Just attach the rubber band that came with it, plug the cable to your cigarette lighter and you're good to go. The moment you turn on your key, it will start recording right away. The touch key makes the mirror seamless. Don't forget to buy a 32 GB card because it doesn't come with it like what in the description say.",
      "rating": 5.0,
      "verified": true,
      "author": "ADS69",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Item is Trash",
      "text": "I purchased the unit on May 27, 2020. delivered May 30, 2020, and installed June 2, 2020. for 2 weeks unit is working fine then I encountered a problem on June 18, 2020. I tried rebooting but still, the issue persists. I did not connect the backup option (the red wire) on this camera as my car has a built-in backup camera. I would like to get a replacement for this unit or a full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Jose M.",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Easy to install",
      "text": "This is the first dash camera I purchased, and it was very easy to install. The wires are long enough for my SUV, so that they can detour around the car without needing to expose much wires. The touch screen and functionalities are very user friendly. And it starts recording as soon as I start the engine of the car. I would recommend the dash camera to anyone, especially first time buyers.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "A lot of problem! Need quality control",
      "text": "Bad quality,Blurry image and video quality from The dash cam, very hard to install, some parts doesn’t fit and not as described. Night vision very dark, can’t really see anything. It is not anti glare mirror. Worst thing is that the touchscreen is not responsive. Not satisfied",
      "rating": 1.0,
      "verified": true,
      "author": "BeNiceToMe",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Awesome camera",
      "text": "Perfect! Way better than the more expensive dash cam I purchased a year ago. Install was easy. Just need to get the extension cable so I can hide the wire for the rear camera. For the money you can't beat this dash cam. Update: any problems the seller is very responsive and was willing to help me out with everything I needed. Amazing customer service. I highly recommend this dashcam and this seller. Great experience.",
      "rating": 5.0,
      "verified": true,
      "author": "bigkev",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "I wish I returned it",
      "text": "Touch screen worst. It won’t work when I double tap or single tap. I need to put a hole to my car and now it’s not working properly. It’s freezing all the time. I need to reset like 2 times per trip. Do more research before you buy this product",
      "rating": 1.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "VAN TOP 5 star quality mirror dash camera for your vehicle",
      "text": "The VAN TOP H609 mirror dash cam is of excellent quality materially and is good value for the price. It took me less than an hour to install it on my vehicle. I opted to have the backup camera always on which is really cool seeing both front and back camera recording while driving. You can manually switch views especially when you are backing up. The resolution is very good and the menu are very user friendly and self explanatory. I did not even have to read the manual. All in all you cannot go wrong in buying your this mirror dashcam. 5 star all the way",
      "rating": 5.0,
      "verified": true,
      "author": "FERDIE ZABALLERO",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Does its necessary job.",
      "text": "I needed a camera for recording and this gets the job done. Although at night, the quality is horrible. You can't see much but the lights and glares. You can't see license plates unless you're really up close. Although over time I notice it lag and have trouble with videos. It's always recording in my car and recently I realize it didn't record a specific timeframe, but then popped up a minutes later. I've been getting skeptical about it, might invest in something better.",
      "rating": 4.0,
      "verified": true,
      "author": "April Palencia",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "AMAZING!",
      "text": "I Love this product! I got this dash cam because there are so many crazy drivers out there and you never know what could happen! I have an almost 2 year old in the car most of the time and I want to take every precaution I can to make sure he is safe! The quality of this Dash cam is amazing, the camera quality is great, the touch screen is like a smart phone! I am in love!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Much Better Design",
      "text": "This is much better design than the other Blue Tinted models and much easier to program with the touch screen. Have not reviewed the video but I wouldn't think it would be any issue given all the other improvements. Cable provided was long enough for an 02 corvette.",
      "rating": 5.0,
      "verified": true,
      "author": "tracker4x4",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Don't waste your time and money",
      "text": "Unfortunately as this is my first dash cam experience is a bad one.First off the the touch screen is out of touch ,second the sd card I purchased was compatible with this product and it does not even read it .The product is a mess it doesn't even turn off it keeps restarting then it freezes ,mind you I only had this product for an hour ....very very upset I hate returning items",
      "rating": 2.0,
      "verified": true,
      "author": "Junior",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Good recorder",
      "text": "Work just as description I had old model I used for years and this is an upgrade. The recording actually will auto dim it and touchscreen was working properly the only thing is I still have to figure out how to set up the back camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Low",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Great buy for the money!",
      "text": "The quality of the camera is amazing! Super clear!! The touch screen could use a little upgrade because not always it reacts when I touch it. The instructions could be a little more dummy prof because is not that easy to understand. I cannot leave a review about the rear camera capability since I did not installed it on my car.",
      "rating": 4.0,
      "verified": true,
      "author": "annubis",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Service and quality",
      "text": "Company service is the best, the cable that came with the device was a little short for my car, I contacted the company and they send me a new longer cable at no cost at all, the camera work as promised and the image quality is real good. Thank you guys",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Ramiro Bustamante",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great mirror, great customer service, video works well",
      "text": "I am very please by this mirror-cam. Both cameras produce good quality pictures, the setup is super easy, and I can see clearer now, than with my original mirror. Some pleasent surprises (at least they were a surprise to me) include: - included an anti-glare finish for nighttime driving - bigger than I expected, which is great since the mirror on which its mounted, is very small for a truck. - great customer service! The cord that came with the camera was just a little too short for my pickup. The seller reached out to me to offer help!",
      "rating": 5.0,
      "verified": true,
      "author": "Martin R.",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "FAULTY PRODUCT - DOES NOT WORK AS PROMISED",
      "text": "I ordered this and The first product delivered was faulty. Worked with the Toguard team. After 5 days of email exchanges the Toguard team sent replacement product. Even that turned to be faulty. Very frustrated with the product. Assembly took 1 hour.",
      "rating": 1.0,
      "verified": true,
      "author": "Smriti Apte",
      "helpful_votes": 2,
      "publication_date": 20190415
    },
    {
      "title": "Junk from China",
      "text": "Good thing i got a protection plan because ive returned 3 of these now. Thing worked for 6 months before it completely and utterly failed on me. Refuses to charge no matter the power source.. If you don't want this garbage to end up in YOUR garbage, don't buy this piece of junk..",
      "rating": 1.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "A great product, the TOGUARD.",
      "text": "My experience is pretty good, the backup camera is a great product. Pros: Good price Good image quality Easy to install Cons: Sometimes the rear camera shutdowm itself, and I have to turn it on again manually. For the rest I have no complaints, very good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Elvyn Villanueva",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Looks good to start - doesn't last long",
      "text": "Product seemed to be good quality out of the package. Installation and setup was easy. Worked good for about two weeks, then started not starting right away, stopping intermittently then would not come on at all. Tried to reset it, warm it up in the house, nothing worked to turn it on. Not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Kems",
      "helpful_votes": 2,
      "publication_date": 20190203
    },
    {
      "title": "Its a good basic dash cam",
      "text": "The parking sensor is VERY sensitive, Ive had to turn it down to the lowest setting. It would fill up the memory card in 2 days, even in my garage lol. Hopefully I never need to see how it works locking video in an accident.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald Johnson",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Works great.  Easy controls and good visuals.",
      "text": "The camera takes good videos and pictures and the controls are intuitive. The dual recording of forward and reverse cameras is great. The forward camera/mirror installs very easily and is stable. Routing the wiring to the cigarette lighter is straightforward and works nicely to power on the camera when the vehicle starts. The installation of the reverse camera can be difficult depending on the nature of your car and the interior panels. If you have a minivan, you will need the longer cable. Overall, this is a great dash cam/rear cam and a real value.",
      "rating": 4.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Front and back camera included.",
      "text": "The back camera could use a little help with the resolution but overall this product is well worth the money. There is nothing that compares in this price range for sure. It is easy to install. Took me 15 minutes. Gives you an instant sense of security while driving. So for so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph D.",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Very Easy to Install!",
      "text": "Not to bad for the price that it cost, camera quality is all right. A little blurry in some parts of the screen but overall you can still see the image just fine. And installing the device was as easy as cake! even my mother could do it on her own, that's how easy it is. I feel lots of safety when driving while the device is in use, as it can capture all that is going on in that current moment. Even when I have my car park I will be able to know who might have left a scratch or dent in the car. In my opinion, this was a fantastic purchase for my car.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Sanchez",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Good quality picture at a great deal!",
      "text": "This is my first dash cam installed and I am very happy with it so far. Loved the quality of video. The best part is that the existing rear view mirror doesn’t have to be replaced. Just a couple of minor things - because it can be attached on the top of existing mirror, it doesn’t align with the mirror at the back because of the camera, but that’s totally fine with me. And the relective surface could have been slightly better. Overall a very nice product!",
      "rating": 5.0,
      "verified": true,
      "author": "Nimish Surve",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "The manufacture company does a good job of reaching out to  their customers.",
      "text": "Backup camera is not working in Reverse. And the The unit is Continuously shut in off. So The manufacturer contacted me and sent me a replacement. The new Unit works better than I expected. I Would love to give it 5 stars but The 1st unit was very disappointed. The manufacture company does a good job of reaching out to their customers. To help any way they can.",
      "rating": 4.0,
      "verified": true,
      "author": "Sylvester Hardeman",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Best for the money. Should be $100!",
      "text": "Got this for my husband for his birthday. it looks so expensive and performs the same. What a steal!!! He loves it as well and couldn't believe when I told him the low price. Matter of fact, I'm going to order the same one for my car now :)",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Franks",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Good quality but difficult to install on large trucks",
      "text": "Good product just didn’t come with enough cable for my f250. It’s been a mission to find the right extension cable. I’m on my 2nd one and I still can’t get it to work. Camera powers on but no imagine on the screen.",
      "rating": 4.0,
      "verified": true,
      "author": "Juan Rivera",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Great Camera",
      "text": "So I purchased this camera for a tow vehicle for our camper. We wanted to make sure we were videoing everything while we were towing. This camera works perfect for that. We don't use it on a daily bases but we have had no issues except setting the G-force lock. It is very sensitive. When we closed the doors on the truck, it would set off the G-force lock. We had to turn that feature off. We are not using the back up camera function at this time.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Battery very poor....",
      "text": "I plug in the camera and it always dies while it's plugged in and when you dont plug it in it'll just go on and off repeatedly. It's annoying hearing it go on and off even when it's not plugged in it still goes on then off over and over again. Unless it's plugged in and when it feels like, then it's ok...other than that, not really impressed with by it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Nice product, picture ease of use!",
      "text": "The mirror and front camera are very easy to set up out of the box. The rear camera setup directions need some enhancements. Connecting wires to the backup light wiring sounds simple enough but to those of us with marginal skills in this area may be left totally confused. Maybe some examples of how/where it may “typically” be installed.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaneo",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great customer service",
      "text": "Had to return the first one because the rear camera stopped working. No problems, and the replacement came in 2 days. Had a question about installation, and the seller sent added instructions and followed up to make sure I was happy. The product works very well. I recommend this product and the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Bulka",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Good product, great customer service!",
      "text": "We were delighted to find this excellent camera system at such a reasonable price. The instructions were easy to follow, and when we did have a question, the seller's response was fast and helpful. We don't see a downside, except that we live on a very rough road, and we're wondering how well the mounting adhesive is going to hold up, but time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "A J Barrett",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "easey to set up",
      "text": "It seems to work very . I just got it yesterday . Installation was so easy I could not believe it. It took me about 10mins. The video is very good. I'm very pleased with it. Keep up the great quality of your products. I would buy again. pop",
      "rating": 5.0,
      "verified": true,
      "author": "rmpop",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Beatiful",
      "text": "I like the way that the camera looks in my car, elegant, useful and overall it is protecting my car. The mirror itself present the screen that is responding quickly to the contact shows HD pictures, it is like having a HD TV in your car. Back camera helpful totally. I don't have anymore problems to parking backward. Great product for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "victor",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Very good dash cam.",
      "text": "Easy to install, looks good on the mirror. It has a clear picture that has a a three 30s, 1 min, and 2 min screen saver. When it goes into screen saver mode it has a clock. I have not mounted back camera as I need the longer cable for my F150. Overall very pleased. Touch screen not as sensitive as I would like it.",
      "rating": 4.0,
      "verified": true,
      "author": "uasfrsq",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "I was super pleased with this dash cam  Great car camera you get more them u paid for.",
      "text": "This camera is great for the money its clear and it works really great I love it its so worth the price I am very happy with how well it works and its night vision is better then I expected. The backup camera works really great he helps aid me when parking its a fantastic product.will buy for my friends as gifts. It’s so worth the money; I’m happy with this product’",
      "rating": 5.0,
      "verified": true,
      "author": "BossREDD",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Works fine",
      "text": "I wish I would have known that it doesn't record in 1080 with both cameras at the same time. I would have got a different system. But, everything seems to work fine. Easy install.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin H.",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "China garbage",
      "text": "China crap. Reverse cameraworked fine for one day. Now when you put it in reverse the lights come on for the camera but the mirror doesn't recognize the camera anymore. Garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael D.",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Easy install",
      "text": "I was browsing Instagram when I was shown the amazon prime ad for this dash cam. The installation of the dash cam and rear view camera was a breeze. The provided length of video cable was enough for my kia soul. The camera quality of the dash cam and the rear view camera is effective. I recommend this purchase to anyone wanting the vigilance when driving without the high price of an expensive dash cam kit.",
      "rating": 4.0,
      "verified": true,
      "author": "edgar chavez",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "No hassel to set up.",
      "text": "Super easy to install, it took me less than 30 min to do it. I didn't even need to remove anything from the vehicle. I was able just to hide the wire really well. It does what is says it does. really good price for the peace of mind that you might have if you don't get it. I bought one to try and ended up buy two more to give as a gift to two family members.",
      "rating": 5.0,
      "verified": true,
      "author": "Dasilva",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Driving made safe and secure! Buy it now!!!",
      "text": "Amazing addition to my car, for the price and quality, win win!!! i got all my friends and family purchase this too. we simply love it. hd quality videos, easy to install. thank you Toguard!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris L.",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Half and half in the day it is great.",
      "text": "The camera was clear and wide @ night very dark on country road. It would be nice if the camera had date and time display on the mirry, if some thing should happy you can go back by looking at the date and time. I didn't used the rear view camera.",
      "rating": 3.0,
      "verified": true,
      "author": "Mama Eve",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "HD camera",
      "text": "Works great. The mirror looks great, camera takes great video, and it's very easy to operate. My only 2 issues are that the camera lens could be slightly more adjustable. With the mirror in some positions it's hard to get the camera angle correct. And secondly there should be an option to not have the options screen come on when the car starts. It's not a big deal but you do have to turn it off before you can use the mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "meilingwang",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Trash trash trash trash trash",
      "text": "I gave it a star only because you have to. Complete trash the shape is disgusting right out the box my backup camera was never an option. Please don’t buy keep your money! Installed just to take out! But the good people at Amazon got me a nice upgrade for the inconvenience",
      "rating": 1.0,
      "verified": true,
      "author": "Bad Johnson",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Well-designed mirror unit and good quality",
      "text": "Initial impression after install: super easy to set up, the instructions are easy to follow, and the mirror is well-designed, not too bulky. There was plenty of cable length to conceal all of the wiring behind interior trim. I was surprised how well the touchscreen works. It's not too bright so it's not distracting while driving. I haven't had it for very long, I will update the review if problems occur or more praise is due.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Scheppelmann",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Unbelievably good deal.",
      "text": "These work better than the the product information list repprts. And the mevhanicc that put it in did it fur $120 which was more than i thought it would be yet every wire is where it need to be and concealed perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "GregoryWarrenGalloway",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great product at a great price.",
      "text": "Easy to install and great video quality. Exactly what I was looking for and at such a low price. Like the dual screen display on the rearview mirror and how I am able to switch from the front to rear camera view easily. Worth the money spent in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Freezes 40% of the time",
      "text": "Good camera and image quality, but it freezes frquently and restarts out of nowhere, also sometimes when I shift to reverse screen turns black before restarting.",
      "rating": 3.0,
      "verified": true,
      "author": "A.J",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "The rechargeable battery doesn't last long.",
      "text": "The rechargeable battery doesn't last long. My battery died in two months. The picture quality in the front camera was great, but the rear camera was not too clear when it starts to get dark, especially at night, couldn't see much in the rear. Not a true Night vision. The video recording does not loop in a continuous mode as the book said it would./ I had to keep taking out the SD card card and reinsert it or delete it on my computer then put it back in the camera. Need to improve on rechargeable battery life and recording looping.",
      "rating": 3.0,
      "verified": true,
      "author": "Nesbeth112",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Would be great if it kept recording.",
      "text": "This would be really good but it tends to choose when it wants to record. I have started to notice if I sit in traffic for more than 3 minutes it stops recording until I turn my car off or tell it to start recording again. Maybe I have a lemon but I wish I could return it now. No point in maybe having video if an accident happens.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley H",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Bought another one",
      "text": "I bought the 7\" for my Toyota Camry I like it so much I decided to get 4.3\" for my jeep I like the clear picture day and night touchscreen is very responsive I haven't try to record anything yet waiting on my free 32gb sandisk instruction on free accessory is in the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Sp",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Great Camera!!! Great Price!!!",
      "text": "Great Product, I installed in my Toyota Tacoma and I always wanted a dash cam. The price point was great and will be looking to buy more for the rest of my cars. The screen is super nice and easy to use, only thing I would recommend is putting a package together with a SD card instead of buying it separately other than that its a great product",
      "rating": 5.0,
      "verified": true,
      "author": "sanjesh singh",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Major upgrade to old cars.",
      "text": "This is a very affordable and good quality product. I was able to install it without a problem. Camera quality is fair (like a webcam), both front and rear. The touchscreen is a little faulty, but can't expect a smartphone touch screen quality touch capacity. Wish the screen was brighter. It's kind of hard to see during the day. Can't see license plates, unless they're 2 ft away and not moving. I recommended it, if your on a budget and just want a dash cam.",
      "rating": 3.0,
      "verified": true,
      "author": "severo garcia",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Flaws, but functional.",
      "text": "Overall the product is usable and quality was okay. There can definitely be an overall improvements. Needs better instructions or guidance. The product needs better stabilization to dampen the shakiness. The camera needs a better bracket(s). I had to flip the bracket the other way to try to get better angles while mounting the camera to my license plate. I wish you can turn/of screen by tapping on it as well, as oppose to trying to switch it under the mirror.",
      "rating": 3.0,
      "verified": true,
      "author": "Ken K.",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Promising...",
      "text": "It arrived promptly and is well packaged. The quality looks superb and it comes with an instruction manual. I will update this review after installation, but so far, the product looks promising despite its budget price.",
      "rating": 4.0,
      "verified": true,
      "author": "lecoy and mimister",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Love the product, easy to install",
      "text": "As I received this dash cam, I immediately installed it and I have to say, it's amazing. It's super easy to install, does not take extra space and your front view. The capabilities of the product is amazing. While the product itself is amazing, the only thing I don't like is that the hold seller holds on to the Micro SD card and ask for \"honest\" review. I wonder if this review qualifies for an honest review.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "What Every dinosaur vehicle needs .",
      "text": "I have been wrong about alot of things.but this is a piece of equipment. The great advantage of clarifing insurance fraud claims to getting yourself out of a ticket which just happen today at 545 pm 11/18 in california .",
      "rating": 5.0,
      "verified": true,
      "author": "A .Andrade",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "This is an excellent choice for a windshield camera",
      "text": "This is an excellent choice for a windshield camera. The package reached me shortly after I placed the order. The seller has send me all the fine parts which necessary to insert and maintain the camera. I am very pleased with it. The touch screen functions very swift and sensitive. The camera display on the front of the mirror is very clear. The mirror is slightly darkened to cut glare which actually works well even with bright lights behind you. It's has all the features that I expect from a dash camera. I highly recommend this brand product!",
      "rating": 5.0,
      "verified": true,
      "author": "Chency",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Seek better quality",
      "text": "Not going to say \"worth the price\". The picture quality is so poor it renders the whole unit worthless. The process of rewriting old files did not work properly. The battery life was about 5 seconds when unplugged. Invest more in a quality product, after all it may same you lots of $$$.",
      "rating": 3.0,
      "verified": true,
      "author": "Ievgen Motorykin",
      "helpful_votes": 0,
      "publication_date": 20181102
    }
  ],
  "product_meta": {
    "title": "Backup Camera 4.3 Inch Mirror Dash Cam 1080P TOGUARD Touch Screen Front and Rear Dual Lens Car Camera with Parking Assistance, Rear View Mirror Backup Camera with Waterproof Rear View Reverse Camera",
    "rating": 4.2,
    "feature_bullets": [
      "【4.3 inch display & 1080P HD recording】 The half-screen display design will not prevent you from seeing the back view while driving, and the 1080P(480P for rear camera) HD recording ensures you get the best footage all day and night.",
      "【Looping Recording & G-Sensor】This HD mirror cam for car recorded video is split into 1, 2, or 3 minute segments.Seamless Loop Recording overwrites the oldest footage with the newest upon filling a card to capacity. Variable sensitivity Gravity-sensor auto detects a sudden collision and emergency,it will lock the footage to \"SOS File\" to prevent that video from an overwrite. 32GB class 10 memory card is recommended.Card is not included.",
      "【Enhanced Night Vision & Reverse assistant】 With the function of enhanced night vision, you can see it through lights clearly at night.The backup camera will automatically display reverse image in any situation when the R gear is engaged(Please connect the rear cam red cord to your reverse light 12V positive lead). Also, the parking guide line will help you park more safely.",
      "【Dual dash cam & Parking Monitor】The front and rear dash cam simultaneously capture road front (170°) and back rear (120°) in crystal details. Mirror display screen has 4 view modes, one-touch switch is designed for you to switch view mode quickly from either full screen/front/rear views or pictures in picture display, triggered by the Parking Monitor, the dash cam will automatically turn on and record when parking.",
      "【Warm Tips】It’s very convenient for you to install the dash camera with the manual control. Please be sure to use a high speed Micro SD card, maximum support 32GB, minimum support class 10."
    ],
    "specifications": {
      "Item Weight": "1.61 pounds",
      "Product Dimensions": "12 x 4.9 x 0.3 inches",
      "Item model number": "CE13",
      "Is Discontinued By Manufacturer": "No",
      "Wireless Remote": "No",
      "ASIN": "B07BFWNH82",
      "Customer Reviews": "4.2 out of 5 stars1,768 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#2,362 in Electronics",
      "Date First Available": "March 14, 2018"
    },
    "categories": [
      "Electronics",
      "Car Video",
      "In-Mirror Video",
      "Car & Vehicle Electronics",
      "Car Electronics"
    ],
    "price": 35.99
  }
}