{
  "website_summaries": [
    {
      "verdict": "The JLab Retro Wireless headphones are a Bluetooth take on the iconic '80s Walkman staple, with big bass and a low price.",
      "pros": [
        "Inexpensive",
        "Solid bass depth and overall audio performance",
        "Throwback design looks like old Walkman headphones"
      ],
      "cons": [
        "No onboard volume controls",
        "Sound leakage might annoy people around you"
      ],
      "aspects": {},
      "publication_date": 20180401,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better than ‘Retro’",
      "text": "The company seems to think this is just for those who remember the eighties, but I prefer over ear headphones. Buds fall out - especially when exercising. These are decent, functional headphones that never fall out. Slightly fiddly to recharge, but they work well and the sound quality is good. Edit: 12 mnths later. Still going strong. Battery lasts a week. Recharges in 2 hours. Bluetooth syncs easily with iphone. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 10,
      "publication_date": 20180512
    },
    {
      "title": "I love these!",
      "text": "I've bought a few (cheap) Bluetooth headphones recently and most have the same problem, you must reconnect them to the phone/music player/tv every time you start up... These connect automatically like I'd assumed they would, I use them for walking/jogging in the mornings. They sit solidly on the head thanks to the sprung metal band, height adjustable and the sponge is comfortable. A Retro throwback to the 80's Walkman headphones. The Good: Battery life, Sound quality, lightweight, Clear phone calls, Google assistant, Quick bluetooth connect. The Bad: No volume control on headset, Charging port awkwardly placed. The Ugly: they're orange.",
      "rating": 5.0,
      "verified": true,
      "author": "Serial Shopper",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Poor sound and skips tracks",
      "text": "These look great, but sadly the sound is thin and reedy. Unfortunately the controls for track jumping also appear to be malfunctioning, so it skips to the next track. This hasn't happened with other bluetooth headphones. There is also an audible sibilant hiss when in operation, which is clearly audible. The online instructions say that the headphones need 40 hours of play to settle in, but i can't see that putting sonic improvements in that are already missing. I would strongly suggest avoiding altogether.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Light weight and easy to use",
      "text": "Good sound quality. Not as good as other that cover the ear completely and let quite a lot of sound out. But lightweight and very comfortable",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Williams",
      "helpful_votes": 5,
      "publication_date": 20181219
    },
    {
      "title": "Became quiet very soon",
      "text": "I was looking forward to these. They for some reason became quiet as if someone halved my volume. From day one they were loud and too loud in some cases. But after a month practically lost 50% of volume. (could be just my unit) I didn't expect much in terms of power and sound quality. But they sound good and have interesting equaliser built in which you can change with a triple button press. They look good and feel light. can get sweaty after a few hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Stanislav",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "Definitely worth buying",
      "text": "Very comfortable retro headphones and easy to use. The sound quality is ok not brilliant however it’s more than enough for this price. I use them in my van all day as hands free for the phone and in that function they are brilliant also sat nav instructions come through them. My overall opinion is they are well worth buying they are very good for the money but if the sound quality of your music is absolutely everything to you then maybe you should look at spending more money on something else.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob.",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "These are great.",
      "text": "The sound quality was obviously not going to be great - that's not why I bought these. As another reviewer said, unfortunately I do think there is a malfunction where it can skip tracks. However for the retro look, comfort and ease of use it's definitely worth the buy.",
      "rating": 5.0,
      "verified": true,
      "author": "AnonymousCustomer",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Quality Retro Sound",
      "text": "Really great wireless headphones with added retro style. These are really comfy on the ear, connect really easily and you get an actual voice rather than beep to confirm connection/ disconnect. There’s no lag time experienced with earphones and the device they are paired with ( which I have experienced with other Bluetooth headphones) Impressed with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Stayce",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Good retro headphones",
      "text": "These are great for the money, lightweight which makes them comfortable enough. They don't isolate sound or have loads of bass, but they do sound decent with good clarity and have a microphone so you can take calls with them. The only thing they are missing is a 3.5mm socket to enable them to be used in a wired configuration, but for the price it is hard to really complain. Battery life seems pretty solid too.",
      "rating": 4.0,
      "verified": true,
      "author": "MrGD",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Light and Comfortable to wear but long lip-sync delay for tv",
      "text": "I found these light and comfortable to wear I use these to watch tv and the sound quality is fine. The big drawback is there is a longer delay in the lip-sync than my old headphones (I know this is a Bluetooth thing) and this means that when people are talking their lips are not in sync by about half a second about double that of my old Bluetooth headphones using the same transmitter, but for music etc they are fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Not bad but not great",
      "text": "Nice looking and comfy to use indoors. Not really good enough for outdoor use in the city as theres too much sound leakage. Only used in the office for a bit before I got a different set of headphones.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher W.",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Top sound budget price",
      "text": "Top retro looking modern sounding headphones. You have to speak up though as the mic can be feint. Sound is great. I bought them for his spent online in meetings as earbuds get sore. These exceed that requirement and are good for music and films as well. Only negative is the battery could be a bit longer lasting and charging port is a bit awkward, but that isn't a purchase stopper.",
      "rating": 5.0,
      "verified": true,
      "author": "Toblerone",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great and retro",
      "text": "The reason I bought these is because they remind me of the Walkman aera and I needed some headphones without any wires. Sound is great, the phone calls are crystal clear too. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Bakai",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Didn’t work!",
      "text": "Didn’t work. Not much more I can say. Tried charging them but blue light came on meaning fully charged but they wouldn’t switch on. Cannot say how good they are",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Leech",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Well worth the low cost.",
      "text": "Scored based on the price. Obviously they are £25 however the sound quality, with the EQ set to bass boost is bloody great. Plus I just wanted them for the retro looks. The orange pads are full of nostalgia for me. Battery life is good too.",
      "rating": 5.0,
      "verified": true,
      "author": "MR L M MALONE",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Did not work properly.",
      "text": "What happened the parcel was posted back to you and was not claimed & was sent back to me after it was sent on 08/01/2020 ??? So what happens know?",
      "rating": 1.0,
      "verified": true,
      "author": "J. M. Makin",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Super comfortable",
      "text": "Super light weight and comfortable, awsome day to day headphones. The sound quality isn’t the best but for 25 pounds it will do. The only issue iv had is that the sound quality fades as the battery does.",
      "rating": 4.0,
      "verified": true,
      "author": "alex coren",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Brilliant headphones!",
      "text": "Had these a few days now and I'm so happy with them. They are really comfy had some in ear wireless ones but they become uncomfortable after a while. I have used them for hours and still on there first charge. For the price they are they are brilliant!",
      "rating": 5.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Worth it for the style",
      "text": "The sound quality isn't the best and the volume never gets loud enough for sound to be clear in louder places. After that I can only tell you: AWESOME! Not only the retro visual is really cool but the sound is quite nostalgic. Very comfortable by the way. Should also say that you're getting IPX4 Wireless headphones for 20£. Quite the deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Vitor Dias",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Replacement orange pads might be an issue",
      "text": "Fantastic little retro styled Bluetooth headphones, sound quality is actually very good especially in bass eq setting, my only gripe would be we're to get replacement pads at a reasonable price, jlabs want 40 dollars shipping, Yikes!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Parker",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Good value for money",
      "text": "Just what I wanted, a funky retro look and surprisingly good sound quality I love these headphones and would recommend them I am not much of an audio file but these suit my daily use just fine. 1 thing I have to say is due to the lack of cupping around your ear a lot of noise bleeds out so this could be annoying to other people.",
      "rating": 5.0,
      "verified": true,
      "author": "60HR Prime ",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Doesn’t respond to my computer’s volume controls and the connection is really bad",
      "text": "These headphones are pretty useless. The sound quality is bad, most of the time they don’t respond to the volume controls on my computer, and the Bluetooth connection is really bad. I have none of these issues with my other Bluetooth headphones.",
      "rating": 1.0,
      "verified": true,
      "author": "Rasmus",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "No satisfaction.",
      "text": "I love the look and feel of these headphones. They’re exactly what I was looking for. However, they really fail on sound quality. I would happily pay an extra £10 or more for these if the sound was even at a listenable quality. They dropped the ball there. Let me know when they’ve improved and I’ll be back.",
      "rating": 2.0,
      "verified": true,
      "author": "mooney",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great retro look.",
      "text": "These are so very cool retro headphones. I know they don’t give amazing sound quality but they look great and do the job on walks.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Woodfield",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Great little find!",
      "text": "Delivered today. Easy to use and sound is good - unless you want to destroy your hearing. Loud enough for me and can adjust EQ (etc) through mobile phone settings. Only gripe is, the headphones feel angled a little strange but will get used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "IM A STARLORD WANNA BE",
      "text": "Love them! And even though they don’t cover your ear, they drown out surrounding sounds, and the quality of the music is spot on.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Curtis",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Good value for money",
      "text": "Very cool headphones at a great price point. Very light, decent sound quality, good batter life and seem sturdy enough. Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Pawel",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Fantastic retro style comfortable headphones (+ wireless).",
      "text": "There is nothing to dislike about this headphones. Quality sound, very comfortable. Real value for the money. I've even bought a second one as a present for my sister-in-law.",
      "rating": 5.0,
      "verified": true,
      "author": "Dragoljub Durasinovic",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Arrived broken",
      "text": "Doesn't work. When connected to the charger red light is on but even after few hours on charge still can't switch it on. Broken product",
      "rating": 1.0,
      "verified": true,
      "author": "MrCeJot",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Failed after 13 months.",
      "text": "Liked these until they failed 5 weeks outside the return window.",
      "rating": 1.0,
      "verified": true,
      "author": "M. SIMPSON",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Good sound quality and look great",
      "text": "Would recommend these. Light, good battery life, good sound quality. The only issue I had was getting in the packaging!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Great Value",
      "text": "Had these for about ten days and they are excellent value. Not sure on how long a charge lasts yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Harper",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Happy",
      "text": "Simply great value and works super-well for the price. Nice look",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Retro and light",
      "text": "Is light , is retro and qulity materials , but sound is diacutable !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Mostly good",
      "text": "I've been looking for lightweight foam Bluetooth headphones like this for a long time. My only complaint is that the micro USB charging port is in a tight place, and you have to partially remove the foam to get to it, which will probably wear out the foam prematurely.",
      "rating": 4.0,
      "verified": true,
      "author": "Curley Joe",
      "helpful_votes": 29,
      "publication_date": 20180426
    },
    {
      "title": "Never got to use them!",
      "text": "I can not speak to how they sound because my daughter claimed them before I even had a chance to use them. However, since she cannot hear me calling her name out loud, like 50x, I can only assume the noise cancellation works great. I can also hear her blasting music when she walks by, so the sound quality seems great, my only problem is I am unable to control the volume with my mind. So, I can only hope she is no longer on my insurance when she starts experiencing real hearing problems, opposed to her selective hearing.",
      "rating": 4.0,
      "verified": true,
      "author": "TDUS",
      "helpful_votes": 3,
      "publication_date": 20200619
    },
    {
      "title": "Affordable, stylish, sound as good as they can for their price.",
      "text": "After searching for a while to find a comfortable bit of headphones, I've found them in these - I'm NOT a fan of earbuds, I have a pair I like and haven't found any that are bluetooth capable that I found to be suitable for my needs. These have rich sound for their cost, I'm not an audiophile by any stretch and thoroughly appreciate what JLab has done here with these headphones, they've met all my requirements in a pair of affordable, easy to use, headphones. No need to worry about tangled wires, there's none to worry about, which is great! I'll be looking forward to future iterations of what this product will lead to and the company.",
      "rating": 5.0,
      "verified": true,
      "author": "Malivon",
      "helpful_votes": 4,
      "publication_date": 20180611
    },
    {
      "title": "Worked great for a month",
      "text": "I really enjoyed these headphones for about a month. They are lightweight and they sound good. But then the right side started buzzing. It’s a buzzing that makes me feel like someone is gently but forcibly removing my earwax with a toothpick. I contacted JLab about this problem and just got an automated response (literally addressed: “Hello 389 Anonymous Customer”) saying I need to mail the headphones in at my own expense for warranty evaluation. Mailing the headphones in would cost me about the same as just buying a new pair, so I don’t see the point of doing either one.",
      "rating": 2.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Throwback = throwaway",
      "text": "Bad design, does not fit my big adult man's head, sound is NOT like the description bloated it up to, signal cuts out too much. I'll either give it to my nephew or let it collect dust OR return. Oh, wait... Amazon now has that tech. support team to (LOL!) troubleshoot/ walk customers through \"setup\", what a yoke! \"Veel get yoor dewice oop ond lunningk in NO time\" says the novice technition that goes through the included manual with ZERO knowledge on specific dewice. Hi, Mr. Bezos!",
      "rating": 1.0,
      "verified": true,
      "author": "v Rod",
      "helpful_votes": 2,
      "publication_date": 20200229
    },
    {
      "title": "NO VOLUME CONTROL",
      "text": "If you can believe it there is NO VOLUME CONTROL on this set of headphones !!!! I feel like a dummy for buying these simply because I failed to see that JLAB decided not to put a volume up and down on these headphones. Unbelievable that they would even consider doing that really. I'll be returning them pronto !! So unless you like someone else controlling the noise going into you head, I would not recommend buying these.",
      "rating": 1.0,
      "verified": true,
      "author": "Harveroo",
      "helpful_votes": 2,
      "publication_date": 20200108
    },
    {
      "title": "Charge Port Location Ruins Foam Ear Cushion",
      "text": "I bought these for super light weight all-day usage to stay connected to work. They are definitely super light weight, amazingly light. Sound quality is crap but so what. I give it a horrible rating because you have to peel the foam ear cushion back to access the charge port. Daily usage means daily charging, so the foam ear cushion on the charge port side is not going to survive very long.",
      "rating": 1.0,
      "verified": true,
      "author": "Timay",
      "helpful_votes": 2,
      "publication_date": 20200523
    },
    {
      "title": "Charging spot",
      "text": "This is pretty light and I liked it very much for that but unfortunately, it only worked for a month and a half. The spot on the headphone that charges it, stoped charging and no longer being charged. I tried so many different angles still nothing. I am very disappointed. I have to dispose of it and look for another one. I do not like waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Farahnaz",
      "helpful_votes": 2,
      "publication_date": 20200716
    },
    {
      "title": "A good, sturdy, lightweight product",
      "text": "For those of us that miss the simpler days of uncomplicated headphones, this is the product for you. And bluetooth cordless, at that. Wow. Some have asked about the ear pads. They are standard size. Construction feels sturdy. I plan to enjoy them a long time. My only concern was that it rattled in the shipping box. My orders from Amazon are usually much more snug than that.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Bain",
      "helpful_votes": 3,
      "publication_date": 20180829
    },
    {
      "title": "No Hassle Bluetooth",
      "text": "These headphones are the best - I love the way they look and they are simple and easy. Great connectivity - no kick offs or difficulty pairing. Decent sound for what they are, considering they are super lightweight. Theses are great headphones for being active, too — the headband keeps them in place and there are no wires to get tangled or caught on anything. They don’t slip off or fall out when I’m sweating - exercising or working outside. They are perfect for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Dennis",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Perfect Lightweight Over-Ear Headphones",
      "text": "These headphones are exactly what I was looking for. I prefer over-the-ear headphones because I find earbuds uncomfortable, but all the ones I had bought before were big, heavy and clunky. These headphones are lightweight, fit comfortably over the ear, stay on great, and have terrific sound. Even more impressive is the user experience. Instead of beeps and tones that you have to decipher, a real human voice tells you all the information as to connectivity, battery life, etc... The headphones also have a built in EQ mode for adjusting sound quality. With all the features, sound quality, and comfort into a low-cost package, these headphones are a terrific deal!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt Schwoppe",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Now I need bluetooth cassette player!",
      "text": "Couldn't resist the old school look of these headphones! Comes with both orange and black foam earpads. But if you're rocking these headphones, you MUST use the orange ones. And you should probably be wearing roller skates. The old school charm wore off pretty quickly when I found that I couldn't control volume or make/receive phone calls with these headphones. Sound quality is as expected for the price - flat.",
      "rating": 3.0,
      "verified": true,
      "author": "TechyTech10",
      "helpful_votes": 2,
      "publication_date": 20181120
    },
    {
      "title": "Awesome headphones that brings me back to my childhood!",
      "text": "I have headphones that sound better, have better controls and last longer but I don't have headphones that bring me nearly as much joy as these do when I put them on. They immediately take me back to the days of listening to my beloved walkman in the late 80's and 90's but without the cord. The sound is good and they are very comfortable. Just one thing to be aware of is they are not private. You can hear them pretty easily when someone else is wearing them. For the cost it was worth it and everyone who sees them asks me to send them a link....",
      "rating": 5.0,
      "verified": true,
      "author": "COJeeper",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Love these headphones!",
      "text": "PROS: These lightweight, comfortable headphones are easy to use and sound great! They pair with my computer and phone quickly. A female voice lets me know when I'm connected and warns me when the battery is low. One big button controls everything, including on, off, pairing, muting and the three equalizer settings. The built-in mic works well for phone and Skype calls. Calls are kept private since nobody in the room but you can hear the other person on the call. Great for gaming too. :) CONS: There's no volume control or noise cancellation. Not a problem for me since I use my phone's and Skype's volume controls. Since I'm not in a noisy environment I don't need noise cancellation.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom M.",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Great form factor, disappointing tinny sound quality",
      "text": "These headphones have reasonable range with few drops, they are very comfortable and feel like they are higher quality than you’d expect for the price. Sadly I was very disappointed with the audio quality of the set I received, cycling through the EQ settings did little to improve the lack of depth, with tinny highs, and hollow muted base, the midrange would be acceptable if not for that overwhelming tinny overtones. I know that audio quality is extremely subjective but trying these headsets side by side with many other sets in this price range it’s clearly the least defined and frankly unpleasant by comparison.",
      "rating": 3.0,
      "verified": true,
      "author": "hugotress",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "One and a half year update...",
      "text": "I use these mostly on long walks, and around the house as well. They are paired with my Samsung Galaxy S8 phone and ATab tablet. I am told phone call quality is decent. Most vexing, though, are the frequent, inexplicable disconnects (announced by the female voice), whether I am out walking or just laying on the couch. Usually I have to manually disconnect then reconnect to get the media back. Very strange, and a bother to deal with. Update: one year later and I really dislike these headphones....problems above continue and are worse now. Short battery charge life, plus it takes FOREVER to recharge these things. You get what you pay for...",
      "rating": 2.0,
      "verified": true,
      "author": "T. F. Welsh",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great Sound Quality for a Lightweight Set of Headphones.",
      "text": "I was using an old set of lightweight wired headphones, that I likely used with a Walkman in the old days, and wanted to update to a Bluetooth version. These fit the bill perfectly. The headphones are feather-light. You hardly know that they are on your head. The sound quality is very good--much richer than some other more expensive over the ear headphones I own. There are many features that I haven't even tried yet, as I basically use them for music while I walk. For the price and their light weight quality, these headphones can't be beat!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Perfect alternative to earbuds",
      "text": "I've tried practically every earbud out there. The only ones I find comfortable and secure are AirPods, but sound quality isn't much better than the wired versions that come with the iPhone. Even the best sounding buds aren't comfortable or secure enough to stay in my ears. These retro JLab headphones are the perfect solution. They're featherweight, comfortable, great battery life, and surprisingly good sound. Hard to beat for $19. For noisy environments, at the gym, or plane travel, I've got NC headphones, but for hike or a run, these are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Pretty Good little headphones",
      "text": "I was looking for headphones to listen to Audiobooks while doing house and yard work, sometimes wearing a hat. These are working fine after a few wrinkles. The charging cable included is very difficult, if not impossible(!) to plug into the headphone. I have others which work OK, so they charged up fine. After a couple of tries headphones paired with my phone and are working well. The range is OK and the on/off, etc button is big and easy to use. So far these are just what I wanted at a great price!",
      "rating": 4.0,
      "verified": true,
      "author": "C. Crane",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Fantastic for its price.",
      "text": "Lightweight, 12+ hour battery life, only $20, its a steal! I bought these headphones because I love the retro style, the fact that they are extremely lightweight and durable for the $20 price tag make these an absolute steal, if you are a retro fan like me, you'd be crazy not to get your hands on these type of headphones, and that is coming from someone who has used different types of earbuds and headphones throughout, and me personally, these are my new favorite pair at the moment!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Sanchez",
      "helpful_votes": 4,
      "publication_date": 20180719
    },
    {
      "title": "Very comfortable!",
      "text": "Love them! They were exactly what I was looking for, and surprisingly hard to find. Basically all earphones that are in-ear hurt, and the ones that hand on your ears are uncomfortable to me. So my option was headphones, but so many are bulky! Maybe good for sound and other uses, but I wear these when I go hiking, so I wanted something light weight and portable (and wireless). These are perfect and have decent sound. Not noise cancelling but since I often go hiking by myself I actually prefer that",
      "rating": 5.0,
      "verified": true,
      "author": "Sage Jackson",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great product but the charging connector doesn’t fit nicely",
      "text": "Worth every penny! Great product, great sound, very comfortable in my ear, stays in your ear even during light exercises. The only issue is the charging cable because it a bit difficult to connect to the headphone. Charging tip is too tick so it will take some wiggling to get it inside the headphones .",
      "rating": 4.0,
      "verified": true,
      "author": "juan",
      "helpful_votes": 2,
      "publication_date": 20180720
    },
    {
      "title": "Old style with new technology",
      "text": "I love this headphones, bluetooth connectivity is very easy and reliable. Sound quality is very good, it lacks a little bass but it is excellent when you related to the dimensions of the headphones. Very comfortable and light. Batteries so far run as promised. The quality of the phone call is excellent, people don't hear any difference when I am talking thru the headphone compared to the cellphone. Price is amazing for what you get plus I received a 2 year warranty that Jlab proactively activated when you register your product. Good Job Jlab, keep working like this and you will become giants in the industry!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Burbano",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Kevin Flynn",
      "text": "I LOVE THESE. I bought them because I wanted a pair like Flynn from Tron classic. They look a ton like his but with all the benefits of the 21st century. Bluetooth works great. Sound is great. Feel great. They are so much better than the big stuff you get lately because you can put them down around your neck and forget about them. They don’t get in the way, and you can totally play arcade games and plot to take down encom in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Perfect!",
      "text": "Looove them, the only \"problem \" is the outlet for the charger, it's very small and the charger a little bit bigger, it doesn't fit. I solve it using another charager. And the phone call audio is not always the best, sometimes it brakes my voice and people don't understand me, but it could also be my phone connection.",
      "rating": 5.0,
      "verified": true,
      "author": "Ileana",
      "helpful_votes": 2,
      "publication_date": 20200522
    },
    {
      "title": "Sometimes the Bluetooth cuts out, but I love them and would buy again for self or as gift.",
      "text": "Sometimes the Bluetooth cuts out. However I love them and would buy them again. They are light, easy to transport, not bulky, classic look, and over the ear is what I was looking for. - ear problems and I wanted to switch from in the ear Bluetooth+mic to over the ear. So that works, the mic works well too. Was debating between 3 or 4 stars - as the Bluetooth cuts on sometimes. But I decided 4 stars because I would still buy them again, or gift them to someone as a purchase too.",
      "rating": 4.0,
      "verified": true,
      "author": "831 the hawk",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "old school simplicity",
      "text": "These are pretty cool. Light weight and comfortable. Sound quality is better than I'd hoped. There is NO volume control or track control on the headphones just an on/off button. They're pretty simple. Sometimes they don't charge. I just get them off the charger and try to use them and the headphone lady says, \"battery low.\" That's about my only gripe so far. I got what I expected - except, like I said, they do sound BETTER than I thought they would.",
      "rating": 4.0,
      "verified": true,
      "author": "Just me",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Great sound quality for the price",
      "text": "I’m amazed at how well these worked. We ordered these for a starlord costume and they were perfect! While looking, many people are selling the orange foam for a lot of money but this is the best deal! They also do come with black foam so they can be switched out if needed. Also, for being old school headphones, the sound quality isn’t too bad! Now, it’s not beats quality of course but still great for what you’re paying! If you’re into this style of headphones and don’t want to spend too much money, these are a perfect substitute.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddy",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Comfortable for my big head and great sound for the price",
      "text": "I am not an audiophile so these produce very good sound for the money. I wanted headphones I could wear comfortably, and these are lightweight and the battery lasts me all day. I also like there is no annoying bright blinking LED when you have these on. My only minor complaint is the charging port. As others have mentioned you have to move the earpad out of the way and over time could cause issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor Yannayon",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "These things are awesome!",
      "text": "I'm not a sound hound so if you want to purchase these for the sound quality, I have no idea if you will be disappointed or not. But I think these are awesome! Regular ear buds hurt my ears after 10 minutes, and over the ear headphones press too tightly and hurt too. These are sooo comfortable! Fit just like the old Sony Walkman headphones. They paired right up with my phone, no problems. Very easy to use. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Little House on the Prairie",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "I LOVE them",
      "text": "You're not buying these for sound quality, I hope. They sound about as good as their retro counterparts, which is totally fine with me. They are comfortable as all get out, they are light, and I can still hear everything going on outside of them. They don't make my ears sweat like most available over-ears and they don't go in my ears and then fall out like buds. I'm very happy with them. They seem sturdy, are easy to use and charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Sally",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Sound great, reasonable base, good clarity",
      "text": "New phone has no headphone jack, so needed a bluetooth one. Did some research and these seemed like they would fit the bill They work well and are easy to pair with a Pixel 3. Battery life seems quite good and it recharges pretty fast. Sound quality is very good for the price and they are light and comfortable. Other people can hear what you are playing a bit, as my wife has told me, which I assume is an issue if you are cranking out tunes in high volume, which I tend to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Kennedy Gould",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "The best headphones for work place",
      "text": "Best headphones I bought for the price. Positives: No wires, No weight on the head, No NC (which is good for me to wear at work), Clear sounding, good amount of bass not overwhelming or underwhelming. Excellent battery life (atleast 10 hours with 60% volume), Welcome message with battery life, Great distance connectivity. Negatives: Charging the headphones, no physical buttons for volume adjustment, welcome message with battery life (sometimes it says low battery but in real it's not, you got to check the phone).",
      "rating": 4.0,
      "verified": true,
      "author": "Tulasiram ",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Comfortable",
      "text": "I’ve been pleasantly surprised with these headphones. They squeeze my head enough to stay in place and I can walk into the next room without any Bluetooth issues. I work in the sun and I sweat a lot. Ear buds hurt and over the ear headphones are too claustrophobic and hot. These are on point Edit: after about a month any bass in a song just comes through in a rattle/buzz. Also the orange color got real dirty real fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "JLabs wireless headphones",
      "text": "I had of JLab Bluetooth earphones that worked great. They are the in ear kind. I wanted to try the kind that doesn’t go in the ears. I don’t know if the one I received is defective, but the sound breaks often, as if the Bluetooth connection goes off and on frequently. Needless to say this is very annoying and I am not using this earmuffs headphones at all. I still think JLabs is an excellent company and I am sure I will be buying their products in the future.",
      "rating": 2.0,
      "verified": true,
      "author": "Freddy O Ortiz",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "no volume control",
      "text": "volume is controlled by the player - that was disappointing. no sound isolation/cancellation (foam pads? what do you expect?), sound quality - if you had one like this in the '80s, there you go...you get what you should have expected. OK headphones, other than lack of volume control and a really pain in the rear charging port access, it's good, inexpensive, and generally pretty good value for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Notso Underground",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Foam earpad over charging port keeps getting loose",
      "text": "I couldn't find a better way to to contact the seller, so I'm writing this review to see how they respond. The product does the job if you're using it at home. The quality is adequate for the price. The problem is that I needed it for exercises, walks and bike riding. Because of the charging port location the correspondent foam earpad keeps getting loose. I lost three of four earpads in less than two months. Please, help me to get extra foam earpads or I would need to return the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Galina Nikiforova",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Highly recommend",
      "text": "They are inexpensive, cool retro design and function much easier than many Bluetooth headphones I’ve tried. The foam covers fall off easily, though, so just pay attention to that. However, they come with a second set and you can purchase more. I know lots of people who have these and love them, and people ask me about them pretty often, going as far as writing down the brand name!",
      "rating": 5.0,
      "verified": true,
      "author": "picklespdx",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Great headphones for the price",
      "text": "I think one of the worse things Apple did was to make the ear bud style of headphones popular. They don't fit in my ears, they don't stay in my ears and the sound is lousy because of the poor fit. The style of headphones that completely cover your ears is not a good solution if you are out walking the dog because you block all ambient sound as well. These headphones are great, they are comfortable, the sound is good and the battery life is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Sezed",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "The most comfortable headphones",
      "text": "I received these headphones a few days ago and I really like them. The sound quality is way better than I expected. They don’t offer much isolation, but I plan to use around the house. Overall, they look really cool and they are really comfortable. The foam literally hugs your ear. They don’t have volume control, but you can double click to activate Siri and ask her to do that for you. It also has three sound quality settings. This is a great alternative if you don’t like bulky headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Joseph",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Good midrange, poor bass, not much volume",
      "text": "Pros: lightweight, comfortable to wear, excellent battery life, easy pairing and connecting, bluetooth convenience Cons: no volume control, sound quality and volume ok for background music and web videos, not for gaming or immersive music listening. Bottom line: Ok for the price, comfortable and long lasting charge, good for extended wear while watching movies , newscasts, web videos.",
      "rating": 3.0,
      "verified": true,
      "author": "Tzadik Apprentice",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Not bad",
      "text": "I got these because I have cauliflower ear and needed something to run with. In ear buds hurt my ears after a few minutes so these lightweight sets were the option I went with. Great for the price. The sound quality does lack as do the controls for volume, but if you can live with these aspects it’s a good buy. Sound quality: they sound better than the original “old school” headphones these are based on. The bass gets muddy when using bass boost the mids get buried with some songs. They have decent sound quality. Podcasts do better than music. I can’t see any noticeable lip sync delays with videos. $20, why not?!",
      "rating": 4.0,
      "verified": true,
      "author": "JAMES ODA",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "These are my favorite wireless headphones period!",
      "text": "First off the price is great! Now for the item itself it’s amazing! I love the retro style plus it being Bluetooth is bonus points. They work great but just be careful since they do feel flimsy/easily breakable. But other than that looks awesome and the sounds is great for its price! Plus you can definitely use these for a Star Lord cosplay",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "The Superior Bluetooth Experience",
      "text": "I bought these to replace my Raycon earbuds (which ran about $120) and these are superior, in my personal opinion. Everyone needs headphones for something different. I use these for working in the kitchen. I can hear my music AND everything around me without either overpowering the other. They stay on my head and over my ears and if you're asking me I'll tell you they look cooler. I would buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Reese Culbertson",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Lightweight, comfortable with some Bluetooth quirks",
      "text": "+ Lightweight, comfortable **** - Some Bluetooth quirks ** ? longevity - too early to say Hard to find over the ear, wireless, ultralight headphones, these fit the bill. Works but have found that one has to be willing to work from time to time to keep the Bluetooth connected. Ordered a second set to have one in the charger. Above based on a week's use.",
      "rating": 3.0,
      "verified": true,
      "author": "Ron Westover",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Comfortable!",
      "text": "I love the fit and comfort of these! The sound is great and the battery lasts my whole work day!",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 4,
      "publication_date": 20190922
    },
    {
      "title": "Sound quality is better than what you'd expect",
      "text": "So I got these for work. Partly for the retro factor, partly because it's just so damn hard to find wireless over-ear (instead of over-the-ear) headphones. They have shockingly decent sound quality for their price point and design. I can still hear everything around me, which is what I needed. You won't get pounding bass, but you shouldn't expect it with this style of headphone. I would definitely buy them again. Only real gripe: the charging port is difficult to get to; the included cable can barely fit it, and only if you force the earpiece pretty hard. It's a lot easier to get an Anker or Aukey cable in and out, since they have smaller plugs and rounded edges.",
      "rating": 4.0,
      "verified": true,
      "author": "Sean D",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Don't expect to much.",
      "text": "Its only $20, what else can you expect? You get what you paid for, no more, no less. Pros: -very light -looks and feels great -easy to pair Cons: -sound quality is bellow average -DOES NOT LAST 12 HOURS -one button to control everything is not very intuitive Bottom line, it's worth the money if you don't have high expectations.",
      "rating": 4.0,
      "verified": true,
      "author": "Alvaro",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "OK for the price",
      "text": "These headphones are exactly as I thought they would be for this price. Very lightweight which is why I bought them. Sound quality isn’t that great, but OK if the original music is of good quality. Be careful with the volume, you have to adjust with each recording and possible you can be blasted out of your chair. Incoming calls are very loud too. Stay on that volume button.",
      "rating": 3.0,
      "verified": true,
      "author": "Donna McBride",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Buy it now.",
      "text": "I can't use earbuds, and it's been a struggle to find anything wireless with the old style foam earpads. This is by far the most comfortable headphones I've ever had. They fit snug, don't slip, and the sound quality is fantastic (for podcasts & movies at least, haven't used for music yet). The burn in app works great to break in the speakers. Price for quality, great.",
      "rating": 5.0,
      "verified": true,
      "author": "Maine Steve",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Best Deal in Headphones Out there !!",
      "text": "If you are looking for wireless headphones and think that headphone prices are ridiculous get these...Over 8 hrs listening in a single charge...Extremely comfortable , minimalistic look, simple features a..get these now !! Ordered them in two different colors because I can’t think of living without them !!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Masi",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "Great!",
      "text": "These headphones are exactly what I wanted! I can't stand the inside- the- ear kind of headphones and I needed something for working out. These are light and hold a charge for a long time. I like them for jogging because I feel safe since I can still hear cars coming (unlike with other headphones). I wish they had a volume control.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Sullivan",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Cheap light weight headphones",
      "text": "I didn't expect much out of these headphones and that's how it worked out too. I like that they are light weight and are reminiscent of the 80's look, but they are a bit too small for my head and the sound just isn't that great. The sound is rather tin can sounding. I'll be giving these away to a kid or maybe Goodwill.",
      "rating": 3.0,
      "verified": true,
      "author": "Sfreez",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Ordered 2 pairs, both had channel imbalance...",
      "text": "Was an early adopter of these and teached out to their customer service and though I ordered these on Amazon, they wanted return shipping for them. At this price, it's simply not worth the hassle. Otherwise, they are great looking retro-wise and the sound quality is ok but at the price, not going to be expecting anywhere near hifi SQ anyways.",
      "rating": 1.0,
      "verified": true,
      "author": "turboBB",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "No volume control; bad sound quality",
      "text": "Don't waste your time -- there is no volume control with these headphones. Piece of junk. They are very lightweight. That's about the only good thing I have to say about them. It's also quite difficult to get the charger into the charging port. You have to take the foam cover off, and then it's hard to get the foam cover back on.",
      "rating": 1.0,
      "verified": true,
      "author": "aaa",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "These suckers work great and look great",
      "text": "The value on these is unbelievable. The bluetooth works well, and they really look authentic to 80s headphones. Of course, the sound quality and sound leaks are just like 80s headphones as well--that's just the nature of the design. It comes with orange or black foam covers, and the charge lasts a long time. Definitely recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Geologick",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "old school",
      "text": "So I really hate the pokey earbuds. They don't stay in and I hate having things wrapped around my ears. These are like the old school sony walkman headphones from back in the 80's! No the sound quality isn't like bose but for $20, they are awesome workout headphones. No wires. Sync with my iphone with no problems and are comfortable on my ears. I bought a pair for my 75 year old mom and she loves them too.",
      "rating": 5.0,
      "verified": true,
      "author": "Picky CO Mom",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Light weight on the ear headphone.",
      "text": "I am enjoying using the light weight headphone with my apple watch. Customer service with JLab is excellent. There were holes in one of the ear pads and they sent me out new ones quickly. The volume is good when connected to my iPhone but can't control it when connected to my apple watch.",
      "rating": 5.0,
      "verified": true,
      "author": "JEB OT",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great look. Sound OK",
      "text": "It's a 5cm membrane, extreme light and cable free headphones . This is not a Senheisser PX100 and neither a Koss Porta. But it's very reliable and the sound is OK for most activities. For this price it's a great headphone with a great vintage look. Personally, I would be willing to pay double the price for a better sounding headphone. But sadly , such a device doesn't exist in the Market.",
      "rating": 4.0,
      "verified": true,
      "author": "Yoram Pomer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "wow...just, wow!!!",
      "text": "When I ordered these for my wife, she loves the retro 80s look, I didn't think much of them. But they were easy to connect, had great sound quality, and the build quality is fantastic. They are easily under priced!!! They are however just straight forward Bluetooth head phones. If you are looking for noise canceling or a sophisticated eq software, these are not for you. If you are looking for quality headphones and love the 80s style, look no further!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly L. Bell",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Very Good for the price!",
      "text": "For $20.. the battery life, stable bluetooth connection, sound quality, retro style looks, very comfortable... there's no complain... But beware, everybody who is near by can hear what I am listening... and lady's voice of battery level is sometimes annoying.. but still this is very good headphones after all!!! Buy this!!",
      "rating": 5.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Surprisingly good headphones",
      "text": "These are actually pretty decent bluetooth headphones. I had these for about 3 months so far and I found I use them a lot more than my higher quality ear buds. The sound quality is a little \"tinny\" but still pretty decent. There are perfect for exercising and moving around with. They aren't earbuds so they don't fall out easily, and they're cheap so if you accidentally break them its not much of a loss. Plus I don't know about you guys, but when I wear earphones too long my ears get sore. With these that isn't a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Holland",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Keeps saying low battery when turned on, even after charging for over 12 hours.",
      "text": "These are decent for the price. Sound quality is pretty good. The reason I only gave it two stars is because, it always says low battery when first turned on. I had it charging several times for 12+ hours using different USB adapters and also usb on my PC. Seems to last a long time per charge, so I’m suspecting it’s a problem with battery monitor circuitry. I would recommend these if not for the defect.",
      "rating": 2.0,
      "verified": true,
      "author": "ken callies",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Thought this would be cheap retro prop, and it is actually a great headphones",
      "text": "Bang for the buck!! I bought these for my Starlord dress up for the office Halloween costume party. Had no intention of using it since I own so many great headphones over $500. Then this is great for office use, when you need to be aware of surroundings. Battery life is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Young",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Look and work like old school headphones",
      "text": "These get 5 stars overall because they're exactly like old school headphones. That being said, they are NOT noise cancelling and the sound quality is nothing to write home about. For me, they're perfect. They look fantastic, sit on top of my ears and connect via bluetooth without issue. They will get \"confused\" if you have multiple devices nearby with bluetooth turned on but I think that'd be an issue with any product. Not at all noise cancelling but there are other products if that's what you're looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Harris",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Battery life is not great",
      "text": "I had to get a replacement because it wouldn't charge, which came to me in a few days. I left the new pair on the charger for a few hours and it only charged 90%. I used it for 40 minutes and it was already at medium battery. It looks cool and is very comfortable, but I wish the battery life was longer.",
      "rating": 2.0,
      "verified": true,
      "author": "Tara Talley",
      "helpful_votes": 0,
      "publication_date": 20190911
    }
  ],
  "product_meta": {
    "title": "JLab Audio Rewind Wireless Retro Headphones | Bluetooth 4.2 | 12 Hours Playtime | Custom EQ3 Sound | Music Controls | Noise Isolation | with Microphone | Throwback 80s 90s Design | Black",
    "rating": 4.3,
    "feature_bullets": [
      "GO RETRO: Let the Rewind Wireless Retro Headphones take you back in time to when grunge, big hair, bright colors and kicking it with your Walkman was the thing to do. Now it's time to GO wireless. The Rewind headphones provide 12 hours of playtime, custom EQ3 Sound, and all of the controls you need. The same lightweight design and orange foam earpads, you'll feel more nostalgic than ever. Old-school look, with today's technology.",
      "12-HOUR PLAYTIME: Keep your music hassle-free by wirelessly linking your Bluetooth enabled device and streaming from up to 30 feet away. With up to 12 hours Bluetooth playtime of mind-blowing sound that’ll leave you with rock-star vibes all day long.",
      "TAKE CONTROL: These headphones come with a button on the headset, so you can skip tracks, activate Siri or Google Assistant and answer calls all without taking out your phone. There is also on an onboard microphone that allows for crystal clear communication during calls. For those need to know moments, a double click and digital MEMS built-in microphone lets you activate and deactivate SIRI, Google Assistant, or other voice assistant prompts as clear as day.",
      "EQ3 SOUND: Our radical EQ3 setting lets you change the sound to your preferred tune via the headphone, so your music sounds just right. Click between three options: JLab Signature, Balanced, and Bass Boost.",
      "TWO YEAR WARRANTY/30 DAY GUARANTEE -We are so sure you’ll be happy with your purchase that we offer a “30-Day Money-Back Guarantee” to ensure customer satisfaction of our Jlab products. Also included with our products is a 2-year limited warranty to ensure you are covered for up to two years in case any issues with our products arise."
    ],
    "specifications": {
      "Product Dimensions": "5.91 x 1.06 x 3.54 inches",
      "Item Weight": "4.2 ounces",
      "ASIN": "B07BTL786T",
      "Item model number": "Retro",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.3 out of 5 stars986 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#237 in Over-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "Bluetooth",
      "Additional Features": "With Mic, Track Forward",
      "Other display features": "Speakers",
      "Audio Jack": "Micro USB",
      "Colour": "Black",
      "Department": "Headphones",
      "Manufacturer": "JLAB",
      "Date First Available": "April 1, 2018"
    },
    "categories": [
      "Over-Ear Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 19.99
  }
}