{
  "website_summaries": [
    {
      "verdict": "Middle-of-the-line golf watch with great GPS from a trusted name. Perfect for the serious golf player.",
      "pros": [
        "Pre-loaded with over 35,000 courses in 30 countries",
        "Comfortable band",
        "Long battery life, distance calculator, and integrated step counter",
        "1-year limited warranty"
      ],
      "cons": [
        "Software works with Windows XP but not Windows 10, creating compatibility issues",
        "Band may break with repeated use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The charger breaks easily!",
      "text": "The watch is fine: good value for money. However -- and this is crucial -- the charger has three 'prongs' that attach to the back of the watch for charging. One of the prongs -- the most crucial one as it is over the four charging points -- is flimsy. Mine broke in less than a month. I've noticed on other sites that this is a common problem. Until a new charger is developed, I would NOT recommend this watch, as the watch is useless without the charger.",
      "rating": 1.0,
      "verified": true,
      "author": "SwatOx",
      "helpful_votes": 22,
      "publication_date": 20190725
    },
    {
      "title": "Very Disappointed",
      "text": "Tried it twice (on two different courses) - it took about 10 minutes each time to find the course. It then lost it's GPS location on the front nine on one course and on the back nine on the second course - wouldn't advance to the next hole or re-find it's location each time. Couldn't reset. Want to return, but can't because I was an idiot, expected it to actually work, and threw away the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest Guy",
      "helpful_votes": 16,
      "publication_date": 20180920
    },
    {
      "title": "Great product, easy to use!",
      "text": "I really like this watch for both the quality and ease of use. I have been a long time user of the range finder which is cumbersome and not always accurate. This is easy to read, easy to use and being re-chargeable is simply great. I did have issues with the first edition of this watch but it appears the 2nd edition resolved those issues and after a month’s use, I am completely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "mkpi",
      "helpful_votes": 14,
      "publication_date": 20180704
    },
    {
      "title": "Beware the 30 day warranty!",
      "text": "It worked well enough when it worked, but after 40 days it died. Amazon offered only a partial refund. So if you are okay paying $40 for a GPS watch that lasts 40 days, go for it. If not, there are other alternatives available.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert L. Klein",
      "helpful_votes": 14,
      "publication_date": 20181008
    },
    {
      "title": "Essential golf tool",
      "text": "This watch has completely replaced my laser range finder on the course. It has helped tremendously in club selection because I can see the distance to front and back edge of the green at a glance. I also like that I can get distance to hazards without having to shoot multiple spots, this has helped speed up the club selection process. This watch is great for competition. I have dropped 2 strokes off my average score since I began using this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "James ",
      "helpful_votes": 13,
      "publication_date": 20180726
    },
    {
      "title": "I have only used it twice. On my unit ...",
      "text": "I have only used it twice. On my unit the GPS cuts out regularly and goes to time of day. I then have to go to menu-resume golf where it starts on hole 1. I had tried my sons Neo Ion and it worked well so I purchased this one for myself. I'm not sure if mine is defective. I will try it once more to be sure. If it continues to cut out I will exchange it.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim B",
      "helpful_votes": 9,
      "publication_date": 20180727
    },
    {
      "title": "Great golf watch for the money",
      "text": "I have been playing golf for over twenty five years, I play 3 three times week and have in the past bought several golf watches and range finders, and find bushnell the best. I have only had this watch a couple of weeks and played a couple of games with it and it is easy to use and accurate. I liked it so much, I bought my son one. The buttons are big enough for making easy menu and other selections. I also like the fact there is no subscription required. There is also a phone app if you want other bells and whistles. For the money this watch is the one.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob N Del",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Keep it charged",
      "text": "The watch performs as advertised. The yardage to the green and to the obstacles is pretty accurate when compared to laser scopes my playing partners use. If you plan on using the Bushnell App in conjunction with the watch, make sure you have an extra power pack for your phone and maybe an extra charge cable for your watch because Bluetooth will eat up your power. If you plan on reversing the watch band make sure the screwdriver provided has a flat head. I had to grind mine down to make sure it would fit the screw heads.",
      "rating": 4.0,
      "verified": true,
      "author": "rdail",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Like it -- don't love it",
      "text": "I switched from my Garmin golf watch because it was not holding a charge. The Business does hold the battery power better -- but not at all as advertised: two rounds and I'm out. It's not the most visible face in all conditions, and, of course, with all (I think) GPS golf watches, it can't update based on pin position. It works fine. I don't doubt its accuracy to the green, but most greens present a challenge of choosing between two clubs on approach -- so it's not as helpful by simply giving you the middle-of-the-green distance.",
      "rating": 3.0,
      "verified": true,
      "author": "scott miller",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Watch does not hold a charge.",
      "text": "I can only rate the battery life .....which I gave the lowest possible score. I bought the gps watch before the Christmas holiday. I charged it fully and put it in my golf bag. Today I put it on to play a round of golf and it failed. Zero battery power after being stored for a few weeks. Wish I had bought a better brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Toia",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "One year warranty with no repair support for out of warranty instruments? No replacements available.",
      "text": "Battery failed to keep a charge at 18 months - only charged half-way, quit at about the 12th hole. Instrument is now out of warranty (12 month warranty). Company rep said \"unfortunately\" they do not repair if it is out of warranty. Willing to replace at unspecified price, but not until NOVEMBER?! (This report filed in July, 2020.) Because of unreliable battery, instrument does not maintain accurate time. Works well on the course, but it has a black on gray face and is sometimes hard to read. May purchase a Garmin instrument, but I have an iphone - the Bushnell ION2, and similar products may be obsolete? In summary, ZERO stars for unreliable instrument and unsatisfactory support from manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "iPhone 7+ user",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Bushnell Won't Respond To Warranty Issue",
      "text": "I bought the watch 9 months ago. The watch won't work and will not charge. I've tried calling and stay on hold until I give up. I've emailed and they email \"we have registered your case and will be in contact shortly.\" I'm very disappointed with Bushnell.",
      "rating": 1.0,
      "verified": true,
      "author": "Ron Sheets",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great for distances and hazards.",
      "text": "I like this watch very much, but...my wrist is 8.95 inches and leaves me only 2 holes to secure. My glove contimues to push the end of the strap back, and annoys mw when it pops out of the holder strap and catches onto my glove wrist. I hoped to get a bigger strap than this, but none are available that I can find.",
      "rating": 4.0,
      "verified": true,
      "author": "JUST HAM",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Excellent GPS for the Money",
      "text": "Before purchasing I used to use an app on my cell phone which wore the phone battery down to less than 5%. Since purchasing the Bushnell Noe Ion 2, I find the distances to the front, middle and back of the greens to be accurate enabling me to hit shots with confidence. I'm skeptical about durability of the charger since it is made of plastic, snaps into the back of the watch to charge, and is susceptible to wear and breakage. If it were not for the charger, I would have given it a five star rating.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary P.",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Not a good product....",
      "text": "Received this item on May 28, 2020 and it no longer works! While it was working it performed adequately, but at times difficult to read. However it stopped working about three weeks ago. After charging it would no longer turn on. Screen remained blank with no signs of life. You would expect a product from Bushnell to be a quality product but unfortunately this is not one.. I would not recommend this product to anyone..",
      "rating": 1.0,
      "verified": true,
      "author": "Bill Dutcher",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Junk",
      "text": "It is piece of crap! It does not deserve a single Star! The computer interface does not work, the yardage distances are consistently off by at least 10 yards and as many as 20. and on the 3 month anniversary of purchase the devise totally failed. Bushnell should be embarrassed!",
      "rating": 1.0,
      "verified": true,
      "author": "John C. Trimble",
      "helpful_votes": 3,
      "publication_date": 20181018
    },
    {
      "title": "Great Technology at a Good Price",
      "text": "I received this watch 36 hours after ordering it. The set up is very easy, with the exception of linking to my phone, which I will figure out. It provides accurate distances and lives up to the description. I previously ordered the same watch from Dick's and received a used watch that was still registered to another owner. My new one is just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "FloridaJoe",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Watch battery not reliable",
      "text": "Like some others, my GPS watch would not complete two four hour games without battery dying. I also had to often manually advance to the next hole. The hazard notices were also not as good as my previous Bushnell neo xs such as water carry. Friends with the same watch did not have these issues. I did return to my Amazon Prime account through a lock box at Whole Foods. This was a first return for me to Amazon and was quite impressed with the ease of it.",
      "rating": 2.0,
      "verified": true,
      "author": "Canver",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Easy to use",
      "text": "Easy to set up and start using. Battery life is shorter than I wanted, lasting only a little more than one round.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Works very well.",
      "text": "I have used this system for about two months. It works very well and compares accurately to the markers on the golf courses. I like the feature where it shows the distance to hazards, sand, water and EOF, which a lot of the competion do not. Way worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Pealer",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "It does work great. But I need to be able to",
      "text": "I gave it a 3 because the display is on dark side and hard to read. It does work great. But I need to be able to read",
      "rating": 3.0,
      "verified": true,
      "author": "billie h",
      "helpful_votes": 3,
      "publication_date": 20180921
    },
    {
      "title": "Battery won’t stay charged",
      "text": "I bought the golf watch in December 2019 as a gift and it’s now July 2020 and already doesn’t work. The Watch doesn’t stay charged. Can’t get through the first hole and it’s dead. Hopefully the company will replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "Steven G Harmon",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Beside giving you yardage it gives you the hazards.",
      "text": "Beside giving you yardage it gives you the hazards, not all GPS watches do this. Read all of the specs for other watches range finders before you purchase a rangefinder. Definitely recommend this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Beach Bum 312",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Dead Eye",
      "text": "Now that I have a watch that does everything for me except hit the ball I am anticipating much better scores. Not only that but it looks good on my wrist. It appears to be pretty solid and it’s easy to see in the bright light.",
      "rating": 5.0,
      "verified": true,
      "author": "Carving Beginner",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "ease of use",
      "text": "I have not , as yet. discovered of the functions of the Bushnell GPS; it is not easy to set and become acquainted with the different aspects quickly. However, for just getting to the correct golf course and tracking the simple distance between me and the hole...it works great... Some day I will be able to take enough to time fully acquaint myself with the watch; it is not intuitive.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie-Therese D.",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Very Poor Accuracy",
      "text": "This is the second Bushnell golf watch I’ve purchased. I have used it a dozen times on different courses and the yardage given is routinely 5-20 yards less than the actual distance. It renders the watch useless for golf which is why I purchased it I am very disappointed with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna P",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Doesn't Keep Time Well",
      "text": "This watch is easy to use and accurate on yardages. I've found that it loses two to three minutes a month on time, though. Also, the battery life was advertised as better than the previous model, but I have found it to be less so.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "works as advertised",
      "text": "fit is a bit big. bought for my wife but I use it instead as it is too bulky for her. Easy to set up and use and it is certainly accurate enough for my game!",
      "rating": 4.0,
      "verified": true,
      "author": "john longenecker",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Easy set up. Easy to start play.",
      "text": "This watch seems to be spot on as far as distance. I play with men that have much more experience range finders and this watch matches up to a yard or two.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "GPS watch for golf",
      "text": "Easy to charge but have to be careful because it is plastic. Can hook up app on phone to get view of the hole I’m on. Like it very much",
      "rating": 5.0,
      "verified": true,
      "author": "Janice K.",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "its an all around great golf gadget",
      "text": "My husband loves this. His older version got lost on a golf course, and this has many more capabilities.",
      "rating": 5.0,
      "verified": true,
      "author": "emerald rose",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "dont buy ,",
      "text": "band is ripping from a November purchase . 30 days your out and BAND IS NOT REPLACABLE . gorilla glue next stop",
      "rating": 1.0,
      "verified": true,
      "author": "Fred T.",
      "helpful_votes": 2,
      "publication_date": 20190207
    },
    {
      "title": "Accuracy of the unit.",
      "text": "The unit worked perfectly, and I am very happy with the purchase. I would recommend this golf watch to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Good watch distance finder.",
      "text": "I like the distances to the penalty areas. I like getting a reading to the end of fairways and find that the numbers are pretty close to the actual numbers. I am glad I made this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Griner",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Buy a different brand. Dumb way to charge watch. Your’t sweat is on electrodes constantly.",
      "text": "Had to get a second one. First one lasted a few months and went dead. Had to fight company which isn’t bushnell anymore. Ended up going to attorney general of Kentucky to get a new one. Can’t reach by fax, Don’t answer letters or phone calls.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Accurate Golfing Watch",
      "text": "I like the ease of use with this watch. It holds the time and is accurate with yardage of the golf course.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Get what you pay for",
      "text": "Works well on the course. Charging bracket is not designed well and difficult to attach",
      "rating": 4.0,
      "verified": true,
      "author": "Jweiser",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great item but battery good for one round",
      "text": "The only negative that I see so far after about 10 rounds of golf over a couple months is the battery life. I find after a full charge it lasts that first round then turn it off and only makes it about halfway through a second round before it needs recharged.",
      "rating": 4.0,
      "verified": true,
      "author": "Miz",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Good product",
      "text": "Only used one time looks like it works good and has a better band than Garmin , that wanted over $70. To replace band only. Bushnell is better.",
      "rating": 4.0,
      "verified": true,
      "author": "John Keegan",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Battery issues RESOLVED!",
      "text": "It was great for the first 2 months, then it died and would not charge. So far have not heard back from email sent to Bushnell. (2 days) Update: I talked with someone at Bushnell who totally resolved the problem! No need to send the watch in for repair!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne Martin",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Easy to read and accurate",
      "text": "Watch works just a described. Upon arrival at golf course, watch will load courses nearby and you hit the one you are going to play. It locks on to satellite and is ready in just a few minutes with the yardage to the front, middle and back of the green of the hole you are playing. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert N Whiteside",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "You decide whether it's worth it.",
      "text": "Difficult to read screen while on the course. A month into ownership I still have difficulty getting from and to the watch setting.",
      "rating": 4.0,
      "verified": true,
      "author": "Maestro59",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Works great",
      "text": "This does exactly what it is suppost to do. Very accurate and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted M. Bonner",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice for playing golf",
      "text": "I love being able to look at my arm for a yardage. I can't get the pedometer to work, but that's not what I use it for anyway. Nice product!",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie C. Norris",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Battery Life is far less than advertised!",
      "text": "I like this watch/gps very much, however, their advertised battery 'life's 12 hours is more like 5 hours+/-. I have contacted customer service twice but have yet to receive a response from a live person.",
      "rating": 3.0,
      "verified": true,
      "author": "CJS",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Worth the price",
      "text": "I like to watch a little bulky not sure about distance accuracy yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald Nicolini",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Five Stars",
      "text": "Getting used to it now after my other Bushnell. Appears far more accurate and stylish too.",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy T.",
      "helpful_votes": 2,
      "publication_date": 20180730
    },
    {
      "title": "Good Product.",
      "text": "When I first got the watch it gave the wrong distances. Customer service quickly identified the issue, it was set for meters rather than yards. Going into set-up quickly corrected the problem. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Outstanding - range finder on your wrist",
      "text": "Love distance to front middle back on my wrist Speeds up play and improves scores",
      "rating": 5.0,
      "verified": true,
      "author": "C. Wichmann",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "I would not recommend this product",
      "text": "pedometer is not even close to accurate, it is difficult to use on the golf setting, the buttons are sticky and the housing broke where the pin attaches to the band.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy L. Anderson",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "easy, simple and accurate",
      "text": "Works right out of the box.Recently downloaded Bushnell app , syncing your smart phone to the watch.This provides you view of entire hole as you are playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank B.",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "the strap broke after 2 months of use",
      "text": "the digital displace is so poor, its hard to read nos.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniyal Hameed",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Good GPS golf watch",
      "text": "Good, basic golf GPS watch. Easy to read, accurate yardages.",
      "rating": 5.0,
      "verified": true,
      "author": "J19",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "JUNK !!!!!!!",
      "text": "Serial number was registered to someone else, Bushnell sent new one, the booklet instruction sheet was in a foreign language, Bushnell couldn't make it work, so I sent it back for a refund. Don't buy one of these!",
      "rating": 1.0,
      "verified": true,
      "author": "Jon C. Anderson",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Decent Accuracy - Difficult to Operate",
      "text": "Much less battery life than previous model and difficult to attach the charging cradle. Hard to even change the time on this watch. Battery is overheating. Would like my money back.",
      "rating": 2.0,
      "verified": true,
      "author": "J. A. F.",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "All around poor.",
      "text": "It’s not very bright The golf app was all over the place and it totally jammed up half way through the round. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Works well with all the golf courses my hubby plays.",
      "text": "Farher’s Day give for hubby. He likes it very much once he learned to use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Paula J Katcham",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Replace your Sky Caddie with this watch.",
      "text": "I replaced my Sky Caddie with this watch. The sky Caddie battery died before my subscription. This watch is more accurate and reads accurately almost instantly. I won’t go back",
      "rating": 5.0,
      "verified": true,
      "author": "linda k whalen",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "GPS accuracy is excellent",
      "text": "It took several attempts to pair via Bluetooth with the Bushnell App but finally succeeded. Overall this is an excellent device. The manual could be improved.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Cameron",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Great golf watch, horrible pedometer",
      "text": "Bought this for my husband. He says it works great as a yardage GPS but is a horrible pedometer. He decided to keep it for the golf but it is basically useless for counting steps.",
      "rating": 3.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "This GPS watch does exactly what I need it to do.",
      "text": "I use the front/middle/back yardage and it is quick and accurate. Once you start it, it's is ready way before you are, every shot, every hole. I do not use the other functions, I bought it for golf!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "How to operate all features.",
      "text": "cannot figure out how to use various features like clock during play and keeping score. Instructions is minimal and I have asked numerous times for a help call which never came. Often disagree in yardage with other players watches. Can I return this?",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Downing",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Excellent Golf Assistant",
      "text": "Works great with the cellphone app! Has helped improve my game tremendously. I recommend for helping any golfer get a handle on determining club distances. Very affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Cushion",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Works fine, all golf courses in there",
      "text": "Works well. Black and white display. Snap on charger connectors a little tough to use",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer Logan",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Great product",
      "text": "Great product. If you pair it with there app, it's really amazing. Only problem, it kills the battery on your phone.",
      "rating": 5.0,
      "verified": true,
      "author": "thomas j murray",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Useful, but basic",
      "text": "Expected to get two rounds out of it, but will only do one. Charger fitting seems breakable -time will tell.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh10k",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "My opinion",
      "text": "Took awhile to get used to. It is harder to operate than the my old Bushnell but it works very well & is accurate. I have to charge it after every use.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna E Mountney",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Great watch!",
      "text": "Bought for Christmas for my husband. This is his second one. He loves it especially because it’s so easy to use and understand. Excellent battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Camp",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Battery life",
      "text": "Battery life is lower than past gps watch I have had.",
      "rating": 5.0,
      "verified": true,
      "author": "HW",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Charge it and your good to go for 24 hours",
      "text": "I am very happy with my Bushnell watch ! Aside from a very low handicapper who wants exact yardage to flag, this is the next best thing. I am a single digit handicap year around and this watch is perfect for me. ⛳️",
      "rating": 5.0,
      "verified": true,
      "author": "Bloomer3 ",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "so far this gps is about 10-15 yards off almost all holes",
      "text": "I like to wear this so I don't have to carry it around. However, it's not as accurate as I hoped. I also have a hard time reading the face in sunlight.",
      "rating": 4.0,
      "verified": true,
      "author": "barbgoread",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "HAVING DISTANCE YOU CAN DEPEND ON.",
      "text": "This is my second Bushnell, the first a NEO kept losing its wrist band, Irepaired it 3 times before giving up on it. I hope this one does much better, as I have enjoyed using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy oneal",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Does NOT keep track of steps accurately in comparison to iphone. Very frustrating.",
      "text": "Will not keep track of steps. Does a great job of distance accuracy on the golf course.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Nice unit, accurate, compared to my laser.",
      "text": "Only got 2 1/2 rounds out a a charge. 3 is advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Snyder",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Works great",
      "text": "This is awesome to have golfing. Love being able to see the distances to green, hazards... Very accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Shorter",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Wow what a game changer for me.",
      "text": "I used my watch for golf and it was very accurate. Broke it, stupid mistake, and immediately ordered another exactly like the first. Very pleased with it. It makes club selection a snap.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "LIKE IT",
      "text": "Works great. Compared yardage with my buddy's Garmin and another buddy's Golf Buddy, it was spot on. I wear it as a watch too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Fast easy to use",
      "text": "Very easy to use, convenient, I had the Neo Ghost which I loved, but the Neo Ion 2 watch is even better. I don’t have to dig it out of my pocket or drag out my cumbersome rangefinder",
      "rating": 5.0,
      "verified": true,
      "author": "William Laflamme Jr",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "that the distances were correct",
      "text": "not as easy to use as the garmin I had!",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Wagner",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Good looking and comfortable and good distances.",
      "text": "Distances are good. Would like to be able to see time on same screen as golf.",
      "rating": 4.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "I should have got a Gorman!!",
      "text": "It is very hard to operate. The battery dose not last very long. I am not happy with this golf watch at all.",
      "rating": 2.0,
      "verified": true,
      "author": "anthony Carroll",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "i am very pleased with this watch",
      "text": "watch works beautifully and batter life is better than my previous Garmin Watch",
      "rating": 5.0,
      "verified": true,
      "author": "gary",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Reliable, accurate, very convenient",
      "text": "The battery life is somewhat limited but everything else is great about this device!",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas W.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great GPS golf watch",
      "text": "The watch is more accurate then my previous one. I liked my other one but it fell off a deck at the shore and landed face first and broke!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Difficulty of use",
      "text": "Extremely difficult to use. Poor instructions and very small print. Not at all user friendly!",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne Hoonan",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Purchased 2x - both times, battery didn't last",
      "text": "Purchased 2x and both times, the watch failed to stay charged for 18 holes for more than a few months. Impossible to reach Bushnell customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Traci Mayer",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Gift that keeps on giving correct yardage.",
      "text": "Bought it as a gift and it seems to be doing as intended.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Douglass",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Terrible Golf Watch",
      "text": "Lasted 2 rounds, before the heat killed it dead at 105 degrees.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Gives the information I need accurately.",
      "text": "Have only used for two rounds but very pleased. The price was great and the delivery time of three days, no charge was really nice. Yardages were accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hunter",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Good value with lots of courses pre-loaded",
      "text": "Only complaint is the On/Off button can be a little touchy. Harder to turn off then on. Other than that, really like the watch.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "weekend warrior golfer",
      "text": "wish the back light was brighter, and the hole number was larger. That being said the accuracy is very good for most amateurs.",
      "rating": 4.0,
      "verified": true,
      "author": "greg fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "GPS yardage does not work",
      "text": "GPS yardage is not accurate...not on all holes...but enough...it is off sometimes by 15-17 yards",
      "rating": 2.0,
      "verified": true,
      "author": "David M Gallagher",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Easy",
      "text": "Good GPS, accurate and easy to read. The hazard function can be a bit tricky.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg Thomas",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "GOOD PRODUCT WITH QUESTIONABLE BATTERY LIFE",
      "text": "I bought the same product last year and the battery failed, i.e. would not charge beyond two bars after using the product for about a year.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Williams",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Battery does not charge",
      "text": "Battery was hard to charge and quit working after a month",
      "rating": 3.0,
      "verified": true,
      "author": "Gale Hicks",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Returned",
      "text": "We returned this product as it was not what expected",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Move buttons",
      "text": "I don't like the buttons sometimes touch my hand when I raise my hand back towards my arm.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly Jo Centers",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Worth the money.",
      "text": "Easy to read, reasonably accurate, very comfortable, a little complicated.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl E Davis",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Great value and accuracy",
      "text": "Great watch and has worked great all summer. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Freeland",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "yardage not accurate compared to a hand held laser",
      "text": "watch was slow and yardage was not accurate. Strap too tight on wrist.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    }
  ],
  "product_meta": {
    "title": "Bushnell Neo Ion 2 Golf GPS Watch",
    "description": "Bushnell Neo iON 2 GPS Watch Sleek, comfortable design with reversible band and wireless course updates. Preloaded with 36,000+ courses in more than 30 countries. Long battery life – play 3 full rounds before charging. Key Features Bluetooth Allows for Wireless Course Updates Long Battery Life – Play 3 Rounds Before Charging Preloaded with 36,000+ Courses in 30 Countries Easy-to-Read Front/Center/Back Distances Up to 4 Hazard Distances Per Hole Auto Course Recognition & Auto Hole Advance Shot Distance Calculator & Round Odometer Integrated Fitness Step Counter USB charging/sync cable included Bushnell Golf App Included with Purchase",
    "rating": 4.3,
    "feature_bullets": [
      "Bluetooth Allows for Wireless Course Updates",
      "Long Battery Life – Play 3 Rounds Before Charging",
      "Preloaded with 36,000+ Courses in 30 Countries",
      "Easy-to-Read Front/Center/Back Distances",
      "Up to 4 Hazard Distances Per Hole",
      "Auto Course Recognition & Auto Hole Advance",
      "Shot Distance Calculator & Round Odometer",
      "Integrated Fitness Step Counter",
      "Bushnell Golf App Included with Purchase",
      "Operating Temp Range : -10C to +60C"
    ],
    "specifications": {
      "Department": "Unisex-adult",
      "Date First Available": "April 18, 2018",
      "Manufacturer": "Bushnell",
      "ASIN": "B07CHXBTVC",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Golf Course GPS Units",
      "Sports & Handheld GPS",
      "Sports & Outdoors",
      "Electronics",
      "GPS, Finders & Accessories"
    ],
    "price": 199.99
  }
}