{
  "website_summaries": [
    {
      "verdict": "A budget-friendly foam mattress with an industry-leading trial period.",
      "pros": [
        "Received high scores on responsiveness and pressure relief",
        "Great combination of foam layers providing multi-level support",
        "Strong customer reviews and best-in-class customer benefits including a year trial period and lifetime warranty"
      ],
      "cons": [
        "Not made in the USA, but that is not an issue for all consumers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A premium mattress that provides flexible yet firm support for a lower price than many competitors. The superior trial period and warranty add to its value.",
      "pros": [
        "Earns praise for providing just the \"right level of firmness\" that isn't too soft or hard",
        "Easy to set up",
        "5 layers include a durable base and cooling gel memory foam",
        "You get 2 premium pillows along with a mattress",
        "Comes with a 1-year trial period as well as the company's forever warranty"
      ],
      "cons": [
        "Rare complaints of shipping that took longer than anticipated, but this is a minor concern"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "One of the most popular foam mattresses on the market that comes with a long trial period and lifetime warranty that add to its value.",
      "pros": [
        "Owners rave about this mattress's memory foam construction that feels just right - not too firm or too soft",
        "Top gel layer is breathable and cooling",
        "365-night trial and forever warranty add peace of mind to your purchase"
      ],
      "cons": [
        "Rare negative reviews, as most owners rave about this mattress's comfort and quality"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Mattress is super comfortable and unlike some other models",
      "text": "Mattress is super comfortable and unlike some other models, cool all night long. Once delivered, installation was quick and easy. It came in a duffle that was slightly damaged. It appeared to have been dragged during delivery, but it is quite heavy. We were concerned about the smell due to reviews that we had read, but we noticed no odor and were able to use the mattress the same day. The pillows are very thick, too thick for our liking, but they have a zippered closure that allows you to remove foam for individualized comfort. The NECTAR mattress is one of the best purchases we've ever made.",
      "rating": 5.0,
      "verified": true,
      "author": "mbridges",
      "helpful_votes": 412,
      "publication_date": 20180629
    },
    {
      "title": "Perfect firmness for me",
      "text": "Pretty ideal mattress, I was looking online for awhile which one to buy and decided on this one. It’s a bit firm which I love, and I sleep perfectly through the night, no pain, no tossing and turning, it’s still cold where I live so I can’t attest to it running too warm or not but so far so good. The free pillows aren’t my favorite, I wouldn’t say why yet, I think they still have a bit of a smell I haven’t aired them out well, but they aren’t my primary pillow so it’s fine... plus they were ‘free’ in the purchase so I can’t really complain.",
      "rating": 5.0,
      "verified": true,
      "author": "richard Baylis",
      "helpful_votes": 416,
      "publication_date": 20180414
    },
    {
      "title": "Great mattress, I just wanted something more soft.",
      "text": "We ended up buying something else after we felt this mattress, because it was just too firm for us. I’d say it’s a medium-firm. It’s nice, but I really love to melt into my mattress and not feel anything under me. If you like a medium-soft, soft, or extra-soft mattress, this isn’t the one for you.",
      "rating": 4.0,
      "verified": true,
      "author": "JLT",
      "helpful_votes": 423,
      "publication_date": 20180621
    },
    {
      "title": "A good night's sleep for a good price",
      "text": "First night my husband's had a good night's sleep in a long time! He said he also woke up with fewer aches and pains. I also love the mattress. We've purchased two XL for use on the Leggs & Platt adjustable bed. So far it's a winning combination. The extended \"try it\" program was a major reason for choosing Nectar. I don't think we'll be returning the mattresses.",
      "rating": 5.0,
      "verified": true,
      "author": "SandraM",
      "helpful_votes": 514,
      "publication_date": 20180406
    },
    {
      "title": "Fake I believe.  updated",
      "text": "We have a king size Nectar mattress purchased directly from Nectar. This one is nothing like it. This mattress is way softer, you sink in. It only had one pillow that is made with a completely different fill material than the real nectar. There were no materials about the warranty or even the special little mattress opener. I think this is a counterfeit. I am very disappointed. Update According to the company. The mattress is genuine after checking the tags. This is unfortunate because this means that they have lessened the quality of the materials.",
      "rating": 1.0,
      "verified": true,
      "author": "SIMPLY SOONEY",
      "helpful_votes": 105,
      "publication_date": 20181121
    },
    {
      "title": "Doughy..uncomfortable..returning",
      "text": "Very nasty chemical smell that does not go away even after 3 weeks, I don't even have allergies and I wake up coughing. The mattress itself is doughy and not like my older tuft and needle which I had before I moved. All in all ..not happy...thank god for the ability to return..keep in mind if bought through amazon only have 30 days to return..so will say that if you really interested in buying buy it from the main shoe with a year policy. Will keep updated on the return processed through Amazon. Currently, a representative has filled out a form and said will reach out to me for pickup.",
      "rating": 1.0,
      "verified": true,
      "author": "Compulsive Shopper",
      "helpful_votes": 85,
      "publication_date": 20180715
    },
    {
      "title": "I really wanted to love this bed for the sake of my bad back",
      "text": "I really wanted to love this bed for the sake of my bad back, but it did not help with the pain. It seems like a great mattress, built very nice, shipped fast, but it's just not for me and my back. I would say it is on the stiff side.",
      "rating": 2.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 60,
      "publication_date": 20180607
    },
    {
      "title": "One Star",
      "text": "How do you pack this up for return?! Hard as a rock..",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 66,
      "publication_date": 20180726
    },
    {
      "title": "Better to buy from Nectar directly...these are subpar in quality on Amazon.",
      "text": "Inferior as opposed to other Nectar mattresses. I’m confident this is counterfeit or a step down from Nectar’s normal mattress. Ordered from Amazon. Won’t issue a refund. Working with Nectar...yeah. Bots and hang ups. Amazon Nectar. 3 layers of foam. Nectar direct. More Amazon Nectar. Pillows have shredded foam. Nectar direct. Pillows have extra padding, quilting, and vents. Amazon Nectar. Bed has less quilting. Different fabric on sides, and is 9” tall. Nectar direct. Bed is more plush. Even the cover has foam sewn in. Flannel fabric on the sides. And is 11” tall. So you tell me AMAZON. What the hell kind of scam are you running here? Video coming soon to show the difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan Daniels",
      "helpful_votes": 49,
      "publication_date": 20190322
    },
    {
      "title": "I have chronic back & neck pain.",
      "text": "I have chronic back & neck pain and have been thru several mattresses including Casper and a $ 1.050 Seally Euro Plush top and was hoping the Nectar would be the one to help with my pain but to my surprise I gained more pain to my hips & shoulders while laying on my side. The bed is a quality made mattress but it’s just to hard for me. Good Luck 🤔 For Returns make sure you tell them UPS CAN’T fit a open Mattress on their trucks !!!",
      "rating": 2.0,
      "verified": true,
      "author": "Bruce ",
      "helpful_votes": 66,
      "publication_date": 20180711
    },
    {
      "title": "Terrible noxious smell",
      "text": "The mattress and pillows and smell terrible. I’ve had it about a month and it has not gone away. I don’t even let my kids sleep on it because it can’t be good to breathe this.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Contaldo",
      "helpful_votes": 57,
      "publication_date": 20180719
    },
    {
      "title": "Nectar Mattress review",
      "text": "The mattress releases a odor as it expands Nectar tells you and it will go away soon. I've had mine sense late August. It still has a terrible odor as of today October 12th 2018. I had to move it to a room we don't use and close the door. Almost smells like urine, my best description. I kept my old mattress during the trial period thank god. I am trying to return it calling the service number 888.863.2872 with no luck, three days several attempts each day...busy signal is all you get! DO NOT BUY THIS MATTRESS!",
      "rating": 1.0,
      "verified": true,
      "author": "Red dog",
      "helpful_votes": 22,
      "publication_date": 20181012
    },
    {
      "title": "Received a damage one",
      "text": "After reading all great review about this product, I have received this in a damaged condition ( big puncture in the mattress) which I noticed after opening the bag. Returning was a painful process",
      "rating": 1.0,
      "verified": true,
      "author": "𝓡𝓪𝓭𝓴𝓻𝓲𝓼𝓱 🏆",
      "helpful_votes": 24,
      "publication_date": 20180726
    },
    {
      "title": "Hard as rock, worst",
      "text": "Like sleeping in floor. So hard, by whole body hurts from sleeping on it. I was blinded with so many fake reviews and i decided to get one. Big regret Pillows are so thin, like they forgot to fill them up, i know they come \"for free\" but man,it is funny,i had to include picture also",
      "rating": 1.0,
      "verified": true,
      "author": "SRDAN KRSTIC",
      "helpful_votes": 19,
      "publication_date": 20181126
    },
    {
      "title": "This mattress is not as described.",
      "text": "This product was not as advertised. It is supposed to be an 11 inch mattress. Mine started out at 8 inhes but did increase to 9 inches after several days. The top of my mattress was perfectly flat not the Quilted gel foam as was shown and described in the picture. I was hoping to sleep better on this mattress as I wake several times during the night but that has not changed. I don't think this mattress is anything special. I particularly don't like that I paid $700 for a mattress that was not as described. I will be returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "CJ Ford",
      "helpful_votes": 11,
      "publication_date": 20190827
    },
    {
      "title": "Do NOT buy through Amazon",
      "text": "Huge mistake to purchase through Amazon vs Nectar directly. Amazon states 180 free trial under product details however VERY difficult to return and get your money back. If interested in this mattress buy through nectar direct.",
      "rating": 1.0,
      "verified": true,
      "author": "Colleen Ibscher",
      "helpful_votes": 16,
      "publication_date": 20181227
    },
    {
      "title": "Worst Product. Don't buy this and waste your time and money",
      "text": "Bought this product from Amazon because the product comes with 180 days trial and forever warranty. But after receiving the product, the bed did not expand well even after several days to the described dimension. The worst thing is that the bed expanded unevenly with the middle of the bed at 11 inch and the ends of the bed at or 8 inches. It was very awkward to sleep in the bed and it felt like I am sleeping on a bell shaped bed. Instead of getting a nice sleep I was only having sleep ness nights and woke up with body pain. Would never recommend this brand to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Arivanandam Sankaranarayanan",
      "helpful_votes": 10,
      "publication_date": 20190617
    },
    {
      "title": "Not comfortable at all!",
      "text": "This mattress is like a rock! Way too hard! Horrible!",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany Graf",
      "helpful_votes": 19,
      "publication_date": 20180726
    },
    {
      "title": "Writing a Review at 5 AM because i didn't get any sleep!",
      "text": "This mattress is utter garbage. My back is sore, i haven't slept all night. it doesn't form to you, it doesn't budge at all the way memory foam should. I would have slept better on my driveway. I started the return process yesterday, UPS wont pick it up. Amazon told me to keep it and they reimbursed me 100%. Cool, thanks, but i wouldn't give this mattress to the homeless. I am going to call Nectar directly to see if they will send me a real mattress and not this fraudulent garbage i got from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "gloria eadeh",
      "helpful_votes": 10,
      "publication_date": 20190716
    },
    {
      "title": "Missing contents - No duffel bag, no paperwork/warranty, missing a pillow",
      "text": "Missing contents - was this a return/reject that was sold on Amazon as \"new\"? No duffel bag. No paperwork/warranty. Missing one of the pillows. No tool (as shown in video) and excessive 3 layers of plastic wrap that I had to tear by hand to avoid damaging mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 10,
      "publication_date": 20181121
    },
    {
      "title": "Very hard",
      "text": "Shipping was fast. Item came UPS out side package had a little rip in it, no big deal there. Put it on the bed unrolled it let it expand. It is really good quality but it is very hard. We are going to have to buy a softer foam mattress pad to put on top of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Arron",
      "helpful_votes": 12,
      "publication_date": 20180515
    },
    {
      "title": "Good mattress, great trial period, though make sure you place it before unwrapping",
      "text": "I would call this a firm bed, not soft, yet not hard either. Went to this from a sleep number bed so take that into consideration regarding firmness. One thing I would point out is this mattress is heavy, before you puncture the plastic that it's wrapped in, make sure you have it where you want...once it expands it becomes very difficult to move without a team of volunteers lol",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Drynan",
      "helpful_votes": 9,
      "publication_date": 20180710
    },
    {
      "title": "Worried for Nothing!",
      "text": "It seemed like a lot of the reviews were hit or miss, so after ordering a Cal King Nectar I was stressing a bit...was it going to smell bad, were the edges going to be sloped? Happy to report the mattress is perfect!! It puffed up to the perfect height, and the sides and edges are impressively sturdy...There is no odor at all. It is awesome to sleep on--so comfortable. Since I almost didn't buy because of some other reviews, I had to leave my experience. I would totally recommend this mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20191107
    },
    {
      "title": "The mattress was not what I thought it would be",
      "text": "My husband and I both have back pain issues and we thought if we bought this mattress, based on all the reviews we have read, it would help eliminate our pain and help us to sleep better. It hasn't helped as of yet and we have had the mattress about 2 weeks. We are going to give it another week or so, if not, we are going to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Sergas",
      "helpful_votes": 4,
      "publication_date": 20200518
    },
    {
      "title": "Wow",
      "text": "This mattress is AMAZING. I have MS, so my traditional pillow top mattress just wasn't cutting it anymore. I opened it and put it on my frame, and it inflated to the full size in about 15 minutes. There was a slight chemical smell, but after about 5 hours of airing out, the smell was gone. First night I slept on it, I did not wake up once during the night and woke up with zero pain. I wasn't sure if I would like the enclosed pillows because I'm used to a fluffier firm pillow, but as soon as I laid my head on it I was out cold. Will definitely recommend to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "ART",
      "helpful_votes": 3,
      "publication_date": 20200110
    },
    {
      "title": "Like sleeping on the ground",
      "text": "We purchased a Nectar a couple years ago and it was like sleeping on a cloud. I saw the Amazon Deal of the Day where the Nectar mattress was on sale so I decided to buy another one. That was a mistake. It was Nothing like the one we used to have. I woke up aching all over because it was like sleeping on the ground, it was so hard. I have no idea if the mattresses sold through Amazon are different than the ones sold directly from their website, because it was not the same mattress. Also one of the free pillows never inflated after unboxing it, so that one was useless. Pretty disappointed overall.",
      "rating": 2.0,
      "verified": true,
      "author": "J.H.",
      "helpful_votes": 3,
      "publication_date": 20190422
    },
    {
      "title": "Better than others",
      "text": "Mattress is very comfortable and my favorite part is that it stays cool. Delivered in an easy to open packaging. I was able to take out and open the mattress myself. It was nice to see the mattress come in a duffle bag which I will use for travelling. It didn't have any odors or smells, and t pillows that came with it is very comfortable. Overall, I'm very pleased with this mattress and I'm happy to say this has replaced my Casper mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "hussain h",
      "helpful_votes": 4,
      "publication_date": 20190315
    },
    {
      "title": "Absolutely no back support.",
      "text": "We were very disappointed with this mattress. It was too soft & seemed to create \"craters\" where you sleep. After sleeping on it for a week my husband & I both kept waking up with back & neck pain. We did sleep on it for a full month trying to like it, but did not get any better. The pillows were very hard and not comfortable to sleep on at all. Amazon was wonderful & did give us a full refund, though.",
      "rating": 3.0,
      "verified": true,
      "author": "KStickley",
      "helpful_votes": 4,
      "publication_date": 20190506
    },
    {
      "title": "Not for low BMI side sleepers!",
      "text": "This is probably a good mattress, but definitely NOT right for light weight side sleepers. I'm 5'10, 152 pounds, and for me this mattress was as hard as a rock. I did my best to make it work, even adding a 2\" latex topper, but after 2 miserable months I had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Pasadenian",
      "helpful_votes": 7,
      "publication_date": 20180912
    },
    {
      "title": "Back pain",
      "text": "First of all I feel like the bed did not expand all the way. We waited the 72 hrs. Day 2 of sleeping in the bed and I have back/neck pain. The bed and pillows have a very strong chemical smell. I’m very disappointed I think I’m gonna return this mattress. One more thing if you are above 200lb this bed sinks all the way in I feel like there is no support. Buy at your own risk. I can imagine the hassle to return 🙄",
      "rating": 1.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 5,
      "publication_date": 20181120
    },
    {
      "title": "VERY firm mattress.",
      "text": "Too firm. Like hard firm. Wife’s shoulder goes numb it’s so hard. We were thinking it would let you sink in a little more, be soft, and cozy. Kind of feels like a punching bag with the sheet on. Has that solid feel. Anyways maybe this is what people are looking for in a mattress. It does feel nice when you’re on your back. Definitely not on side and stomach though. Going to request a refund. Sorry it didn’t work out. Some people were complaining about the smell. That does go away after a few days.",
      "rating": 2.0,
      "verified": true,
      "author": "Antonia",
      "helpful_votes": 3,
      "publication_date": 20190308
    },
    {
      "title": "Nectar will fight you on a return",
      "text": "The mattress was just too firm. After going back and forth with Nectar support (they offered me a pillow top before I even said the mattress was too firm so I am guessing they know its like sleeping on a brick) they danced and swerved until the return timeline passed. So the mattress is kinda hard and needs a pillow top Nectar is just garbage customer service. Refusing to let me return my mattress has led me to talk several friends and family buying from them because I make sure everyone knows how lousy their service is.",
      "rating": 2.0,
      "verified": true,
      "author": "KevMtn",
      "helpful_votes": 3,
      "publication_date": 20200103
    },
    {
      "title": "What about my 180 day guarantee?",
      "text": "I’m no longer loving it. It was great at first but my hips always hurt and I have a hard time settling into this",
      "rating": 3.0,
      "verified": true,
      "author": "autumnatic",
      "helpful_votes": 7,
      "publication_date": 20180817
    },
    {
      "title": "365 days trial beware.",
      "text": "Nectar sucks bought because of the 365 day trial (it’s BS) My wife and tried it and was not happy with it. Called Amazon to return it and and said that the 120 day closed and I cannot return it, they said to call Nectar direct and Nectar will not honor the 365 days because it was purchased at Amazon and not them.",
      "rating": 1.0,
      "verified": true,
      "author": "Dgtz",
      "helpful_votes": 4,
      "publication_date": 20191001
    },
    {
      "title": "Fraud, I say!",
      "text": "First of all, it arrived with 1 pillow, not the promised 2. When I complained about this, they made no effort to fix it. When I decided to return the mattress after 30 days, they completely ignored my request for a return. Don't buy this mattress, it is a trap. Get a mattress topper; it works much better at a 1/10th the cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicky Krekel",
      "helpful_votes": 4,
      "publication_date": 20190930
    },
    {
      "title": "... husband a stiff neck and the mattress isn't as comfortable as i had expected",
      "text": "the pillows gave me and my husband a stiff neck and the mattress isn't as comfortable as i had expected. it seems to dent and when i turn over is stays lumpy. not exactly what i hoped it would be. giving it a couple more weeks, but not sure its for us.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180421
    },
    {
      "title": "Love these mattresses",
      "text": "We got one for me and the wife and one for each of the kids. Love these mattresses. Quality at great price. My wife loves that I don't wake her up with my tossiing and turning. And my son, who has always had restless sleep, finally sleeps through the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Wissing",
      "helpful_votes": 4,
      "publication_date": 20180504
    },
    {
      "title": "WHY didn't I do this years ago!?",
      "text": "I feel stupid for wasting my money on anything else. This is the best mattress I have ever slept on. It has eliminated all pain from pressure points and I have gotten the best sleep in years on it. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Marcoe",
      "helpful_votes": 4,
      "publication_date": 20190311
    },
    {
      "title": "A Few Months Later...",
      "text": "When I first got my Nectar mattress I thought it was going to be amazing. After about 6 months of sleeping on it, I've found that it hurts me more than helps me. This bed is not for side sleepers or stomach sleepers. Because of its firmness, you'll find your arms falling asleep constantly no matter how you move. The pillow are uncomfortable as well because they don't allow your head to fully sink into the pillow. It's too late for me to return it now, but I'm definitely going to have to purchase a new mattress soon. I miss my old bed. :(",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Best night sleep I have gotten in years!",
      "text": "I purchased a king sized mattresss and have to say that I havent had a better nights sleep than I had with the Nectar mattress. . I now wake up feeling refreshed and no back pain. I also noticed that I do not wake up in the middle of the night anymore. I would highly recommend mattress to anyone who is looking to replace theirs. Based on the quality, the comfort, the affordable price and the forever warranty.. you can't go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "Iqbal Lakhani",
      "helpful_votes": 3,
      "publication_date": 20190316
    },
    {
      "title": "Great mattress at an affordable price!",
      "text": "I was having sacroiliac pain and realized that the mattress I was sleeping on was pretty old, so it was time for a replacement. After completing research, I decided to go with the Nectar, and I'm glad I did. It arrived quickly, was easy to unpack and set up, had NO unpleasant odor, and is VERY comfortable. It's much lighter than my previous mattress, which makes it easier to change the sheets and move it around. The forever warranty is awesome; if the mattress compresses 1.5 inches or more, they will replace it FREE. Can't beat that. Very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Flint",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Don’t buy!!",
      "text": "Lumpy piece of garbage. Got a cal king, opened it, didn’t inflate right away... 24 hours later, partially expanded but it looks a topographic model of the Hawaiian islands (Giant lumps everywhere). So the item is defective but needs to be packaged for ups to pick it up.. but it was vaccume packed and is now expanded and you don’t have industrial bed packing equipment... the best amazon can offer is that you pack it “as best you can” but UPS will only accept it if it’s “up to their packing standards” which implies you need to spend your money to send back something that was defective.. you see where I’m going with this?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190323
    },
    {
      "title": "ALERT! EXTRA SUPER FIRM MATTRESS!!",
      "text": "This mattress is EXTREMELY FIRM. Do not buy if you like any amount of softness in your bed. We slept on it the first night and got horrible sleep. The second night we tried and I couldn’t take it anymore and had to get the old mattress out and sleep on it halfway through the night. I was sore for days. If you like a firm mattress though this one’s for you. Shipping was fast. The mattress did fully expand in the matter of a few hours. And Amazon was great about processing a return when we told them it wasn’t going to work out.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 3,
      "publication_date": 20190328
    },
    {
      "title": "not the best for me.",
      "text": "This mattress is not as good as I expected. Its more on the soft side than the firm one. I know its supposed to be medium-firm but it's just too soft for me. First night I slept on my back and it was good for the most part. Very difficult to switch positions because it sinks too much. My husband had a better experience with it. He doesn't have back problems. But for me it has been the worst week of sleep of my life. I would much rather sleep on the floor. This mattress was definitely not good for me. I sleep mostly on my stomach or side and on my stomach was very painful.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20200511
    },
    {
      "title": "Amazing, comfortable, and super easy!!!",
      "text": "I ordered two mattresses, 1 twin and 1 full, for my children’s bunk beds and there are amazing! The twin bed seemed a little softer then the full but they are still super comfortable. We let the mattresses rise for a full day even though you may not need to. Also we forget that the pillows come on the bottom on the mattresses when you open them so make sure you take them out before the mattresses inflates! People complained about a smell and we did not experience any smell! They are firm and soft and everything we were looking for in a mattress!!! We have had them for over a month so far and they are perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "mcr",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Most comfortable bed and good customer service.",
      "text": "I didn’t have any of the issue that some other buyers. I opened my bedroom windows prior to opening the box and left it to expand for 24 hours before I slept on it. It expanded perfectly and the corners were even. The smell wasn’t bad and never amounted to anything. I had one problem, a section of the cover was not stitched. I took a photo and sent it into Nectar. I had a replacement in a few days. Still using the mattress for a few months. It’s the most comfortable bed I’ve ever slept on.",
      "rating": 5.0,
      "verified": true,
      "author": "W.",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "AMAZING!!! Wish I would have purchased sooner.",
      "text": "My husband and I have been in need of a new bed for months but I was a little overwhelmed choosing from all the different bed-in-a-box companies. We finally decided to go with nectar as I had both heard good things and they were a little more affordable than most other brands. This bed is the best ever guys. If your looking for a new bed I highly recommend this one! Two thumbs up!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200628
    },
    {
      "title": "Rest",
      "text": "I've not had more than 6 hours of sleep in the bed each night for the past week due to my schedule, but I feel more rested compared to my 15 year old mattress that was tossed.",
      "rating": 5.0,
      "verified": true,
      "author": "EC Teacher",
      "helpful_votes": 5,
      "publication_date": 20190315
    },
    {
      "title": "Too Firm for us",
      "text": "This is a Lovely mattress. It has features we like: timely delivery, doesn’t have the sink in the mud feeling, sleeps cool and has very good edge support. However, we have woken up so sore that we have to return it. We think we might be an exception to the rule. Amazon customer service as usual is extraordinary.",
      "rating": 3.0,
      "verified": true,
      "author": "stormy",
      "helpful_votes": 4,
      "publication_date": 20190310
    },
    {
      "title": "Nectar does not honor returns policy-",
      "text": "This memory foam mattress did not work for me - in fact I had more pain and discomfort after sleeping on it . I only chose a Nectar mattress because of their seemingly great return policy . I returned my mattress within 60 days and they charged a $200* return fee which is a lot on a $900 mattress . At no time during my phone calls for the return did Nectar or Amazon (I called both) ever mention this fee . Very disappointing and certainly an unfair advertising practice.",
      "rating": 1.0,
      "verified": true,
      "author": "SeaMerSC",
      "helpful_votes": 2,
      "publication_date": 20190908
    },
    {
      "title": "Semi-Comfortable?",
      "text": "I am an overweight, 42-year old, inactive male. My wife is 41, also overweight, with back issues. I was fine sleeping on this mattress, although it does not feel like a traditional mattress at all. (Go figure, right? I just didn't know what to expect.) My wife didn't like it, so we are trying to return it. UPS was supposed to come pick it up yesterday and they did not. I'm about to contact Amazon/UPS to find out why. That is frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "Lorn Garmen",
      "helpful_votes": 11,
      "publication_date": 20180629
    },
    {
      "title": "Comfortable, pretty firm.",
      "text": "I used a dolly to get the mattress up to my condominium (elevator) by myself. Placed it on my box spring and opened the packaging. It would have been easier with another person. I slept on it the first night, which I shouldn't have because the gas smell was bad, especially the pillows. It took about five or six days for the smell to calm down enough to not notice it. I would say it totally disappeared after one week. (Best if you can unpack, sleep in another room, use your own pillows for the first few days) Overall, I'm happy with the purchase, I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "MauiDan",
      "helpful_votes": 3,
      "publication_date": 20180815
    },
    {
      "title": "Got yanked around between the manufacturer and Amazon",
      "text": "Mattress was supposed to be 11”. It’s 9” and never expanded to 11”. The free pillows are mediocre. One expanded while the other stayed flat. I had to “fluff” it up to get the foam pulled apart. It never filled like I expected or the photos showed. I called the manufacturer and they told me to call amazon. I called amazon and all they wanted to do was send me a replacement MATTRESS. The lady couldn’t get it through her head that that was impossible and I was not going to try to roll up the mattress. I just wanted the two pillows replaced. Nope. I gave up. Trashed them.",
      "rating": 3.0,
      "verified": true,
      "author": "Phil Sears",
      "helpful_votes": 3,
      "publication_date": 20190406
    },
    {
      "title": "The bad: 1",
      "text": "The bad: 1. It was delivered a day later than promised. 2. When we went to wash the sheets for the first time, there was a snag on the top of the mattress. We're not sure not that happened... just hoping it doesn't spread, and that other rips don't developed. 3. When I sleep near (not on) the edge, I start to feel like I'm going to roll off (I'm 6'1\" 170 lbs) The good: 1. Overall comfortable bed with good support 2. Off-gassing wasn't an issue for us Update: several more tears have developed in the mattress cover, we've only had the mattress for 3 weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "DIY Dan",
      "helpful_votes": 19,
      "publication_date": 20180724
    },
    {
      "title": "Awesome bed.",
      "text": "The Bed: This bed is super comfortable. We use it as our guest bed and our guests said it was the best night's sleep they've had in months. I will say, memory foam isn't for everyone so you may not enjoy it - if that happens return it and stick to a traditional mattress. The Pillows: These are really stiff and tall. THey're free so I don't factor them into the review, but I found them very hard to use. Doing some reading, it seems like you have to break them in but after a week I just couldn't do it anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon H.",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Is this a joke ????",
      "text": "The bed was received looked suspiciously retaped and expanded very quickly with very little off-gassing type of smell. It is horribly out of shape and at this moment I feel like a total dope for spending a $1000 on a king size. It is very heavy and difficult to manage. If it does not expand to a perfect shape as shown in the marketing pics, I will return it. I’ll just come out and say it, right now I hate this thing, I think Nectar sold me a returned mattress which is grotesque. I will post pics in the morning. Good lord......",
      "rating": 1.0,
      "verified": true,
      "author": "David V",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Great mattress",
      "text": "I'm saying that even though I haven't slept my first night on it yet. But I can just tell that this is going to be a fantastic mattress. It's firm, yet soft at the same time. It expands to it's full depth. It's just a good looking mattress and I think it's going to hold up and be comfortable. If I'm wrong I'll be back, but I don't expect to be. I think the claim this company makes are probably true. If you are considering and wondering, go for it. I'm pretty sure you won't be sorry you purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikilet",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "A good night's sleep for a change .",
      "text": "Very comfortable mattress ,. Not what I'm used to , I've used postur- pedic type as long as I can remember . Now at first I had my doub ts ; it's a little soft , I've got a bad back . . But ., I new after the second and third night that it was working out BECAUSE , I've been over-sleeping every morning lately ; first times that happens in very long time , probably a decade . ! That's about it . I like it . Thanks for askin . Later",
      "rating": 4.0,
      "verified": true,
      "author": "Robert JonesBob Jones",
      "helpful_votes": 3,
      "publication_date": 20190620
    },
    {
      "title": "Fake nectar mattress! BUYER BEWARE!!",
      "text": "Imitation nectar mattress, this is not the real deal! Came in a box with no paperwork or any documents. Pillows are torn apart. Mattress top isn’t quilted like the description claims. I should have ordered from nectar website instead of getting swindled by the cheap imitation amazon fulfilled. Reminds me of buying off the “Wish” app haha",
      "rating": 1.0,
      "verified": true,
      "author": "Dustin Wagner",
      "helpful_votes": 5,
      "publication_date": 20190718
    },
    {
      "title": "Reeks of chemicals for months",
      "text": "This mattress never stopped smelling of chemicals. I stopped noticing it Bc I slept in the room with it but guests commented on the string chemical odor it caused. It was the source of my headaches which went away once I removed the mattress from bedroom. I then began to notice again the strong chemical smell once it was in a separate closed bedroom. Sickening. DO NOT buy this mattress. If this is what foam smells like spend a few extra dollars for a real one from an older more reliable company. Total trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Nek Siobud",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Thickness",
      "text": "We've had this Nectar Queen Size Mattress for 4 days, waiting for it to expand fully to the advertised depth of 11\". So far, we have measured only 9-1/2\". Haven't slept on it yet, but already disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "azbelle",
      "helpful_votes": 4,
      "publication_date": 20190325
    },
    {
      "title": "Update : Still Like my Mattress and it didn't have any smell when it arrived.",
      "text": "Figure I will write more than a one line review. Arrived on time and double wrapped Plus the wrap that keeps it together. Did not have a SMELL to it and I hate weird smells. Was ready to sleep on within an hour. I did get on a Lightning deal and saved a little but is well worth it. I am 51 and in decent shape. Had it delivered to my fathers so I wouldn't have to stay home. It fit in the back on my Nissan Sentra and I was able to put it on my shoulder and carry it to the door. Oh and It is comfortable and I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "MathTeacher",
      "helpful_votes": 2,
      "publication_date": 20180731
    },
    {
      "title": "Best decision ever!",
      "text": "I absolutely love this mattress! I chose the Nectar mattress after researching other bed in a box mattresses and conventional mattresses. I'm a hot sleeper, this mattress has a cooling outer layer. I'm obese and don't sink into it. It provides good support without being too firm. Some foam mattresses can be too soft to turn over easily, not the Nectar. Fits standard sheets. Bonus: My kids bought this mattress and an adjustable frame for my birthday, purchased them on Prime Day and saved $700 over factory price. Double bonus: Factory deliveries are taking up to two months to deliver (because the mattress is so popular) and Amazon delivered in one week!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica S",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great mattress, easy delivery and set up",
      "text": "Such an easy upgrade from our old mattress. After a friend raved about her Nectar mattress we decided to try it out too. With the refund guarantee how could we go wrong. My mattress was delivered on day 2 after ordering with prime. I was shocked how small it was when it got here. I was able to move my King sized mattress by myself but definitely needed a 2nd person to get it down stairs. I havent measured it but by later that night my King sized sheets fit perfectly. Now that its expanded and in sheets you would never know it was delivered in that tiny duffel bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Stefanie Guillot",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "AWESOME Mattress!!",
      "text": "Was looking for a new bed and decided to try this mattress because of the reviews plus the 180 day trial period. A little back ground...my husband and I are not small people plus I've had 2 back surgeries so finding a good mattress is VERY IMPORTANT. We've had the mattress for a week now and I could feel the difference the very first night. And each night it got better and better. I was worried it was not going to be a quility mattress because of the low price but the mattress is high quility and worth every penny and then some. The mattress is awesome and you won't be disappointed in the least bit!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "A little firm for the wife so we added a two inch topper and it is perfect for both of us",
      "text": "This mattress is a little firm, but I knew that going in based on product reviews I had read. A little firm for the wife so we added a two inch topper and it is perfect for both of us. A far cry better than what we had which was a much more expensive mattress we bought only a few years ago from one of the name brand mattress stores. If your unhappy with that store bought mattress and you like a medium firm bed to sleep on, try this before you go spend a lot more money on something else from that store that already let you down.",
      "rating": 4.0,
      "verified": true,
      "author": "Don Kyzar",
      "helpful_votes": 6,
      "publication_date": 20180502
    },
    {
      "title": "Almost a 5",
      "text": "Nice mattress , fast delivery, easy to set up . Only thing is that it isn’t 11” thick . Mine topped out at about 9 1/2 “ thick . I am keeping it anyway because of great price & comfort.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr.Shadetree",
      "helpful_votes": 3,
      "publication_date": 20190322
    },
    {
      "title": "1 year update in description",
      "text": "I was sleeping on a Seeley mattress and woke up every morning with back pain. A week after sleeping on the nectar, I no longer woke up in pain. I've been sleeping on this mattress for 5+ months. **1 year update** Still no morning back pain. There is slight dipping in the bed from where me and my husband sleep but not too noticable. I can't use the nectar pillows as they're too large/bulky for me. I need my head to be somewhat the same level as my back to be comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach & Krista W.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "So comfortable!",
      "text": "I had a sleep number bed before this and I have to say that this bed is ten times more comfortable! I also liked the pillows that was included. Their very comfortable and not the cheapie type that you could imagine would be free in a deal. Not these at all very plush and thick. I find them just as comfortable as My Pillow. Great deal all the way around! Quick delivery also!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Wiley",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Good mattress",
      "text": "I've had the mattress about a month and have noticed a difference in pain reduction, especially my hips. There was a slight odor upon opening but it left pretty quickly. I do not like the pillows at all. They are way too high and doesn't seem anyone could sleep on them comfortably. A friend just bought the mattress upon my recommendation.",
      "rating": 4.0,
      "verified": true,
      "author": "Disneychic",
      "helpful_votes": 4,
      "publication_date": 20180811
    },
    {
      "title": "Happy Happy Daughter!!",
      "text": "This was a Gift to my Daughter who took me to the *Purple Mattress Store* In Tennessee Last Year. Lol. I never heard of this store before, so didn't know what to expect!! The mattress is awesome well worth the $$. And has a Life Time Warranty!!! Both website for the mattress on Amazon N Purple Store are the same for Price. However, I chose Amazon because delivery was in 7 days, where the Website was 3 weeks. My Daughter got it a day earlier then expected. Nice touch Amazon!! Also if you have Amazon Cc, or Store Card, your saving soo much more!!! My Daughter Loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "S.H",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Some set up instruction would be nice.",
      "text": "We’ve only had this mattress a few days. My only beef is it comes with only one (1) unboxing/set up instruction: open me from this side-pretty please. Be very certain it is laying almost exactly where you need it to end up when you lay the roll down. Upon cutting the plastic sheet wrapping it up, it quickly swells up and, at 100 pounds, gets a little awkward to move after that. Appears to be well made with a small pillow top built into it. So far, very comfortable, as we are replacing a water bed mattress with this using the same frame. California King is a perfect fit.",
      "rating": 4.0,
      "verified": true,
      "author": "zimmyman",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "The Beast....",
      "text": "I bought the bed like oct 2018 I think.... I wanted the mattress.... I was just about to order it and it went up another 100 in price. Then I around xmas I saw the price dropped big time...... I jumped on it. Bought it.... But the bedroom wasn't ready for it.... remodeling and stuff... but finally got it all together.... The bed was new also. The mattress was like sleeping on a cloud or something... its firm... but soft. I sleep like a million bucks on this.... LOVING IT... its like a mini vacation lol Haven't tried the pillows out yet... but they seem nice...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Not as good as it sounds ( for me anyways ).",
      "text": "I have worked hard physical labor for my income for nearing 30 years. I let the mattress do it’s expanding for 48 hours. It didn’t work for my back at all. I got a sense within the first hour and a half that this mattress was not right for my back. I like this company’s zeal for their product. I am surprised that this mattress caused me discomfort. All the good reviews would’ve told me otherwise. The refund was quick and much appreciated. I do love the pillows and forgot to send them back, I hope they don’t mind. Godspeed!",
      "rating": 3.0,
      "verified": true,
      "author": "Benjamin Bloomdale",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Came in a plastic bag",
      "text": "Starting this bad boy off as 1 star until it earns my trust. Came off the UPS truck in a plastic bag with no warranty information or any of the stuff that the other photos show in the reviews. It immediately inflated to about 9\" and I will monitor how/if it expands over the next few hours and report back. So far seems pretty sketchy for a $900 mattress",
      "rating": 1.0,
      "verified": true,
      "author": "Huink",
      "helpful_votes": 2,
      "publication_date": 20190821
    },
    {
      "title": "a little firm",
      "text": "This is a very good mattress for the money .I am 76 years old and have two bad shoulders and i sleep on my side, that can be very challenging at times I had a 4 inch memory foam topper that i put on this mattress and it made a terrific difference for me. If i didn't have the shoulder problem this would be a perfect fit. I would have rated it 5 stars otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "pvpagpap",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Head and foot do not expand properly, mattress length is different than standard king",
      "text": "Expansion: Mattress does not fully expand at the head and foot of the bed. It’s very comfortable but this will create issues in the future. Measurements: My previous bed frame, mattress and box springs are all King. In this situation, I was hoping to only replace the mattress. However, the Nectar mattress is longer than expected and hangs over the box spring and bed frame. It doesn’t look like Nectar offers a California King so I’m not sure why there’s an issue. If anyone has seen the same thing please let me know. Plan is to request a new mattress and return this one...I’ll update with next steps.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180721
    },
    {
      "title": "I AM LOVING IT",
      "text": "I just moved out and was buying my first mattress. I saw online Nectar was very good rated and the price was fair. It was the best choice. I am not exaggerating when I say, I have never slept so well!!! its just perfect. It's firm and at the same time soft. It does not get as hot as regular memory foam and the pillows are amazing. I recommend to also get the protector recommended by amazon, is very neat.",
      "rating": 5.0,
      "verified": true,
      "author": "Felix A Taveras",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Just what I needed",
      "text": "I was looking for a bed for a while and this matched what I was looking for in terms of price and comfort. I'm a bigger guy and the bed was right kind of softness. I've had other memory foam mattresses where I felt like I was sinking and not the case with this bed. This bed is pretty much what i was looking for. I definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Emanuel Adhanom",
      "helpful_votes": 2,
      "publication_date": 20190312
    },
    {
      "title": "Disappointing",
      "text": "The king size mattress never fully expanded. Both sides were 3-4 inches lower than the middle, also 3 holes in top layer upon delivery, see picture. There was off gassing, especially in the pillows. I wouldn’t use them due to the extremely strong smell. The reason for 3 stars is, 1- the part that did expand is comfortable; 2- Amazon’s customer service is assisting in processing our return.",
      "rating": 3.0,
      "verified": true,
      "author": "Bryan Cooper",
      "helpful_votes": 3,
      "publication_date": 20180720
    },
    {
      "title": "Worth every penny",
      "text": "We love our nectar mattress! This is the second one we have purchased and have highly recommended them to friends and family as well. In an effort to be thrifty I ordered a Nod by Tuft and Needle first because it was cheaper than the Nectar. We never even slept on it because just by sitting on it we could tell it wouldn’t hold up like our first Nectar had. We got our refund for that mattress and ordered the new Nectar the very same day.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie M.",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Good mattress - poor service",
      "text": "The mattress: unrolled just right and took its shape in a few hours. Firm and supportive as well as comfortable. If you are accustomed to a plush top mattress this will feel too firm. It takes a little adjusting. The pillows: Never took shape after shipment. I contacted customer service who promised replacements nearly three weeks ago - but radio silence since. The experience: Good mattress, terrible pillows, hope you don’t need customer service because they disappear when you’ve got an issue.",
      "rating": 3.0,
      "verified": true,
      "author": "stjinnova",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Stuck with this bed !!!",
      "text": "I bought this mattress to replace my old memory foam of 10 years .Ive had this for months to give myself the chance for an honest review and honestly this mattress is very uncomfortable .For the first time in my life I toss and turn and wake up through the night and have horrible lower back pain in the morning .Not sure what the malfunction is but didn’t even attempt to return but wish I would have .",
      "rating": 2.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Hardest Mattress ever",
      "text": "Received mattress for our summer home back in Oct. Unboxed it but hadn't slept on it since. Was so excited to spend the first weekend there in months. It felt like we slept on the floor. This mattress is so hard! Also, one of the free pillows has never fluffed up. Maybe the mattress didn't either which is why it's so hard. I'm very disappointed!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20190217
    },
    {
      "title": "Great buy for the price.",
      "text": "I spent a lot of time trying to decide what \"bed in a box\" company I was going to trust with my money. Overall, I am glad I went with Nectar. Positives are that the mattress is very high quality. The matress cover is super comfortable. And it came with 2 pillows. Negatives are that the pillows aren't the most comfortable. And the mattress takes a while to break in. The nectar mattress is super comfy for me, as a back sleeper. It is definitely more firm than I expected, which was a good thing surprisingly. I wish the pillows were more than just shredded up memory foam.",
      "rating": 4.0,
      "verified": true,
      "author": "Chase Brownfield",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "False Advertising and Bad Customer Service",
      "text": "There is no quilted memory foam layer, and nectar refuses to respond to messages on social media and over the phone alike to solve the issue. You would think that after spending so much money on a mattress you would get what is advertised but that's not always the case I guess...",
      "rating": 1.0,
      "verified": true,
      "author": "Cookie",
      "helpful_votes": 2,
      "publication_date": 20200612
    },
    {
      "title": "Great for sleep, bad for sex",
      "text": "This bed is super soft and lovely to sleep on, it’s like a cloud. However, it is too soft for sex for me and my partner and doesn’t provide enough support or bounce. So if you like that sinking into the bed feeling when you have sex you will enjoy it. But I do yoga and my wrists are quite strong, yet sex on this bed strains my wrists because your hands sink in which puts pressure on the wrists and knees etc depending on the position. I got a King and I’m a bit lazy to return it but I might end up doing so.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180919
    },
    {
      "title": "Defective, but Amazon refunded",
      "text": "We had a king Nectar and wanted a new one for the rental. We got a defective one, as the support was not there like the previous one. I contacted Amazon support and was given a refund immediately. I will try another Nectar, since the previous one was so good. Hopefully this is a one time issue and not indicative of current Nectar quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Carmen D Johnson",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Dreams of Andrew Yang running for president",
      "text": "This mattress rocks, I dream about Andrew Yang and his amazing policies. Human centered capitalism would work so well for all people. I even dream about his YouTube video with Joe Rogan. It blows my mind.",
      "rating": 5.0,
      "verified": true,
      "author": "noodlylord",
      "helpful_votes": 3,
      "publication_date": 20191019
    },
    {
      "title": "no more back pain",
      "text": "love this mattress...i have had spinal surgery and a hip replacement...this mattress is soft but yet firm...I've never had a memory foam mattress before...on my old mattress my back hurt during the night and I would have to walk bent over when I first got out of bed...with the Nectar mattress I rest better and can immediately stand up straight when I get up...after I bought the king size I bought a twin size for my grandbabies bed...as for the pillows they are way too firm and we couldn't use them at all",
      "rating": 5.0,
      "verified": true,
      "author": "Christie B.",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Another defective mattress? Not what I was expecting.",
      "text": "I unpacked it? And set is onto the box spring of my bed frame. It is probably defective because the two end corners are no filling out like the headboard corners have. It was noticeable immediately and the mattress expanded within an hour. I'm writing this 8 hours later and the corners are still bad. You can see in the pics that the bottom left part isn't flush with the box spring and the bottom right is sagged in pretty bad. I flipped the mattress over for these pics in hopes that this position would help the mattress fill out at some point. Not good. I will send it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great mattress from Amazon",
      "text": "Definitely a firm mattress but so comfortable for me sleeping on my side. I’m 6’2 and about 225. I used to have a lot of lower back pain waking up and that’s gone now. Best sleep I’ve had in ages. I’ve bought 2 queens and a king. The queens were both from amazon and the shipping was as fast as expected. The king I bought direct from nectar and I will NOT be doing that again. A 2-3 day shipping time turned into two weeks and then it arrived without pillows. Zero communication from the company during this without me reaching out and even then they never advised the pillows were going to be more delayed.",
      "rating": 5.0,
      "verified": true,
      "author": "Nkh",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Firm",
      "text": "I ordered this for my ten year old son who always has trouble sleeping. Since I purchased this mattress, he does seem to order a few more hours than previously. It is a nice firm mattress without any indentations yet. I bought this about two months ago and so far, I only have good things to say. There has been no chemical smell and the mattress seems to be good quality. hmm, as I write this and see the title of its advertisement, I just realized that I didn't receive the two free pillows!",
      "rating": 5.0,
      "verified": true,
      "author": "BethZag",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Nope",
      "text": "I got a faulty one where both sides didn’t full rise. Contacted support and went through this back and forth deal. Was it comfy? Eh. Was support helpful? Eh. Would I tell my friends to purchase this bed? Nope. In all honesty, I thought the Nectar mattress was alright. Not was plush as I wanted.",
      "rating": 2.0,
      "verified": true,
      "author": "Meep Meep Stephen",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Very Happy so far.",
      "text": "Quality seems to be very good. Unboxing was very easy and mattress expanded fully and evenly within a few hours. My assessment is that the firmness level would be about an 8 out of 10, so it IS rather firm. This is a personal preference so I would suggest doing a LOT of research before you pull the trigger when buying from Amazon since the return process would probably not be too fun. So if you are looking for something rather firm, very supportive of your hips, mid section and shoulders, I would definitely recommend this mattress for you. If you want something a little more plush and forgiving, keep looking.",
      "rating": 5.0,
      "verified": true,
      "author": "David B",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "LOVE THIS BED!!",
      "text": "This is by far the best, most comfortable bed I have ever slept in! I am literally the \"princess and the pea\" when it comes to beds. I have multiple old fractures in my vertebrae and pelvis, and usually have a hard time getting comfortable, falling asleep, and staying asleep. Not anymore. I just cannot say enough good things about my new Nectar mattress. Not too firm. Not too soft. Just right! My dog loves it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Liam's Mom ",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Good product for a great price",
      "text": "I did a lot of research on \"bed in a box\" mattresses, from google searches, amazon reviews and on-line shopping reviews from other companies. The Nectar Queen Mattress has definitely lived up to its reputation and the reviews I read, and the price is excellent! I waited to post this review until I'd slept on it for 60 days, and so far I have no complaints. Based on other Amazon reviews that indicated some defects from third-party suppliers, I made sure my order shipped directly from Nectar, and have received direct communications from the company, as a result. So far, I am very pleased with the product quality and Service from the manufacturer.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy Sue Kierpiec",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Love our Nectar :)",
      "text": "Love this mattress! Especially for the price! What’s said about the time it takes for your body to adjust to memory foam is true. It takes awhile for your body to adjust! -waiting to see how summer goes as far as temp control goes, but so far it’s been great! Not too hot for my husband who struggles with getting too warm at night -doesn’t isolate movement as much as we may have hoped. Can feel when someone is tossing and turning - great combination of supportive, yet comfortable - pillows are great! The ability to adjust the firmness is awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Carly Perona",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Nos good",
      "text": "Between sad and disappointment I live in Colombia South America have to do a lot of research and steps to buy this matress. Find a company that could send it to Colombia. My conclusion don’t believe in reviews of magazines, internet. NO It is deforme It is no a stand size (queen more long and more stress) It makes me sweat I just to have thicker matress (‘miss my old matress) Yes it says I can return it. You imagine how much it will cost to return it. I want to cry all nights",
      "rating": 1.0,
      "verified": true,
      "author": "CaroMolano",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Sagging after a few months",
      "text": "This mattress began to sag a few months after purchase. It slept ok to begin with, not the best, but manageable for the price, but now after beginning to sag it is pretty uncomfortable. And as a side note the company will not honor the 180 day trial and are ignoring my return requests.",
      "rating": 1.0,
      "verified": true,
      "author": "Wayne",
      "helpful_votes": 3,
      "publication_date": 20200304
    }
  ],
  "product_meta": {
    "title": "Nectar Queen Mattress + 2 Pillows Included - Gel Memory Foam Mattress - CertiPUR-US Certified Foams - 180 Night Home Trial - Forever Warranty",
    "rating": 4.1,
    "feature_bullets": [
      "#1 FASTEST GROWING BRAND IN THE U.S. - Recognized as the fastest growing e-commerce retailer by Internet Retailer, Nectar is a memory foam bed-in-a-box mattress designed for every kind of sleeper. Nectar is part of the Resident House of Brands.",
      "TWO FREE PREMIUM PILLOWS INCLUDED - And with every mattress purchase, you also receive two free Nectar Premium Pillows. They will be found within the mattress packaging. ($150 value)",
      "INDUSTRY LEADING 180 NIGHT TRIAL- You can try Nectar risk-free for 180 night and return it if you are not 100% happy (180 night trial is for orders on Amazon only). This is nearly 3 months longer than the industry standard.",
      "NECTAR FOREVER WARRANTY - We guarantee Nectar for as long as you own the mattress. Longest warranty in the business (we checked).",
      "IDEAL SUPPORT FOR ANY POSITION - Optimal level of firmness, coolness, breathability, and comfort. Nectar molds to your body, relieving all your aches and pains. It is firm enough to support you, but soft enough to be gentle where you're sensitive. Even on those 90° nights, Nectar sleeps cool, gently regulating heat for an ideal temperature all night long."
    ],
    "specifications": {
      "Product Dimensions": "80 x 60 x 11 inches",
      "Item Weight": "81.8 pounds",
      "Manufacturer": "Nectar",
      "ASIN": "B07B42DWWC",
      "Item model number": "QUEEN",
      "Customer Reviews": "4.1 out of 5 stars2,135 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#14,726 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 8, 2018"
    },
    "categories": [
      "Furniture",
      "Home & Kitchen",
      "Mattresses",
      "Bedroom Furniture",
      "Mattresses & Box Springs"
    ],
    "price": 699.0
  }
}