{
  "website_summaries": [
    {
      "verdict": "Fully adjustable headset with a rugged design that handles intense activity and excursions.",
      "pros": [
        "Five modes to suit your lighting needs",
        "Ultralight design doesn't weigh down your neck or cause fatigue",
        "Shines 550  lumens and has a 35-hour burn time"
      ],
      "cons": [
        "Not as bright as some users expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poorest Quality Control - Avoid",
      "text": "First off, it is only because of Princeton Tecs abhorrent customer service I am writing this review. Back to back Apex Pro units had black plastic debris floating behind lenses and sealed within the unit, sealed in the box and purchased from Amazon. Tim in Princeton Tecs customer service related their firm had no resolution as it was not purchased direct, and did so on May 26 2020, in a matter of fact manner. He threw Amazon completely under the bus, who was fantastic, and I would completely avoid Princeton Tec. Honestly, it’s absolutely, subpar hyped junk.",
      "rating": 2.0,
      "verified": true,
      "author": "PMG",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "BD icon is out, this one is in.",
      "text": "Great head lamp. Really like the brightness and the even lighting. I felt comfortable on a bike being able to see that far ahead. I've switched to this headlamp from a black diamond icon. My only complaint is that it doesn't have a red light option that sometimes come in handy.",
      "rating": 5.0,
      "verified": true,
      "author": "JwB",
      "helpful_votes": 2,
      "publication_date": 20191017
    },
    {
      "title": "Great Headlamp",
      "text": "I own two Apex Pro and one rechargeable Apex. They are excellent headlamps and have been very useful when backpacking, hiking, climbing and working around the house. I rely on them regularly and appreciate being able to keep both of my hands free. The only reason I rated this specific one as 4 stars is the rated 550 lumens did not seem any brighter than my 350 lumens version.",
      "rating": 4.0,
      "verified": true,
      "author": "treadmark",
      "helpful_votes": 2,
      "publication_date": 20181118
    },
    {
      "title": "Eats batteries",
      "text": "I bought this headlamp because of the good reviews and I prefer an over-the-head strap which keeps the headlamp in place without being really tight on my head. The headlamp is comfortable, but it goes through batteries super quick. I use the headlamp to walk my dogs at night and I have needed to replace the batteries almost monthly. I have spent about 40$ on batteries in the last 4 months. Maybe I just got a defected headlamp? I would like a replacement and wish I had acted sooner to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Bryan G.",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Excellent LIght",
      "text": "We use this light on our technical rescue helmets. Excellent light.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy Crump",
      "helpful_votes": 2,
      "publication_date": 20181219
    },
    {
      "title": "NICE AND BRIGHT",
      "text": "Looks like a quality made product. Light is strong and it's easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "FastEddieM",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Blind without light...not any more",
      "text": "Husband and I fight over who get to wear \"the food one\"",
      "rating": 5.0,
      "verified": true,
      "author": "catherine behrends",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Works great!",
      "text": "Quality headlamp. May be a touch heavy for some people.",
      "rating": 5.0,
      "verified": true,
      "author": "frequent customer",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "I absolutely love these, 4 star is for the short lifetime ...",
      "text": "I absolutely love these, 4 star is for the short lifetime of the batteries and the cost to replace them. other than that....simply perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Mikael",
      "helpful_votes": 2,
      "publication_date": 20180305
    },
    {
      "title": "Five Stars",
      "text": "This was great just what I was looking for Great price",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "The best except for battery life.",
      "text": "I love this headlamp and I recommend it. I used it on an elk hunt out West, a Northern Michigan deer hunt and for working around the house. It's great! It's light pattern is perfect and the modes are simple. My only complaint is that it eats batteries. I'm fine with it because I want the best light but it could get expensive for some.",
      "rating": 5.0,
      "verified": true,
      "author": "JwB",
      "helpful_votes": 0,
      "publication_date": 20201118
    }
  ],
  "product_meta": {
    "title": "Princeton Tec Apex Pro LED Headlamp",
    "description": "Princeton Tec Apex Pro Headlamp - The slimmed down Princeton Tec Apex Pro Headlamp was designed with the unique and ever evolving needs of professional runners and extreme adventurers in mind. The Apex Pro is powered by 2 CR123 lithium batteries protected in a highly durable and waterproof housing.",
    "rating": 4,
    "feature_bullets": [
      "Lighter in weight than the Apex with continued power and versatility",
      "Ideal for professional runners and extreme Adventurers",
      "Lamp: 1 Maxbright LED (Dimmable) 4 Ultrabright leds (Dimmable)",
      "550 lumens; 35 hours max burn time",
      "2 CR123 Lithium (included)"
    ],
    "specifications": {
      "Department": "Mens",
      "Date First Available": "November 17, 2009",
      "Manufacturer": "Princeton Tec",
      "ASIN": "B07K5WZGJP",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hands Free Flashlights & Headlamps",
      "Sports & Outdoors",
      "Flashlights",
      "Tools & Home Improvement",
      "Safety & Security",
      "Headlamps"
    ],
    "price": 69.38
  }
}