{
  "website_summaries": [
    {
      "verdict": "Great for call centers, providing clear and concise conversation.",
      "pros": [
        "Enhances work efficiencies as it's easy to connect and disconnect",
        "Effectively engineered for talking and also great for dictation",
        "Extra features include a mute switch and extension cord"
      ],
      "cons": [
        "Only works with Windows and Mac OS software"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Top notch accessory for video conferences",
      "text": "Great to be able to listen to a video conference without disturbing others. Noise cancelation is a big help too. Generally, fairly comfortable to wear, who wants to wear any of these for too long. Nice mute and volume control on the cable. Nothing negative to say about these, actually bought two more for coworkers.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Very comfortable headset. And works very well with my Windows ...",
      "text": "Very comfortable headset. And works very well with my Windows 10 tablet. I instantly noticed while using this headset that performance has increased. I would recommend this is a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Blade",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "Great Sound",
      "text": "This Headset really works. The sound is great. Love the mute feature. It has improved my work life tremendously.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Awesome low cost for gaming or voice calls.",
      "text": "Plug and play. Works great for online games through Discord or for Skype calls.",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin T Allen",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Could not hear",
      "text": "I had a very hard time hearing anyone on the call. It fit well and very comfortable but couldn't hear so returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "no good",
      "text": "if I could give it zero stars I would have. I work from home and need high quality head set. I ordered this one because it was only one ear. but no matter what I did my clients could barely hear me. I was having to shout.. I paid a lot for this headset and it just sits in my draw had to buy another one",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Not good for work from home",
      "text": "Not noise cancelling, picks up all surrounding noises. Hard to hear through earphone. Causes issues with call connectivity and ability to hear the caller.",
      "rating": 1.0,
      "verified": true,
      "author": "ajD5",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Static noise",
      "text": "The volume turned all the way up still wasn’t very loud. There was quite a bit of static noise when speaking as well. Is not suitable for online teaching because of this. However, it is very comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "nicole",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Works but not good.",
      "text": "CUSTOMERS COULD NOT HEAR ME & I could BARELY hear them as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Asijah Johnson",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Mute indicator light does not last",
      "text": "Not happy... The mute indicator light no longer works and I've only used it for 13 days but I'm part my return/exchange period. Won't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Chloe Fishbough",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Died after one use",
      "text": "This product malfunctioned after one use. A complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan H. Lander",
      "helpful_votes": 0,
      "publication_date": 20190812
    }
  ],
  "product_meta": {
    "title": "VoiceJoy Office Headset with USB Jack Business Noise Cancelling Headset with Microphone, Volume Control Mute Switch for Laptops PCs Computers",
    "description": "Keep your hands off the phone using this headset. You can increase productivity by working on your computer, taking notes, and handling other tasks - hands-free - while talking to your customers. Enjoy the benefits of completing calls faster and with less likelihood of errors. This headset model offers a substantial increase in comfort and productivity over a handset. The most cost-effective headset solution. \n\nSpecification: \nMicrophone type:electret condenser microphone(ECM) \nMicrophone sensitivity:40db¡À3db \nMicrophone voltage:2.0v \nReceiver impedance:150¡À10 ohm\n\nPackage Included: \n1 X Cord with USB Plug Monaural Headset\n1X User Manual",
    "rating": 3.9,
    "feature_bullets": [
      "Attention: NOT For the VOIP phones or Telephones that have USB Port. Compatible with Windows Vista, Windows 7, Windows 8, Windows 10 or later and Mac OS X(10.2.8 or later)",
      "Super Durable: Precision design, quality plastics, unibody headband construction, superior quality microphone makes this call center headset sturdier and more durable",
      "In-line Volume Control and Mic Mute with LED indicator, You could Adjust the Volume of the Headset or Mute from a Conversation if it is inconvenience while Talking.",
      "Multi-Purpose Headset -- can be used mainly for chatting, secondarily for music, and if needed, as a backup to a gamer headset. (It is NOT specially designed for gaming ,please DON'T compare it with professional gaming headsets).",
      "Comfortable wear, compact appearance, human engineering design, Can be uninterruptible using.The headset clip can be stretched freely and comfortable wear."
    ],
    "specifications": {
      "Package Dimensions": "7.4 x 5.63 x 1.54 inches",
      "Item Weight": "6.2 ounces",
      "Manufacturer": "VoiceJoy",
      "ASIN": "B07BRNST1V",
      "Customer Reviews": "3.9 out of 5 stars38 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#163 in Telephone Headsets",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 28, 2018"
    },
    "categories": [
      "Accessories & Supplies",
      "Headsets",
      "Electronics",
      "Telephone Accessories"
    ],
    "price": 27.98
  }
}