{
  "website_summaries": [
    {
      "verdict": "The asymmetric cut and ruffles around the top (front and back) offers a flirty and feminine take on a versatile suit.",
      "pros": [
        "This is a good quality swimsuit with plenty of coverage over the rear",
        "There's just enough control to feel supported without being constrained, and it stays put without slippage"
      ],
      "cons": [
        "The sizes run very small, so check the measurement chart for the right fit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Super flattering",
      "text": "I NEVER write Amazon reviews. Never once. But this suit is so cute and super flattering I feel the need to let everyone know it! I did size up like other reviews recommended but only about 1 size and it fits perfect. Has some rouching to help hide my flabby baby belly and the material is really thick and soft! I'm normally a size 12 or large and ordered a 14. 5'4\", 170ish lbs. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shell",
      "helpful_votes": 406,
      "publication_date": 20180802
    },
    {
      "title": "Great flattering suit!",
      "text": "Wonderful suit! I couldn’t believe the quality of this suit for the price. Lots of support throughout especially on tummy area. Cute rouching. I am 5’5, 130 lb, 36D, and normally wear Medium/8 in suits and ordered a 10 which fit perfectly. Also covers the bottom well. You won’t be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Armbrustmacher",
      "helpful_votes": 195,
      "publication_date": 20181226
    },
    {
      "title": "Perfect swimsuit!",
      "text": "I ordered 3 “cheap” swimsuits from amazon...this one was the best! It is a thick weight. No see through butt with this suit!! It’s lined well. Definitely size up! I am about 5’5” 140lbs and usually a size 8, sometimes size 6. I ordered a size 10 Navy in this suit and it fits very well. It’s snug but not tight. I feel like it sucks everything in well. And the length is just right.",
      "rating": 5.0,
      "verified": true,
      "author": "kJ ",
      "helpful_votes": 142,
      "publication_date": 20181111
    },
    {
      "title": "Pretty, High-Quality Suit For a Great Price",
      "text": "This suit is great quality for the price. The style is super cute. MAKE SURE YOU REFER TO THE SIZE CHART! I wear a size 10 in most clothes but I ordered a 14 because that is where my measurements fall on the manyfacturer’s size chart. It fits perfectly. Remember, ladies - nobody can see the size on your clothing tags but you! 🙂",
      "rating": 5.0,
      "verified": true,
      "author": "Punky Two Shoes",
      "helpful_votes": 158,
      "publication_date": 20180612
    },
    {
      "title": "Very flattering",
      "text": "I am posting from husbands account. I am 5’2 and 130 lbs. I wear 28 jeans and have to buy ankle length or hem them. I’m between a 4-6 in clothing depending on the brand. I’m a 34 D. This suit fits like a glove, is very supportive, has pads for the boob area and a great color. I have very pale skin and the color complements nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 67,
      "publication_date": 20190507
    },
    {
      "title": "Good Quality",
      "text": "Loveeeee it! , very good material. I’ll buy another one in a different color!!",
      "rating": 5.0,
      "verified": true,
      "author": "José C.",
      "helpful_votes": 64,
      "publication_date": 20180815
    },
    {
      "title": "Fantastic and cute suit.",
      "text": "Was hesitant about buyin a suit online but was pleasantly surprised with this one. Fits nice, for me, it was true to size. Ruching in the front is an added bonus for camouflaging problem areas. Would definitely recommend. I’m 5’7” and 140 lbs and got a size 10 and fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "KyleeKim13",
      "helpful_votes": 50,
      "publication_date": 20180815
    },
    {
      "title": "Such a flattering suit!",
      "text": "This cut is so flattering -- the ruffle was just the right size, and I was confident that the lined cups would have withstood any water temperature. This was even flattering on my midsection, where I carry most of my weight (pregnant-belly-forever here), though it's not meant to slim (I think). I'm returning though because I just didn't get enough support for my F/FF bust. The coverage is excellent, and I love this suit, but at the end of day, I probably need something with underwire, and the soft cup wasn't enough. I usually wear a size 12 dress, and the 14 fit me great.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 33,
      "publication_date": 20180520
    },
    {
      "title": "Cute detail",
      "text": "Great suit I would say it runs a little small but it sucks you in in all the right places so that’s a plus I’m 5’6 and got the small For more reviews follow my instagram @misslacyjean",
      "rating": 4.0,
      "verified": true,
      "author": "Lacy Yarrow",
      "helpful_votes": 18,
      "publication_date": 20190415
    },
    {
      "title": "I’m impressed",
      "text": "This is a beautiful swimsuit. Fits great. I bought white and it is not see-through. I can’t wait to wear this at the pool. I probably need to buy this in black or navy too. 5’3 125lbs 32dd Purchased size 8",
      "rating": 5.0,
      "verified": true,
      "author": "Em M",
      "helpful_votes": 19,
      "publication_date": 20180711
    },
    {
      "title": "Definitely order 2 sizes up",
      "text": "I really like the swim suit. It's great quality material, lined. Other reviews mentioned sizing up, they weren't kidding. I 'm a 5'4\", 168# mom with some curviness to my buns and thighs and normally wear a size 10-12. I ordered the size 14. It fits, but I'm afraid to dry it. I probably would have been better getting a larger size. I'm going to keep it, hoping for the best. I really love the single shoulder coverage, the slight rouching at the waist gives a slimming effect. Bonus!",
      "rating": 4.0,
      "verified": true,
      "author": "Julie Mac",
      "helpful_votes": 14,
      "publication_date": 20180717
    },
    {
      "title": "Flattering and comfortable",
      "text": "This suit is extremely flattering. The padding is perfect and the rooching (seriously how do you spell that) makes me look smaller than I am. I typically can’t wear a one piece because I have a very long torso. I am 5’6”, 150-155lb with a muscular build and wear a size 8 in 90% of clothing. I bought a size 12 and it’s flattering but feels just a little too snug lengthwise - it’s either a wedgie or the boob without a strap that I am concerned with! Tough to choose. For the price compared to most suits, I’m going to buy the 14 and see if I love it even more.",
      "rating": 4.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 9,
      "publication_date": 20190301
    },
    {
      "title": "Good quality, sizing way off",
      "text": "Nice quality suit, thick material, nice interior bra & flattering across the stomach. Only taking stars off because it’s boardline too small, even after I sized up (per other reviewers recommendations)! I’m 5’10 & weigh 135lbs & I ordered a size 8 instead of my standard 6. The 8 fits (but just!) & I’m keeping it but I’m almost tempted to order a different color in a size 10 since I like the style & color options but I’ve never been a size 10 in my life. Basically, this company’s sizing is bananas.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20190423
    },
    {
      "title": "Best Swimsuit!",
      "text": "I'm honestly thrilled that I took a chance on this swimsuit. After reading reviews I ordered a 10 (I'm usually a Medium or size 8) and the suit fits perfectly! It holds everything in without being too tight. I love the ruching on the front, since I hate when my belly button shows through a one-piece swimsuit, and the ruffle is flattering, feminine, and draws the eye up. It has full seat coverage too, which is important for me since I run around and bend a lot looking after my little ones. This is the best fitting and most flattering swimsuit I've purchased in a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Applejax",
      "helpful_votes": 9,
      "publication_date": 20190201
    },
    {
      "title": "5’6” 153lbs-Got size 14-love it!!",
      "text": "I’m 5’6”, 153lbs, 36B and typically wear a medium shirt and a 8-10 pant size (medium underwear size). I usually purchased 1 piece suits in a large. I purchased this bathing suit in a size 14 (as suggested by other reviewers) it fits perfectly! The coverage is great, not cheeky on the bottom and the top is very secure for my chest size. There is some ruched in the mid section which helps with any insecurities in that area. I’ll likely purchase this in an additional color since I love it so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyla",
      "helpful_votes": 8,
      "publication_date": 20190604
    },
    {
      "title": "Cute suit!",
      "text": "Got a 6 and it was too tight and torso seemed a bit short, returned for an 8 so we’ll see if that’s better. Color and style are adorable. I’m 5’3”/120lbs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 14,
      "publication_date": 20180702
    },
    {
      "title": "Yes it’s 100% true, best one piece ever!!",
      "text": "Get the next size up. I read other reviews and that’s what I did! This is the best bathing suit I’ve ever owned! I’m very chubby right now. I’m 5’3 and 200lbs. I bought this to go on a cruise with. It was so flattering! I’m actually on a weight loss kick right now and I know the bathing suit won’t fit anymore bc I’ve lost 20 lbs already, and still have more to go but I’ll definitely be re-buying this bathing suit for my new summer body 😂!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. L.C.",
      "helpful_votes": 9,
      "publication_date": 20190127
    },
    {
      "title": "Fantastic Suit!",
      "text": "I am 5 ft 148 lbs, 36 C chest and the size 12 fit perfectly. Not too tight and really looks fantastic! For Petite girls who need tummy control, fully lined and supportive - this is the suit! The built in breast padding is great and really supports while looking nice and not too tight. LOVE LOVE LOVE! I might buy in more colors.",
      "rating": 5.0,
      "verified": true,
      "author": "JRG100",
      "helpful_votes": 7,
      "publication_date": 20190515
    },
    {
      "title": "Great Quality Material",
      "text": "This swimsuit has great quality and thick material. The rouching in the stomach area was great and made it more flattering. Love the one shoulder ruffle and was suprised with the support and inside lining. There is usually not a lot of support in one shoulder swimsuits. Got the burgundy color and I love it! Does run small like the other reviews say. I’m usually a 12/14 and Large sizes but ordered the 16 and it’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Hillary",
      "helpful_votes": 9,
      "publication_date": 20180710
    },
    {
      "title": "Beautifully flattering suit!",
      "text": "I know it’s a swimsuit and they are supposed to fit snugly (hence the 4 stars)but this one almost feels like it has a built-in cincher. I don’t mind it, though- it was just a little difficult to get it on. There’s more ruching on the suit than is pictured online- very flattering and the suit seems to be very well made.Seems to be a great deal for the money. I have the burgundy (it’s a beautiful deep wine color) and will definitely order another suit from this company.",
      "rating": 4.0,
      "verified": true,
      "author": "ASmith",
      "helpful_votes": 4,
      "publication_date": 20190311
    },
    {
      "title": "Very Cute and Good Quality but runs VERY small",
      "text": "I ordered this bathing suit for my mom as a Christmas present. Just received today and tried it on myself to judge if it would fit her. I'm a 5'9, size 6. She's \"mom\" sized, wearing about a size 10 and is probably 5'5. This suit just barely fit me. On a more positive note, its a VERY nice suit, and seems of good quality.. especially for the price! Just make sure you order quite a few sizes larger.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsey B.",
      "helpful_votes": 6,
      "publication_date": 20181209
    },
    {
      "title": "Size up 2 at least",
      "text": "I typically wear an 8, but I had to order this in a 12 and could probably use a 14 if it weren’t for the fact that it would be too big up top. The suit is tight on the tush. I am 5’10” and 145 lbs. I wear an 8 in jeans. I ordered two other suits from this brand in an 8 and they would fit better on a 12 year old. The fabric is good quality and the suit feels very durable. The ruching hides the mom tummy, but you need to size up at least two sizes.",
      "rating": 4.0,
      "verified": true,
      "author": "Whitdiggity ",
      "helpful_votes": 6,
      "publication_date": 20190205
    },
    {
      "title": "Color is way different than expected :(",
      "text": "I ordered the bluebird color and In the picture it looked way more of a light teal it is wayyyyyy darker and different shade than expected :( the fit is just ok I am a size 8 in shorts and size 6 in pants I got the size 12 and I could have possibly gone one size smaller . Just really bummed it’s not more of like a sea foam color like it shows in the pics :(",
      "rating": 2.0,
      "verified": true,
      "author": "Nicolette O.",
      "helpful_votes": 6,
      "publication_date": 20190405
    },
    {
      "title": "Great For Mommas",
      "text": "I am 5’3 140 LB 32D and I bought a size 10. I’m not normally that size but I read reviews that a 6 was equivalent to a 0-2. So I sized up 2 sizes and it fits great. I love the booty coverage , good chest support, and love the rushing in the tummy. Great for mommas if you plan to be chasing your kids at the beach or pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190302
    },
    {
      "title": "Perfect!",
      "text": "This is so cute. I’m actually kind of excited to wear a swimsuit, which is not something I normally say. It’s so hard to find a swimsuit that supports and covers my chests but is still stylish, but this does just that! As other reviewers said, definitely size up. I normally wear a 12 but I bought a 16 and it fits perfectly. The only thing is that the color isn’t quite as shown. I bought the burgundy thinking it’d be more purple, but it’s definitely more red. But that might be my fault for not reading the color description and only looking at the picture. But I still love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 4,
      "publication_date": 20190128
    },
    {
      "title": "Order one size bigger",
      "text": "I am 5' 8\", 170 pounds, with a long torso, and a small chest. I usually wear a size 12 suit, and order tall if its available. After reading the reviews I ordered a 16 to accommodate for length. It ended up being a little too big and I was afraid the side with no strap might dip a little too low and cause a wardrobe malfunction. I'm sending it back to trade for a 14. I ordered the Bluebird Blue color. It's pretty but was brighter than the picture. I may get a different color on the smaller suit. The quality seems good, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190411
    },
    {
      "title": "Great Suit order 1 to 2 sizes up",
      "text": "The material is great. As the other posts I was a skeptic and first time amazon bating suit buyer. Material is department store quality. I was concerned about the elastic on the side where there is no halter, seems very sturdy and tight. I did order 2 sizes up. I am 5'8, I wear a 6-8 normally and got a 12. glad I did the torso fits perfectly. I will handwash and air dry this suit just to be sure. Color is perfect, very pleased with this purchase!!",
      "rating": 5.0,
      "verified": true,
      "author": "SHJ",
      "helpful_votes": 4,
      "publication_date": 20190305
    },
    {
      "title": "Great buy for the curvy gals!",
      "text": "GREAT buy! My measurements are slim 16 or 14ish, 5' 3 1/2, 36DD 179 lbs and have a tummy from kids, somewhat curvaceous. If you care, the shoulder strap is on my left side. I wear 14/16 and I bought the 16 and its perfect. I bought the wine colored on and its probably more of a plum burgundy colored, still very pretty. I love this suit, fun, flattering, yet conservative and sexy!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura J",
      "helpful_votes": 4,
      "publication_date": 20181013
    },
    {
      "title": "Great quality, perfect for long torso",
      "text": "I'm always hesitant to buy swimsuits without trying on first, prime is the only reason I made the leap and did it. This swimsuit exceeded my expectations. I'm 6', 160lbs, 34H with a long torso. I usually wear a M in BR dresses and XL in BR shirts. I was on the cusp between 10 and 12, but I went with the 12 and I'm glad I did, it fits perfectly. It's fully lined and the fabric is thicker than I would have expected for the price. The ruching is great and the suit as a whole is slimming. I would easily buy another.",
      "rating": 5.0,
      "verified": true,
      "author": "Karaoke Krazy",
      "helpful_votes": 2,
      "publication_date": 20190701
    },
    {
      "title": "SIZE UP",
      "text": "It’s a beautiful suit; rich color, thick fabric. It keeps everything where you want it to be, and sucks it all in. Just be aware that it runs very, very small. I ordered an 8 to begin with, then went for a 10. I might even need a 12. For reference, I’m 5’2”, 34B, 120 lbs, with a booty. I normally wear sizes 2-4, so that should give you an idea of the sizing.",
      "rating": 4.0,
      "verified": true,
      "author": "S. May",
      "helpful_votes": 4,
      "publication_date": 20190412
    },
    {
      "title": "Torso is SHORT!",
      "text": "For this bathing suit, I sized up based on the reviews. However, the torso area was still WAY too short. I'm only 5'1\" and the torso was too short for even me. I could barely get the shoulder strap on my shoulder and even when I did, the breast pads were only about an inch or so above my belly button. I bought two bathing suits similar to this style, but assumed this one would fit better since it was the more expensive one. I was wrong & will be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany D Gilmore",
      "helpful_votes": 4,
      "publication_date": 20190605
    },
    {
      "title": "Flattering! Size up and read all reviews!",
      "text": "I’m 5’3 and 167lbs and I ordered a size 14 and it’s perfect. I’m also a 38DDD and for it being a one shoulder I have no issues with any pop outs HA! So I can say I’m very pleased with the way this looks! Very flattering! I have 2 kids and the material on the stomach is nice, helps a postpartum mom feel good! READ EVERYONES REVIEWS WHEN IT COMES TO SIZING! I promise it helps!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurali Fidurski Zmolik",
      "helpful_votes": 5,
      "publication_date": 20180805
    },
    {
      "title": "Very pleased! Swimsuit even better than expected!",
      "text": "I got the Palms print (green leaves with white background) and it is super cute! I thought the suit was very flattering and comfortable to wear. The quality was very good, better than I expected for the price. Very happy with my purchase and would definitely recommend this suit to a friend. I don’t normally like one piece suits, but this is the exception to the rule. The ruffle is cute, and the one shoulder swimsuit style really stands out from other styles. At other reviewers’ suggestions, I did order one size up from what I normally wear and the fit was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole B",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Stylish, great fit, and nice material!",
      "text": "Absolutely love this bathing suit! I was skeptical about ordering a suit online, but it fits perfectly just like all the reviews say! I’m 5’4” and 146 pounds, an normally around a size 8 in pants, and ordered a size up (12) from my normal bathing suit size (10) based on the reviews. Love how it sucks everything in! Material doesn’t feel cheap. My only criticism is that it’s a little tough to get on myself because the ruffles go inside the suit esp on the back but I just have my husband help me lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Li0ns4life",
      "helpful_votes": 2,
      "publication_date": 20190722
    },
    {
      "title": "Order one size up, esp if you are tall.",
      "text": "This swimsuit quality is better than I expected, considering its reasonable price. I sized up because I am 5ft 10 and undergoing chemo, and therefore expect to put on weight, when my treatment is done. I am a size 10 and 145 lbs but ordered a size 14, which is a little loose at the tummy area, but I know it will fill up when I am healthy again. Chest area fits well and butt coverage is good too. Overall. Am satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190815
    },
    {
      "title": "Flattering for this curvy girl",
      "text": "I normally wear a 14 and the fit is true to size. This swimsuit is super flattering and hides my tummy (hallelujah). I have the worst time finding a swimsuit that fits me well and doesn’t make me look like a busted can of biscuits every time I want to swim with my kids. I’ve actually purchased 2 of these. The first looked so good that I had to get one more because I loved it so much. Great value for the price. Maybe this review will help some other woman or man, who has body issues find something they are comfortable wearing.",
      "rating": 5.0,
      "verified": true,
      "author": "KP",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "LOVE, LOVE, LOVE",
      "text": "I LOVE this suit!!!! I did size up one, based on reviews, and it is PERFECTION! I was hesitant to buy a swimsuit without trying it on, but this is a winner!! Built in (non removable) padding, helps keep everything in place, while not moving around or being too thin/thick. The one strap is supportive enough for a large chest, and the backside offers solid coverage, without aging you :) Also, and MOST importantly, the suit is lined with something magical, that makes your tummy look amazing (even after 2 babies)! I cannot recommend this swimsuit enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany Yearty",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "I wanted to like this suit!",
      "text": "I really wanted to like this suit! The material was great and nicely made. I'm 5'9 with a long torso and 200 lbs. I do have a thicker butt and thighs. This was tight around my legs... like cut into my legs. Fit nicely in my mid section and in the chest. But because I'm so long waisted when i life my right arm my whole boob almost comes out the top of the suit! It was a no for me",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "It's just as everyone is saying - A GREAT suit!",
      "text": "I ordered this in the navy based on all of the great reviews, and it is just as everyone is saying - a wonderful suit! I am 46, 5'9\" and 145 lbs., and I ordered a size up than I usually wear (usually a 12) so I ordered a 14 and it fits great. I feel confident and comfortable, and it is very flattering as everyone says. I will be ordering other colors! It feels like a quality suit for the price. And don't worry about any funky tan lines on your chest/shoulders because we are all wearing sunblock now anyway! :) Use the Jergens Natual Glow Instant Mousse (a GREAT product) for color. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Hayes",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Surprisingly Supportive",
      "text": "As someone with a large bust, I tend to avoid this style suit. I am so glad I gave this one a try! It is supportive of a very large bust, and the shelf bra does not dig in and leave an awkward line. The color is great and the ruffle is not overwhelmingly large. I feel secure in this, and not at all like I will fall out the top while chasing a toddler. It does not feel cheaply made. The bunching in the stomach is very flattering. This is a great mom bathing suit that is both supportive and trendy. I cannot wait to try it at the beach!",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "LOVE!!!  5'4\" 125 lbs, Ordered 8/10 Navy",
      "text": "I'll just tell you what I am looking for in a swimsuit review. First, I am 5'4\" and weight 125, wear 4-6 depending on brand. In this suit I ordered the 8/10 as suggested in other reviews based on purchasers of a similar size. It did not disappoint. This suit fits like a glove and I feel SO good and confident in it. I am SUPER impressed. I am a little nervous about the right side sliding down, just because I don't have a huge chest, but I just won't be doing any diving in it. It is cute and sexy, but modest and age appropriate enough to wear in public with my children.",
      "rating": 5.0,
      "verified": true,
      "author": "LSparkles",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Would give a million stars if I could!",
      "text": "I can't emphasize enough how much I love this bathing suit. It fits perfectly. I'm normally a 6 or 8 in clothes, usually a 10 in swimsuits. This fits just as expected. But what makes it amazing is that it's not only supportive (even with one shoulder!), it's just so flattering and chic. It also doesn't cut into my thighs at the bottom, so it's comfortable too. Oh and it's nicely lined and has cups. At first I was kinda like, what's this extra flounce thing on the side? But I love the detail and I could always cut it if someone (my mom) is like, what is that. Whatever it looks awesome, I love it, just buy it already!",
      "rating": 5.0,
      "verified": true,
      "author": "MM717",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great quality, flattering, size up for long torso.",
      "text": "Ladies, buy this suit! I have the hardest time finding one pieces because of my long torso. I am 5'9\" and 170 lbs. I sized up one size to a 14 to make sure it wouldn't be too short in the torso and it fits perfectly. Ruching is really flattering and helps hide my \"mummy tummy\". The cobalt blue color is so pretty; really bold and classy combined with the ruffle/one shoulder. I'll be getting this in more colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Just buy it!",
      "text": "I cannot say enough good things about this swimsuit. I bought a few others to try and should have just ordered this one to begin with but I wasn’t sold on the one shoulder. It’s incredibly flattering and comfortable. I was concerned that the arm hole would be too small like others said because I have that issue with shirts sometimes, but I think it’s just snug to keep everything in place but to me wasn’t uncomfortable. I bought the burgundy and the color was true to the pictures. I am a size 12 or 14 in pants and wear large shirts and the 14 fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great suit!",
      "text": "Love this bathing suit! Great price point! The material is nice and thick but not too thick. I'm not usually a fan of ruching but the ruching on this is great and helps disguise a bit of belly. It's flattering \"on\". For reference, I'm 5 ft 5, 120 lbs. I typically wear a small/size 27/size 4 in clothing but I have broad shoulders and wider hips with a bit of a bust (32D) so I always size up in bathing suits. I ordered a size 6 and a size 8. The 8 gives me more room in the torso and full bust coverage without cutting into the armpit, so size 8 it is! I'm tempted to order another color.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "SO CUTE but runs small- size up 2-3 sizes!",
      "text": "Very cute suit but runs small. I’m a 6/8 in most things (pants, dresses, tops) with a 36D bust and originally ordered an 8 but I couldn’t even get it on. Returned and ordered a 10 and it fits ok but still pretty tight. It definitely holds everything in and gives a flat tummy illusion and is super adorable. I’m guessing if you have a larger bust this may not fit very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Pennytron",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Good coverage and nice for curvy women",
      "text": "Finally a cute suit that holds everything in! I know some reviewers said this is on the tighter side but really I find it to be similar to much more expensive suits designed to hold in a tummy. It is stylish and looks much more expensive than the price I paid. I also like that the bottom has decent coverage but not full granny panties. It really cuts in a nice way to make your legs and backside look nice without showing too much. The one shoulder detail is great as well. I am 5’6” and 38D I bought a size 16 and I feel it runs true to size.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "I LOVE IT!",
      "text": "This suit is exactly what I was looking for. I am 165 lbs, 5’3” & a 38D. I normally wear a size 12 in jeans but ordered the 14 based on other reviews and it’s perfect. I’m only 28 and hate that a lot of these swimsuits either look like grandma suits or are made with people with smaller breasts. I’ve had a kid so mine aren’t perky enough to do all that lol",
      "rating": 5.0,
      "verified": true,
      "author": "KWilly",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "So worth it",
      "text": "Love this swimsuit! As with another suit I bought, I sized up based on reviews only to receive a swimsuit that was wayyyy too big. After returning for my true size, I am in love with the cute, flattering style. I was nervous about support up top, but my D cups stayed just where they needed to be. After kids I’m a one-piece kind of girl, but they can be so dull and boring. This one is adorable. I love the floral print and I also just ordered the double ruffle in navy. At this price, you can get two for what you’d buy one for in a store!",
      "rating": 5.0,
      "verified": true,
      "author": "TeagueNunes",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "High quality, very flattering swimsuit! I love it!!!",
      "text": "This product is wonderful! It’s so hard to get an affordable, high quality swimsuit, especially on amazon, but this one exceeded my expectations! Thick, high quality material that is not see through, very comfortable and flattering. I’m 5’4” 175lbs and curvy, this suit is not cut to high on the thigh and is very supportive and flattering in the chest. I got a 16 and a 14 and the 14 fit better, 16 was a bit loose in areas so I did a very easy return on it and kept the smaller one. Extremely satisfied with this purchase!!!",
      "rating": 5.0,
      "verified": true,
      "author": "jackie gagen",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "I love this bathing suit",
      "text": "I never thought I would write \"love\" and \"bathing suit\" in the same sentence but I really LOVE this suit. The quality is exceptional and it's super flattering due to the extra fabric in the front which hides any bit of a tummy. I got the \"maroon\" colored suit and it's pretty and very feminine with the ruffles. I can't wait to go on vacation and try it out in the pool. I highly recommend this suit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Schumann",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Nice and helps hide belly area",
      "text": "I am 5ft 4in and ordered a large after reading the reviews. The large fits me just right. I am overall very happy with this swimsuit. It has good coverage with still looking stylish and not like an older lady suite. I like the material and love the one shoulder look. My only complaint is that the breast pads aren't sewn in. So because of this they can shift and not be in the right place. I will likely sew them in myself which is what I usually do. I like the ruched look, it helps with belly fat!",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Cutest suit EVER!!!!",
      "text": "Quarantine has left me with too much junk in the trunk, and up front, and I've struggled to find a suit all summer that is flattering. This suit is the cutest. I want to wear it everywhere. I am 5', 130 lbs. and purchased a size 6 and it is SO flattering, especially in the belly area. I purchased the black with lemons and it's a super cute retro print. I'm back here today to buy it in more colors :). Highly recommend if you're carrying some extra mommy weight in front as the ruching hides a lot, especially in black!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin K.",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Runs small but beautiful swimsuit!",
      "text": "I normally wear a womens 8/10 and ordered a 12. It fits perfectly! I love the unique style, the fabric and the rucheting on the front. It covers my bottom nicely which is also a bonus - I'm not 17 anymore ;) I ordered a green one and a blue one and intended on keeping one of them, but I love them so much I'm keeping both! fyi - the green isn't an army green, it's more of a sage green, but it's very pretty!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "Flattering and supportive swimsuit; order up a size!",
      "text": "I can’t believe how much I love this swimsuit! I’m 5’6”, 153 lbs and always wear a size 10 or medium. I ordered this swimsuit I’m a size 12 and a size 14 since most of the reviews said to order up. The 14 fits me perfectly! I wear a 36 c bra and the size 12 was just too small for my chest on the side of the suit without the strap. I’m surprised how well this swimsuit holds me in as I typically need an underwire in my swimsuits. This one is very supportive even without the wire.",
      "rating": 5.0,
      "verified": true,
      "author": "SLF",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Runs Small but review sizes and you should be fine (2 sizes up)",
      "text": "This suit does run small, but I looked through all the reviews I could to get the correct size and it ended up fitting me fine! I usually wear a size 4 and I sized up 2 sizes, and the 8 fit perfectly. I am 5'3 135 lbs. This also hides the tummy area very well!",
      "rating": 5.0,
      "verified": true,
      "author": "Keela",
      "helpful_votes": 3,
      "publication_date": 20181116
    },
    {
      "title": "Love it so much I bought a 2nd",
      "text": "I’ve been an Amazon customer for years and this is the first review I’ve ever written. I’m a size 12-14 and 5’8” and have always HATED swimsuits, opting for tankinis and shorts because I never felt good in a one-piece. I bought this suit in royal blue for our cruise last year (fully intending to return it when it didn’t fit or look good) and I LOVED it! It’s so flattering and comfortable, and I’ve received so many compliments on it that I bought another(lemon print) this year!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Stones",
      "helpful_votes": 2,
      "publication_date": 20200621
    },
    {
      "title": "Very cute pattern. Nice overall fit",
      "text": "Adorable swimsuit! Looks just like pic. Nice material, cut is good. I typically wear a size 10 and thus bought a size 10. It is ever so slightly snug on me. I think I could have safely went for a 12 but this size will do just fine. I have an average full bustline. If one is top heavy or especially curvy at the backside but typically fit a 10, you may want to size up. Haven't tested this in the water yet and no idea how it will wash up. It does seem like it will hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristo",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Runs Small",
      "text": "I was looking for a cute and cheap swimsuit for my upcoming trip to Hawaii and stumbled across this one. After reading all the reviews, I decided to order a size up. I wear a size 12/14 in jeans and dresses, but I ordered a size 16 and it fits perfect. It's not too loose or too tight, it feels like it's just right. I love the ruching(?) in the midsection because I feel like it makes me look slimmer. I took out the breast pads before washing and washed it in cold water and hung to dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Super cute and flattering",
      "text": "This is made of a really thick, good quality material that feels really secure on. I got the bright blue color and it's really vibrant and pretty. I haven't worn a one-piece swimsuit since I was in elementary school, but this totally won me over! I feel like I can actually run and swim and play with my kids in it while not worrying about the suit coming off or slipping. It's also a stylish, I've received many compliments on it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "kaswanson",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "ADORABLE",
      "text": "I bought this suit in solid black and fell in love with it! I got a size 6- I’m a size 2 but have a 32F chest so finding one piece swimsuits that fit everywhere is a challenge. This suit keeps my girls contained, and helps tuck in any problem areas. Yes, size 2 ladies still can have problem areas- I’ll be 50 next month, haven’t worked out since COVID, and have birthed 3 kids. Love this suit so much that I’ve ordered 3 more colors! Buy this suit-you’ll have no regrets!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy B",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Flattering suit",
      "text": "Update: I ordered this in a black originally and went back recently and ordered a second suit in the “bluebird blue.” Do not be deceived by the picture. The actual color is WAY off. It still looked great on me so I kept it but I added a picture. It’s a teal color. They need to change the image on the selection! Great swimsuit! Quality is great for the price. I am 5’7” and 150 lbs. I usually wear a 10/12 and ordered a 14. Fits perfectly! Coverage/modesty is good, too. It is also very flattering. I’ve had two kids and it slims my tummy!",
      "rating": 5.0,
      "verified": true,
      "author": "JSG",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Beautiful suit, but far too small!",
      "text": "This is a beautiful and flattering swimsuit for many body types. I am tall and thin with a long torso (5'7\" and 130 lbs). I normally wear a size 2 in most clothing, but based on other reviews I ordered up to size 6 - this was still not large enough! Too short and VERY tight. The fabric and ruffling on this suit are nice, so I will order again in size 10 to give it another try. Don't worry about the number, order 3-4 sizes up, especially if you are tall.",
      "rating": 4.0,
      "verified": true,
      "author": "Emma B.",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "SIZE UP!!",
      "text": "I usually wear a small/medium but since I’m pregnant (early second trimester. Still in usual clothing) I thought I would get it a larger size to grow into. That was not the case. I found it difficult with sizing that wasn’t S M L of a bathing suit. So I got an 8 and could have used a 10 maybe larger soon. It’s tight in the chest and stomach (I know it’s supposed to be sliming) but also short which I wouldn’t think would change too much from size to size. The suit overall is very cute, slimming, not sheer at all. It’s good quality but SIZE UP. I’d say 2 sizes honestly.",
      "rating": 3.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "In love!!",
      "text": "I normally am a 12. I ordered a 10 and 12 and kept the 10. The 10 helped keep the tummy in. The shoulder was a little tight but after wearing it a few times I didn’t notice it anymore. The 12 fit great but I felt little tummy support which is why I kept the 10 instead. I ordered the black floral and a dark green solid and found the floral much more flattering than I thought it would be. I love this suit and will keep my eye on it yearly for more colors/patterns!",
      "rating": 4.0,
      "verified": true,
      "author": "Jay Bird",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Flattering!",
      "text": "Cute suit! Fits well and is flattering. I usually wear a 0/2 in clothes. Swimsuits in general seem to run small, and I ordered a bit up from that based on reviews. I’m5’2”, 107 lbs, and I got an 8. I’m certain a 6 would fit too, but I just don’t like things to feel constricting, so I went with an 8 for comfort. Have already worn several times and really like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarahshmara",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "I wanted to love it...",
      "text": "The material is TERRIBLE. It doesn’t “give” at all. Seriously... I felt like I was in a straight jackets. Originally ordered my “normal” size then even went up a size to see if that would help. It is such a cute bathing suite and flattering but it is beyond uncomfortable. :(",
      "rating": 1.0,
      "verified": true,
      "author": "KLFlocco",
      "helpful_votes": 2,
      "publication_date": 20190822
    },
    {
      "title": "Add this to you summer wardrobe!!",
      "text": "I was totally skeptical about the fit of this suit. I saw this on a popular blog I follow and thought it was really cute. When it arrived I checked it out and then put it on because i was heading to the beach the next day. The fit was amazing. They say to go up one size and I did. If I had gotten my normal size the fit would have been off. The rouging in the front makes your tummy look flat and the bottom has great coverage. The top also keeps the girls in. I would totally recommend this to anyone. I have gotten lots of compliments too. I'm thinking about getting another.",
      "rating": 5.0,
      "verified": true,
      "author": "JulesC",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Best fit for any body!",
      "text": "This swim suit is amazing. I probably tried 15 on before I found this one- if you have a bunch in your cart, ditch them all and just order this one! It’ super soft and made well. It’s the perfect mom suit. Appropriate, elegant, flattering, and so comfortable. I think this style would look amazing on anyone. It stays in place and I’m not constantly tugging or adjusting. Win!!! I’m 36 yrs old, 5’6” 180 lbs and usually a size 12 pants and dress. I’m a 36DDD and am still occasionally nursing. I ordered a size 14 b/c I have a long torso and it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Long Torso ladies - this might work for you!",
      "text": "I haven’t swam in it yet so can’t give it a full review. But was shocked at how well it fit. I am 5’6”, around 140lbs. I have a small frame, a long torso, and carry most of my weight around my middle. One piece swimsuits rarely fit me. Based on measurements, I was an 8 in the chest, a 10 in the waist, and a 6 in the hips. Went for the middle and ordered an 8 and I’m so glad I did. It’s flattering and stylish, and it feels pretty secure.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Stull",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Cute, affordable bathing suit",
      "text": "Affordable, Adorable. Flattering. Fits as expected. I just wish the removable breast pads were sewn in. For reference i am a 34 D. I like a little padding in bathing suits so nothing is see through and hides the nips. I wore this for 3hr to the beach. Didn’t go in water. Just sat and tanned in my seat. After i left i realized my left breast pad was up in the shoulder and the right was folded in half below my breast. Not a good look nor are they easy to fix. Wish they were sewn in and for people who don’t want them they could be cut out.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren B",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Amazing!",
      "text": "I bought a very similar swimsuit last year for about $100 and I really wanted another color but didn't want to spend that much. This one is exactly the same! The material is very soft and form fitting, not stiff like some cheap suits. I ordered four different ones from Amazon and this was the winner, hands down! It does run small. I sized up 2 whole sizes. I'm 5'9\" 138 lbs and normally wear a 6 or medium in most things but I ordered a 10 in this and it fits perfect! The Bluebird Blue is a more royal blue than it looks in the picture but it doesn't bother me. A++++",
      "rating": 5.0,
      "verified": true,
      "author": "Moey",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Runs small.",
      "text": "After having my baby a one piece became necessary. I bought this one based on it looking cute and modern. If you have remotely large boobs, pass on this one. I’m a 36D-ish, sometimes DD (you mamas understand) and the one shoulder did not offer enough support. I felt like my boob was going to pop out any second. I’m 5’3” and I felt like the length of this one piece was short. It rode up in the back causing a cute wedge. Returned and found a more suitable swimsuit for my new body.",
      "rating": 3.0,
      "verified": true,
      "author": "Mallory Lambert",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Fantastic buy!!!",
      "text": "This suit is one of the best purchases I've ever made. I was somewhat skeptical when reading other reviews to order up a couple sizes. I order a 10 and am typically a 6 or 4. I probably could've gone with an 8...but mainly bc the bottom half is somewhat giving. Overall, I love the suit! It provides great coverage and looks very flattering. I've received several compliments. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Van Koughnet",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Super flattering and well made, but order WAY up in size!",
      "text": "I read a review that said to order up a size. I ended up having to order up two sizes because I have a longer torso. It fits really well, but is really tight and uncomfortable around the shoulder. I probably could've ordered even larger! Otherwise, the structure is really solid and well made (it's a nice, thick material) and the swimsuit is super flattering. I'm 5'7\" and 125 lbs. I normally wear between a size 2 and 4, but I ended up with a size 8 in this swimsuit.",
      "rating": 4.0,
      "verified": true,
      "author": "MeredithR",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "BUY THIS!!!",
      "text": "I never write reviews. Never! This suit is amazing and will look good on any body type! I’ve always worn designer bathing and they cost a fortune, and was sick of spending so much. My weight has fluctuated since having a baby and I was tired of the cost every time my waistline changed. This bathing suit is adorable, flattering and hides all the spots us moms want hidden! I would say it runs SLIGHTLY small. I’m normally a size 6 in bathing suits, and I needed the 8. The 6 fit, but was very very tight. Made well, solid, thick fabric. GREAT buy for the price! I bought the black and the navy.",
      "rating": 5.0,
      "verified": true,
      "author": "NewlywedReviewer",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Attention Big Girls, Great Find!",
      "text": "I CANNOT believe I just bought a suit on Amazon for $30 and it looks amazing! I’m a big girl, 5’4” 200 lbs, so swimsuit shopping is my least favorite thing to do. And, I usually end up spending a fortune to get something fun and flattering; you ladies know the struggle! On a whim, I thought I’d try this and I’m blown away. I ordered the 16 and it fits perfectly! Yet one more reason to love amazon ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "This swimsuit is EVERYTHING!!!",
      "text": "Oh how I LOVE this swimsuit!!! It is really stunning and flattering on!!! I bought it in black and although, I have more than enough swimsuits for this summer, I am definitely going to buy it in white as well!!! It is just THAT flattering. I am normally a size XS but it wasn't available in my size so I ordered a Small. It fits perfect!!! I'm sure it is true to size, but it still works and looks ah-mazing even though I sized up a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Super cute, order up",
      "text": "This suit seems like really good Quality for the cost. It has a nice thick lining on the inside. I find the cut very flattering, and I like how there’s some rushing on the stomach. I’m 5’ 8”, about 150 pounds and normally wear a size 6. Based on the reviews I ordered up to a size 10 and it fits well. It’s just a tad loose in the bust. I probably could’ve fit into an 8 also but I’m going to keep the 10.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Grennes",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "AMAZING SUIT. BUY THIS",
      "text": "Awesome swimsuit!! This looks amazing on and hides everything! I use this is my after lunch swimsuit once the morning “flat stomach” phase is gone. This looks so good one and it stable. Was able to body surf and play volleyball without fear of coming out. 10/10 suit! Got so many compliments",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Knowles",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great Suit, Great Fit, Great Price",
      "text": "I finally found a flattering suit in a great color that gives great support!!! I sized up from my normal size based on reviews from size 8 medium to size 10 and it's a close and supportive fit. It's super flattering and at 34E bust it holds me up and minimizes slightly. If you are a woman who wants to look both classy and sexy on the beach or at the pool this is the one. Removing 2 stars... ordered second suit in bluebird blue and what showed up is actually deep teal/torquoise color instead. Not at all like pic. Possibly returning.",
      "rating": 3.0,
      "verified": true,
      "author": "PinkSugar",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Amazing suit!",
      "text": "After having 2 kids, swimsuits have not been my favorite type of clothing. I ordered 1 size up, as reviews suggested, and this suit is absolutely amazing. My stomach looks flat, my sides are held in, and the bottom coverage is very secure. Everything stays where it's supposed to be and it is somehow still super comfortable and not restrictive. I even received multiple compliments! Will definitely order another next summer.",
      "rating": 5.0,
      "verified": true,
      "author": "JTRMZ07",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Buy it",
      "text": "So I’ve been hunting for something for my trip to Florida, and I’ve not lost the weight I wanted. So it’s been tricky. I decided to try this, and it’s the only suit I’ve found that I still look good in and don’t want to cry!!! It’s snug, but it sucks me in and is still comfortable. I went a size up from my normal pants size. And who can beat that price and free returns!!! I’ll probably order another!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenelle",
      "helpful_votes": 2,
      "publication_date": 20190501
    },
    {
      "title": "One strap wonder!",
      "text": "I truly love this suit...but heres some things you should know... there is a waist seam, kida weird if the fabric bunches a certain way and it doesnt have the best tummy control due to that. The one strap hold up DD size! I'm amazed! And the side without the strap covers my armpit chunk so no fat hanging over that! Moderate booty coverage, and no bunching of fabric on the back. I really do like this suit, just wish it had more tummy control.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Baumgardner",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great product! Didn’t work for my long torso",
      "text": "This is an excellent suit. The quality and fabric are so good! I ordered in olive and it is so beautiful! I normally wear a medium but ordered in large and that was right. However, I do have a long torso and it just didn’t quite work, but only because of that. I ended up giving it to my niece. Several of us were looking at it- all were surprised at how beautiful and high quality this suit is, especially for the great price.",
      "rating": 4.0,
      "verified": true,
      "author": "stephen sutton",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Cute and fit pretty good but the cups aren't thick enough so when ...",
      "text": "Cute and fit pretty good but the cups aren't thick enough so when I got a chill you could see my nips right through - and since my ladies aren't as high as they used to be it's not a good look - sent back.",
      "rating": 3.0,
      "verified": true,
      "author": "C.H.",
      "helpful_votes": 2,
      "publication_date": 20180713
    },
    {
      "title": "Adorable and vibrant Suit!",
      "text": "I haven’t owned a one piece swimsuit in years as they are always too short. This is a cute and comfortable suit. I ordered the royal and it’s so vibrant. I normally wear an 8 in jeans and medium top. I ordered a 12 based on the size chart. I believe a 10 would be just fine but I’m keeping the 12. I have a 36C bust. It covers my rear and chest just fine. (Excuse the suit being wrinkled, just took it out of the bag.). Very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole N.",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Cute suit at low price!",
      "text": "This swimsuit is amazing! It feels high quality, looks cute, and provides full coverage, yet is still flattering. The ruching is a nice touch. I was surprised that smallest size they have is a 6, but after reading other reviews that the suit runs small, I ordered the 6 and it fit perfectly. For reference, I am usually a size 2/26. So size up a couple sizes and you will be happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Ramona",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Runs very small, not plus friendly",
      "text": "I’m 5’7, 175lbs and a curvy pear shape. I typically wear a 8-10 but initially ordered the 14 after reading reviews. While it fit, it cut into my thighs and made them look massive. I exchanged it for a 16 (the largest size) and its much better but the dropped side wants to drop past my chest. I’m a B cup on a good day so you’re probably fine if you have a larger bust. I wouldn’t recommend if you’re a curvy 14-16.",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Read reviews and size up!",
      "text": "Recieved today and just tried it on. After reading several reviews I ordered a size 12. I am 5'7\" tall and around 142 pounds, 36 B. It actually fit pretty perfect. Better than other swimsuits I've ordered online. I got the black and it does seem to slim the midsection some, so it may feel a little tight when pulling it on. I think I will keep it and wear it while at water parks or running the beaches with my daughter!",
      "rating": 5.0,
      "verified": true,
      "author": "Karissa Shields",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "AMAZING",
      "text": "I love this bathing suit. I am a mom and am working on losing weight after the baby. I’m in year four of that quest so I just decided one pieces were the way to go, probably forever. I ordered this hoping it would work (5’3’, 165, short torso) and it is AMAZING. I do NOT post pictures of myself in swimsuits but sometimes you gotta see it to believe it. I got it in two colors, the quality is amazing and I don’t have to worry about the ladies exiting the premises to make the beach all x-rated. Do yourself a favor and get this swimsuit. Booty coverage is excellent as well, and I’ve got a decent sized one.",
      "rating": 5.0,
      "verified": true,
      "author": "Lacey",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Material is of great quality and will be perfect for our Hawaiian vacation",
      "text": "Received this swimsuit today.Material is of great quality and will be perfect for our Hawaiian vacation. It's always hard to buy bathing suits online as you can't exactly try them on until you get them...but this one fit in my usual size just right! Simple bathing suit that is very comfortable on.",
      "rating": 5.0,
      "verified": true,
      "author": "Wombat1",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Great bathing suit!!",
      "text": "Sizing: 170 pounds, 5’4’’ b- cup got a size 12 ( normally a ten in pants medium in shorts) but went with 12 cause I always size up in bathing suits, and fit is perfect. I like the gathered material in the stomach area to take focus out of the area! The right amount of booty coverage for me! The chest area fits good. Great price, catch it on lightning deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine ",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Good Quality Fabric, Flattering Fit",
      "text": "I hate shopping for suits and have an awful time at it, so I was so happy when this one worked for me! The fabric is good quality with just the right amount of elastic to smooth out all the right parts! The style was flattering and classic.",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Beautiful blue color!",
      "text": "Okay maybe it’s the color that I’m really into but this blue suit is gorgeous. I’m super pale (yes even in summer) so YMMV but it’s really pretty and flattering. The suit is lined so no worries about modesty and there are cups to provide a bit of support for larger chests. The ruching on the midsection is flattering and I’d highly recommend this suit for anyone who is a little self conscious in a bathing suit.",
      "rating": 5.0,
      "verified": true,
      "author": "CTK",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Suit arrived already used!",
      "text": "The suit itself is a great style- but I was too grossed out to even try it on. The suit arrived today- all excited to wear this weekend. The sanitary liner is barely on. There are snags all over the ruffle. The tag has been taken off & tied back on- and it smells like your suit does after swimming in salt water & wasn’t rinsed. Disgusted!!! I will order another suit- because it’s a great style- really hope that one won’t be used! Now if you will excuse me, I need to Lysol my hands!",
      "rating": 1.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 2,
      "publication_date": 20190801
    },
    {
      "title": "Cute love the print",
      "text": "I really like this swimsuit, it's cute and stylish just a tad bit small, I'm about 5'4\" and weigh around 145-150lbs usually a medium in shirts and size 7 in jeans, I read and said around a size 10 because the sizes differ and I wish I would have read the small print saying it runs a bit smaller so maybe a 12 or what not would have been perfect, gonna hit the gym a bit more and hopefully by the summer I can fit a little better in it. 😁",
      "rating": 4.0,
      "verified": true,
      "author": "Alejandra L.",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Love it but order at least one size up",
      "text": "I love this suit! I wear a 12 in street clothes so I was going to order the 14 in this suit but it was out of stock in the white. I ordered the 16 instead and am very pleased with it. I am tall so the 16 really gives it more of the length I need. I feel like the 14 would have also worked out well. I am surprised at how good it looks on. I think I will order it in black.",
      "rating": 5.0,
      "verified": true,
      "author": "MEPchll",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Not for tall people",
      "text": "If you're 5'10 or taller, don't bother with this suit. I sized up to see if I could get the length right (12 according to the sizing) but it was too \"loose\" looking on my frame. The booty cut came up a little too high on the thigh/legs to make it fit. I think this suit would have fit perfectly if I were about 2-3\" shorter. :( Going to have to find a longer torso suit.",
      "rating": 3.0,
      "verified": true,
      "author": "Brittany Zorn",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Gorgeous suit!",
      "text": "This swimsuit is gorgeous! The style is flattering, the color is vibrant, and the fabric is thick and excellent quality. My only complaint is that it runs a little small in the torso. I ordered one size up from my normal and while it will work, I think 2 sizes up would have been more comfortable. Overall, though, I feel like this swimsuit checks all the boxes for me, and I definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20200111
    }
  ],
  "product_meta": {
    "title": "Hilor Women's One Piece Swimsuits One Shoulder Swimwear Asymmetric Ruffle Monokinis Bathing Suits",
    "rating": 4.6,
    "feature_bullets": [
      "Tips: Sizes are smaller than average, we recommend you to buy a larger size. Please refer to the review before selecting the size. Enjoy your shopping!",
      "Off the shoulder one piece swimsuit features ruffle trim; Asymmetric one shoulder neckline;",
      "Front ruched details offer form fit and slimming silhouette",
      "Fully lined one piece swimwear, tummy control mesh panel",
      "Ruffled One shoulder swimsuits：82% nylon and 18% spandex;"
    ],
    "categories": [
      "Swimsuits & Cover Ups",
      "Women",
      "One-Pieces",
      "Clothing, Shoes & Jewelry",
      "Clothing"
    ],
    "price": 33.99,
    "specifications": {}
  }
}