{
  "website_summaries": [
    {
      "verdict": "The very best e-bike if you want a fully loaded option.",
      "pros": [
        "Classic style and modern functionality",
        "Outstanding digital display",
        "Can ride up to 80 miles on a single charge and go up to 20 mph",
        "Loaded with desirable features",
        "High-quality aluminum frame",
        "Tektro hydraulic disc brakes for effective stopping"
      ],
      "cons": [
        "Expensive, but considering what you get, it's an exceptional deal"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is not the bike that is advertised. The specs aren't actually what the bike has.",
      "text": "This is a decent bike, if it was a $1500 bike. When I ride it, it creaks, like a cheap bike. The battery doesn't last as long as advertised (only avg of 17 miles) nor charge as fast (takes at least 8 hours). Their bike service does not service my area, so they aren't able to assist me in a major metro area where I live. This is something I was told I could use. When I contacted customer service, I had to contact them 3x before I heard anything back. The issues are still not addressed or solved.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 45,
      "publication_date": 20190720
    },
    {
      "title": "Not for 6'2 190lbs or damaged roads.",
      "text": "i am 6'2 190 lbs am too big for bike. excellent city bike. in maine, not so much as the bike has no suspension. the bike was not adjustable to my size for comfortable riding on bad roads. usable on excellent roads but still not really my size. its a very high quality bike. also warning:shipping is the worst i have ever dealt with literally. i had to call at least ten times and the package was delivered open and missing parts 4 weeks late. very high tech city bike meant for smaller people. not for country riding in maine. :(",
      "rating": 3.0,
      "verified": true,
      "author": "Woodsie",
      "helpful_votes": 10,
      "publication_date": 20190912
    },
    {
      "title": "Still ride, uncomfortable after just three miles of biking",
      "text": "Very still ride, had to purchase a gel seat to make it comfortable enough to ride more than 3 miles",
      "rating": 5.0,
      "verified": true,
      "author": "mintyone",
      "helpful_votes": 8,
      "publication_date": 20190626
    },
    {
      "title": "Rides like a Tesla bike, feels very well built, good components.",
      "text": "I have rented many bikes but after taking a chance on this I can’t say enough about how much I like it. It took minutes to assemble (like 10), came with all the tools, and fits well (I am 6.1’). It is such a great Cruiser and the battery just goes and goes if you use peddle assist. I am using it as a daily commuter to the gym and couldn’t be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Ridderbusch",
      "helpful_votes": 6,
      "publication_date": 20190721
    },
    {
      "title": "Fantastic ebike you’ll want to throttle :)",
      "text": "Surprisingly, my favorite feature was the throttle. I was expecting to only use the pedal assist, but putting my thumb on the throttle, and speeding along WITHOUT peddling made me laugh like a child. Every time. It took me a while to find the hidden USB iPhone charger, but it is there. Keep looking! I would ride it year round, if the Chicago weather permitted.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 5,
      "publication_date": 20200114
    },
    {
      "title": "excellent",
      "text": "look no further elby is the best...updated greatest ebike i have 2 of them my wife and i just love them excellent product durable highest quality would HIGHLY RECOMMEND ..ELBY RULES!!!!! STOP SEARCHING BUY AN ELBY and a great place to purchase bikes or accessories is AMEGO in CANADA TOP NOTCH PEOPLE AND COMPANY!!",
      "rating": 5.0,
      "verified": true,
      "author": "HONEST JOHN",
      "helpful_votes": 4,
      "publication_date": 20190819
    },
    {
      "title": "Great bike for older people who likes the walk though frame",
      "text": "Great bike well made great brakes easy to ride Good tires and wheels No front shocks so not as smooth on bumpy roads",
      "rating": 5.0,
      "verified": true,
      "author": "tom salamone",
      "helpful_votes": 4,
      "publication_date": 20190714
    },
    {
      "title": "Fantastic Electric Bike",
      "text": "This bike with the pedal assist is FANTASTIC. Effortless pedaling that last a long time and is perfect for my father who just turned 81! Now I want one myself! LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Adam S.",
      "helpful_votes": 3,
      "publication_date": 20190731
    },
    {
      "title": "Sweeeeet E Bike!",
      "text": "Most fun E bike I've ever ridden! Very very very well made, out of Canada. The battery is low and blends in to the frame, it's not a big bulky square battery like on other E bikes. This is a well made, beautiful bike, with a low center of gravity. Sweet disc brakes. Comes in pretty colors.",
      "rating": 5.0,
      "verified": true,
      "author": "M M",
      "helpful_votes": 3,
      "publication_date": 20200209
    },
    {
      "title": "Great bike, inadequate shipping container",
      "text": "Shipping container was not adequate. However, no damage located and minimum parts lost. Still cannot believe that there was no damage based on condition of the box. Love the bike and features 5*+",
      "rating": 5.0,
      "verified": true,
      "author": "Fleeco",
      "helpful_votes": 4,
      "publication_date": 20190805
    },
    {
      "title": "Great fun transportation",
      "text": "This is a quality product. With 150 miles no compliants. Looks great and get requests all the time. The color is agreeable. No pack to tempt thief. GREAT FUN! No battery diminishment yet.",
      "rating": 5.0,
      "verified": true,
      "author": "J C Powell",
      "helpful_votes": 2,
      "publication_date": 20200208
    },
    {
      "title": "Awesome!",
      "text": "Super easy and fun to ride. Holds a charge for longer than my prior 48 volt ebikes. Great low center of gravity for better stability.",
      "rating": 5.0,
      "verified": true,
      "author": "M3",
      "helpful_votes": 3,
      "publication_date": 20200108
    },
    {
      "title": "excellent build quality, low center of gravity and smooth ride!",
      "text": "Bought this eBike for my wife. The low center of gravity, build quality, brake regen and hydraulic brake were the main factors that we decided on Elby Bike. It is very easy for her to handle the bike. The ride on this bike is so smooth - excellent BionX motor.",
      "rating": 5.0,
      "verified": true,
      "author": "hhshen",
      "helpful_votes": 3,
      "publication_date": 20191226
    },
    {
      "title": "Big letdown",
      "text": "Could not adjust bike to git me comfortably. Assessories did not work on the bike.",
      "rating": 2.0,
      "verified": true,
      "author": "KittyKat61",
      "helpful_votes": 4,
      "publication_date": 20190711
    },
    {
      "title": "Elby performed the way it should",
      "text": "Got 2 Elby bikes (orange and grey). The orange came first and was in great condition. The grey came 2nd and it looked like it was a used bike returned from a customer. We tested both today, 1/3/20, and both bikes seems like it performed the way it should.",
      "rating": 3.0,
      "verified": true,
      "author": "Malou",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Amazing Bike",
      "text": "My husband and I are in our 70's and this bike is wonderful. We bike 2-3 times a week for 10-15 miles and use the 4 levels of assist to tackle the hills. More incline, more assist. The only negative is that the bike is heavy and difficult to lift but we trailer to our destinations so not much of a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Bykns",
      "helpful_votes": 3,
      "publication_date": 20200710
    },
    {
      "title": "Great bike",
      "text": "Very well made and very easy to get together. Rides very well with plenty of power and range. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "crossingbands",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "THIS E BIKE IS EVEYTHING ELBY SAID IT IS",
      "text": "ORDERED THIS BIKE JUST BEFOR XMAS.RECEVED IN JUST A FEW DAYS.NOT MUCH TO ASSAMBLEY.READY TO RIDE IN LESS THAN ONE HOUR. BEST BUY FOR THE MONEY",
      "rating": 5.0,
      "verified": true,
      "author": "GS  BEESLEY",
      "helpful_votes": 2,
      "publication_date": 20200205
    },
    {
      "title": "After 10 months Bike Quit Working",
      "text": "Loved the bike while it worked. Then 10 months later it quit working. Not what I would consider a good value. Tried calling the listed number and it is no longer in service. Looks like this company is out of business trying to sell the last of their product?",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Worth every penny!",
      "text": "Amazing bike! Battery lasts a good while and the assist feature is great!",
      "rating": 5.0,
      "verified": true,
      "author": "lbboy02",
      "helpful_votes": 2,
      "publication_date": 20200119
    },
    {
      "title": "Return woes",
      "text": "I like the bike a lot. However the original bike was damaged during shipping. I got a replacement and apparently there is a mix up with the return. The damaged bike was picked up at the same time the replacement was delivered. Seems like there is an issue with where the old bike is. It would be nice to be able to contact someone somewhere instead of dead end emails you can't reply to. I could be happier right now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Love our ELBY!!",
      "text": "Use this bike purely for recreation and are having a blast!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Carter",
      "helpful_votes": 2,
      "publication_date": 20200120
    },
    {
      "title": "Love it",
      "text": "Just got this bike a couple of weeks ago and I love everything about it. Super smooth ride and looks very stylish. Would highly recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Lazar Nikolic",
      "helpful_votes": 3,
      "publication_date": 20191231
    },
    {
      "title": "Fun and completely problem free",
      "text": "I haven't ridden a bike in 30 years. I'm older and having an assist really helps make the ride enjoyable. The controls are very intuitive and easy to use. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Kelly",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Incredibly poor customer service/problem resolution",
      "text": "The bike was comfortable and adjustable. Unfortunately I ended up returning this bike because I couldn’t get any customer support for a faulty headlight. Tried multiple times to call, Amazon tried multiple clients to call. Figured it was a bad sign they couldn’t bother responding to a basic maintenance question just after the bike was shipped.",
      "rating": 2.0,
      "verified": true,
      "author": "VV",
      "helpful_votes": 2,
      "publication_date": 20200428
    },
    {
      "title": "Great electric bike but red tail light didn’t work and still doesn’t.",
      "text": "I love the bike but the red tail lights have never worked and I can’t get anyone to help with getting it repaired. I wouldn’t recommend buying on Amazon because they don’t help if you have a problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Kandie A Gummel",
      "helpful_votes": 0,
      "publication_date": 20201217
    },
    {
      "title": "Got mine unlocked and it works wonderfully.",
      "text": "Had mine unlocked in California and now I can do 28-32mph easily. Great torque and power from the start and now the power doesn't cut which was pathetic.",
      "rating": 5.0,
      "verified": false,
      "author": "Saint",
      "helpful_votes": 27,
      "publication_date": 20181011
    },
    {
      "title": "A Refined joy",
      "text": "We shopped around for the highest quality E-Bike we could find, and the ELBY fits the bill! Super long battery life, fast and amazingly comfortable. I almost feel guilty it's so much fun. If you're looking for quality- look no further.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20190327
    },
    {
      "title": "Love the assist!",
      "text": "I absolutely love the levels of assist, ranging from none (you know... like getting a great workout on a bike) to full (think the star trek opening as they enter warp speed). I really appreciate the ease of use and comfort.. this is a very well designed bike and is backed by great customer service.",
      "rating": 5.0,
      "verified": false,
      "author": "Katy T.",
      "helpful_votes": 17,
      "publication_date": 20190325
    },
    {
      "title": "love my new Elby",
      "text": "After a 10 day wait, my Elby was delivered yesterday. The box looked as if it'd been dumped from a helicopter, so I feared the bike would be equally damaged but she appeared unscathed and at first sight superseded my expectations. I had researched several e-bikes online, as well as test drove different models at local bike shops (ranging in price from $1500 to $4500) and after much deliberation decided on Elby. The ebikes I actually test drove were priced between $3500 and $4500 (YIKES). In comparison, Elby's in another league for overall quality, heavy-duty frame, high end, modern design and attention to detail. If Elby was a car, she'd be a Volvo.",
      "rating": 5.0,
      "verified": false,
      "author": "Arika H.",
      "helpful_votes": 10,
      "publication_date": 20190713
    },
    {
      "title": "Not Disappointed",
      "text": "Have never owned or rode an electric bike. Took a chance based on the features, online reviews, photos, and discounted price. So happy we did. Purchased 2. Haven’t seen the battery regeneration feature on another bike and pleased it’s a feature. Works great. Took the bikes out for a 20 mile ride in a hilly area. Used quite a bit of assistance at times, including the throttle. Still had 73% and 74% battery when we got home. Enjoyed the ease of the assist buttons and ability to tailor amount of exercise at our own pace. And using zero assistance is easy, even with a 50 pound bike. Very happy with the purchase. Already planing outings further away. Highly recommended.",
      "rating": 5.0,
      "verified": false,
      "author": "Greg Davis",
      "helpful_votes": 5,
      "publication_date": 20191207
    }
  ],
  "product_meta": {
    "title": "Elby Bike 9-Speed Electric Bike",
    "description": "Elby is a premium electric bicycle designed with automotive grade quality from the ground up - it is approachable, comfortable and responsive. Elby is fun, functional and future proof and features class leading power, range, stopping power and technology all backed by a risk free full refund policy, a friendly customer experience team and even concierge Service to your front door should you want it.",
    "rating": 4.3,
    "feature_bullets": [
      "Leading power and speed: Travel at up to 20mph with electric assist!",
      "Leading range: Go up to 80 miles on a single charge!",
      "Enhanced safety: Features Tektro hydraulic brakes for safe and effective stopping",
      "Premium build: High quality aluminium-molded frame to form a user friendly, confidence-inspiring design"
    ],
    "specifications": {
      "Date First Available": "May 22, 2018",
      "Manufacturer": "Elby Bike",
      "ASIN": "B07D7QQ5PM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Bikes",
      "Electric Bicycles",
      "Cycling"
    ],
    "price": 2999.0
  }
}