{
  "website_summaries": [
    {
      "verdict": "Are you new to using gas range protectors made of PTFE? These 6 protectors are great for consumers who want to give them a try.",
      "pros": [
        "PTFE gas range protectors that can be washed and reused repeatedly",
        "Easy to cut if you need to enlarge the pre-cut openings",
        "Pack of 6 is affordable and a good choice for beginners"
      ],
      "cons": [
        "May burn if the edges get too close to flames",
        "Spills have been reported to ooze underneath, requiring prompt cleanup"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good Product",
      "text": "Prior to ordering this product I had purchased a \"similar\" set locally and was very dissatisfied with it but ordered this set on Amazon hoping they would be a better quality. Turns out the quality is much better and I'm sure these will last much longer. These sure make keeping the black range top cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry S",
      "helpful_votes": 26,
      "publication_date": 20180821
    },
    {
      "title": "I'm impressed",
      "text": "Unlike some of the other reviewers, I've had very, very good luck with these. You have to cut the hole in the middle to fit your burner, but that's super easy. Make sure to cut the hole larger than you actually need so it stays away from the flame enough. Super easy to clean up too. I'd definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Vel",
      "helpful_votes": 25,
      "publication_date": 20181018
    },
    {
      "title": "They REALLY work!",
      "text": "I love that they help keep the stove clean. If a pot overflows, I just take the cover and rinse it in the sink and put it right back on the stove. I love these things.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer S.",
      "helpful_votes": 23,
      "publication_date": 20180930
    },
    {
      "title": "Slick Non-stick Stove-top Sleeve",
      "text": "You have to remember kindergarten crafting skills to cut them to fit but they do keep your stove clean and wipe clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Jira",
      "helpful_votes": 23,
      "publication_date": 20180912
    },
    {
      "title": "Good!",
      "text": "This product is very good. It works great! The material is very flat. The first one when I cut the burner is not very good. The I use a marker to draw the curve first and then cut. Perfect match! I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 22,
      "publication_date": 20180919
    },
    {
      "title": "Styling",
      "text": "Awesome product. Does exactly what it's supposed to do. Cleans easily and does not look tacky",
      "rating": 5.0,
      "verified": true,
      "author": "Skippy",
      "helpful_votes": 22,
      "publication_date": 20180919
    },
    {
      "title": "Nice Item!!!",
      "text": "Totally satisfied with this item, easy to cut and install, keeping clean the stove and 100% washable...",
      "rating": 5.0,
      "verified": true,
      "author": "slash",
      "helpful_votes": 26,
      "publication_date": 20181007
    },
    {
      "title": "Great product! Easy to use! Just measure out and cut to desired size and super easy to wash.",
      "text": "These are so awesome! I had some milk drip out of the pot and i had no worry about it booking and staining my range top. I was able to keep cooking and worry about clean up later. Makes my life so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Olga P",
      "helpful_votes": 21,
      "publication_date": 20180906
    },
    {
      "title": "Good product and thin design",
      "text": "Good product but larger than our stNdard size gas burners",
      "rating": 4.0,
      "verified": true,
      "author": "Jim P.",
      "helpful_votes": 18,
      "publication_date": 20190401
    },
    {
      "title": "Easy care for the stove",
      "text": "We like them so much, we bought one set in black, the other in silver. Helps reduce the amount of work to clean the stove and prevents burned in food on the stove.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabine",
      "helpful_votes": 17,
      "publication_date": 20190117
    },
    {
      "title": "good product!",
      "text": "these things are pretty cool,saves alot of time and easy cleanup!",
      "rating": 5.0,
      "verified": true,
      "author": "blake",
      "helpful_votes": 20,
      "publication_date": 20180824
    },
    {
      "title": "Good so far.",
      "text": "Covered up the scratched and ugly burner trays on my gas stove. They were pretty easy to cut to fit the burners and wipe clean fairly easy; much easier than scrubbing the metal ones with cleanser. I hope they hold up to usage.",
      "rating": 4.0,
      "verified": true,
      "author": "Debra L. Royball",
      "helpful_votes": 16,
      "publication_date": 20190201
    },
    {
      "title": "Second time purchasing and still love it!",
      "text": "Second time purchasing this. I love that this is washable and can be customized/cut to size y pi u want. This is one of the best purchase I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Reggie",
      "helpful_votes": 16,
      "publication_date": 20190318
    },
    {
      "title": "awesome",
      "text": "love these liners they keep my stove looking spic and span, very easy to cut",
      "rating": 5.0,
      "verified": true,
      "author": "mo",
      "helpful_votes": 19,
      "publication_date": 20180919
    },
    {
      "title": "They work.",
      "text": "Product arrived on time and in good condition. Had to cut them but was easy to cut. They fit perfect and are easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Weiner",
      "helpful_votes": 17,
      "publication_date": 20190105
    },
    {
      "title": "Clean looking stove now!",
      "text": "Perfect for my stove top. Very easy to cut and shape and looks so much better than the old plates! Haven’t had to wash them yet but hoping it washes well.",
      "rating": 5.0,
      "verified": true,
      "author": "ben",
      "helpful_votes": 16,
      "publication_date": 20190207
    },
    {
      "title": "Great product, easy top clean",
      "text": "This product is awesome. Blends in with the color of the cooktop and cleans easily in soap and water. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 18,
      "publication_date": 20190331
    },
    {
      "title": "KITCHEN MUST HAVE",
      "text": "Love these! Super easy to clean. I was concerned that I had to cut them to fit them properly but it was really easy. So much more convenient to grab these and scrub them off as opposed to scrubbing away at my stove top.",
      "rating": 5.0,
      "verified": true,
      "author": "Bushra A.",
      "helpful_votes": 19,
      "publication_date": 20180830
    },
    {
      "title": "Great weight to these covers",
      "text": "I really liked the thickness of these covers. Easy to cut, great coverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 19,
      "publication_date": 20180911
    },
    {
      "title": "Perfect",
      "text": "Well so far so good ... just put them down and they seem easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Jean M. Durbin",
      "helpful_votes": 16,
      "publication_date": 20190303
    },
    {
      "title": "Perfect to protect my new stove",
      "text": "They came on time and were exactly as shown. It was easy to cut to fit but i wish i could have found some without holes in the middle since my burners are not perfectly centered. I've run them through the dishwasher with no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Loigin",
      "helpful_votes": 18,
      "publication_date": 20181202
    },
    {
      "title": "worth the money",
      "text": "The product is worth the money and this will help you lots of time in cleaning your gas stove top. can be easily put on and seems like you can wash them easily as well. the sizes can be more accurate.",
      "rating": 4.0,
      "verified": true,
      "author": "Avinash",
      "helpful_votes": 16,
      "publication_date": 20190327
    },
    {
      "title": "Great quality!",
      "text": "Great quality,they would definitely be durable/reusable,would highly recommend,I bought a cheaper pack first and they lasted 5 mins.these are great.",
      "rating": 5.0,
      "verified": true,
      "author": "S. K. Murray",
      "helpful_votes": 15,
      "publication_date": 20190303
    },
    {
      "title": "Great Idea",
      "text": "Best way to keep your stove burner top clean! Just cut to fit your burner top and remove about one el a week to be cleaned",
      "rating": 5.0,
      "verified": true,
      "author": "Rodolfo E. Manning",
      "helpful_votes": 17,
      "publication_date": 20190109
    },
    {
      "title": "Nice cover for the stove but could be couple of inches bigger",
      "text": "Nice cover for the stove. Tried lighting it. Did not catch fire. But still followed all the instructions. The only issue is that it does not fit all stove.",
      "rating": 4.0,
      "verified": true,
      "author": "Narayanan Sangameswaran",
      "helpful_votes": 15,
      "publication_date": 20190123
    },
    {
      "title": "Need to cut to fit",
      "text": "Works like it should. Had to cut some of them so it would fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Wu",
      "helpful_votes": 18,
      "publication_date": 20181224
    },
    {
      "title": "These work as advertised",
      "text": "A bit difficult to customize. But they do clean up easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Lemon",
      "helpful_votes": 15,
      "publication_date": 20190204
    },
    {
      "title": "Works great for us - easy to wipe clean with soapy ...",
      "text": "Works great for us - easy to wipe clean with soapy sponge - no more solving to get ceramic top to shine.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob J",
      "helpful_votes": 18,
      "publication_date": 20180613
    },
    {
      "title": "Five Stars",
      "text": "East to cut the perfect fit. Haven't cooked yet (since it just arrive,)",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 16,
      "publication_date": 20180629
    },
    {
      "title": "Same product at half the price",
      "text": "I've ordered burner liners similar to these before @ twice the price. Exactly the same items with *slightly* different packaging as liners listed for $15+. These would probably last me longer but I usually lose a liner to a minor cooking catastrophe before it actually wears out. Still extremely useful for saving time and effort cleaning the kitchen & the price is a bonus- Don't get caught over-spending!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Busiere",
      "helpful_votes": 5,
      "publication_date": 20190423
    },
    {
      "title": "I didn’t like having to cut them to fit my stove",
      "text": "I didn’t like having to cut them to fit my stove. They don’t look as good as if they had been already sized.",
      "rating": 3.0,
      "verified": true,
      "author": "Marcie Davidson",
      "helpful_votes": 6,
      "publication_date": 20180808
    },
    {
      "title": "Easy to install, quick to clean",
      "text": "I had initially ordered one a year back or so; then we switched houses and ordered a new one. It has clearly mentioned instructions to cut / customize as per your gas burner. And in no time, they are ready for use. Usually one can clean with wet (soaked / sprinkled with water) tissue but if you have thick / bad stains coz of oil or sauce, a nice wash with soap / detergent brings it back to original shine. Definitely recommend this product. No more scrubbing of gas tops anymore with mesh or scotchbrite.",
      "rating": 5.0,
      "verified": true,
      "author": "Prashant Malhotra",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Worked for a little while...",
      "text": "It worked for a few weeks, and then I started to notice small white burn spots. Then they burned through completely. I wish they really worked. It's a good idea and I liked them, but they don't last.",
      "rating": 3.0,
      "verified": true,
      "author": "EPayne",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "Very convenient",
      "text": "I love these. They can be cut to fit and when they get dirty rinse them off in the sink quick and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "DEB COX",
      "helpful_votes": 4,
      "publication_date": 20190428
    },
    {
      "title": "Great",
      "text": "I've been using it for at least 5 months. No complaints so far. Very easy to use, very easy to clean. So far, it appears to be really heat resistant. I will update if something wrong happens. If without updates, it means no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Rogelio J.",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "They do help keep my old stove clean",
      "text": "pro: washable, icky goop slides right off when washed. con: i have a white stove. these are black-nuff said on that point. It was hard to cut the circle correctly. other than that, i would buy them again. they are very durable and do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Alscher",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Wife Doesn't Yell at Me as Much",
      "text": "You have to make sure it doesn't block the burner holes when you install.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocky_Mtn_High",
      "helpful_votes": 2,
      "publication_date": 20190505
    },
    {
      "title": "honestly isn't great",
      "text": "yes it is easy to install, doesn't help prevent spills from getting under the mat so just means a bigger mess to clean up. Not worth it .",
      "rating": 1.0,
      "verified": true,
      "author": "Moontones",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Easy to cut and install. Material is thin and flimsy.",
      "text": "Wish this was made with a thicker material and a little bigger quantity. Other than that, you just cut them to fit around your stove top. I was not able to complete my whole stove with this one pack, but was able to cover most of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Cauterizer",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "GREAT PRODUCT",
      "text": "This product is a huge help keeping the gas stove clean around the burners, and they wash with hot soapy water (i put them in a sink of water), and they don't seem to wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "SGMitch",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Silicone stove top",
      "text": "Delivery was excellent! The instructions how to fit the product on stove is clearly explained right on the packaging and was very easy to follow great product",
      "rating": 5.0,
      "verified": true,
      "author": "ron",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Worth the price",
      "text": "Easy to install (have to measure and cut as needed) and worth the price..no more spills on the base",
      "rating": 5.0,
      "verified": true,
      "author": "Lavanya K",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "I would pass",
      "text": "I mean if I want I could have just put down foil but thought I’d give these a try they are not a very good match for my stove and makes the flames shoot up higher for some reason",
      "rating": 3.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Helps",
      "text": "Nothing fancy but does what I need it to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Kirsten",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Super clean",
      "text": "Had to cut a bunch to fit my stove. User error in my purchase but they make my stove look brand new. Very easy to wipe up spills. Will purchase again in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "jennifer gorman-stokes",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Tough fit",
      "text": "I thought they would of fit my stove better. You have to cut them and if you don't do it perfectly, you'll burn through them and need to replace them quickly. When done right, they'll look great.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard DiGeorge",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "easy to clean",
      "text": "I had trouble cutting out the holes but they came out just okay. They are really easy to clean. I just rinse them under the water and everything comes right off.",
      "rating": 3.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Better than foil? 🤔",
      "text": "They weren't as thick or heavy as I'd hope so they slide around to easily which can defeat the purpose. I got them for a long price but I would've preferred to pay more for either higher quality material or custom cut.",
      "rating": 3.0,
      "verified": true,
      "author": "Buckaroo Lou",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Threw them away",
      "text": "I have a 5 burner gas stove which has a long burner in the middle. These did not fit well and looked cheap. I threw them away and never used. Good luck to you though.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Price",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "10x better than aluminum foil cover",
      "text": "I had a few different burner covers and this works the best. Like the aluminum cover, it’s very light and easy to clean, but looks a lot better.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Young ",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Gas Stove Liners",
      "text": "I have not used them yet, but they look like they will do the job!",
      "rating": 4.0,
      "verified": true,
      "author": "Sherry Wilson",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Worthless!!!",
      "text": "Worthless!!! I don't understand why people even buy it. I bought different Brands just to test it out. None performed as it should.",
      "rating": 5.0,
      "verified": true,
      "author": "QuadRat",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Don’t buy unless you can cut the sheets well",
      "text": "Unless you are a cutting expert don’t buy. You have to cut the sheets perfectly to fit over the stove. (Mine were not perfect) if you didn’t cut it well enough the food would just go under the sheet and make a bigger mess.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Easy installment",
      "text": "Easy to install and fit. Good value for the product. Keeps my stove clean when I need to replace",
      "rating": 5.0,
      "verified": true,
      "author": "Rowena Aguda ",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Don’t buy",
      "text": "You have to cut it to fit your stove. Too bad this product made the bottoms of my pots and pans BLACK and it is soo hard to clean it. Not worth your money. I mignt as well clean my stove then.",
      "rating": 1.0,
      "verified": true,
      "author": "David Figuera",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Don’t like",
      "text": "Did not care much for these protectors. Had to cut them just didn’t cut right!",
      "rating": 2.0,
      "verified": true,
      "author": "Mary A. Mays",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Had to trim ALOT to get a fit",
      "text": "I have a normal sized stove and I had to do a lot of trimming and modifying to get this to fit on my stove. The process was so frustrating I finally just threw them away.",
      "rating": 1.0,
      "verified": true,
      "author": "Dawna Denison",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Won’t buy these but the one piece next.",
      "text": "Helps with cleanup. Will probably buy the one piece cover next time.",
      "rating": 5.0,
      "verified": true,
      "author": "J.P. W.",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "works great, hate cleaning the stove, easy to wash",
      "text": "Tip - trace your grill grate with a ball point pen to get cutting lines",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa M. Gilson",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Stove top gas burner covers",
      "text": "These were difficult to cut and get a good fit around the burners. It is way more expensive but the precut ones might be a better option.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Easy to clean",
      "text": "Easy to install and worth the price to help keep my stovetop clean.",
      "rating": 5.0,
      "verified": true,
      "author": "mary glanton",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Very Good",
      "text": "4 stars just because I received only 4 covers instead of 6 as mentioned in the title of this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Jatin Kale",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Look elsewhere",
      "text": "Difficult to cut and looks very ugly once it is. Does not fit stovetop burners well and uneven placement. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Puddin'",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Waste of money",
      "text": "Hate it! Doesn’t fit and hard to cut into the shape you want. Waste of my money",
      "rating": 1.0,
      "verified": true,
      "author": "Gia Yang",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Too much work to just them to fit my stove",
      "text": "The only thing I did not like about those the holes are too small a difficult time cutting them to fit my stove",
      "rating": 4.0,
      "verified": true,
      "author": "not happy",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great product",
      "text": "Love that it’s an easy May to clean and my stove is a bit clean. I have to cut mine since I’m using it for a stove on my rv. I like that I’m able to cut it down to the size I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Betsy",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Is not convenient",
      "text": "It's too much trouble. I have to cut them one by one!",
      "rating": 2.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "It b is not working",
      "text": "I don’t like it It is hard to clean Hard to install I use it for my stove",
      "rating": 1.0,
      "verified": true,
      "author": "selsabil ",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Flimsy, odd texture",
      "text": "Kind of flimsy. Did not feel they were safe to use. Almost felt like they were just coated paper. I would’ve thought they were silicone or something more durable.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica R B",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Love!!",
      "text": "These are fabulous!! Saves me from scrubbing the stove after I cook. Very easy to cut and if you do spill no biggie, just rinse off!",
      "rating": 5.0,
      "verified": true,
      "author": "Staci G.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Great product",
      "text": "What a great product you don’t have to scrape it’s easily cleanedWith soap and water no chemicals👍🏻👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Reusable Stove liners",
      "text": "Quality is horrible. Does not last long at all. Wears out after a coupl of washes. I wouldn’t recommend anyone to buy this product. It is a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Keibway",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Disappointed",
      "text": "Was not able to cut neatly, was too much work getting it to look nice on the stove. I threw the product away",
      "rating": 1.0,
      "verified": true,
      "author": "Donya",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "did not stay in place",
      "text": "they move around too much and allowed spilt food to get underneath the covers",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Palafox",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Easy install and easy to clean",
      "text": "Very good, it’s the convenience of being able to protect stove and clean easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amavely Alvarez",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Disappointed",
      "text": "Ordered six and received only five! Disappointed. Not worth the hassle to return.",
      "rating": 2.0,
      "verified": true,
      "author": "Rosemary S.",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Horrible.",
      "text": "Horrible. They were to big and when trying to cut, it ended up being a disaster.",
      "rating": 1.0,
      "verified": true,
      "author": "Yesenia",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "poor quality",
      "text": "terrible looking product looks tacky, very difficult to cut with scissors to make it look presentable. waist of money, wish i could get my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "AJ Juarez",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Not what I thought it would be",
      "text": "You have to cut big round circles to make sure it won't burn,because it will.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Not easy",
      "text": "I had a terrible time trying to cut them to the stove size I end up throwing them out.",
      "rating": 1.0,
      "verified": true,
      "author": "Cecilia",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Flimsy",
      "text": "Waste of money. After getting them cut to fit they kept getting air pockets underneath them.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Proudfoot",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "CHEAP",
      "text": "Do not recommend. They are thin and cheap. Don’t hold up well to a gas stove either.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Awesome invention!!",
      "text": "Easy to use! This has always been a pet peeve of mine! The mess under the burners! I ordered a second set for my mother in law!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 17,
      "publication_date": 20190401
    },
    {
      "title": "Fits big stove but can be cut to fit smaller stove top",
      "text": "what i like about this gas stove burner covers is that it is easy to clean. definitely waterproof. This came bigger than my stove burners but it was easy to cut and fit the right size of my burners. This is really a necessity for your stove tops like a phone case for your phone. best is the affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20190930
    }
  ],
  "product_meta": {
    "title": "v cool livat Gas Range Stove Burner Covers - 0.3mm Thick 6 Pack 10.6inch Black Stovetop Liners Protectors Non-Stick Cuttable Dishwasher Safe Easy to Clean",
    "rating": 3.8,
    "feature_bullets": [
      "DURABLE & DISHWASHER SAFE - The Stove Burner Covers Are Easy To Clean With Soapy Warm Water",
      "THICKER AND EASIER TO CUT - The Gas Range Protectors Are The Latest Upgrade, Thicker And Easier To Cut Down To Fit The Burner",
      "NON-STICK & HEAT RESISTANT - The Stove Burner Covers Are Non Stick to Keep Your Stove Clean at Any Time And Heat Resistant",
      "PREMIUM QUALITY - The Stovetop Cover liners/Gas Range Protectors Are Made of PTFE Coated Fiberglass"
    ],
    "specifications": {
      "Brand Name": "V cool livat",
      "Model Info": "Shvk",
      "Item Weight": "1.12 ounces",
      "Product Dimensions": "10.6 x 10.6 x 0.01 inches",
      "Item model number": "shvk",
      "Is Discontinued By Manufacturer": "No",
      "Size of the product": "1.4 Cubic Inches",
      "Part Number": "Shvk",
      "Special Features": "Stemless, All Cookware, Electric Stovetop Compatible, Microwave Safe, Dishwasher Safe, Permanent Filter, Pre-Seasoned, Slow Cookers, Breadmachines, Coffee Makers, Programmable, Gas Stovetop Compatible, Induction Stovetop Compatible, Converts to Hand Mixer, Thermal",
      "Color": "Black",
      "Compatible Device": "Gas range protector, Stove burner cover",
      "Certification": "Stove burner cover gas range protector",
      "Material Type": "PTFE",
      "Included Components": "OPP bag package, Gas range protector, PTFE, Stove burner cover",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B07B9QJ8PL",
      "Customer Reviews": "3.8 out of 5 stars334 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#183,492 in Tools & Home Improvement",
      "Date First Available": "July 8, 2018"
    },
    "categories": [
      "Appliances",
      "Range Parts & Accessories",
      "Parts & Accessories",
      "Accessories"
    ],
    "price": ""
  }
}