{
  "website_summaries": [
    {
      "verdict": "An attractive, space-saving heater that's designed for small to mid-sized rooms. If you have kids or pets, consider purchasing the heat guard too for added protection.",
      "pros": [
        "Sports a slim design that fits flat against a wall, making it suitable for rooms with limited space",
        "Convection heating warms evenly, and unit is quiet when operating",
        "Easy to install"
      ],
      "cons": [
        "Only 400W output, so it's not a good pick for large rooms",
        "Front gets fairly warm to the touch, so the company recommends a heat guard that's a separate purchase"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome heater!",
      "text": "This little heater was SO easy to install and it heats our freezing cold basement (about 700sq ft) beautifully! We have tried so many different kinds of space heaters down there and by far this is our favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Kinderfidget",
      "helpful_votes": 50,
      "publication_date": 20180912
    },
    {
      "title": "This thing smells really bad!",
      "text": "This things stinks...really smells bad stinks! Have been using it with an air purifier for 6 weeks and it is not getting better. If not better this next week, will be returning it before return date expires. Have used many of this type of heater for years. This one was a replacement for one that the switch quit working. This brand must be a knockoff.",
      "rating": 1.0,
      "verified": true,
      "author": "Not happy!",
      "helpful_votes": 42,
      "publication_date": 20181031
    },
    {
      "title": "absolutely terrific",
      "text": "this heater is absolutely terrific. it is easy to affix to the wall, has a slim classy design and fits just about anywhere. i cannot believe the price. i was sure it was a mistake, i had to double check. this could easily sell for $200. i put it in my basement, and since then have had no issue with guests sleeping there in the depth of winter. and whats more, it is very cheap to run. what a shame there are only five stars to check. i would happily give this heater ten stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel k",
      "helpful_votes": 40,
      "publication_date": 20180416
    },
    {
      "title": "Gives off a smell like plastic or rubber burning.",
      "text": "I wrote a review to the company, hoping someone would reply, haven't heard anything yet, so writing this. I got my heater back in August, wasn't cold then, so haven't used it until about 3 weeks ago. At which point, I noticed this odd smell. I thought it would air out eventually if I kept using it, but the smell has persisted and if anything has become worse. I'm hoping to either get a replacement, or a refund. Hoping, someone from the company gets in touch with me so I can revise my rating.",
      "rating": 1.0,
      "verified": true,
      "author": "Tido N.",
      "helpful_votes": 29,
      "publication_date": 20181024
    },
    {
      "title": "Toxic Smell Does not go away",
      "text": "It will heat slowly as expected for a convection heater. What is incredibly disappointing is the strong toxic smell that is given off. I wish I more thoroughly read the reviews before purchasing. If you do not want a toxic smell in your home or wherever you are planning to heat up, don't buy this. You would think for the price something like this wouldn't be so toxic but it is. And I've let this run and air out for over a month now.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 16,
      "publication_date": 20190216
    },
    {
      "title": "Simple, but terrible installation",
      "text": "This rating is currently based on the installation alone. I give it a 1 Star, because it comes with a template, which is inaccurate! Off by 1/4”, on a non-slotted product, so there is no room for error. The panel itself is known to break or crack under too much stress, so the only option is to re-drill holes. Thoroughly unimpressed so far. More to come...",
      "rating": 1.0,
      "verified": true,
      "author": "Raj",
      "helpful_votes": 16,
      "publication_date": 20181118
    },
    {
      "title": "Provided wall anchors will fail",
      "text": "While mounting the heater panel I followed the instructions and used the size drill bit and anchor for drywall application. All anchors failed while screwing into wall. Do yourself a favor and go to a hardware store for some molly bolts or other quality wall anchors before you try and install. I will repost after using the heater and possibly raise the rating. Right now a three for low quality included hardware.",
      "rating": 3.0,
      "verified": true,
      "author": "iTouch Reader",
      "helpful_votes": 11,
      "publication_date": 20181018
    },
    {
      "title": "Great heater",
      "text": "We are using this heater in a 12x16 foot space. I wanted this heater because it mounts to the wall and will not be in the way of my son's wheelchair. Easy to mount and heats well. I bought a thermostat so that the heater will go on and off as certain temperatures are reached.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Ann Roy",
      "helpful_votes": 12,
      "publication_date": 20181019
    },
    {
      "title": "Doesn’t heat",
      "text": "Bought this in the summer but just now started using it. We have it in a 180 sq ft room and it does nothing for heat. It smells badly and has three hairline cracks only after two weeks of use. I would easily put up with the smell and cracks if it actually heated anything. My water bottle sits almost touching it and it’s icy to the touch- after four hours of the heater turned on.",
      "rating": 1.0,
      "verified": true,
      "author": "austinite",
      "helpful_votes": 10,
      "publication_date": 20181128
    },
    {
      "title": "Don’t buy it",
      "text": "The unit material stinks of whatever it is the unit is made of. It doesn’t go away. Except to the garbage",
      "rating": 1.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 9,
      "publication_date": 20190623
    },
    {
      "title": "Bad smell and limited return time window",
      "text": "We were not able to use this product because of the terrible smell. To make matters worse, when I tried to return it our UPS was closed for several days for the holiday so I missed the return window. Now we are stuck with a brand new heater we will never use.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 10,
      "publication_date": 20181124
    },
    {
      "title": "Smell is overwhelming and makes this product unusable",
      "text": "Like many other reviews have said, this ceramic wall heater has a terrible smell. I used this heater for one complete heating season, at times with windows and doors open completely so that whatever smelled bad would burn off / off-gas, and even stored it in a garage for a couple of weeks so it could air out, and it still smells to the point where I will not reinstall it or use it again. I would like a refund as this product is not usable. I do not recommend using this heater in a living space because of the smell.",
      "rating": 1.0,
      "verified": true,
      "author": "Dissatisfied with Product",
      "helpful_votes": 7,
      "publication_date": 20190426
    },
    {
      "title": "Smell was too strong for a small bedroom—returned.",
      "text": "After reading mixed reviews, I took a chance on this heater for my small bedroom. While it did produce enough heat to keep my poorly-insulated room warm at night, the chemical smell was so strong it gave me a headache. And that's even after attempting to air it out at my office for a week before plugging it in at home. I'm surprised to see others say the residual odor wasn't bad. Maybe I just got a bad one, but I found the smell to be unbearable (and questioned if that could really be safe in my bedroom). I had to return it and am trying a different brand because I love the space-saving design of this style space heater.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20191016
    },
    {
      "title": "Wifi toggles on/off ONLY",
      "text": "This is our third heater, though the first wifi one. They work well and we were excited to see the new ones were wifi enabled, as we have a lot of smart home products. The wifi feature is huge disappointment. There is no thermostat so you can't set it to a particular temperature. You can ONLY turn it ON or OFF through the wifi. This requires you to have a different way to measure the temperature and to turn it on or off as needed. We had been hoping to set it to a temperature from our phones, not just toggle the power switch. The non-wifi heater with the thermostat is far superior to this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Alysha Hosford",
      "helpful_votes": 3,
      "publication_date": 20201002
    },
    {
      "title": "Very disappointed",
      "text": "It's a heater that heats very little. We installed it in a room of the dimensions the product was meant for. It releases a sausage smell even after weeks of using it. We live in Los Angeles so it's not that cold but anyways it's not enough.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181102
    },
    {
      "title": "The smell is awful and impossible to get out",
      "text": "The smell is awful. Tried everything to get it out, but it was too much. Had to get rid of it. Set it up in a 100 sq. ft. room. Heat wise it would have worked and looked great where I needed it. But the smell!",
      "rating": 1.0,
      "verified": true,
      "author": "Dustine Saule",
      "helpful_votes": 4,
      "publication_date": 20191103
    },
    {
      "title": "Works great!",
      "text": "We live in Alaska and our garage/shop gets really cold in the winter. It's difficult to get motivated to work on projects when it is so cold. We got this heater to help keep the chill off, and so far it is doing a better job than was anticipated. We no longer have to run another heater, and are quite comfortable. Since the shop is over 400 sq/ft we got two of these heaters, and are currently only needing one on. As winter progresses, and temps drop closer to 0 we'll likely need both. Installation is as easy as it gets, read the manual, use the supplied template, and you're done.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan B.",
      "helpful_votes": 3,
      "publication_date": 20181025
    },
    {
      "title": "Great solution for my son's room. But it stinks.",
      "text": "Okay. It works. It heats. I can place it out of my 17 month old reach, it came with a plug-in thermostat. But it stinks. Really bad. I ran it for a few hours before mounting it and it helped a little but the odor is still there. So I'm waiting to see what happens on the next few weeks. The box that it came it is still on our basement. And the basement stinks. Keeping it just in case I need to return.",
      "rating": 2.0,
      "verified": true,
      "author": "The Hs",
      "helpful_votes": 4,
      "publication_date": 20181004
    },
    {
      "title": "Don’t buy this heater",
      "text": "Do not buy this heater it reals of chemicals and can’t be safe to have in your home. We’ll be throwing ours away as I waited too long to return it. Super disappointed. I thought it was a great idea but I can’t stand the smell.",
      "rating": 1.0,
      "verified": true,
      "author": "Megan Mundell",
      "helpful_votes": 8,
      "publication_date": 20181130
    },
    {
      "title": "Stinky, Stinky",
      "text": "This unit is very attractive and I was so excited to get it. The odor of the product, even working with the manufacturer, following instructions for airing it out, was unbearable. The company asked me to allow them to send another unit that had been upgraded and resolved the odor issue. I waited 60 days before opening the replacement, unfortunately, and the odor of the second unit is worse than the first. If you don't mind a chemical/plastic odor the unit would be fine, but I warn you, it is very strong.",
      "rating": 1.0,
      "verified": true,
      "author": "Anita",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "Update:  Over a year old.  Starting to not smell.",
      "text": "Updated review: Both the original and the 'improved' version were unacceptably smell-y for the first two winters I had them. I think, next year, I might be able to use them in my home. Original review: The smell this heater has put out has been constant and is rather overwhelming. I don't know if I have a 'bad' one but I've had this out and plugged in outside - heating the great outdoors as my father loved to say - and when I bring it in it's so bad I can't leave it turned on. I've been in contact with the (manufacturer? retailer?) and a new device is on the way.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 2,
      "publication_date": 20190206
    },
    {
      "title": "Not warm enough, save your money!",
      "text": "This little heater was a disappointment, from the beginning. I will say it’s incredibly easy to mount, and it’s clean looking - but it doesn’t put out enough heat. They say it’s supplement heat for a room?? No way, talk about more like a foot warmer under a desk or something. I installed it in a chicken coop that is very well insulated, and it wouldn’t warm it up at all (4’x6’x4’ - R19 insulation). I had to end up installing a milk box heater with it to get it to 45 degrees. However, the thermostat it comes with is a nice piece, it works well.",
      "rating": 2.0,
      "verified": true,
      "author": "Larry Davis",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Does not work.",
      "text": "Did not heat my basement at all. Waste of money. Installed in an approx 15x15 room in basement. You could feel heat if you had your hand 6” or less from it but beyond that not at all. Now I have 4 worthless holes in my brick and a freezing cold room still. Worthless",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Leehr",
      "helpful_votes": 5,
      "publication_date": 20190225
    },
    {
      "title": "Great heater: bad thermostat",
      "text": "This is the second heater I have purchased. It is an excellent convection heater for small rooms. I can say nothing negative about it. The first one I purchased I also purchased with a plug in programmable thermostat that has worked flawlessly. The recent purchase came with its own plug in thermostat. This thermostat is defective. The thermostat is itself a heater - it warm and is 20 degrees above ambient temperature, obviously unworkable. I highly recommend the heater, but get a different thermostat.",
      "rating": 4.0,
      "verified": true,
      "author": "Vince P.",
      "helpful_votes": 2,
      "publication_date": 20181017
    },
    {
      "title": "Worked three times. Now light is on. no heat, nothing.",
      "text": "Shame on me for planning ahead. I needed the heater for a small room that I was remodeling. I purchased it at the end of September. I didn't install it until mid November. I ran it maybe three times before it stopped working and the the return policy is only 30 days. I've purchased two other similar products and they are working fine after two years. This maker is on my do not buy list.",
      "rating": 1.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 3,
      "publication_date": 20181203
    },
    {
      "title": "!!!! SHORTED AND BEGAN TO BURN !!!!",
      "text": "LUCKILY - I was in the room at the time, smelled electrical burning and saw a glowing red hot spot on the outer face. I was able to unplug it before it burned the house down. The heater's electrical box on the rear had melted, and burned through the panel, this was installed per the instructions using the provided wall-mounting offsets and with plenty of space in front of the panel. temperature was set to 60 degrees F. via the included plug/thermostat. Purchased and installed October 1918. Burned up November 2019. I have reported this to the CPSC",
      "rating": 1.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 2,
      "publication_date": 20200124
    },
    {
      "title": "smells like toxic waste",
      "text": "this heater woud be great if it didnt sell so bad.they all come cracked though",
      "rating": 1.0,
      "verified": true,
      "author": "Jani Ann",
      "helpful_votes": 5,
      "publication_date": 20190106
    },
    {
      "title": "Heat output is very poor, and it smells terrible",
      "text": "Overall i'm pretty disappointed with this. Like MANY others have indicated, this heater smells aweful when turned on. The heat output is sad to say the least, if not pathetic. Wish I could return it, but I also waited too long....I'll be buying a standard wall mount electric heater for our mudroom and throwing this piece of garbage away.",
      "rating": 2.0,
      "verified": true,
      "author": "amhmusic",
      "helpful_votes": 3,
      "publication_date": 20191101
    },
    {
      "title": "Love it!!",
      "text": "I love this product! Finally a heater that actually looks good and since I have white walls, almost invisible! Takes no space at all and warms our entire basement.",
      "rating": 5.0,
      "verified": true,
      "author": "AO",
      "helpful_votes": 5,
      "publication_date": 20180517
    },
    {
      "title": "Shut up and give them your money.",
      "text": "Worked like a charm. Easy to install so long as you are comfortable with mounting drywall anchors. Have them in both my bedrooms so I don't have to use the forced the air and they definitely keep rooms at the temperature that you set with the t-stat. Will likely get one for my basement because its also my man cave. They smell weird at first but not terrible or even very noticeable. Smell went away after a short time. I have mine high up on the wall so they look like post modern art or something.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph w colon",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Awesome",
      "text": "I have this unit on my son patio. The room is about 200 sq ft and has many large windows. So far it is maintaining a comfortable temperature even with the outside lows being 20 degrees. We'll see what happens in the dead of winter but so far it has been great! I recommend cleaning the unit with a vinegar solution before installation. That really cut down on the chemical smell. After a week there was no more smell.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 4,
      "publication_date": 20181111
    },
    {
      "title": "Would be nice if I had no nose.",
      "text": "The materials used are high in VOCs. I can appreciate \"gassing\" an item that has a high vapor smell by leaving it out for a few days. But I cannot do this. I tried. The smell overwhelms the house after bringing it in and this purchase was for sleeping better. I bought two identical units. Both exhibit the same problem. There ARE better materials from which to build these units from. Its just that they may be a little more expensive. I WOULD STILL BUY IT IF IT WERE TRULY GREEN and free from reeking of what smells like hydrogen peroxide let out into the air.",
      "rating": 3.0,
      "verified": true,
      "author": "jpeek345",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Great heater, supplied thermostat is 1950's tech",
      "text": "Great heater, VERY simple to install, NO noise/sound of any kind. Would have given it a 5 except the supplied thermostat is technology from the 1950's. Can't program it for more than a single 24 hour setting. Back in the 1970's they came out with programmable technology yet this current product, in 2018, can't get with the 70's? I would much rather pay a few extra dollars to get current technology in the same purchase than have to get another product. Bad move on their part as I had to buy a programmable one FROM ANOTHER COMPANY and these guys lost out on some extra $$.",
      "rating": 4.0,
      "verified": true,
      "author": "Escape13",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Horrible poisonous smell won't go away",
      "text": "Ran this heater for 2 months straight waiting for toxic smell to burn off. Problem is, heating elements are cast in a ceramic / epoxy that outgasses forever. Left unplugged in garage for months, went in yesterday (5 months after purchase) and could smell the heater in an outdoor garage !!! Awful.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190521
    },
    {
      "title": "Ugly and bulky looking ,, don’t know",
      "text": "Not happy with the look of it. Very ugly !bulky and looks like a giant plate on the wall and for the wifi to work ., it has to be connected to a bulky , ugly looking switch. Over all very unhappy but I have to pay an electrician to remove it . I see how long I can tolerate this ugly heater .....",
      "rating": 2.0,
      "verified": true,
      "author": "simin",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Dangerous product",
      "text": "This product is extremely unsafe - do not buy it. We bought two different types of ceramic wall heaters. One with reflector panels to go between the wall and heater and a temperature switch and these. Within 15 minutes of mounting these they were so hot they almost started a fire. They were smoking and had a putrid smell. Very, very unsafe!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "krista Mckerracher",
      "helpful_votes": 3,
      "publication_date": 20191015
    },
    {
      "title": "No Thermostat",
      "text": "The description clearly shows this unit has a thermostat. It does not. Sent it back as soon as I opened it.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Hadley",
      "helpful_votes": 5,
      "publication_date": 20190223
    },
    {
      "title": "After 3 weeks still smelled too bad to use inside the home",
      "text": "Unfortunately we missed the window to return this as we did not unbox until a renovation was finished. However we are unable to use this because it stinks!! It has been sitting on our porch for weeks and still gives off a terrible smell. We had it plugged in for a couple days. We tried different solvents to mitigate smell but nothing worked. Bought another brand and they were fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191108
    },
    {
      "title": "Seller replaced stinky one with one that doesn't smell",
      "text": "They saw my complaint about the off-gassing and sent me a new version — without requesting the old one back — that only smelled for a little while. Now, no smell and the nice, energy-efficient heat (only 400 watts!) I was used to from earlier versions of a product like this (used to be called \"eco-heater\"). I'll probably buy one or two more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Hight",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Did not put out heat.",
      "text": "I had really high hopes for this heater. I wanted something to warm up our master bathroom in the morning while getting ready for work. The unit gets very hot to the touch but there is Zero heat output. I don't know if we got a defective one but I am surprised at the good reviews that say it actually heated up a room.",
      "rating": 1.0,
      "verified": true,
      "author": "Elbee",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Cheap but works",
      "text": "Pros Simple Hot Space saving Low watts Cons Stinks Cheap hardware all plastic Cheaply made Not commercial duty Burns if touched , they lie it’s hot! Second thought Works now Won’t last get an electric oil radiator next",
      "rating": 2.0,
      "verified": true,
      "author": "Timothy J Steen",
      "helpful_votes": 2,
      "publication_date": 20181016
    },
    {
      "title": "smells poorly.",
      "text": "This product has really smelled (burning smell) even when not plugged in. Do not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Hannah Ziesmer",
      "helpful_votes": 5,
      "publication_date": 20190522
    },
    {
      "title": "Gentle heat on my legs in my cold office.",
      "text": "I have a little workspace in the basement. It is always cold there. In winter it's cold, in summer, the house AC makes it even colder. I installed this heater on a separate outlet that is controlled by a motion sensor. If I'm at the desk, the heat is on, I walk away the heat turns off. Works just perfectly for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Villager Mike",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Easy to install, works as advertised.",
      "text": "Works as advertised. Easy to install. Going to buy another one for another room, because it’s cheaper than running my whole house’s HVAC when I’m in my office all day. There is no “backing board” that they recommend if it’s on a cold wall. They recommended using aluminum foil against the wall to reflect the heat, which I suppose I could do, but it would be nice if there was a pre-drilled, made to fit reflective surface you could buy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 3,
      "publication_date": 20181008
    },
    {
      "title": "Nice for baths and smaller rooms",
      "text": "I have 2 others that are convection eheaters but the on off buttons keep breaking and the smell like burnt dust when you turn them on. They push more heat but these heaters are pretty simple and do a good enough job. Pet and child safe. I have a friend who spray painted his with aerosol DO NOT DO THIS. It's smells like burnt spray paint and hasn't gone away yet after several months",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon pulsifer",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "So Far, So Good",
      "text": "Ordered this for a cold bathroom. Very pleased with the appearance & the lack of visible/exposed heating elements. It was easy to install & looks great. It warms up well & quickly, though I use a small fan to help move the warm air around in a bathroom that has a rather high ceiling. I don't know yet about the efficiency; I'll have to see an electric bill or two in order to have an opinion on that.",
      "rating": 4.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Thin wall mount design works great in small spaces.",
      "text": "We live in an old house with radiant hot water heat. The wall mount heating panel has about the same temperature has our radiators- can be hot to the touch, but not enough heat that will burn you! Safe for kids and pets. I installed the wall heater in our unheated kitchen entry vestibule and pantry. In this high traffic space, I like the thin wall design with no hot elements or moving parts (fans). The space is small, so combined with the included plug-in thermostat, it allows the unit to cycle on-off as needed and keeps the room at a constant temperature regardless of weather conditions.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Eastin",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "These are economical and effective",
      "text": "These have worked great for us over the years, and are an efficient substitute for gas heating. The obvious space-saving and low energy costs is the best electric heat design available, that I have found. They may begin to show hairline cracks, but hey, it's ceramic that is contracting and expanding, and it continues to work just as well. We're heating two $500 sq ft bedroom additions with three panels each, usually needing only two in the dead of winter (lows of 15 degrees fahrenheit).",
      "rating": 5.0,
      "verified": true,
      "author": "P. Nugent",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Loved it so much we ordered a second one",
      "text": "We opted for one of these in our toddlers room over a dangerous tower heater and it is a choice we do not regret! It puts out a lot of heat when you want it to. It’s very easy to install and the control for it works great! We ended up getting a second one for our family room as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Peters",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "We love this heater",
      "text": "This heater works great in our playroom. We mounted it on the wall out of reach of little kids and we added an Alexa smart plug so we can turn it on and off with Alexa or a timer. The company is very responsive to questions and I'd definitely buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen A",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "Doesn't heat anything outside of 3 feet away",
      "text": "I bought this for a remodeled spare bedroom, which is at the far corner of the home and 20 degrees cooler when the door is closed. After 4 hours of running the thermostat 6 feet away did not change 1 degree. You have to actually walk right up to it to feel any heat. A waist of money but I already threw away the box. Oops.",
      "rating": 1.0,
      "verified": true,
      "author": "Danny Perkins Sr",
      "helpful_votes": 3,
      "publication_date": 20181211
    },
    {
      "title": "Don’t waste your money",
      "text": "I would not recommend this product at all. Received package Friday, installed it Saturday and within an hour cracked all the way down the middle. Returning this!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190127
    },
    {
      "title": "Great customer service",
      "text": "I used this heater to warm an entry room into my house. It did a great job of heating the room. By the way, some reviewers stated there was a strong smell. I experienced Nothing but a slight new product smell, which quickly dissipates. Only caveat was a defective thermostat that customer service handled immediately. New thermostat seems to be working fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Disappointed",
      "text": "Used it for a few chilly days last week so I had really high hopes for the product. Now the switch just flickers when turned on and it doesn’t heat up at all. Go figure, it dies just after I disposed of the shipping box. Nice concept if it only worked. Waste of money and now I have four holes in my wall.",
      "rating": 1.0,
      "verified": true,
      "author": "Farmstress",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Terrible medicine smell",
      "text": "It works but the medicine smell is noxious. I tried letting it air out in the garage while running it continuously for three weeks and the smell would not go away. Could not ignore the smell as it is intense. Stay away.",
      "rating": 1.0,
      "verified": true,
      "author": "Miss D",
      "helpful_votes": 4,
      "publication_date": 20190112
    },
    {
      "title": "Dont install before you connect to WIFI!!!!",
      "text": "We have a few of these heaters and they are good, lovely radiant heat. We had two that got cracks but still work. HOWEVER -the instructions are terrible and there sure could be a a sticker in red on The heater that tells you to connect WIFI FIRST ! Before you install the whole kitten caboodle! Really -is it this hard to make good instructions!!!!!???",
      "rating": 2.0,
      "verified": true,
      "author": "Anne Siems",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Keeps our bedroom very warm!",
      "text": "We have an old house and the heat zones aren't even throughout. Our son's room was always cold. Now that we have installed this on the wall, his room is always cozy. It doesn't get too hot, so we don';t have to worry about him burning himself. I haven't painted it yet, but I am going to. It will match the color of the wall and really looks sleek. Much better alternative to those standing space heaters.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Allen",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Great solution for supplemental heat in basement family room",
      "text": "I installed two of these heaters in a basement family room, which was always much cooler than the first floor. The temperature in the room is completely comfortable with the addition of these heaters, and there is no need to worry about leaving the units on for extended periods, as they are energy efficient and adjustable by thermostat. Very simple installation completed quickly by my handyman.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary A. Osborne",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Strong persistent odor, but reasonably safe to touch",
      "text": "Nice that it does not burn the skin if touched. However, there is a strong chemical odor out of the box and it persists even after owning the product for a month, which is a major downer. Also, says it heats a 200 square foot room, though it struggles to keep our 160 square foot room tepidly warm even when left on 24/7 and only 48 deg F outside.",
      "rating": 2.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20181231
    },
    {
      "title": "Awful smell when heats",
      "text": "Awful smelling box and when the panel heats, terrible offgasing smell. DO NOT EXPOSE KIDS TO THIS.",
      "rating": 1.0,
      "verified": true,
      "author": "jenee parker",
      "helpful_votes": 3,
      "publication_date": 20190317
    },
    {
      "title": "I recommend this product",
      "text": "I bought one for a small shed----it worked great---so I bought another one for our house that has a cold hallway----it works so good taking the chill off that---yep---you guessed it----I just bought my 3rd heater ---this one for the upstairs. They have such a warm gentle heat--- I am very pleased with the product----easy to install too---hardest part was locating stud to mount on :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ziggy",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Very good warmth experience",
      "text": "This magically warms the room no fan kinda like a infrared heater only there no light element, mounted it on a metal file cabinet very little heat in back so metal just warm I turn on at night off at dusk manually a thermostat comes if you order one",
      "rating": 5.0,
      "verified": true,
      "author": "miguel",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Nice even heat",
      "text": "I’m using two to heat my newly finished basement. They smell at first but are ok within a week. Nice even heat.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Meu",
      "helpful_votes": 2,
      "publication_date": 20181219
    },
    {
      "title": "I’m glad I bought this product",
      "text": "These are great room heaters. I’m using one in each of two 12x16 sheds. One is a cottage/studio for my wife and the other is a study/work room for me. These heaters maintain an even heat without the noise of a fan as is typical of most wall heaters. We love them. The best part is that they are simple to install and very economical to operate (only 400 watts).",
      "rating": 5.0,
      "verified": true,
      "author": "Gary L. Chambers",
      "helpful_votes": 2,
      "publication_date": 20181221
    },
    {
      "title": "Great heater",
      "text": "Works very well, I bought this for my 89 year old mom who is always cold. When I go in her room I ask her if she's cold she always say no now that I have installed this heater she's not cold but to me its burning up.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex & M",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Looking for low wattage heater? Get this!",
      "text": "Needed to have a space heater that wouldn’t blow a fuse in our old house wiring. This is perfect. Comes with a thermostat too. Install was less than 15 minutes. Now my daughter’s room is finally not freezing.",
      "rating": 5.0,
      "verified": true,
      "author": "BecsTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Just the right amount of heat",
      "text": "We installed a panel in our utility room, replacing a very inefficient, always on, small heater with this conductive unit. It outgassed for 2-3 days, never strong, and the odor was gone within a week. The installation was straightforward. In the past this room was either damp and too cool, or dry and too hot when the old heater was on; now it is dry and stays at a very stable temperature. We may install several more units in other spots in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen A Sayce",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "UPDATED not reliable Great Service",
      "text": "*UPDATE* Manufacture is fantastic, yes mine had a problem and after 24 hours of me stating my issue under my review they contacted me and have a new one on the way.... I definitely recommend as the heater does work well and everyone has a chance of getting a bad unit but they did take care of right away. Product worked fine until it smelled like an electrical fire and no longer works. Even sitting off for over a month now it still smells awful. The heater worked good but didn’t last 5 months. I would most likely not recommend purchasing this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason DiCampello",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Good for a bedroom",
      "text": "Great supplemental heating for a bedroom. Did not come with the thermostat or hardware but they sent it over right away for free! Very excited to use it this winter. It did have a slight chemical odor but it’s gone now.",
      "rating": 5.0,
      "verified": true,
      "author": "Aknck525",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Don't Buy!  Stopped working after one season!",
      "text": "I DON'T TYPICALLY WRITE REVIEWS BUT THIS WAS A BAD PURCHASE AND HAVE TO SHARE. I purchased this just less than 11 months ago, it worked one season (on for limited amounts of time for 4 months) and now it's no longer working. It's setup in small bathroom to heat in winter, connected to a GFCI. I tried to turn it on a couple of weeks ago as it got chilly at night and figured out it stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Hope  it will be more durable than other brand we have.",
      "text": "Replacing another brand of heat panel which developed multiple cracks, and hopefully this one will be more durable. I did let the panel run for a few days in a room we don't use much to help get rid of the \"new\" odor. I like the on-off switch with a light to let you know it's on - the other brand we had didn't have this. I would give this a five star rating if the manufacturer could come up with something for the center of the back of the panel that would contact the wall so that in case something contacts the panel it won't flex and possibly crack.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Tim Loutzenhiser",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Defective.",
      "text": "Really liked the concept of this heater, but the thermostatically controlled outlet switch failed to work. Tried troubleshooting but it’s defective. Frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler Richmond",
      "helpful_votes": 2,
      "publication_date": 20191102
    },
    {
      "title": "So far nice heater",
      "text": "It installed as per what I could make out. I bought the heat guard Looks good However I am concerned about the drywall becoming very hot at the top middle area where the most heat builds up. I feel I need do something here any recommendations . I was thinking the heat guard would have remedied the situation?",
      "rating": 4.0,
      "verified": true,
      "author": "tc",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Very happy with my purchase",
      "text": "2nd winter using this and I am very happy. installed in finished basement bedroom. does exactly what I needed, it warms basement bedroom that was previously very cold as the winter weather temp dropped. It does not instantly warm the room, you have to be patient, a couple hours to allow the room to feel warmer. Closing the door to the room you are heating helps tremendously to keep the warmth in. I love that it's an option that is safe for pets and children and careless teens. I would be nervous to use a space heater.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Works great. Easy to install.",
      "text": "Quiet and does the job. Happy. Then I bought the heat guard which is easy to install and makes a big difference in the heat output. I am double happy now.",
      "rating": 5.0,
      "verified": true,
      "author": "George Foster",
      "helpful_votes": 4,
      "publication_date": 20181022
    },
    {
      "title": "cant live without it in the winter!",
      "text": "I love this heater so much! I have 4 of them in my 1 bedroom apartment in Manhattan. 2 in living room 2 in bedroom. Usually 1 is enough but sometimes its so cold I need both.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Sickspatrick",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Works great for small rooms",
      "text": "I've bought 3 of these to heat 2 small bedrooms and a bathroom. They install easily, run silently and are slim and unobtrusive. As mentioned in other reviews the initial odor dissipates after about a day of continuous use. I let them run to off-gas before installing them. One issue to look out for is that the installation template hole positions are not quite accurate, so measure against the device and double check anchor positions before drilling!",
      "rating": 5.0,
      "verified": true,
      "author": "maz",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Great Low Voltage Heat Source",
      "text": "We removed a wood burning fireplace and an old blow heater and installed 2 of these heaters in a space around 550 sqft. We installed them ourselves and it was super easy, kept them on all winter and they were more than enough heat. Highly recommend the customer service, product and ease of install. They have a slight smell at first but once on the wall and switched on it goes away. Just need to paint them when the cold weather finishes. Very happy thank you very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Poulin",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Heater fine, Controller dead after one season use",
      "text": "The Thermo Controller died after one winters use. We were using it under the stairs to heat a space for a pet. Thermo controller is a EconoHome brand. It feels cheep. The panel still works fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Nickisland",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Lacked Parts to start & damaged drywall",
      "text": "I bought this heater for a mudroom about 65 sq. ft in size. The purchase was missing a screw and plastic cover for the install. I made due with things I had around the house and got it installed. A year after install I am remodeling the mud room and removed the heater. Only to find the adhesive from the foil backing was not coming off. The process to remove the adhesive left significant drywall damage.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren Lay",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "It does not help with warming a room",
      "text": "I thought this would solve the problem with heating up the room, but it does not. The cone shape space heater were far more effective and half the cost of this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Keeping Warm",
      "text": "I bouth this Wall heater to heat up my entrance to my condo. With me living upstairs unit, when walking in, the stairwell is about 20 degrees cooler before getting up the stairs. Since I bought the unit, I have to say it does the job I needed it too. However, I don't feel safe to leave it on when I leave the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190130
    },
    {
      "title": "Bigger than it looks but highly recommend",
      "text": "It's a little bigger than it looks but works very well. The hospital smell goes away very fast. Installation was a breeze. Have it in a bedroom by a window. Makes plenty of heat. No fan means it's very cheap to operate.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Beings the heat you want in an enclose area like a bathroom!",
      "text": "Nice to be able to have a warm bathroom late at night or early morning before the HVAC has kicked in; very efficient and easy to connect.",
      "rating": 5.0,
      "verified": true,
      "author": "Thom Schiavone",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Great Idea if you can resolve the lingering chemical smell",
      "text": "I have had this heater for about 2 weeks and the strong chemical smell just will not go away. I contract the vendor and they said to rub down with vinegar solution. Did not help the problem. I returned for concerns the chemical smell not being healthy.",
      "rating": 1.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Only takes the chill off",
      "text": "It does produce heat and it gets hot. In our very small bathroom it adds a little heat in the cold winter. If the weather is like 50, this unit will heat up the room nicely. When it’s colder, it takes the chill off, but it does not “heat” the room.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Easy install, works well in a small bathroom",
      "text": "No complaints! Easy install with the included template. Paint cracked down the middle on first use, but whatevs, I'll paint it at some point. Be aware that the thermostat is MASSIVE and will take the entire outlet out of commission - I got a 90-degree plug adapter to make the other outlet accessible. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "The electrician says they look nice installed.",
      "text": "I can’t tell how much heat they’ll offer in the summer. Ask later.",
      "rating": 4.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Five Stars",
      "text": "I ordered this for my college off campus apartment. Since my room has a lot of windows and not much insolation (it's an older house), the Wall Mount Space Heater really made a difference during these cold nights. Make sure you get the safety cover because it can get hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Marks",
      "helpful_votes": 2,
      "publication_date": 20181216
    },
    {
      "title": "cracked within one month of owning",
      "text": "It works but cracked in two places horizontally within one month of purchase. At least it has an on/off switch but really the cracking is bad and I did not drop it. overpriced for what you get.",
      "rating": 1.0,
      "verified": true,
      "author": "Johanna",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Toxic smell",
      "text": "Do not buy. These units put off a toxic, nearly nauseating smell. We’ve had ours for over two months and the smell has not gone away. We are removing and finding a different heating solution.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Five Stars",
      "text": "My sister lives in Canada, she complains about how cold it is there all the time. I live in New York and just bought this heater for my own house, it really keeps me so warm. So, I decided to buy one for my sister to use in Canada. She said it really keeps her so warm and she asked me to buy her more of them for the rest of the house. Happy BUYERS!",
      "rating": 5.0,
      "verified": true,
      "author": "johanna ramirez orozco garnier",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Eye-watering chemical smell, developed cracks. Waste of money and time.",
      "text": "Had an eye-watering chemical odor every time I turned it on, even after repeated wiping with a damp cloth. Developed cracks in the face in less than 3 months of periodic use (I didnt want to use it that much due to the terrible smell). Waste of money and time.",
      "rating": 1.0,
      "verified": true,
      "author": "Isaac Placke",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Effective heat source",
      "text": "This works surprisingly well in our basement. It keeps the finished portion comfortable except when outdoor temps dip to around 0. For the price, it’s a great option for heating a small room.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathaniel Murphy",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "So easy to install.",
      "text": "Very easy to install on our wall and the heat is just perfect. It will help us use less propane.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Erdmann",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "It smells and will not go away. Don’t waste your money",
      "text": "The idea of it is great, however the smell is so bad, it’s useless. I’ve owned it for 3 months and the smell hasn’t gone away. Don’t waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Doherty",
      "helpful_votes": 2,
      "publication_date": 20190831
    },
    {
      "title": "Excellent heater for small rooms, such as a bathroom, a small bedroom, home office.",
      "text": "Excellent heater for small rooms, such as bathroom, small bedroom, home office. The disadvantage is that the enclosed thermostat does not have the function of programming for each day. This would be very helpful in case of energy savings. But such a thermostat can be bought separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Oleg C.",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Satisfied client",
      "text": "Very nice product. Works well. The customer service was outstanding. I would definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "GeoinPa",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Don’t waste your money on this heater",
      "text": "Broke within a week of installing it, huge cracks down the middle. Additionally, it does not put out any heat for an area it claims to have the capacity for.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Looks nice, works",
      "text": "Using it to heat a 12x15 room. Works well enough to keep it comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy",
      "helpful_votes": 0,
      "publication_date": 20190130
    }
  ],
  "product_meta": {
    "title": "EconoHome Wall Mount Space Heater Panel - with Thermostat - 400 Watt Convection Heater - Ideal for 120 Sq Ft Room - 120V Electric Heater - Save Up to 50% of Heating Cost - Overheat Protection",
    "rating": 3.7,
    "feature_bullets": [
      "SAVE UP TO 50% OF YOUR HOME HEATING COSTS: Lower your energy bills and still feel cozy and warm with our electric heater. Our flat heaters are ENERGY EFFICIENT, consuming 0.4 KW/HR., which is less than 1/3 of the electricity than conventional space heaters. This method will lower your energy bills with great savings and will keep the room with constant ambient warmth.",
      "CONVECTOR HEATER SPECS: Ideal for a 120 sq. ft. room, 400 watts, 120 volts, 3.33 amps. Panel Heater Dimensions: 23.5 x 23.5 x ¼”. cETL approved. UL-2021 & RoHS compliant. ADJUSTABLE PLUG-IN THERMOSTAT AND HEAT REFLECTOR INCLUDED, temperature ranges between 41-86 °F. This unit may be HARD WIRED! OVERHEAT PROTECTION for your safety! We offer a 3 Year Manufacturer Warranty!",
      "SAFE AND EFFICIENT TECHNOLOGY: This electric wall heater operates at a constant temperature persistently. It ignites with minimal radiant heat which transmits to convection currents that rise from behind the heating panel and circulates heated air around the room. WE RECOMMEND BUYING THE HEAT GUARD ACCESSORY to go along with this heater because it doubles the efficiency of the convection currents, and its exterior casings stay warm and safe to touch.",
      "UPDATED CRACK RESISTANT VERSION: This upgraded durable model is TRIPLE REINFORCED and made with a superior calcium silicate material. TRIPLE INSULATED for electrical safety. OVERHEAT PROTECTION makes it safe to leave unattended. EASY TO MOUNT on any wall (Installation hardware Included). Enjoy the beautiful sleek PAINTABLE DESIGN which blends in with any décor.",
      "NO FAN THAT DRIES OUT: Asthma and dust allergy sufferers can enjoy warmth without irritation since the air will not dry out, nor will dust circulate around the room. Perfect for all indoor rooms, including bathroom, bedrooms, office, garage, and RV."
    ],
    "specifications": {
      "Package Dimensions": "29.25 x 26 x 3 inches",
      "Item Weight": "17.76 pounds",
      "Manufacturer": "EconoHome",
      "ASIN": "B07BN2TH5V",
      "Customer Reviews": "3.7 out of 5 stars471 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#88,209 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 22, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Heating, Cooling & Air Quality",
      "Electric Space Heaters",
      "Space Heaters"
    ],
    "price": 119.0
  }
}