{
  "website_summaries": [
    {
      "verdict": "Adidas Originals’ NMD Human Race shoes live up to the brand’s tradition of comfort and quality and Pharrell Williams’ cool sense of style. They bank on the much-vaunted Boost and the brilliant use of colors. The messages printed across the uppers enhance their casual streetwear vibe.Adidas NMD Human Race x Pharrell Williams sneakers are highly coveted and very few regret buying these. Aside from the shoes’ looks and comfort, they’re also highly collectible.",
      "pros": [
        "The looks of Pharrell Williams x Adidas Human Race NMDs got the most thumbs up from reviewers who like the overall aesthetics of the shoes",
        "The shoes’ comfort level has been commended by many users who said the shoes felt just as good on the feet as the Adidas Yeezy 350 Boosts",
        "Several people have remarked that the shoes’ uppers look more like mesh than Primeknit but they like the fact that those felt soft and stretchy",
        "The available colorways of the NMD Human Race kicks got a lot of mentions from purchasers who say the colors look bright and “sick.”",
        "Some consumers have cited the shoes’ quality as premium",
        "The shoes have a creative and unique lacing system that a few customers have praised as incredible",
        "A buyer has happily noted that the Pharrell Williams x Adidas Human Race NMDs held their shape nicely even when not worn",
        "The shoes go great with casual wear but can easily be styled up, one individual has observed"
      ],
      "cons": [
        "The place where the ankle sits feels a bit tight, according to a few reviewers",
        "The shoes don’t feel secure enough, some users have noted",
        "Like other NMD shoes, the NMD Human Race doesn’t contain removable insoles which testers observed would have made the shoe so much better"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.6,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Shoes look good package sent feels questionable",
      "text": "The shoes did not come in an original adidas box and when purchasing new I expect this (-1). There was one tag that seems printed well, although, adidas tennis HU are supposed to have 2 as far as I know. The first being one w/ barcode and size info and material info on the reverse. There’s a second set of alternate/reserve laces which were absent on my order (-1). Most details on the sneaker itself appear to be there and the build quality seems legit on my order everywhere else. My review is for one vender only “TheChicagoSneakerStore” intended to inform only on what was sent to me and in what condition.",
      "rating": 3.0,
      "verified": true,
      "author": "Roost",
      "helpful_votes": 8,
      "publication_date": 20181113
    },
    {
      "title": "Trendy shoe, but buy half a size down",
      "text": "I read reviews here advising me to go half a size down from my original size because this shoe runs long. That advice was spot on! This shoe is nice and trendy, I'm happy with my purchase so far!",
      "rating": 5.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 11,
      "publication_date": 20180225
    },
    {
      "title": "Pw adidas Tennis Hu",
      "text": "These shoes are pretty fly period. Most of all their comfortable and light.",
      "rating": 5.0,
      "verified": true,
      "author": "LTR",
      "helpful_votes": 8,
      "publication_date": 20181024
    },
    {
      "title": "What a versatile and insanely comfortable sneaker. They look cool",
      "text": "Bought these to travel around Asia. What a versatile and insanely comfortable sneaker. They look cool, feel great, and stay relatively clean for a light shoe. Planning on snagging these in another color.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Llewellyn",
      "helpful_votes": 6,
      "publication_date": 20180330
    },
    {
      "title": "Love these shoes",
      "text": "Makes me wonder about the people claiming the items they received are fakes. Bought these and not only did they arrive early by a considerable amount of time but they arrived in the original box, had tags, and are absolutely legitimate. Extremely lightweight and comfy and they look great. Couldn't have asked for a better purchased especially since the price was half of what these usually go for. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Spoogey",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Incredibly comfortable kicks!",
      "text": "Wow! These are one of the most comfortable pairs of shoes I've ever worn. They're incredibly light weight. After reading reviews prior to ordering, I ordered a 1/2 size smaller than I'd usually wear. I'm glad I did. Thank you other reviewers! I definitely recommend these shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180428
    },
    {
      "title": "Comfy and fits well",
      "text": "This is my third pair of these. I really like this style. Easy to slip on without messing with laces and it feels like a sturdy sock, lol. I hope they continue making these for a while in all sorts of color ways.",
      "rating": 5.0,
      "verified": true,
      "author": "dngn0",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "I wasnt disappointed. I looked all over the internet for these ...",
      "text": "I wasnt disappointed. I looked all over the internet for these sneakers and finally found them here on Amazon for a decent price. Its a comfortable shoe, although a tad bit big. They're very nice looking on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180225
    },
    {
      "title": "Fly sneaks that are light and comfy",
      "text": "Fantastic shoes and unique look. Huge fan. NOTE: These run large so if you are unsure about sizing, order 1/2 size smaller than normal",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle Jesse",
      "helpful_votes": 5,
      "publication_date": 20171025
    },
    {
      "title": "These are comfortable but three things",
      "text": "These are comfortable but three things. 1) my feet have stretched out the front and there’s a toe stretch mark from that. 2) there’s a seam at the front of the shoe inside that my toes get caught on. 3) the bit on the back where you would pull the shoe on gets flipped up all the time. Other than these minor annoyances I like the shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Love the color!",
      "text": "I could've went a half size smaller. I'm a women's size 10 and I bought a men's size 9. But with some socks they'll be fine. The color is beautiful and will match my steelers wear perfect. I'm so glad I took a risk and made the purchase. I highly recommend this shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "I love these sneakers",
      "text": "I love these sneakers...I already have a pair in different color. The price was $30-$40 difference,I just had to buy them.Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Mac D.",
      "helpful_votes": 2,
      "publication_date": 20180218
    },
    {
      "title": "Great Christmas gift",
      "text": "Great Christmas gift. My husband wears 10.5 and they fit perfect. The fabric is somewhat flexible compare to other shoes which might make them feel loose but they are still true to size.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 3,
      "publication_date": 20180122
    },
    {
      "title": "They look great and feel good just walking around or wearing on ...",
      "text": "They look great and feel good just walking around or wearing on casual days at work. They aren't great if you are taking a walk doing more than being very passive. I'd still buy them, but I kick them off immediately after work and don't bike in them.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Enestvedt",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "Lightweight and comfortable",
      "text": "One of my favorite shoes out there, very simple, light and extremely comfortable. Would suggest going down half a size for the best fit. This is my fourth colorway in these shoes and I cant get enough of them!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Pic",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Comfortable and very lightweight",
      "text": "Very comfortable and stylish shoe. Definitely runs large so I recommend going down at least a half size. I love everything about them minus one thing. The toe guard inside of the shoe is noticeable when wearing them but you do get used to it after awhile. I know it’s there to keep the shape of the shoe but if it was smaller or gone the shoe would definitely be a 5/5 in comfort. Other than that it’s great lifestyle shoe and extremely lightweight. Had to return to bump it up to 5 stars. I still wear these all the time and they are easily some of the most comfortable shoes I own",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Hernandez",
      "helpful_votes": 6,
      "publication_date": 20180527
    },
    {
      "title": "Size conversion",
      "text": "I’m a woman’s size 7 and the 5 in men’s fit",
      "rating": 5.0,
      "verified": true,
      "author": "Red tulips",
      "helpful_votes": 3,
      "publication_date": 20180327
    },
    {
      "title": "The shoe size fits as expected but had the difficulty ...",
      "text": "The shoe size fits as expected but had the difficulty in putting my feet inside the shoe because of the shoe design.",
      "rating": 3.0,
      "verified": true,
      "author": "JPS Aznar",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Do better",
      "text": "Got these for my boyfriend as a gift and the actual shoe box was all the way broke up and the shoe seemed to have been worn. But they do look new. I just wish I could get a better box as it is a gift an now I have to make another step to make it seem better then it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Tanisha Sandidge",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Size different than my other pair",
      "text": "Shoes came in legit packaging. They look and feel authentic (compared to another pair I have). I have another pair that I bought at the adidas store so I ordered the same size again. These are a full size larger and they are both 10.5 mens. Not sure why this is, I'm pretty disappointed the sizes would be different.",
      "rating": 3.0,
      "verified": true,
      "author": "Joey Swinford",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Lightweight and comfortable",
      "text": "My goal was to get a comfortable summer slip on that I could still play tennis in if necessary. (Daughter is the tennis player, I’m the occasional practice partner). These were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocky Garrett",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "adidas Men's Pw Tennis Hu Sneaker",
      "text": "Like the style of the Adidas shoe. Not much support. It's a soft shoe, not a real court shoe. More of a walking sneaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Go half size small.",
      "text": "They were super comfortable but have to return it they run half size big. I order 7.5 and they were bit long.",
      "rating": 4.0,
      "verified": true,
      "author": "Rahim Jan",
      "helpful_votes": 2,
      "publication_date": 20180526
    },
    {
      "title": "They are beautiful but they run BIG",
      "text": "They are beautiful but they run BIG!! Order a half a size down I’m a 10 should have gotten a 9.5",
      "rating": 5.0,
      "verified": true,
      "author": "Dchan",
      "helpful_votes": 3,
      "publication_date": 20180324
    },
    {
      "title": "10/10 would buy again",
      "text": "Ordered half size down from what I start with usually, based on other reviews of them being on the longer side. These feel amazing and I can definitely see why they are so popular!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Mattern",
      "helpful_votes": 8,
      "publication_date": 20180418
    },
    {
      "title": "Fits Like a moccasin",
      "text": "Great shoe...Unfortunately it runs ~1/2 size larger than the next generation Tennis hu shoe. I would definitely recommend it as post-game shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah Waters",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Too ill",
      "text": "Very hard finding pink shoes in large sizes. These are very nice. Not much foot protection but that's to be expected. Not so much arch support that it's annoying, but it's noticeable. Very comfy. I imagine they're good for running/working out but too fresh to do that.",
      "rating": 5.0,
      "verified": true,
      "author": "Maus Keteer",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "some friends have them and wash them when they get dirty. Have not done this yet personally",
      "text": "Really cute kicks for my daughter! They fit well...some friends have them and wash them when they get dirty. Have not done this yet personally.",
      "rating": 5.0,
      "verified": true,
      "author": "HV",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Shipping & return was flawless",
      "text": "Sneaker runs a little big, returned 1st pair for a 1/2 size smaller, everything went with ease. Thank you,",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas J.",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "No more nikes again.",
      "text": "Super comfortable. Adidas really stepped their game up. Sorry nike.",
      "rating": 5.0,
      "verified": true,
      "author": "d.j.b",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "My son loves them.",
      "text": "These were purchased for my 14 year old son. He’s says they are “hot” meaning cool I think. He also told me they’re comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Perfect",
      "text": "I have two other colors and was looking for this color for a while. Great shoe, I hate they don’t produce them anymore in the original color ways",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Style",
      "text": "Super light and comfy, gets dirty easily because i bought a light color",
      "rating": 5.0,
      "verified": true,
      "author": "Rajiv Dhingra",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "got them good goods",
      "text": "bought these shoes for my boyfriend’s birthday after he tried to buy them at the adidas store but they didn’t have his size in stock. super happy with how they came. thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Foley",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "The shoes is great, however wrong color was sent and appeared to ...",
      "text": "The shoes is great, however wrong color was sent and appeared to be a display unit or a returned? Some discolor was presented.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Wang",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "They’re awesome.",
      "text": "I love these shoes!! The fit is consistent with the size I normally wear and they’re so comfortable. They arrived a day early and I was super excited!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180427
    },
    {
      "title": "Size matters",
      "text": "I'm so Please with the color took me awhile to found it,the material quality are so nice,unfortunately is to big and always wearing 11 size but are more like 12 size and the upper part of the shoe is to small but I guess is the design other than than love it,ty",
      "rating": 5.0,
      "verified": true,
      "author": "Erick paredes",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Goes on like a sock, not a shoe.",
      "text": "The sock style of this shoe is less than desirable but they look great and the fit is perfect! I'm happy I got them, but I wish Adidas would move away from that style of shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex J",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Love these shoes!",
      "text": "Never got so many compliments on shoes before. Super comfortable too!",
      "rating": 5.0,
      "verified": true,
      "author": "Tech Junkie",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Sizing is true - order down a half-size if you are unsure.",
      "text": "Great fit and comfort, extremely lightweight - excellent all-purpose sneaker (not intended for running).",
      "rating": 5.0,
      "verified": true,
      "author": "Todd J Gelb",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Fast shipping!",
      "text": "Great shoe just made a little big so I got a half size small.",
      "rating": 5.0,
      "verified": true,
      "author": "Rog",
      "helpful_votes": 2,
      "publication_date": 20180403
    },
    {
      "title": "Want to buy another pair",
      "text": "Extremely comfortable shoe feels like I'm not wearing anything . Lighter than any shoe I've owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Chase Giinseng Catlin",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Great Design - Poor Quality.  Panty liner soles",
      "text": "I love the way these shoes look. The quality is lackluster - the insoles aren’t glued in and stick to my feet when removing the shoes. Panty liner soles forever.",
      "rating": 2.0,
      "verified": true,
      "author": "TooTooMaGoo",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Gorgeous kicks",
      "text": "Great shoe, super stylish and eye catching. Quite comfortable. The light yellow primeknit 2018 model fits quite well (9.5), if slightly narrow. The non-stretch top requires a bit of effort to get them in but nothing complicated. This model has the insoles partially glued in (at heel) Note: The primeknit is way less stretchy and with a slightly rougher feel than that of the NMDs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rual",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Five Stars",
      "text": "Excellent shoes! Box was beat up a little on delivery, but did not affect the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Look good. Feel good.",
      "text": "Super comfortable. Very light and easy to wear. Well made and up to Adidas’ usually high standard. They are definitely fashion sneakers and aren’t suitable for anything athletic.",
      "rating": 5.0,
      "verified": true,
      "author": "JayDoubleU",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Comfortable",
      "text": "They are a little on the large side, but I have a wide foot so that was my expectation.",
      "rating": 5.0,
      "verified": true,
      "author": "F.W.",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "2nd pair and still no complaints",
      "text": "This is my 2nd pair. Very comfortable. Good for everyday walking.",
      "rating": 5.0,
      "verified": true,
      "author": "ramon31",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "They are exceptionally breathable and comfortable even after walking/running over long periods of time",
      "text": "This product fits about half a size large. I normally fit a 12.5, but 12 perfectly fits my foot in this shoe. They are exceptionally breathable and comfortable even after walking/running over long periods of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Shortridge",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Said \"New\" but they weren't",
      "text": "These were supposed to be \"New\". The bottom of the shoes were dirty and you could tell they had been worn. Very disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "Kelli Kircus",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Awesome sneakers, really love the way the feel",
      "text": "Awesome sneakers, really love the way the feel, the bright colors, the softness, the only thing is, the insole really sticks to your feet, socks or not.",
      "rating": 5.0,
      "verified": true,
      "author": "Omar Cabrera",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Love it",
      "text": "My new favorite sneakers, one of the most light weight shoes I’ve ever owned. Great for running errands and/or being your everyday neutral fall back shoe",
      "rating": 5.0,
      "verified": true,
      "author": "AntVega",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Comfy as heck",
      "text": "I get compliments on these shoes every time I wear them and they’re SUPER comfortable. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett Stephens",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Looks good feels good",
      "text": "Loved this shoe, looking to buy another one. Its looks very good on, they are very comfortable too.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos Bisono",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "... makes the shoes very breathable and keeps your feet cool. Reminds me of an updated Adidas Stan Smith ...",
      "text": "The mesh makes the shoes very breathable and keeps your feet cool. Reminds me of an updated Adidas Stan Smith sneaker. Light weight., no socks needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Amazing shoe",
      "text": "These shoes are beyond comfortable. And Amazon beats any shoe store price. I would HIGHLY recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 2,
      "publication_date": 20180211
    },
    {
      "title": "Adidas PW....super cool...",
      "text": "Great stylish shoe....wouldn’t wear them to the gym bc I wouldn’t want to get these gym dirty....great with jeans..chino’s...best adidas shoe on the market...",
      "rating": 5.0,
      "verified": true,
      "author": "joseph carlier",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Thanks to my Grandson",
      "text": "My grandson had them and thanks to him I now have 3 pairs",
      "rating": 5.0,
      "verified": true,
      "author": "William Billy Williams",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Four Stars",
      "text": "love them a little bit bigger than expect, but love them anyways",
      "rating": 4.0,
      "verified": true,
      "author": "Fer",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "They look very nice.",
      "text": "Very comfortable and quick to slip into. Nice support! Get many compliments when worn!",
      "rating": 5.0,
      "verified": true,
      "author": "Yul Miller",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Two Stars",
      "text": "The shoes are a horrible fit. They already look loke they been worn",
      "rating": 2.0,
      "verified": true,
      "author": "Terrance Nelson",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "It was awonderful shopping experience!",
      "text": "I cant say anything negative about the item i bought because it was an amazing product so im absolutely thrilled to wear this shoes",
      "rating": 5.0,
      "verified": true,
      "author": "shearwater",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Stylish and light weight but slightly narrower than expected",
      "text": "I have a wider foot, and even having two pairs of Adidas in this same size, this style ran slightly narrower than I expected. However, I've been wearing them for a week now and the mesh-like material of the sneaker makes it still feel comfortable enough for wear with a moderate amount of walking. Absolutely love the look of this sneaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Baxter B.",
      "helpful_votes": 3,
      "publication_date": 20180125
    },
    {
      "title": "Sloppy work - left electronic security tag on shoe",
      "text": "Left security tag on there which means I can’t try them on! Now I have to chase up where to remove tag",
      "rating": 1.0,
      "verified": true,
      "author": "Maurice Santucci",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Small damage",
      "text": "A little damage to some of the adidas label but still in good condition!",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Saunders",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Five Stars",
      "text": "These shoes are so comfortable and i was not expecting it at all",
      "rating": 5.0,
      "verified": true,
      "author": "Drew Marvil",
      "helpful_votes": 2,
      "publication_date": 20180126
    },
    {
      "title": "great condition, & overall a quality purchase",
      "text": "A little bigger than expected, but the ankle fits so snug that you don't need to worry about it. Came on time, great condition, & overall a quality purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh Papageorge",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Stan Smith?",
      "text": "Lightweight. Nice casual court shoe. Lots of color choices. Adidas!",
      "rating": 5.0,
      "verified": true,
      "author": "Billy M James",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "They fit true to size but their pretty slim shoes",
      "text": "They fit true to size but their pretty slim shoes, and the dang insole comes out after you take them off. Wouldn't recommend everyday use.",
      "rating": 3.0,
      "verified": true,
      "author": "ian hurt",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Amazing shoes",
      "text": "Buy a size smaller than yours. Very beautiful shoes. Loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "I’m in love with these shoes",
      "text": "I’m in love with these shoes. Even prettier in person. So glad I was able to get these. So many compliments on them!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Getzloff",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "A happy buy",
      "text": "Many thanks for tips of reviews in regarding its size. Recommend it with no doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "Forest Lin",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Five Stars",
      "text": "The shoes came out better then I expected and recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Welder Morales",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Comfort",
      "text": "Very comfortable shoes. Nice for walking long distances but they easily get dirty.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Love them!",
      "text": "I love these shoes. Fit perfectly with or without socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Ty",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Five Stars",
      "text": "The most comfortable sneakers I've ever owned. Breathable, stylish. Worth every cent.",
      "rating": 5.0,
      "verified": true,
      "author": "Ish H",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "One of the pair came dirty...",
      "text": "Cant believe i paid that amount of money to open the box and see one of the shoes kinda dirty... they were not used, but some how on the toe tip was some dirt. I know that because of the material they can get dirty really easy... but as a new “unboxed” shoe cant figure how. Btw, i had to go a whole size down to fit perfect. They are really confy.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180211
    },
    {
      "title": "Great shoe, great value",
      "text": "Extremely comfortable. Fit is as expected. I orderded my normal size. Don’t take the advice of many others who say go half size down. Possibly the lightest shoe I ever wore. Great casual shoe. I would not use for strenuous activities.",
      "rating": 5.0,
      "verified": true,
      "author": "MikE",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "SUPER COMFORTABLE",
      "text": "I GET SO MANY COMPLAINMENT--- I WEAR THESE W/ ANYTHING",
      "rating": 5.0,
      "verified": true,
      "author": "Nadja McWilliams",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Very comfortable, true to size and the laces are not ...",
      "text": "Insoles comes out every time I take the shoes off. Very comfortable, true to size and the laces are not needed. Light weight shoe. I like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Clay",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "2nd pair I have to return. Need to have ...",
      "text": "2nd pair I have to return. Need to have picked up at address in Austin, not Tampa. Attn: Corey Collins",
      "rating": 1.0,
      "verified": true,
      "author": "Wanda J. Creson",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Five Stars",
      "text": "Gr8 just get a size smaller because they're really big.",
      "rating": 5.0,
      "verified": true,
      "author": "jay frein",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Love the shoe",
      "text": "Love the shoe. Very comfortable but tag on outside of tongue coming off already. Had them only about a week. Easy fix to sew back on but stitching not done well at mfg.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Time for a run",
      "text": "Great original trainers. Love the look and fit of them..Highly recommend if you're into this style and looks better on the feet! Nice purchase I'd say!",
      "rating": 5.0,
      "verified": true,
      "author": "NM",
      "helpful_votes": 0,
      "publication_date": 20171004
    }
  ],
  "product_meta": {
    "title": "adidas Originals Men's Pharrell Williams Human Race Ice Blue/Ice Blue/Blue 6 D US",
    "description": "Style: modern, sporty. Cut: Low Shank Closure: lacing. Inner sole: absorbent, removable. SOLE: non slip, textured rubber sole. Outsole: cushioning plastic sole. Shaft: elastic, sock-like fit (closed). Lace: Sole partially above the toe, soft toe area. Heel: logo on heel",
    "feature_bullets": [
      "Breathable mesh upper",
      "Sock-like fit",
      "Outer Material: Synthetic",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Heel Type: Flat",
      "Material Composition: Mesh fabric",
      "Shoe Width: Medium",
      "EVA Midsole",
      "Contrasting heel."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "28.7 x 20.07 x 10.92 cm; 254.01 Grams",
      "Date First Available": "1 Mar. 2018",
      "Manufacturer": "ADIDAS",
      "ASIN": "B07B4P9CD9",
      "Manufacturer reference": "CP9764-454",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Tennis Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}