{
  "website_summaries": [
    {
      "verdict": "A great price for a ruggedly made bike stem that will easily endure your mountain biking, BMX, and track biking adventures.",
      "pros": [
        "Affordable",
        "High-strength aluminum alloy",
        "Lightweight construction",
        "Works well with a wide range of bikes",
        "Available in 3 different sizes"
      ],
      "cons": [
        "While this bike stem is versatile, it is currently only available in black"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for riser. Geometry calculations here...",
      "text": "Lightweight and perfect. Keep in mind when you get a 70mm stem with a riser, the functional length is not 70 degrees but less. You have to use a geometry calculator to figure it out (or do a rough estimate). Think of it like a right triangle, the center of the bars/tube are points, and the 70mm is the hypotenuse. With the rise angle being 35 degrees, the actual rise therefore is 40mm and the functional stem length (added reach) is 57mm.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 47,
      "publication_date": 20180520
    },
    {
      "title": "Good!!",
      "text": "Bought this stem to replace a 7 degree, 110mm stem. I wanted a little more upright riding position and this stem did the trick. With two 10mm spacers below the stem, my handlebars are now 48mm further back and 35mm higher than the stock stem. My back is happy.",
      "rating": 4.0,
      "verified": true,
      "author": "DavidH",
      "helpful_votes": 11,
      "publication_date": 20180903
    },
    {
      "title": "solved creaks and pops of an adjustable stem",
      "text": "The stem was a replacement for a Felt Adjustable 110mm stem. The adjustable stem was good for my position correct with my new Jones H-Bar, but not stable enough for continued use (many creaks and pops). The Uno 31.8 35 degree was a perfect replacement with the correct positioning. The quality and finish is very nice. Everything fit great. The creaks & pops noise that I had with the adjustable stem is now gone. Very tight and stable solution,",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen S",
      "helpful_votes": 11,
      "publication_date": 20180514
    },
    {
      "title": "Great build quality",
      "text": "Great, feels light weight and we'll built. The quality really surprised me. Bought to mate with Jessica bars.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 7,
      "publication_date": 20190406
    },
    {
      "title": "Wanted my handlebar higher and closer.  This did just that.",
      "text": "This stem was easy to install and did exactly what I needed. Don't forget to apply your front brakes and rock the front of the bike to check that your bearing are tight between the down tube and the fork. If not loosed the stem then crank down on the top bolt to snug it up a tad. Then tighten your stem bolts to the proper torque with a torque wrench.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 4,
      "publication_date": 20190913
    },
    {
      "title": "Best value and quality",
      "text": "I was about to order a more expensive (almost 3x cost) stem and saw this and took a chance and ordered it. It came the next day, and was great quality, easy installation and works great. The only thing i would ask the seller to do would be to include black color stem screws for a better match but that is meant to be feedback that did not change the functionality, quality or install of this item. Highly recommended!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Faraz",
      "helpful_votes": 2,
      "publication_date": 20200429
    },
    {
      "title": "Awesome and holding up",
      "text": "I ride a XC bike pretty aggressively and I am a heavy guy so I was hesitant to buy this. I had visions of this snapping and me going over the bars. Been on a few rides and taken some good drops, rock gardens at high speed, and some serious rollers. Its held up great. It put the bars right where I wanted them a little farther back and higher up. Very happy with this.",
      "rating": 5.0,
      "verified": true,
      "author": "DTMFM",
      "helpful_votes": 2,
      "publication_date": 20181126
    },
    {
      "title": "Now this stem is solid!",
      "text": "I needed to sit more upright position on my mountain bike as the steertube was cut too short. This stem is solid and does the job. I have taken my bike on Enduro races and it handles the 2'-4' drops with no issues. Very reliable so far. All stem bolts and face plate bolts haven't came lose compared to my $100 Thompson stem does.",
      "rating": 5.0,
      "verified": true,
      "author": "Simple_Guy",
      "helpful_votes": 2,
      "publication_date": 20181117
    },
    {
      "title": "Super nice. Exactly what I wanted",
      "text": "Super nice. Exactly what I wanted. I was running a 70mm inline and I wanted my bars up and back a bit. This did exactly that. Quality looks superb.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180719
    },
    {
      "title": "great short stem",
      "text": "Needed a stem to elevate bars from the original flat racing position. Shorter stem and elevation did the trick. fit perfectly. You may want to get Loc-tite for the fasteners, as they don't have locking threads.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Fancy",
      "helpful_votes": 3,
      "publication_date": 20180826
    },
    {
      "title": "Good product, good price",
      "text": "Very nice stem. Screws are pre-greased, install ready. Replaced the stock 70mm x 7 degree stem on my size large Raleigh Talus 4 with the 90mm x 35 degree, perfect. From 42\" to 44.5\" grip height. Grips are about 4\" above current seat height. A couple inches makes a huge difference. Maybe brought the reach in a hair. Just enough to make it look and feel just right. Perfect for long cruises on the bike paths but also felt just as, if not better when I went off road. It looks and feels like it should for recreational riding. Like others, I put it off too long, just do it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shop Hopper",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Perfect!",
      "text": "Went from 120 mm stem to this one. Gave me way more confidence on the trails. I should be on a medium frame but I am on a large frame. Just made it feel like a medium frame.",
      "rating": 5.0,
      "verified": true,
      "author": "David L.",
      "helpful_votes": 2,
      "publication_date": 20190510
    },
    {
      "title": "Not bad at all",
      "text": "Not the lightest, but exactly what I needed to adjust my short arms to a longer bike .",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan N",
      "helpful_votes": 3,
      "publication_date": 20190730
    },
    {
      "title": "Real nice stem!",
      "text": "Took weight off my wrist, because I didn't have to reach forward as far. Only tighten screws 5-6 newton meters torque (50 inch pounds) Use a torque wrench!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190423
    },
    {
      "title": "works great for 31.8mm handlebars",
      "text": "I replaced the stock handlebars on my mountain bike, they were to low and made my palms soar from leaning over the front too far so I replaced the handle bars and stem with 5\" riser 31.8mm handle bars and this stem, it worked out perfectly, now it's comfortable to ride the bike.this stem is shorter than the original so I didn't need to replace the cables.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Bagwell",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Much better upright position",
      "text": "Seems to be quality metal. Very light! It was way shorter than the original one so with this one on I sit much more upright. Puts a lot less weight on my palms which is exactly what I was looking for. I also put wider bars on my cheap motobecane at the same time and it's made the bike feel wayy more stable. Thrilled with the purchases",
      "rating": 5.0,
      "verified": true,
      "author": "David Mckee",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "did i get a duplicate?",
      "text": "so i got the item today and it fits fine. feels light weight, but the decals looks completely different from what i have seen in the image photographs and reviews. did i get a duplicate one? wont feel comfortable riding with this stem. giving 1 start as I am not sure this is a duplicate or not. will try replacing.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Does the trick",
      "text": "I have longer legs and shorter arms. My lower back was beginning to bother me as I moved my seat back to take advantage of the leverage of my legs. This purchase raised and brought back my handlebars a bit, allowing me to still get the leverage generated by being back in my seat without having to reach too far forward while I ride. Easy to install and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul H",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Good value for the price",
      "text": "Works great to get the rise I need on my gravel bike bar. Matte black looks great, nicely machined and finished. There are lighter stems but this is acceptable for my purposes and the value is definitely there. Would purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "BigSkyMT",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Well made, tough and light weight.",
      "text": "It took less than two minutes to install this stem riser about an inch or so. With this install I can keep my original handlebars that came with my bike. I just needed the extra rise. After and hour or so of riding my arms and back feel so much better. If you think about it, I saved about 70 bucks. That's how much a new 785mm RaceFace riser bars cost. great buy and it looks awesome. Buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Very Happy with my purchase",
      "text": "I don't really have much to say that hasn't already been said. It's a stem and it fits. I like the finish and styling and it does what I need. I just wanted to add my feedback to help give people the confidence to buy it if they think it will help them.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Hudg",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great Product",
      "text": "I installed this new stem on my bike and it made a world of difference on my neck strain and arms. The reach is just the right length for me as well as the 35 degree angle raises the bar just enough to allow me to ride in comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "INKWIA",
      "helpful_votes": 2,
      "publication_date": 20181031
    },
    {
      "title": "Excellent quality for the price",
      "text": "I thought the stem was very good quality better then the stock stem from specialized. The price allowed me to get a couple to play around with. The fit for the steering stem was nice and tight, no slop. The handlebar fit was perfect as well. , Nice finish, all bolts had lock washers. I was really impressed for what I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hall",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Just what I needed",
      "text": "Appears well made and fit my handlebars and riser stem perfectly. Made my new ebike very comfortable to ride. Only needed a slight increase in handlebar height.",
      "rating": 5.0,
      "verified": true,
      "author": "Cnc Jim",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great and would recommend.",
      "text": "Great stem! Sturdy, nice finish, quick and easy install. Perfect to raise and move the handlebars closer in.",
      "rating": 5.0,
      "verified": true,
      "author": "Prepper1",
      "helpful_votes": 2,
      "publication_date": 20190405
    },
    {
      "title": "Love it",
      "text": "If you have a standard Trek stem and find it just a little short for neutral riding but still like to get up over the bars this is the part you need.",
      "rating": 5.0,
      "verified": true,
      "author": "joe scruggs",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Lightweight but strong",
      "text": "After doing the measurements and the math I chose this configuration to raise the handlebars and give me just the right position for comfortable riding.",
      "rating": 5.0,
      "verified": true,
      "author": "Buck Rogers",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Too short!",
      "text": "This is quite a bit shorter than my original 7 degree stem. The attached pictures show 7, 17 and 35 degree 70mm stems. I tried to align them but the angle makes it look off.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Works great",
      "text": "I wanted my handlebars a little bit higher on my mountain bike to take a little bit of pressure off my lower back, shoulders, and wrists and this did just that. Exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Makes a huge difference!!",
      "text": "Got this for the new hybrid bike that we got for my wife. With the pandemic could not do a bike fitting. The bike was great but the original stem was too long without any substantial rise. We were thinking about returning the bike. Installing this made a huge difference. Took about 10mins to install and make the necessary adjustments. Feels like a completely new bike.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandeep.D.Karnik",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Well-built, easy to install",
      "text": "Simple and easy to install. Good quality metal. I anticipate this lasting a while. Only drawback is that it's on the heavy side compared to the Bontrager stem I replaced. Pay attention to the weight if that matters to you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Nice",
      "text": "Made my bike more confortable than before, I choose this based on reviews and I'm sure I choose the better one, looks strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Guillermo Mora",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Works great",
      "text": "It works great and seems to be a quality item. There are no visible signs of poor design or manufacture. Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennen",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Nice construction and well built",
      "text": "I've used the FOMTOR 35 Degree stem now for quite a few rides and it works well. Only complaint is that one of the bolts is already showing rust. Well built!",
      "rating": 5.0,
      "verified": true,
      "author": "TAD59",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "I put on my road bike for my back, great!",
      "text": "I put this on my road bike for my back and for comfort. I can be somewhat upright yet go down to the lower bar for wind and speed still.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Stones",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Works as it should",
      "text": "Worked as described. Bought this to try different geometry before purchasing more expensive parts.",
      "rating": 4.0,
      "verified": true,
      "author": "Wes",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "*",
      "text": "does what i need it to do but a little thin wouldnt use it for heavy offroad riding like mtb or anything",
      "rating": 5.0,
      "verified": true,
      "author": "Adriana",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Thumbs up",
      "text": "Can’t beat the value to weight. Of course you can save a few grams of weight but for me the cost is not appropriate to the weight savings. Thanks for reading",
      "rating": 5.0,
      "verified": true,
      "author": "Poppa pump",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Cheap replacement stem.",
      "text": "Cheap replacement stem. Great for figuring out what length,size or set up you’re most comfortable with. At the price buy another size and offset as well. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Chobble Gobler",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "It does what I wanted",
      "text": "Good quality for the money. It got me sitting more upright helping my back angle and neck.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Murphy",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Exactly what I needed",
      "text": "Simple stem to add length and height to my bike after changing handlebars.",
      "rating": 5.0,
      "verified": true,
      "author": "Elliot",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Perfect for raising handlebars",
      "text": "Perfect amount of rise for me to use with a Jones bar, nice and upright. Fit and finish seems excellent as well. Would recommend for anyone trying to significantly raise their bars.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Great little stem!",
      "text": "Raised and shortened the reach my Giant ebike handlebars. No more lower back and neck pain!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "AWESOME STIM",
      "text": "I PURCHASED THIS STIM TO RELIEVE MY SHOULD, ARM, BACK, NECK ISSUES BECAUSE I WAS REACHING TOO FAR. THIS SHORTER STIM FIX THE PROBLEM. BEEE CAREFUL WHEN YOU ORDER , MAKE SURE IT WILL FIT YOUR HANDLEBAR. MY HANDLEBAR WAS TOO SMALL FOR THE CLAMP AND I HAD TO PURCHASE A SHIM SO IT WOULD FIT.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew F.",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Good so far",
      "text": "Affordable, quality product, which shortens my front. Good so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe in Murray, UT",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Good",
      "text": "Installed on my Trek Fx2 to bring my handlebars closer and higher. Works great",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "GET A RISE OUTTA YOUR BARS",
      "text": "The perfect amount of rise at a good price. No brain surgery of design here. It does what it's supposed to do and looks good doing it, at least IMHO.",
      "rating": 5.0,
      "verified": true,
      "author": "Guitartec",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Quality part",
      "text": "This real brought the bars back and up to make my rides more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve O'Connor",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "A better fit for me",
      "text": "Exactly as expected. For hardcore maybe a few ounces too heavy but weigh against cost. Made my bike fit me now!",
      "rating": 5.0,
      "verified": true,
      "author": "Stonejam",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Worked great for me",
      "text": "Bolted right on, and the bars were raised/extended to where I needed them. Fit and finish seem good, though the logo is not the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler H. Tanner",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Nice upgrade",
      "text": "Great fit and did exactly what wanted to do raise bars about and inch and a half.",
      "rating": 4.0,
      "verified": true,
      "author": "KimR",
      "helpful_votes": 2,
      "publication_date": 20180731
    },
    {
      "title": "Well made",
      "text": "gave me a little more upright position but also with the long stem kept my position forward. Good for cross country and climbing.",
      "rating": 5.0,
      "verified": true,
      "author": "MozoMoto",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great!",
      "text": "Quick delivery and really nice item. Exactly what I was looking for",
      "rating": 5.0,
      "verified": true,
      "author": "candksnyder",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "incorrect description",
      "text": "This is a -35 degree stem. Sure it can be flipped, but it should be advertised properly. Even the photo (upon closer inspection) shows the stem in an upside down position.",
      "rating": 1.0,
      "verified": true,
      "author": "zeKe",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Fast and fantastic.",
      "text": "Absolutely perfect. Delivered quickly ... easy to install ... high quality ... great price for a specialty part. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary McCarver",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Solid Riser",
      "text": "This item is well constructed and fit my bike perfectly. It makes riding more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Wolftick Videos",
      "text": "Very Easy install and makes a huge difference! Put it on my GT Aggressor Pro, wanna see install/ review Checkout Wolftick Videos on youtube.",
      "rating": 5.0,
      "verified": true,
      "author": "Wolftick Videos",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Solid product and perfect fit",
      "text": "Perfect to raise the handlebars to the ideal height for me. This and 40mm riser handlebars made a huge dufference in comfort on longer rides. Great solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Roby",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Well built but heavy",
      "text": "It's a stem, though a bit heavy but it seems to be well built. Exactly the rise we needed",
      "rating": 4.0,
      "verified": true,
      "author": "Larrie Brysch",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Ehhh",
      "text": "Has some imperfections in the aluminum. Not the best quality.",
      "rating": 2.0,
      "verified": true,
      "author": "jorge perez",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Four Stars",
      "text": "Would been five stars but one of the screws was stripped so I returned it.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Walker",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Heavy",
      "text": "It does the job but it's pretty chunky and heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "TX Student",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Very good quality",
      "text": "Very easy to install. Very high quality. This is the second of these I’ve purchased. I’m very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Leon",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Comfortable ride",
      "text": "Brings the bars up higher for a more comfortable seating position.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Seems well made.",
      "text": "Worked as expected, a more upright riding position. Does change the feel of the bike.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan D. Kalla",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Works great!",
      "text": "Perfect part for converting my XL my bike to a large",
      "rating": 5.0,
      "verified": true,
      "author": "LekrickP ",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Great riding position",
      "text": "Back doesn't hurt anymore. Got me in a great riding position",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Bloom",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Good quality and easy install.",
      "text": "Arrived quickly and the quality was as expected. It was easy to install and replace the old stem.",
      "rating": 5.0,
      "verified": true,
      "author": "Dominic Stross",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Handlebar diameter",
      "text": "Be sure and check the diameter of your handlebars. Apparently not compatable with all mountain bikes..another paperweight in my garage..frustarating.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim N",
      "helpful_votes": 2,
      "publication_date": 20180816
    },
    {
      "title": "Feels good and It works for me!",
      "text": "I have an old stumpjumper and I needed to have the front end higher so that that bike angles better for my riding. I changed from 26 to 27.5 front wheel and this sealed the deal to my setup. The stem looks and feels good. I already tried it at Skeggs point and I do have any complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikko Dealca",
      "helpful_votes": 0,
      "publication_date": 20200728
    }
  ],
  "product_meta": {
    "title": "FOMTOR 31.8 Stem 35 Degree 70mm 90mm 110mm Bike Handlebar Stem Riser MTB Stem Suitable for Mountain Bike, Road Bike, BMX, MTB",
    "rating": 4.7,
    "feature_bullets": [
      "Handlebar diameter 31.8mm (1.25''), front fork stem diameter 28.6mm (1-1/8\"), Length: 70mm (center distance of the two holes)",
      "Angle: +/- 35 degree.help to up or down the heigth of handlebar.",
      "Light weight and durable. Weight.140g(0.3lb)",
      "Constructed of high-strength CNC machined 6061 T6 aluminum alloy.",
      "Suitable for most road bike, mountain bikes, track bike, MTB, BMX, DH, etc."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 10, 2018",
      "Manufacturer": "FOMTOR",
      "ASIN": "B078X9HP73",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Handlebars, Headsets & Stems",
      "Parts & Components",
      "Stems",
      "Cycling"
    ],
    "price": 16.99
  }
}