{
  "website_summaries": [
    {
      "verdict": "The Reebok Zig Pulse SE is a unique-looking, neutral road shoe that many considered to be a refreshing take on modern footwear. Despite the cool design, some were not pleased that tiny pebbles got stuck on the crevices of the sole. Others wished that there were more colorways available. Nonetheless, the majority still appreciated the shoe for its affordable price, comfort, and cushioning.",
      "pros": [
        "Most users mentioned that the shoe felt comfortable",
        "Some testers with foot and knee problems said that they did not feel any pain while wearing the Reebok Zig Pulse SE",
        "Most runners commended its lightness",
        "Plenty of users appreciated the design of the upper and the platform",
        "One user with a bigger body build mentioned that he felt the shoe provided plenty of support for his weight",
        "A majority of users said that the price was affordable",
        "A good number of reviews stated that the cushioning provided was sufficient",
        "The shape of the shoe caters to a wider foot, said some testers"
      ],
      "cons": [
        "A lot of reviews mentioned that pebbles easily get stuck on the crevices of the sole",
        "Some testers were not pleased that it only came in two colorways"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.0,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "work shoe",
      "text": "we love thiese shoes. i work for our local law enforcement agency. and I am on my feet all day..walking running and standing around. perfect for work.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 17,
      "publication_date": 20190408
    },
    {
      "title": "Terrible Quality",
      "text": "This is my second pair. The reason I purchased a second pair is because the first pair was very good and lasted two years. But this pair was not to the standards of the first pair. Do not buy terrible Quality.",
      "rating": 1.0,
      "verified": true,
      "author": "jose alonso",
      "helpful_votes": 13,
      "publication_date": 20190424
    },
    {
      "title": "No more aching feet./ 22 day update",
      "text": "I where them at work and I am on my feet 9 to 10 hours a day. They feel great! a 22-day update on my initial review at first I rated on the 5 off of looks and comfort I'm dropping that reading to a to they still look beautiful they still are comfortable but if you're hard on shoes do not file at 22 days they electronically welded seams have started to come apart on the inside where the this is where around the toe cap to the ball of your foot where the side piece and the toe flat overlap it's electronically welded in the side where my your foot flexes that part has already started to pop.",
      "rating": 2.0,
      "verified": true,
      "author": "Carl l Moon Jr",
      "helpful_votes": 6,
      "publication_date": 20191228
    },
    {
      "title": "Comfortable, but not Durable",
      "text": "I really wish I did not have to write this review--I've recommended these shoes to several of my co-workers because they are very light and comfortable. I've only had these for a couple of months and use them as uniform shoes for work. Unfortunately, after wearing them for this short period and for very light work, I find they do not breathe resulting in \"swamp\" foot after a 12-hour shift. I work exclusively indoors, so these would be terrible for someone who works outside. Also, after this short period, I noticed the upper is separating from the sole, so these will be worthless within a couple of weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "K. McGraw",
      "helpful_votes": 3,
      "publication_date": 20200331
    },
    {
      "title": "Probably the most comfortable shoe I've owned",
      "text": "I bought these on recommendations from other referee's. I've had issues over the years with my heel that finally got fixed with surgery. These really make it feel like i'm not wearing anything at all on my feet. They are so comfortable. I'm now able to ref a lot longer now with no pain.",
      "rating": 5.0,
      "verified": true,
      "author": "R.A.S.",
      "helpful_votes": 5,
      "publication_date": 20200112
    },
    {
      "title": "Awesome work shoe",
      "text": "These shoes are comfy stylish. I was able to buy the women’s size 10 version of this shoe and the fit was exact.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 7,
      "publication_date": 20200305
    },
    {
      "title": "Very good for officials",
      "text": "Length and width were perfect. Very light and running multiple games on crappy floors I still feel great. Only complaing is that the cut is fairly low around the ankles so the support isn't as high as I would like.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Perry",
      "helpful_votes": 5,
      "publication_date": 20191222
    },
    {
      "title": "Comfort and professional shoe",
      "text": "These shoes come in standard width. I am barely a wide and they are very comfortable and really helps when running up and down the court. Order 1 size up, that is what I did, better to have a little more room than a too tight fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigjohn",
      "helpful_votes": 2,
      "publication_date": 20200106
    },
    {
      "title": "Reebok shoes",
      "text": "I love the Reebok zig pulse running shoe. I purchased a earlier model of this shoe and have worn them for two seasons of basketball and Volleyball. They're still in great shape. I will break the new pair in this year and use the older pair for softball and football next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Vendor",
      "helpful_votes": 3,
      "publication_date": 20191104
    },
    {
      "title": "cheap looking and feeling",
      "text": "These have been the worst Zig Technology I have ever purchased. They are brutally stiff and VERY cheap looking. Nothing like previous models I have purchased. I wore them once and could barely walk for a week after, my foot was so bruised afterwards on the sole and ball. I cannot even say how disappointed I am as I had a pair I wore for years to ref basketball with and could not be happier, these however were an epic fail.",
      "rating": 1.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Very comfortable and sturdy",
      "text": "I teach group exercise classes & a jogging class. These shoes are very comfortable and light weight but sturdy and can take abuse without showing wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo the Lion",
      "helpful_votes": 2,
      "publication_date": 20200206
    },
    {
      "title": "Great shoe and shine!",
      "text": "Only thing I don’t like is that they squeak when I walk, like I’m stepping on a bed of frogs lol",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Zamora",
      "helpful_votes": 2,
      "publication_date": 20190603
    },
    {
      "title": "They provide cushion for your feet and knees.",
      "text": "This product typically runs small. I normally wear a size 11 and I ordered a size 12. It is a bit roomy, but I wear a thick pair of socks when refereeing.",
      "rating": 4.0,
      "verified": true,
      "author": "Bone",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Zigpulse",
      "text": "I love the quality and the comfort of the shoe and the decent price and the fast shippingGood quality",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Ricco",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Great Product!",
      "text": "I bought these as a gift for my father for Christmas. He refs basketball games for fun on the side and he absolutely loves them. This is a great choice for this purpose!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Martin",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Perfect",
      "text": "Very comfortable ~ buy them you wont be sorry ~",
      "rating": 5.0,
      "verified": true,
      "author": "LYNNIE",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Referee shoes",
      "text": "Love the fit & comfort. To early to tell about long term durability.",
      "rating": 4.0,
      "verified": true,
      "author": "Jmcneese",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Comfy shoes for walking/moving",
      "text": "Fits perfect. I am a mail man so I walk 15 miles a day. Shoes great but only problem I had was when I stepped in wet grass I could feel at my toe moisture. This makes me think the sealing between sole and shoe may be weak. Aside from that I believe the shoes are very comfy and light which is why I bought them",
      "rating": 5.0,
      "verified": true,
      "author": "scott nguyen",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "True fit, nice feel",
      "text": "Shiny is certainly shiny but I already knew that is what I wanted. I order 13 and it fit true to size. They work well for basketball but i will admit that I didn’t get to ref too many games before the virus cancelled everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Mid 30’s hard working fun spouses",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "The shoes fit great!!!!",
      "text": "The shoes arrived on time, fit great, and get tons of compliments! I work in Law Enforcement and everywhere I go, people ask me where I got them!",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Barnes",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "I Love Reeboks",
      "text": "I ordered two pair...a pair for work and a pair to where with my cute dresses and skirts. I wear a ten in women's size so I purchased an 8 in men's size. They look aaamaazing on my feet.",
      "rating": 4.0,
      "verified": true,
      "author": "Nikki B.",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "On duty happy feet.",
      "text": "I love these. Its my 3rd pair. I got two years out of the last set. 9 hours a day 5 days a week on concrete and steel.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter K.",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Nice shoe",
      "text": "Very comfortable shoe. I use these to referee multiple basketball games.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Brosher",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Zigzag",
      "text": "So shoe is kind of ugly with the gloss black. Wasn’t expecting it to look like it did. Overall feels good and runs smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "TheAverageConsumer1738",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Fit and Finish are great!",
      "text": "I really like these shoes. They are comfortable and look great. I did have a previous pair of them that I wore out. Therefore, I knew exactly what size to order. If I had not known my exact size I probably would have had issues and maybe returns until I got it right. Shoes are extremely hard to buy online. But, because of my prior knowledge about this shoe everything went perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Theodore J. Huffman",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Good shoe",
      "text": "First evening I had them I officiated two games. Felt no issues at all. No break in required. Did another 60+ games and I still feel the same about them.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "So Comfortable!",
      "text": "I was a bit skeptical paying so much money for a pair of sneakers but I heard great things from coworkers and I needed a comfortable sneaker! I am so glad I went for these because not only do they fit amazing but they have a shine on them which is beautiful! I would recommend to anyone who moves alot and need a really good work, workout etc sneaker. Worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaye",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "Comfortable",
      "text": "Very comfortable ...they are very good for walking in the prison 12 hours and 8 hour shifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorinda  Hays",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great product",
      "text": "As I am law enforcement officer, I have been wearing the Reebok Zigs as a uniform shoe for many years. I really enjoy their fit and durability as a running shoe and their appearance in uniform.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan D. Wilson",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Awesome",
      "text": "These Reebok are a great addition to add to my ever growing shoes collection. They look great and feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Hale",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Excellent buy",
      "text": "Adding a half size bigger was the best idea. Next time I'll have to get a whole size bigger to be able to put insoles in for extra comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Laws, Jr.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "The perfect black running shoe.",
      "text": "I love these shoes! They're comfortable and they look so sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Rell Fett",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Highly recommended",
      "text": "Great shoe for Law enforcement duty, comfortable and looks good with uniform.",
      "rating": 5.0,
      "verified": true,
      "author": "ED LO",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Very comfortable shoes",
      "text": "Great very comfortable shoes. I am orders another pair soon. They are great for walking!",
      "rating": 5.0,
      "verified": true,
      "author": "veronica",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Fits Well to Shoe Size.",
      "text": "This shoe is a comfortable fit. I use them for officiating high school basketball. I am usually officiating two games a night and the shoe is very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Dolores",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "satisfied",
      "text": "It fits true to size and im satisfied with it. 2 weeks and no issues thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin N.",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "great shoe",
      "text": "many compliments on the style and the shine of the shoe",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Shaw",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Good basketball referee shoe",
      "text": "Much more comfortable than the Nike Air Monarchs I had to referee basketball. I used to get blisters and be sore after working 3 or 4 games with the Reebok Zigs I no longer get blisters.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Frankos",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Beautiful shoe",
      "text": "Beautiful shoes plenty complements ,use them for work ,goes well with my uniform. Ordering backups before they’re no longer available. Thanks Rebok",
      "rating": 5.0,
      "verified": true,
      "author": "Michael a Solomon",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Work shoes for wife",
      "text": "Good fit, finish and less foot fatigue at the end of the work day",
      "rating": 5.0,
      "verified": true,
      "author": "MoMoney",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "BEST PRODUCT SO FAR",
      "text": "One of the best products bought from amazon so far. There are so many brands but with this purchase, REEBOK is the best. I LOVE IT",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Horrible Quality for $95.00",
      "text": "I used it for about a month. As you can see in the pictures HORRIBLE QUALITY.",
      "rating": 1.0,
      "verified": true,
      "author": "Renzo Giovanni Torres",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "nice looking and fit just 2 weeks and manufacturers defective",
      "text": "i love the shoes but just over 2 weeks and the rubber of the soles is comming off very disappointing for 100 dollar show i didnt save the box so dont know what to do",
      "rating": 1.0,
      "verified": true,
      "author": "ezra dooley",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Good support and fit!",
      "text": "Helped give support that I didn't expect for not only my feet, but my back as well! Fits just like I expected it to and they look nice!",
      "rating": 4.0,
      "verified": true,
      "author": "leslie",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "If you are size 10 in men's. And you have a narrow foot you may want to order a 9.5",
      "text": "The shoe is overall sweet. Like walking on a cloud. For the price and quickness of shipping during. These tough times I will be doing business with the seller again soon. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "size and comfort",
      "text": "I love to shoe. I am a HS basketball official.",
      "rating": 5.0,
      "verified": true,
      "author": "DC Carter",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Uncomfortable shoe",
      "text": "Most uncomfortable show I have ever worn for officiating. They hurt my feet and hips when running. I felt like I was always leaning backwards for some reason. I wound up returning them.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara Pickup",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Hard at first but comfortable after you break them in.",
      "text": "On the side, where the toe bends, it is unsticking.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Excellent buy!",
      "text": "A bit shinier than the old matt finish (but not as much as patent leather) which presents a very professional appearance on the basketball courts!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary A. Stewart",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "A substitute for shinning work boots (corrections officer)",
      "text": "After several weeks wearing them my feet still have issues with pain. i wear them, every day for several hours of the day, insouls might fix the issue.",
      "rating": 3.0,
      "verified": true,
      "author": "Raymond Lee",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "BEST SHOES EVER",
      "text": "I like the shine on them. I have gotten many compliments on them and referred people to this site. I will be ordering another pair soon",
      "rating": 5.0,
      "verified": true,
      "author": "ANDRE HINTON",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Very comfortable!",
      "text": "I love these shoes...they are a true fit...the thick wide sole makes for a comfortable and stable step ...and of course the patent leather look is always special",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Webb",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Great officiating shoes.",
      "text": "I officiate three sports. Patent leather nice for basketball and lacrosse. Prefer matte finish for football. This style cured my planters fasciitis.",
      "rating": 5.0,
      "verified": true,
      "author": "Laxref23",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Good shoe for the price.",
      "text": "Very comfortable shoes for running up and down the floor!",
      "rating": 5.0,
      "verified": true,
      "author": "mrdavidg",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Ugly but perfect",
      "text": "These shoes are ugly. Like really ugly, but they are perfect for my husband’s side hustle as a lacrosse referee. They fit well and provide good support",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Style and fit.",
      "text": "I love the product, they remind me of my military days because of the patent leather look.",
      "rating": 5.0,
      "verified": true,
      "author": "toshia l. mcswain",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Not comfortable and too expensive",
      "text": "I use these shoes to Referee basketball. They are very uncomfortable. Very disappointed!!",
      "rating": 2.0,
      "verified": true,
      "author": "Joe Rodgers",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great Purchase!!",
      "text": "Very lightweight and comfortable. Feels like you’re floating while walking!",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Good but one suggestion...",
      "text": "Good shoes for officiating basketball. Might think about reinforcing the toe area because there is a lot of short stops in refereeing. Other than that these are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert G. Daniels",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Built for comfort",
      "text": "Best shoes my husband has ever owned!!! He had trouble walking with his ankles and knees so these shoes have been a major blessing.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Powell",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great shoe",
      "text": "Like the material Disliked the discomfort after long wear. Wear for softball",
      "rating": 5.0,
      "verified": true,
      "author": "LaToya Murray",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Fake cheap copy shoe",
      "text": "This is a fake Reebok tennis shoe. Cheap and Very uncomfotable. I bought the zag for comfort. These are NOT Reeboks....pissed off.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Wideness and comfort. I work 12 hour shifts.",
      "text": "They needed to be available in a wide size. The medium size almost fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Comfort above all others!",
      "text": "The shoes are exactly what I expected - the most comfortable and also the best looking ref. shoe in the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Derrick King",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "They shine!",
      "text": "Every one loves the look and the shine but wearing them for long periods of time can start to hurt your feet a little",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great quality!!!",
      "text": "Shoe fits great. Easy to clean if you work in an environment that requires it.",
      "rating": 4.0,
      "verified": true,
      "author": "Cecilia A.",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Just not the Reebok quality",
      "text": "I do not like the shoe at all. Not comfortable when exercising.",
      "rating": 2.0,
      "verified": true,
      "author": "renee byrom",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "These shoes are in men sizes!",
      "text": "Very comfortable. I use for work. We have to wear publishable shoes for the shine. These come shiny, so no polishing needed for me!!",
      "rating": 5.0,
      "verified": true,
      "author": "Edna Haywood",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "worst rubber sole ever.",
      "text": "Bad quality, sole fall apart with in a month of wearing it.wont recomend. Reebok needs to improve this shoe sole.",
      "rating": 1.0,
      "verified": true,
      "author": "heicel Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Great shoe",
      "text": "I like the look of this shoe helps my uniform stand out as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ufigo",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Perfect fit",
      "text": "I officiate basketball and love these tennis shoes. Feels like I'm running on a cloud.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "I’ll be back",
      "text": "I have very bad feet & this particular style of reebok are comfortable on my feet",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Good Officiating Shoe",
      "text": "Great shoe for basketball officials. Shoe has lots of support and looks great",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Wiseman",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Now like all other shoes the larger the size the worst it looks",
      "text": "New version feels cheap and plastic looking. Guess I am just old school -",
      "rating": 4.0,
      "verified": true,
      "author": "James Jennings",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Shoe feels great",
      "text": "Great shoe. I officiate several games a week and it really helps my feet be comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Vitus",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Did not fit as expected.",
      "text": "The shoes looked good, but they were way too narrow for my husband's feet. I had to return them.",
      "rating": 3.0,
      "verified": true,
      "author": "Theresa Ihrig",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Nice walking shoes",
      "text": "Comfy and semi water proof. I walk a lot at work",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "The shoe is great not I don’t like the peeling!",
      "text": "The shoes started peeling and it was too late to return them!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Great fit",
      "text": "I love these shoes. They fit perfect and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Telicia Rogers",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Good show for basketball official",
      "text": "Shoes are warm, very little venting. They do look good though. They are comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Very Comfortable",
      "text": "I am a big guy and these shoes have great support and are super comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Harmon Smith",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Good shoe",
      "text": "Shoes fit well... didn’t even need to purchase additional insoles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Smith",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "It feels good",
      "text": "I like the comfort of the shoe. I use it for refereeing",
      "rating": 5.0,
      "verified": true,
      "author": "JJR",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "One of the best shoe out here!!!",
      "text": "Love the shoes there perfect 👌🏾 for me in what i use them for!",
      "rating": 5.0,
      "verified": true,
      "author": "Nolia Boy Ent",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great Shoe!",
      "text": "These are great shoes fit,look, and feel as expected. Great Shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Lakelia",
      "helpful_votes": 0,
      "publication_date": 20191225
    }
  ],
  "product_meta": {
    "title": "Reebok mens Zig Pulse Se",
    "description": "Material: Lightweight mesh upper for breathability. Low-cut design for freedom of motion and quicker transitions. Designed for: Running, training workouts. TPU plate in the heel distributes pressure. ZigTech midsole for superior cushioning and shock absorption",
    "rating": 4.6,
    "feature_bullets": [
      "DURABLE AND LIGHTWEIGHT MATERIAL: These sneakers feature mesh upper for lightweight breathability and carbon rubber overlays for abrasion resistance and durability",
      "EFFICIENT FOOT SUPPORT: These stylish trainers are designed with ZigTech midsole for superior cushioning, shock absorption and high abrasion carbon rubber outsole for durability and support",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Shoe Width: M",
      "COMFORTABLE AND STURDY DESIGN: This footwear features a low-cut design that provides freedom of motion and quicker transitions, EVA sockliner adds comfort and a TPU plate in the heel distributes pressure",
      "HIGH-PERFORMANCE RUNNING SHOES: Ideal for walking, urban running, and high-intensity training"
    ],
    "specifications": {
      "Package Dimensions": "32 x 23.5 x 12.07 cm; 1.36 Kilograms",
      "Date First Available": "1 Nov. 2018",
      "Manufacturer": "Reebok",
      "ASIN": "B07KV67N9Z",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 200.54
  }
}