{
  "website_summaries": [
    {
      "verdict": "Available at a low price, this smart switch is a significant value, especially its ability to pair with smart home systems for easy use.",
      "pros": [
        "This switch is easy to install and use, making it perfect for someone new to the smart home world",
        "Dimmer comes with an easy-to-use slider",
        "Wires on switch are conveniently and clearly labeled to take the confusion out of installation"
      ],
      "cons": [
        "Requires neutral wire",
        "Plastic is a bit thin compared to other models"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy to install and operate",
      "text": "I bought 2 of these switches, one for my kitchen pot lights and the other one for my tv room pot lights. Installation took less than 5 minutes and the instructions were very clear. I use the switch in conjunction with the Philips Hue App. I can control the lights off and one and brightness via the Philips Hue App or by voice using Google Home or Amazon Alexa. I can also use the Philips Hue App to control the lights while I am away, much better than having a light come on using a timer. You can also turn the lights on using the button on the switch and also control the dimmer using the switch.",
      "rating": 5.0,
      "verified": true,
      "author": "rosscraig",
      "helpful_votes": 2,
      "publication_date": 20180811
    },
    {
      "title": "Started off good but ended poorly",
      "text": "I bought this Jan of 2020 and got it installed near the end of that month. Its been about 3 months and i think its finally worse than a non smart dimmer. At first it lost its pairing w/hue bridge, fine i will reset it. Then a few days later it seemed to do it again...okay ..but now the power button wont work. You need the power button to put it in pairing mode. this is extremely annoying and I'm starting to wish i'd just gotten a different model.",
      "rating": 1.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Works Flawlessly With Echo Plus",
      "text": "We replaced a standard slide dimmer switch with this Quotra Wireless Smart Dimmer. It was easy to install, and the depth of the switch is the same as our previous switch so it fit into the existing box with no difficulties. Pairing the new switch with the Echo Plus was a snap. My only complaint for which I deducted one star is the location of the ground wire. It is riveted to the mounting flange in such a way that the ground wire partially blocks the mounting screw hole, and the wire holds the bottom of the switch out about 1/32\" from the box so the cover plate doesn't quite sit flush against the wall.",
      "rating": 4.0,
      "verified": true,
      "author": "Smart Shopper",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Great switch at a reasonable price!",
      "text": "I purchased this switch to use with six led bulbs that I didn't want to replace with the expensive Hue bulbs and I'm impressed. This is a quality product and works exactly as promised. It connected with my Hue hub almost instantly and works flawlessly with the Hue app and Google Home. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Wise",
      "helpful_votes": 2,
      "publication_date": 20180819
    },
    {
      "title": "Unreliable",
      "text": "Using this with a Hue system with a strong Zigbee network. These are unreliable - sometimes they come on properly, sometimes they don't (about 25% of the time they don't work). I need to turn lights off, then on again. Have two of these in close proximity and they show the same behavior. Unfortunately, these control our existing incandescent lights and there's few Hue compatible dimmers that will do this.",
      "rating": 3.0,
      "verified": true,
      "author": "Walt H",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Instruction up to date?",
      "text": "I'm trying to set up the dimmer with the hue hub and I have some problem: 1- I can't get the pairing mode, no matter how much I try 2- The hub and the app can see the dimmer but as a light (just like the set up instruction mention it) 3- When I add the dimmer (seen as a light in the P. Hue app) the on/off button works but not the dimmer. 4- I would like to control another Hue light (not wired to the dimmer), in the same room but can't figure out how.",
      "rating": 1.0,
      "verified": true,
      "author": "Oki Doki",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Great switch reasonable price. Customer service is outstanding.",
      "text": "This is a very nice Zigbee smart dimmer switch. Customer service is outstanding. The best part about this switch. I was able to squeeze it next to a GE fan Control zwave Switch. It’s form factor allows you to use 2 switches in a 2 switch metal mud ring. I hope to see future generation’s from the same company. Works with Alexa big hit for the family and multi protocol intragration.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond J Sidwell",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Range",
      "text": "I’ve got this thing in an area of my backyard where my iPhone X cuts out on WiFi and gets stuck because it won’t just switch to cell data. This thing still works flawlessly. I am very impressed with the range because I have a pretty large backyard. I use it to turn my pergola lights on and off. It gives me the flexibility of walking inside with the lights left on to guide me and turning them off from inside the house using my echo plus. This way I don’t have to hire and electrician to install a switch inside the house. The dimming function with Alexa works well too.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Aymami",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Nice and easy to operate smart dimmer",
      "text": "This dimmer is a perfect replacement for my Leviton regular dimmer. Same size, using the same plate. The only thing is this dimmer requires an extra neutral wire, but it's not a problem. I still use the lights I had, but now I could use either Alexa by voice or my phone to control the light. Perfect item! No separate App is required. I could use either Alexa App or Hue on my phone to control the light. I create a group by saying 'Alexa, good night.' So she will help me turn off the lights in my room and leave my night light on.",
      "rating": 5.0,
      "verified": true,
      "author": "YUKI",
      "helpful_votes": 2,
      "publication_date": 20180603
    },
    {
      "title": "Bought 3 one failed the other two are buggy",
      "text": "Bought these due to the price compared to the GE zigbee switches. Tried 3 as a test. My advice is don't do it. Within a week one had completely failed to function and I returned it to Amazon for refund. Now the other 2 are buggy. They lose connection to the hub and constantly need to be reset. Whether they will work or not at any given time is a crapshoot. Waiting for GE switches to go on sale again and will be dumping these POS.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas1963",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Great for a while but then junk",
      "text": "Loved it, was relatively easy to install and hook up to Alexa. Then it suddenly stopped working. Tried factory reset and even turning off power to it. It would do the flashing “pairing mode” deal but could never get Alexa to recognize it again. If you like things that only work for a couple of months this switch is for you. Otherwise, nope.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Great product, makes my dumb lights smart!",
      "text": "Great product and excellent support. Easy as installing a traditional dimmer to get up and running. Syncs with Philips HUE app allowing me to control my lights remotely via the app, accessories such as the HUE motion detector or HUE dimmer switch, and Amazon Alexa. They all work like a charm. My lights are on a schedule to come on and turn off during set times. Easy to control the brightness with voice, app, or accessory. This product should make traditional dimmers obsolete. Only knock, it only works with single-pole switches. Please add three-pole switches.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike McCleave",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Works as advertised, but questionable design",
      "text": "These switches do connect to the Hue Bridge as advertised. However, here are the negatives - When turning off, they \"dim off\", which is clunky - As another person on here mentioned, the dimmer is the biggest thing on the switch. I would argue the switch part should be more prominent. You can't turn this light on without looking at the dimmer to press the button - The button on the bottom feels cheap. It doesn't travel like a key on a keyboard, it's more of a hinged button Unfortunately, if you want a Hue Hub/Zigbee switch this seems to be the only option as of 12/12/2018",
      "rating": 3.0,
      "verified": true,
      "author": "Melanie DeFazio",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Don't buy",
      "text": "The switch broke after 3 months. First, the dimmer stopped working. It was at about 80% brightness. Second, it caused the bulbs to fail. 2 of the 4 bulbs attached to the switch broke over the course of two days. Third, the unit just stopped working. It was always on and there was no way to turn it off. Don't buy.",
      "rating": 1.0,
      "verified": true,
      "author": "David P. Pollak",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Best working switch I have found!!!",
      "text": "I have tried 3 different dimmer switches in my dining room. The first two worked okay but would often disconnect. It became a huge hassle. I found this switch and figured I'd give it one last try. I was able to wire it in less than 5 minutes. Its paired easily and quickly with my Echo Plus. It's been working flawlessly since it was installed. This is now my go to dimmer for the rest of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Unreliable",
      "text": "I was anxious to add this switch to my Hue setup, finally being able to automate my dual ceiling fan lights. However, I am VERY disappointed in the performance. The switch looses contact with my hub several times a day, usually when I really need it to function. It also randomly will turn my lights on when it pleases. I actually had to go to my breaker box and switch the circuit on and off to reset it once. My plan is to trash this crazy switch and buy the six VERY expensive smart bulbs for my fans. Too bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth L. Sockwell",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Easy to install. Quality feel.",
      "text": "This is my first Zigbee switch to try, but I have used many other home automation devices for a long time. Was interested in a dimmer that provides local control. Happy to see this is a well-built switch with a quality look & feel. Installed easily and works as designed.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Arrived used and dead.",
      "text": "Arrived used, add DOA. I have high hopes for this switch, but receiving my first one obviously used and dead was a let down. The slider had visual signs of wear, the sticker on the back looked old and the wires had been previously twisted up in a wire nut. I am patiently waiting for my next one, hopefully new....",
      "rating": 3.0,
      "verified": true,
      "author": "comatose1978",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Finally a Hue compatible dimmer",
      "text": "A dimmer that integrates seamlessly with Phillips Hue. It responds instantly when you use a hue dimmer or voice commands. The dimmer shows up as a dimming bulb in the hue app. It's dimming is smooth and there isn't any flicker. Like most smart devices you need a neutral wire in your box. This dimmer isn't compatible with a traditional 3way circuit, instead you would need to use a hue dimmer.",
      "rating": 5.0,
      "verified": true,
      "author": "Rev. Crispy",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Nerfed after Philips hue update",
      "text": "I bought 2 of these and was quite happy for a few months even though the sliding knob has a tendency to fall off if you're not careful, however about a month or so ago Philips Hue made an update and now both light switches are incredibly dim even at max brightness, unfortunately in the Philips hue app these switches that show up as lights are not updatable so now I am looking at spending even more money to buy a different solution.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "OK Switch, but it requires a neutral wire",
      "text": "This requires a neutral wire to work fully, but I got it to work without a neutral wire but without smart features, so I am somewhat satisfied. On a positive note, it allows you to move the physical level to change the dimmness, but there is a delay in the response. Unfortunately I'm not sure what advantage this switch offers over smart switches that don't require a neutral wire.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeffrey D Welch",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Great product",
      "text": "This is a very cost-effective product, I don't need to pay a lot of money and use energy to replace all of my lights to smart light. Quotra Smart Dimmer can easy achieve smart home automation. Easy installation and totally match my old plate cover. I can use voice control by Alex and Alexa app to control my traditional bulbs and LED downlight. \"Alexa, dim the bedroom to 30%\". It’s a very awesome feeling to have total control",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia ",
      "helpful_votes": 2,
      "publication_date": 20180721
    },
    {
      "title": "Keep turning on at random times.",
      "text": "Absolute garbage. Bought two of these and they both randomly turn on EVERY 10 MINUTES or less. No reason for this. I have literally moved into a new apartment since getting them and they do the same thing. I'm tech savvy and have an electrical ticket in Canada, I know I'm doing nothing wrong. Don't waste your time.",
      "rating": 1.0,
      "verified": true,
      "author": "Coltography",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Awesome",
      "text": "Only had it for a day, but IT IS AWESOME. Flawless integration with my hue hub and with Alexa. Would give it six stars as the only switch currently available that will work with the hue.",
      "rating": 5.0,
      "verified": true,
      "author": "\"jlm_3\"",
      "helpful_votes": 2,
      "publication_date": 20180727
    },
    {
      "title": "One out of three units worked.",
      "text": "As others have noted, initial quality control appears to be pretty abysmal. All three connected to Hue & turned on/off. Only one would dim - even a halogen bulb. It's unfortunate that these are the only in-wall \"dumb light\" dimmers for the US market that are directly controllable by a Hue hub, without a web service or secondary hub.",
      "rating": 2.0,
      "verified": true,
      "author": "JHD",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Best smart switch to pair with your Philips hue setup",
      "text": "This light switch works as it should, very nice feel and could not be happier with this purchase. Finally a cheaper way to have smart lighting without spending alot of money. Very fast shipping. Seller responded to my question in my option very fast and cleared up a question I had about the dimming part.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Nice Product, Good Price",
      "text": "The dimmer set up is easy and only takes a few mintues and It only took a few adjustments to match the lowest dimmable lighting level without any flicker. The slider design is awesome and it can remind your last dimming level setting when you press the on/off button, or turn directly by Alexa.",
      "rating": 4.0,
      "verified": true,
      "author": "Corey Maxim",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Excellent!",
      "text": "I am new to the smart home stuff and wanted to start simple with switches. I have the Echo Plus and found these switches that pair direct with the Echo without needing a separate hub. Hooking it up was very simple and only took a few minutes. Pairing with the Echo was quick and easy following the instructions that came with the switch. It works great!",
      "rating": 5.0,
      "verified": true,
      "author": "robeshs",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Starts failing after less than 2 months",
      "text": "Bought this dimmer/zigbee switch about 2 months ago. Has been working fine with a Hue bridge the first few weeks, but at some point stopped to send current setting back to bridge (i.e. when changing dimmer manually this would no longer be visible in the Hue app). Worked again after re-pairing but not for long. A few days ago the dimmer all of a sudden only provides less than 50% of original brightness when set to max, so it's basically useless at this point. I'm very disappointed with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "cd",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "High Quality and a Low reasonable price #Winning!",
      "text": "Wow, this product exceeded expectation! Works perfectly in the native Hue app. And I also run Home Assistant so I also have HomeKit support too. This Dimmer Switch won’t disappoint! The price is well below other “smart” switches on the market. I absolutely love it and I will be purchasing more of these in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Maxim",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "no homekit compatibility, LED lights flicker",
      "text": "I had no issue installing this and coupling it to my Philips Hue bridge. I can see the dimmer in the Hue app and control it accordingly. I like that it is controllable through the Philips smart app, however, while all my other Philips Hue/Bridge bulbs show up in my Apple HomeKit screen, this particular device does not. The other issue is that standard incandescent bulbs have no problem dimming from 100 down to 0, but standard LED bulbs flicker when the dimmer is reduced.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Lost Max Brightness",
      "text": "Was good for approximately 3 weeks, then max brightness level dropped considerably. Uninstalling the hue app(philips for sure would want to prevent this switch from working) and adjusting the course dimm pot had no effect. Very unfortunate because this seems to be the only switch in the market that can control a light fixture via Hue. It paired easily and worked well - until it didn't.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos C",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Doesn’t work with my hue hub or Alexa",
      "text": "Doesn’t work all the time. Seems I can turn my lights on with hue hum and hue switches but will not turn off. After my lights been on for a while it becomes unresponsive. I have tons of hue lights through out my house.",
      "rating": 1.0,
      "verified": true,
      "author": "Benny",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Missing Parts",
      "text": "Had to exchange my first one because it was missing the slide switch, seems like this company gets away with their QC issues because they are the only ones in the game right now. Disappointed but willing to give them another shot.",
      "rating": 1.0,
      "verified": true,
      "author": "jjlondon1",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Works with Phillips Hue Hub",
      "text": "Works with HUE app. Shows as a dimmable light. Dose something no one else does.. a wired switch that works with Phillips Hue Hub. Must use dimmable bulbs in fixture(analog dimmable, not smart) Buying more..",
      "rating": 5.0,
      "verified": true,
      "author": "Amy & Andrew",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Not great",
      "text": "Keep going unresponsive in the Alexa app. Really wanted to like these but will stick with GE going forward...it is hard finding zigbee switches as most seem to be wifi.",
      "rating": 2.0,
      "verified": true,
      "author": "robert patterson",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Good quality dimmer",
      "text": "Easy to install, looks like good build quality. Paired with my hue hub quickly without any issues. I use this to dim/control my kitchen lights and it works perfectly! Thinking about getting a few more to control some other bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Ferrara",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Not a bad dimmer for the price! Works great",
      "text": "Install and setup was not difficult. 4 stars due to the dimmer did not include wire nuts for install.",
      "rating": 4.0,
      "verified": true,
      "author": "Walter J. Rogers",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Didn't work",
      "text": "Ordered two, neither worked. For an official Philips hue light switch look up the Illumra Click",
      "rating": 1.0,
      "verified": true,
      "author": "matt taylor",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Get ready to save some cash.",
      "text": "This is a money saver, why spend a lot of cash on smart bulbs when you can use this dimmer. Easy to install and doesn’t break your bank. Works great in those hard to reach areas and beats the old fashioned push knob type of dimmer switch. I’m buying more of these to install at my parents house. Fast shipping and easy to set up. Works great with hue hub and Alexa.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric K.",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Works really well",
      "text": "It works really well. The only unit I found so far that allow to do a virtual 3-way with a real wired dimmer switch. Not compatible with Homekit, however works well in Hue app. Only complaint is the green ground wire that is attached at the worst place it could, become pinched between the dimmer plate and the in-wall metal box when tightening the screws...",
      "rating": 4.0,
      "verified": true,
      "author": "Carl Blouin",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Lasted a few months",
      "text": "I purchased this about 6 months ago, and now it only gets about 20% bright. it doesn't go all the way to 100%. So I figured I would make a warranty claim. Which seems impossible to find information for. Its not as easy as where your orders are and you find the order you placed, and right next to the product it says \"claim manufacturer warranty.\" That would've been too easy. So expect a life expectancy of <1 year.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Works exactly like you expect it to",
      "text": "This dimmer was as easy to install as any dimmer can be, and it works exactly like you want it to. I've only had it installed a few days, but the Alexa integration seems legit, and pairing was easy to do. The only annoying part for me was having to migrate all three switches in that plate to paddle switches so they would match.",
      "rating": 5.0,
      "verified": true,
      "author": "MZ Integration",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Doesn’t work with SmartThings alone.",
      "text": "So, the Echo Plus has a zigbee hub built in and this switch presumably works with it. I have a Samsung SmartThings hub that also has a zigbee network. SmartThings find it but doesn’t recognize it, and I can’t so far find the correct device type, so I’m stuck with a plain old wall dimmer.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry H",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Simply the best.",
      "text": "Simply the best. Connection was a breeze 1,2,3, and done! Has worked flawlessly from day one without a glitch. I will be ordering more. Full range no flicker LED lighting is soooooo nice. Perfect integration with Google Home and Alexa.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Ricci",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Works with HUE 90%",
      "text": "The HUE integration is exactly what I was looking for. As it it a 3rd party product it does not offer the same connectivity and functionality as the HUE platform. Software ware updates are not possible. works about 90% of the time with the HUE switches. (frustrating) It does however work 100% from the switch itself.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron M Hubbard",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Great dimmer for the price",
      "text": "I used this on my newly installed kitchen can lights cause they are LED and to bright at 100% I love that I can just tell Alexa to dim light when my hands are full cooking",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Love",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Poor range control",
      "text": "While the manufacture claims 0-100% lighting range, its really more like 0-70% and only half of the slider is used.",
      "rating": 2.0,
      "verified": true,
      "author": "David Simons",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Got my Quotra today and I'm very excited! It ...",
      "text": "Got my Quotra today and I'm very excited! It took no time at all to wire it up using wire nuts and connect it to Alexa. Now I can just say \"Alexa, dim living room light to 25%\" when I want to watch a movie and I don't even have to get out of my chair!",
      "rating": 5.0,
      "verified": true,
      "author": "Gisela B Pillay",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Works (mostly) as advertised",
      "text": "Light randomly turns on, we leave the dimmer down and that seems to stop the issue. I am sure it is either an issue with line noise or wireless noise.",
      "rating": 4.0,
      "verified": true,
      "author": "Roy Folkker",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Turns the lights on randomly.",
      "text": "The switch turns the lights on randomly. When that happens the switch cannot be controlled by the HUE hub or the Echo+. I have re-paired it several times and it only works a short time with the hub. I would like to try another switch if I still could get an exchange from Quotra.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Simply did not work",
      "text": "Lights flicker intensely with led. Won't turn of with incandesents",
      "rating": 1.0,
      "verified": true,
      "author": "John Ostwald",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Great switch- This switch is better than Hue's own solution",
      "text": "This switch provides a physical way to control Hue lights. While Hue's own switch solution does work they are not the same size as a traditional wall switch where this product is. The buit is physical dimmer is a nice touch. Check the rest of the companies HA offerings. The designer is very innovative.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Leeper",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Neutral wire is a must!!!",
      "text": "Must have a neutral wire to use with this switch, just like all smart switch out there. Fairly simple to pair to Phillips Hue hub and a breeze to install. What’s great about it’s, there is an on/off rectangle button at the bottom of the dimmer lever. Also work with Alexa to turn turn on/off or adjust the brightness.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Great product, great price",
      "text": "I had not heard of this brand before, but decided to take a chance on it. I was not disappointed! I was able to use this with both the hue and the smartthings hub. Both paired up without issue. I did have an issue with some LED bulbs from Ikea that didn't want to dim correctly, but the bulbs had the same issue on a different switch so it was not related to this product. Swapped out for some ge dimmable bulbs and everything worked as expected. If you are having bulbs flash, it's because of the bulb, not this switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron H.",
      "helpful_votes": 3,
      "publication_date": 20180725
    },
    {
      "title": "Great and simple solution to make dumb lights smart",
      "text": "Fairly easy installation (even for someone with no experience), and connected to my 2nd gen Hue hub on the first try. Smooth dimming with both the slider on the switch and through the Hue app/Amazon echo. One thing to keep in mind, this only works on single pole switches. If you have multiple switches that control a light, this will not work.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Van Fossen",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Works Great",
      "text": "Easy to install and setup. It took a little playing with the brightness adjustment on the side but worked great once I got it dialed in. For anyone wondering, this switch does require a neutral wire. Responds quickly to Alexa commands. No problems after the first week of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven E.",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Works well.",
      "text": "Paired easily. Works with my Hue Bridge, SmartThings, and Alexa. The physical slider can be confusing until you get used to it.",
      "rating": 5.0,
      "verified": true,
      "author": "B. L. Custer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Great dimmer for the price",
      "text": "This was my first ever attempt at installing a smart dimmer switch. It was simple to install. The directions walked me through the setup and pairing. It paired easily with my hue hub. Works great and great price!",
      "rating": 5.0,
      "verified": true,
      "author": "david krell",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Great",
      "text": "This is my first ever smart switch so I was nervous about the install and connecting it to my Echo Plus. It was suprising how simple it was to install. It connected right away without any issue. The directions made the process very simple and quick.",
      "rating": 5.0,
      "verified": true,
      "author": "nick hicks",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Great switch, so many options",
      "text": "Installed easily, neutral required. Connected to the hue hub with ease. Since my hue hub is connected to smartthings I was able to add it there also and have automations with door sensors.",
      "rating": 5.0,
      "verified": true,
      "author": "Butcher",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Great dimmer",
      "text": "Great price , fast shipping nice looking easy to use dimmer. setup was fast and easy via Phillips hue app. For the price and simplicity I recommend this dimmer .",
      "rating": 5.0,
      "verified": true,
      "author": "kevin t.",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Easy pairing, simple to use, and worked with my existing bulbs",
      "text": "This was very easy to install and get paired with hue hub. Works as advertised. I wish there was a paddle style of this switch. Would recommend and will purchase more for other rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "STAN SHAMBAUGH",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Great Dimmer !",
      "text": "Easy to understand instructions. I was able to install and pair with my EchoPLUS in under 10 minutes. Have used it for a few days and had no problems with it. would recommend as a cheap smart dimmer.",
      "rating": 5.0,
      "verified": true,
      "author": "jolyne f.",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "The smart dimmer is well working for hue hub and app ...",
      "text": "The smart dimmer is well working for hue hub and app and also amazing to compatible whit my Osram hub . Slider way to dimmer is good design to dim by my kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Works Perfectly!",
      "text": "This was a simple 4 wire install and my Echo Plus found it instantly. Everything works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "MAXFAU",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Alexa dim hallways 60%!",
      "text": "Very, very simple install. Just connect the four wires. Easily connected with my Echo Show Plus from Amazon. Dinner switch motion is very smooth. I was worried over the low price, but this far exceeds my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Five Stars",
      "text": "Excellent Product so far! Easy to install, convenient to use and works like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Magill",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Randomly turn on, poor connection",
      "text": "These switches will turn my lights on randomly at all hours of the night, and won't stay connected to my Hue hub. Avoid!",
      "rating": 1.0,
      "verified": true,
      "author": "Robert F",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Works as it should",
      "text": "A little bit of a lag, but works as it should",
      "rating": 3.0,
      "verified": true,
      "author": "Steven C.",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Highly recommend this product!!",
      "text": "Used in conjunction with Phillips dimmable bulbs, works like a charm! Installation was very simple and connecting to the Phillips hue bridge was a snap.",
      "rating": 5.0,
      "verified": true,
      "author": "Rean Taube",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Money saver",
      "text": "Money saver, also great when you need to control lights when hue lights is not an option",
      "rating": 5.0,
      "verified": true,
      "author": "Edgar",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "perfect",
      "text": "Work well with Echo plus and perfect match my exist Lutron plate cover.",
      "rating": 5.0,
      "verified": true,
      "author": "modeonlol",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Bad quality",
      "text": "Bad quality. Cheap material the dimmer switch fall off in the first day!",
      "rating": 1.0,
      "verified": true,
      "author": "H A",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Failed to do the job",
      "text": "My father in law is a master electrician, so he walked me through hooking this up. However when I hooked it up. The lights flickered on and off. We thought I wired it wrong so he came over to confirm. However, we had the same issue. We even tried this on another outlet in the house to see if it was just that outlet. Same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick Kagy",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "It's ok",
      "text": "It works ok. I use smart things hub and the switch stays offline all the time.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190212
    }
  ],
  "product_meta": {
    "title": "Quotra Wireless Smart Dimmer Zigbee Light Switch Dimmable For LED,CFL,Compatible with Alexa,Google Home,HUB REQUIRED:Hue,Echo Plus,Lightfy.Works with Philips Hue App-Better than most Wifi,Zwave Switch",
    "description": "Easily control any of your room light and adjust lighting brightness from anywhere. \n\nThis smart dimmer switch support both physical power On/Off and dimming or connect with existing home Alexa system to On/Off, dimming and set schedules and timers - HUB REQUIRED (directly connect with Echo plus, or Philips Hue hub required control by other Echo device or Philips Hue App). \n\nSimply replace standard in-wall dimmer switch with neutral wire required. \n\nHands-Free Voice Control Service: \n\nDirectly connect with Echo plus would offer you an unforgettable hands-Free voice control experience. \n\nYou can pre-set the scene and schedule the lights, ask Alexa/Google home to activate scene or adjust lighting brightness —“Alexa, turn living room to 30%” or “Google, start evening mode” \n\nWorks well with home lighting \n\nThis smart dimmer is worked well with any dimmable lighting fixtures, including LED, CFL, incandescent and halogen lighting fixtures. \n\nWorks with Philips Hue \n\nThe smart dimmer switch is compatible with Philips Hue hub and control by Hue App. The dimmer could be loaded into Hue to rename, group and control the lights on Philips Hue App. \nUnplug and Plug again for the hub if the firmware self-updated, otherwise, the dimmer may stop functioning. \n\nElectrical Requirements \n\nHard-wired connections - neutral wire required \n\nReplaces single pole switch \n\nWorks with Lutron or Leviton standard decora wall plate. \n\nSupports single pole exclusively, Simulate 3 way with Philips Hue Smart Dimmer Switch with Remote \n\nPhysical Demonstration \n\nUnlike most of the similar products, besides controlling by voice, this dimmer features a slider for increasing/decreasing the brightness of the lights. \n(ZigBee Smart Home dimmer & conventional dimmer in one piece with less money).",
    "rating": 3.3,
    "feature_bullets": [
      "The Zigbee wireless light switch for smart home supports controlling your existing light bulb and fixture (ONLY works with constant current type leading or trailing edge dimmable LED, Halogen and CLF up to 180W, Does Not work with SMART bulbs; PWM(Light Strip); 0-10V; DALI(Central Control); Constant Voltage(12/24V) or non-dimmable lights, e.g Hue Smart Bulbs and Sylvania). Replaces with regular Lutron Leviton GE dimmer switch; Please double check \"Neutral Wire\" before installed.",
      "The Smart dimmer light switch works with Alexa, Google Home, IFTTT and Simulate Wireless 3 way with Philips Hue Smart Dimmer Switch with Remote. ZIGBEE HUB REQUIRED, Compatible with most Zigbee hubs and their related iOS and Android Apps which include: Philips Hue,Osram Sylvania Lightify,Echo Plus (Please pair it within 20ft between dimmer and hub, Work up to 60ft after pairing). Not compatible with Wink, Smartthings, Bluetooth or Zwave hub.",
      "Compatible with most brand in wall decora light switch plate (Lutron, Leviton, GE, Wemo, TP Link and Insteon), the product does not include face plate",
      "NEUTRAL WIRE REQUIRED. Supports single pole exclusively, Extra physical slider for dimming & Power on/off in case your Zigbee hub does not work, More reliable than most of WiFi or Zwave Switches",
      "Set up Timing Function and pre-scene with IFTTT and Stringify via related Hub skills (HUB REQUIRED), utilize auto-turn on and shut off in closets, hallways and bathrooms etc; Simply pair and activate with your existing smart home system"
    ],
    "specifications": {
      "Manufacturer": "Jettwork Technology",
      "Part Number": "B07CVL9SZF",
      "Item Weight": "4.3 ounces",
      "Product Dimensions": "4.13 x 1.77 x 1.61 inches",
      "Is Discontinued By Manufacturer": "No",
      "Size": "Small",
      "Color": "White",
      "Maximum Power": "180 Watts",
      "Switch Type": "3-way",
      "Plug Profile": "Wall Mount",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B07CVL9SZF",
      "Customer Reviews": "3.3 out of 5 stars118 ratings3.3 out of 5 stars",
      "Best Sellers Rank": "#310,179 in Tools & Home Improvement",
      "Date First Available": "May 5, 2018"
    },
    "categories": [
      "Dimmer Switches",
      "Switches & Dimmers",
      "Wall Switches",
      "Tools & Home Improvement",
      "Electrical"
    ],
    "price": ""
  }
}