{
  "website_summaries": [
    {
      "verdict": "The RHA MA650 Wireless earphones deliver rich bass and bright, sculpted highs with a solid balance between the two.",
      "pros": [
        "Strong audio performance with rich bass depth and bright highs",
        "Solid mic clarity",
        "Water-resistant design",
        "Ships with generous array of eartips"
      ],
      "cons": [
        "Cable slack can get in the way",
        "Not the strongest design for exercise"
      ],
      "aspects": {},
      "publication_date": 20180301,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Balanced, transparent, \"audiophile\" sound {Watch out for RHA's warranty scam]",
      "text": "I also have the wired RHA MA750i and the MA650 wireless compares favorably to those. I bought these as my first bluetooth headset. I'd say the sound quality is a tad, and I mean just a tad, lesser than the MA750i wired, which I think are just about perfect in sound. In other words, the MA650 wireless sounds great. Update: Unit failed before a year was up, and RHA informed me that I was not covered by a their three year warranty even though it clearly states on my invoice that the unit is covered. RHA claims warranty does not apply to a new item bought from a third-party Amazon seller.",
      "rating": 1.0,
      "verified": true,
      "author": "ScreamingBobby",
      "helpful_votes": 19,
      "publication_date": 20181013
    },
    {
      "title": "I like them a lot!",
      "text": "Sound quality is great. The cable around the neck is very comfortable and I hate things around my neck- I forget I still have them on my neck. As I have small ears and small ear canals so the choice of earbud covers was perfect! No problem connecting via bluetooth to iphone. Wish it had auto turnoff after no music detected for a period of time but that’s the only thing I would like to see different.",
      "rating": 5.0,
      "verified": true,
      "author": "mollnet",
      "helpful_votes": 4,
      "publication_date": 20181003
    },
    {
      "title": "Best sounding earbuds for an extremely reasonable price.",
      "text": "I was looking for a new pair of earbuds to use while cycling. I needed a Bluetooth earbuds that had good sound but also had a great mic. Check... Check!!! The build quality feels high end. When I made calls while riding my unicycle, the listeners didn't hear any wind noise. These are by far the best sounding bluetooth ear buds that I have ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Goan",
      "helpful_votes": 11,
      "publication_date": 20171119
    },
    {
      "title": "They lasted less than four months, don’t waste your money",
      "text": "I had high hopes for these headphones, great look, seemingly quality manufacture, and best of all the battery life was a guaranteed 8+ hours. Here comes the “but”, the sound quality for music was tinny and virtually no bass, and most importantly, after less than four months the right speaker died and the battery began to short out, going from 100% to 20% in 10 minutes. I used them almost everyday, but no aggressive use ie, workouts, hiking, excessive sweating. Don’t waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Cooper or Patricia Williams",
      "helpful_votes": 3,
      "publication_date": 20190207
    },
    {
      "title": "Nice full sound.",
      "text": "Day 1. I will update this periodically. I am pleasantly surprised by these headphones. Sound is rich and clear. They sound better than my much more expensive Shure Special Edition 535s and do a better job blocking out ambient noise. I give it 4 stars because of the way the leads to the buds kinda flap around a bit next to your cheeks. But this is not a deal breaker for me. I have yet to go to the gym to test them out but very much hoping they work well in that environment and block out the very bad music played at my gym. Will give further updates in a week or two.",
      "rating": 4.0,
      "verified": true,
      "author": "Zachary Perryman",
      "helpful_votes": 3,
      "publication_date": 20180923
    },
    {
      "title": "Not for sports, great for office setting",
      "text": "I wear these when I go for walks or work from home, and they work great. The sound is very neutral and the bass is relatively clean on these. They are most definitely not for sports and the cable is a bit long for my liking. Other than that the battery life is good, great selection of earbud tips, and NFC pairing is a nice touch. Absolutely would buy from RHA again - the sound quality was as advertised for a sub $100 headset.",
      "rating": 4.0,
      "verified": true,
      "author": "F. D. Rizzo",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Well fitting ear buds, love them.",
      "text": "I am extremely happy with these ear buds. The sound quality is very good for me (mostly listen to audiobooks), the Bluetooth works well, the silicone neckpiece is very comfortable and best of all, they fit my ears. RAH has high quality silicone pieces, some with a double flange. I have a lot of trouble getting ones that fit and these stay in and cancel outside noise quite well. Unit recharges quickly and charge lasts. The earpieces connect magnetically if you take them out so you don't accidentally lose it since your hardly realize it's on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Getting 12.5 hrs of battery life. I'm impressed.",
      "text": "I've been using these for a week. And I have no issues with them. The sound is great. First time buying from this brand and I'm impressed. Will definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Asuncion",
      "helpful_votes": 4,
      "publication_date": 20181103
    },
    {
      "title": "Not designed for activities",
      "text": "Terrible design. Always in the way. The neck band gets in the way when you bench, the earbuds get clamped in the weights when you’re deadlifting if you happen to let one hang, and the neckband bounces annoyingly when you run, jog, jump rope or do anything. The earpieces press painfully into your ribs / solar plexus when you’re tucked against the gas tank if not wearing them while riding, but if you decide to wear them, the wires get snagged, and the earbud tips fall off when you take your helmet off. Do not buy these if you plan on doing anything.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Power button broke after 5 months...",
      "text": "So these headphones WERE great, sound great, fit great, etc. Only minor gripe I had was that you had to charge from a USB A to USB C cable, and I couldn't use my the built in one on my battery pack. Other than that they were sweet. Until one day the power button broke and now they won't turn on and are nothing more than a necklace. Really disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "April and Josh",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Good sound. Loose neckband makes it unsuitable for the gym.",
      "text": "The audio quality is very good but the style is not at all suited for the gym. The neck band is loose and flexible so anytime you do any exercise where you are not vertical, the neck band flops all over pulling the cords with it. I tried bench pressing with it and it was constantly slipping out. If you wish to use it for when you are standing, sitting or walking, go for it, but I won't recommend it for the gym or if you are listening to music in bed. Had ti go back to LG with stiffer neck bands.",
      "rating": 3.0,
      "verified": true,
      "author": "shezzy153",
      "helpful_votes": 10,
      "publication_date": 20180322
    },
    {
      "title": "So far so good",
      "text": "I lost my SE215's in a weird hardware breaking accident so I needed some new bluetooth headphones. I loved that my SE215's could move to a new cable if necessary, but the bud snapped in my accident so time for something new. I'm happy with my choice. They sounds great. Battery life is pretty good. The design keeps them nicely around my neck. The magnet on the buds is great and offers two good ways to wear them when you aren't listening to music. Almost nothing I'd change. Price was very reasonable for the quality of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Dorff",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Lag between sound and video o iphone",
      "text": "Previously purchased Klipsch wireless as a present for syncing with an iPhone X. There was sound lagging video when used that could not be resolved with trouble shooting. So we tried this brand and continued to experience tha lag problems that also could not be resolved. The problem may be Bluetooth version on headphones although this model seems fairly up to date, or it just does not perform well with the iPhone model. The user's friend has n RHA used with a Samsung phone and he has not had issues.",
      "rating": 2.0,
      "verified": true,
      "author": "jag",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "High Quality",
      "text": "Everything about these headphones impressed me. Before I even used them, the packing itself was very nice , easy to open and gave the impression of a high quality product. The aesthetics, materials, battery life and build quality are all great. These are probably the best you can get in the $100 range. Even if there were headphones in the same price range with slightly better sound quality i'd still choose these for the aesthetics, durability and materials. They look, feel and sound great.",
      "rating": 5.0,
      "verified": true,
      "author": "Starmes",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Forget the Warranty",
      "text": "RHA MA650 Wireless Earbuds: Sweat-Proof Bluetooth in-Ear Headphones with 12hr Battery, 3 Year Warranty Included I have purchased three of these headphone sets and when the battery failed in one set I attempted to seek a warranty resolution. The set was purchased in December 2017 and as stated right on their page they carry a three year warranty. However when you contact them they will tell you the company has sold and will not stand behind their product. WRONG ANSWER. Worst customer service ever... Nice headphones but if they fail you are on your own. I will be replacing them with another brand since the manufacturer does not stand behind its product.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Bought a pair for my son too",
      "text": "I really like these. I have gone through two other brands pretty quickly. These retain a charge for a long time (in my opinion), the sound quality is great and they are comfortable in my ears and around my neck. There are also well constructed so I am not the least bit concerned that the wires will crack or twist. I also bought a pair for my son and he lives the...",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Hanks",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Sounds great and of good quality",
      "text": "Forget all the junky no-name brand headphones out there, and their numerous shilled and fake reviews, and actually get a quality product made by a real company with standards. These sound great and are comfortable. They also connect well. Worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Good sound, low battery life",
      "text": "These headphones have good sound quality but the advertised 12 hour battery life is actually less than 8. This is with the volume turned down to its lowest level. If you are buying these for the long battery life, look else where. I am subtracting one star on this review for deceptive advertising.",
      "rating": 2.0,
      "verified": true,
      "author": "Equinator",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Follow Up Review",
      "text": "I submitted a previous review discussing the prompt and courteous service I received from MA. After 3 months of operation the replacement set that MA supplied (for free with no shipping charges) are operating flawlessly, the sound quality is great and battery life is +8 hours. If you're willing to spend a bit more money, you can't go wrong with these. Great !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Taco 265-3",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great Value",
      "text": "I listen to audiobooks and podcasts while I work out in the gym. These dandy Bluetooth earphones stay put comfortably in my ears and deliver excellent, clear, crisp sound. The noise canceling feature minimizes the ever present and unending gym soundtrack so that I can easily concentrate on my story. The wiring loops behind the neck and is unobstrusive...you forget it’s there. But my absolute favorite feature is the long battery life. I’ve been using them about 6 weeks and only have charged them once. Another favorite thing is that whenever you turn them on, you’re told the battery level. I would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ansel Adams",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "They work pretty good. I’m happy with them so far.",
      "text": "So far so good. Holds a charge well. Sound is good. Noise cancellation could be better. Comes with a lot of ear plugs. I’m going to experiment for a better fit and maybe better noise cancellation. That being said it cancels enough I can use them at the gym and drown out their music.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Miles",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Dope battery life, but the buttons are weak",
      "text": "Got these mostly for the good battery life for the price. Theyeasily last a full 9-5 workday and then some, which is just what I needed. Sadly, the center button broke after less year, making it impossible to pause, skip tracks, or take calls. Might want to look into something sturdier if you skip a lot of tracks.",
      "rating": 3.0,
      "verified": true,
      "author": "A Human Reviewer",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Amazing quality",
      "text": "The quality in this item and the box contents was unexpected! It's quite impressive. The music is rich and sounds great. It comes it so many ear phone options. Just excellent quality and options.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Good value at $80 price point.",
      "text": "Great little earbuds. I needed something to replace my old LG's that had finally given out. I use them at work to stream music & podcasts. Very well made. I find that they are well balanced right out of the box, so I don't need any EQ apps. Great battery life. One criticism would be the stiff action of the buttons on the in-line remote, but certainly not a deal breaker. Very happy with this purchase. 👍",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Great Product.",
      "text": "Bought these because of a review in the mag Wired. Headphones are great. Easy to connect to my iPhone. Hold a charge well. Wish I could use a standard lightning cable to charge them but the bag that’s included keeps everything together. The only downside is that with some applications (twitter,YouTube) sometimes there is a noticeable delay in what’s on screen/what you hear. Don’t know if this is a headphone issue or Bluetooth as these are the first pair I’ve owned. Overall, really like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jdodge",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Wiring to Earpiece is not robust",
      "text": "FIrst off, this is a magnificent sounding headphone and they are my daily user. I cannot get these to last for more than 6 months. I have had 3 of these (left one on airplane and have had purchased 2 others). The wiring pulls out of the ear-piece. I am going to see if I can get warranty coverage. I hope the next design version is more robust.",
      "rating": 3.0,
      "verified": true,
      "author": "Anil Paryani",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Dissappointed",
      "text": "These sounded great and I really liked using them, but the charging port failed in just a few months. I am pretty clever with gear but I could not get it corrected. They are useless now.",
      "rating": 1.0,
      "verified": true,
      "author": "mnew0322",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Really like these earbuds",
      "text": "Got these for my son to replace a broken pair of Beats X. Far superior to the beats with balanced sound (no artificial bass boost), great battery life and beautiful build quality. Although they're not noise cancelling they do a good job isolating outside noise",
      "rating": 4.0,
      "verified": true,
      "author": "LaxLover",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Awesome neckband wireless headphones",
      "text": "the usbc charging is a huge plus for me, nfc pairing was super cool, fit good out of the box for me, comfortable and seems like the cord length is good for range of motion. Sounds great phone calls good too. Minor points deducted for the in line remote is a little weird finding the buttons",
      "rating": 5.0,
      "verified": true,
      "author": "J. WINGATE",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Good while it lasted",
      "text": "Used mainly for calls in a business setting and while driving. Sound quality is fine for that. Long cables are good to keep the headset in place, are a little have and make for cumbersome handling. 4 stars for design, sound quality and usability. Stopped working after about 1.5 years. I bought another brand to replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "AMS - San Diego",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "To those who are saying they don't honor the warranty...",
      "text": "Had these for 6 months and I started having a problem with the microphone and I contacted RHA and they took care of the problem IMMEDIATELY without a hassle. I've owned 2 previous wireless earbuds from other manufacturers including the Jaybird X4 and these sound way better, especially with Comply tips.",
      "rating": 5.0,
      "verified": true,
      "author": "MrMojoRisin",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Lower quality but higher price",
      "text": "Costs more than 390, but lower quality. Disconnects from phone for no reason. Makes people on the phone sound like robots. I almost threw it away about a week ago, but charged it overnight and it began working again at a less than low quality. When the battery reaches 40% it will make you and everyone you speak to sound like auto tune",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Lasted less than 1 year",
      "text": "I purchased this product less than 1 year ago and it has stopped working. I contacted Amazon support and they would not honor the 3 year warranty. They told me that they sent a email to the manufacture however, they have not contacted me. I next checked RHA's website and could not find an email or phone number for the company. Only an address in Glosgow. I would not recommend this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Excellent material & comfort but the experience could’ve been better.",
      "text": "The sound quality is average to be honest. But I mainly bought it for convenience. The battery will drain fast and now that it has started to connect and disconnect automatically frequently, I have no option but to return it since I can’t bear with my songs pausing and playing every 5 seconds when the battery is below 50%.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Insane Battery life!",
      "text": "The sound quality is good, but nothing to write home about. But the battery life is INSANE. It lasted me my whole 10 hour road trip with battery to spare! Plus it charges in under an hour via USB C, which is almost impossible to find. Build quality is great, however the metal gets a lot of small scratches in it. It’s super light and doesn’t fall out. RHA support is also fast and convenient. Overall great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Rohan Singh",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Buttons are small.  Doesn't announce who is calling?  Or I haven't found it yet.",
      "text": "Love the battery life and sound quality is fine for me. love the magnetic ear buds to stay around my neck. Im temporarily handicapped so this is great for me to have phone nearby and not have to cary it with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa M. Flury",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Not too bad.",
      "text": "The sound pretty good. However they lack Bass. Battery last very long approximately 4 hours maybe six.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher G.",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Buy something else instead.",
      "text": "The sound on these RHA MA650 is horrible, I never came across any other earbuds with that low sound quality, very disappointed, had to send them back. However the design and quality of the materials were very decent.",
      "rating": 2.0,
      "verified": true,
      "author": "TML",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Very nice",
      "text": "After using for a couple of weeks I am very happy with the RHA M650. Good sound quality. People on phone calls can't tell I am using a headset and it easily lasts all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "James B.",
      "helpful_votes": 2,
      "publication_date": 20180824
    },
    {
      "title": "Good Product",
      "text": "Took a while to get used to due to the long earbud cords but they are awesome for talking on the phone they eliminate most of outside noise.",
      "rating": 4.0,
      "verified": true,
      "author": "lefter kamberi",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Sounds ok, but does not fit correctly.",
      "text": "Headphones sounded ok, but the earbud pieces did not fit ears well. Even with the different rubber ear pieces it still does not fit correctly. The mic, volume buttons are on the wire that goes to one of the ear buds, and it puts extra pull on it. Couple that with the design of the buds and it just keeps on falling out. Maybe it fits well with some people, but not for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Pao Xiong",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Will stick with Hussar",
      "text": "I ordered 2 sets. One set would not keep a charge and the other one I could only hear out of one bud....terrible",
      "rating": 1.0,
      "verified": true,
      "author": "Gramma",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "USB C to USB C charging does not work",
      "text": "Wished that I could charge them with a USB c to USB c connection so I only have to carry one chrager for my Pixel 2 and these headphones. Seems to be a software issue? Can charge them with the included cable but don't like carrying around 2 chragers",
      "rating": 4.0,
      "verified": true,
      "author": "N. Collazo",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Love!",
      "text": "I love these, they are very comfortable, lightweight, and the sound impressive. For the price, very happy",
      "rating": 4.0,
      "verified": true,
      "author": "beadingchef",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Pretty good, could be better",
      "text": "Really really wish there was a way to keep them from just having down when not in use",
      "rating": 4.0,
      "verified": true,
      "author": "Themachinist",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Remote button dead",
      "text": "Worked very well for 2 years of very careful use, but now the remote control button for picking up calls stopped working suddenly.",
      "rating": 3.0,
      "verified": true,
      "author": "Roman",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great product very happy with purchase.",
      "text": "These are great buds. Battery last all day and charge quickly. Assortment of tips makes fitting easy. And the are very comfortable. Sound is very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean R",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "This product is garbage.",
      "text": "I used them twice, after that they wouldn't connect to my device. Tried to get either a new pair, some explanation, or my money back. Instead, I got a merry-go-around of same condescending questions that made me feel like a three-year old that can't read a manual. STAY AWAY FROM THIS GARBAGE!!!",
      "rating": 1.0,
      "verified": true,
      "author": "ZMan",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Good sound. Amazing battery life.",
      "text": "I use these at night to block our sound while I sleep. They work great and have very impressive battery life. Only issue I have is they do move around easily and they cord is a bit longer than necessary.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Best ever",
      "text": "I bought one in the airport...loved it so much I got another for my wife. Long lasting charge, great sound and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 2,
      "publication_date": 20180803
    },
    {
      "title": "All round decent earbuds",
      "text": "Good battery life. Reasonably comfortable. For wireless earbuds the sound is quite ok. The sound isolation is surprisingly good with default tips",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170928
    },
    {
      "title": "Great lightweight bluetooth headphones.",
      "text": "Generally I’m happy with this purchase. The headphones don’t have active noise cancellation, and rely on a good fit between your ear and the headphone. Sound quality is great and battery life is as expected - good for a typical work day but it would be nice to be a little longer. I often use them for conference calls and the sound quality and connection is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Great Sound.",
      "text": "That it can be hooked up to the phone and the tablet at the same time",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Venson",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Quit working after very little use",
      "text": "Won't turn on after only 3 months. Charges until the light turns white- but won't turn on. 100 bucks for this?",
      "rating": 1.0,
      "verified": true,
      "author": "K. D. Tyson",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Good sound for mid priced product",
      "text": "Nice quality sound Comfortable fit. Stays in your ears while exercising. Comes with replacement bud covers",
      "rating": 4.0,
      "verified": true,
      "author": "SCOTT STRAUB",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "and ease of use are fantastic however the Bluetooth range has not been the best ...",
      "text": "The sound quality, feel, and ease of use are fantastic however the Bluetooth range has not been the best for me. I can still hear in great quality until I am about 8 ft from my computer. Not a huge inconvenience, but something to be aware of.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Versatile!",
      "text": "These things rock!! have never heard of them before but when i searched top headphones, these caught my attention first, the style, the sweat protection, battery life (which by the way, I have heard is sometimes longer). and even the price, i found them on sale for $75 on amazon. these are awesome for any music genre. just dive in. it will be worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "J.",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Great for commuters.",
      "text": "Great for watching videos on long train commute everyday. Easy to store. Wires leading from neckband to ears may be a bit to long and unruly but not a big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Do not buy",
      "text": "They worked good for about a month but after that the volume button stopped working, bluetooth doesn't connect all the time. I reached to amazon and they were unable to help me I would not recommend this product .",
      "rating": 1.0,
      "verified": true,
      "author": "jesus",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Quality bluetooth headphones",
      "text": "Convenient and comfortable for audio books and music or other bluetooth sound sources. Simple controls. \"C\" connector for charging is convenient. Charging is quick and will last most of day.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "awesome",
      "text": "these are just awesome. i use them for most of my day. the battery life andsound quality are some of the best i have tried .",
      "rating": 5.0,
      "verified": true,
      "author": "tree",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "They're great but the battery life could be better.",
      "text": "The battery life on this headset seems to be a little short but other than that they work great! I use them with my computer, mainly to watch shows.",
      "rating": 5.0,
      "verified": true,
      "author": "Leesa M. Hayes",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Short Life",
      "text": "It started off strong and gradually the audio got lower and finally went dead. Low quality for the price. The high ratings I saw before I purchased it were misleading.",
      "rating": 2.0,
      "verified": true,
      "author": "Doris",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Best headphones ever!",
      "text": "These headphones are great. Great sound, easy controls, awesome battery life quick and easy charge. Worth every cent after going through a new wireless pair every couple of months.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Grehan",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Love these wireless earbuds!",
      "text": "I purchased five sets of these earbuds for Christmas gifts! The people I gave them to loved them so much ... I had to purchase them for myself also. Enjoying them!",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Gupton",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "These are painful!!",
      "text": "These headphones are just ok, not great. For the price, there are several other headphones that have better sound. The biggest problem I have with these is the pain they cause in my ears. They have a large diameter metal barrel and the ear tips are very uncomfortable. After a short time of listening, they begin to hurt and the longer you use them, the more they hurt. I tried the different ear tips but to no avail. The earpieces are made of metal and the weight of them also ads to the discomfort. I expect a better sound quality and a more comfortable headphone for my money.",
      "rating": 1.0,
      "verified": true,
      "author": "R. H. Jackson",
      "helpful_votes": 7,
      "publication_date": 20180218
    },
    {
      "title": "Perfect Quality",
      "text": "These earbuds are the best! The sound quality is amazing and the noise canceling technology is tops. I think these are the best wireless earbuds I've found at this price point. Highly Reccomend",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Hilton",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Headphones failed to power up",
      "text": "Had these for 8 months and then they failed. Would not power off on my last use and then tried to power up a day later and they were unresponsive. Complete loss at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Will charge with a Wall/USB-C 15W Fast Charger",
      "text": "These charge with my Wall/USB-C 15W Fast Charger from my Moto Z Play Droid so that was great to discover. These were a gift and I don't know bt earbuds well enough to give it 5*",
      "rating": 4.0,
      "verified": true,
      "author": "JASON WACHSMUTH",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great sound!",
      "text": "Great sound but after a short time the battery does not last for the 12 hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Lou ",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "great sound",
      "text": "Finally a wireless headset that gives me everything that I needed. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Noise isolation could be a little better. But over all nice headphones for price",
      "text": "Battery really last 12 hours and music is clear. When taking phone calls if windy sometimes makes wierd noises. Noise isolation could be a little better. But over all nice headphones for price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Helming",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Great Noise Cancellation, Great Sound",
      "text": "Great headphones. Slight problem with running is when running, the mass of the headphones tend to pull the ear buds out. Other than that, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "VERY GOOD VALUE",
      "text": "I was able to take these out of the box, plug into my computer without any challenges. They are clear, lightweight. I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy P.",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Stopped working after a Month",
      "text": "Delivery date is 11th of March, it stopped working on 14th April. It is too costly for a month use.",
      "rating": 1.0,
      "verified": true,
      "author": "taqui",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "just perfect , i love the magnet to keep it together :)",
      "text": "it's better than other expensive earphones like Bits and the battery life is amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Leonel",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Four Stars",
      "text": "One of the best sounding bluetooth earplugs for its price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Piece of trash",
      "text": "Want able to even rate these as the cord between the neck band and earphone broke taking it out of package",
      "rating": 1.0,
      "verified": true,
      "author": "John W.",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Would not leave Home without my RHA BLUETOOTH EAR PLUGS",
      "text": "Had originally purchased RHA Headphones designed as direct plugins into my iPhone with amazing results regarding “fit and sound resolution”. I was thoroughly satisfied and would not consider any other brand to utilize with my device, my personal listening pleasure or my hearing and the long term health of my ears. AND so when it came time to step up the available technology to “Bluetooth” there was absolutely no question and or hesitation as to what “BRAND” I would be considering to purchase to satisfy my needs. After receiving my pair of RHA Bluetooth Ear Plugs and after continuous everyday use I have to certify that I continue to be a dedicated fan and believer of this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Quon San WONG",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Great earbuds",
      "text": "Great set of headphones. Battery life’s great and charges quickly. Range is surprisingly far as well",
      "rating": 5.0,
      "verified": true,
      "author": "Josh K.",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "On off button always breaks.",
      "text": "Don’t buy unless u are ok with the on/off button breaking. Had 2 of these and both broke for no reason after about a year.",
      "rating": 1.0,
      "verified": true,
      "author": "J Hoelzer",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Crackling Audio",
      "text": "The audio quality isn't that good and it crackles occasionally. Wish I had kept looking, but this came so highly rated.",
      "rating": 2.0,
      "verified": true,
      "author": "Kathleen Ackerman",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Ok for under $100 don't last. Buy a $35 pair instead.",
      "text": "Great earbuds. First day of use and I'm impressed. But 8 months later static in left ear and warranty is basically useless",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "To my surprise they are fantastic. i would recommend these to anyone",
      "text": "At first I thought they were just another pair of bluetooth phone. To my surprise they are fantastic. i would recommend these to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharp",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Not durable",
      "text": "Lightly used headphones and they didn’t last the year. Not very robust.",
      "rating": 2.0,
      "verified": true,
      "author": "Barthy70",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great earbuds.",
      "text": "Well made. Great sound quality for their size. Crazy long battery life. I would happily buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Aj Sliger",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Good but not Great",
      "text": "Good sound, but not loud enough for me. Think about it, you can always turn something down.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Martinez",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Solid purchase for the price.",
      "text": "So far a great pair of earbuds. Good sound, great battery life, comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Battermann",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Amazing product",
      "text": "Purchased these for my husband he absolutely loves them. Great quality and sound",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie Pintos",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Five Stars",
      "text": "Loved the magnet closure and how long it stays charged.",
      "rating": 5.0,
      "verified": true,
      "author": "jon lioce",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "And I have to disconnect it and reconnect it don't know if it's just a fluke but that is just experience that I'm having the sound quality is good it could use a little bit more Bass the ...",
      "text": "I purchase this Bluetooth headset April 13th and it is June 15 and it is currently cutting out so as I am speaking in the microphone or something cuts out so whoever I'm speaking to cannot hear me . And I have to disconnect it and reconnect it don't know if it's just a fluke but that is just experience that I'm having the sound quality is good it could use a little bit more Bass the microphone on a windy day is bad wish it had wind protection I bought this headset just to make phone calls and sometimes listen to music and it has disappointed me in those two aspects",
      "rating": 1.0,
      "verified": true,
      "author": "Gilbert",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Despite having a USB c port, charging will only ...",
      "text": "Despite having a USB c port, charging will only happen is you use a USB a to USB C cable along with you on your travels. USB c to USB C cable doesnt work for charging! How hard was it to implement that ?",
      "rating": 1.0,
      "verified": true,
      "author": "swapnil",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "I would stick with a brand that doesn't require specialty cables.",
      "text": "If I had known this used a proprietary cable and not just a standard mini usb I would NOT have purchased. I have to buy a specialty cable for it?? Waaaay too niche of a device to be worrying about buying specialty cables. VERY annoying. Also SHIPPING WAS VERY SLOW. Took forever to arrive",
      "rating": 1.0,
      "verified": true,
      "author": "Edward Goldberg",
      "helpful_votes": 3,
      "publication_date": 20171126
    },
    {
      "title": "Great wireless headphones",
      "text": "This is my first pair of bluetooth headphones, and I'm very happy with my purchase. the headphones are well constructed, provide excellent sound quality, are comfortable and the foam tips are decent for noise cancelling. I'm able to use these all-day for work calls, and then to listen to music while working out in the evening. The drawstring bag is convenient for storing the charging cord, the headphones and extra tips. I highly recommend these to anyone looking for good quality wireless headphones with strong battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "Iliafer",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Just Average",
      "text": "After a lot of research I chose the RHA MA650 ear buds because I was looking for a wireless solution without a huge cost. Just as the old proverb says, you get what you pay for. It’s not they are bad in any way, they are just not as advertised.. I really liked the form and style but the sound is lacking. It’s missing depth in sound quality. Not much bass. And because they are not low latency, YouTube audio is not in sync with the video. I will keep searching. Until then I’m going back to my $10 wired buds which sound much better.",
      "rating": 3.0,
      "verified": true,
      "author": "Tenbay",
      "helpful_votes": 0,
      "publication_date": 20190317
    }
  ],
  "product_meta": {
    "title": "RHA MA650 Wireless Earbuds: Sweat-Proof Bluetooth in-Ear Headphones with 12hr Battery, 3 Year Warranty Included",
    "description": "Color:Black\n\nThe MA650 Wireless is a premium wireless headphone with 12 hour battery life, Aluminium build and a SecureFlex silicone neckband providing exceptional comfort & durability. Unlike rigid neckbands the SecureFlex neckband can rest easily on the base of your neck or concealed underneath a shirt collar and thanks to it's contoured flexibility it can also be curled up for easy storage without losing it's natural shape over time. Included Comply foam ear tips provide military-grade noise isolation by reducing twice the amount of background noise as regular ear tips.\n\nThe MA650 Wireless is covered by RHA's industry leading 3 year warranty and backed by our 5 star customer service team. Please be advised that RHA's manufacturer warranty is only valid on purchases from authorised retailers, including Amazon & RHA directly.\n\nKey Features\n\n\n3 Year RHA manufacturers warranty included when purchased from RHA or Amazon directly 12 hour battery life (12hr audio playback; 30 days standby) Sweat-proof & water resistant IPX4 suitable for gym or outdoor activity Universal 3 button remote with microphone for full device & volume control of Apple, Android and more AptX & AAC enhanced Bluetooth audio for CD-like quality\n\nWhat's in the Box?\n\n\n1x MA650 Wireless headphones 1x USB-A to C charging cable 6x Silicone Dual Density Ear Tips (S/M/L) 2x Silicone Double Flange Ear Tips (S/L) 1x Comply™ Foam ear tips (M) 1x Cable Clip 1x Mesh Carry Case 1x MA650 Wireless User Guide",
    "rating": 4,
    "feature_bullets": [
      "Frequency response - 16 – 22,000Hz"
    ],
    "specifications": {
      "Product Dimensions": "0.59 x 0.71 x 36.61 inches",
      "Item Weight": "1.16 ounces",
      "ASIN": "B074QKGG72",
      "Item model number": "601033",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.0 out of 5 stars681 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#4,952 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 11, 2017",
      "Manufacturer": "RHA TECHNOLOGIES LTD"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 99.95
  }
}