{
  "website_summaries": [
    {
      "verdict": "If you've got a large collection of Nintendo Switch games, this case will hold them in style.",
      "pros": [
        "Games are easy to insert and remove",
        "Fits 30 games and 5 SD cards securely with padded foam while still managing to fit in a regular bookbag"
      ],
      "cons": [
        "Some users wish that they doubled the storage size by putting slots on both sides of the case",
        "There's certainly room for it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good for owning a lot of games. Bad for portability.",
      "text": "Didn't look at the dimensions before I bought this, so that's my fault, but it's the size of a large book. I was also hoping that the cover would be removable like most video game cases, but it's a plastic cover with print on it. Does not come off. It's good for owning a lot of Switch games, but i don't see why 3ds cases can fit like 20 games in them and are still the size of a 3ds game case but Switch cartridge cases with similar capacity are 3 times larger than a Switch game case unless you get a travel case. Anywho, TL:DR big case, large capacity, not exactly portable.",
      "rating": 3.0,
      "verified": true,
      "author": "Invisable Ewok",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "I'm inlove with this case!",
      "text": "The only complaint I have is the sd card slots. i bought a 128 card when the switch launched and, being a physical game collector, i still haven't used half of it. the 10 additional sd card slots in this case are just wasted :( id rather just have more switch cartridge spaces to make it carry 60 instead. but even with that inconvenience, i still rate it 10/10 cause of how perfect it is for someone like me. i love cases like this and it fits so well in my purse and its super easy to carry around ^^",
      "rating": 5.0,
      "verified": true,
      "author": "Leanne",
      "helpful_votes": 2,
      "publication_date": 20181002
    },
    {
      "title": "Games fit perfectly in this case, Extremely happy!!",
      "text": "UniKeep, This is a great product Im really happy with this purchase. I like the retro style art on the case and the quality of the plastic. Here's a pictured that I shared on twitter with my friends and game collectors. Prio to purchasing this beautiful Nintendo Switch cartridge holder I was using HORI cartridge/game holder, but I didnt like that you litteraly had to fight to snap them off and to secure them safely.",
      "rating": 5.0,
      "verified": true,
      "author": "ERIK GARCIA",
      "helpful_votes": 2,
      "publication_date": 20180614
    },
    {
      "title": "Amusingly large",
      "text": "This case really caught me off guard. Despite all of the photo evidence for some reason I was expecting something around the size of a DVD case so I was understandably confused when I received huge envelope that felt like it had a notebook in it. The latch on the outside seems a little flimsy but regardless the games go in and out easily enough and we'll see how the foam wares",
      "rating": 5.0,
      "verified": true,
      "author": "Daminite",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "nice but....",
      "text": "can hold a lot of games but will scratch the back of your game cartridges, needs more foam and art feels cheap and sticky.",
      "rating": 1.0,
      "verified": true,
      "author": "MiKeCooL",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Looks solid",
      "text": "Awesome case. Secure hold. Decent sized (not like a DVD box but like the size of a magazine) plenty of rooms for all those expensive games :(",
      "rating": 5.0,
      "verified": true,
      "author": "Abel M",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Great case",
      "text": "Double locks closed, games slide in and out very easy - but secure enough they aren't going to fall out. Foam type insert holds them just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike R.",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "So nice I got it twice!",
      "text": "Much larger than I had thought they’d be, but they do the trick and they are quite nice to look at. They are a little fragile on the spines because of the kind of plastic they used, but I’m very happy with them.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Very satisfied!!!",
      "text": "Very satisfied with product. Looks like the pictures. Seals and closes smoothly. Great price and very decent quality. I noticed that if the “locking” clasp breaks on the outside of the box, the box will still stay closed from the internal closing seem. Only time will tell if it can hold up for kids though. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great Case",
      "text": "Great way to keep up with all the switch games in one place. Keep in mind that this case is HUGE since it holds 28 games. It is kind of annoying but it works for me. Great cover art and it does its job. I do think its a little pricey but worth it if you are a collector.",
      "rating": 4.0,
      "verified": true,
      "author": "Ram R.",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Must have !",
      "text": "Pretty big case now my son is asking to fill it up like does games weren’t expensive !",
      "rating": 5.0,
      "verified": true,
      "author": "Duderonommy",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Good buy!",
      "text": "We were tired of our son dropping all the games on the floor when he tried to get a new one out. This case is perfect and holds them tightly in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Laellaaa_",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Solid built",
      "text": "Solid materials. Easy to put in and remove the games without damaging the games or the dense foam in the holder.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great case.",
      "text": "I bought this case in October and quickly upgraded to the 60 cart one. They are super stylish and I don’t have to have so many of those smaller cart cases lying around. Would make a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "kennie_xo",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Best Switch Case to store more games on the go.",
      "text": "The case was great. It's bigger than a Switch case box. This holds all your favorite Switch game cartridges and also you can store micro SD card inside the big case as well. Everything you have can take on the go. I Recommend it. In case you don't have any more room. Buy it. It's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Emmanuel Ramirez",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Good quality",
      "text": "Seems to be good quality . Is a Christmas gift for my granddaughter",
      "rating": 5.0,
      "verified": true,
      "author": "stacey",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Review",
      "text": "I been looking for a game case for a while since i like taking my games where i go. Ordered this and its a great pick and is big too. The quality of the item is good too.",
      "rating": 5.0,
      "verified": true,
      "author": "LordLegendary003",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Works great!",
      "text": "Using it to hold switch games, works well and saves space!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Mouch",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great Case",
      "text": "Games slip snug inside and there's no difficulty taking them out.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Set",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "This thing is too big.",
      "text": "This thing is huge. I expected something the size of a normal game case, but this is like twice the size of that.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great Fit",
      "text": "The case is not to big not to small about the size of a notebook. it hold the Nintendo Switch games securely in place. Best part it that its foam so no hard plastic to snap in and out with fear of breaking the gamecards. Would total recommend to anyone who wants to keep their games safe and organized",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Etling",
      "helpful_votes": 0,
      "publication_date": 20201121
    },
    {
      "title": "Holds a ton of games and the cover art is cool",
      "text": "It does what it says. Only complaint is that I think the giant header of \"Video Game Collection\" is a bit dorky.",
      "rating": 5.0,
      "verified": false,
      "author": "Jordan Todd",
      "helpful_votes": 0,
      "publication_date": 20181122
    }
  ],
  "product_meta": {
    "title": "Game Case for Nintendo Switch Cartridges - Holds 30 Games Securely in Foam",
    "description": "The UniKeep Switch Cartridge Game Case is perfect for your Nintendo Switch game collection. The attractive, digitally printed design sets this game case apart from the rest. Small enough to fit in a bag or easily fit in a tight space on a shelf. The protective case has enough space for 30 game cartridges. High-quality foam safely and securely holds game cartridges in place. Fully enclosed and snap locking ensures the games are secure in any situation.",
    "rating": 4.6,
    "feature_bullets": [
      "Securely and safely holds game cartridges in foam",
      "Holds up to 30 games (games not included with case)",
      "Fits easily on a shelf or in a bag",
      "Snap locking and fully enclosed, games won’t fall out",
      "Small enough to take with you anywhere"
    ],
    "specifications": {
      "ASIN": "B07C2NVQW6",
      "Customer Reviews": "4.6 out of 5 stars52 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#35,080 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Package Dimensions": "9.41 x 7.05 x 0.79 inches; 6.24 Ounces",
      "Binding": "Video Game",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "6.2 ounces",
      "Manufacturer": "UniKeep",
      "Date First Available": "April 9, 2018"
    },
    "categories": [
      "Nintendo Switch",
      "Accessories",
      "Video Games"
    ],
    "price": 14.99
  }
}