{
  "website_summaries": [
    {
      "verdict": "Featuring a uniform design and a flavor that even the pickiest of mice can’t resist, this grain-based mouse food is a complete and balanced diet that is surprisingly similar to the high-fiber diet wild mice would naturally consume.",
      "pros": [
        "Corn, soybean meal, and wheat are the first 3 ingredients",
        "Available in convenient 2.5 pound and 25 pound sizes",
        "Pellet formula",
        "High in fiber",
        "Loaded with essential vitamins and minerals"
      ],
      "cons": [
        "These premium mouse pellets are fairly pricey"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Rats love it but...",
      "text": "I bought this since I had two young rats being weaned and figured Oxbow was a good brand. I wish this wasn't a 2 pack as I'm not even half way empty of the first bag and they are both about 10 weeks old now. Id recommend you buy the Oxbow adult rat food even if you have 3-5 week old rats. This stuff just has a bit more protein which you can supplement with eggs and such.",
      "rating": 4.0,
      "verified": true,
      "author": "Tenoz",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "#1 Brand and Food",
      "text": "I breed rats and my babies love this. I use this and the Garden. I trust Oxbow and love Oxbow, never gone wrong with this brand. I have never used any other brand and nor will I.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandi",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Good so far",
      "text": "Can't really answer just yet. We just got this product for our two hairless rats two days ago. They seem to like them but will have to come back at a later time.",
      "rating": 3.0,
      "verified": true,
      "author": "heather wilmot",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Best Food for Rats",
      "text": "Best food for rats hands down. Will purchase again up until my rat babies are 6 months old, then I’ll transition to the Oxbow adult food.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabbi12321",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "My little rats love this!",
      "text": "My little rats love this! I always leave it available and supplement with fresh fruits and veggies. Everyone is happy :)",
      "rating": 5.0,
      "verified": true,
      "author": "cowgirlrideon",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Good quality food!",
      "text": "My little mouse loves this stuff. He will still eat it even though we have other home made mixes we give him. I would say that all Oxbow products are probably a bit pricey, but seem more balanced than most.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Stanley",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "My Rats like it",
      "text": "A friend of mine found this product, and I choose to continue to feed my pet Rats this (though I switch to the adult food when there adults obviously :-P) they like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Levi",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Helps maintain healthy weight.",
      "text": "I have a mouse that suffered from being over weight. Switched food to this, and she is now a healthy weight. Saved her life!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Kovach",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Love",
      "text": "Our vet said this is the best stuff. Our ratties love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Not good for rats",
      "text": "Not good food for young rats. It contains alot of alfalfa which is not digestible for rats and can cause problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber Cayton",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Wrong Package Received",
      "text": "I ordered young rat and mouse food 2 pack but the package only had a 2 pack of Adult Rat food. The shipping was fine, as expected with everything undamaged and with a good amount per bag, but what can i do to get the right package i was promised?",
      "rating": 1.0,
      "verified": true,
      "author": "nunona",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "My mouse is old now",
      "text": "I have not tasted these but my mouse does eat them and seems happy so I rated 5/5 for flavor on his behalf. He’s over a year old and still doing well so this food is probably good.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Yakomin",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Mikey likes it!",
      "text": "Bought this for my pet fancy dumbo rats, they love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Snyder",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Our pet mice love this food!",
      "text": "Our mice prefer this over other brands and we were thrilled to find it in amazon after our local store stopped selling it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lalalalaura",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Great product for a great price!",
      "text": "I love this type of high quality food for my mice! I’m glad I found the food for such a low price! Recommend buying this product for young rats and mice!",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "My ratties love it!",
      "text": "Its my patties favorite time of day when I refill! Its a bit pricey but great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Bree Costigan",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Rats approve",
      "text": "It was just like at the store but better value :)",
      "rating": 5.0,
      "verified": true,
      "author": "Abbi Topper",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "They will eat it.",
      "text": "My rats love these pellets and are very healthy guys!",
      "rating": 5.0,
      "verified": true,
      "author": "Mael Fray",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Top shelf rat food",
      "text": "The rats loved this when they were smaller. I keep buying other Oxbow products. Best quality I've found.",
      "rating": 5.0,
      "verified": true,
      "author": "E Collis",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Our mice LOVES this food",
      "text": "We have 5 mice here at home and our mice love this food. This is a two pack and we go through one pack per month.",
      "rating": 5.0,
      "verified": true,
      "author": "cindy penderghast",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Not the food advertised",
      "text": "This is NOT the block food that is shown in the picture. My pet rats only eat the block food. Unfortunately I don't have the time to return it so I am throwing $20+ down the drain",
      "rating": 1.0,
      "verified": true,
      "author": "KEM",
      "helpful_votes": 0,
      "publication_date": 20201110
    },
    {
      "title": "Wrong product shipped!",
      "text": "So great brand no issues with the food persay. I ordered young rat and received adult. Luckily we’ll make it work. But disappointed nonetheless.",
      "rating": 1.0,
      "verified": true,
      "author": "Tanaya Rauch",
      "helpful_votes": 0,
      "publication_date": 20201027
    },
    {
      "title": "Arrived crushed",
      "text": "Not very happy with this. It arrived completely crushed. Ordered it a couple of weeks ago, and what expecting full pieces of food. Not dust.",
      "rating": 2.0,
      "verified": false,
      "author": "Maddie",
      "helpful_votes": 0,
      "publication_date": 20201210
    }
  ],
  "product_meta": {
    "title": "Oxbow Essentials - Mouse & Young Rat Food (2 Pack)",
    "description": "Description: \nOxbow’s Essentials - Mouse & Young Rat Food is complete and balanced, delivering optimal protein, fat and energy sources to help your pet thrive. Food uniformity prevents the selective feeding commonly associated with mixes and seed-based diets. In this bag, and beyond, we promise only the best for your pet. \nProduct Highlights: \nUniform food with block shape that is ideal for gnawing Delivers optimal protein, fat, and energy sources Fortified with vitamins and minerals for optimum health Formulated with the guidance of top veterinarians and nutritionists\nIngredients:\nGround Corn, Soybean Meal, Wheat Middlings, Soybean Hulls, Dried Whey, Cane Molasses, Soybean Oil, Sunflower Meal, Alfalfa Meal, Sodium Bentonite, Flax Seed, Calcium Carbonate, Lignin Sulfonate, Menhaden Fish Meal, DL-Methionine, Natural Flavor, Monocalcium Phosphate, Salt, Magnesium Oxide, Choline Chloride, Hydrolyzed Yeast, Yucca Schidigera Extract, Yeast Culture, Mixed Tocopherols (preservative), Vitamin E Supplement, Zinc Oxide, Manganous Oxide, L-Ascorbyl-2-Monophosphate (Vitamin C), Niacin, Copper Sulfate, Vitamin D3 Supplement, Zinc Proteinate, Biotin, d-Calcium Pantothenate, Manganese Proteinate, Copper Proteinate, Riboflavin Supplement, Vitamin A Supplement, Pyridoxine Hydrochloride, Sodium Selenite, Menadione Sodium Bisulfite Complex (Vitamin K), Thiamine Mononitrate, Folic Acid, Vitamin B12 Supplement, Calcium Iodate, Cobalt Carbonate, Rosemary Extract Guaranteed Analysis:\nCrude Protein (min) 18.00%\nCrude Fat (min) 6.00%\nCrude Fiber (min) 2.00%\nCrude Fiber (max) 6.00%\nMoisture (max) 12.00%\nCalcium (min) 0.80%\nCalcium (max) 1.20%\nPhosphorus (min) 0.60%\nVitamin A (min) 8,000 IU/kg\nVitamin D (min) 1,000 IU/kg\nVitamin E (min) 125 IU/kg",
    "rating": 4.7,
    "feature_bullets": [
      "This food is specially designed for rats that are young, pregnant, or lactating",
      "This food is also ideal for mice of all ages",
      "Contains the right balance of protein, fats, and energy sources for your pet",
      "Quality tested and guaranteed"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7 x 2 x 8 inches; 5.17 Pounds",
      "Date First Available": "May 7, 2018",
      "Manufacturer": "Oxbow",
      "ASIN": "B07CXJP1YX",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Pet Supplies"
    ],
    "price": 21.61
  }
}