{
  "website_summaries": [
    {
      "verdict": "A basic but powerful drill that will make you feel in control, even with precise drill work.",
      "pros": [
        "Multi-function battery pack can also charge other household devices like phones",
        "Easy to drill with precision into numerous materials, from wood to metal",
        "Ergonomic, lightweight design makes it easy to use",
        "10 drill bits and 10 driver bits included"
      ],
      "cons": [
        "Some complaints of faulty battery chargers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "no batteries",
      "text": "The critical path for the life of any cordless device is the life of the battery. The company that makes this drill does not offer replacement batteries. The Black&Decker drill offered by Menards was $10.00 cheaper and I can buy all the batteries I want for that drill.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay H. Harris",
      "helpful_votes": 294,
      "publication_date": 20180909
    },
    {
      "title": "Light, convinient, great design.",
      "text": "It is a great tool. I like it include all sizes of accessories, especially the rope,It is really light, has been working perfectly for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew ",
      "helpful_votes": 90,
      "publication_date": 20180730
    },
    {
      "title": "Included charger failed after a month. Update",
      "text": "The charger failed after a month of ordinary household use. Saw replacement charger at a local store for $29.99. Too bad I cannot get my money back or an exchange. I can charge the battery with a male-to-male usb cable but takes forever to charge. All I can say, hello DEWALT. Customer service reached out to me after reading my review and sent a new charger. Four Paws Up to the brand.",
      "rating": 4.0,
      "verified": true,
      "author": "David Hicks",
      "helpful_votes": 51,
      "publication_date": 20190514
    },
    {
      "title": "Nice Drill",
      "text": "I would recommand this drill. It's a nice one at this price. I like it. Plus it has the light when you are working in dark places. Also there is a USB plug on the battery, which is also a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Brown Ian",
      "helpful_votes": 51,
      "publication_date": 20180826
    },
    {
      "title": "Great product",
      "text": "Just used it to install new handles on cabinets. The flex tool worked great for getting into drawers. The light and size of drill is convenient and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Big C",
      "helpful_votes": 40,
      "publication_date": 20181201
    },
    {
      "title": "It is easy to use",
      "text": "It is easy to use! And the quality seems reliable! Seller are patient and the shipment is quick. It definitly a tool worth to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Muyi Feng",
      "helpful_votes": 41,
      "publication_date": 20180722
    },
    {
      "title": "Definitely an affordable must!",
      "text": "Very nice drill and attachments are a plus for the price! Definitely going to invest in more products from this seller! Only wish it had a carry case.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Anthony",
      "helpful_votes": 33,
      "publication_date": 20181125
    },
    {
      "title": "EDIT: Came with correct  battery charger",
      "text": "EDIT TO MAY 2019 FIRST REVIEW : ORIGINAL BATTERY CHARGER WORKS, I THOUGHT IT WAS WRONG CHARGER BECAUSE IT WAS HARD TO PUT IN PLACE, SEEMED NOT TO FIT AND DID NOT HAVE THE MARKINGS INDICATED IN INSTRUCTIONS. SO I HAVE CHANGED RATING TO THREE STARS. EVERYTHING IN THE INITIAL REVIEW (following) (EXCEPT ABOUT THE BATTERY CHARGER) STILL APPLIES.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter B.",
      "helpful_votes": 13,
      "publication_date": 20190512
    },
    {
      "title": "Check it before shipping",
      "text": "Extremely disappointed I couldn't use it. I just received the item and nothing works. It doesn't turn on and I am extremely disappointed, because I had to cancel my cable guy. I couldn't hang my TV and then I tried calling customer service and nobody could help me. Because they told me that I have to get ahold of the manufacture which is kind of dumb. It's a brand new drill. Does anyone check it before sending it to the customer. I just received the item and its non workable",
      "rating": 1.0,
      "verified": true,
      "author": "ISABEL GARZA",
      "helpful_votes": 11,
      "publication_date": 20190918
    },
    {
      "title": "Keyless Chuck stuck in the closed position",
      "text": "I broke an 1/8\" drill bit off. Got the bit out of the drill chuck. But now the chuck won't open or close. Just purchased this item on the 22 of December. Less than a month.",
      "rating": 1.0,
      "verified": true,
      "author": "zane westmoreland",
      "helpful_votes": 15,
      "publication_date": 20190127
    },
    {
      "title": "Great for the price",
      "text": "Bought this for 37.99. Got a 2.00 discount at checkout. The build quality is comparable to my Black and Decker. The grip is very good. Its compact and lightweight but not cheap feeling. It has a solid feel and balance. For the price I'm happy getting a 20V cordless drill. The accessories are cheap except for the bendable screwdriver attachment. It actually works very well. The variable speed trigger is a great feature. Update : I used this for drilling into stucco with a stucco drill bit and it worked great. Stayed strong and did not fade to complete the job of drilling multiple holes. Went to plug the battery back in and it showed full charge still. Wow.",
      "rating": 4.0,
      "verified": true,
      "author": "George A. Martinez",
      "helpful_votes": 10,
      "publication_date": 20190330
    },
    {
      "title": "Not Worth Your Money",
      "text": "I used this product once as a drill and it began clicking and whining and smelling like smoke. Now my drill bit is stuck in it as I prepare to return it. I tried to remove the bit, but it won't turn. Will not buy this product or anything else from Avid Power again.",
      "rating": 1.0,
      "verified": true,
      "author": "Alfred D. Cornell",
      "helpful_votes": 6,
      "publication_date": 20191012
    },
    {
      "title": "Charger doesn’t work",
      "text": "Good drill, not heave at all. I’m giving it 1 star because the charger stopped working",
      "rating": 1.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 7,
      "publication_date": 20190405
    },
    {
      "title": "just right for light duty amateur",
      "text": "Coming with only one battery could become an issue for a heavy user who would always want a fully charged battery at the ready while working. I cannot imagine that I will ever do enough work for that to be an issue. After reading about optimum battery life after a number of recharges, I tried to run the battery down before the first recharge. It was taking too much time, and I had a job to do. The job is done, and several others since and the battery is nowhere near spent. The variety of bits is very good. I used this thing primarily as a screwdriver.",
      "rating": 5.0,
      "verified": true,
      "author": "Somnial",
      "helpful_votes": 3,
      "publication_date": 20190725
    },
    {
      "title": "Great customer service",
      "text": "I give 5 starts for the customer service from Avid Power 20V. I initially got the product and I was very disappointed because the drill is weak, even when it’s fully charge and the bit gets stuck in the wall or wood and I couldn’t return it on time ( newborn at home) after using it only a couple of times the drill has been sitting there useless for a while. After writing my review customer service reached out to me and helped me to have a full refund which I wasn’t expecting that I thought my money was lost. So if you want to try this drill, I would confirm you that your money is safe.",
      "rating": 5.0,
      "verified": true,
      "author": "A mom",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "quality",
      "text": "I did not use it because I could not get the cordless battery on and off the drill due to poor fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Roy Cox",
      "helpful_votes": 5,
      "publication_date": 20190309
    },
    {
      "title": "Save your money!!",
      "text": "Thought I’d like this drill since it was a small version, and for smaller projects that I do.. I have only used it twice and I personally would not recommend it...bits don't stay tight in the chuck...bits will start to go in material (main use is wood) bit will stop but the chuck still spins. Super annoying to try to get bits back out.. I will not use it again & will stick to name brand tools!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny Hermel",
      "helpful_votes": 2,
      "publication_date": 20200711
    },
    {
      "title": "Swiveled out the box",
      "text": "Needed to have a simple wireless to make small jobs around the house. Works fine, like it came with all the drill bits and screw attachments. But out of the box the head of the drill for some reason is not straightforward, everytime I drill I see it swivel a bit, more a eyesore than anything. Drilling nails and bolts work fine when needed, this from me an amateur in handywork. Did the work was intended to and now stored until further notice.",
      "rating": 4.0,
      "verified": true,
      "author": "JC Rami",
      "helpful_votes": 2,
      "publication_date": 20190708
    },
    {
      "title": "Not a fan, Back to my screwdriver. This Drill needs too much pressure !",
      "text": "I bought this for my small projects around the house like my guitar wall mounts and curtain rods. This drill needed too much pressure applied to the back of it for it to actually drive the nails into my drywall and even with the pressure i applied it took too long. Honestly with no exaggeration I could've used my screw driver and it would've taken less time and my hands wouldn't have been throbbing from the pressure. I'd recommend any major brand name power drill available at Home Depot over this.",
      "rating": 2.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Must have tool at home",
      "text": "We moved to a new house recently. I bought this drill before our move after watching bunch of YouTube and tiktok videos. I originally bought it for drill brush washing. Never washed anything not even once. But sure used it so many times for screws and drill holes and I am a girl. Gotta have one at home otherwise my right hand hurt when i just think about how much work I have to do without it. I only charged it once when I received. Never bothered charged again and it still going. Must have!! Took me two YouTube videos to learn how to use it but once you got it, you love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Esperanza ",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Doesn’t work for a second of a second.",
      "text": "I bought this to have around the house just in case. I finally got around to needing it and it doesn’t work at all. The vice won’t close around the drill bit. It’s impossible to move. Many attempts were made and I even took it to a nearby hardware store. They said it was totally unused. Unfortunately my return window expired before I could return it for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole Giovinazzo",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "Weak",
      "text": "It’s my first time use this to drill on the wood. The steel drill bits break after 2 hole half way done.... so disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Pamelor",
      "helpful_votes": 4,
      "publication_date": 20190212
    },
    {
      "title": "A solid product for the price.",
      "text": "I bought this for general work around the house/ work and have not been disappointed. I can't say how this would hold up in a more stringent work environment, but for the light projects I have used it on I am totally satisfied. Very good battery life so far. Has lasted me through a two day project of medium to light work. The VST works great as well as all of the torque settings. Bit installation and extraction is quick and easy. It has a spot light on it and on the battery there is a USB port and battery life led indicator. To me it seems to charge quickly. Definitely worth my money!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "BEST DEAL FOR A 20 V BY FAR!! (AVID POWER)  GREAT PRODUCT SUPPORT!!!",
      "text": "20 VOLT CORDLESS DRILL (AVID POWER) SOLD BY AMAZON FROM 'MASTERWORKSTOOL'. POWERFUL, WELL BUILT, AND GREAT PRODUCT SUPPORT WHEN I GOT THE DRILL, A PIECE WAS MISSING FROM THE PACKAGE. IT WAS VERY QUICKLY SHIPPED BY 'MASTERWORKSTOOL' COMPANY. TOP NOTCH PROFESSIONAL SERVICE!!! AMAZON WAS VERY HELPFUL ALSO. I COMPARE THIS DRILL TO A DEWALT 20 VOLT THAT I HAD THE TWO DRILLS ARE VERY SIMILAR. I LIKE THE 'AVID POWER' DRILL A BIT BETTER! I REALLY LIKE THE LIGHT THAT SHINES FROM THE DRILL, IT ACTUALLY SHINES ON THE WORK THAT YOU ARE DOING. THE BATTERY LASTS A LONG TIME. IT IS THE 20 V 1.5 AH LITH ION. YOU CANT BEAT THE PRICE........JUST BUY IT!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "BUTCH M.",
      "helpful_votes": 7,
      "publication_date": 20190420
    },
    {
      "title": "Great for small home projects",
      "text": "I purchased this to use for small tasks around the home. This drill and included accessories was just perfect for my needs! The built in guide light was helpful when installing a shelf unit in a dark closet. It's compact and easy to maneuver in tight spaces--oh, it came with a flexible attachment so you can literally put in screws around a corner! Overall I found this the best but for the money considering it came with drill and screw bits plus long life Lithium Ion battery. Oh, a USB port as well! If only there was a built in level-----",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl E. Jack ",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Excellent value",
      "text": "So far so good! Received it 2 days ago and immediately charged the battery. Yesterday I started assembling a small wooden picket fence at my girlfriends house. It is about 20 x 35 around the front yard plus a 42 inch gate. It was plenty powerful to drive all of the 2 and 3 inch wood screws plus 10 2.5 inch 3/8 lag screws. Did the whole thing on one charge. Purchased as a replacement for a Ryobi that broke last Friday. Does not have a magnetic tray like some of the others but that is no big deal to me. Don't see how you can go wrong at this price!",
      "rating": 5.0,
      "verified": true,
      "author": "Reverend Jim",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Chuck Broke",
      "text": "This drill arrived and I was eager to use it for my wall mount. To my surprise, the chuck of the drill is broke and only 1 out of the 3 metal pieces extend out the chuck to hold my drill bit. Defective...",
      "rating": 1.0,
      "verified": true,
      "author": "Spoon",
      "helpful_votes": 5,
      "publication_date": 20190401
    },
    {
      "title": "To truly get what I I'm going to pay for for once is that so hard people's",
      "text": "For a 20volt power drill it's pretty weak on its torque speed and apparently the guy who designed the charger for this poorly designed product so happenly designed it to be defective as all hell I'm really pissed about this poorly made fashion show glammer disappointed in wasting my money and time for the this POS machine is f#ing be charger don't work and can't get another one for this poorly designed product either way I'm not going to buy from them again piored",
      "rating": 2.0,
      "verified": true,
      "author": "Loki",
      "helpful_votes": 3,
      "publication_date": 20190105
    },
    {
      "title": "USB Charger?",
      "text": "Like this guy. A tad smaller than I expected, but that's a good thing. For most household and around the house tasks this is great. But the USB connector is not what I incorrectly assumed. I thought I could charge the drill like I charge my cell phone or my car jump starter. But instead the drill battery can charge my cell phone. Don't see the purpose, unless one wants to carry the drill battery around for in case you phone runs low on power. Nevertheless the drill is great.",
      "rating": 5.0,
      "verified": true,
      "author": "The Skeptic",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Good drill but accessory broke right away",
      "text": "This is a very lightweight drill so I was happily surprised at how powerful it performed. I've used it over and over in a number of home improvement projects. However, one of the reasons why I bought it was that it came with this cool bendy attachment that allowed you to screw in at weird or tight angles. Sadly, bendy attachment broke after the first use.",
      "rating": 3.0,
      "verified": true,
      "author": "Vicki L",
      "helpful_votes": 3,
      "publication_date": 20190725
    },
    {
      "title": "Great buy",
      "text": "Great value for the money. Lightweight and easily handled. Had to drill upwards into a metal frame and this was easily done thanks to this drill; then was able to install some screws as well as unscrew them when necessary. Can see where it can perform a multitude of small household tasks.",
      "rating": 5.0,
      "verified": true,
      "author": "Knittingstix",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Great Drill/ and Accessories!",
      "text": "I just got this drill set yesterday and was very pleased with the size, how light weight it is and the that it seems made out of great materials that should make it last! I read that the battery should hold 45 min. of continuous charge and that is long enough for what I need it for! The price was well worth what I received ! It also arrived very quickly and was packaged well! The power is strong to get jobs done quickly and efficiently and is exactly what I was looking for! I would recommend this particular set for anyone that has everyday jobs to be done in and around the house to meet your drilling needs!",
      "rating": 5.0,
      "verified": true,
      "author": "scott payne",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Compact drill.",
      "text": "I am really impressed with this little drill. I was going to buy the B&D drill that is currently on sale from $100 to $50 but it was out of stock. I am happy I didn't wait and went with this one because the power on this matches the B&D the torque is there and this drill provides slightly better maneuverability. Avid Power might have just earned a new customer, dependent on product life. It's perfect for home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric B.",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "stops working",
      "text": "This drill only works about 50% of the time -- it stops working randomly. I'll let it sit for a few minutes and then it'll start working again - but very frustrating when working on a project.",
      "rating": 1.0,
      "verified": true,
      "author": "culprit",
      "helpful_votes": 3,
      "publication_date": 20190504
    },
    {
      "title": "Reliable and easy to use",
      "text": "Basic drill, but reliable and so easy to use. My husband is a woodworker so we have every tool under the sun... but truthfully I'm intimidated by most of them. I bought this drill for random house projects and I couldn't be happier. I saw other reviewers complained about the battery life but I haven't charged mine more than once and have had no issues. I have used it a great deal so I was pleasantly surprised by how long the battery has lasted.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Ok product",
      "text": "Overall is great. it easy to use, and it drill to dry wall and stud with no issue. But they should paint the size for the drill better, look at the image i provide, i cant read the drill size.",
      "rating": 4.0,
      "verified": true,
      "author": "kday",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "good drill...till it died... but company shipped a replacement drill  fast",
      "text": "It did not arrive yet but as soon as company noticed my \"not happy\" review they contacted me and shipped another drill. Not something many companies well do. As for the drill when it worked it was OK... not the kind of quality as my DeWalt that has kick ass power to drive many decking screws home year after year..... but good for my old retired guy projects I do today.... If it keeps working I expect to be happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Pleasantly surprised",
      "text": "I have to say that, especially for the price, I am pleasantly surprised. The drill comes with everything you need (attachments) for an around the house, small job, solution. The battery even powers your usb devices. I'm not going to say it will last forever, and I'm not saying this drill is suitable for construction, but for those odds and ends (curtain rods, picture frames, shelves, ect...) this will do wonders.",
      "rating": 5.0,
      "verified": true,
      "author": "manahtn",
      "helpful_votes": 3,
      "publication_date": 20190612
    },
    {
      "title": "The little drill that could..",
      "text": "Really love the drill it is light weight and very sturdy built you also get a bunch bits and drills screws included there is a little usb too which is nice to charge on the go or can use ac adapter for wall plug. A good quality drill for when you've got a job to get done. Thank you to \"Avid Power\" and very affordable too. The little red drill that could! Would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "The Travelur",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Awesome customer service!",
      "text": "This may or may not be ok. I knew I had a problem as soon as I saw the box...not quite meeting on the top and bottom. When I opened it...the drill was not completely wrapped in plastic, open and loose on the bottom. The battery itself looked to have some scuff marks on the bottom. It charged fine, and so far appears to work. Great customer service to make this right. And the drill is working fine!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Putnam",
      "helpful_votes": 2,
      "publication_date": 20190608
    },
    {
      "title": "Great bonus features and plenty of power",
      "text": "Maybe because I've only owned two drills before, but I find this one amazing. Things that took me forever before I got this now literally takes seconds. There is a bit that flexes for tight or hard to reach places that I've found invaluable and the motor has plenty of power. Bonus that you can use the battery base to charge things like your cell phone when electricity goes out. Comfortable grip and light enough in weight that it's easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Fee's Feedback",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Nice drill for the money",
      "text": "I couldn't believe this drill was as inexpensive as it was - but the quality so far has seemed quite good. The only complaint so far is that the bit adaptor for the drill is not magnetized, so I lost some bits that fell out. Otherwise, quite a nice drill so far.",
      "rating": 4.0,
      "verified": true,
      "author": "James R. R",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Cover for the USB charge port broke, otherwise decent product.",
      "text": "Decent product. Not much to expect from a $40 hand tool. Just a standard lithium drill. Only complaint is that the cover for the USB charging port on the back was broke when I pulled it out of the package. What I mean by broke is that the cover doesn’t stay closed over the USB charging port. Not worth my time to send it back in, as I need to use it for work. Other than that, decent product. You’re gonna get what you pay for out of it. Not sure how long the battery will hold up.",
      "rating": 3.0,
      "verified": true,
      "author": "Dalton James Bousum",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Has everything you need!",
      "text": "This is an easy to use item that has all the bits you'd need unless it's something very specialized. It is a bit heavy on the wrist when trying to use it on an angle or for more than a few seconds. It is a little hard to change out the bits, but they go in solid and don't come loose while using the drill. Love that is comes with two ways to charge the battery.",
      "rating": 4.0,
      "verified": true,
      "author": "T23",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Cordless Drill",
      "text": "Since I use a drill a couple of times a year, I was not looking for anything expensive. I loaned out my 20 year old one and it came back without the charger. The Avid Power was priced right. I am finding that the battery holds it charge for a long time between uses (months). The chuck may not hold very tight, but for the money, it is just fine. A good buy for the occasionally user",
      "rating": 5.0,
      "verified": true,
      "author": "18overpar",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "A fine low-end option",
      "text": "Well, the first time I used it, it started smoking. It got the job done I guess. I considered returning it, but I’m glad I didn’t because I’ve used it a fair amount since. Not for anything major, but for smaller, easier jobs it’s been acceptable. Still have not had to charge it; battery still says it’s full. Hopefully that’s not an issue. If you need a cheap drill and don’t care much if it breaks (like I did), a good value option. Do no buy if you expect it to be comparable to the mid-range name brand drills.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Nice screw gun. Good for light drill work",
      "text": "I use this unit as my screw gun and I have another better more powerful unit that I use for drilling. As a screw gun this 20V Lithium lasts. I know other reviews state problems, but that is if you use it as a heavy duty drill/screwdriver. As a light duty screwdriver this unit has done very good for week after week. But, it has only been a few months...",
      "rating": 5.0,
      "verified": true,
      "author": "markncathy@aol.com",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Prices so low, I had to give it a try",
      "text": "Did a few drywall, mounting jobs around the house. (Property manager) I was worried about it not having a carry case but it fits nicely in the small box of a shipped in. That saves me $20+ I'm looking forward to using the snake device. It will come in handy when putting together a bed. even if the battery wears down, as long as it still works I'll be happy if it only lasts a year, as it is so inexpensive. If I remember I'll come back in a year and write another review.",
      "rating": 5.0,
      "verified": true,
      "author": "Pimmy",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Favorite tool",
      "text": "This drill worked great. I use it to rebuild our back stairs. Very easy to use . That is my favorite tool . It is very powerful. I use it to do a lot of projects. Very like it",
      "rating": 5.0,
      "verified": true,
      "author": " Great value 18 ",
      "helpful_votes": 5,
      "publication_date": 20181115
    },
    {
      "title": "A lot of power for the money",
      "text": "I don't use this everyday, but I already know that it's more powerful than my old drill, and I also use it for cleaning my bathroom tiles. The battery lasts a longer time than the old one, and it has many more features I like, such as the light and the bendable extension for hard-to-reach areas. And you have to love the price.",
      "rating": 5.0,
      "verified": true,
      "author": "erudy",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice,cheap drill",
      "text": "This is a nice drill for as cheap as it was. The included bits, tips and angle drive are great. The battery is easy to take off and on, I have arthritis in my fingers so this was important. I can't speak to longevity of the product but will update if it's not good.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Thompson",
      "helpful_votes": 3,
      "publication_date": 20190120
    },
    {
      "title": "Got it a month ago. Still best value! Drill bits were all bent and not straight.",
      "text": "Just bought a house and needed to get a few home essentials for my utility cabinets and of course you must have a electric rechargeable drill set. I loved this product overall. The only downside to it is that almost all of my drill bit pieces were bent/crooked and not straight. Had to buy separate drill bits which is why I’m giving it 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Not good",
      "text": "It was a cheap drill. I guess I should not have expected a Dewalt performance. It does not drive very well. The torque most likely does not function. I found myself hand tightening 3 in screws with a ratchet socket wrench as I was worried that I will damage the head if I use this drill. One of the drill bits broke on the first try. Not sure if I can return now; if I could I would.",
      "rating": 2.0,
      "verified": true,
      "author": "G.",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great",
      "text": "Great buy. Smaller than I anticipated, which is good since I don't have a lot of storage room. Probably not a great buy if you plan on using this daily. But it's a great buy for people that just need to screw something in every now and then. I needed to drill some holes to attach a curtain rod to the wall and this got the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Cookies",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Easy to use drill...",
      "text": "I am a complete drill novice and this little guy got the job done! Easy to use. Easy to understand instructions. I needed an inexpensive drill for putting in cabinet knobs and this drill made it a cinch! Even has a light so you can screw up that job! Has many features and settings. A good drill/screwdriver for tasks around your home. And cordless too!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Solares",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Best drill ever.",
      "text": "I am a 81 year old woman that loves taking care of my own projects if not too hard for me. I love this little drill. It is so light weight and so easy to charge. I have had it two days now and I have put up hanging lights on my patio, and added Shepard's hooks on the post. The drill works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "greatshopper2",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Works great",
      "text": "This drill is light weight which is great for a little old lady like me. Great power and glad it came with drill bits. I gave the drill 4 stars because I couldn't figure out how to release drill from battery to recharge. My son figured it out. This is a great drill for occasional use around the house.",
      "rating": 4.0,
      "verified": true,
      "author": "Mollie Williams",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Don't Be Fooled by Name or Cheap Price....Excellent Small Cordless Drill",
      "text": "I owned Makita and other name brand battery powered drills in my lifetime, but now in my retired years I wanted a drill that was lightweight and inexpensive. This Avid cordless drill goes a long long time between charges. Also fits the hand so comfortable. I wouldn't hesitate to buy this drill if you just want a light duty handy drill for around the house uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Airbus30B",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Nice tool for the price",
      "text": "Replacing an older Craftsman with NiCads. NiCads die way too soon and cost $$$$$$. Don't do as much work with tools as I used to (so interchangeable batteries not so important) and was looking for something that was - most important - LI powered. Looked like it was well made - it is - and a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great value!",
      "text": "I purchased this drill because I needed to assemble some furniture. The drill works great! It came with a charge, but I charged it as directed upon arrival and have been using it ever since (about a month) without needed to recharge. So far I have disassembled a bed, reassembled 2 bed frames/headboards, tv stand, bookshelf, and a couple of other home accessories. The LED light is really helpful and it came with several screwdriver and bits for a variety of tasks. Mostly I have used the phillips driving bit and it makes tasks much easier! Definitely a good buy for light home use.",
      "rating": 5.0,
      "verified": true,
      "author": "NBia",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great deal for the price",
      "text": "I needed this for basic tasks, like puting up some frames, shelves and curtain rods. It has enough power to go thru brick and drywall. I really think it's a great deal for the price. All the basic accessories, the light is very helpful. If you need a basic powerdrill I totally recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "stefaniamarron",
      "helpful_votes": 2,
      "publication_date": 20190609
    },
    {
      "title": "Great drill",
      "text": "Holds a Charge well and is much easier to work with than my corded one. I will probably get more drill bits though, the ones that come with it are rather limited and I’ve already destroyed the Phillips head that snaps in the back. That’s probably just user error though!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cat42",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Light use only but great customer service",
      "text": "Light weight can not drive anything above 1/4 inch bit size, runs hot under minor stress, update July 2019: product failed but the company promptly honored the warranty claim and actually replaced with their “ hammer drill” which is much more substantial and has handled the jobs that I have used it for, I give credit to the Company for being proactive on the replacement, I do like the 20 volt power system",
      "rating": 3.0,
      "verified": true,
      "author": "Part time farmer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Great value.  Superb service.",
      "text": "It cost third of the price of brand name drills but does the same job - even better. Powerful for my needs, light, great battery life (still running on initial charge after 7-8 hours of work). Seller provided great service answering the questions I had. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Boris Yoffe",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "20V Cordless Drill, Power Drill Set",
      "text": "not goo taking for ever to drill a hole return it",
      "rating": 1.0,
      "verified": true,
      "author": "wilcesse aurelien",
      "helpful_votes": 3,
      "publication_date": 20190113
    },
    {
      "title": "Light weight and easy to use",
      "text": "Love this drill! Its perfect for home DIY crafts and perfect for the small hand. I love that it doesn't feel heavy and its great for inside the home. I wanted something light weight and easy to use. All the little accessories that come with it are a added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Behind The Chapters",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "I love my Drill",
      "text": "I hadn't had a chance to really hardcore use mine. Just little stuff but thusfar I can tell this is a good one and I'm very happy with it.. I was wondering if you guys have a carry bag or case of some type for it. I need one pretty bad. I don't have any type of tool box at this moment as I trying to build tools back up where mine got all gone sometime back. If ya could send me info on a little bag for it I would appreciate it. I kinda wanted one from you all if I can get one",
      "rating": 4.0,
      "verified": true,
      "author": "Dhartsell1",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Awesome",
      "text": "This little drill works very well. I needed something small to fit into tight spaces, that did not have a cord, but could drill through thick wood. This guy exceeded my expectations. Came with everything needed to get started, battery charged fast, I’ve done 3 or 4 jobs and still have life left. I would recommend and would purchase again",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Wigglesworth",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "OK, not for heavy jobs though!",
      "text": "Not really for big jobs. More for a woman to use around the house. Unfortunately it did not come with directions on how to put in or remove drill bits. so I never was able to use it. I should have sent it back though, my mistake. now just sitting in my closet",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "What a fantastic cordless!",
      "text": "Excellent, fast charging system. No giant bulky charger. Very compact charger. All accessories come with it! Drill bits, screwdriver heads, flex cable, just everything. Love the built-in worklight. I give this product a \"10\" for useability and price/value.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Lee",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Good for small repairs projects at home. Battery is a Monster!",
      "text": "First of all, battery lasts forever. I just use for small projects around the house but I'm sure this would be good for larger projects as well, based on battery life alone. Good for the price. Only negatives are bits and attachments are junk, Plan on getting higher quality bits and such.The black rotary flexible attachment is pretty useless. Broke on first use. Led light could be a bit brighter. I bought this knowing I wasn't getting a top of the line Mikita or Dewalt. For me thats ok It's good for at home diy's.",
      "rating": 4.0,
      "verified": true,
      "author": "Ernesto",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great Drill for the Price!",
      "text": "For how cheap this was, it's worked perfectly for me so far! I like the light weight, lots of bits and accessories, and convenient usb plug on the battery. I only wish there was a case for it all, but I'm not going to dock any stars for that. Great drill!",
      "rating": 5.0,
      "verified": true,
      "author": "Sterling",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Waste of time and money",
      "text": "The instructions are not great. Some parts are not clear at all.. I spent like 20 minutes trying to following the directions to put in the drill bit.. before I realized it's backwards in the picture from the direction I should be turning...Then I finally get ready to use it, and it breaks.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Phillips",
      "helpful_votes": 2,
      "publication_date": 20190213
    },
    {
      "title": "Look Elsewhere",
      "text": "I used the drill for the first time last week to install overhead garage shelving. While installing the first screw into the ceiling joist, the drill started smoking and simply quit. I purchased it in February and the return period has expired. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "A.B. ROBINSON, JR",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Love This Drill!!!!",
      "text": "I was sceptical buying this drill since the one I bought prior was a dud! But man does this thing have power! For a small size it really packs a punch! Not to mention you can use the battery to charge a phone if you desperately needed! My boyfriend and I laughed about it because his phone always dies. Not only is it handy, but I can use it for about 2--4 days before having to charge. And thats with frequent use. Overall, this drill was a great choice and not to mention a great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Good",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "My new favorite tool!",
      "text": "This is exactly what I needed! I’m not doing handy things a lot but needed something I could use to speed up the process when hanging up pics, putting together small furniture, etc. My nephew also commented how easy it was to use when he hung up my curtains and flat screen televisions. Fits perfectly with my other basic tools in my tool bag and it’s lightweight.",
      "rating": 5.0,
      "verified": true,
      "author": "Calina Black",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Have used this throughout the house and only ever charged battery once",
      "text": "I think i had low expectations for this which is why I'm so impressed. The battery life has been truly impressive, and the usability has been better than other brands. I have a few options for drills, but keep picking this one up as it's my preference over others.",
      "rating": 5.0,
      "verified": true,
      "author": "MewMew",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Good for new users",
      "text": "First time drill buyer and user. This drill is very easy to use. I took off 1 star because the instructions were confusing. Had to Youtube the instruction on how to remove and install bits. Using it for mostly around the house stuff. Nothing crazy.",
      "rating": 4.0,
      "verified": true,
      "author": "ajer",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Lightweight, Sturdy and Powerful.",
      "text": "I'm not a professional, and I bought it for interior decorating purposes in my home. It has helped me tremendously. Very lightweight, sturdy and powerful. I recommend for around the house type of stuff or for extra use in small workspaces etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Very useful drill",
      "text": "I bought it just to complete installing few things at home, so it has the basic drill bits tools to do it. I have used like 6 times and the battery still working, haven't charge it in a month. I recommend this driller, good to have it as home tool.",
      "rating": 5.0,
      "verified": true,
      "author": "RDK",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Not strong at all",
      "text": "The chuck is not strong enough to hold drill bits. I was using this drill and included drill bits to make some pilot holes and the the chuck kept slowly releasing until it was just spinning around the drill bit. Also the bits snap in half very easily.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Just buy it",
      "text": "If you’re hanging pictures, plants and floating shelves BUY THIS DRILL! Don’t waste your money on those brand name drills because this little guy gets the job done! So far I’ve hung 2 floating shelves and a plant hanger & I haven’t had to charge it yet! Super lightweight which is good for me because I’m a petite woman. Has good bits and torque too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Pint sized cute drill gets the job done",
      "text": "Who's a cute drill? You're a cute drill! 😄 I was surprised how small and lightweight this drill is. It seems to work alright, and is definitely well suited for smaller hands. No idea about actual battery life. Time will tell.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Flimsy and cheap",
      "text": "Cheap plastic. Has lots of extras but I doubt it would have a very long life.",
      "rating": 1.0,
      "verified": true,
      "author": "octobergirl412",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Quality drill at great price point",
      "text": "This seems perfect for small jobs around the house. Light weight plus various drill bits make it a good value. Drill battery was almost fully charged on receipt. Fits well in hand. Seems comparable to other more expensive drills.",
      "rating": 3.0,
      "verified": true,
      "author": "rees*pieces",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Perfect starter set",
      "text": "I just moved and needed a quick set to start getting the apartment decorated. This thing is sturdy and powerful. I cannot speak to battery life yet as I only had it for a couple of weeks and it hasn't run out of battery. However, I have only had to use it a hand full of times so it is good, but too soon to say how good! I do recommend this product because of the quality drill but also because it is a truly cohesive set!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cocoa",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "The drill itself is good",
      "text": "The drill itself is wonderful but the attachments are not of high quality and don't really fit well in screw heads.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary S Potmesil",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Good deal. Works better than you would think.",
      "text": "Very good deal, it seems cheap but its holding up. I use it for light work. Ive put together furnite, desks, and tables. I have also mounted shelves and tvs with it. It works well and still havent had to charge. So, so far, its a good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "ary dizayee",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Awesome tool",
      "text": "As a single mother and someone who had never used power tools before this thing is amazing. In a week I've fixed siding using the smallest drill bit and screws. I've rehung curtain rods and so much more. It's got great battery life and the super awesome USB port for charging devices is a big bonus!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Small but mighty",
      "text": "The drill is way smaller than I expected. This was a pleasant surprise because I am a small girl and can definitely handle this thing with one hand. That takes nothing from its power though. My husband gave me a thumbs up on this pick. It and all of its accessories for nicely in one of our kitchen drawers. I wish it had a case but at this price, everything that comes with it is a steal. Can’t wait to use the drill bits!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kell",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "GREAT Value",
      "text": "Great Value, Light-weight, good battery time, and easy to determine when it's time to charge. Dad's 86 so we needed something easy for him to handle both in weight and explanation...this tool fits the bill!",
      "rating": 5.0,
      "verified": true,
      "author": "B.K. Walker",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Awesome!",
      "text": "I can't believe the quality of this drill/battery combo. It is as nice as drills costing 3x as much! Definitely a 5 star purchase if it's lasts. I will update if the drill or battery quits working.",
      "rating": 5.0,
      "verified": true,
      "author": "Toby",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Battery was bad",
      "text": "Normally I don’t write reviews but I felt the need to for others to know about this product. At first it worked great and only used it twice. When my son was working on his car and needed to use my drill, so I got it and hooked it up for him and started to use it and me thinking oh I guess I need to charge it. So I plugged in the charger and it wasn’t charging. So just left it plugged in hoping it will charge. Few hours later, it still didn’t work. I’m really disappointed. I have few things I need to assemble for my place.",
      "rating": 1.0,
      "verified": true,
      "author": "Bluez",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Don't Buy",
      "text": "Bought this Avid drill 11 mos. ago with very lite usage, maybe six times. While using drill chuck broke loose from shaft. Drill does not work at all...Avid power has two year warranty on product. Tired to contact company through there web site but unable to find any way to contact them, not even 800 number listed. Don't purchase this product, now stuck with worthless drill.",
      "rating": 1.0,
      "verified": true,
      "author": "cary pino",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Great value",
      "text": "Great works good and long battery life. Cool that it charges your phone too.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa a ludlow",
      "helpful_votes": 6,
      "publication_date": 20180730
    },
    {
      "title": "Just finished building a fence",
      "text": "My old Black & Decker served well, but after 10-plus years the charger died. This complete set costs about the same as a replacement charger and battery, so I said \"Why not?\" IT handled a wooden fence without complaint, held a good charge and was comfortable in use. I can't really ask for anything more for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Long John Sliver",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "You'd be a fool not to",
      "text": "This little drill is the cutest thing ever. Small enough to fit in a toolbox without being in the way, light enough for anyone to use, plus it comes with all these fancy gizmos to get the job done. This is my first drill and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Schuyler",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Lightweight but still gets the job done!",
      "text": "This is so much easier to handle than our last drill. I didn't even realize how heavy and clunky our other drill was until using this one. As a lady with small hands and weak wrists from carpal tunnel, this drill is working out much better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "L. King",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Great drill.",
      "text": "Works great and much lighter than my old drill. Also smaller and easier to hold. Only improvement I would recommend would be better marking of the drill bits. As a novice, I had no idea of what materials they were best used with.",
      "rating": 4.0,
      "verified": true,
      "author": "EZm",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Nice for the price",
      "text": "For this price point and with limited home use a good product Unfortunately only one battery And cant find another anywhere So when it finally dies you will have a paper weight",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Petrovich",
      "helpful_votes": 0,
      "publication_date": 20191119
    }
  ],
  "product_meta": {
    "title": "Avid Power 20V MAX Lithium Ion Cordless Drill, Power Drill Set with 3/8 inches Keyless Chuck, Variable Speed, 16 Position and 22pcs Drill/Driver Bits",
    "rating": 4.5,
    "feature_bullets": [
      "MULTIFUNCTIONAL BATTERY PACK: 20V 1.5Ah Lithium-ion battery pack with USB output compatible for phone charging and real-time capacity indicator",
      "15+1 POSITION CLUTCH: 15+1 torque settings provide precise control for driving in/out screws to prevent stripping, and drilling into wood, ceramics, drywall, plastics and even metal with ease. Max torque for drilling into wood 13/16”(20mm) or steel plate 3/8” (10mm).",
      "ERGONOMIC DESIGN: Compact and lightweight design with superior motor minimizes fatigue in most daily screwing and drilling tasks; Rubber-covered handle provides a comfortable grip for being breezily operated in one hand.",
      "EFFICIENT WORKING: A flexible shaft could be used in some places where driver bits are hard to reach; LED light illuminates dark working areas; Variable speed（0-550RPM）with electric brake function provides precise operation.",
      "WHAT'S INCLUDED: 10pcs drill bits, 10pcs driver bits, an extension bar for sticking on fastener and a magnetic flexible shaft for hard-to-reach places, US based customer support"
    ],
    "specifications": {
      "Manufacturer": "Avid Power",
      "Part Number": "CD316-18",
      "Item Weight": "2.2 pounds",
      "Product Dimensions": "8.66 x 3.15 x 9.65 inches",
      "Item model number": "MW316",
      "Batteries": "1 Lithium ion batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Size": "3/8-inch All-Metal Chuck",
      "Color": "Red & Black",
      "Style": "20V Drill",
      "Material": "Other",
      "Pattern": "Power drill w/ 22pcs. drill bits",
      "Power Source": "Battery Powered",
      "Voltage": "20 Volts",
      "Torque": "20 Newton Meters",
      "Item Package Quantity": "1",
      "Type of Bulb": "LED",
      "Handle Material": "Rubber",
      "Special Features": "3/8” Keyless metal chuck, Variable speed, Compact and lightweight, Led work light",
      "Usage": "Drilling thin metal, wood, drywall,etc; driving in/out screws",
      "Included Components": "Avid Power MW316 Drill Driver Set comes with: ▪1 x Avid Power 20V cordless drill ▪1 x Lithium-ion battery ▪1 x Battery charger ▪10pcs HSS Steel Drill Bits - 1/8'',5/32'',11/64'',3/16'',1/4'' 10pcs driver bits ▪An extension bar for sticking on fastener ▪Magnetic flexible shaft ▪1 x User Manual Features with: ✔ 0-550 RPM  Max Torque ✔ 15+1 Position Torque Settings ✔ 3/8'' Chuck Size ✔ Trigger-activated LED Light",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Lithium Ion",
      "Description Pile": "Lithium-Ion",
      "Average Battery Life": "300 Hours",
      "ASIN": "B07CR1GPBQ",
      "Customer Reviews": "4.5 out of 5 stars3,090 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#744 in Tools & Home Improvement",
      "Date First Available": "April 28, 2018"
    },
    "categories": [
      "Power Tools",
      "Tools & Home Improvement",
      "Drills",
      "Power & Hand Tools",
      "Drill Drivers"
    ],
    "price": 39.99
  }
}