{
  "website_summaries": [
    {
      "verdict": "A large capacity wide-mouthed oil mister that does a good job of providing an even spray.",
      "pros": [
        "The spray on this mister works very well",
        "Does not tend to get caught up with air bubbles like others",
        "Stainless steel lid on glass",
        "Sprays like an aerosol can, but only uses air pressure to do it",
        "Easy to prime",
        "Bottle is a decent size"
      ],
      "cons": [
        "This product is called large capacity, but 10.4 oz",
        "is not as much as some other misters"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A must-have in my kitchen",
      "text": "I'm picky about the oils I use to cook. I've been using the aerosol sprays because it gives me a nice even coating on my pans and baking tray, but since I've discovered this mister... I'm NEVER going back!! I can put whatever oils I like in the bottle (and I'm picky), and it sprays just like a spray can. To get the pressure, I have to pump it before every spray but it's easy. Just a note, it took a few pump and sprays to get it to flow smoothly, so don't give up if it seems weak at first.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Lam",
      "helpful_votes": 41,
      "publication_date": 20180725
    },
    {
      "title": "Outstanding quality.  Exceptional performance.  Incredible value.",
      "text": "This mister is the best one I have ever owned. It has a steady spray with an excellent spray pattern. It is easy to control where and how much oil is sprayed. There is no spitting or air bubbles to interrupt the oil spray. This mister performs like a pressurized canister without the dangerous chemicals or environmentally detrimental metal can. The ease of use is exceptional. It is easy to fill and clean. It has a substantial feel and the quality is outstanding. It looks like a work of glass art in my kitchen!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Agosstinelli",
      "helpful_votes": 13,
      "publication_date": 20180721
    },
    {
      "title": "Great Purchase. Great",
      "text": "Perfect Oil Mister for the Air Fryer. (I prefer Avocado Oil because it has a higher smoke point). No more using the aerosol cans with all the harmful chemicals. It looks,feels & functions great and I especially love that it is super easy and completely washable. I did a lot of research before deciding on the Home Delighted Oil Mister and I am very pleased with my purchase. Customer Service is very professional and they stand 100% behind their product if you should have any questions they will PERSONALLY and promptly reply back. I highly recommend this mister and would definitely order it again.",
      "rating": 5.0,
      "verified": true,
      "author": "MiMi004",
      "helpful_votes": 6,
      "publication_date": 20190404
    },
    {
      "title": "Good spray dispersion",
      "text": "Has a nice, even spray dispersion, and so far (4 months) is holding up fine. I think the secret might be the instructions to bleed the remaining pressure after each use. In my last sprayer, I didn't do that, and after a while the seal breached and it wouldn't hold pressure. The glass body is great for cleaning; my last one was a plastic body, which is much harder to clean. Only nit perhaps is that the spray dispersion is so wide that it ends up greasing itself a little bit right below the nozzle, but that's not a big issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20200323
    },
    {
      "title": "Good",
      "text": "I read so many reviews on different oil sprayers. I decided on this one, yes there are less expensive ones but I like the idea of being able to choose the oil I want to put in. I primarily purchased to spritz oil for foods I'm cooking in the air fryer. It works good, pretty good coverage it just does need more pumping to get good coverage. It's not big deal so it takes me 2-3 times to get a good even coat on some chicken. It's not a steady one time your done thing. But we are talking mins. Nothing to time consuming. I feel it does what I wanted it to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20200906
    },
    {
      "title": "No need for store bought, chemical ridden pan sprays!",
      "text": "This product is much better than I expected. Beautiful, glass bottle is attractive enough to keep on the counter and the sprayer sprays a very fine mist. No need to buy chemical ridden store bought pan sprays. I’m going to use another one for my home made essential oil perfumes. Be sure to leave the plastic top on to pump it before using as the instructions state. I didn’t think it worked at first because I did not carefully follow the simple visual instructions. I’m going to buy some for gifts as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy F.",
      "helpful_votes": 6,
      "publication_date": 20180807
    },
    {
      "title": "Excellent product",
      "text": "This bottle is just the right size and shape to hold and spray the oil when prepping food. I have added grapeseed oil to my spray bottle. Easy to prime and spray. This is definitely a kitchen tool I am glad to have purchased and use in preparing my meals.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180719
    },
    {
      "title": "Does what's expected",
      "text": "After just a few uses it works pretty well. We wanted to try an alternative to the cooking sprays, and this does the trick. You do have to pump it before each use, and you should release the pressure before putting it away by unscrewing the bottle, which is a bit of a hassle (as compared to simply taking out a spray, using it, and putting it away). This really atomizes the oil well though, so I think it's better than a spray bottle. I'll see how it holds up over time...",
      "rating": 5.0,
      "verified": true,
      "author": "Jack G",
      "helpful_votes": 3,
      "publication_date": 20190422
    },
    {
      "title": "So far I love it!",
      "text": "I didn't rate the easy to clean part because I just got this. It was easy to wash before any oil went in. But until I need to clean it again, I won't know how easy it is once it has oil. I will say that while this is very similar to some I have tried...this one works! So far I am very, very pleased. I don't like to use much oil but like just a lite mist on veggies to roast. So far I am one satisfied customer!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Murray",
      "helpful_votes": 3,
      "publication_date": 20190330
    },
    {
      "title": "Great seller!",
      "text": "I had a little trouble with the first sprayer, but the seller was amazing. She contacted me and told me how I might fix or adjust it. When that didn't work, she offered a replacement or refund. I opted for the replacement as I really like the size and look of this sprayer. She said she is going to test the next unit, make sure it works, and then send it out. She was incredibly gracious and helpful. I like buying from small, independent businesses, especially ones like this who go out of their way to be helpful!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa B.",
      "helpful_votes": 2,
      "publication_date": 20200912
    },
    {
      "title": "Working as expected",
      "text": "Missing working great. Unscrew after each use as recommended, and still working fine, no leaks. Just use as recommended and I think you will be satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "fishinbug",
      "helpful_votes": 3,
      "publication_date": 20200818
    },
    {
      "title": "Easy to fill and delivers a fine mist",
      "text": "This smart looking mister is perfect for olive oil. Easy to assemble and very easy to hold and spray. Delivers an even, fine mist so nice to use to spray salad greens etc",
      "rating": 5.0,
      "verified": true,
      "author": "CKay",
      "helpful_votes": 4,
      "publication_date": 20200207
    },
    {
      "title": "Bought it 6 months ago",
      "text": "It works great with olive oil. Exterior pump cap split about a month ago but the plastic thing inside it that pumps up the pressure can still be used. Need to remember to orient the spray direction to align with the intake point inside the bottle, per directions. Cleaning isn't fun but it is important. Rinse out everything with soapy water then pump up the sprayer with soapy water and spray spray spray to clean the narrow tube and nozzle, then repeat with clean water. This sprayer has lasted longer than other's I've tried. Hope it lasts longer.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave A.",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Oil Mister and cooking spray",
      "text": "Beautiful glass oil mister, I am happy that I brought this purchase. Before I used the store brought cooking spraying with the added chemicals. Now I am using this non-propellant oil spray mister that is much more healthier to use while cooking. The bottle sprays really well. Just make sure to pump the bottle gently 7 times all the way down. It will be ready to use when you feel the resistance to push the cover all the way down. .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190527
    },
    {
      "title": "Just what I needed...",
      "text": "The Olive Oil Mister is fabulous! We use olive oil on many thing and the mister makes that a simple process. My favorite is on popcorn; I don't use butter and the mister helps the salt to stick to the corn! Easy to use, puts out a nice even spray. I certainly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "John C.",
      "helpful_votes": 3,
      "publication_date": 20190523
    },
    {
      "title": "Attractive, well packaged",
      "text": "Plan on using one for prepping food for air fryer with cooking oil, a second for spritzing EVOO on salads. Well-protected packaging: assembled unit wrapped in bubble wrap, then encased in sturdy box. Beautiful presentation, solid glass body with plastic top and pump unit. One works perfectly, spraying a nice fine mist. The 2nd is a bit problematic - does not spray a fine mist, some sputtering, with oil dripping from nozzle. (TO SELLER: CAN THIS BE EXCHANGED, EVEN IF IT HAW BEEN FILLED WITH OIL???)",
      "rating": 4.0,
      "verified": true,
      "author": "SMantynen",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Worked for less than 3 months",
      "text": "Our oil mister worked great for the first few months, then the pump failed and it no longer will draw oil. No amount of flushing has restored it to functionality. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "L&K",
      "helpful_votes": 5,
      "publication_date": 20190125
    },
    {
      "title": "Solid little mister",
      "text": "I purchased another mister this past week. It works as described. My other two misters that I purchased about 10 months ago, also continue to work as described. Very effective and functional product. Great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron C",
      "helpful_votes": 5,
      "publication_date": 20180902
    },
    {
      "title": "Sprays",
      "text": "I like that it is a spray and not a stream, so far it is working like I hoped it would, only time will tell if it still performs well.",
      "rating": 5.0,
      "verified": true,
      "author": "tamken",
      "helpful_votes": 3,
      "publication_date": 20190421
    },
    {
      "title": "Works Well",
      "text": "Had a little trouble figuring out how much oil should be in the bottle for the spray to work, but once I did it worked fine. This replaces a metal plastic looking spray bottle that was cheaper and worked just as well but eventually the sprayer broke. I'd now buy the cheaper one again just because it was cheaper and worked just as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol P.",
      "helpful_votes": 2,
      "publication_date": 20191216
    },
    {
      "title": "Never mists, just streams. Leaks",
      "text": "I filled it to the line as the instructions indicated with a very high quality olive oil. Pumped it up and sprayed - leaked down the sides nothing came out of the tip... Cleaned it and tried again. No leaking, but a stream came out not a fine spray. Would not recommend this product.Very disappointed in its performance. Only good thing is that it looks nice!",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Botteri",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Great product for so many reasons",
      "text": "Love this sprayer.... ordered it to use with air frying where most breaded foods require olive oil misted on crumbs to prevent them from blowing around in fryer. Easy to use with perfect pumping for spray pressure. I can’t believe how little you actually use to yield a great recipe. I love the design and the fact that this is glass and stainless. Wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Miess",
      "helpful_votes": 2,
      "publication_date": 20180907
    },
    {
      "title": "A bit disappointed.",
      "text": "You must follow the instructions for the product to work properly.....which was easy and the instructions were very clear and easy to follow. However, I was a little disappointed with the stream of the oil.....but not enough to dislike the product. After about 10 uses....it stopped working altogether, despite following the instructions about its use, releasing the pressure and wiping off the nozzle after every use......I have taken apart and cleaned, thinking it may have clogged (which didn't make me too happy after only about 10 uses).....and it still would not work. Not worth the expense.....",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Chicoria",
      "helpful_votes": 4,
      "publication_date": 20181104
    },
    {
      "title": "Nice oil mister.",
      "text": "I used it for avocado and olive oil. It worked great for misting of the oil. You do have to pump it up but that is easy enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike A.",
      "helpful_votes": 3,
      "publication_date": 20190420
    },
    {
      "title": "no stars should be an option",
      "text": "This thing does not spray anything. Hold it up to your eyes and let go, nothing will happen. A mist comes out but if you hold up your hand nothing is on it, and I mean nothing not even a shinny coating. Total waste of money, I dont like a lot of oil either, but none is just that.....nothing. I have tried using it at least a dozen times over the two months I have had it, and nothing. If you are using an air fryer it is so little mist that everything will burn quickly inside the fryer......which is the thing I got it to go with.",
      "rating": 1.0,
      "verified": true,
      "author": "t camp",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Good product",
      "text": "Good product better than buying disposable spray can with chemicals. You have to pump ut every time you use fyi.",
      "rating": 5.0,
      "verified": true,
      "author": "iparks",
      "helpful_votes": 3,
      "publication_date": 20190420
    },
    {
      "title": "Works great",
      "text": "I haven’t yet cleaned it, but it has worked well for me and delivers an overall consistent spray.",
      "rating": 5.0,
      "verified": true,
      "author": "D. B.",
      "helpful_votes": 3,
      "publication_date": 20190621
    },
    {
      "title": "I have a little child so I always worry whenever ...",
      "text": "I have a little child so I always worry whenever I cook. Food containers or all products used in cooking are always one of my concerns. This product is something I have been looking for in the meantime. It looks very clean and safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Hwahyun kim",
      "helpful_votes": 6,
      "publication_date": 20180716
    },
    {
      "title": "Worked great until it exploded!!",
      "text": "I had this oil sprayer for about 2 months and used it quite a bit. It worked great for greasing baking tins, lightly misting veggies etc. one day after using it I set it on the counter. When I was moving my spatula it tapped the mister and it exploded! There must have been some pressure left in it—glass went everywhere! While I love the idea of it, it was scary to have the mister explode, even a few weeks later I just found a glass shard I missed under a cabinet.",
      "rating": 2.0,
      "verified": true,
      "author": "Amy O.",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "I got what I was looking for",
      "text": "This oil sprayer works beautifully. Before I received the sprayer, the vendor sent an email with some helpful tips for using the sprayer. I have carefully followed all instructions, including the vendor’s tips, and have had no problems with clogging or otherwise. It is also an attractive addition to my kitchen display. This product is worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Rogers-Tomer",
      "helpful_votes": 2,
      "publication_date": 20191216
    },
    {
      "title": "Great Kitchen Gadget & Fantastic Customer Service",
      "text": "This little gadget is worth the money!! No more aerosol oil sprays loaded with propellants, etc. You will not be disappointed with how well the oil sprays out. Contacted the company and customer service was superb, friendly and very passionate about this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Margarita Cruz",
      "helpful_votes": 4,
      "publication_date": 20180816
    },
    {
      "title": "Very good quality",
      "text": "I really like this mister!!! Much cleaner than using that can spray - both for the food you eat and for your pan! It is a very nice quality product, very well made. You can see there is a lot of thought in the design and materials used. I would get it again, would make a nice gift for foodie friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Hey_it's_me",
      "helpful_votes": 4,
      "publication_date": 20180719
    },
    {
      "title": "Perfect for cast iron cooking!",
      "text": "Mists evenly and is a nice size that fits comfortably in the hand. When cooking I no longer waste pricey olive oil by pouring too much in pan and then having to wipe the excess out. I cook with cast iron so will be purchasing another to use exclusively for regularly seasoning and preserving my cast iron collection of cookware.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 2,
      "publication_date": 20181002
    },
    {
      "title": "The perfect mister for Air Frying",
      "text": "It really mists. Perfect for air Fryer. I have tried other types and they clog and spurt. This one, you pump with each use and it produces a mist.",
      "rating": 5.0,
      "verified": true,
      "author": "LaVelle Pinder",
      "helpful_votes": 2,
      "publication_date": 20190703
    },
    {
      "title": "Another great (now a must have) kitchen gadget",
      "text": "We needed a product like this for a specific recipe that we were trying out and it worked so well that we are now looking for other recipes to try it with as well as going over some of our favorite meals to see where this sprayer may enhance the recipe.",
      "rating": 5.0,
      "verified": true,
      "author": "M. H. Glaser",
      "helpful_votes": 2,
      "publication_date": 20181029
    },
    {
      "title": "Works beautifully!",
      "text": "This mister does the job, sprays a nice even coating of oil, and doesn't clog. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Foxchaser",
      "helpful_votes": 3,
      "publication_date": 20180907
    },
    {
      "title": "Works well; responsive seller",
      "text": "Happy with the purchase. Had a problem initially getting it to spray, and the seller was quite prompt and helpful in solving my problem. Works just like it should. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Eo",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great product!",
      "text": "I really like that it offers such a fine/wide mist that offers great food/pan coverage! Just compressed air - no unwanted additives either. Reusable. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Tootles",
      "helpful_votes": 2,
      "publication_date": 20181018
    },
    {
      "title": "Good quality. Works great.",
      "text": "Love the light mist. It makes it easy to control the amount of oil applied to food. Neat, clean design. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie",
      "helpful_votes": 2,
      "publication_date": 20181019
    },
    {
      "title": "LOVE!",
      "text": "We love this mister. Works exactly how it should. No mess, no clogging, etc. Easy to use with even misting.",
      "rating": 5.0,
      "verified": true,
      "author": "MellieB",
      "helpful_votes": 2,
      "publication_date": 20181115
    },
    {
      "title": "Not working for me unfortunately!",
      "text": "I have followed directions carefully and still cannot get this to work. AT best I get a very brief spray, not enough to saute a pan of stir fry, then have to re-pump 7 more times to get another brief squirt, and repeat this again just for one panful of vegetables. Its awkward trying to pull the pump nozzle back to spray. I really would like for it to work. I know I'm a few days beyond the return window. Any suggestions ? I also unscrew it to let off pressure after use. I really don't know if it's me or the sprayer!",
      "rating": 1.0,
      "verified": true,
      "author": "Maggie1950",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Didn’t work",
      "text": "Never got it to work. The one star is because it is a nice size. The instructions were clear, it just dribbled oil, not spray. If I had the time to repack it and mail it back, maybe the answer is that I got the one defective one. I went back and reread the reviews and apparently that is not the case, and some people got ones that worked on the second try. I’m tossing it in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Plateau Amazon",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Leaks",
      "text": "After used about few months, I don’t recommend to use this product; because every time I use it, it leaks really bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Keke Denton",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Did not work after first oil refill",
      "text": "The mist is too fine for my taste, but this is just a personal preference. Could not get it to mist after the first oil refill. I pumped and pumped and pumped, a little would come out and then it would just start leaking and run out of pressure. I settled for a bottle sprayer from a dollar store instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna D.",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Not as Good as I was hoping",
      "text": "I have had other oil misters and this is not the best by far. While I do like the shape (and the fact that it is glass), the seal does not seem to work that well. Oil tends to drip and it does not hold the air pressure very well.",
      "rating": 3.0,
      "verified": true,
      "author": "Donna Sandorse",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "This has completely replaced my old cooking spray.",
      "text": "Now that I own one of these, I can’t imagine going back to store-bought cooking spray— I’ve always been a little turned off by the ingredients in those cans. I love the fact that I can see inside this bottle and choose whichever kind of oil I want to fill it with. I’ve used it for baking and stovetop cooking so far, and I couldn’t be happier with how it’s working!",
      "rating": 5.0,
      "verified": true,
      "author": "Giovanna ",
      "helpful_votes": 2,
      "publication_date": 20180722
    },
    {
      "title": "Makes cooking easy!",
      "text": "I am so happy I have this now and not sure why I waited so long to get one! Makes cooking a breeze. Just make sure you follow the instructions by giving it the proper amount of pumps it needs to work properly.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristi C.",
      "helpful_votes": 2,
      "publication_date": 20190409
    },
    {
      "title": "works great for misting water!",
      "text": "Was not able to get it to spray oil without the spray patter drooping down so much of the oil ends up on the screw cap of the bottle. It sprayed water just fine. Sent it back.",
      "rating": 2.0,
      "verified": true,
      "author": "Contrary Mary",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Fantastic product!!",
      "text": "I have spent so much money on the chemical filled aerosol sprays and half of them get clogged or stop working before empty. This is SO much better! I love how perfectly even it sprays without using to mbuch oil. It’s easy to use, great packaging, and excellent customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Leroy & Butters thesquishypigs",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "Works right about a third/half the time",
      "text": "This works properly less than half the time. As we start trying to pressurize the mister, we'll sometimes hear air escaping and then it won't mist. If we try the same exact steps a few times more, it'll work at some point.",
      "rating": 3.0,
      "verified": true,
      "author": "MF",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Broke after 5 months",
      "text": "The seal on the bottle broke after a few months, however, during the time it worked, it worked well. I wrote the sell an email but received no response. Will try a Misto and see if the product works better.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Oil Mister",
      "text": "Product was as advertised, good quality, works as expected, although I also purchased a \"Pam\" olive oil prefilled mister at my local grocery store which works just as well for a much less price.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg",
      "helpful_votes": 2,
      "publication_date": 20190514
    },
    {
      "title": "Failed spraying.",
      "text": "Greasy, slippery mess. Does not spray, rather, dribbles oil. Pump a action leaks down sides of bottle. Unfortunate purchase, throwing product away.",
      "rating": 1.0,
      "verified": true,
      "author": "Sailgal59",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Clogged immediately",
      "text": "It was a nice thought, but we got one maybe two uses out of it before it clogged. We were just using it for some flavored olive oil and it worked great for the first time or two, but then it clogged and no amount of pumping was cleaning this out. We tried cleaning it, even through the dishwasher as a last resort but it's basically useless now.",
      "rating": 1.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great to cut calories when cooking!",
      "text": "The oil mister works great. About seven pumps and you can lightly coat a large pan. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "David F Rudd",
      "helpful_votes": 2,
      "publication_date": 20180908
    },
    {
      "title": "NOT a mister",
      "text": "I am sorry. This is not a mister. It sprays a steady stream of oil but not a mist like advertised. I have not had time to clean it and send it back. I am very disappointed that it does not work like advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "oldnurse",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Don't do it.",
      "text": "Great idea. Doesn't work. You get about half a second of spritz and then nothing. I have cleaned, wiped, pumped more, pumped less. Just doesn't work. Do not waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "LynnieCee",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Good buy!",
      "text": "Been using this on the regular for a while now and it still works great. It works as advertised!",
      "rating": 4.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Eliminates aerosols while minimizing oil usage",
      "text": "Currently using our Premium Oil Mister with a high end olive oil we prefer! A great match! Will be moving to another and replace all aerosol cans in our kitchen! Works great, it’s high quality, and green!",
      "rating": 5.0,
      "verified": true,
      "author": "@JimNorthway",
      "helpful_votes": 2,
      "publication_date": 20180719
    },
    {
      "title": "Sprays a fine mist of oil.",
      "text": "Have only used a couple of times. Sprays a fine mist of oil. Completely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "This is not only to be used as dispenser for ...",
      "text": "This is not only to be used as dispenser for cooking oil but i use it for cold water spray for face to refresh me , especially now that the weather is too hot.. And also it made from glass not plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Stella ",
      "helpful_votes": 2,
      "publication_date": 20180730
    },
    {
      "title": "Stopped Working",
      "text": "After a few months, the seal broke and will no longer hold pressure.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Reliable and we'll made.",
      "text": "This product is awesome. Works every time and will save a fortune on the excess olive oil I would use applying it without the mister.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 2,
      "publication_date": 20181008
    },
    {
      "title": "Great, but lid broke",
      "text": "Lid broke within 3 months. I love many things about it - glass, size, works great - but the ring on the plastic lid broke, so you can't use it to create pressure anymore. I'm hoping I can find contract information and the company will replace the lid. Other than that, this has been great!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Premium Oil Mister",
      "text": "Great mister! The only problem, it’s a bit pricey! Would love to have a second one to store two oils, as we’re using it to mist oil items for the air fryer.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "messy",
      "text": "oil leaks from the nozzle and finds its way over the bottle. It's another cleanup I wasn't looking for.",
      "rating": 3.0,
      "verified": true,
      "author": "David Brandes",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "messy",
      "text": "I was very disappointed as I expected this to be a good mister. It is not easy to pump and oil leaks out of the top and drips on my counter. Difficult to push and it clogs up if you push too much. Not what I expected. Amazon at least stood by and gave me a refund for this defective product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "save your money",
      "text": "I used a light oil and when you want to spray the nozzle does not move. Take the top off and it is filled with oil. Worst purchase ever made.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra Auslander",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "The seller is very customer service oriented!",
      "text": "The mist is just like that of an aerosol can.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan Theresa Royer",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Don’t Buy!",
      "text": "This thing was a mess, no instructions in the box, very hard to get a good consistent spray of oil from nozzle.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Hassle to clean and store.",
      "text": "I like the concept, but wonder if a simple pump trigger wouldn't be cleaner and easier overall.",
      "rating": 2.0,
      "verified": true,
      "author": "rusty kennedy",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "I suggest you not buy this",
      "text": "The first time I used it, it did not spray a mist (but narrower) & it also leaked a bit. I’m not optimistic about it getting better.",
      "rating": 1.0,
      "verified": true,
      "author": "Dorothy of Oz",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Disappointing",
      "text": "No matter how many times i pumped it would not spray but for an extremely short time.",
      "rating": 1.0,
      "verified": true,
      "author": "Virginia C. Cunningham",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "The Perfect Product",
      "text": "This misting sprayer should be not only be a mandatory tool for every conscientious chef but it is so eye appealing, it should grace every dining table. The sophisticated design is perfect...not too large but holds sufficient oil that one can easily use it for cooking, air frying, or simply garnishing a salad. The quality and care going into the product is quite evident and is a real bargain for the price. Any questions can be easily answered on their website and the seller seems more than happy to quickly and ably assist anyone who purchases the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Sale",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "Great product!!!",
      "text": "I love this glass sprayer! I’ve used other sprayers before but this is the best one! I love the design. It sprays beautifully not spitting out like other products I used before. And so easy to clean and refill! I will be purchasing more for gifts in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "eanquiel",
      "helpful_votes": 5,
      "publication_date": 20180721
    },
    {
      "title": "Great mister--great customer service.",
      "text": "I purchased this in April and loved it, but was disappointed when the top broke. This meant I couldn't pump it up. I contacted the company and they replied within a day offering to mail me a new top. I received it a few days later. Communication with them was very polite and responsive. I'm very happy to have my mister working again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharilyn Rediess",
      "helpful_votes": 3,
      "publication_date": 20190410
    },
    {
      "title": "Best Mister, easy to use!  Perfect for diet cooking!",
      "text": "I am delighted with the Olive Oil Mister. The Seller even emailed me instructions on how to use it. If you follow the instructions correctly, this mister works great. In no time the cost will be covered by me not buying canned olive oil sprays. This product is perfect for dieting!! I would highly recommend this mister to my family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Love it!",
      "text": "Definitely recommend if you dont want to keep buying aerosol cans from the store! We have a son with allergies and using straight olive oil has been so much safer, better for us, and the environment. Not to mention saves us money since we always have it on hand! My kids love pumping it before I spray pans.",
      "rating": 5.0,
      "verified": true,
      "author": "angelacez",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Works Well & Saves Olive Oil",
      "text": "Always wanted an Olive Oil Mister. I read about this product reviews and decided to try it. So far, it has worked out for me. I cut the use of oil about 50% or more. It is easy to use if you follow the instructions and over fill the bottle. I use it daily and am very satisfied with the mister. I will probably order another one for my balsamic vinegar. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "808to702",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Great product.",
      "text": "This is a well-made, properly-functioning product. I've purchased several similar products that were flimsy and/or did not function as described. I've been using this item for several months now, and it's exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 3,
      "publication_date": 20190528
    },
    {
      "title": "Good to Use with Air Fryer!",
      "text": "Bought this to use with my air fryer. Works quite well; however, you need to remember to loosen the top and allow the pumped in air to escape after each use. Haven't cleaned it yet, so I cannot comment on \"Easy to Clean.\" Would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Not #1 Mom",
      "helpful_votes": 2,
      "publication_date": 20191021
    },
    {
      "title": "Great Product",
      "text": "What a great experience. I have been wanting one of these for a while now and saw that Home Delighted was selling these and figured why not give it a go. At first I had an issue figuring out how it worked but after they so graciously sent me the video I was all set. I wish all sellers had this amazing customer service. They are truly wonderful and very helpful. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "wanderlust23",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "Beautiful Product and Incredible Customer Service",
      "text": "My original sprayer did not work correctly. The seller contacted me and said occasionally this happens and she wanted to send me a replacement. She went above and beyond in trying to locate me and I had a replacement in 2 days. I am very pleased with the new sprayer. It is a beautiful product and sprays well. Just what I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 2,
      "publication_date": 20181008
    },
    {
      "title": "Looks nice and works well!",
      "text": "Having an oil sprayer is so helpful! I did not want to use aerosol sprays like Pam. This sprayer works well and attractive. I bought an air fryer and needed this to use with it. I like that you have a max fill line and can see exactly how much is in it!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth E. Santana",
      "helpful_votes": 2,
      "publication_date": 20190430
    },
    {
      "title": "NICE PRODUCT !!!!",
      "text": "Easy to use - just takes a little while to get used to spraying a light coating of olive oil instead if pouring it when I cook. But this will definitely help me not be so wasteful with olive oil. A nice product I should have bought ages ago.",
      "rating": 5.0,
      "verified": true,
      "author": "JoelJK",
      "helpful_votes": 2,
      "publication_date": 20181017
    },
    {
      "title": "Perfect spray every time",
      "text": "I have had several oil misters over the years and have thrown them all away. Now I Have finally found the best mister of all! Perfect spray every time! I am purchasing several more to give as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Tasmi",
      "helpful_votes": 2,
      "publication_date": 20190406
    },
    {
      "title": "Perfect Mist",
      "text": "This is more expensive than most oil sprayers...this is a quality mister, and I LOVE it. Excellent craftsmanship, and it really does MIST!",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Lane",
      "helpful_votes": 2,
      "publication_date": 20190518
    },
    {
      "title": "Quit Spraying after 3 Months",
      "text": "I was very happy with this purchase in the beginning. But now after about 3 months the thing won't spray anymore, The top button won't push down . Very disappointing. I could put up with cleaning it - which is a pain - if it continued to work. It was $30 in July, when I bought mine, $30 again in August when I bought one for my daughter. I see today - Prime Day - it's only$15. Not happy",
      "rating": 1.0,
      "verified": true,
      "author": "SLR",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Perfect sprayer!",
      "text": "This oil mister works great as a cooking spray! I am thinking about getting another one to use for oil-based salad dressing.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy and John",
      "helpful_votes": 2,
      "publication_date": 20190401
    },
    {
      "title": "Provides oil sputter - not mist",
      "text": "Sputters out oil instead of a mist with a dribble down the side of it so you get oil everywhere but where you want it. Brand new it works as if it’s old and clogged. I’d have returned it if I thought I could now that’s it’s been washed and filled with oil and used. It feels very high quality though, when you hold it - it just doesn’t work.",
      "rating": 2.0,
      "verified": true,
      "author": "SAE",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "I Wish I Liked This",
      "text": "Lovely idea to help save the environment. Unfortunately the cap broke off and then the sprayer got too clogged to work efficiently.",
      "rating": 1.0,
      "verified": true,
      "author": "MrsJohnsonfromWI",
      "helpful_votes": 2,
      "publication_date": 20181206
    },
    {
      "title": "Great product",
      "text": "I am using these for all of the different oils I use. Saves lots of money!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Luvnbirds1",
      "helpful_votes": 2,
      "publication_date": 20190402
    },
    {
      "title": "Best mister I have found so far!",
      "text": "I have tried several misters. This one is the first one that has not disappointed. In fact when I broke the top cap, they were kind enough to send me a new one. So glad to have it working again! Highly recommended@",
      "rating": 5.0,
      "verified": true,
      "author": "myotisfriend",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Lovely jar, great oil mister",
      "text": "First of all this is an elegant little glass jar that looks great on my counter. I filled it with olive oil to the fill line, pumped it 7 times and sprayed it on my fish. It was a perfect spray with no sputtering or drips. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Michele A Fodrini",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "Lets you use only  the oil.",
      "text": "Great for olive and avocado oils. No artificial ingredients needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita",
      "helpful_votes": 2,
      "publication_date": 20190408
    },
    {
      "title": "Oil Mister",
      "text": "Got this to use with my air fryer and it works like a charm. French fries were crispy and hardly any oil to make them that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindee Peters",
      "helpful_votes": 2,
      "publication_date": 20180910
    },
    {
      "title": "Best mister ever!",
      "text": "I have had a few misters, but this is by far the best! The ones I get at the Bed Store always clogged and stopped working within a few months. This one hasn't given me a single problem. I bought three of them! I keep two by my stove (one with olive oil and one with peanut oil) and one by my air fryer. Just an excellent product and the seller is awesome! Had a slight problem but the issue was resolved immediately to my complete satisfaction.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth M. SchaeferTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Fine even mist!",
      "text": "Nice fine, even mist. Perfect for moderation and full coverage. Not spotty at all.",
      "rating": 5.0,
      "verified": true,
      "author": "PG",
      "helpful_votes": 2,
      "publication_date": 20190318
    },
    {
      "title": "No Clog",
      "text": "Sprays a nice mist. Does not clog or spray a stream of oil. Easy to fill and keep track of quantity in bottle. Best dispensor I have used to date.",
      "rating": 5.0,
      "verified": true,
      "author": "Wehrli",
      "helpful_votes": 2,
      "publication_date": 20180925
    },
    {
      "title": "Worked for barely a month",
      "text": "It lasted about a month before it stopped spraying, despite me being very cautious about following the directions.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20191124
    }
  ],
  "product_meta": {
    "title": "Premium Glass Bottle, Non-Aerosol Olive Oil Mister and Oil Sprayer for Cooking with Clog-Free Filter by Home Delighted - 100% Reusable in Large Capacity - Stainless Steel",
    "rating": 3.8,
    "specifications": {
      "Product Dimensions": "2.75 x 2.75 x 7.75 inches",
      "Item Weight": "10.4 ounces",
      "Manufacturer": "Home Delighted",
      "ASIN": "B07C6PV31B",
      "Item model number": "8541978296",
      "Customer Reviews": "3.8 out of 5 stars142 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#195,895 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 26, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Kitchen & Dining",
      "Oil Sprayers & Dispensers",
      "Oil Sprayers"
    ],
    "price": ""
  }
}