{
  "website_summaries": [
    {
      "verdict": "A premium evaporative cooler that is easy on the eyes.",
      "pros": [
        "High-density media delivers 80% more evaporation surface compared to standard options",
        "Direct connect to hose",
        "Costs only $0.03 per hour to operate"
      ],
      "cons": [
        "Plastic housing offers limited durability"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Husband approved (wife thinks it’s an eyesore)",
      "text": "Living in a hot desert state, any opportunity for cool relief is greatly appreciated. Even with temperatures approaching 110+ degrees, this evaporative cooler makes it possible to sit outside and enjoy (all right tolerate) the heat. My wife thinks it is an eyesore but from my perspective, it is a welcomed addition to the patio!",
      "rating": 5.0,
      "verified": true,
      "author": "Glh",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Misrepresented sale.",
      "text": "Item was sold and bought as new. Unit received was clearly not new. The Hessaire water cooler fan had exterior marring (top/side) and the bottom had been apparently dragged with shearing of plastic housing. This is clearly a used unit sold as new. Three pronged plug was wrapped in the back of the unit, but clearly not protected from possible damage in shipment. Very disappointed with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 2,
      "publication_date": 20200818
    },
    {
      "title": "Great evap",
      "text": "Works great. Very portable. Using in Phoenix,Az so it goes through the water tank in about 45 minutes but that is really good that it can go that long. The hose connection lets it run for hours. Worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Armistead",
      "helpful_votes": 2,
      "publication_date": 20200728
    },
    {
      "title": "It looks cheap but works great!",
      "text": "I was disappointed at first because of the built quality when I took it out of the box. After everything got setup and turn it on, I was really impressed about the cfm range and strength of cold air.",
      "rating": 5.0,
      "verified": true,
      "author": "Juno",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Flimsy",
      "text": "Poorly made. Cheap Flimsy plastic. Doesn’t seem to cool all that well either. Will not recommend to a friend.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Williams",
      "helpful_votes": 2,
      "publication_date": 20200808
    },
    {
      "title": "Outside parties",
      "text": "It’s a bit loud and not exactly what I had planned. Perfect for outside parties though.",
      "rating": 3.0,
      "verified": true,
      "author": "Tracy Hendricks",
      "helpful_votes": 2,
      "publication_date": 20190807
    },
    {
      "title": "Cool air on a hot lanai.",
      "text": "This swamp cooler blows cool air at a very high speed. Also, the oscillating feature is nice. You can control the air flow up, down, or straight on. This is like a ,rage suitcase size, extra large on wheels. Very portable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Grant",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "My product doesn’t work",
      "text": "I received the portable cooler around 2 weeks ago, immediately did the return process and still nobody has not contact me Yet I was very exited with this purchase and now I’m very mad with all this people 😡😡😡I don’t recommend this product just put your money in he trash 😡😡😡",
      "rating": 1.0,
      "verified": true,
      "author": "Heidy lopez",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Fantastic",
      "text": "I got this for my husband for work. He loves it all the other technicians come over to cool off. A little pricey but it was definitely worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy Jones",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Bad experience",
      "text": "It takes too much water And it doesn’t give enough cool air👎🏽",
      "rating": 1.0,
      "verified": true,
      "author": "Moin ijaz",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Very happy overall.",
      "text": "I am using the MC37V to cool a 400 square foot garage facing south. Summer temperatures in Tucson, AZ can get crazy hot. The best that I have done is a 28.2 degree temperature difference: Ambient temperature: 110 Inside garage: 81.8 OEM media from HESSAIRE is expensive. About $80. The fit is excellent, and there is no cutting or trimming necessary. Replacement pump is about $30. The pump seems to be the weakest point.",
      "rating": 4.0,
      "verified": false,
      "author": "dev1",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Not worth buying",
      "text": "My machine is for water everything's on and a does not really cool at all",
      "rating": 1.0,
      "verified": false,
      "author": "Peggy courtney",
      "helpful_votes": 0,
      "publication_date": 20200607
    }
  ],
  "product_meta": {
    "title": "HESSAIRE MC37V Portable Evaporative Cooler, 3100 Cubic Feet per Minute, Cools 950 Square Feet",
    "description": "The Hessaire 3,100 CFM Evaporative Cooler is compact in size, pleasing in aesthetics and the performance exceeds coolers of a much larger size. This performance is achieved through expanding air-intake areas to the hi-density XeL50 rigid media. These coolers have 3 media panels instead of a single panel found on most mobile coolers. 3 panels allow more air-intake area and reduce pre-rotation of the air to the prop, which translates into lower static pressure and more efficient air delivery to the prop. The hi-density XeL50 media provides 80% more evaporation surface compared to regular density media. This means higher evaporation efficiency and cooler temperatures.",
    "rating": 3.9,
    "feature_bullets": [
      "PORTABLE - 4 heavy duty locking casters for cooling home, patio or workshop spaces up to 950 square feet",
      "COMPACT YET POWERFUL – 37x17x24 inches; 3,100 Cubic Feet per Minute (CFM); 3 fan speeds and oscillating louvers to ensure even distribution, wide coverage and comfort",
      "EASY TO OPERATE & SIMPLE TO MAINTAIN – 3 simple rotary controls allow the fan (Off, Hi, Med, Low), pump (On, Off) and oscillation motor (On, Off) to be controlled independently",
      "MANUAL & CONTINUOUS FILL – Utilize the Continuous Fill option by attaching a household hose with the included float adapter, eliminating the need to manually watch and fill the water tank",
      "SUPERCHARGED, ECONOMICAL COOLING – 3-sided rigid high-density cooling pads for increased evaporative surface area generating cooler air"
    ],
    "specifications": {
      "Manufacturer": "Hessaire",
      "Part Number": "MC37V",
      "Item Weight": "40 pounds",
      "Product Dimensions": "34 x 17 x 24 inches",
      "Item model number": "MC37V",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Dark Gray",
      "Wattage": "250 watts",
      "Item Package Quantity": "1",
      "Air Flow Capacity": "3100 Cubic Feet Per Minute",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B07CJWDGDJ",
      "Customer Reviews": "3.9 out of 5 stars25 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#83,713 in Home & Kitchen",
      "Date First Available": "April 20, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Evaporative Coolers",
      "Tools & Home Improvement",
      "Air Conditioners",
      "Heating, Cooling & Air Quality"
    ],
    "price": 399.0
  }
}