{
  "website_summaries": [
    {
      "verdict": "Whether you're interested in multitasking or playing PC games with a buttery smooth refresh rate, you'll have a hard time finding a better widescreen curved monitor.",
      "pros": [
        "Razor-thin bezel",
        "Extra-wide viewing angle",
        "Convenient pair of USB-C ports",
        "Gorgeous resolution",
        "Easily displays 2 PCs at once",
        "Excellent for gaming",
        "Adaptable stand for maximum comfort"
      ],
      "cons": [
        "Its price is the only off-putting thing about this curved monitor"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Has limitations but good overall",
      "text": "Excellent monitor and definitely good for multitasking. But I'm simply not blown away by it. Bad for gaming (unless the game natively supports 32:9 aspect ratio). Also not that good for multimedia like youtube and Netflix. Before you buy, you need to first understand what you're getting. And once you do, this is an excellent monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Reader777",
      "helpful_votes": 43,
      "publication_date": 20190908
    },
    {
      "title": "Great picture...sound crapped out in a month after purchase",
      "text": "I was so excited to get this monitor. The picture does look great and I like having the built-in KVM. but 32 days into my purchase and the sound goes out and I'm getting the runaround from Samsung as to which department needs to fix it. Looks great, but I have no sound from anything I connect to it which makes this a useless purchase. I bought two at the same time and now I'm just waiting for the sound to stop working on the other one.",
      "rating": 1.0,
      "verified": true,
      "author": "Bacarri",
      "helpful_votes": 24,
      "publication_date": 20191120
    },
    {
      "title": "Dead pixel on day 30th!",
      "text": "Dead pixel on day 30th, thank goodness I could still return it. Very sad...",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 25,
      "publication_date": 20191126
    },
    {
      "title": "Nice picture,  but that's about it.",
      "text": "The picture is great! The KVM is Joke. The PIP is ok, but switching the mouse via the kvm is very cumbersome. Manually switching between inputs is not easy. It really only recognizes one video input. I like the monitor for its size and clarity, thus the 3 stars. The rest of the features are worthless. I am somewhat disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Raul",
      "helpful_votes": 14,
      "publication_date": 20191219
    },
    {
      "title": "The perfect monitor for Business & Multitasking",
      "text": "The best monitor that I have ever purchased for work/business or pure multi tasking. I have 4 monitors set up at my office, but was easily able to replace all 4 with this 1 monitor with the ability to split and resize multiple screens within the 1 monitor display. And takes up far less space on my desk!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephan Kleis",
      "helpful_votes": 13,
      "publication_date": 20200401
    },
    {
      "title": "Multitasker dream display",
      "text": "I'm using this product for work and entertainment. It was more than enough room for e-mail, spreadsheets, and browser. I like everything except having to \"register\" to get the custom software (Easy Setting). Having said that, it is worth getting since it manages the whole thing. This puppy is *HUGE* - get two people to finagle it around if you can. Take your time with assembly. I am still getting cables since I don't have a bunch of USB-C yet, but that's what Amazon is for - right? /s I know the monitor can handle higher refresh rates - but the laptop I am using doesn't have a dedicated graphics card, so 59 Hz it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Spy Hunter",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Measure First",
      "text": "This is a fantastic display. Works great with my MacBook Pro. But ... it is so much deeper than you might think. Read the specifications, ask questions, and know concretely where the display will be relative to your desk, your face, and other items. I'm having to do quite a bit more adjusting to my workspace to accommodate, including ordering a work surface that is a foot (!) deeper. No regrets here, but do your homework.",
      "rating": 5.0,
      "verified": true,
      "author": "RH",
      "helpful_votes": 2,
      "publication_date": 20200923
    },
    {
      "title": "Resolution is terrible",
      "text": "The resolution on this monitor is so bad, I have to send it back. It is like having a monitor from 20 years ago with VGA (even though I'm using USB-C with a 2018 MacBook Pro. Very disappointed as the real estate is impressive and I had high hopes. But it is not functional for basic business use (e.g., google mail/calendar, slack, spreadsheets, etc.) Also for Zoom the video is fuzzy.",
      "rating": 1.0,
      "verified": true,
      "author": "Roark",
      "helpful_votes": 2,
      "publication_date": 20201005
    },
    {
      "title": "Vertical 1080p",
      "text": "For daily use, the 1080p is amplified due to the screen size and visually it will look more pixelated.",
      "rating": 3.0,
      "verified": true,
      "author": "dlee",
      "helpful_votes": 3,
      "publication_date": 20200522
    },
    {
      "title": "MacOS Sound Issues",
      "text": "This monitor has issues with macos volume controlls, ... meaning you can't change the volume from the main volume control or the keyboard on macos when attached via an HDMI cable. The KVM features are a bit confusing, but work great when you finally figure them out. This monitor feels narrow and long but is actually a good size vertically. The huge width makes it feel smaller vertically than it is. Overall, a good monitor. If you have a nice set of speaker you use instead of the monitor's sound, you probably won't have any problems with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Gene",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Resolution...",
      "text": "All in All, a nice monitor. BUT, the limited resolution settings does not allow me to size my application screens down to the size that I want. Even at the smallest level, the presentation of the screen is too big. If they would allow for more options I would love it. I have two LG monitors at my office that I daisy chain off my MacBook Pro, and the experience is better. I had hoped that the single monitor would replace the need for two, and give me a similar experience. Its just not the same - and is all about the limited sizing and resolution options.",
      "rating": 5.0,
      "verified": true,
      "author": "CW",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Good thought, unfortunate resolution design flaw.",
      "text": "Looks cool, but I’m disappointed with the vertical resolution. I had to send it back to get one that offered a better picture.",
      "rating": 3.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 3,
      "publication_date": 20200125
    },
    {
      "title": "Great product",
      "text": "The image looks great and now I can handle multiple spreadsheets at the same time without the monitor image differences. Great for stock handling and excel works. The internal speakers do the job, for watching videos or hear music. The speakers are not surrounded but you don't need to by an extra set of speakers and have them clutter the area if you don't need to unless you need to hear that game or movie really good. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Buy it now don't wait.",
      "text": "This item is the best thing . If you are a gamer you have to buy it. There are no words.",
      "rating": 5.0,
      "verified": true,
      "author": "JAMES E. PATTON",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Great Monitor for Multi-Tasking",
      "text": "Absolutely love this monitor! Set up is easy. If you need to have multiple documents open at one time, this is the monitor for you! I am now totally set-up to work remotely!",
      "rating": 5.0,
      "verified": true,
      "author": "DawnS",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Perfect for running windows and Mac at the same time",
      "text": "Perfect for running windows and Mac at the same time",
      "rating": 5.0,
      "verified": true,
      "author": "Larry P.",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great size but quality of image could be better",
      "text": "Great size but quality of image could be better. To use with PS4 is not good. To use with computer is awesome!",
      "rating": 4.0,
      "verified": true,
      "author": "LUIZ B.",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great picture and sound quality + split screen between 2 PCs",
      "text": "I love it so much! The picture and sound quality is great! You can also connect 2 PC’s and do a split screen between both if you prefer that setup. May hook up my gaming desktop as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby Tallent",
      "helpful_votes": 3,
      "publication_date": 20201022
    },
    {
      "title": "USB-C/HDMI Connections Failed - Too Wide Hurts My Neck",
      "text": "This should have never been bought - The USB-C/HDMI was not working most of the time, picture was bad that you could see the pixels and dots on the faces. As it's way too wide, it hurts my neck. I bought this baed on the YouTube reviews - they all look great, but once I setup on my desk, I knew it's bad already. The stand blocked my right hand with mouse access. The unit looks vey plastic with low quality. I am returning it!",
      "rating": 2.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20201120
    },
    {
      "title": "Good when it works... If only it worked every time",
      "text": "It is good when it works. But randomly it will just stop displaying and search for a display. I know it is the monitor because I have two computers plugged in and it can’t find either. Then it magically will work after 15 minutes. Then to top it off, it only has an auto search on the input. It is 2020. What 12 year old designed this so you can’t just change it to the input you want? It will be going back very soon.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Excellent Monitor and Great Value!",
      "text": "Monitor sits between two other monitors to afford me 103\" of real estate to work and game. Fast refresh rate makes gaming enjoyable and I am able to open multiple .xls and emails and work efficiently. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "donsabai",
      "helpful_votes": 0,
      "publication_date": 20201210
    },
    {
      "title": "Don’t buy it if you have a MacBook Pro 16”",
      "text": "This product has a 95W usb-C port that should give power to a 16” MacBook Pro. That’s the main reason why I bought it. Well, it burned not one but TWO computers in two weeks of usage. Both of them just stopped charging while the ports were working fine for connectivity. Tried both SMC reset and P-ram reset with assistance and NOTHING WORKED. For some strange reason the same port and cable didn’t fry my 13” MacBook Pro.",
      "rating": 1.0,
      "verified": true,
      "author": "Federico Francioni",
      "helpful_votes": 0,
      "publication_date": 20201217
    },
    {
      "title": "Beautiful monitor!",
      "text": "I’d give it 5 if it had a monitor! Otherwise love it! Love that I can hook up my Mac and windows pc. Love the enormous landscape! Highly recommend it if you work from home!!",
      "rating": 4.0,
      "verified": true,
      "author": "Ron Gambino",
      "helpful_votes": 0,
      "publication_date": 20201203
    },
    {
      "title": "Great investment",
      "text": "The size is great, the picture is amazing and the Prime price savings was even Better. Replaced my two monitors and the space savings is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Otis Freison",
      "helpful_votes": 0,
      "publication_date": 20201110
    },
    {
      "title": "great for productivity, not made for real gaming",
      "text": "great monitor for work applications, unable to keep up with 2020 pc gaming demands",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201212
    }
  ],
  "product_meta": {
    "title": "Samsung CJ890 Series 49 inch 3840x1080 Super Ultra-Wide Desktop Monitor for Business, 144 Hz, USB-C, HDMI, DisplayPort, 3-Year Warranty (C49J890DKN)",
    "description": "Simplify your workday while enjoying an amazing screen experience with the Samsung C49J890DKN 49-Inch Curved Ultra-Wide Monitor for Business. This productivity machine features a spacious, panoramic screen and a 32:9 aspect ratio – the equivalent of two 27-inch 16:9 monitors configured side-by-side. Use it to replace multiple monitors and dramatically streamline your workstation – no more misalignment, extra cables, unnecessary stands, or bezels to clutter your view. The C49J890DKN features an 1800R ultra-curved screen, which more closely matches the way the human eye views objects and helping keep eye fatigue to a minimum during long working hours. The VA panel also accommodates wide viewing angles, ensuring a sharp picture even when viewed from off-angles. The monitor also makes workstation setup easy: an integrated KVM switch lets you easily control two computers from a single set of peripherals, while two USB-C ports let you connect the monitor to a wide range of devices. Finally, a 144Hz refresh rate delivers lower cursor lag and eliminates blurring, ghosting, and juddering, so users can keep track of even the fastest moving content.",
    "rating": 4.4,
    "feature_bullets": [
      "Super ultra-wide business desktop monitor offers a spacious, panoramic 49-inch screen and a 32:9 aspect ratio allowing you to choose between one huge desktop space, side-by-side, or picture-in-picture desktops from up to 2 computers, all on an adjustable stand with height, swivel, and tilt features – combine to enhance productivity and a streamline your workstation",
      "1800R ultra-curved screen provides an immersive, natural viewing experience for enhanced productivity and reduced eye fatigue. VA panel delivers a clear, sharp picture even when viewed from off-angles",
      "Two USB-C ports for easy connectivity to multiple devices, with an integrated KVM switch enabling control of up to two computers with a single set of peripherals",
      "144Hz refresh rate delivers incredibly smooth movement and helps eliminate blurring and ghosting – great for fast-moving content",
      "3-Year Business Warranty with extended warranties available for purchase"
    ],
    "specifications": {
      "Standing screen display size": "49 Inches",
      "Max Screen Resolution": "3840 x 1080 Pixels",
      "Number of USB 3.0 Ports": "3",
      "Brand": "Samsung Business",
      "Series": "C49J890DKN",
      "Item model number": "LC49J890DKNXZA",
      "Item Weight": "33.3 pounds",
      "Product Dimensions": "47.4 x 18.7 x 12.4 inches",
      "Item Dimensions  LxWxH": "47.4 x 18.7 x 12.4 inches",
      "Color": "Charcoal Black and Titanium",
      "Manufacturer": "Samsung",
      "ASIN": "B07CS4KF7J",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 27, 2018",
      "Customer Reviews": "4.4 out of 5 stars83 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#15,748 in Electronics"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": 999.99
  }
}