{
  "website_summaries": [
    {
      "verdict": "A reliable, easy-to-use trackball mouse that won’t break the bank and is compatible with most OS devices.",
      "pros": [
        "Adjustable DPI switch buttons let you customize how sensitive the mouse is to movement",
        "Traditional scroll wheel is easy to reach and operate",
        "Trackball can be removed from the mouse for cleaning, which is a unique feature among trackball mice"
      ],
      "cons": [
        "Some consumers say the trackball feels loose or difficult to control after a few months of regular use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor motion tracking",
      "text": "I really hopped this would be an alternative to another brand of trackball mouse that tend to only last me a year or so. But even after letting it break in use for a couple weeks, the tracking on this one is still erratic. If I press on the ball fairly hard with my thumb its almost bearable tracking, but that defeats the purpose. Trying to target a particular cell of a large spreadsheet or a particular section of text to cut and paste is nearly impossible. (Yes I've taken ball out and cleaned and looked for debris on the sensor lens, with no improvement.) Mash ball... finally line up with submit button.. go.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 6,
      "publication_date": 20181209
    },
    {
      "title": "Right mouse button sticks",
      "text": "I liked the idea of not having to buy batteries for the trackball and the right mouse button on my Logitech M570 was sticking, in the past, that meant it would give out entirely and stop functioning. The perixx trackball has a sticky right button when I unpacked it. The one I got for my son seems fine so far. With no screws to undo, you can't open it up to adjust or clean the contact. It would have been a pretty good trackball otherwise.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert C. Frisch",
      "helpful_votes": 9,
      "publication_date": 20180809
    },
    {
      "title": "In short, it's awful in every measurable way, but it works.",
      "text": "My last trackball stopped working and this one works. There. Now that we've gotten the positive out of the way... It's uncomfortable. It's not very sensitive, even when turned all the way up. The movement lags. There's very little subtlety to it; you're either scrolling from one side of the screen to the other or you're not moving at all so don't even think about anything requiring accuracy. The rubber pads on the bottom aren't very tacky so it slides all over the desktop. In short, it's awful in every measurable way, but it works.",
      "rating": 2.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 2,
      "publication_date": 20200426
    },
    {
      "title": "Too much hassle.",
      "text": "I love this mouse. I use it for work 35 to 40 hours a week. I clean it weekly. The first one I purchased in November of 2018. It lasted until about March 2019 before the ball would no longer track and would erratic. The company sent me a replacement as it was within warranty period. Here we are in August, and the replacement is doing the same thing. Some times it works great, next minute I have to move the ball several times to get any response. I should not have to replace every 3 to 4 months to keep the same standard. The company was nice enough during the replacement, but I think I'm done with them.",
      "rating": 2.0,
      "verified": true,
      "author": "K. B.",
      "helpful_votes": 2,
      "publication_date": 20190805
    },
    {
      "title": "Not ergonomic",
      "text": "They missed the mark with this. There’s nothing ergonomic about this. If you want to make it comfortable, it’s not how wide you make it. You’re almost there with the shape, but what it needs is a higher hump. Logitech’s Ergo almost has the idea so you should start from there. The trackball feels rough during use (shouldn’t be like this when new) but it can be mostly alleviated by popping the ball out and cleaning it and the socket with pledge. Normally you don’t have to clean trackball mice until several months of use, but not this one.",
      "rating": 2.0,
      "verified": true,
      "author": "I4Y",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Don’t buy, it’s a piece of junk",
      "text": "Bought 2 of these. One for home and one for work. They both quit working within a week of each other. The ball intermittently stops moving the cursor or the cursor jumps. I’ve tried cleaning the balls and optic pickups inside ball socket and it works for a day maybe then quits again. I even tried resetting cursor speed and removing and reloading software and nothing has worked and Amazon says it’s too late to return. I’ve had them for only 7 months. So do yourself a favor and find a different manufacturer",
      "rating": 1.0,
      "verified": true,
      "author": "Neil N.",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Oh Finally. After one year and 2 months - the worthless thing gave up. Off my desk",
      "text": "Waste of money - economics was lost in the design. I hope those guys were fired for such an oddball layout. Luckily this piece of art will look better in the trash. It almost lasted as long as Logitec. I bet this is their handy work. Anyway, if you like out of date crap on your desk, this will do it for you. Time to put the mouse in the past. Shouldn't we be moving the cursor with our minds by now? I still have a desktop! Aren't we past that yet?",
      "rating": 1.0,
      "verified": true,
      "author": "Biff2u",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Revised again to aweful!",
      "text": "I've been using trackballs for over 20 years, primarily Logitech. Love them. This model looks like an exact replica but it isn't and doesn't work correctly. I can't spin the ball and have it move the cursor. You have to actually keep pressure on the ball while rotating it, and even then it skips movement sometimes. [update] Don't buy this brand/model. It plain doesn't work. I thought I had solved the problem but hadn't. It can take 30-40 seconds to get the mouse across both screens. Unusable! You can give the ball an entire rotation, and the caret barely moves. I may have to start using a regular mouse.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken & Sharon",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "not a gamers mouse",
      "text": "have used the perixx wired trackball mouse for quite some time now. having use the logitech for so long that it finally gave out, wanted to stick with the trackball design and didn't want wireless as we have several machines and mice going all at once. the perixx has steadily lost its ability to... well, track, the trackball. one can spin that ol' ball for all one is worth and there is sloggish or no response at all from the cursor / pointer. finding a need to purchase another now, but won't buy this one again.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "I'm On The Roll..!",
      "text": "I couldn't wait to try this new track ball, and I didn't expect to find it on my door step so early in the morning.. I was messaged it would arrive between 2:00pm & 8:00pm.. Well any way this is not my first tract ball and I don't think it will be my last... This trackball has a bunch of new features and works just great.. If you have no experience with a track ball no worries it will come in short time.. Everyone's first time is a little awkward...! This one has to be the best so far...! I'm sure you will find it a lot easier after you have used it for a while... Enjoy ...!",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary E. Mohrmann",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "The track ball does not work at all.",
      "text": "I wanted to use the product for everyday. I do my e-mails, edit pictures, do book-keeping just a lot of general things. I do not do gaming. Track ball does not work . I have to roll it over and over to get it to move at all and then it is very spastic. I would never buy this item again or anything else from this company. I will stick to Logitech. I have never had a problem with any of the things I have bought from them. I have a fairly new computer so it is not the computer and I am good at what I do.",
      "rating": 1.0,
      "verified": true,
      "author": "Dorsle",
      "helpful_votes": 2,
      "publication_date": 20190311
    },
    {
      "title": "Wheel issues",
      "text": "At first I liked it due to it's shape and me having large hands but even at the beginning, the wheel never worked right. Sometimes it would scroll 1 step but other times it would jump 2-3 steps and you had to scroll back up. NOW after 6 months, I'll be scrolling up and it keeps snapping back scrolling down while I'm still scrolling upwards. It's really annoying. The track ball is great and is responsive, the rubber pads on the bottom have never given me any issues. It's primarily the wheel and that's really bad for gaming and annoying for reading.",
      "rating": 3.0,
      "verified": true,
      "author": "Wicasawakan",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great choice, highly recommend it.",
      "text": "The Perixx wired trackball is less expensive than many other brands, but don't let that fool you. It's still functions like a high end trackball. The ball fits into the mouse firmly, yet still has a very smooth feel to it when rolled. The device has all the necessary buttons for web browsing and gaming; forward, backward, scroll wheel, scroll button, left mouse button, right mouse button. The best feature is the resolution buttons located conveniently at the top of the mouse that adjust how fast the mouse cursor moves with the wheel. While those buttons are on top, they do not get inadvertently pressed or in the way.",
      "rating": 4.0,
      "verified": true,
      "author": "Magius96",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Worth the money",
      "text": "Very comfortable, feels great against your palm for extended sessions on the pc. I haven't found a way to adjust the DPI/output yet but when I do I'll ramp up the stars. As it is the mouse is great for Minecraft, RTS games as well as casual use. For shooters I think a regular mouse is still best, unless you have a DPI adjustable rollerball then I would reccomend it hands down. Much better on the wrist, easier to set up good posture and positioning, and you dont need three feet of clesr space to drag around a laser or ball bearing mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Prefer a trackball - great customer service",
      "text": "I got this for my son so he wouldn't need a mousepad in class. The only flaw is that the USB plug does not stay in the holder in the bottom, so it was quickly lost. I will say that the seller did replace this for me, which I find to be awesome considering how many other products become useless if you lose the USB part. They impressed me with their responsiveness and willingness to help!",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer C",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Very nice trackball.",
      "text": "I bought this as an alternative to Logitech because I've had bad luck with Logitechs in the past (Logitechs last an avg of 10 months for me... switched to a corsair mouse and it's gotta be nearing a decade of use... corsair doesn't seem to make trackballs... at least in this style). First one was glitchy and needed replaced. Manufacturer sent me a replacement promptly ( I was busy and didn't initiate return until just after amazon's guarantee had expired). Replacement works excellent and I'd highly recommend it. It's going on 7 months of use with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "perixx perimice 517",
      "text": "- After reading a few of the reviews, I was hesitant about purchasing this trackball mouse BUT I'm glad I did. - I've been using the trackball mouse for almost a week now and have experienced NO problems at all. - I was concerned that there were no installation instructions or CD...BUT the trackball mouse works fine, no problems (even without actual drivers). - My concern is that there is no email address to contact the German company should there be a problem...phone # only.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Shoji",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "6 fingered alien? This is for you.",
      "text": "Ball squeaks. The ball is annoyingly stiff. The Back and forward buttons are at an angle that's comfortable to push if you have 6 fingers. The right button is too sensitive, I keep clicking it. The PERIMICE-517 has no driver software, the driver for the wireless version PERIMICE-717, works, but you wouldn't know without guessing. The MOST important buttons to reprogram, the DPI change buttons are NOT programmable, so it is effectively a 5 button mouse + worthless 2 crap buttons. The finish is nice. The fit is decent. Get a Logitech M-570 instead, I think you'll be happier.",
      "rating": 2.0,
      "verified": true,
      "author": "SirXziane",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Remarkable!",
      "text": "For ten years I used my original Logitech optical track ball for house-design work and music production on some heavy-duty computers. It finally started skipping beats. Found another one on this site. $288.00! Forget that. Bought this one for a tenth of that price. I love it. Perfect fit for my hand, well-made, great feel and fine craftsmanship. Couldn't ask for more. Durable? Don't know yet, but you'll be the first to find out in a year or two.",
      "rating": 5.0,
      "verified": true,
      "author": "muvywriter",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Great trackball. Use it for 2 days to break it in!",
      "text": "Awesome one for one replacement for my worn out Logitech Trackman Ball mouse that I’ve had for years. The ball was stiff and I was a little disappointed at first, but it just took some time to break in (a day or two of usage). The adjustable DPI switch is really awesome and helps you make a quick adjustment from office work to some light gaming and getting around the screen/monitor pretty quickly. Highly recommend this if you are looking to replace your old faithful Logitech!",
      "rating": 5.0,
      "verified": true,
      "author": "Gartell",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Very comfortable trackball mouse",
      "text": "We recently bought 2 track ball mouses for my wife to use. She started having pain in her forearm and hand from using a standard mouse. She finds this Perixx mouse more comfortable than the other track ball mouse brand and now she's using it as her primary mouse. She loves being able to use it either on the desk or in her lap. We just got it, so no idea how long the batteries will last.",
      "rating": 5.0,
      "verified": true,
      "author": "AF Phil",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Great Trackball When Bluetooth is Not an Option",
      "text": "I tried this trackball as a replacement for the Logitech M570 Wireless Trackball. After a Windows update, my bluetooth stopped working and I decided to go hard wired. Logitech doesn't make a comparable thumb-controlled trackball that is hard-wired, so I went with Perixx and it turned out to be a great decision. The operation and feel is similar to Logitech but the hard-wired USB gives better/faster more precise response. It also works great on my Ubuntu Linux box.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wolf",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Works great!",
      "text": "My (very old) Logitech trackball finally died and I was worried I wouldn't find anything that fit my hand in the same basic way. This unit is fantastic. Very comfortable in my hand and I love the sensitivity button that lets me switch via hardware from a mouse that is very accurate to one that moves very fast. I've never seen something like that before. All in all, a great find and I am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Very inaccurate and tough to use, gets worse within days, my hand even hurts.",
      "text": "For big areas to click in it is fine, but if you need to aim for something very small it's horrible. Why can't Logitech just make a damn corded trackball again?? I am tired of batteries. I found a corded Logitec refurbished online, it cost more but they are worth it and last many years. This thing is awful, after a few days I had to move the ball multiple times to get the cursor to move, terrible! Returned!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Morgan B. Parker",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "The ball needs to roll smoother",
      "text": "I did figure out that if you trade the balls from an M570 both work better. So that't the whole deal, the ball doesn't roll smoothly enough, otherwise great product and I do use it, but the M570 is still the better trackball.",
      "rating": 3.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Too much resistance on the trackball.",
      "text": "I like the feel of the mouse, buttons, and scroll wheel. However, the trackball doesn't \"glide\" smoothly. There's too much resistance. It even squeaks sometimes, which is super annoying. The extra force required to rotate the ball makes it unusable for longer than a few minutes. I went back to my Logitech.",
      "rating": 2.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 2,
      "publication_date": 20190629
    },
    {
      "title": "Good trackball, QA seems to be failing",
      "text": "I already had one of these and really like it, but I needed another for second computer. However, the ball was very scratchy feeling and did not roll smoothly. Looked online and found the solution: remove the casing and sand down the outer ring that holds the ball in. Now it rolls smoother (still need to remove a bit more) but the ball won't stay in the mouse if I turn it over.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry G. East",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Good Wired Trackball",
      "text": "The switches have a good, solid feel. Nice successor to the wired Trackman Wheel. The plastic around the wheel housing did not need trimming (as noted in a previous review). A wired trackball mouse ought to cost $5 less than a wireless trackball mouse, but this one is nice enough (compared to my old M570, whose switches are showing their age) that I can mostly ignore the price difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Was great, while it worked.",
      "text": "The feel, movement of this mouse is the best I've found in years. I contemplated purchasing another for a backup. Until the middle mouse button(wheel up and down) quit working. . Was going to try for a exchange, but didn't have original packaging. So, guess I'll keep looking for a good trackball mouse. To be honest, if it would have kept working correctly I would have given 5 stars",
      "rating": 1.0,
      "verified": true,
      "author": "snrooster",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great for those with joint or carpal tunnel issues!",
      "text": "I'm not a gamer so cannot attest to that, however I Rheumatoid Arthritis and carpal tunnel and this does not put any additional stress on my finger, hand or wrist joints and keeps my wrist straight. The thumb ball moves nicely! It seemed to take a day to adjust to my movements but I am absolutely in love with this! It's plug and play and seems well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Zero Problems",
      "text": "This trackball has worked like a champ. I went to a wire after going through 3 wireless trackballs, and continually had connection problems. Finally decided to go with a wire and am glad I did. The wire is quite long, too, approximately 5 ft., which makes it easy to find a comfortable position for your hand/arm when connected to the desktop under my desk. Got another one to use with my main laptop. If something happens to it, I will definitely buy another.",
      "rating": 5.0,
      "verified": true,
      "author": "FACE",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Dissapointing",
      "text": "Well, it LOOKED good, but prover awkward to use, with both the left-click and right-click buttons to the right, along with too many little buttons of dubious usefulness. But the single worst problem is that the trackball is so slippery, you can't roll it unless you either dampen your thumb, or wear surgical gloves. Very disappointed, and I ended up buying a logi trackball.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Not bad for the price :)",
      "text": "It was not that expensive. But the style is what I was looking for cuz I have carpal tunnel. I have to use finger grip to help move the ball the ball is very lightweight but I just bought this to get online pay bills and stuff so it's perfect for that but I still struggle to get the ball to move smoothly. But that is to be expected with such a lightweight product but it gets the job done thank you :)",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Love This Mouse",
      "text": "I was on the fence for a while before I bought it, but I’m very glad I did. My hand doesn’t cramp at work anymore when I’ve reviewed and edited videos for several straight hours, the mouse ball is just sensitive enough for my thumb intuition, and the button shortcuts have been very useful. Get this mouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Harbi",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Spend a few more bucks",
      "text": "This mouse is terrible in my opinion. I needed a mouse temporarily for work and didn't want to leave my Logitech there. I have big hands and it's still not comfortable. The ball is so sticky the cursor just jumps everywhere. I hate it, I missed my window to return before actually using it. I'm throwing it away, water of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Es",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Fourth trackball mouse I tried;  so far so good, give yourself a couple of days to get used to it.",
      "text": "I've had this for a week and it's grown on me. Had a Logitech wired trackball for a long time but can't seem to find them anymore. Not a fan of wireless mice but went ahead and ordered the wireless version which seemed glitchy. Also tried (two of) the Sanwa wired trackball but the wheel didn't roll smoothly. Also tried the Elecom which was too glitchy for me. This one works well, the only negative is the body was a little large to begin with but after a couple of days I got used to it. I will not be returning this one !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Zaklondon",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Good",
      "text": "I have carpal tunnel so trackball is best for me. It was hard to find a good trackball that was not wireless. Since you do not move this type of mouse when in use, I'm not sure why most are wireless. I have small hands so the mouse is a bit large for me but it is still comfortable and feels nice and smooth. Plugged it in and started using right away with no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "Silci",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "bought 2 and they are both deffective",
      "text": "Used a Logitech for years and finaly gave out so I ordered a different brand and I'm very disapointed. The mouse never works after the PC wakes up from sleep, I have to remove the batteries and re-install them and disconnect reconnect the mouse receiver before the mouse works again. I bought 2, one for home and the other for the office and they both do the same thing. Wasted money, I only have a box for one so I'll work with Amazon to return one, the other one will go to the garbage, I don't have time to deal with an RMA. I'll go order 2 new Logitechs.",
      "rating": 1.0,
      "verified": true,
      "author": "AaronC",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Cheap garbage",
      "text": "The trackball does not work worth a damn, it is constantly getting stuck for no apparent reason. I've had it for 3 months and am throwing it away and buying something else. Do not waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "talldarkcynical",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Uncomfortable and unusable",
      "text": "The trackball is horribly unresponsive at times and takes multiple attempts to move the cursor. The mouse also does not feel ergonomic since it is uncomfortable to use and cause my hand/thumb to hurt within minutes of use. I've been using the Logitech wireless M570 mouse for years with no problems and only purchased this as a replacement because my IT department is blaming the wireless mouse for BSoD issues. I'm returning this purchase less than 24 hours after opening the package.",
      "rating": 1.0,
      "verified": true,
      "author": "A Ford",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Worked for a few weeks then  - problems",
      "text": "This product worked fine for a few weeks then problems developed. Using two buttons together for a control in a game stopped working. My last track ball (Microsoft) worked for several years before loosing function of one secondary button. Poor quality!! Do not buy!!! There are other choices out there.",
      "rating": 1.0,
      "verified": true,
      "author": "N. T. Blanchard",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Fit the bill perfectly",
      "text": "Need a wired trackball to more efficiently use a switch to switch between my home and work computer. This fit the bill perfectly. Easy transition from the wireless trackball I’ve been using for years. Accuracy dinged only one star, and that may be user error... I can probably fix that through my computer mouse settings. It’s really not a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Brummett",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great Wired Trackball",
      "text": "I've used a specific trackball for years and love it But I need one that is not wireless with the ball on the right side for thumb control. I searched and found the Perixx Perimice-517 Wired Trackball. Fantastic find! I've used it for a week now and it more than satisfies my needs!",
      "rating": 5.0,
      "verified": true,
      "author": "All Things Stephen",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Just like Logitech M570 only with a USB wire",
      "text": "I've owned a couple of Logitech M570's. Love them. Got a home office set up that uses a KVM switch. The wireless M570 would not work with the switch. I needed a USB connecting mouse that would be similar to the M570. This thing is great! I read reviews of this mouse with complaints of rough ball movement, not being accurate, etc. Used for 2 weeks so far and whatever issues it had seem to be resolved. The shape and feel of this thing are on par with the Logitech. For the money, you can't beat this thing. Also, I don't game, so can't really review it for that category, but for my office work, this thing fills the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Krakowski",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "The worst trackball I've ever had",
      "text": "I've been using trackballs for the last 20 years or so, usually using Logitech devices. I decided to buy this one for my kids' computer when they asked to replace their mouse. It is TERRIBLE. Most of the time clicks on the buttons don't register. You need to click down near the ends of the buttons to even have a 50/50 chance it'll work. I ended up buying them a Logitech and now everything works.",
      "rating": 1.0,
      "verified": true,
      "author": "Gene Ramon Gomez",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Overall the mouse is working good.",
      "text": "The Perixx PERIMICE-517 Wired Ergonomic Trackball Mouse is still working fine, no problems so far. It still has the unmistakable electronic burn smell, yet not as strong as it was. The cursor and all the buttons work really well with no issues. I will keep using the mouse until the 30 day warranty almost expires to see what happens. Other than smell, overall the mouse is working good.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Dressler",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Operates Well, But \"FOR ME\",  not good at all.",
      "text": "I get a lot of miss-clicks with the right-click. For Me, the right button is too high. I have to hold my middle finger up the whole time. If I forget to hold up my middle finger, \"miss-click\" and some unwanted menu or option comes up interfering with the game play. Causes fowl language and stress. Not fun for ME, zero star.",
      "rating": 1.0,
      "verified": true,
      "author": "Pete Tomiello",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Nice mouse",
      "text": "Came quickly. Fits nicely in my hand. Sometimes I click on something and it doesn't register my click and I have to do it twice or three times, unknown if that's the mouse or the website, but I like this mouse. I went through several. I use it for Final Cut Pro, Adobe Premiere and After Effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Bad Mo Fo",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Needs some design tweaking",
      "text": "The trackball feels great and works great for the first couple of minutes. I think there is a materials problem. Once my hand warms up the ball it sticks really bad. Making it almost unusable for game play. For the casual PC user who doesn't keep there hand on the trackball it might work fine.",
      "rating": 2.0,
      "verified": true,
      "author": "D'Arcy",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "For Work",
      "text": "I've used a wireless trackball in the past and loved it. Needed a wired one for work, it's great, don't need to move my wrist or bang a mouse down when the arrow runs out of space. I believe once you get used to moving the thumb you will not go back to a regular mouse.",
      "rating": 5.0,
      "verified": true,
      "author": "D. H. Cook",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Smooth Trackball",
      "text": "I don't write many reviews but I am quite impressed with this trackball. I have been using the Logitech wireless trackballs for many years now. Recently, though, I started encountering lag issues. I have an idea of why this happens and I am looking to solve it but in the mean time, I decided to try this wired trackball. The ball movement is as smooth, if not smoother, than my Logitech M570 trackballs. It certainly fits my hand a bit differently but I think I actually like the wider profile.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Nice mouse",
      "text": "Got this because my hand has been hurting. Love the fact I don’t have to squeeze a mouse and move it. Two things that bother me. Some times the left click button doesn’t seem as sensitive and some times seems the ball sticks/gets stuck. Other than that like the mouse very much.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Casiano",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "None",
      "text": "Use at work. It's as advertised, very comfortable and a really product. If you're a Trackball mouse user you will really like this.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Camper",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "The trackball never seemed to break in",
      "text": "I normally use a Logitech cordless trackball as they discontinued their corded one and thought to try this one. While I wasn't deterred by the initial use of the trackball, it never smoothed out as my Logitech had. Back you my cordless Logitech :^l",
      "rating": 3.0,
      "verified": true,
      "author": "conan",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "some thing that do not work with my Computer",
      "text": "it is wonderful and love it but it seems not work on my alien computer with dpi and forward and back buttons however it really not matter to me since I have older Logtech trackball same with this one new product except new one have dpi and forward and back buttons which I not really need it but it's price that reason I bought it. will buy two more for my another computers....",
      "rating": 5.0,
      "verified": true,
      "author": "R.M.Williamson",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Amazing",
      "text": "I wasn't sure what to expect but this is wonderful. It fits perfectly in my hand. Unlike other reviews, the trackball was not overly tight and moved smoothly right out of the box. I highly recommend this for anyone looking for a trackball mouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Lambert",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "I love this device....",
      "text": "I usually call this item a \"thumb ball\" because, to me, a track ball is much larger and the ball is controlled with your fingers. This trackball is very comfortable to the hand and easily controlled. The accompanying app has great setup capabilities. Thank you Perixx for this great item....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "like !!!",
      "text": "Cons: none so far Pros: Fits my hand better than the SANWA (Japan Brand) Wired Ergonomic Trackball Mouse As good as the Logitech M570 and cheaper More reliable than a wireless Like wired for my desktop PC",
      "rating": 5.0,
      "verified": true,
      "author": "G-Man",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Not worth it",
      "text": "I kept this device in hopes it would loosen up after working awhile but the ball is to stiff for intricate work like getting to a small radio button for example. I do 3d imaging and graphics and it has proven to be a thorn in my side. I switched back to my wireless logitech m570.",
      "rating": 2.0,
      "verified": true,
      "author": "Clifton Hayes",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Inaccurate tracking",
      "text": "Gave the mouse a shot since the design looked good and its a wired thumb trackball but the tracking isn't good enough. in both DPI options, the tracking would skip around when moving slowly. I tried turning off windows acceleration and it was still very wonky compared to the comparable logitech mouse.",
      "rating": 2.0,
      "verified": true,
      "author": "driskull",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Works great",
      "text": "It's a bit small for my average size male hand and the roller ball is a bit stiff. But I have only been using it for less than a week and I am sure it will loosen up with time. Otherwise, it looks good and works great.",
      "rating": 4.0,
      "verified": true,
      "author": "LeeBird",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "No good",
      "text": "It looks nice, but is mostly unusable. I have used many trackballs for years. All the way back to the Microsoft trackballs. The ball on this one does not move smoothly. This causes the cursor to jump around and makes it very hard to click on anything.",
      "rating": 1.0,
      "verified": true,
      "author": "Phillip Aiken",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Plastic roller balls",
      "text": "The price is right, the feel of it is nice in the hand, but having plastic instead of steel bearings meant it started dragging in a couple days, and I've got longevity concerns. If I couldn't find one with steel bearings at similar price-point, I'd probably buy this again.",
      "rating": 3.0,
      "verified": true,
      "author": "Rafael Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Good for me",
      "text": "This mouse is good for what I need it for, but if you want one for gaming or some sort of high capacity use like working from home where you use it constantly, I would spend a little more on a better quality mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard ",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Works Good!",
      "text": "I love the fit of it for my hand, the only issue I am having is that the ball tends to stick and not flow freely all the time. Other than that, it works perfectly for me. I use it at work and mostly for doing artwork in AI.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Sladek",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "best design for ergonomic",
      "text": "This is the Only wired replacement for the discontinued Logitech trackball I was using. So glad I found it. My fingers and hands are not cramping up now, just lay my hand naturally on it and just have to move my thumb Great Mouse",
      "rating": 5.0,
      "verified": true,
      "author": "Seriouslysilly",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "best mouse ever",
      "text": "this mouse fits perfectly in my hand. the ease and smoothness of the ball movement is amazing. The price is a fair price. I love this mouse so much that I bought a second one for the laptop in my bedroom...",
      "rating": 5.0,
      "verified": true,
      "author": "Mimie Wal",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "No Stress On My Hand",
      "text": "The iteam is great, less stress on the hand n wrest. I've had one like this, past 20 yrs. It may be very easy or some practice to get use too. I have no dislike for this iteam.. I use roller ball mouse for music composing software..",
      "rating": 5.0,
      "verified": true,
      "author": "Roberto C.",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Stopped working in two weeks",
      "text": "This trackball was pretty good, for the short time that it worked. Within two weeks, it stopped working correctly; the cursor control was intermittent.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Murano",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Jerky movement",
      "text": "Ball movement is not smooth. I keep cleaning the ball but it doesn't help. When I have two small icons as often as not, I'll click on the wrong one because the mouse jerks just a small bit but enough to click on the wrong icon.",
      "rating": 2.0,
      "verified": true,
      "author": "Denny Dale",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "A good Thumb-Ball Mouse!",
      "text": "I needed a replacement for a 15 yr old unit. I came across this one. It was moderately priced and configured similarly to my old one. This has been a great replacement. I definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Paul Douglas",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "DO NOT BUY!",
      "text": "DO NOT BUY! If I can give it a ZERO I would! I have used this for 3 days and end of each day, my hand was throbbing! The ball will stop mid action and I had difficulty getting the pointer on a cell when working in spreadsheets.",
      "rating": 1.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Does the job, doesn't need any more preamble than that",
      "text": "using this on a work computer with a limited space on desk..fits hand well and quickly adjusted to trackball orientation. Have been a long-time advocate of trackball usage and this one suits many uses.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Coventry",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "When it's time to upgrade the mouse! Buy!",
      "text": "Excellent upgrade from crappy standard mouse that pees your wrist off! Many are better... But not enough to warrant the price upgrades beyond this one! This has made rotoscoping easy!",
      "rating": 5.0,
      "verified": true,
      "author": "D. GriffinTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great mouse",
      "text": "I have the wireless mouse and this mouse is wired and works the same way. If I am on the road no need to look for batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Segal",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Trackball Terrible!",
      "text": "Feels great in your hand. However, the trackball is terrible. Not smooth at all. Added a little oil and helped, briefly. Purchased because it is wired. Going to keep it and hopefully break it in a bit. Look elsewhere though. Spend the extra $10 on another brand.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Avalos",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Movement is stiff and imprecise",
      "text": "This trackball mouse is essentially useless. In that it is near impossible to use it when accuracy is needed. As I'm moving the trackball it doesn't glide over the nibs. It is noticeably stiff and as you narrow in on your target you can feel the stop and go movements. I continually overshoot the target because of this. Making it way too frustrating to use. I've cleaned it several times, even though I've been using it less than a week. There is no way I could recommend this device to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "This item sucks! It only works sometimes, most of the time it does not work.",
      "text": "Horrible device, looks great and feels great but that is the end of it. This item is defective and I purchased the Protection Plan along with it, and GOOD LUCK",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 2,
      "publication_date": 20181012
    },
    {
      "title": "Super please so far!",
      "text": "Working great but we will see how it holds out over time. So far though, I am very pleased. Doesnt much matter its wired... it's a track ball so its not moving!",
      "rating": 5.0,
      "verified": true,
      "author": "lenard t franklin",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "The ball moves with the smoothness of a sandy balloon.",
      "text": "I dislike how the ball is not smooth feeling at all. It feels as is the ball is catching on something making it feel like it need some sort of lubrication.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest Will",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Sleek design",
      "text": "This is so much better than my previous ergonomic mouses. The design relaxes my hand and wrist. Works wonderfully, just like a regular mouse feel with the ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Oceanview",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Ok trackball.",
      "text": "It’s ok trackball, a little sensitive. I really liked my older trackball better but it’s no longer available. For the money it’s a good replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven D. Jones",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "GREAT WIRED ERGO MOUSE",
      "text": "This is a very nice, precise and fine functioning wired ergonomic scrolling mouse with back and forward selections. Super comfortable and functional",
      "rating": 5.0,
      "verified": true,
      "author": "jskriteman",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Comfortable",
      "text": "This is a nice wired trackball mouse. It is accurate and smooth scrolling and precise. It has a nice exterior texture that is comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Best mouse for work/play",
      "text": "I got this for my husband who has carpal tunnel. The mouse at work was always a pain. This one has been so awesome for him we are considering another for home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Oceanconceptz",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Works well but not as durable as I hoped",
      "text": "It was working good with the monthly cleaning to keep it functioning properly. about 7 days after the 1 year warranty, it died. I am reaching out to support to see how good is there customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "Doanh T.",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Good wired mouse",
      "text": "I have a Logitech wireless mouse but was looking for a wired mouse. when i first removed it from te package the roller ball felt a little stiff. it has loosened up and is now awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah L Onheiber",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Ergonomically correct Mouse",
      "text": "This product works great easy to install performance is on the money great Buy for the price I recommended for anybody who's looking for and economically correct Mouse",
      "rating": 4.0,
      "verified": true,
      "author": "Big Rick",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Wheel sticks",
      "text": "I have had this about 6 months. I like it ok, but lately the wheel has gotten really sticky. my husband popped it out and cleaned it for me, but it's getting sticky again in just a week or two.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Davies",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "I love trackball mouse",
      "text": "This also trackball that wired, no battery, Able clean it if needed. the button to move forward or back thru web pages with button. Love it planning to get second one for my other desktop computer",
      "rating": 5.0,
      "verified": true,
      "author": "Sir Ash",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "These are better than Logitech's Trackman Marble",
      "text": "The Perixx trackball is better than Logitech's Trackman Marble - BLUF: The trackball works exactly the same, has more features, and comes with an extra ball. Thank you. ...",
      "rating": 5.0,
      "verified": true,
      "author": "MAB",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Works well.",
      "text": "This mouse works well but it is very hard to clean and very easy to get dirt in it. I stopped using it after a couple of months, it's too much work.",
      "rating": 3.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Perfect",
      "text": "First one I received had the trackball sticking which made the pointer on the screen jump, plus aggravated by thumb. Thanks to Amazon's return policy I ordered a second one and it is perfect, just as good as the Logitech wireless unit it replaced.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueAce",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "A wired trackball mouse that works great",
      "text": "Had Logitec wired trackball that lasted many years and logitec discontinued them - this is reminiscent of the old Logitec's. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "William Collins",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Doesn't last long..",
      "text": "This item lasted less than 3 months of roughly one hour a day use before the M1 button started messing up. I do not recommend this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Kendra",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Replacing it from Logitec Trackman",
      "text": "I purchased this trackball because it is wired. Many trackballs from other than Logitec has some issue with the accuracy of mouse cursors and feeling. I replaced the ball to the Logitec Trackman prodcut then I felt way better.",
      "rating": 4.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Sticky movement",
      "text": "Ball movement is not smooth, but a bit sticky. And the DPI is either too slow or too fast and either way is jerky due sticky movement. I just got it today, so I'm hoping it just needs some time to break-in.",
      "rating": 2.0,
      "verified": true,
      "author": "heathc",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Great budget alternative to Logitech options",
      "text": "I got used to a Logitech Trackman Wheel on my workstation and wanted another for my home PC, but alas, the wired Trackman is discontinued and suddenly very expensive, and I wasn't interested in a wireless version that eats batteries. Happily for me, this Perixx has turned out great. It takes a little getting used to, a little breaking-in, but as long as you keep at it and keep the ball socket clean, it's good stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "John Hook",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "good hand support, adjustable speed.",
      "text": "It's speed of reaction is adjustable, so tracking with slidebars is doable as is locating the pointer for spot settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken MacKenzie",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Worthy buying",
      "text": "I’ve used it before, main reason I got a new one! It takes a little but to get used to it but once you do you’ll love it",
      "rating": 5.0,
      "verified": true,
      "author": "martha",
      "helpful_votes": 0,
      "publication_date": 20200809
    }
  ],
  "product_meta": {
    "title": "Perixx Perimice-517 Wired Trackball USB Mouse, 7 Button Design, Build-in 1.34 Inch Trackball with Pointing Feature",
    "description": "Style:WiredErgonomics - using computer For long hours on a daily basis is the New normal for people both work and leisure However what comes after is major wrist pains resulting from all movement back and forth across a desktop by using mouse Perimice-517’s ergonomic design offers a natural-shape platform for your hand to rest on comfortably Equipping with 34mm trackball and 7 buttons full control of everything is now within your fingers Set your wrist and palm muscle free Just enjoy the effortless computer use from now Specification dimension 130x107x45 mm Weight 120 g sensor laser trackball size 34 mm dpi 1000/1600/2000 silent click yes cable length 1 8 m buttons 7 system requirement Windows system and USB port",
    "rating": 4.1,
    "feature_bullets": [
      "7-BUTTON ERGO MOUSE - Wired ergonomic trackball mouse with quiet clicks (left/ right/ backward/ forward/DPI switches) and they work with the trackball simultaneously Easy to switch the cursor speed with DPI switch buttons (resolution 400/1000)",
      "NATURAL ERGO DESIGN - The ergonomic trackball mouse is for right-handed users recommended to repetitive strain injuries RSI users and the users work particularly long periods on the computer e g office worker gamer and internet user The mouse helps to prevent fatigue in arms and tennis elbow",
      "EASY NAVIGATION AND SPACE-SAVING - The surface on the high-density trackball is coated with special treated glitter effect providing users exceptional tracking and precision Everything on the screen is within the reach of a small thumb movement without having to move the arm Additionally it saves your desktop space",
      "TROUBLE-FREE TO CLEAN - It is easy to clean if dust on the trackball effects the cursor movement The ball can be easily removed from the mouse buttonhole by fingers or a blunt side of a pen Either use a soft brush or a soft lint-free cloth and gently wipe down dust from the trackball",
      "SYSTEM REQUIREMENTS - Windows 7 8 10 No drivers required ready to use from the box Wired USB 2 0 interface Package includes 1x PERIMICE-517 12-month-limited-"
    ],
    "specifications": {
      "Brand": "Perixx",
      "Item model number": "11567",
      "Hardware Platform": "Laptop, PC",
      "Item Weight": "6.2 ounces",
      "Product Dimensions": "6.29 x 8.25 x 2.28 inches",
      "Item Dimensions  LxWxH": "6.29 x 8.25 x 2.28 inches",
      "Color": "Black",
      "Manufacturer": "Perixx Computer GmbH",
      "ASIN": "B07CPW9GZC",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 27, 2018",
      "Customer Reviews": "4.1 out of 5 stars1,086 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#11 in Computer Trackballs"
    },
    "categories": [
      "Computers & Accessories",
      "Computer Accessories & Peripherals",
      "Input Devices",
      "Electronics",
      "Trackballs"
    ],
    "price": 29.99
  }
}