{
  "website_summaries": [
    {
      "verdict": "A premium option for those who want a stylish and versatile dog pool.",
      "pros": [
        "Hassle-free design enables you to fold the pool and take it with you on the go",
        "Includes a summery beach theme that makes the pool an attractive option",
        "PVC sides make the pool a safe and durable choice for pet owners",
        "Much larger than many comparable dog pools",
        "Pool is very sturdy"
      ],
      "cons": [
        "May quickly develop small leaks that worsen over time",
        "Side walls tend to collapse"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best $55.00 I ever spent. GREAT POOL",
      "text": "I've had my pool for over a year now, I love it. I use it daily in the summer. I sometimes fill it with hot water and bubble bath to take a bath under the stars. I drain it and use the water to water my yard. Folds up easy, no inflating needed. I highly recommend this pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Miller",
      "helpful_votes": 58,
      "publication_date": 20190722
    },
    {
      "title": "Great pool for the money, arrived right on time!",
      "text": "This pool is great! I got it for my golden retriever pup and he loves it. Great for keeping cool in the heat and its beach design makes it not awful to look at in the yard. I got the 50\" for my dog, he's 60lbs and it works well for him. He can splash around and comfortably lay down in on hot days.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Perrault",
      "helpful_votes": 37,
      "publication_date": 20180608
    },
    {
      "title": "Almost perfect",
      "text": "This pool is really well made and works great . the only problem with it is you can't fully drain it with the drain hole without picking up one end which stretches the plastic with way too much weight. you should put another drain hole at the bottom becaue for people like me doing that draining alone to clean it is extremely difficult. water is extremely heavy",
      "rating": 4.0,
      "verified": true,
      "author": "ishKiia",
      "helpful_votes": 17,
      "publication_date": 20180912
    },
    {
      "title": "He likes to paw the bottom and it has not scratched or leaked It’s easy set up and to drain",
      "text": "I bought this because My Doberman puppy was over turning all of our water bowls and buckets. he is having a ball with this pool. He likes to paw the bottom and it has not scratched or leaked It’s easy set up and to drain. It’s also simple to dry out when the grandparents want to take the puppy. It’s super easy to pack up and doesn’t take up much space. It will fit in a small grocery bag . When his little friends come for a play days they love it too, especially the Doxies😊",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Wheeler",
      "helpful_votes": 12,
      "publication_date": 20180806
    },
    {
      "title": "Perfect in every way!",
      "text": "Just received this pool in time for our heat wave! Pups and I love it and will be playing in it all summer long! Perfect size and durable construction! Two thumbs up",
      "rating": 5.0,
      "verified": true,
      "author": "Daisy Raney",
      "helpful_votes": 15,
      "publication_date": 20180705
    },
    {
      "title": "My German Shepherd and I love this pool",
      "text": "My German Shepherd and I love this pool! It's big enough for both of us to sit in and cool off. The sides are sturdy enough for him to lay against them and its not too tall for by Golden Retrievers to stick their heads in too.",
      "rating": 5.0,
      "verified": true,
      "author": "ginagoff",
      "helpful_votes": 14,
      "publication_date": 20180705
    },
    {
      "title": "My 120 lb dog loves this pool!!",
      "text": "Purchased for my dog and I to enjoy a cool down in the hot California summer. Worked perfect, my bulloxer Roxy was thrilled and hopped in when I had only filled the pool up about 3 inches. I would push my chair up to the side and stick my feet in with a cold beer. We even watched a few Prime Video movies at night hanging out in the pool with our iPad, pretty swanky. Roxy has du-claws and has popped blowup pools. the ridged sides are not and issue and the plastic is very durable. Pool rinsed out quickly and is easy to put away. Both Roxy and I thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Gee",
      "helpful_votes": 6,
      "publication_date": 20190917
    },
    {
      "title": "Side walls dont stay up for refilling.",
      "text": "The concept is great....but the actual functionality of the pool was disappointing. My chocolate lab loved it. Easy set up and fill. Bottom is sturdy and non-slip. Unfortunately, after I drained it to clean and refill the very first time, the side walls would not stand up. It had small leaks from the beginning but I could deal with that but not being able to fill it makes it unusable. I set it up in the driveway with an indoor outdoor area rug on top of a heavy duty tarp. I am so disappointed because Winston enjoyed it so much for 2 days and now I have to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20180708
    },
    {
      "title": "Durable, Easy , Fun.",
      "text": "This will be the portable pool for my grandchildren for many Summer’s. It is easy to setup and easy to put away . No back breaking trying to get the dirty water our . You open the drain, and then fold down the sides. I use a plastic storage bin . It’s tough enough for the wildest/toughest 4 year old. It was definitely the highlight of the weekend which heat index of 111.",
      "rating": 5.0,
      "verified": true,
      "author": "Frankie Brown",
      "helpful_votes": 7,
      "publication_date": 20190721
    },
    {
      "title": "Paw Park doggie park approved!",
      "text": "I LOVE this doggie/ kiddie pool. I volunteer at a local leashe-free dog park and summer can be brutal, especially for a husky mix like mine wearing a big fur coat year round. It isceasy to set up and take down. It's deeper and larger than regular kiddie pools and surprisingly super durable that it even stands up to doggos that have a need to scratch incessantly on the bottom of the pool. I also like the plug where you can drain the water. It was the hit of the dog park.",
      "rating": 5.0,
      "verified": true,
      "author": "QinNY",
      "helpful_votes": 2,
      "publication_date": 20191217
    },
    {
      "title": "So easy to store during winter",
      "text": "This was the perfect size for my two German Shepherds! Heavy duty vinyl and they had to try it out before as soon as we set it up! I originally bought it for a whelping area. Maybe next spring!",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne Harley",
      "helpful_votes": 4,
      "publication_date": 20191102
    },
    {
      "title": "Set up is a snap!",
      "text": "I received the pool faster than I thought! It arrived as compact as possible n one person can easily handle the weight of the package. Very pleased with the quality of the construction n the materials it's made out of n easily unfolds to set up in a snap n fill!",
      "rating": 4.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 4,
      "publication_date": 20190310
    },
    {
      "title": "It leaked!  😞",
      "text": "I love the look and feel of this pool but unfortunately it leaked out of the drainage port. The pool liner seemed to be cut wrong over the port hole. No matter how many times or how hard I screwed it, would not stop leaking. Very sad because I liked it very much. Had to return which is a pain to wash it, dry it and pack back up. 🙁",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180702
    },
    {
      "title": "Fun for you and your dog(s)!!",
      "text": "Love the size and how well it’s made. My teenage sons like that they can get in with our 2 dogs (1 large other one medium size)",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Dillard",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Did not last very long.",
      "text": "Ordered this for my dogs. The plastic tore fairly easy when my dogs were rough housing in it.",
      "rating": 2.0,
      "verified": true,
      "author": "susan m harnan",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Awesome",
      "text": "It is a great pool for small dogs and dogs that are over the bitting phase. We got this for our Golden Retriever puppy when he was 2-3 months old, unfortunately, he ate the bottom of it and now we cannot fill it up anymore :( will be trying the hard pools next.",
      "rating": 4.0,
      "verified": true,
      "author": "jamile",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Easy setup",
      "text": "It was easy to setup but my puppy is not sure what the pool is for.",
      "rating": 5.0,
      "verified": true,
      "author": "Allan Morrice",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Very disappointed",
      "text": "I gave 100.00 for this and very disappointed the sides are not holding up they are bowing out instead of standing up like they should",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Good Dog Pool",
      "text": "It's a good pool for the dogs (labs), but my mom uses it as her pool too. Some mornings the water is almost gone, but we don't see a leak anywhere. Other times it remains filled for days. Very easy to fill/empty.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Good pool but siding is bowing out",
      "text": "So I have had this for about a month. It’s sturdy but the baffles on one side have bowed out now and even if I only fill it halfway they bow out instead of having a nice straight side. The liner on the bottom has held up very well and it’s a nice looking pool. Both my Aussies can fit and play in it. Just disappointed about the integrity of the baffles.",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "As described",
      "text": "Seems to be a good product and arrived as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay Peak",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Not Worth the Price",
      "text": "The sides started collapsing in about the 2nd time we used it. Not worth the price!",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great pool",
      "text": "Pool is great. Using it for the dogs to be able to swim. I have three 70-100 pound dogs and they can all fit in.",
      "rating": 4.0,
      "verified": true,
      "author": "RF",
      "helpful_votes": 5,
      "publication_date": 20180728
    },
    {
      "title": "Great bang for the buck",
      "text": "Our lab enjoys it. So do the grandchildren, cleaned first of course.",
      "rating": 5.0,
      "verified": true,
      "author": "Prismz",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "had multiple holes in the bottom on the first use",
      "text": "so excited and had read some great reviews about this pool. We set it up on the concrete in our backyard and the dog loved playing with it. After 2 hours we noticed some water leaking and drained the pool. there were several holes in the bottom! Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Samantha Miles",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Linda",
      "text": "This pool is so awesome for my 2 German Shepherds. They love it",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Great pool!",
      "text": "Love it. Just as described and study like other people have reviewed!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "It is bigger than you think!  And nice and cool",
      "text": "Love it!! We Couldn't swim in our community pool because of COVID-19 so we bought it to put in our backyard for her dogs and my daughter and myself and it worked great Mother's Day was a hit!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudette Levesque",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Easy, Sturdy, Durable",
      "text": "Purchased for my grandson (aged 5), my daughter loves it--says it is sturdy when filled and easy to empty, collapse, and fold. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Dog beach",
      "text": "I use it as a dog bath and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "bottom was not made thick enough and has hole after 2 times with my 2 year old son",
      "text": "Used it 2 twice with myv2 year old and has holes in the bottom very disappointed woudl return if they would take it back",
      "rating": 1.0,
      "verified": true,
      "author": "Noah S.",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Good Pool for kids!",
      "text": "It was a nice pool for the kids to play in. When I tried to drain the water came out so fast and almost flooded my backyard. It is also heavier then I thought it would be. Overall, it is a good pool!",
      "rating": 4.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Very sturdy and easy to clean/change water",
      "text": "Exactly what I was looking for. Easy to change the water by either folding down one of the sides and/or using the drain plug. It's very sturdy. My ducks love it!",
      "rating": 5.0,
      "verified": true,
      "author": "morgan",
      "helpful_votes": 2,
      "publication_date": 20180720
    },
    {
      "title": "Easy setup and durable",
      "text": "Takes very little time to setup and take down this pool. Seems very sturdy and will last several seasons...as far as I can tell. the dogs love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bambamblock",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Fish display pool",
      "text": "I liked the look of this pool for displaying a fish temporarily for an outreach event. Long- term in the pool the fish would not be happy, but it served its purpose for several hours.",
      "rating": 4.0,
      "verified": true,
      "author": "Marion M.",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Dog Pool",
      "text": "My dog loves it. It’s sturdy and perfect for her!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Piece of junk",
      "text": "It's was slowly leaking from the beginning. Although I got it a while ago I used it the first time a week ago",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "It’s big and it’s a great time for the dogs.",
      "text": "I love this pool for my puppy. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Greulich Elmer",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Perfect for Medium Size Dogs",
      "text": "Dogs found it easy to get in & I found it Easy to drain.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Great pool",
      "text": "I actually use it for my toddler to play in. It’s. I’ve that you don’t have to blow it up. It’s also easy to drain",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B.",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "This is very sturdy and very easy to fold up and store.",
      "text": "Used this as a small pool on my deck for my grandsons (5 & 1). They loved it and I loved not having to blow it up!",
      "rating": 5.0,
      "verified": true,
      "author": "sandy fantz",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "3 dogs loving theirpool time",
      "text": "This pool is so nice. Easy to set up and so easy to let water out. My dogs love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Morrison",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Cool Pool",
      "text": "Easy to use but a bit intimidating for the dogs to step i",
      "rating": 4.0,
      "verified": true,
      "author": "Laurie Laykish",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Would buy again",
      "text": "Absolutely love the pool. Perfect height. It only takes one person to set it up. The liner is very durable. My dogs love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Black",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Not for chewers!",
      "text": "My Husky destroyed this pool after one use. The bottom is pretty durable but the sides were easily chewed up.",
      "rating": 3.0,
      "verified": true,
      "author": "Kirsten Brien-Sheddy",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Easy to maintain",
      "text": "I liked that it is durable and easy to set up, empty, fold and put away.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "NOT A DOG POOL!",
      "text": "This is not a pool for a dog .i had this up a day..and came home to pool chewed up ! I had my doubts when I ordered it but the reviews were convincing.",
      "rating": 1.0,
      "verified": true,
      "author": "AMBER CURRY",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Doesnt last",
      "text": "The pool has already come apart. Broke at the seam. And cant be fixed. Only had it a short time",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Parks ",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great little pool to cool off your dog",
      "text": "My 50 pound dog loves this pool. I only wish it was a little deeper but then it wouldn't be as easy for him to get in and out. It's easy to empty and fold up when dry.",
      "rating": 4.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20180810
    }
  ],
  "product_meta": {
    "title": "Midlee Dog Pool - Foldable & Portable Outdoor Bathing Tub …",
    "description": "Size:63\"63\" in diameter. Sides are 12\" high. Cover sold separately. Summery beach theme on sides. If you can't be at the beach, pretend you are! Portable and foldable. Easy to store and travel with. Keep your dog cool this summer with their own pool! Fill up and let them splash and play. Drain when complete and dry before storing. Sets up in seconds for lasting fun! Durable PVC sides make this fun for all dogs (and cats and kids!)",
    "rating": 4.2,
    "feature_bullets": [
      "63\" in diameter. Sides are 12\" high. Cover sold separately.",
      "Summery beach theme on sides. If you can't be at the beach, pretend you are!",
      "Portable and foldable. Easy to store and travel with.",
      "Keep your dog cool this summer with their own pool! Fill up and let them splash and play. Drain when complete and dry before storing.",
      "Sets up in seconds for lasting fun! Durable PVC sides make this fun for all dogs (and cats and kids!)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "16 x 12.6 x 7.4 inches; 15.1 Pounds",
      "Date First Available": "May 1, 2018",
      "Manufacturer": "Midlee",
      "ASIN": "B07CSFBBRD",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Crates, Houses & Pens",
      "Dogs",
      "Pet Supplies"
    ],
    "price": 89.99
  }
}