{
  "website_summaries": [
    {
      "verdict": "An attractive, sturdy bicycle by a company renowned for their high-quality bikes.",
      "pros": [
        "Features a steel frame, coaster brakes, 20-inch white wall tires, and a brightly decorated cruiser style",
        "Seat padding is soft and comfortable"
      ],
      "cons": [
        "It's somewhat heavy, but it's a rugged bike that's built to last"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Crank shaft broke- don't purchase!",
      "text": "This bike is adorable. My daughter loved it, however, after 5 weeks of riding it to school, the crank shaft broke and we are having to take it to a bike shop. I HATE this! To say I'm angry is an understatement. Don't purchase this online. Just go to a bike shop and pay the extra money... it's nothing with our assembly- it's the entire shaft just came apart while my daughter was riding it and since there's no hand brake, she almost crashed.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Sorensen",
      "helpful_votes": 16,
      "publication_date": 20180827
    },
    {
      "title": "Lovely colour - bright and cheerful",
      "text": "This is a beautiful bike my daughter loves it. It is everso slightly tall for her. She is 9 and tall for her age. She refuses to let me return it. I was able to assemble it myself with little or no drama but it was impossible to get the seat on securely so I took it to our local bike shop for final tuning and tightening. I wish it had handle bar breaks if I was to make any negative comments but thats my fault for not paying attention when we ordered it.",
      "rating": 4.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great Bike!",
      "text": "Bought this for my very tall 9 year old daughter. Perfect for her long legs. I want to buy me the same bike so we can ride together. She gets tons of compliments on her big girl super sharp looking bike!",
      "rating": 5.0,
      "verified": true,
      "author": "Maralyn Lee",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Bike #1 bent fender, bike #2 bent fender.",
      "text": "We received the bike the color is beautiful but the back fender was bent. Sent for a replacement and the the fender is also bent. We're not sure if to go ahead and put it together or return it for a third bike that could possibly be bent. My daughter really likes the design and color.",
      "rating": 4.0,
      "verified": true,
      "author": "Santana Chavez",
      "helpful_votes": 3,
      "publication_date": 20180629
    },
    {
      "title": "Inner Tubes Defective - be aware Tube Size not in General Stock at Big Box Store",
      "text": "Just received, put together, added air to tires as directed, after five minutes while adjusting seat that kept swiveling the back tire blew. So sad. Wanted to love it....wanted to ride it. Just noticed issue happened to another reviewer few weeks ago.",
      "rating": 1.0,
      "verified": true,
      "author": "Tee",
      "helpful_votes": 2,
      "publication_date": 20180825
    },
    {
      "title": "Cheap",
      "text": "Tire blew out on first ride. Pretty crappy for 170",
      "rating": 1.0,
      "verified": true,
      "author": "Yeppers",
      "helpful_votes": 3,
      "publication_date": 20190602
    },
    {
      "title": "Crap bike",
      "text": "This is a piece of junk do not buy. The tube blew on the front tire as soon as we put it together. After having to replace the tube the back tire blew out on my first ride. Amazon will do nothing but have me disassemble the entire bike and send back. I used to love amazon customer service but now I am truly disappointed in them",
      "rating": 1.0,
      "verified": true,
      "author": "nicole johnson",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Defective",
      "text": "It isn’t well made... I could not get the bolts off of it, it didn’t line up right, the fenders scrap the tires, the tire bursted before I ever rode it.. can’t get the seat to stop moving around when i ride it... I would have returned this but I didn’t want to go thru what is needed to ship a bike back... but it’s been very difficult bike...",
      "rating": 3.0,
      "verified": true,
      "author": "Avani",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Damaged box / awesome bike!",
      "text": "Bike arrived and box was pretty torn up! The front fender has a huge dent an rubs on the front tire. I need a replacement fender sent. Other then that, it’s a great bike for the money! Love the color and the assembly was pretty easy! Send me a new front fender.",
      "rating": 3.0,
      "verified": true,
      "author": "monique leduc",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Good bike",
      "text": "This bike is nice. It came in perfect condition. The only thing is that the chair is squeaky and the basket can break really easily. Over all, everything is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Clara vasquez",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Check product before shipping",
      "text": "Several parts are badly damaged. The tires are filthy and the rear tire does not hold air. I’m very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Just wants a rideable bike.",
      "text": "Help! Bike is two weeks old and the left pedal fell off as she was riding it. Trying to put it back on but it’s not fitting in the groove. So now my daughter has a bloody scrape and the bike is not usable.",
      "rating": 1.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Missing parts",
      "text": "My husband and kids bought me this bike for my bday, is missing parts and the instruction manual to put it together isn’t the right one. I should bought the other and I would be enjoying my bike today",
      "rating": 2.0,
      "verified": true,
      "author": "Romina Douglass",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "NOT RED",
      "text": "Bike is Hot Pink Not Red like I wanted. The front fender is bent and the front tire inner tube blew out. I don’t want to return it but that’s a lot of problems.",
      "rating": 3.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 3,
      "publication_date": 20180707
    },
    {
      "title": "I'm happy is will be a wonderful Memorial Day for me ...",
      "text": "Thanks, have received my RUBINE RED BIKE, I'm happy is will be a wonderful Memorial Day for me and family thanks A FIVE STAR FROM US.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Carrillo",
      "helpful_votes": 2,
      "publication_date": 20180524
    },
    {
      "title": "Not red but hot pink as mentioned in another review ...",
      "text": "Not red but hot pink as mentioned in another review. Part was missing and a rivet was broken on the bike. It's still usable though. Wouldn't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180709
    },
    {
      "title": "Poor quality bike parts, and terrible return policy",
      "text": "The bike pieces did not fit properly together. My husband is excellent at putting together bikes and has done it many times. The fender on the bike rested against the wheel after assembly and the seat is not able to properly install into the frame. Also, bike was delivered January 3 and we only had until Feb 3 to return (return window is now closed and we are stuck with an expensive and defective bike that our daughter cannot use). Normal return policies on purchases from Target or Walmart are 60-90 days. Will not purchase bikes from Amazon again.",
      "rating": 1.0,
      "verified": false,
      "author": "Stamfordct",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Careful when you buy something used",
      "text": "I bought this bike knowing that it was used, but I didn't expect the bike to be in the condition it was in. The paint had scratches throughout the frame and fenders. Paint was also cracking in some places gouged in others. The tires are white but you can tell that someone has been writing it for a while. It seems as if the bike has been in an accident or something",
      "rating": 3.0,
      "verified": false,
      "author": "Tiny2ns",
      "helpful_votes": 2,
      "publication_date": 20180705
    },
    {
      "title": "Arrived with a defective front fork.",
      "text": "Bike looks nice, but the front fork look misaligned and was too narrow to fit the front tire. Huffy isn't accepting phone calls and I have yet to get an email response. I don't recommend Huffy if you need product support.",
      "rating": 1.0,
      "verified": false,
      "author": "PDV",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Don’t buy",
      "text": "Bought this bike for our 10 year old. The color is cute but the back tire doesn’t fit properly and she haven’t been able to ride it which is just a sad experience. From what it looks like they don’t sell a matching replacement tire either...",
      "rating": 1.0,
      "verified": false,
      "author": "Jacob Simon",
      "helpful_votes": 0,
      "publication_date": 20200411
    }
  ],
  "product_meta": {
    "title": "Huffy Cruiser Bikes 20 inch, 24 inch & 26 inch",
    "rating": 3.5,
    "feature_bullets": [
      "An Amazon exclusive: Ideal for ages 13 - adult and a rider height of 58-70 inches; arrives with all tools needed for fast, easy assembly; Huffy's exclusive Perfect Fit frame makes this the most comfortable bike you'll ever ride",
      "This design delivers more comfort for more fun and a better ride; it places the seat farther back with a lower center of gravity; this design, with swept-back handlebars, enables a more upright, comfortable riding position with full leg extension",
      "With dual springs and luxurious padding for real comfort, the seat has matching lavender stitching with cream piping; embroidered Huffy logo completes the lavish look; wider footprint of the luscious cream-colored tires absorbs bumps and dips",
      "Lavender roses beautifully accent the chainguard and the padded seat; the rear rack, handlebar basket and beverage holder conveniently allow easy storage; the rear coaster brake provides dependable control as you need it, just pedal back to stop",
      "Dual density Kraton grips and pedals feel soft to the touch and stay comfortable on longer rides; steel frame backed by limited lifetime warranty (see owner's manual for details); a masterpiece of lavender and cream, the Holbrook is one beautiful ride",
      "Suspension type: Rigid"
    ],
    "specifications": {
      "Date First Available": "September 21, 2019",
      "Manufacturer": "Huffy Bicycle Company",
      "ASIN": "B07Y6DLLRH",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Cruiser Bikes",
      "Bikes",
      "Cycling"
    ],
    "price": ""
  }
}