{
  "website_summaries": [
    {
      "verdict": "In summary, the Mizuno Wave Inspire 15 has proven itself to be a solid stability shoe. According to some users, the shoe has ticked all the boxes on what an ideal stability shoe should have. Runners admired how comfortable, supportive and responsive the shoe is. For a series that is doing quite well, the Mizuno Wave Inspire has nailed it once again with version 15.",
      "pros": [
        "Most users lauded the supportive feature of the Mizuno Wave Inspire 15",
        "Several runners were satisfied with how comfortable the shoe is, especially on long-distance runs",
        "A few admired the lightweight design of the Wave Inspire 15",
        "Some happy wearers said the shoe offers a smooth ride",
        "The shoe is not only good for running but also for gym activities and indoor training, according to some user reviews",
        "A couple of buyers liked the shoe’s stylish design and color options"
      ],
      "cons": [
        "Based on some reviews, the heel cup of the Wave Inspire 15 is too tight",
        "Various purchasers were doubtful of the shoe's durability as they have observed some parts to come apart after a few uses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.5,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sole breaks apart",
      "text": "I have been wearing the Mizuno Waverunners for 5+ years with no issues. I recently bought a pair from Amazon, the first time buying this type of shoe from Amazon. Before running 30 miles the sole started to break off to the point where one of the pads completely split and fell off. I returned this pair and received a new pair and the new pair have again started to break (see photos). My logged miles on this new pair of shoes in the photos is 40 miles, have never had an issue buying this shoe from a brick and mortar so I question the authenticity of the product sold.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Stover",
      "helpful_votes": 21,
      "publication_date": 20190805
    },
    {
      "title": "GREAT Stability!",
      "text": "I have had Hoka One One's for the past few years. I am 73 and seemed to have a balance issue. So I searched for the best stability sport shoe, which is this Mizuno. It is excellent. Because of the prominent heel counter rather than the rollover or zero drop of the Hoka's, I don't have any sense of losing balance. And when walking, the fatigue I feel in my lower back is much better, probably because I'm not fighting for balance all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Dwight McCann",
      "helpful_votes": 8,
      "publication_date": 20190405
    },
    {
      "title": "Just the right shoe",
      "text": "I had previously been fitted for the Wave Inspire 12 at a running store, I need a motion control shoe for my over-pronating. I was replacing a 11.5 W, but went with the 12 W based off the reviews saying this fit a little smaller (and my normal size is 12 W anyways). This fits great and I can really tell the difference in the way my ankles and knees feel after a run with the motion control versus a standard running shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 4,
      "publication_date": 20190517
    },
    {
      "title": "don't buy unless you're only going to use on the track",
      "text": "I've had these for about a month now, and they are quite flimsy. It's really just some light mesh attached to the sole of the shoe. Terrible for trails, and barely adequate for roads that aren't newly paved. Too bad. I've been so happy with the Paradox shoes, but they've been discontinued. I'm giving myself about another month before my feet tear through the outer edges, or I roll my ankle.",
      "rating": 2.0,
      "verified": true,
      "author": "roscoegirl",
      "helpful_votes": 7,
      "publication_date": 20190329
    },
    {
      "title": "Stitches gone",
      "text": "I was very surprised after wearing the shoes about 10 times to find out the the the stitches connecting the tongue are half gone... I know that Mizuno are very good quality shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "VIKTOR CERNATINSKIJ",
      "helpful_votes": 4,
      "publication_date": 20190829
    },
    {
      "title": "Best.Shoes.Ever",
      "text": "I've been running for 25 years, but age, recent weight gain, and flat feet threatened my exercise regimen: I was experiencing arch-related foot pain that radiated to the balls of my feet and reached the point of forcing me off running and even walking for more than half a mile. The effect of these shoes was nothing short of magical. My foot pain diminished over the course of the first week and then disappeared. I began walking two miles a day, then three, and after a month I resumed running--all pain free. It is now six months later they are wearing well, with none of the foot problems I had experienced before. Big fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Magnificent Spatulatail",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Mizuno is my new favorite running shoes",
      "text": "I used to be a big fan of Asic. But since Asic changed the fit of their famous Gel-Nimbus, I switched to Mizuno. I was desperate when I tried their new fit Nimbus shoes. They were too small, to narrow for my feet. I felt betrayed since used Asics shoes for more than 10 years. I tried several brand and models and Mizuno is almost good as Asic was in its good years. I tried Books ( not enough cushion), Nike (simply the worst running shoes), Hoka ( very strange feeling, not comfortable at all), Adidas ( poor support), and Saucony (not enough cushion, very average support). Mizuno is now my best running shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Confidential",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Inspire is the best shoe",
      "text": "Mizuno wave inspire have been the preferred shoe since the 8s. In additional to an added insert under the sole; the durability lasts about 9 months. And that’s with 10-15 miles of exercise per week and I’m an educator that wears them daily. I’ve tried other models but the inspire is hands down the best model, shoe... period!",
      "rating": 5.0,
      "verified": true,
      "author": "Heath",
      "helpful_votes": 4,
      "publication_date": 20190316
    },
    {
      "title": "Very good running shoe for a lightweight over-pronator",
      "text": "This is my nth shoe of the Mizuno Wave Inspire series and they've all been good. I'm a significant over-pronator (flat feet) but also light: male, about 5-8 and 130 lbs. Have tried motion control shoes in the past but these do the trick, with no problems even on long runs, and they're lighter & more comfortable. With any running shoe the fit is important. The Mizuno Wave Inspires happen to fit my feet just right: relatively narrow and snug at the heel, so the shoe doesn't slide down off the foot. Good for all surfaces from concrete to dirt, and a durable product as well. If the shoe fits you, I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike in Pennsylvania",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Recommended",
      "text": "First time buying Mizuno. And this was as expected, right mix of cushion and responsiveness. Do around 5k 3-4 times a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Ahmad",
      "helpful_votes": 3,
      "publication_date": 20190306
    },
    {
      "title": "Satisfied on first arrival",
      "text": "I just received these from Amazon today. I have a wide size 12. They fit perfectly for my foot. Arch support feels good. I have always had good luck with Mizuno products in the past although they are pricier than other brands. The construction seems solid but I will apply an addendum if this sneaker doesn't hold up as expected. In general I replace my sneakers every 6-12 months so, IMO, they should have expected wear and tear by then.",
      "rating": 5.0,
      "verified": true,
      "author": "S&H",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Fit as expected, feel great",
      "text": "My son has been a long distance runner for years, and we bought these for him. He says they feel great and fit as they should. He had researched several brands before purchasing, and after trying on at the store decided to go with these due to their fit, balance, and overall comfort while running. He states he would buy this brand, and even this style again should he ever need another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "sking",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "A Good Year for the Wave Inspire Model",
      "text": "Very pleased with the shoe. This shoe model has a history of small design changes which always makes me hesitate getting a newer model. Fortunately this year they got it right for my foot type. I have slight to mid arches and between a wide and regular foot. I purchased the regular size, not wide and these shoes feel great. I’m considering buying another pair or two for when these wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "K.Moore",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "This shoe is beautiful!",
      "text": "This shoe looks lovely! Great design and super nice! A little bit pricey. Unfortunately, it didn't fit me 100% so I gave it to my cousin as a birthday gift. He loved it. So it's still a 5-star product. Never heard of Mizuno before until today. I'll check the other Mizuno's tonight to see if there's more designs like this. Will buy another one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuuki",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Highly recommend. I keep buying this shoe year after year",
      "text": "I love these shoes. I have ordered the same (but updates) model of these shoes over and over again (I’m on my 6th pair, I think) . I am a vet tech and on my feet all day long. Since I’ve been wearing the ASICS gel Kayanos, my lower back pain and ankle pain have been reduced significantly. I over-pronate and these are very stable on my ankles. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Russell Cooper",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great Training Shoe for Distance Runners",
      "text": "I've been wearing these for a few years, this is my fourth pair of Mizuno Wave Inspire. This current pair is everything I've come to expect. Lightweight for a training shoe! Great fit for my narrow feet, durable heels and padding handle my tendency to heel-strike when tired, super comfortable and great padding for my long runs. Love these.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Excellent sole properties",
      "text": "This is my second Mizuno Men's Wave Inspire shoe. After version 14, I went with version 15 and so far (about 80 miles into it) I am very happy with it. Just like with the previous version, I am very impressed about the cushioning of the sole. It is very comfortable and has a 'springy' feel that reduces the impact on the joints. I like the sole properties of the Mizuno much better than the Brooks Adrenaline GTS (version 18), my other running shoes, which feels flat and hard and which wears off very fast. So, thumbs up! They really put some good materials/engineering into this running shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate S.",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Bye Bye Brooks",
      "text": "Giant guy running in Brooks Adrenaline for years, they cheaped out and moved to a straight foam insole, if you're close to Giant sized you know they're not for you anymore. Had a heal spur removed and tried to stay with Brooks, these beat them far and away, well into them 50+ miles and no breakdown, still strong and great feel! Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Michigan Folk",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Excellent support.",
      "text": "I don't run much, but I need good support when I do. These came when I was getting over a bad lower back ache and wearing them helped my back. They are light, but have good cushioning on the heel. The price is very good considering the ratings of this shoe. I would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick D",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Coming apart at the Soles.",
      "text": "First pair we bought from brick and mortar. Lasted several years. Bought this pair in October 2019...falling apart..back part of soles are trying to come off. What kind of quality are we paying for?",
      "rating": 2.0,
      "verified": true,
      "author": "MissyMD",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Comfortable & Well built",
      "text": "My second pair, these are very well built and instantly fit right out of box. Currently this pair is being used as walking shoes as I prepare to start jogging again. I am a heavy flatfoot long distance runner. These shoes hold up well as the miles go by.",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great shoes",
      "text": "Another great pair of footwear from Mizuno. For a japanese company, they sure offer a nice consistent & comfortable fit for my european feet",
      "rating": 5.0,
      "verified": true,
      "author": "HIRAD",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great shloes with a wear problem",
      "text": "I love these Mizunos and put miles on them. The only problem is this pair like the same in the past get a worn out spot that creates a hole near the toe leather meets netting. after about 50 miles on all their shoes. wish they lasted longer",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Greaay running shoes for pronation",
      "text": "Love Mizuno running shoes. They fit well. These really help my pronation. I usually can't where some of the other brands but Mizuno shoes just seem to always work well with my foot. I also feel these give support to my low arch",
      "rating": 5.0,
      "verified": true,
      "author": "TheBlueGrassCat",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Perfect sneakers for my wide fit foot :)",
      "text": "I needed comfort, support and that it will fit my wide fit foot. Perfect shoes! The most comfortable shoes i have ever worn. i am very sensative and these shoes really answered everything i wanted and needed. and lots of support~ best support also for heavy weight. I think it took a month and a half for the shoes to take the shape of the foot and to be 100% perfect! I love it and bought 2 more pairs so i will be able to use them for a long time :) wearing them every day and feeling so happy. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Michal H.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Wide wasn't wide enough",
      "text": "I had read enough about Mizuno that I knew I should order wide. But when the shoes arrived, \"wide\" still wasn't wide enough. (I ended up returning them.) Other than that, the shoes seemed like they were good quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Hildegart",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Shoe is at least a full size small",
      "text": "Couldn't get my foot in this shoe even though I ordered my regular size. Reviews said 91% fit as expected. Hard for me to believe. If it had fit, it would probably have been a great shoe for me. The search continues.",
      "rating": 2.0,
      "verified": true,
      "author": "Denoz",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "My favorite running shoe",
      "text": "I slightly over-pronate, and this is my third Wave Inspire I have bought. Compared the Wave Inspire 12s and 14s, these 15s have a slightly more attractive fabric weave. Otherwise, solidly built shoe that I love running (and walking) in",
      "rating": 5.0,
      "verified": true,
      "author": "Melvin",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "4th pair of Wave Inspires",
      "text": "I have worn Wave Inspires for 4+ years now, and this version fits as good as prior versions. Provides good support and comfort for my narrow size 12.5 foot Will buy this shoe again when worn out.",
      "rating": 5.0,
      "verified": true,
      "author": "NKC, MO",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Great running shoe",
      "text": "Great sneakers. I don’t live the color but only shoe I can wear that I don’t get shin splints",
      "rating": 5.0,
      "verified": true,
      "author": "Z",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "SQUEEZED MY FEET TO TIGHT",
      "text": "I REALY WANTED TO LIKE THESE. THEY JUST SQUEEZED MY FEET TO TIGHT. EVEN WITH THE 2E WIDTH THEY SQUEEZED MY FEET. IVE HAD MIZUNOS BEFORE AND LOVED THEM. BUT THE PAST 2 PAIR IVE ORDERED I HAD TO RETURN FOR THE SAME REASON.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Batten",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great Running Shoes at a Great Price",
      "text": "Great running shoes, would recommend 100%. Mizuno is the best, they take a pounding and last a long time, well made, and very comfortable. The support is in all the right places.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "Much smaller toe box than earlier model (Inspire 13)",
      "text": "I had have bought the Wave Inspire 13 over two years ago because of recommendations for flat feet and a larger toe box. I bought one pair and then bought a second pair (same model) because the first worked so well. They have been my go-to footware. I just purchased the newer model (Wave Inspire 15). The size is correct but the toe space is gone. The shoe is noticeably pointier and very uncomfortable compared to the prior version. A real disappointment. Sending it back today.",
      "rating": 1.0,
      "verified": true,
      "author": "WTRAVIS",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Good new shoe",
      "text": "I’ve been wearing ASICS for more than 15 years. Their shoes have gone downhill fast. I needed to find a new comparable shoe and this one has done the job and then some. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Best shoe out there for flat feet or any foot issues!",
      "text": "Headline says it all really. Extremely supportive shoes with enough cushion. I am on my feet all day at work and these are one of the few shoes out there that helps a flat-footed person maintain without any pain. Great shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "El Guapo",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Change for the better!",
      "text": "I’ve always loved ASICS for their support but they seem to have changed things in their recent additions (gel-360 is not good!). Mizuno have been the perfect replacement, certainly rivaling if not heat Nimbus and Kayano. I won’t go back.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Palmer",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great running shoes & for casual wear",
      "text": "This is my second pair of Mizunos. Still have the Wave Inspire 11. Super light weight and very comfortable. Not sure why I thought these would be more gray'ish? The photos are clearly green lol!",
      "rating": 5.0,
      "verified": true,
      "author": "Hitch",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great shoe. Look and feel good.",
      "text": "Christmas gift for my son in law. He loves them. Perfect gift. He has had these before and wanted another pair. He runs a lot so they hold up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen M.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Just what I wanted",
      "text": "I have been running in this model shoe for several years. They have been good to my old feet which have previously suffered from planter fasciitis.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth A Williams",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "shoe defect?",
      "text": "the arch support shape in the left shoe has a different profile than the right. I will be returning this pair for a new pair.",
      "rating": 1.0,
      "verified": true,
      "author": "Timothy FLair",
      "helpful_votes": 2,
      "publication_date": 20191007
    },
    {
      "title": "Buy this running shoe",
      "text": "Great running shoe! My husband has used this type for several years. The cost was reasonable. This is a shoe you want to purchase for long distance running",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Monarque",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Comfortable but not rugged",
      "text": "My first walk in the woods & I got a rip in the side fabric from a sticker bush....never happened to me before. Very disappointed in the quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Perfect",
      "text": "This replaced my last set of Mizunos that I had over 500 miles on, and they work just as well as the last pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Amazing Brand",
      "text": "I have a deep arch in my foot and find flats uncomfortable. This is my third pair of Mizuno’s and I LOv Them. The quality of the stitching and how well your feet are able to breath in them are Awesome. Just as long as this company sticks to there guns with the way that they produce them I will probably never where another brand. I’m a Vegan as well and the fact that these shoes are cruelty free is Huge to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus A Smith",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Mizuno gets 5 stars",
      "text": "Very confortable, great also for elderly people with spine issues, gives them extra cushion during walk. My 76 year old dad loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosa R.",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Good product",
      "text": "These are to the cheapest shoes available but they're worth the expense. Very good product and I think they look nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamesa",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Just not for me.",
      "text": "Was just a little uncomfortable for me. Went to the running store and said these were the beat shoes for me. Nice build awesome color way. Just was not for me.",
      "rating": 4.0,
      "verified": true,
      "author": "martez wilson",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Didn't hold up",
      "text": "Bought these for my daughter. She wore them for softball on turf and the gel burst through on one shoe after an hour.",
      "rating": 2.0,
      "verified": true,
      "author": "brsmHack",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Comfortable & durable",
      "text": "Bought three pairs of these in different colors. I’m on my feet for work all day and these are great. awesome support and stylish",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Dijak",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Mizuno Men's Wave Inspire 15 Running Shoe",
      "text": "I have used Mizuna's for years and they fit just perfect and they are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "James Dunnigan",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Better a track than a road shoe",
      "text": "I've run on Mizunos for years; this is the first pair that have given me discomfort in the heel and arch while running on hard surfaces, while the track and treadmill don't give me any problem. I ran on Mizuno Wave Inspire 14 before these and they were super on long road runs! I would not recommend the 15s for road trips.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Fugo",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Quality Shoe",
      "text": "This my second pair and lost count of how many Inspires I have had. I started wearing them at model 2. My favorites were the 7’s then 8’s, the 15’s are a very close third. They fit well and the finally made more than one color option for size 14 2E",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "very comfortable for running",
      "text": "very comfortable. I ordered 9.5 wide EE, it fits me very well. I have been using this model for years. I replenish it once a year.",
      "rating": 5.0,
      "verified": true,
      "author": "george grove",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Runs small",
      "text": "The toe box on these is much smaller than the Inspire 10's",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Jack",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Nice looking and fits well",
      "text": "Was able to buy wide shoe which fits me better.",
      "rating": 5.0,
      "verified": true,
      "author": "SL",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Just Right",
      "text": "I switched to Mizuno from Brooks about 3 years ago while training for my 5th half marathon. While I still love wearing Brooks runners, I've taken to my Mizunos. This is my 3rd pair and I don't see me going to a different shoe any time soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarod R. Rogers",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "My go-to road running shoes",
      "text": "This shoe works well for me. Holds up on the road, providing the appropriate level of support without being too heavy. Not the best choice for trail running as the soft sole isn’t intended for rough, rocky terrain. Comfortable and light.",
      "rating": 5.0,
      "verified": true,
      "author": "David Atkinson",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "My Go To Running Shoes",
      "text": "These have been my go to running shoes for decades. Two marathons and a lot of miles and I have never had any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher W. Jones",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Great shoe for fitness",
      "text": "Comfortable and stable. A great shoe for cardio or just walking.",
      "rating": 5.0,
      "verified": true,
      "author": "Bram Hornstein",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Being comfortable",
      "text": "They are comfortable, great for running in, and fit great!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Great shoe which fits me well",
      "text": "This is a great shoe which fits me perfectly. I bought it in Dec-2019 and the price was $70 to 80. Now its been more then 6 months and i thought lets get another pair of shoe. Look at the price, its $129.. if you jack up the price no one will but it again",
      "rating": 5.0,
      "verified": true,
      "author": "Parthasarathi Dash",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great and comfortable fit",
      "text": "This is my fourth pair of Wave Inspires, and I'm very pleased with them so far. They provide excellent stability to correct my pronation while running, and they have a soft, cushioned feel that makes them very comfortable to run or walk in. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Not so great.",
      "text": "Wish I would have gone up a size. Also, not that great arch support nor pronation support. Not really happy with these.",
      "rating": 2.0,
      "verified": true,
      "author": "AthensEd",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Nice Shoes",
      "text": "Nice comfortable lightweight running shoes. Could not prevent them from rubbing blisters on both Achilles’ tendons. Returned.",
      "rating": 5.0,
      "verified": true,
      "author": "oneski ",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Mesh torn after 2 months",
      "text": "I was not expecting the outer mesh to tear so easy. I have 2 other pair of athletic shoes, so I don't use this ones every day, and already coming apart.",
      "rating": 2.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Causing blister",
      "text": "Shoe is exactly as expected EXCEPT for some reason the left shoe inside heal has something wrong with the inside of the shoe that is rubbing a blister on my foot. Hoping as they get broken in that it goes away but when I bought this same shoe in another color at a local store, it didn’t do this.",
      "rating": 3.0,
      "verified": true,
      "author": "Claborn and Son",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Outstanding",
      "text": "I kept getting feet and Achilles issues despite being fitted for other shoes until I found these shoes at a local running store. Foot issues went away immediately so I bought another pair in a different color on Amazon to wear day to day. Most comfortable running shoe I’ve ever worn.",
      "rating": 5.0,
      "verified": true,
      "author": "MountainGuy",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Excellent but smaller",
      "text": "The y are so nice, but size runs smaller than a regular size",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great shoe, great deal",
      "text": "The product is a Best Buy noon my book. Great shoe for running at a bargain price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark T. White",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Best running shoe ever!",
      "text": "These are a perfect fit and are the most comfortable running shoes I’ve ever owned!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn1674",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "A good shoe for a flat foot distance runner.",
      "text": "I've used this brand/model for a few years ever since my Ascics GT2000's stopped fitting properly. These shoes have brought me through a couple dozen marathons and ultramarathons. Good luck!",
      "rating": 5.0,
      "verified": true,
      "author": "jameyk",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Great Shoe",
      "text": "These shoes are very comfortable. I use them for running.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Bauer",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Fan of this running shoes!",
      "text": "My father has used this running shoes on a daily basis for years. All I do is to purchase new colors anytime his shoes need replacement. I recommend, since this is a product of very good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Like running on air",
      "text": "Getting back into running. This is my fifth pair. I was fitted with Mizunos 10 years ago and have repurchased these shoes since. 15 is as good as any, what I expect.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Great fit!",
      "text": "This is a great shoe. My husband loves to run and this is his go to show.",
      "rating": 5.0,
      "verified": true,
      "author": "Shell",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great stability shoe",
      "text": "Great stability shoe. Somewhat bulky but very supportive and comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Lorza",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great Running Shoes",
      "text": "Ran 7 miles in these yesterday. Good shoes. Good experience with seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin D",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Great shoe",
      "text": "2nd pair of Mizuno’s for my husband. Perfect fit, super comfortable, and the colors on this one look great. Arrived on time",
      "rating": 5.0,
      "verified": true,
      "author": "LMR",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Great but to small",
      "text": "This item is great in style and design but it was to small. I order this brand on a regular basis.",
      "rating": 3.0,
      "verified": true,
      "author": "Raymond Nakamura",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "As advertised",
      "text": "Familiar with this shoe model. All I needed was quick service and that's what I got!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom W. Moeller",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Comfy for Walk and Run",
      "text": "Needed sometime to break in but the comfort after getting used to them is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Good running shoes",
      "text": "My first pair of Mizuno running shoes, they are great! Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Glica",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Shoes that look good and perform great and actually fit my big feet",
      "text": "Shoes that fit my feet are great. Thanks Mizuno for making shoes big enough and that still look nice!!",
      "rating": 5.0,
      "verified": true,
      "author": "Hoops13",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Confterable",
      "text": "Absolutely love these shoes. We order them all the time. I have feet problems and can wear them all day with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "James M Fontenot",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "they are  very comfort  !!!..",
      "text": "daily use only one personal problem ...that after a short time there is a hole at the front of the shoe.and than you cant fix it and its not nice to wear",
      "rating": 5.0,
      "verified": true,
      "author": "ELIK",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Great for running.",
      "text": "I’m a 6’03” 300lb male. These shoes are comfy and very light yet give great support.",
      "rating": 4.0,
      "verified": true,
      "author": "Hector Martinez Jr.",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Size fit exactly as described",
      "text": "Arrived on time, fit exactly as requested, very high quality shoe will put it on my next marathon",
      "rating": 5.0,
      "verified": true,
      "author": "Hazim Azawi",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "great fit and very comfortable",
      "text": "The shoes fit great and they are very lightweight and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael K. Skinner",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "My Favorite Shoe!",
      "text": "This is the perfect show for me. I have tried many different shoes, but these last long and provide excellent support.",
      "rating": 5.0,
      "verified": true,
      "author": "Proclaimer of Hope",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Camo green",
      "text": "We thought this shoe was a dark gray and silver, instead iyer is more of a camo green. We sent it back for a different color.",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Great price",
      "text": "Great shoe for the price! They are more green than they look in the pics though.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Patra",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great Shoe",
      "text": "Great shoe, very comfortable, lot of support for over pronation",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Fit and feel wins me over every time",
      "text": "I like the fit and feel of the Mizuno Wave Inspire 15. The replacement model, which is the 16, has neither a good fit or good feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Hurtt",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Comfortable shoes but poor durability",
      "text": "70 days into wearing these shoes the heals support inside the shoe has crumbled leaving quarter size holes with no cushioning.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa M. Cobb",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great deal on a great running shoe!",
      "text": "This shoe is a perfect fit for me and my style of running! Great product at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "John A.",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Highly Recommend",
      "text": "I suffer from planters fasciitis and have a low arch, these shoes are the answer to my prayers! Buying another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "T.Grover",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Avoid",
      "text": "It’s a very stiff and uncomfortable shoe vs prior Inspire line shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Looks good.",
      "text": "Supportive. Easy to increase my mileage. I prefer the subdued look.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Gewirtz",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great shoe for heavuer runner",
      "text": "Great shoe for heavier runner. 10mm drop heel to toe.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Stephenson",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Great shoe!",
      "text": "I've been wearing wearing this style of running shoe for years and each new version is better than the last!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan R.",
      "helpful_votes": 0,
      "publication_date": 20190417
    }
  ],
  "product_meta": {
    "title": "Mizuno Men's Wave Inspire 15 Running Shoe",
    "description": "Over 15 years ago runners came calling for a go-to shoe for the moderate over-pronator. The answer from Mizuno back then was the Wave inspire. The latest version is offering a new upper with a softer fit and a more wearable look. Also, equipped with the latest Mizuno Wave technology for an energetic and cushioned, yet stable ride.",
    "rating": 5,
    "feature_bullets": [
      "MIZUNO WAVE: Wave sets the standard for running shoe technologies.",
      "This best selling stability running shoe provides the perfect balance of smooth cloudwave cushion, snappy responsive flex, and stable ride.",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Engineered Mesh Upper: Both breathable and durable for high performance.",
      "New Premium Sockliner for added comfort",
      "U4ic Midsole: Optimal shock attenuation, durability and a superior ride"
    ],
    "specifications": {
      "Date First Available": "23 Nov. 2019",
      "Manufacturer": "Mizuno",
      "ASIN": "B081XQBV7P",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 98.57
  }
}