{
  "website_summaries": [
    {
      "verdict": "A multi-purpose massager with a streamlined design. You'll love the cold and hot options and soothing massage action it provides.",
      "pros": [
        "Has a contoured head with dual sides that are coated in silicone and fit comfortably around the eyes",
        "Massaging side has tiny tips for added stimulation, and smooth side offers both cold and heat therapy",
        "Has a rechargeable battery",
        "Backed by a one-year warranty"
      ],
      "cons": [
        "Some users may find it a bit awkward to use at first",
        "but it offers relaxing results once mastered"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beauty Tool That Feels Good to Use!",
      "text": "I love all the functions and especially uses the “Relieve” (hot then cold function) religiously every morning. Within a week I noticed my eye lid was more defined, the puffiness under my eyes was reduced, and the dark circle lightened. In addition, the cold function really helped me wake up in the morning. I cannot live within this tool now!",
      "rating": 5.0,
      "verified": true,
      "author": "Binh",
      "helpful_votes": 10,
      "publication_date": 20190323
    },
    {
      "title": "Did not work",
      "text": "Did not work for me and was uncomfortable to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas S.",
      "helpful_votes": 4,
      "publication_date": 20190508
    },
    {
      "title": "Easy to carry. Very Sleek!",
      "text": "Easy to carry where ever you go after a busy day. The device will gradually heat up and gently massage the eyes. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Lan",
      "helpful_votes": 7,
      "publication_date": 20181209
    },
    {
      "title": "Instant Fix for Puffy & Tired Eyes",
      "text": "The combination of hot and cold really helps to de-puff the eye area. After a week of use, I noticed my dark circles weren't so apparent and my eyes look bright and defined even without any makeup. I love using this beauty tool with my eye serums. I feel like it helps the product to absorb deeper into my skin, I'm definitely a big fan of this and will continue to use it for the foreseeable future.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitty",
      "helpful_votes": 2,
      "publication_date": 20200320
    },
    {
      "title": "Great Idea for Eyes in the 21st Century",
      "text": "I enjoyed using this product the first few times, but I have only used it once a month since the first couple of weeks. Easy to use but you might want to sit down and relax when you use it. Did not really feel any relief in eye strain or discomfort after using it. The price for this product is pretty high too.",
      "rating": 3.0,
      "verified": true,
      "author": "Calvin Cristales",
      "helpful_votes": 3,
      "publication_date": 20191104
    },
    {
      "title": "Good massager",
      "text": "I haven’t used it for long, but so far, I like it. It gives good therapy. I feel refreshed by using the first mode every morning. This massager can release my dropsy very well.",
      "rating": 5.0,
      "verified": true,
      "author": "April C.",
      "helpful_votes": 5,
      "publication_date": 20180821
    },
    {
      "title": "Stimulates and relaxes eyes",
      "text": "This product works as intended and helps with tired eyes. It also comes with a soft carrying case.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Tommasino",
      "helpful_votes": 3,
      "publication_date": 20190207
    },
    {
      "title": "Great eye massager",
      "text": "Works great, already can notice progress of removing my dark circles after using only for few times. Super easy to use with clear instructions. Love the alternate mode with cool and heat feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Sasa",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Would be better with a bigger metal head",
      "text": "The cool/heat system is soothing and comforting. I use cool-mode when my eyes fell swollen and heat-mode when tired, and it does make my under-eye puffiness look slightly better temporarily. My only complain is that the small and shallow curved metal head is not holding eye very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Yiman Sun",
      "helpful_votes": 7,
      "publication_date": 20190110
    },
    {
      "title": "High Quality!",
      "text": "The product was received as described. This is a very solid wand made of high quality material & it is very easy to use. The massage side is just enough vibration, it's not too aggresive. The heating side heats up quickly & is the perfect temperature, not too hot. After using this your eyes feel refreshed & rejuvenated.",
      "rating": 5.0,
      "verified": true,
      "author": "Faroutman",
      "helpful_votes": 5,
      "publication_date": 20190102
    },
    {
      "title": "Not what i Expected",
      "text": "The setting are hard to manipulate thru and the motion is very low. I returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert G.",
      "helpful_votes": 5,
      "publication_date": 20181112
    },
    {
      "title": "Great idea, but...",
      "text": "Loved the cool function, very comforting on sore eyes. However, problems with the other functions on the second use. These worked intermittently. Thought I might've gotten a lemon, so I bought a replacement. Still loved the cool function, but the other functions failed on the first use. Am hoping that the manufacturers will work on getting the product to function as it's supposed to.",
      "rating": 1.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great Product",
      "text": "Love this product.I always needed something like this.Now I dont have to keep those eye mask in my fridge,this product give me both heat and cool message.My whole family uses it.",
      "rating": 4.0,
      "verified": true,
      "author": "Puneet Jain",
      "helpful_votes": 3,
      "publication_date": 20190119
    },
    {
      "title": "Works as advertised.",
      "text": "It does exactly what they say it does. Seems to have made a difference in my wifes crows feet. For me it just relaxes my tired eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Freidman",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Relax",
      "text": "I could relax and could reduce my eyes stressful. Cooling, warming and combination are good relaxation.",
      "rating": 5.0,
      "verified": true,
      "author": "Shigeru Hasegawa",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Good enough lol",
      "text": "Works pretty well. Needs to charge a lot but the massager is the best.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Benton",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "It was a returned item and it didn't work",
      "text": "When I received it the box was taped, it seems to have been returned, the inside of the container that housed it was dirty, the wires and bag were refolded. I charged it but nothing happened. I so wanted this to work.",
      "rating": 1.0,
      "verified": false,
      "author": "Donna ",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Good buy",
      "text": "Really like this product! Gets really cold and warm quickly. I use it to help relieve sinus pressure and it works great. Very refreshing.",
      "rating": 5.0,
      "verified": false,
      "author": "B Elliott",
      "helpful_votes": 0,
      "publication_date": 20200619
    }
  ],
  "product_meta": {
    "title": "Mynt Eye Energizer with Hot and Cold Therapy - Touch Activated Silicone Massager - Revitalize Eyes and Boost Beauty Routines: Combat Eye Bags, Smooth Crow's Feet – Handheld, Light & Portable",
    "rating": 3.7,
    "feature_bullets": [
      "REFRESH/ COLD THREAPY: Cools rapidly to 64°F to revitalize eyes, refresh your mind, help reduce eye swelling and undereye puffiness.",
      "RELIEVE/ HEAT THREAPY: Heats up to 104°F to relax tired eyes, promote skin absorb moisturizers to amplify skin hydration and combat crow's feet.",
      "REVIVE/ COLD AND HEAT THREAPY: Rotates between hot and cold to improve blood circulation and target dark circles.",
      "ONE-TOUCH MASSAGE: Pressure-activated silicone tips massage around the face to help skin naturally exfoliate, brighten the appearance of eyes.",
      "12-MONTH WARRANTY/PERFECT GIFT: Always care for your beloved ones. Buy with confidence by knowing Mynt stands behind our products and offers 12 months warranty for any quality issues."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "10 x 4 x 2.5 inches; 5.6 Ounces",
      "Item model number": "AK-M3430141",
      "Batteries": "1 Lithium ion batteries required.",
      "UPC": "742271397570",
      "Manufacturer": "OceanPal Technology",
      "ASIN": "B07DBXS32F",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Rollers & Pens",
      "Eyes",
      "Beauty & Personal Care"
    ],
    "price": 49.99
  }
}