{
  "website_summaries": [
    {
      "verdict": "A single controller mount for those on a budget.",
      "pros": [
        "This controller mount includes 3M adhesive but can also be mounted with the included screws and wall anchors if you want the added security",
        "Customers love how sturdy this holder feels"
      ],
      "cons": [
        "Though it's a good price for a single mount, you'll save money buying a 2-pack of a different brand"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Well designed",
      "text": "Great product for getting the controller out of the way, I personally use it under my desk mounted to the side wall and is very unnoticable unless you are looking for it, the item is metal but is powder coated (I believe) do you do that have to worry about scratching up your controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 6,
      "publication_date": 20180817
    },
    {
      "title": "Love this",
      "text": "I love this product. No more losing my controller. Or having it sit on my desk all awkwardly. I didn't use the adhesive so I can't review that aspect but I absolutely love this and will definitely be buying another one when i get another controller 😊",
      "rating": 5.0,
      "verified": true,
      "author": "leah",
      "helpful_votes": 3,
      "publication_date": 20200210
    },
    {
      "title": "Works and looks great!",
      "text": "Great for organizing, can mount it with included screws or included 3m adhesive. Doesn't damage the analogs or force them out of the nuetral position (which was a slight concern, before a lengthy trial).",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 4,
      "publication_date": 20190105
    },
    {
      "title": "Falls off after 2-3 months on dry wall",
      "text": "Great design but adhesion is awful. I bought these because I didn't want to drill holes into my wall but they started falling off just 2-3 months after installation. This product is great in theory but I can't afford to buy a new one every 2-3 months. I bought 3 of these and 2 of them fell 2-3 months in with just regular use of holding a single controller. Perhaps the reason why it's falling off so easily is because I installed it on dry wall.",
      "rating": 2.0,
      "verified": true,
      "author": "Tiffany Hsu",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "Great idea, BUT fell off the wall within a week",
      "text": "We applied this to our living room wall and seemed to be working, until it came crashing down in the middle of the night :( We followed all instructions and the mount is placed out of the way, so it's not like we're knocking into it or disturbing it in any manner that would cause it to fall off. I will contact the seller, but will try to command strip or velcro strip it (from Staples). If you screw mount this, I don't see any issues, but I rated 2 stars because I was trying to avoid holes, but now have to deal with peeled wall ...",
      "rating": 2.0,
      "verified": true,
      "author": "Kristal",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Need more quality control in packaging",
      "text": "Only have of my order was correct! Now I have to wait on a replacement, ordered 2 PS4 mounts and only received 1 correct one, the other was for an Xbox I’m assuming bc the mount wouldn’t fit my control at all. ALSO only 1 came with the adhesive 3M tape, easy fix though I split the 3M in half and decided to mount it anyways to test it out and avoid the return process. But definitely not satisfied now I have to do the return process anyways. Another thing the labels on the box both are identical, they both say that they’re for PS4, maybe someone placed the wrong item in the wrong box. Who knows.",
      "rating": 1.0,
      "verified": true,
      "author": "Andres Lira",
      "helpful_votes": 2,
      "publication_date": 20190617
    },
    {
      "title": "Does not stick",
      "text": "So if you're trying to just stick this on with a double sided 3m tape without screwing it into the wall I wouldn't recommend this. It seemed sturdy at first but after about a day of the adhesion would not stick onto the metal. I even tried using a different brand of 3m tape and it still keeps falling off. So honestly if you're notnplanning on screwing this into anything don't bother getting this.",
      "rating": 2.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Perfect fit for my controller",
      "text": "I was skeptical about this mount because it claimed to be perfectly cut for a PS4 controller. The description wasn't lying and this mount is a higher quality one than my others that are universal.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Smith",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Gets the job done",
      "text": "I like it keeps the controller from getting lost it is made very well it comes with all you need to mount it wherever you want and yes I would buy it again if I had more then one controller. ***** nice job",
      "rating": 5.0,
      "verified": true,
      "author": "Home Repare Man",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "The absolute BEST wall mount for your PS4 controller. -  I hope the make one for the PS5 controller.",
      "text": "The absolute BEST wall mount for your PS4 controller. It cradles it’s perfectly. The controller charges easily while in the cradle. I hope the make one for the PS5 controller.",
      "rating": 5.0,
      "verified": true,
      "author": "AmznAdct",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Fits great, does what it supposed to do.  A bit expensive, though.",
      "text": "Works great, have my PS4 controller mounted on my desk right next to my bed. Only negative is the cost. Its literally just one piece of folded metal, not sure why its so expensive. But it works, and was the only option, so there's that.",
      "rating": 4.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Sturdy well built ps4 controller wall mount",
      "text": "Product feel sturdy holds my controller with ease does not put pressure on joystick controller fits comfortably. Mines was defective at first but customer service was awesome and took care of it really fast",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Lim",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Compact, great for clutter in a gaming room",
      "text": "Great buy for reducing clutter. Make sure you get it level. Only downside is if you plan to change it while it's in there the cord is pressed against the wall which could damage the cord or the port of the controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "So convenient!",
      "text": "Sticky adhesive, but didnt work too well on my wall lucky for me this comes with both drywall screws and adhesive pad so it works awesomely!! Purchase with out a doubt and with confidence my gaming friends this is a awesome control holster",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G.",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "great looking",
      "text": "this thinghies do really give a nice look. bought 2 of them and couldnt be happier. FYI dont put them where your litte boys can reach them and pull them form the wall lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Imaña",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Love it!",
      "text": "I picked this up and installed it on my \"gaming table\" and it works great. The PS4 controller drops right in and will not move without help.The opening in the bottom is great for the charging cable. I can't rate the adhesive cause I didn't use it. I just drilled.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Highly recommend",
      "text": "Nice easy to install mount. Includes 3M adhesive tape and screws if you prefer or need this option. Just need a level to get a perfect straight angle or just eye ball it and get as straight as possible without a level as I did.",
      "rating": 5.0,
      "verified": true,
      "author": "drake",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Worth it",
      "text": "Great controller holders. I mounted 4 PS4 Controllers next to my tv and they look great and very symmetrical. Hardware is good, I lost one of the screws but they are pretty simple screws so I used one of another size and it works just as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Godwin",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Worth it !",
      "text": "Great product, at 1st when I mounted it to the wall , it was a lil to tight , as in the top buttons were rubbing against the wall but I just unscrewed and gently bend it a lil and bam it was just fine . Feels super sturdy and looks great on the wall . Happy customer 😁",
      "rating": 5.0,
      "verified": true,
      "author": "June",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Awesome",
      "text": "Exactly what I need to finish organizing my gaming desk. Fits well and does what it needs to.",
      "rating": 5.0,
      "verified": true,
      "author": "J.R. Leeper",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Work good look good",
      "text": "These are great for storing your controllers and they don't fall out.",
      "rating": 5.0,
      "verified": true,
      "author": "Titan75482",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Better than the rest.",
      "text": "Made of METAL, not plastic like the others you will find. Fits my DS4 even with a silicone protective cover on it. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "matthew",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Easy to install, holds controller tight.",
      "text": "I looked at alot of mounts, let's say this one may be a buck or two more but there is no way the controller is falling and hitting the floor. This is simply the best.",
      "rating": 5.0,
      "verified": true,
      "author": "benjamin l arndt sr.",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Worth the money",
      "text": "They came with everything need to hand them! Fit the ps4 controllers well",
      "rating": 5.0,
      "verified": true,
      "author": "Carson M.",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "ps4 button cut out?",
      "text": "it's really well made! the ONLY problem i have with it, is that it doesn't have a cut out for the ps4 BUTTON! I walked up to it and without thinking attempted to pushed the center and was like OH.. 😢. Other than that, no problems here.",
      "rating": 4.0,
      "verified": true,
      "author": "Rene Reyes",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Sturdy and safe",
      "text": "Love it Metal and sturdy I don't worry about the controllers breaking anymore",
      "rating": 5.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Not that Great...",
      "text": "Unless you have two pair of channel locks to bend this thing into the shape you want it it, it's useless. It comes bend too far inward where when you mount it to the wall, you cannot get a controller to sit in it.",
      "rating": 2.0,
      "verified": true,
      "author": "Lynn G",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Awesome",
      "text": "Dual Shock 4... not much to say, best controller on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Moore",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "PS4 Controller Wall mount",
      "text": "This is a Great wall mount for Ps4 controllers. Once mounted the controller will not fall at all. Comes with 3M tape as well. But i went with screwing it on to the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "José",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Easy install",
      "text": "Controller fits perfectly inside the mount. Super easy install. Pair this item with a console mount for a clean look.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeV",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "It's worth it",
      "text": "Holds very well. The 3M adhesive hold well highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Darren",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Didn't Stick, Broke My Controller",
      "text": "This item failed to stick to the wall as advertised. I took great care while installing it with the adhesive. The adhesive failed in the middle of the night, woke up my entire household in the process, and broke my custom controller.",
      "rating": 1.0,
      "verified": true,
      "author": "jonathan",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Adhesive doesn't work.",
      "text": "The mount itself is nice and feels hefty, but the adhesive is junk. i bought this specifically for the screw-free application and it seems like I can't get that. I can't just screw it into metal",
      "rating": 1.0,
      "verified": true,
      "author": "Jay Tee",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Well made for a great value.",
      "text": "Great for display or storage purposes. Will be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "It was good",
      "text": "It’s good it did last about 3 weeks hung with the sticky tape holding a controller but, it fell and now I have to screw it in.",
      "rating": 4.0,
      "verified": true,
      "author": "TurboTurtle",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "It just metal",
      "text": "I like hod sturdy it is but I dislike how difficult it can be to grab my controller I can't just grab it you have to me slow and gentle or you'll mess up your controller",
      "rating": 5.0,
      "verified": true,
      "author": "Willkilli",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Awesome product! Clean look",
      "text": "Works great! I stuck it to a floating shelve right above my gaming monitor. Adhesive works good and controller (ps4) fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Carlos Arguello",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "PS4 Controller wall mount",
      "text": "Very nice clean way to mount my remote controls on the wall behind my TV. A very clean look, the controllers fit in perfectly. I would definitely recommend this for anyone that wants a clean look for their PlayStations",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Elliott",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Nice to have",
      "text": "These are good work great with the controller. Have to use the screws the tape alone didn’t hold.",
      "rating": 4.0,
      "verified": true,
      "author": "wanda",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Sturdy and Low Profile",
      "text": "Solid, easy to mount and exactly what I was looking for to hide the controller behind the wall mount tv",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lambertsen",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "These are Awesome..",
      "text": "I have replaced any other holder I had for my PS4 controller with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott by Design",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Adhesive works",
      "text": "Works great haven’t had any problems with the product. Adhesive works fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Zack Henry",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Sharp looking holder",
      "text": "Works great, looks sleek. Also fits a Switch controller adapter bc of the space in the base!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Shopping",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Great",
      "text": "Nice little mount for your control and you cant misplace it",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas P Turner",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Really useful",
      "text": "Like that its easy to set up. And controllers are not just laying but hanging",
      "rating": 5.0,
      "verified": true,
      "author": "Nasha’s Beauty Bar",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "STURDY",
      "text": "I used this to wall mount my controller this mount can hold my whole body weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Definitely worth it",
      "text": "Great product, the notches definitely help secure the controller in place",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon W",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Looking for wii remote wall mount?",
      "text": "Liked it alot!!! Do they make one for Nintendo wii remotes?",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Glocke",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Good PS4 Controller Wall Mount",
      "text": "Custom made to hold a PS4 controller. Works great and looks amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Kelley",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Yup",
      "text": "Cant go wrong with this, very easy to install and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "As Expected",
      "text": "Product was great and exactly what I thought it was.",
      "rating": 5.0,
      "verified": true,
      "author": "Psymon Potts",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Bracket good. Sticky pad isn't",
      "text": "The bracket is good quality. Unfortunately the sticky pad that comes with this product couldn't hold the bracket up for more than a day.",
      "rating": 2.0,
      "verified": true,
      "author": "Conor Forsythe",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Excellent product",
      "text": "Easy to install and to keep games organized and does not use much space on the wall",
      "rating": 5.0,
      "verified": true,
      "author": "Maria  Garcia",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "KCCO",
      "text": "The 3M application works well so I didnt even use screws. Looks great and helps clear space.",
      "rating": 5.0,
      "verified": true,
      "author": "D3ATH",
      "helpful_votes": 0,
      "publication_date": 20190514
    }
  ],
  "product_meta": {
    "title": "Monzlteck New Wall Mount For PS4 Controller(DualShock 4),Custom Design,NO Falling,Screw-Free Application",
    "description": "Convenience is everything in todays world, and we at Monzlteck want to ensure that your have the best possible experience while using our products. Customer Service is our first and foremost priority and we would not endorse a product if we didn’t feel it was the absolute best that it could be. We take a lot of pride is creating products that make your life easy. When is comes to playing your PS4, the last thing you need to worry about is where your going to place it and whether it will be damaged. Eliminate the worry and create an environment that is not only stress free, but will make it easier than ever to enjoy all the games that you love.",
    "rating": 4.7,
    "feature_bullets": [
      "1.CUSTOM DESIGN.wall mount specifically for PS4 controller",
      "2. NO Falling - The mount holds the controller securely. No falling if anything bumps the wall",
      "3.EASY INSTALLATION: You’ll be able to install this wall mount quickly and easily.+optional screw-free application",
      "4:SPACE SAVING: Organization for your gaming area",
      "5:100%SATISFACTION GUARANTEED: Please contact us if you experience any issues, because customer satisfaction is our #1 policy!"
    ],
    "specifications": {
      "Package Dimensions": "3.23 x 3.07 x 2.36 inches",
      "Item Weight": "4.2 ounces",
      "ASIN": "B07D6CC7F7",
      "Customer Reviews": "4.7 out of 5 stars295 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#7,580 in Video Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 20, 2018",
      "Manufacturer": "Monzlteck"
    },
    "categories": [
      "PlayStation 4",
      "Mounts, Brackets & Stands",
      "Accessories",
      "Video Games",
      "Electronics"
    ],
    "price": 9.99
  }
}