{
  "website_summaries": [
    {
      "verdict": "Versatile Bluetooth speaker than gives up to 50 hours of music on a single charge.",
      "pros": [
        "Allows for connecting music playback source through Bluetooth or AUX cord",
        "After charging the speaker, you can plug a tablet or smartphone into the speaker to charge those devices",
        "Offers wireless Bluetooth connection over 49' distance"
      ],
      "cons": [
        "Offers some weatherproof capabilities, but may not stand up well to continuous rough weather"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "SOLAR POWER!!!",
      "text": "The sound on this lil speaker is pretty decent. That’s the main thing I wanted it for but the other features on this are just a plus... like being able to charge the speaker just by leaving it in the sun. ****update**** this thing being waterproof is a life saver!!! I would like to close this review out by saying I am not the smartest person in the world but I can tell the difference between a good and a bad product. I love doing reviews and I hope to one day become the number 1 reviewer on amazon. If this review has helped you any at all please hit the helpful button!!! Thanks!!!",
      "rating": 5.0,
      "verified": true,
      "author": "GOHARD",
      "helpful_votes": 62,
      "publication_date": 20190602
    },
    {
      "title": "Great speaker for the trail or jobsite",
      "text": "Powerful little speaker that is easy to use and easy to connect. It took longer than I wanted for the battery to charge. However, once it charged I couldn’t run the thing down no matter how long I streamed music! I used this for an entire day while on a trail job in the woods. The speakers worked great, sound quality and volume were good and the music was welcomed. Plan on purchasing another one as a gift for Christmas!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Bloom",
      "helpful_votes": 35,
      "publication_date": 20181215
    },
    {
      "title": "The damn thing works!!!",
      "text": "The speaker was quick and easy to connext via Bluetooth. Aux input cable is easily detected. If you switch between aux and bluetooth you have to press the phone call button on the device. The voice that prompts is a bit annoying since it has a heavy Chinese accent. But meh, you get over it quickly. Other than that, the solar charging and battery pack charging for your usb device works awesomely. Charged my phone while bumping some Underground Hip Hop in my garage. Good times.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 24,
      "publication_date": 20190224
    },
    {
      "title": "Great sound and longtime drive battery",
      "text": "Love this speaker. It's simple to set up, with clear buttons and instructions. The sound is amazing, I can have the speaker in the kitchen and walk into the back bedroom and still hear it clearly. I watch Netflix while drying my hair and I can hear it above my hair dryer. I can hear it outside if I turn up my Kindle or iPad.",
      "rating": 5.0,
      "verified": true,
      "author": "Dajian",
      "helpful_votes": 18,
      "publication_date": 20190214
    },
    {
      "title": "audio quality is very good",
      "text": "The audio quality is very good. It is easy to set up. I like the feature of TF Card Playing, which can play music as MP3 player , not necessary to connect your phone. It is a little big and heavy. The waterproof function is good, the side effect is that you need to press the key a little bit harder. Also I like that this speaker could be worked as power bank. The solar charges very slowly, could not fully charge the battery.",
      "rating": 5.0,
      "verified": true,
      "author": "rinllow",
      "helpful_votes": 18,
      "publication_date": 20181115
    },
    {
      "title": "Solve my problem",
      "text": "I bought a new desktop from dell outlet, but the audio is bad. Thanks to this speaker, although it can not be expected as Bose, it worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 21,
      "publication_date": 20180826
    },
    {
      "title": "Solar charging and dust proof",
      "text": "Small in size but huge sound effect. The best thing I like is its solar charging and dust proof function. My husband can carry with him when work outdoors and enjoy his favorite musics. He never needs to worry about finding the charging port any more.",
      "rating": 5.0,
      "verified": true,
      "author": "Cherry Chow",
      "helpful_votes": 26,
      "publication_date": 20181021
    },
    {
      "title": "Extreme equipment",
      "text": "Sound effect is good, solar energy function is good, I am an outdoor worker, do not worry about no electricity, there is USB output port can charge mobile phones, a good multi-functional sound price is also appropriate.",
      "rating": 5.0,
      "verified": true,
      "author": "TomtomGao",
      "helpful_votes": 20,
      "publication_date": 20181003
    },
    {
      "title": "Best Speaker Ever",
      "text": "This is a great portable speaker for everyone to use! The sound quality is great. The music is loud enough to hear. Setting up the device and connecting it to your phone is very straightforward. You can connect the speaker to audio so you can receive calls. The speaker itself is very light and easy to carry around. You can charge the speaker by placing it in direct sunlight (it’s a solar powered speaker).",
      "rating": 5.0,
      "verified": true,
      "author": "Karen ",
      "helpful_votes": 15,
      "publication_date": 20190222
    },
    {
      "title": "Great sound quality and long time playing",
      "text": "It is a great outdoor product, light weight and convenient size. This solar Bluetooth speaker can be long time playing is not only because of built by strong battery, but also with solar power. It’s very convenient and useful for outdoor party. High quality of sound as this price and easy to be connected are the reasons that I would like to recommend. Nice!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 15,
      "publication_date": 20181101
    },
    {
      "title": "This is great",
      "text": "This is great for outdoor or camping, because solar energy, it will not require frequent charging, and the quality is very good, the music is very clear, this will be a good choice",
      "rating": 5.0,
      "verified": true,
      "author": "NingHui T.",
      "helpful_votes": 9,
      "publication_date": 20190910
    },
    {
      "title": "Worth buying",
      "text": "Works perfectly without any problems at all. Waterproof all the way through",
      "rating": 5.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 15,
      "publication_date": 20190212
    },
    {
      "title": "You really don't have to charge it.",
      "text": "Bought this speaker for my husband as a late birthday gift. He really loves it. And the best thing is you really don't have to charge it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yoki",
      "helpful_votes": 16,
      "publication_date": 20181120
    },
    {
      "title": "Great Product 👍🏽💯",
      "text": "All around Awesome, was easy to connect. A really great Buy great Product would recommend ⭐️⭐️⭐️⭐️⭐️👍🏽💯",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 15,
      "publication_date": 20181212
    },
    {
      "title": "highly recommend.",
      "text": "stylish extend speaker. very convenice to use, can be carry to room to room. I can't wait to use it during summer time when I go to beach or camping. I am highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "NewYorker",
      "helpful_votes": 15,
      "publication_date": 20181202
    },
    {
      "title": "my favorite Bluetooth speaker.",
      "text": "Don’t worry about running out of battery .it is solar Bluetooth speaker. my mom use is for morning exercise in the park. she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fang",
      "helpful_votes": 15,
      "publication_date": 20181107
    },
    {
      "title": "I like it",
      "text": "Hello Amazon people this is the perfect little speaker for outside I charged it once I've used it multiple times I haven't even charged it to get I've kept it out in the sun I believe it charges itself turn it on automatically you can connected without pressing any other button it's loud and clear almost like a JBL so far I have it plugged it in again since I got it it's been charging itself as long as you keep it in the sun",
      "rating": 5.0,
      "verified": true,
      "author": "William Silva",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "Annoying Low Battery Announcement",
      "text": "Once ther battery gets to 40% it will constantly interrupt what your listening to every 30 seconds with \"low battery please charge\". I don't need to hear about the low battery until it hits 10%, but naw I get be constantly annoyed by this crap speaker.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 3,
      "publication_date": 20191216
    },
    {
      "title": "POS",
      "text": "EHH.... For the money, you can get waaay better speakers than these! There's absolutely no bass! Sound distorts starting at 60ish% volume. Actually sounds like tiny Speakers in a hollow plastic tube! All plastic construction! LOOK FOR SOMETHING ELSE if you dont need solar ! Ive only had this for a few days so i cant comment on its solar capabilities, but thats not as important as having decent sound to me. Update: left outside for 24hrs under direct 99 degree las vegas sun. Used the next morning, immediately got a \"low battery, pls charge\" prompt... Returning",
      "rating": 1.0,
      "verified": true,
      "author": "Ohmar C. Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Good solar spe",
      "text": "Its a great solar option. Not sure how much life I will get out of it long term, but it is sturdy, has decent sound and is portable. I no longer need to worry about charging as long as I have the sun. Perfect for power outages just make sure your cell phone is charged!",
      "rating": 4.0,
      "verified": true,
      "author": "eleanor",
      "helpful_votes": 2,
      "publication_date": 20200416
    },
    {
      "title": "Great bargain for the features, sounds just ok, cant complain",
      "text": "Solid set of speakers with a big battery, solar capability, and phone charger. Sound isnt the greatest but the price compared to other speakers with similar capabilities makes that tradeoff worth to me. Bose these are not and that's ok to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 4,
      "publication_date": 20181230
    },
    {
      "title": "No battery life, horrible product",
      "text": "I fully charged this before leaving for an Easter camping trip. This was our only music speaker we brought since we thought the solar charge would be sufficient -- it died within an hour of playing music (in the sun) and then would do a warning \"battery dying please recharge\" over the speakers interrupting your music every 10 minutes for hours on end. It would say it was dying but would continue to play for hours... however, interrupted every 10 minutes. Disaster. Party ruiner. Dont buy this one",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Munford",
      "helpful_votes": 3,
      "publication_date": 20190425
    },
    {
      "title": "interesting speaker but average sound.",
      "text": "for a solar speaker its pretty great but im so used to the aiwa exos 9 that the quality of this thing is garbage compared in bluetooth tier. not to mention ive been playing this loud for a few days and just today the tweeters are already giving out. the charging option is great though but its lame you cant charge the speaker at the same time as your phone. with not many solar speaker products ill be looking forward to others.",
      "rating": 3.0,
      "verified": true,
      "author": "4fuch",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great sound quality and waterproof makes it easy to take everywhere",
      "text": "I was pleasantly surprised by how good the sound quality is of this solar-powered speaker. I wasn't expecting too much since most solar-powered things seem to perform less than their counterparts, but this one actually sounded really good! The power lasted quite a while on a full charge. I really appreciate that it is waterproof too so I don't have to worry about having it outside by the pool or bringing it camping with us. The shape is nice too. I had another speaker similar but it was round so it would roll around, so I like this one much more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine Mel",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Waterproof?????",
      "text": "Amazon listing refers to it multiple times as “waterproof” and even specifically calls it out as IPX6 which indicates it is protected against direct and heavy waves or jets of water. However the manual mentions nothing about water protection. Rather, it says to not use in the rain or expose to a damp environment.",
      "rating": 2.0,
      "verified": true,
      "author": "KEDA",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Solar charge not operational. Simply plug in, chargeable speaker at twice the price.",
      "text": "Simply doesn't charge by the sun, even in direct 75 degree sunlight while not playing, the speaker will not charge. Rugged, lasts in the rain, good sound quality. But, plenty of those for half the price that don't boast solar charging.",
      "rating": 2.0,
      "verified": true,
      "author": "BREK SPARKS",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "nice solar speaker",
      "text": "Was a Nice little speaker for the money. I’ve only charged it once and it has lasted forever. Have used a few times with minimal sun so that helped the charging. Easy connect to Bluetooth and loud. Love that it is waterproof. But after less than 6 months it doesn’t turn on anymore. After contacting the seller they were able to resolve my issue. Hopefully I just got a bad one.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Stopped working after less than 6 months",
      "text": "Bought this as an Xmas present for my gf and it stopped working as of about four months ago. I’ve troubleshooted the hell out of it but it won’t connect to any Bluetooth device which effectively makes it useless. There doesn’t seem to be any way to reset it. There’s no manual online and I can’t find a way to contact the manufacturer. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Winston",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Was working great... until it stopped",
      "text": "Now LED light goes on and claims to be Bluetooth connected but no sound at all. I bought it hoping for a good bluetooth speaker that is reliable and worth the price. This one is not the most expensive speaker but I thought it should have worked much better than this! Too bad because the sound wasn't bad when it worked for a little bit in the beginning. Perhaps I am not supposed to leave it out in the sun to charge, or perhaps my version is defective. Very poor experience here. I will be springing for a Sony, Bose, or Beats. If it looks cheap, sounds cheap, it probably is cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Dat Tran",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Compact in size, but big in sound",
      "text": "Bought this to replace an older bluetooth speaker that would no longer hold its charge. This one is very compact and easy to hold and stuff into a back pack. This may be a small unit, but the sound quality is what you would expect on a bigger ( and more expensive ) unit. It has voice prompts that tells you when power is on or off. I using out by the pool and have no problems hearing the music with ll the background noise. Haven't had a chance to run the battery down, so I don't know how the solar charging works, or how long it takes. so far, very happy and would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "desert2sea",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Good for the price.",
      "text": "Good speaker, not the best sound quality but it’s not bad for the price. Long play time, even longer with sunlight. Loud enough to use as a car radio and drive with the windows down at highway speeds. My vehicle has a simple am/fm radio so I simply put this speaker on the dash and have what I want to listen to instead of a pricy system.",
      "rating": 4.0,
      "verified": true,
      "author": "andrew morris",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "I just ordered a second one for my brother-in-law",
      "text": "I got this because it can charge itself by solar and you can charge your phone or tablet from it also, update I had to return my first one because it wouldn’t charge any more so I ordered another and now it’s not working so great idea but Chinese junk with no product support so I’m looking for something else maybe the JBL charge",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin ",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Awesome sound and easy to set up",
      "text": "Amazing sound quality. It took me less than a minute and a half to set up - including accidentally choosing the wrong Bluetooth. Super easy. It is nice and compact- not too small and not too large to have optimal sound quality. The battery seems to last a long time. There are inputs for usb, auxiliary wire, or a micro as card. Perfect for every occasion and great for people of all ages.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Watson",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Great speaker in a market of crappy ones.",
      "text": "Great speaker. Super loud and clear sound. Deep bass range, surprisingly so. It lasted me all day at work. Haven't used the solar charger yet. But when the battery dies I'm gonna recharge it via the panel to see how long it takes to get the full charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Chip",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Quick fix speaker",
      "text": "Sound quality is great. Not as loud as i expected but gets the job done. Solar at least on mine did not charge. Took it camping and died the next day. But the battery lasted the entire day. Maybe i did something wrong with the charging but worth the price if not advertised as solar",
      "rating": 3.0,
      "verified": true,
      "author": "Luis Espinoza",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Waterproof!",
      "text": "Works great. Sounds great. Waterproof, so I can leave it out in the back yard; it's always charged when I'm ready to use it. I didn't give five stars because of the little rubber flap that covers the jacks. It makes a good seal, but you have to press and play with it to make sure it won't leak.",
      "rating": 4.0,
      "verified": true,
      "author": "BigD",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Don’t turn up volume",
      "text": "If you don’t want to turn it up very loud, it works fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Megan McReynolds",
      "helpful_votes": 3,
      "publication_date": 20190930
    },
    {
      "title": "I really like the speaker",
      "text": "I like the speaker for three reasons, One reason is it is bluetooth wireless speaker which can connect any devices with bluetooth, such as iphone, ipad and laptop so on. Another reason is the speaker has many functions, for example, i can use the speaker to answer or reject calls when it connect to iphone. It also is waterproof !! The third reason is it can by charging under the sun and it also can charge for iphone and ipad when them not have power. It is just as a power bank and it is not heavy that easy to carry. I will recommend my friends to buy it !",
      "rating": 5.0,
      "verified": true,
      "author": "Xiang",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "After a few months of use....",
      "text": "Just a great toy.... HOWEVER.....I left this thing out in direct sunlight for a week with an near empty battery a few times and guess what??? The solar charging power is crap. Just a complete gimmick and isn't capable of charging this thing. I feel like I've been scammed.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominick",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Good Enough Speaker",
      "text": "Good sound and easy to connect to using Bluetooth. It’s not Bose. But it’s adequate for outside activity. I love that It can be charged with solar energy! I keep it by my windowsill and let the sun charge it through the day. I would say it's a bit large to be called a portable speaker, but other than that, no problems!",
      "rating": 5.0,
      "verified": true,
      "author": "Coco Kokiatso",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Not recommended for jobsite.",
      "text": "Pretty good BT speaker. As long as it's not turned up all the way as it distorts something fierce. Battery life is ok. I can get roughly 6 hrs playtime on a charge. Is NOT recommended for jobsite stereo. Not loud enough. The solar panel side does charge it, but you better not be in a hurry.",
      "rating": 4.0,
      "verified": true,
      "author": "Kswelderman",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Worth buying",
      "text": "This is a very good Bluetooth speaker, the appearance is triangular-shaped design, size and almost a bottle of ordinary bottled water so large, portable, very loud very clear, bass effect is very good, the whole speaker played out sound very solid, highly recommended this product, very good!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Chen",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "The Solar Charging is awful",
      "text": "The speaker works fine and can get pretty loud but the solar charger on it is terrible. You can not leave it charging in the sun and playing at the same time.... it will not charge enough in the sun. I left it charging for 4 hours and it only played music for 15-20 mins. The regular charger works fine and will last for hours but the solar part is awful. It's still a fine speaker but i was looking for something solar only.",
      "rating": 3.0,
      "verified": true,
      "author": "James el",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "INSTRUCTIONS pics attached.",
      "text": "I will provide a detailed review after I use it a while, in the meantime here is the instruction manual. For some reason the manufacturer is to lazy to provide it.",
      "rating": 4.0,
      "verified": true,
      "author": "PanzerPink",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Very cool item for out by the pool",
      "text": "Really pleased with this. I have all my music on a mini SD that pops right in and we use it out by the pool, while charging my phone at the same time. Gets a major thumbs up for functionality from our view.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick H",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Excellent Value!",
      "text": "I have several BT portable speakers from Bose, Harman/Kardon but this one will be my go to for most outdoor, picnic, camping, swimming activities. Great sound and battery lasts a while as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Artemis",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Wonderful speaker.",
      "text": "This speaker is great. The sound has a bass to it. I keep it on table by the window and when I open the blinds it charges from the light. I haven’t had to plug it in one time. Love the voice that says power on, etc. ADDED THE INSTRUCTIONS!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Excellent speaker",
      "text": "I loved this speaker! I tried the past weekend at the park, and the battery it was not an issue since it is solar charging. The sound is very good to be outside. It is water resistant, really important when you have a familiar reunion and there is kids, etc. Easy to pair with my iPhone, great product :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mafer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Solar charging and noise prevention",
      "text": "What her husband likes is its solar charging and dustproof features. My husband can take it with him when he works outdoors and enjoy his favorite music. He no longer has to worry about finding a charging port.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Hartwig",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Wonderful",
      "text": "I loved I used when I work in the yard",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel Rivera",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Sounds great!",
      "text": "Sounds great! Great price! Easy to sync! Great gift idea! What more could you ask for?",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Very nice speaker with hands free phone!",
      "text": "This speaker has been pretty good, charges nicely with it's solar pannel. If I forget or fall asleep, it turns itself off. All and all very decent sound and a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "UT8K",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Couldn't stay on.",
      "text": "This product arrived and upon testing, it would turn on for about 30 seconds and shut itself off. I tried several things to remedy this but nothing worked and I ended up returning the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Zach Rosen",
      "helpful_votes": 2,
      "publication_date": 20191021
    },
    {
      "title": "Not waterproof/splash resistant",
      "text": "Product not as advertised. The box it came in and owners manual explicitly state it is not waterproof/splash resistant. If you truly want an outdoor speaker buy from another manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Logan Judy",
      "helpful_votes": 3,
      "publication_date": 20190630
    },
    {
      "title": "Great product, excellent sound",
      "text": "Love this product. Charges great in the sun and puts out good sound, especially considering ow small it is. We travel with it and it is very well made and good quality. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Absolute trash",
      "text": "Bass? Subwoofers? I literally think they forgot to put speakers in mine. I've heard 56k modems with deeper bass than this thing. I can't decide if I want to return it or throw it out this hotel window so I don't have to think about how crap this is. I give it 2 stars because: 1. Cool, it has a solar panel that I won't even be using because it's night and I'm going to blow this thing up immediately. 2. It's inspired my first Amazon review",
      "rating": 2.0,
      "verified": true,
      "author": "William Kearnes",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Very good value for money",
      "text": "This is a nice little speaker. I love the solar charging aspect (though it is very slow). I would have given five stars but sometimes the Bluetooth connectivity is a little unreliable.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel DeDora",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great purchase, highly recommend",
      "text": "East to connect with phones or other devices, good size speaker perfect for outdoor activities as well, I personally use it for chill music at nighttime by my night stand",
      "rating": 5.0,
      "verified": true,
      "author": "N. Lin",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Best speaker I’ve ever owned",
      "text": "Great price, great look, have not needed to plug it in since the first charge. The solar power works great, sound quality is great. Only thing is the power on and off voice is a little weird, but the purchase was absolutely worth it! Price is amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Terrible battery and solar panel",
      "text": "Unfortunately the battery life is super bad. Lasts for a couple hours tops. Then annoying low battery sound u til dead. It’s not worth the money since solar panel can’t charge it properly and be used same time.",
      "rating": 1.0,
      "verified": true,
      "author": "Brett b",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "I really like the sound quality is very good.",
      "text": "The speaker itself is very lightweight and easy to carry. You can place the speaker in direct sunlight. It is a solar speaker that charges the speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen & Brandon Pickworth",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "sounds quality liked Bluetooth connection easy",
      "text": "I go to farm very often and there no electricity only with animals sometimes need some music, I got this Bluetooth speaker just perfect put outdoor for solar charger, it works for everything also can charge my phone at same time, so happy with this product",
      "rating": 5.0,
      "verified": true,
      "author": "steven ",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Crazy Battery Life",
      "text": "The battery life is really really good. I listen to it everyday for at least 1 hour. It's been two weeks and I haven't charge it through the outlet. I just simply put it by the window and let the solar panel to charge it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Corless",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Not very waterproof. Barely water resistant. Disappointing.",
      "text": "Was psyched about this but only got to use it twice. The last time we got dunked in the river but the speaker was submerged less then a few seconds. No longer works. Very disappointed and having a hard time finding a customer service contact.",
      "rating": 2.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great speaker!",
      "text": "I'll update in a few weeks! But my initial reaction is WOW. For the price the sound is great. The base is not bad either. I can feel it on the floor from where i was standing.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Solar-powered Bluetooth speaker and charger",
      "text": "Now this Bluetooth speaker with solar panel Works wonderfully I charged it once music constantly inside and out charges on its own I'm able to charge other devices with it great quality well worth the price",
      "rating": 5.0,
      "verified": true,
      "author": "Donald (Hondo)",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Good value",
      "text": "Pretty loud but not Bose sound. Good value... plays all day. Outlasts my phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Rocco Daxton",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "It's not going to rock you socks off.",
      "text": "I like everything about this product. After 2 full days of sunlight, it functions well. Sound quality is average to a little above average. Wish it has more base. It serves my purpose, though, so I'm happy. I have it hooked up to my 7\" Kindle Fire & listen to anything I want.",
      "rating": 5.0,
      "verified": true,
      "author": "Randal Gilbert",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Easy to pair, easy to use!",
      "text": "Unwrapped. Charged. Turned it on and paired it. Simple and the instructions were were perfect. As a massage therapist, the battery life is important! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "1fleshnhim",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Good speaker, mine in particular at least has a bad battery.",
      "text": "Battery won’t hold a charge, I need to contact customer service about it.",
      "rating": 2.0,
      "verified": true,
      "author": "Joseph Bechard",
      "helpful_votes": 2,
      "publication_date": 20200221
    },
    {
      "title": "GOOD",
      "text": "Better than expected, workmanship can be seen very well, the weight is a little bit, the quality of the hand feels good in the hand, the phone and the Bluetooth try the sound quality OK, the bass can also, obviously feel the table a little shock, the treble is also quite I mainly use a small speaker for the switch, so the sound quality is very good!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy ",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Awesome sound quality!!",
      "text": "This speaks is awesome, easy to use, the sound quality is perfect and long lasting battery life. Absolutely love it and definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Great features and good sound for the money.",
      "text": "So far this has been a great speaker. I use it while fishing and the solar charging is great! Don't expect it to perform like a 100 dollar one but it sounds good enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Young",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Works Great!!",
      "text": "for the price you cant go wrong, the voice on the speaker has an Australian Accent but i think its awesome. Its really loud and the battery will last you for a majority of the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnson",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "No base poor sound",
      "text": "Claims to have good low end base sound and it has very poor sound quality with no base.",
      "rating": 2.0,
      "verified": true,
      "author": "Kampaipost",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Don't buy!  Worked once.",
      "text": "Charged on the wall and it worked great until the battery ran out after about 9 hours of play. Then I went to charge again and it never took a 2nd charge. I tried the wall for two days and outside for a week. It never worked again. Horrible waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "JeepChick21",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Failed first rain shower.",
      "text": "This product did not charge well off the solar panel, and failed the first time it got rained on (1 month).",
      "rating": 1.0,
      "verified": true,
      "author": "Rusty Shackleford",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Just kept shutting off",
      "text": "Item shut off within seconds of playing a song. This was after it was charged and while it was plugged in.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Kirkpatrick",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Price and Quality",
      "text": "Great speaker at a great price. Sound quality is good and volume was much louder than anticipated for a smaller sized speaker. Plugged it in to charge when it first arrived and solar panel has done the rest since. Would definitely recommend and would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Rld7m4",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Love this speaker",
      "text": "Great little speaker. Love that it’s solar, works perfect. Only wish is that it was a little more powerful, but it cam exactly as described",
      "rating": 4.0,
      "verified": true,
      "author": "kkricks",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Would buy again",
      "text": "This radio is awesome, works great, stays charged, sounds awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Works great",
      "text": "It works great. I use it a lot and the battery life is great",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Very nice speaker",
      "text": "This speaker made with very high quality and light weight. It can use sun power or charge with chord. It is very great for Barbecue at park and Campaign.",
      "rating": 5.0,
      "verified": true,
      "author": "Zizi Flamio",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Great for the deck parties",
      "text": "Never have to worry about this speaker running out of juice, and the sound quality is decent!",
      "rating": 5.0,
      "verified": true,
      "author": "Captivaman",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Does not hold charge",
      "text": "Does not hold charge - have to keep plugged in - defeats the whole purpose for me - use by poolside",
      "rating": 1.0,
      "verified": true,
      "author": "sharon kane",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Way more my expectation",
      "text": "Sounds quality is awesome. I have attached a video for how well it sounds. Sound can be made very loud. It can be playing in one room and I cs. Clearly hear it in a far room. It does indeed charge in the sun or usb. It's very convenient. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "xz618",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Disappointed",
      "text": "After 1 charge, it worked fine though buttons (on/ off, volume, switching song) are a bit hard to press. When time for recharging, we couldn’t plug the cable in, some kind of silicon like liquid filled/ blocked the hole. Can’t plug-in to recharge- don’t know what to do with it- returning the item",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Tran",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Works great",
      "text": "I bought this as a gift for my boyfriend for Father's day. He uses it all the time",
      "rating": 4.0,
      "verified": true,
      "author": "kristina griffith",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Not water resistant as advertised",
      "text": "Great speaker not waterproof or even resist. The access hatch doent stay closed with out a rubber band. Battery last not hours but days and the range is great.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Jacobsen",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Battery Port Corrosion",
      "text": "The battery port got corrosion on it after charging it only a couple of times. The only other way to charge it was via solar power which takes forever and constantly says battery low.",
      "rating": 1.0,
      "verified": true,
      "author": "Bernard Parenteau",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Make sure you charge it fully before use.",
      "text": "I actually love my speaker. I brought it for camping so being able to charge my IPhone to it was a huge plus for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Speaker",
      "text": "Perfect little speaker. I love that I can charge my phone while listening to my music!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda J Redd",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Not Waterproof!!!",
      "text": "Amazon ad says it is waterproof and the book/manual states it should not be exposed to water. It is a nice speaker and works well, but if the waterproof feature is important to you do not get this speaker.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Solar system really works",
      "text": "very high quality product. I have it now for then 2 months and I haven't charged it once. It's been in my room, and my room is sunny 4 hours per day, and I never charged this device. the quality is not the best but it's good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "It just keeps going",
      "text": "Would be insane deal at ~$20... great deal at $30... and a good price at $40 ... The solar panels really work. And I’ve used it as a power bank multiple times now. Doesn’t overheat or ever mess up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Good for the money",
      "text": "This small speaker puts out a lot of sound in close range. The good thing it is portable and I can move it around the yard to where I am working",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Love it!",
      "text": "Great for our outdoor use and the battery really does last forever!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Weeks",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Fantastic Bluetooth Speaker!",
      "text": "I just got this today! This Bluetooth speaker has a clear sound. And the looks of it is pretty nice as well!",
      "rating": 5.0,
      "verified": true,
      "author": "choudry",
      "helpful_votes": 2,
      "publication_date": 20180820
    },
    {
      "title": "Save your money!",
      "text": "OK is you listen to low volume. Once you get to around halfway, speakers sound as if they are blown. Do not waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Heartbroken",
      "text": "I loved this speaker until one day it stopped working. Can't get any function or response. Greatly disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200710
    }
  ],
  "product_meta": {
    "title": "Solar Bluetooth Speaker with 5000mAh Protable Power Bank, Elzle Bluetooth Portable Speake 50+ Hours Playtime Stereo Paring 12W Subwoofer, IPX6 Waterproof Portable Wireless Speaker for Outdoor & Indoor",
    "rating": 3.9,
    "feature_bullets": [
      "▶【Solar Power Speaker & 5000mAh Battery】 This Bluetooth Speaker has Built-in latest solar panel and 5000mAh power bank with 2.1A output port, simply plug your phone or tablet into the Bluetooth Speaker and it will charge your device while playing music.",
      "▶【Rich Bass Stereo Sound】 Elzle solar Bluetooth speaker has surprisingly original sound and the powerful subwoofer for bass in the back. Adopting advanced APT-X chip HD lossless audio technology and dual driver.solar powered outdoor speakers bluetooth is Waterproof and Shockproof",
      "▶【50+ Hours Playtime】 High-Capacity lithium battery and built-in smart battery management system, working hours increased to Amazing 50+ hours means 1000 songs on a full charge. You can go for an all beach/park day and play music the entire time without worrying about saving the battery.",
      "▶【Microphone & Bluetooth 4.2】 solar power bluetooth speaker Compatible with all Bluetooth-enabled devices and non-bluetooth devices with included 3.5mm aux audio cable, connect to your cell phones, iPhone, iPad, Samsung, tablets from 32-49 feet. The built-in microphone can let you pick up phone calling hand-free.",
      "▶【What You Get】: 1xPortable Bluetooth Speaker,1x USB Cable,1x Audio line, 1xUser Manual. you will get excellent service"
    ],
    "specifications": {
      "Product Dimensions": "7.87 x 3.35 x 3.23 inches",
      "Item Weight": "1.06 pounds",
      "Manufacturer": "elzle",
      "ASIN": "B07D9HH2QM",
      "Item model number": "BO-JDC01",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "3.9 out of 5 stars273 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#2,806 in Portable Bluetooth Speakers#21,290 in MP3 & MP4 Player Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 25, 2018"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": ""
  }
}