{
  "website_summaries": [
    {
      "verdict": "The best budget controller you can buy for the Xbox One.",
      "pros": [
        "Affordable, available in an array of vibrant colors, sports a pair of customizable buttons on its underside, and is a great option for households with multiple players"
      ],
      "cons": [
        "No wireless option, but includes 9.8 foot long USB cable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not Worth It",
      "text": "Purchased the controller in June as a backup and I started using the controller at the beginning of Septemeber. The right trigger now gets stuck. I never dropped or spilled anything on the controller. I mostly use the controller for Fortnite. The controller just honestly malfunctioned. I DO NOT recommend this controller unless you have a thirty dollars to waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Branden",
      "helpful_votes": 63,
      "publication_date": 20180922
    },
    {
      "title": "False description. No advanced buttons",
      "text": "Description is a lie. I have the PowerA Fusion controller which has the programmable buttons on the back. I bought this as a replacement because the description clearly says, in plain English, as a main selling point, that this controller has the same buttons on the back. That is not what I recieved at all. This controller ain't worth $10 let alone $20+. Lies and false advertising. Will update if I get the proper controller I paid for. I don't want a gd refund. I want what I paid for.",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 29,
      "publication_date": 20181130
    },
    {
      "title": "My main controller",
      "text": "I am loving this controller. I bought it just as a backup. I wanted to test and play around with it when I got it and I haven't put it down since. The feel is close to Microsoft brand. I love the programmable buttons on the back. Easy to program and works great. Very helpful in most games. If you don't mind the cord I highly recommend this controller. For the price you can't beat it. And it may just become your main controller.",
      "rating": 5.0,
      "verified": true,
      "author": "AncientGhost",
      "helpful_votes": 14,
      "publication_date": 20180821
    },
    {
      "title": "Trigger button broke in less than 2 months",
      "text": "Purchsed this controler end of oct.first part of dec. The trigger button has issues,it goes off by itself or dosent quit shoting,i use it on call of duty and warframe and its annoying running out of ammo or giving out ur location,just invest more money and get what u pay for..less than 2 months and going to have to buy another controler.",
      "rating": 2.0,
      "verified": true,
      "author": "R Caudill",
      "helpful_votes": 8,
      "publication_date": 20191204
    },
    {
      "title": "Disappointed.",
      "text": "Controller looked nice but after 6 days of limited use the right bumper stuck. Arrived the 8th. Was played with from the 11th to the 15th and on the 18th. On the 18th the right bumper began sticking then just stuck. Returned on the 19th. Very disappointed. Sadly will stick to the more expensive original controllers.",
      "rating": 1.0,
      "verified": true,
      "author": "smile4life",
      "helpful_votes": 8,
      "publication_date": 20190327
    },
    {
      "title": "Astonished",
      "text": "When I bought this controller, I was expecting the same thing as the previous model... was I ever wrong. First off, the controller has a slightly rubber feel to it, which is great becouse that means a better grip and less slips and drops. Also the cord is removable, which for a wired controller means that damage to the cable is no longer the death of the controller but just a replaceable part. Finally, underside of the controller has two extra buttons for serious gamers. All in all, it's a great buy for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mauricio Martinez",
      "helpful_votes": 5,
      "publication_date": 20190212
    },
    {
      "title": "Audio jack is messed up. But otherwise great controller",
      "text": "The controller is a perfect counter to a 2 paddle controller from another brand that is more expensive. It feels amazing and works well. Even the reprogramming is simple as can be. My one and only problem which is making me rate it 2 stars is the fact that the audio only outputs to the left ear no matter which headset I use. I have to twist it in theost annoying of ways to get it to work properly. I'm going to try and exchange it and hopefully it doesn't happen again on the other. I will update this review then.",
      "rating": 2.0,
      "verified": true,
      "author": "George Sanchez",
      "helpful_votes": 4,
      "publication_date": 20191227
    },
    {
      "title": "You’ve been warned!",
      "text": "I bought four controllers at two different times and only one still works! They only worked for a few weeks before the buttons started messing up on all three! I feel so bad because my boys are so disappointed. I’ll just wait and but the real thing from now on. It’s crazy because it’s really nice looking so why skimp on the basics.",
      "rating": 1.0,
      "verified": true,
      "author": "Clarinda Williams",
      "helpful_votes": 5,
      "publication_date": 20200113
    },
    {
      "title": "Works great. Saves a lot compared to a wireless.",
      "text": "Bought this for PC gaming, so wireless wasn't a big priority. Feels like a regular Xbox controller or maybe even a bit better really. It feels firm and and the sticks have a nice texture as well. I've had it for probably 4 months now and it still feels and works just like the day I got it. Also I appreciate that it comes with a long cord. So pros: 1. Half the price 2. Good quality and durable 3. Long cord Cons: 1. Not wireless I would definitely recommend this for pretty much anything except couch gaming from a few feet away.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180928
    },
    {
      "title": "PowerA Controller",
      "text": "Nice little controller. After buying a few of the Microsoft branded controllers they ended up in the same condition with something broken either stick drift or bumper broken, etc. So instead went with this as a lower cost option and was pleasantly surprised. Doesn’t necessarily have a solid weight feel to it but it’s not bad. Otherwise so far no problems would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200717
    },
    {
      "title": "Not Bad",
      "text": "Pros: -Overall, it's a decent quality controller for the price. Cons: -The extra buttons are not configurable in Steam, JoyToKey, or any other software I've tried. They aren't recognized as individual buttons at all. They can ONLY be used to DUPLICATE existing buttons on the controller. -The extra buttons are also too easy to press accidentally, so I usually end up disabling them. Other: -The diameter of the analog sticks is a little small, but I like em.",
      "rating": 4.0,
      "verified": true,
      "author": "Some Guy",
      "helpful_votes": 3,
      "publication_date": 20180914
    },
    {
      "title": "Good not great",
      "text": "Was going to give this control a 1 star because this control wasn't allowing my voice to be heard through my turtle beach headset until I searched many hours for a solution. Once I updated the firmware off the powera website (though it says not an update) it finally works! The control is very light and doesnt feel as ergonomically tuned as the original xbox one control does. Also the joysticks aren't very responsive when pressed down. 4stars for price and basic funtion, if you are serious about gaming this is not the control you want but for a guest control or even to play until you buy the new xbox it's worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "K_B",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "So far so good",
      "text": "I've had so many issues with official Xbox controllers developing stick drift prematurely, that I decided to try a 3rd party controller instead. Right out of the box, this controller has worked very well. Build quality seems decent, only issue was the right trigger was bit stiff at first but it's gotten better. I love having the back buttons, and they are very easy to change on the fly. Yes it would be nice if it was wireless, but all 3rd party Xbox controllers are. Overall, first impressions are positive.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Moline",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "RT and LT buttons",
      "text": "You get what you paid for. The first thing was my mic wasn’t working and after checking it was a controller issue so I had to go and update the whole controller then I had to reconfigure it twice or else all my buttons would be messed up. After that everything seemed good until I tried to play a game my RT and LT buttons don’t work! They barely respond and if the RT one does respond it spams down as if I’m holding it down.... Update: They sent me a replacement and this one seems to be fine. I now give it 5 stars as this one actually works!",
      "rating": 5.0,
      "verified": true,
      "author": "Benji Cluff",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Good enough",
      "text": "Got a super cheap xbone from some guy. It smelled like 10,000 cigarettes and didn't have a controller. I tested it by using the Xbox app on my phone, and decided it worked well enough to buy a controller. This is the cheapest one with prime right now. Feels nice, buttons are responsive. The left stick got stuck in place once when I played for maybe 2 hours... Which is why I subtracted a star. I figure that might just get worse. But otherwise whatever. Cheap enough to work until I decide I need a real one.",
      "rating": 4.0,
      "verified": true,
      "author": "J. P.",
      "helpful_votes": 2,
      "publication_date": 20190322
    },
    {
      "title": "2nd Power A Controller. Buggy after 1 month",
      "text": "This controller felt great, but after prolonged use, the B button would start to stick and the left joystick would sometimes wig out and act like the right joystick. So whenever playing a game where I'm trying to move with the left joystick, it would act like I was using the right joystick to move the camera. I thought this was just because it was an old controller (I owned mine for about 1 year), so I bought a new controller. Here I am one month later with the EXACT SAME ISSUES. The sticky button I can blame on dirt/grime in the controller, but the left joystick input glitching out and giving me right input? Buncha BS.",
      "rating": 1.0,
      "verified": true,
      "author": "CrowPickle",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Nice feel and good programmable buttons, but mic issues",
      "text": "I really like the buttons on the underside of the unit - this is the first controller I've had with this feature. However, I have problems with certain headphones plugged in the headset port where the mic doesn't work. I discovered that the mic on one headset **will not** work (even though the video game shows a mic present) on this controller, but **does** work on my wireless Xbox controller. The wireless is Microsoft brand. I was able to plug my cell phone's bluetooth headset into the wired controller and it works, but my friend said it sounded like I was really distant. So I think some fault may be in the controller wiring,",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "USB cable is basically proprietary, will break and be unreplaceable",
      "text": "The plastic surrounding the jack where you plug the micro usb has a small ridge that will prevent standard cables from fitting. Once the initially supplied cable wears out, you will not be able to use a standard cable to replace it. Basically they are disguising a proprietary cable as a standard USB cable. Good luck finding a replacement that fits - even the PowerA brand cable I see listed on Amazon lacks the cutout required to fit into the jack housing.",
      "rating": 1.0,
      "verified": true,
      "author": "n/a",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "cheap controller.. even for corded",
      "text": "isnt compatible with Titan 2 device, even though a Titan 2 video tells you to GET this very controller ( only reason i did ). controller was used, sparingly, for 1 weekend, while trying to get my Titan 2 scripts to work.. seems there is a conflict, and Titan 2 is aware of it ( they emailed me, after i asked about conflicts and controllers ). buttons already feel stiff, finish is slick as sn*t. not thinking this is a good replacement at any level. oh well.. maybe use it for when the grandkids come over, or your kids friends come over, and dont want them to ruin the $129 Elite or Razer you or your kid or grandkid has..",
      "rating": 2.0,
      "verified": true,
      "author": "David P.",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "This is the best controller I have ever used",
      "text": "I read the other reviews before buying and I guess this was introduced to the market as a prototype or a Beta/Alpha test for hardware. I purchased it for $20. It was cheaper than regular controllers. The sticks have a textured grip ring which is fabulous. The auxiliary buttons can be easily programmed and save wear on your controller. Make playing easier. The cord is plenty long. I love this. If you can get it for cheaper than the other controllers this is a good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "bmw325alex",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Defective right bumper",
      "text": "The right bumper stopped functioning properly after only 10 minutes of use. The button no longer clicks in, and input is only detected occasionally. I’m very disappointed with this product. Edit: I returned this controller and got my money back and ended up buying the AmazonBasics one instead. The AmazonBasics one has much better quality and I highly recommend it if you’re looking for a cheap and good quality controller like this.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "It works great except but the non-standard micro-USB plug/cable is a bad idea",
      "text": "No issues with this controller as far as performance goes. However the micro-USB plug that goes into the controller is non-standard connection.. You will need to use a utility knife and cut a little \"nub\" out inside the connector port on the controller in order to use a standard micro usb cable. I ended up having to do this because I wanted to use a shorter USB cable. It takes all of 15 seconds to make the modification. However, if you aren't willing to do this, I would suggest you look at a different controller. At some point you may have to replace the USB cable.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave S.",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Buy only if you don't use a headset.",
      "text": "Good controller but terrible Mic/headphone jack. When I use this controller I can't plug my headset in because the volume gets lowered by at least half of a normal controller. My teammates in chat or parties tell me that they can't hear me or can barely hear me even when I'm YELLING into the mic and pressing it to my lips. I advise you look for another controller because this one is terrible for communication. The only reason you should buy this is if you play single player only and will never communicate with anyone while using your Xbox.",
      "rating": 2.0,
      "verified": true,
      "author": "Josiah Harris",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great controller that’s well worth the price.",
      "text": "Bought this controller for my PC and didn’t want to spend a ton on the M$ controller. Happy I went this route. This controller feels great in the hand, buttons feel great with distinct button clicks. The added “paddle shift” buttons on the controller have been great for project cars 2. I bought it solely for the use of snow runner on PC and now I’m using it for most games, minus the first person shooters. Will probably be buying two more for my kids now since they seem to think it’s theirs now and are using it for roblox. No matter what you need it for, it performs.",
      "rating": 5.0,
      "verified": true,
      "author": "Dirtyplunger",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Product Lasted Exactly One Year",
      "text": "I purchased this controller in September 2019. On September 6, 2020, it died. Not because it doesn't function, it does, but playing games like Warframe and/or Fallout 76 you must be able to count on those buttons working every time. So important buttons like aiming, crouch, etc. No longer work. Yes, I know I can reprogram the buttons, but that's just an excuse for poor craftsmanship on PowerA's part. The bottom line, I wouldn't buy this as a gaming controller, but as an everyday casual player, sure go ahead.",
      "rating": 3.0,
      "verified": true,
      "author": "knowident",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "BUY THIS CONTROLLER!!",
      "text": "I needed a quick and reliable,good quality Xbox 1 controller & a fair price- My 14 yr old son's had just given it's last leg smack in mid game play- ( we ALL know how frustrating that can be!) So, I came to my very reliable Amazon app & behold- here it is!! It works just as great as the original that came with the Xbox for a fraction of the price and he loves it! Thanks !!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Phillips",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great Controller.",
      "text": "I was tired of syncing and un-syncing my wireless Controllers between my PC and console, so I opted to get a relatively cheap alternative to use on my PC. This is a great option. Without the battery it feels so much lighter, but you get used to it. Everything else is tops on it, the buttons are just as responsive, the materials are smooth and feel natural in your hands, and the analog sticks are very responsive. The added underside buttons you can re-map are also a plus, especially on the PC.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Trent",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Works great",
      "text": "So far I love this controller. It feels and even looks as good as my first party controller. The buttons work great and feels really sturdy. The two programmable buttons on the back are really easy to swap out so you can change it to what you need when you need in a flash. If this holds up I'm definitely buying another. The one complaint is that the cord doesn't have the break away section that most other corded controllers have. It's not a deal breaker, but it is a handy feature when you have your 21 month old running around.",
      "rating": 4.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Perfect!",
      "text": "- It's cheaper than most controllers - Ergonomics is just as good as the authentic XBOX wireless controller - Joysticks are surprisingly good (Very confident playing shooters with it) - The additional buttons are such a fantastic feature at this price point * The face is very smooth, which makes it a little slippery * The button clicking is a little mushy (Clicking the buttons on the original XBOX controller have a really responsive clicky feel, this is a bit softer in that feedback). It's not bad, you just need to get used to it. Overall, it's really good value for what you get. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Saint",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Dead on arrival, too frustrated to even bother calling or trying to deal with support",
      "text": "Controller's are expensive. But i've learned my lesson when it comes to these third parties with this latest purchase. This review comes literally 15 minutes after using the controller for the first time. The right trigger just repeats inputs randomly whenever it wants. No button should do that, so it's unacceptable regardless of whatever game I want to play. This is the 3rd third party controller I've tried in 4 months, and I just can't anymore. Please just buy an actual controller from Microsoft or Sony. I could have with how much I wasted on trash like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Azure Squall",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Draws a lot of power from the USB port",
      "text": "It seems this controller draws a lot of power from the USB port, to the point that Windows sometimes reports power surges on USB ports. The light on the front is also insanely bright. It's a good controller for the most part and the assignable buttons on the back are kinda nice sometimes. The analog sticks are a little stiff and scratchy at times. It's an okay controller for PC use. It's a decent replacement for the XBox360 controller when it comes to D-pad use since the controller was designed after Nintendo's cross d-pad patent expired. I'm still debating with myself whether it was worth it or not.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Light weight and clicky. However it works very well.",
      "text": "This controller is a great purchase if you are needing a second controller for occasional use. It is light weight due to not having rumble or being wireless, however I don't feel like it will snap in my hands. It's buttons are all a bit too loud with clicking noises than I would like and the D-PAD is a bit squishy but it all works well on every game I tried it on. It does have an extremely long cord too, which might be a good thing or a bad thing depending on how you look at it but take that as you will.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy M. Banfield",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Worth 20 bucks a month",
      "text": "This is a great controller for fortnite I have set it up for edit on the bottom and it has sky rocketed my game play to be able to compete with PC Sweats But this is a controller that you shouldn't expect to last a long time or be as smooth as a normal xbox one controller But the right trigger doesn't require too much press to fire shots which is better than the xbox one controllers this allows me to pick up the ak But this is my second powera controller and the first one started to randomly press right trigger which is great just about never but I'm thinking that was my fault",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Good bang for your buck!",
      "text": "I really wanna give this 5 stars BUT the AB/XY buttons are so firm/stiff to press that it actually gets tiring to press repeatedly. Ntm the loud clicking haha. But the LB/RB RT/LT and Dpad buttons don't have this issue though. They press quite nicely actually. The overall quality is great if it wasn't for those stiff buttons lol Anyway, good for the price and it's good to have at least one wired controller if you game as much as I do.",
      "rating": 4.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Works great with one caveat...",
      "text": "Ingenious I got these I was looking for a cheap controller to replace the one my son and husband kept dropping and eventually ruined. The cord length is good for where I sit, though I do wish a longer option was available. The only drawback to this controller is that it doesn’t have a port for the standard Xbox headset. It will, however, work with most gamer headphones or earbuds. I was able to use headphones that didn’t work with the standard wireless controller, so bonus? Depends on what you’d rather use, I guess.",
      "rating": 4.0,
      "verified": true,
      "author": "Aparries",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "AVOID THIS PRODUCT",
      "text": "This is the 2nd time that I've purchased this model of controller from PowerA. The first time, the audio jack broke within a few weeks and I was not able to talk online using headsets. This time around, the product ARRIVED defective with a broken audio jack. I am now getting it returned on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 2,
      "publication_date": 20201007
    },
    {
      "title": "will only last a few months at most (p[robably less)",
      "text": "Will work for about 2 months then it will fall apart. Absolute garbage. L trigger completely stuck for no reason, both joysticks are loose already. avoid this product amazon took care of me as I was sent this broken busted newer version with the extra buttons on the back. The original power A controllers weren't as bad as these new ones. Just hilarious that they would come out with a new controller, but go down in quality. the L button getting stuck is a major issue, found in many reviews, and same thing happened to me after 2 months. Power A is a joke Amazon is awesome however. Great customer service",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Does not work with Headset",
      "text": "Once you plug in a headset to this controller, it instantly starts giving a loud beeping sound to whoever is on the other end. This controller Was returned and I ordered a new one ....the new one also does the same thing. Tried two different types of $100 plus headsets and it still gives off a beeping sound to who ever you are Communicating with.... So if you have wireless headsets or do not use a headset the controller works good....Contacted PowerA customer Service and they said to return the controller...Also Note: I did the update both times that PowerA says will fix it and No it doesn’t..",
      "rating": 2.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Terrible Cable Design",
      "text": "The controller worked great until the cable stopped working. Because of the stupid design they have I cant connect a normal usb to it without filing off that bump they put on the controller so that only their cable fits in. They do not sell replacement cables so this was the second controller I've had to buy just to get the cable. Wont be making that mistake again. Just bought a wired controller straight from Microsoft so that I can use any cable on it.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Will not work with a standard cord",
      "text": "I really liked this controller. it's 100% plug and play. It feels good in my hands. It's really perfect except for one thing: the cord. After owning this controller for a bit, I realized that the notch on the cord that it comes with isn't just a handy thing to make sure you plug it in correctly the first time, It's mandatory for a micro-usb cord to fit. When I use any of the dozens of the cords I have around the house none of them could fit because of that stupid notch. Now I have to pray that I never lose that cord.",
      "rating": 4.0,
      "verified": true,
      "author": "Constance",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "A good buy for the price⭐👍",
      "text": "Item came on time, fast delivery. So far the controller works great. Doesn't feel cheaply made. I plugged into my Xbox one and it was GAME ON!🏉 I will update my review in 30 days to see if the controller still works fine. But I But I'd recommend this item to save battery money💰 or just have as a backup decent controller for your xbox. 😎 fyi: I added the camo grip covers I had on my original Xbox controller and they also fit no this new controller np!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee915",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "This controller already stopped working",
      "text": "I have not used this controller more than 2 weeks and the left stick wont stay in the middle. so your character on the screen is constantly trying to go to the left. I tried many different way to correct it. I have 3 different xbox controllers all have different problems.I threw the box away so I guess I cant send it back. I loved the controller when it did work. but the drifting problem is a VERY BIG ISSUE FOR GAMERS",
      "rating": 1.0,
      "verified": true,
      "author": "Daron Prelesnick",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Better for PC play than the official controller.",
      "text": "A decent solid controller. The mini USB fits into a secure socket and won't disconnect/be damaged the way the official Microsoft one can. The only problem I found was that the D-pad can feel unresponsive at times, but for most modern games, that's a minor issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Nichpor",
      "helpful_votes": 3,
      "publication_date": 20181006
    },
    {
      "title": "Works great with pc! Plus macro sync!",
      "text": "I originally bought this controller for myself and then it was very quickly claimed for my daughter. so my daughter has been using it for the past two months she throws it everywhere it's full of crumbs it bangs around on the floor it's usually left upside down on the floor. but I have to say it after picking it up and using it after two months of steady child abuse it works great!I played rocket league and won every round. FYI these controllers seem to work better through USB 3 or more",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Y",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Cheap, cheap, cheap, quality...",
      "text": "Sensitive ‘programmable’ buttons get tapped by errant fingers all the time, it feels flimsy and stopped working (conveniently) about 2 months after the return window closed...which I guess for the price I’d understand, but I only used this controller for about 2 hours total and then put it on a table for 2 months. Went back to use it, and the thumb sticks just auto-walk my characters in circles. Cruddy, cheap flashy controller. Save your money, buy another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lehmann Family",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "It's great when it works, but it won't last...",
      "text": "Works great on PC. Disappointingly, the buttons on the underside dont have their own unique input. They strictly work to remap one of the other buttons (which become functionless after unassigned). Worse still, other reports of degraded functionality over time have proven true. After occasional use in the few months I've owned it, my right trigger will either get stuck activated after clicking it or it will trigger randomly without my input. My right stick is doing the same. While it was working it was great. Everything was sharp and responsive. But if you get one, you get it with a timer. A timer to when it stops working. Cannot recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Julian Watson",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "sticky \"A'' button",
      "text": "It works great and has customizable buttons, but the \"A\" button looks and feels like the seller smashed it into the controller. It does not spring back up, and is so sensitive, that the wind from my fan can press it. NOTE TO MANUFACTURER: Please make sure that before you ship it, or sell it, that it works with no flaws, or else someone else is gonna leave a bad review, But overall good controller, and please look into testing them. Thank you!",
      "rating": 2.0,
      "verified": true,
      "author": "Sue LeJeune",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "sturdy well built nice controller",
      "text": "i got this so i could play gta v and other new games on my pc, and it works perfectly right out of the box. the sticks are responsive its comfortable in my \"regular\" size man hands and has a nice matte feel against the skin. the only thing i dislike is that the power led is ultra bright so if you are sensitive to light maybe turn it over before going to bed because it will light up the entire room and can be distracting if gaming in utter daarkness",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "BUY AT YOUR OWN RISK",
      "text": "So this controller is $24.99 simple right cheap and affordable. I'm going to talk about the pros of this wired controller. Pros: nice sturdy in hands and well of course the no battery wired part. The cons about this controller are the mic quality and the materials used to make the controller. Unfortunately the rb button came off two months after I purchased it. I'd like to return it for a refund but it's at the two months mark so I already am past that that point. Honestly buy this at your own risk.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard Buono",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Good replacement controller",
      "text": "Have been using Power A controller for several weeks now on daily basis and it works well. As a female gamer I appreciate it's lightweight. You can't beat the price. This controller is replacing my Elite series controller that I have been very unhappy with. The Elite controller D pad became almost unfunctioning within a year and it was heavy and seemed too big. The PowerA so far is working well but I may have to edit the review if problems arise sooner than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn J. Buck",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "cheap plastic you get what ya pay for",
      "text": "works pretty okay. plastic is cheap, long term durability questionable. included micro USB cable is trash. always disconnecting, u could just use another cable. this is good for 1 player who needs an extra controller. but if you reguarly have split-screen games, couch co-op etc, get another official Microsoft Xbox one controller don't rely on junk",
      "rating": 4.0,
      "verified": true,
      "author": "Shane S.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Stopped Working after two months",
      "text": "Not worth your money because it will break or stop functioning properly after about two months. D pad issues and that is the part of the controller that is used the least. The thumbstick tension is better than Xbox's stock controller, which is great. Back buttons were great hence the two stars.",
      "rating": 2.0,
      "verified": true,
      "author": "N. Imperial",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Well Worth the Money...",
      "text": "Usually I buy the Microsoft Wireless Controllers at $50 a pop but decided to try this out instead. I am pretty happy with my Purchase. Since I don't sit that far away from my Console I saw no need to use Wireless at the moment. I don't miss having to recharge my batteries either. Plus I can get two of these for the Price of one Wireless and still have money left over! I think I will go with this option in the future. If you play a lot Controllers don't last long. I'd rather save some money and live with a Cord...",
      "rating": 5.0,
      "verified": true,
      "author": "David C",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Great controller and a great value.",
      "text": "Love this controller. I have been using this for a couple weeks now. The buttons on the backside are easy to program, even in the middle of a game. It has a great feel to it. It was important to me that the shape of it not differ too much from the OEM controller. USB wire is secure and long. It doesn't slip out, even during my rare WHAT??!!!!! moments! I do wish all controllers have a headset mute button, which this one is lacking too. Ultimately, I strongly recommend this controller, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis M",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Barely Used It, But It Still Malfunctioned",
      "text": "It's a comfortable controller, worked great and saved time/money when it came to batteries or charging. However, I'm only an occasional gamer and didn't use this much. After a few months, despite irregular use, the characters on screen kept moving left even when your thumb or hands weren't on the controller. It's difficult to control something in a game or navigate the menus when everything tracks left, regardless of what you're doing. It was annoying and a shame since everything else about this controller seemed like a great value.",
      "rating": 1.0,
      "verified": true,
      "author": "The Joey",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Awesome controller !! Great value 💯",
      "text": "Just like the new xbox one elite controllers.. Awesome deal. Has SUPER LONG CORD and is removable which is a plus.. Nice feel to it 👌 and also has two extra buttons on the back for extra flexibility when providing boom headshots 👍💯I recommend it, im ordering another cause the value is top notch.. No more money wasted on batteries😣 Simply PLUG & PLAY!! Thanks! 5 STAR PRODUCT",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Jackson",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Worked great for about 3 weeks before connection and bumper issues",
      "text": "So my daughter loves this controller. The thing was great for a few weeks before the bumper started \"sticking\" (it just isn't making good connection to the rubber foot underneath it) and the usb connection port on the controller started loosening (the wire must be pushed firmly in for it even to register). Now, the controller is a cool looking $35 paper weight and otherwise useless.",
      "rating": 2.0,
      "verified": true,
      "author": "Nick Gassmann",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "NOT WORTH ITS PRICE, EVEN AT $20",
      "text": "This is a very cheap controller. It’s very light weight like a hollow piece of plastic like your holding an empty Water bottle. But build quality not the main issue. The joysticks have significant dead zone. There’s not enough level of sensitivity. It feels like the joystick is moving from level 1 straight to level 5 , then 10. I put it through it’s pacing with halo mcc and the outer worlds. If your someone with plays lots of FPS I would go with a different option.",
      "rating": 2.0,
      "verified": true,
      "author": "kong",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Perfect for kids!!!",
      "text": "My 4-year old son loves his first controller. The regular controller was too big and hefty for his rookie hands. He has had a much easier time with this controller cause it is lighter and a little thinner. This controller isn’t for experienced players as it must be plugged in when using it, it doesn’t allow for a battery pack, and it’s not like having a brand name controller in your hands.",
      "rating": 5.0,
      "verified": true,
      "author": "D-Rock",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Good idea poor execution",
      "text": "Joysticks got loose after about 2 months of casual use..also if the cord that comes with it stops working good luck finding another that fits it. It has a cool design to keep the cord from moving but it won’t fig other micro usb cords so...I don’t know it’s just a good idea executed poorly..this controller will be perfect for a 3rd or 4th player but not very good as a 2nd player controller..the only other situation where this would be a good controller is if you need a cheap controller as a temporary substitute until you get a licensed Xbox controller, but other than that I wouldn’t buy this again",
      "rating": 3.0,
      "verified": true,
      "author": "Just a customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Works great but doesn't last long",
      "text": "I got this controller only a few weeks ago, however already I've been having some issues. The first thing I noticed is that this controller requires me to have my mic essentially jammed down my throat for it to pick up anything I'm saying, which is super frustrating. However the main thing that annoyed me was that the left stick broke in that it's always pushed slightly forward - only after 2 weeks of using it. You really get what you pay for buying this controller.",
      "rating": 2.0,
      "verified": true,
      "author": "Tate",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Terrible Quality",
      "text": "Absolute garbage of a controller. Feels terrible in the hand, super lightweight (cheap feeling) the button stick up (feels like 6”) and don’t expect them to be responsive. I only kept this as a back up because unfortunately it’s difficult to actually get a good Xbox controller. The new magenta ones I went through 2 in just a month. Luckily I buy the replacement plan but still where the quality control ? If you buy this especially if you play fighters you will definitely regret it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay and Tay",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "J-Stick is not working",
      "text": "I bought this to use with Epic Games library on my laptop. It worked great then about a month later, left J-Stick stopped working properly. It was causing characters or mouse icon to shift toward the left which was annoying and especially troublesome while trying to navigating game menus. I haven't played Borderlands 3 in month and half because of this issue. I tried to reach out to the company but they haven't responded since month ago when I emailed them. Beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Worked great upon opening, not registering commands after a month",
      "text": "I got this to use with my pc since I'm new to online gaming and prefer having a controller so I grabbed this controller so I wouldn't have to worry about batteries. It worked fine for the first few weeks but now after a month i booted up a game and the controller wouldn't register. I've tried different usb ports and still no luck and I can only assume its either the controller, the cord it came with, or both.",
      "rating": 1.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great controller...for a few weeks!",
      "text": "Loved the feel of this controller especially the bumpers and the rear programmable buttons give you new ways to play. The sticks and triggers are a little clunky, but not too bad. However, the sticks start drifting horribly after only about 10 hours of gaming. At this price, even 3 of this isn't as good as one Microsoft controller. Don't waste your time or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick McGreevy",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Great working controller...",
      "text": "I have 4 wired controllers connected to my Xbox one. I like wired more than wireless. I purchased 2 USB splitters and plugged them into Xbox one. I hooked up 4 of these controllers to them. All 4 work without any issues. I use the other USB port on it for an external hard drive. Now my family of 4 can all play games together and have as many games as we want.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas W. Babcock",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great controller for the money",
      "text": "Love it. Been using it for a few months now, with no issues. And I haven't been easy on it, either. The extra buttons underneath the grips allow you to clone another button function, which is super handy. I'm playing Rebel Galaxy Outlaw and I hate how they assigned thrusters to pressing the joystick. So i duplicated that action on the left grip button, and it's much more intuitive and easy to use. You can't beat this controller for the money. I would definitely buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Meyer",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "work great!",
      "text": "The first time I ordered it, it didn't work. I then returned it for a new one and it works very well. The connection is very good and the game buttons are very useful. pro(s): Very fast connection, has a long wire, easy to set up and no extra money needed for batteries. con(s): The wire is easy to trip on and you need to make sure it's not loose. Overall it is worth the money and is just as good as a wireless controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Camille Di Maio",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Get what you pay for",
      "text": "Out of the box it seemed like a $28 controller but was ok as its a decent price for a controller. Thing is, is it did not work even in the slightest. PowerA did not offer any help, they just said to return it. If you are planning to play it on pc PowerA does not directly support it. They do give instructions on how to get it to work and give links to third party drivers in forums.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Warning, Very poor quality",
      "text": "This product is horrible quality. I mean BAD! If there was an option to give it zero stars out of 5 I would. I have had this for only 2 months and the wire port on the controller is already loose and will stop working in the middle of games. The buttons are cheap and the spring on the Y button has already broke. The plastic itself is thin and cheap feeling. This is literally the worst possible controller you can buy, DO NOT WASTE YOUR MONEY! It broke just after the convenient 30 day return window too, just to add insult to injury. 1000 thumbs down!",
      "rating": 1.0,
      "verified": true,
      "author": "Allison Kramp",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great! No issues!",
      "text": "Product works great! Very long cable for sitting almost anywhere in the room and playing, and the controller itself is very comfortable and feels almost exactly like a genuine Xbox One controller. One thing I didn't like is that the charger input on the controller has a little bump, meaning you can only use the Micro-USB cable that comes with it, as different ones won't be able to fit. This isn't a problem in normal use, but sometimes when on the go I want to use a shorter cable, but can't.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Grace ",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Quick replacement",
      "text": "The right thumb button would get stuck whenever pressed. I contacted the company via it's website and filled out an online warranty form. Received a replacement very quickly. Reading the reviews it seems like this company does have quality control issues, I also had bad luck with other non Xbox brand controllers. But it was replaced quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Hwang",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Pretty nice",
      "text": "Good build quality and feels nice in my hand. Very comparable in size and feel to the original Microsoft controller. The rear buttons are easy to program and work as expected. My only complaint is the joystick radius feels a little tight, so if you're using this controller for a game that requires slight and precise stick movement, then this might not be your best option.",
      "rating": 4.0,
      "verified": true,
      "author": "Hammy",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Not for me",
      "text": "As a controller, it does its job and is pretty nice (minus the worthless back paddle buttons). But connecting a mic doesnt work too well as it cuts the sound in and out or doesnt work at all. So for me, I'll be sticking to third party controllers now.",
      "rating": 4.0,
      "verified": true,
      "author": "Buns",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Manufacturer Problems, Micro-USB input isn't Universal",
      "text": "This controller is not as good as an authentic controller from Microsoft. This controller will randomly start vibrating and the vibrations will not stop. Also, this controller sometimes disconnected randomly. The only way to stop the vibrations with this controller is to uplug it and to plug the wire back in. Also, the micro-usb input that they used for this controller isn't universal, so if your cable goes bad, you have to buy another controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Wes Gln",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Pretty solid",
      "text": "Feels good the buttons are pretty solid for the price, easy mapping, the controller is a little smaller and lightet then the standard ones, the back 2 buttons are not sensitive enough for me you really have to push them down to get the full effect. Sometime I can be in a battle combat in COD MW4 and back butts would stutter because im not pressing them all the way down. If you have heavy fingers this is for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Eddy Thai",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "So far, so good",
      "text": "Seems to be good quality so far. Feels light and cheap but it's not. With these types of controllers I usually find issues with the cord but I haven't had any problems yet. Will update this review if anything changes. The only thing I can say for sure that I don't like about this controller is the advanced gaming buttons on the back side. They're in a weird spot and I never use them anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Buggy product. Do not buy.",
      "text": "My first one had an issue right out of the box with the L thumbstick, where the character kept walking even after taking my thumb off. I returned it, fine. It's now 6 months later and the replacement has failed in a similar way, the L thumbstick thinking I'm trying to turn when I'm trying to move forward. I only use the controller about an hour a week on average, so the product basically failed after less than 30 hours of use. Of course, I no longer have the box and warranty information at this point, so the best I can do is tell everyone here to buy a different product.",
      "rating": 1.0,
      "verified": true,
      "author": "Elio K. Lewis",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Decent quality Xbox One Controller",
      "text": "For the price I paid for this controller the quality cannot be matched. These controllers are matched closely to the original Xbox one controllers, but the build quality feels lacking. The buttons are decent and there are some on the back that can be used as well which is nice. The controller itself feels smooth and this would be a great alternative for younger gamers to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Tech Horizon",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great buy... till RB broke.",
      "text": "it was a great controller and the extra buttons helped me out a lot. So I was very upset when I picked it up this evening and noticed the RB button was not even along the top... rather I started playing Devil May Cry 5 on PC and I quickly noticed I could not lock on. RB just bit the dust... Guess you have to be carefull with all controllers. Even the one with the console had this issue. I'm on the fence about purchasing another since I only got 6 months out of this one....",
      "rating": 2.0,
      "verified": true,
      "author": "Aaron Richards ",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "It Vibrates!",
      "text": "It has a solid quality feel to it and it vibrates! I started using it with my PC because of wrist issues but it was soon aquired by my niece for her Xbox. I haven't gotten it back yet and she won't part with it. While I had it, I found it to be a very solid little gaming controller. I'd buy it again, but I want my old one back!",
      "rating": 4.0,
      "verified": true,
      "author": "R. Williams",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Total Junk",
      "text": "I purchased this because of the reviews, but I guess you still can not trust Amazon reviews (according to the internet)! This controller feels like something you would but at a dollar store for a dollar. It did not work well right out of the box. I'm a casual gamer and I immediately knew this was junk. Buttons stuck but I thought maybe it was because it was new. However, after only a few hours of use the buttons either did not work or the controller would just cut off. Oh, and it arrived late too.",
      "rating": 1.0,
      "verified": true,
      "author": "Leann Vartanian",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Decent - UPDATED",
      "text": "Only downsides are the D-pad needs to be pressed pretty firmly to register, and the cord plugin on the controller is a bit weak. As such, I wouldn't recommend this for little kids that dont take care of their stuff. That said, the programmable buttons are super quick and easy to program, and everything else works well. Would buy again. Update: It's been just under 3 weeks of using the controller and the D-pad has completely stopped working.",
      "rating": 2.0,
      "verified": true,
      "author": "Ed Robux",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Its a controller, not a microphone, not worthy of buying",
      "text": "2 stars because the controller works like a regular controller is suppose to. I didn’t read this all the way and it is a wired controller, not wireless. Also the headphone jack doesn’t work. I ignored to reviews in hopes of getting a nice remote by luck, don’t do that. Please skip over this controller and pick another one. Go to game stop, Walmart, some place else- just not this remote. You’ll want your money back :( but I threw away all the packaging already soo, I can’t.",
      "rating": 2.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Very Defective",
      "text": "When i first received the controller and joined an online party i realized that the controller made the microphone impossible to pickup anything a practically had to yell every time i wanted to talk. But that was just beginning on the second day i loaded into a game and realized every time id press the RT button my character or left thumbtack would move forward in every game without me even touching it. This is my 5th power A controller i have never had any of these problems and i don't think ill be getting another one anytime soon. I would like a refund or a working replacement thank you.",
      "rating": 1.0,
      "verified": true,
      "author": "gula",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Just got it and already disappointed",
      "text": "I literally got the controller less then 3 hours ago just to find out the mic port doesn't work at all, I have tried adjusting all the microphone settings and nothing works and the headset I'm using is working perfectly fine I was using it last night on my phone and with my PC so the only thing I can think of is it's the mic port",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Bailey",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Broke after 2 months",
      "text": "First off, this controller caused a serious echo to happen using the headset connected into its port. My friends were kind enough to still play with me, but they were not happy when I would use this controller. Controller fell from about 2.5 feet high and broke - it is currently unusable. Poor quality materials.",
      "rating": 1.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Defective/Stopped Working",
      "text": "I received it by mail just today and I've been using it for a couple of hours and it has already stopped working. I know I paid less than an official Xbox controller, but this is licensed by Microsoft and has the Xbox branding on it. I really was expecting more. This is my only experience with PowerA, but I wouldn't recommend this product. Returning it and seriously considering dishing out the 60$ for the official controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Ramon Castillo",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Scary",
      "text": "It’s a good controller alright I’ll admit but Christ I just got the absolute piss scared out of me it is currently 1:38 in the morning while I’m writing this so I decided to play some mobile games and my computer is broken so I used YouTube on Xbox so I put the headphones on and I get through a few songs right then next thing you know straight white noise as loud as it can be straight into my ears damn near had a heart attack so yeah be careful when using headphones in this damn thing",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Good but not great",
      "text": "To start off this is unarguably the best controller for less than $60 that I have tried. The buttons on the back are easy to use and program and really help in some situations. That said the controller’s triggers feel and sound like they have no lubrication and poor finish for the first couple hundred hours of use, and the controller does feel quite cheap before you get used to it, you can tell that it is thinner plastic than the original controller and I wouldn’t recommend it in any situation where it would receive more than it’s fair share of drops and bangs. This product is great for me and has more than handled everything I’ve wanted it to.",
      "rating": 4.0,
      "verified": true,
      "author": "James Coley",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "This controller will push your buttons...",
      "text": "I like the trigger grips, but you have to buy a new controller ever 3 months, buttons start going off even before you hit them or they dont work at all, so you be playing a shooting game, you run and the start aiming your gun, i dodnt even touch the button, not worth it....",
      "rating": 1.0,
      "verified": true,
      "author": "Miles",
      "helpful_votes": 2,
      "publication_date": 20190907
    },
    {
      "title": "Better than expected",
      "text": "I really like this controller but it's small for my hands. it feels like just like an xbox controller apart from the triggers but for around this price this controller has the quality. The thumbsticks press doesn't feel too good but it has 2 extra bottums on the back. This is a good backup controller and split the use between controllers. Headset get terrible sound with this controller",
      "rating": 4.0,
      "verified": true,
      "author": "Hansser D. Familia",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Does everything I want it to do.",
      "text": "Everything I want out of a controller. My main issue with my version of Xbox controller was the USB port. It was easy to bump it when you put the controller down, bending the contacts on the inside. My old controller kept disconnecting while playing so I wanted a cheap alternative. This controller has the USB port encased in plastic with a small slot for the USB connection to protect the port. Been using it for about a month now and works with all my games on PC.",
      "rating": 5.0,
      "verified": true,
      "author": "Manny Man",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Good, inexpensive controller",
      "text": "Just got the controller and it was exactly as stated in the description. Last PowerA controller had an issue with a stick going bad, so I pickedup another. A note on the sticks - they are not the same as Microsoft contrllers if you ever open it up and want to replace it. I tried on the last one with no luck. Otherwise a decent controller for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Watch your hands...",
      "text": "Great controller, lightweight, both input and rumble are very responsive. Just... be careful if you have anything on your hands, the thumbsticks are like debris magnets. I had constant left strafe movement on my left thumbstick, so I took the shell off to see what was causing it and... it was a crumb or pebble, not entirely sure which, that had dislodged from under my thumbnail and dropped into the recess for the thumbstick.",
      "rating": 4.0,
      "verified": true,
      "author": "Adviser69",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Outstanding quality",
      "text": "I've been using this thing for a month now, and have zero complaints. The buttons on back are an idea that MS should have implemented in their controllers way back with the original Xbox. I've always found it difficult to press down on the sticks while using them, so that's what I remap. This controller's quality convinced me to order their PowerA Fusion Pro - a substantial investment at around three times the price of this unit. This controller is well worth the $25 I paid for it.",
      "rating": 5.0,
      "verified": true,
      "author": "DLK",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "This Saved My Money's Life. O.O",
      "text": "This Is Perfect For Pc/Xbox One, It's Not Like Most 20$ Controllers I've Used. Granted. You Need To Calibrate And Ajust The Sensitivity Accordingly. It Comes With A Very Long Cord. And Its Not To Light Or Heavy. Being A Gamer Rager 40-70$ Controllers Were Not Only Creating A Controller Grave Yard But A Mountain Of Cost, So I Recommend These For Children, Or Adults Alike. It Saves Money, And Batteries If You Don't Have Rechargeables. The Headphones Work As Usual.",
      "rating": 5.0,
      "verified": true,
      "author": "AngelKnightZero6",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Disgusted. Wasted my money. Absolutely avoid this product.",
      "text": "It arrived with a dent in the plastic, the delivery driver placed my package literally at the door step, so close I nearly crushed it just while opening my front door. The controller itself was loosely packaged, likely what lead to it not working. It did not even turn on. Broken right out of the package. The controller was so lightweight, one could not use the word durable to describe it. Felt cheap, and ultimately was a waste of my time. Most disappointing purchase so far on Amazon. Will not be buying from this company again. Don't fall for their snake oil description, this is a poor product.",
      "rating": 1.0,
      "verified": true,
      "author": "David M",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Poor product.  Avoid!",
      "text": "These controllers are terrible. The first two I bought had all sorts of problems and random movements. They wouldn't calibrate! I contacted their customer support to get advice on calibration and they just sent me ONE replacement controller, and never explained how to calibrate them. The 3rd controller would, randomly, lateral the football in Madden games. Then the right bumper snapped off after 3 weeks. Avoid!! You get what you pay for, I guess.",
      "rating": 1.0,
      "verified": true,
      "author": "Wisdom",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Better to get an original X1 Controller or Gamesir also a great choice",
      "text": "Updated Review Xbox Originals are the obvious best choice terrible up button stop working after like 2months of use taking good care of it not even calibrating fix it ,got a gamesir mini with smartphone clip controller xinput rechargeable Android Windows IOS for 3 years and it work like a charm excellent never had a single issue so far this Power A controller is not what i expected",
      "rating": 1.0,
      "verified": true,
      "author": "WaveSurf",
      "helpful_votes": 0,
      "publication_date": 20190817
    }
  ],
  "product_meta": {
    "title": "PowerA Enhanced Wired Controller for Xbox One - White",
    "description": "The PowerA enhanced wired Controller for Xbox One introduces a new form factor that looks familiar, feels comfortable in your hands, has a soft-touch rubberized Finish, and works with all your games. This Officially Licensed Xbox Controller features two mappable advanced gaming buttons on back, dual rumble motors, and 3.5mm stereo headset jack to enhance your gaming experience. Of course, you'll also find all the basics such as precision-tuned analog sticks, plus shaped d-pad, and standard button/bumper/trigger layout. Getting all these features at nearly half the price of wireless Controllers makes PowerA enhanced Controllers a no-brainer. Finally, our 2-year limited warranty reinforces our commitment to Quality ensuring you can trust PowerA products to perform.",
    "rating": 4.2,
    "feature_bullets": [
      "Advanced gaming Buttons with dual rumble motors",
      "New familiar form factor",
      "Officially Licensed for Xbox One",
      "3.5 millmeter stereo headset jack and a Removable 9.8 feet (3 Meter) USB cable",
      "2 Year limited warranty"
    ],
    "specifications": {
      "ASIN": "B07DJ6D4ZY",
      "Release date": "March 1, 2018",
      "Customer Reviews": "4.2 out of 5 stars3,710 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#1,272 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "5.43 x 4.06 x 2.64 inches; 12 Ounces",
      "Binding": "Video Game",
      "Item model number": "1506928-02",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "12 ounces",
      "Manufacturer": "POWER A",
      "Batteries": "2 AA batteries required.",
      "Date First Available": "June 12, 2018"
    },
    "categories": [
      "Accessories",
      "Controllers",
      "Video Games",
      "Xbox One",
      "Gamepads & Standard Controllers"
    ],
    "price": 24.99
  }
}