{
  "website_summaries": [
    {
      "verdict": "Majority of its users feel confident about the Asics Gel Sonoma 4, as they complimented the shoe’s features that have improved their running performance. Runners were quick to applaud the supportive and comfortable structure of the Gel Sonoma 4, while others expressed their delight over the shoe’s design and price. Although there were a few criticisms about fit, the overall rating of the Gel Sonoma 4 is positive.",
      "pros": [
        "Many users appreciate the affordable price of the Asics Gel Sonoma 4",
        "Some runners were pleased that the shoe does not require a break-in period",
        "The Sonoma 4 is easy to clean, according to a reviewer",
        "One user said the shoe provides a lot of support",
        "The color options of the Gel Sonoma 4 are praised by many",
        "The shoe feels durable, said a couple of buyers"
      ],
      "cons": [
        "A couple of reviewers have mentioned that the shoe is too tight, especially for wide-footed wearers",
        "One runner disliked the height of the collar and said it makes running uncomfortable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.8,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Falling apart",
      "text": "I would not purchase these again. They are only 2 months old and are already coming apart. Note in the two attached pictures the holes on each side. I would love to return them if at all possible.",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory A Logan",
      "helpful_votes": 7,
      "publication_date": 20200317
    },
    {
      "title": "Good inexpensive shoe",
      "text": "Ecoconomical shoe for me as a older person looking for low heel to toe difference. More natural. Thinner sole provided stable jog. Less expensive construction with printed pattern for support on sides may not offer support over time. Well cushioned sole without mushy feel of too soft elastomers. Reccommended for non hard core runner.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20191105
    },
    {
      "title": "Way too narrow for marked size",
      "text": "I have D width feet and needed a shoe for a trail race. I saw these online and decided to try them. Bad choice, I tried them on once and packaged them up for return. They are so, so narrow. The length is sufficient for marked size (just barely) but the shoe is soooooo tight across the top I can't tie the laces. Time to try another brand.",
      "rating": 3.0,
      "verified": true,
      "author": "ZenguyTop Contributor: Running",
      "helpful_votes": 3,
      "publication_date": 20190401
    },
    {
      "title": "Great rubbing shoe",
      "text": "Love them Are use them for running and CrossFit Great for cardio activities Really structured and firm - You can feel they are stabilizing your feet while you’re running but if you buy them don’t expect a very soft shoe The design is a bit rough but totally worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "rubi",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Holding up fine",
      "text": "I’m on my feet 10hrs a day at my job. It’s not very strenuous on the shoes but I’m standing and walking all day and I’ve had these for over a month. I do not have holes in my shoes and they don’t seem like they will get holes either.",
      "rating": 4.0,
      "verified": true,
      "author": "Oil boy",
      "helpful_votes": 0,
      "publication_date": 20201025
    },
    {
      "title": "Great shoe, just a bit tight but very secure",
      "text": "very supportive and comfortable show, after 3-4 use break-in (10 miles). What's with the really cheap shoelaces? They must have saved 3 cents vs the previous model.",
      "rating": 5.0,
      "verified": true,
      "author": "Constant",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Running shoe runs about a half size smaller than standard shoe.",
      "text": "I liked the weight & color of this running shoe. Note: the laces that come with the shoe have orange trim & not blue as pictured.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim  M",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Comfortable shoe.",
      "text": "Good shoe, very light. Toe area is a little cramped, but that's getting better as I break them in.",
      "rating": 5.0,
      "verified": true,
      "author": "M.Lawrence",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Good fit and comfortable",
      "text": "Hard to break in but really comfortable once they do.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben V",
      "helpful_votes": 2,
      "publication_date": 20200219
    },
    {
      "title": "It's great for the price point.",
      "text": "The clean design was what initially attracted me, but the fit is very light and tight. I have very flat feet, too, so I instantly swapped the insoles for some with greater support. After about a week of outdoor use, they felt broken in. After another two weeks, the softer fabric on the side of the toe-box had snagged and ripped, and has gradually grown with time.",
      "rating": 4.0,
      "verified": true,
      "author": "AmericanCorgi",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "great running shoe",
      "text": "My husband has a hard foot to fit when it comes to shoes. He really liked how they fit. A great fitting quality shoes I believe is what he said",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya M. Seymour-Keefe",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Good QPR and works as advertised",
      "text": "Nice shoe with good cushioning. Stability is a bit less than expected but works well for moderate hikes/trail walks. I’m just over 200 lbs. if that helps some decide.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad Barker",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great looking shoe.",
      "text": "These are just a tiny bit narrow compared to my usual Asics. Great looking shoe and they go really nice with brown or tan shorts.",
      "rating": 5.0,
      "verified": true,
      "author": "daleolson",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Fit perfectly",
      "text": "Bought these for my boyfriend and he loved them. Fit was true to size and extremely comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Carey Lyn",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Runs small",
      "text": "This shoe is 1/2 size too small. I recently purchased 2 asic shoes that were true to size. This one is not true.",
      "rating": 3.0,
      "verified": true,
      "author": "Chad Davis",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Little snug",
      "text": "I love the shoes. The width is a little snug but works out just fine for me. If you have wider feet you may have an issue with sizing",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "I will buy them again",
      "text": "So far they are great shoes. I probably should have gotten a larger size.",
      "rating": 4.0,
      "verified": true,
      "author": "James M.",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Good quality and fit",
      "text": "My husband won't stop taking about how much he likes these shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Camper",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great walking shoe",
      "text": "This shoe is very light with little arch support. It has great heel support and fits comfortably. This is a wonderful shoe for walking or work. If you need a higher arch or you are looking for a running shoe, this is not the shoe for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "High quality and comfortable shoe at a fair price",
      "text": "Quality shoe at its best. Extremely comfortable in shuch way that a can wear them all day. They are also lightweight",
      "rating": 5.0,
      "verified": true,
      "author": "Julio",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Good shoes",
      "text": "Tried on at a store first and then purchased on Amazon. Comfy and work well!",
      "rating": 5.0,
      "verified": true,
      "author": "TheMrTRoe",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Dont buy",
      "text": "The shoe fell apart too soon. Only wore for 3 months before the tab and sole separated from the shoe.",
      "rating": 2.0,
      "verified": true,
      "author": "Houston Cole ",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Trying them out",
      "text": "Heel is wider than my other ASICS, I have a narrow heel. So it feels like it slip. It hasn’t just hope I don’t get blisters",
      "rating": 4.0,
      "verified": true,
      "author": "jay mccormack",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Exact fit, good sneakers overall",
      "text": "Size is just right but for width is a bit tight",
      "rating": 4.0,
      "verified": true,
      "author": "H A Salih",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Great shoe",
      "text": "Great fit and first time I didn't have to pull out the insole and replace it with an after market insole.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott wright",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Disappointing because it’s a comfortable, good-looking shoe.",
      "text": "Stitching on outside failed after just a couple hours of normal wear. I’m not heavy set nor do I have a wide foot. It’s either a fluke, poor quality or just a bad design.",
      "rating": 2.0,
      "verified": true,
      "author": "ThisBrandonJames ",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Satisfied purchase",
      "text": "Great pair of shoes felt comfortable right away.Still breaking them in",
      "rating": 5.0,
      "verified": true,
      "author": "John C harris",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Perfect fit",
      "text": "Shoes fit perfect and they are very comfortable just as I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "True to size",
      "text": "Perfect fit for me. Very comfortable and feels like you are running on air",
      "rating": 5.0,
      "verified": true,
      "author": "Pitch",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "It feels great",
      "text": "The fit was really good and comfortable. I use it for power walking",
      "rating": 4.0,
      "verified": true,
      "author": "Raynor Edwards",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Runs a half size small but great shoe",
      "text": "Seemed like a really good shoe but they run a half size small compared to most",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Asics great as always",
      "text": "Most durable shoes ever. I use them everyday and on every terrain.",
      "rating": 5.0,
      "verified": true,
      "author": "Rene Valenzuela",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "great service; ordering was easy",
      "text": "Asics makes a great product; always good quality and fit.",
      "rating": 1.0,
      "verified": true,
      "author": "rbrown",
      "helpful_votes": 0,
      "publication_date": 20190704
    }
  ],
  "product_meta": {
    "title": "ASICS - Mens Gel-Sonoma 4 Shoes",
    "description": "Durable midsole material that provides cushion for all day comfort. Optimized trail outsole with both uphill and downhill lug configuration for great traction. Visual currency of a more modern trail design with a less bulky yet fully functional silhouette.",
    "rating": 4.5,
    "feature_bullets": [
      "AmpliFoam Midsole - Engineered to maintain durability at softer densities, providing better flexibility, comfort, and platform adaptability ideal for natural running.",
      "Rearfoot GEL technology cushioning system - Attenuates shock during impact phase and allows for a smooth transition to midstance.",
      "Outer Material: Synthetic",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Trail Specific Outsole - Reversed lugs provide uphill and downhill traction on all types of terrain.",
      "Ortholite Sockliner - Moisture management (Ortholite is a registered trademark of ATP Manufacturing LLC)."
    ],
    "specifications": {
      "Product Dimensions": "25.4 x 38.1 x 15.24 cm",
      "Date First Available": "18 Dec. 2018",
      "Manufacturer": "ASICS",
      "ASIN": "B07MY7Z9WQ",
      "Item model number": "1011A177",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}