{
  "website_summaries": [
    {
      "verdict": "Large glove size with a soft feel and a big pocket that’s perfect for outfielders.",
      "pros": [
        "Lacing in this glove is among the best you’ll find, providing ball security in the pocket",
        "Leather is extremely soft, giving you a good feel for the ball",
        "Available in multiple sizes up to 12.75 inches"
      ],
      "cons": [
        "Pricier than others",
        "Probably won’t last more than one season of heavy play"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This glove is amazing for the price!!",
      "text": "I’ve been looking for a replacement outfielders glove. Searched around, checked Dicks sporting goods and other local sporting goods stores. I couldn’t find anything that was quality feeling for a reasonable price. The only gloves that felt right were the A2000 or heart of the hide $250 gloves. I chanced it and bought this glove along with the hot glove break in kit. This glove blew my mind! VERY quality for the price and gets softer doing the hot glove treatment. Feels just like the $250 gloves at more than half the price. Highly recommended!!",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick Von Lappenstein",
      "helpful_votes": 6,
      "publication_date": 20190410
    },
    {
      "title": "DO NOT BUY",
      "text": "The gap in the webbing is too large and allows a fastball to easily come right thru it- my son was almost seriously injured first time he used. Absolutely idiotic design.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190920
    },
    {
      "title": "Good quality glove for a nice price",
      "text": "My son and I have been breaking in the glove at the gym. He was looking for an outfielder glove. The glove is of good quality and without any defects. My son likes the feel of the glove. I agree with the other reviews with regard to this being a great glove for the price. I have tested it and am surprised at the level of utility, protection, and the amount of break in that the glove already had.",
      "rating": 5.0,
      "verified": true,
      "author": "Traz",
      "helpful_votes": 2,
      "publication_date": 20200104
    },
    {
      "title": "Good value",
      "text": "Good value baseball glove but clearly not up to the level of Rawlings HoH or Wilson A2000 (which are much more expensive). Breaks in easily and nice professional pattern but don’t expect it to last forever",
      "rating": 3.0,
      "verified": true,
      "author": "Major_Dog",
      "helpful_votes": 4,
      "publication_date": 20190710
    },
    {
      "title": "Awesome feel and features at a price that makes you wish more pro gloves were priced this way.",
      "text": "This is a great glove that feels and functions extremely well, and as others have mentioned, performs like gloves one to two hundred dollars more. And in a sense, it’s what a glove should be: one that gives the player the right combination of performance and value. The cherry & black leather version is beautiful. Break-in was standard like any high quality glove through shaping and malleting around a baseball, applying a high grade leather conditioner, and trial testing through fielding and was ready to go within 48hrs. Will be using this Mizuno for many years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "love that Brooklyn",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Easy to break in",
      "text": "Glove was quick to break in... Glove has been used by several different catchers all seem to like it...",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190603
    },
    {
      "title": "Great quality and durability",
      "text": "These are great quality gloves. The leather is great for the price and feels like a more expensive glove. I have 2 now, one for each daughter and the durability is great for the past 2 years, so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph a medina",
      "helpful_votes": 2,
      "publication_date": 20190928
    },
    {
      "title": "Great mitt",
      "text": "I used this glove in highschool and it was the best one I’ve had even compared to the higher end Wilson’s or Rawlings. I always buy two because they break in nice but after one season it’s pretty much done with depending on how hard your pitchers are throwing. This is definitely an adult glove so it’s way to big for kids let them stick to 32 or 33",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Cortes",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Good price/Good glove",
      "text": "This is just what I was looking for in a glove. I didn't want or need a \"pro\" model, as I mainly just play catch with my grand kids. This is a super fit for that and the quality is such that I'm sure it would be a great glove for game play as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Good gloves",
      "text": "All of the MVP prime series require a break in period but they are all quality gloves that are durable. My son loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "md35",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Great bang for your buck",
      "text": "Old competitive player who lost track of her nice glove long ago. Recently the boyfriend and I have started playing catch and I needed something a Bit nicer than what I could pick up at walmart, but since I am not playing again, I didn't need the crazy expensive ones. This one fit the bill perfect. Very little break in time, but just enough to know it is a real glove. Great for that intermediate player or someone just looking to have a steady go to when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Kids love the glove.",
      "text": "This is not the greatest glove made. However, our kids 9&10 year old love the glove. So, that is what really matters. The string configuration is unusual and constantly needs to be tightened. We will definitely buy again. Great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Wager",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Comfortable Glove",
      "text": "Really soft leather, but stiff enough to require an extended break-in process. This is definitely the nicest glove I have ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul G",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Great Glove!!",
      "text": "I’ve always loved Mizuno and they didn’t disappoint this time either! Greatly crafted, comfortable and affordable! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota Jarvis",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Pretty good",
      "text": "Great glove. Have to break in but after about a week it is pretty usable. Early on but so far so good my do. Throws about 72 and glove has good padding on outside fingers but palm is a little thin",
      "rating": 5.0,
      "verified": true,
      "author": "christopher Walsh",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Good team mitt",
      "text": "Was looking for a team mitt at a good price. Cannot complain about anything except thickness in the pocket. Is being used for adult baseball league. If you’re catching 80 mph or higher fastballs you may want more thickness in the pocket. Otherwise a great glove for the price. Didn’t take long to break in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Worth the price",
      "text": "Good quality for the price. Good for a high school outfitter.",
      "rating": 5.0,
      "verified": true,
      "author": "NP",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Good for the coat",
      "text": "My son is a 11 year old catcher. It fit good and not stiff.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great glove for the money",
      "text": "Decent leather for the money. Ball did get stuck in the open pocket once so maybe should have purchased the glove with different webbing.",
      "rating": 4.0,
      "verified": true,
      "author": "P. K. Odonnell",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "I like it",
      "text": "I like the catchers mitt a lot . If your hands are big I would not recommend this mitt . Started catching with it right out of the box . For the $ , I do recommend purchasing this item .",
      "rating": 4.0,
      "verified": true,
      "author": "Brian depalmo",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Perfect for my Teen",
      "text": "Perfect glove for my teen! It didn’t take too long to break in either. Also, looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Good",
      "text": "My son loves the glove but because of school shutdown only played 4 preseason games",
      "rating": 4.0,
      "verified": true,
      "author": "gee",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great Glove",
      "text": "Value for money for the quality..Great glove,easily broken in..My son loves this glove and will be using this on the coming international tournament.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeJr76",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Quality and value can't be beat.",
      "text": "Absolutely love this glove. Quick break-in, Great performance, quality and feel for a very reasonable price point. Very excellent bang for the buck.",
      "rating": 5.0,
      "verified": true,
      "author": "fe",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Very useful",
      "text": "The glove comes already pretty soft . My kid loves it.. and i also like it .feels a looks pro.",
      "rating": 5.0,
      "verified": true,
      "author": "yei 180",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Excellent company to deal with",
      "text": "My grandson loved it. It was his Christmas present. Now he needs to break it in",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary Mlynarski",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "very good glove!",
      "text": "good glove, material, price, I play fastball softball, I play second base and I find it very well",
      "rating": 5.0,
      "verified": true,
      "author": "Tomasm12",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Good glove",
      "text": "very good glove. Is small for adults use. It more for youth",
      "rating": 5.0,
      "verified": true,
      "author": "hybrid case",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "easy to break in",
      "text": "Very easy to break in. Had it mostly broken in within 24 hrs",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Ready SS and 2B glove!",
      "text": "I like this glove and for me it is the best glove for that’s price. Ready to use! Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Stefano",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Really happy with this glove",
      "text": "So far (after 1 month) I'm really happy with this glove. Good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Dieter Vanderbeken",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Great Glove",
      "text": "My 10 year old loves it. Pretty much game ready when it arrives. It fits him well with room to grow.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Massey",
      "helpful_votes": 0,
      "publication_date": 20201113
    },
    {
      "title": "MIZUNO MVP Prime = Very Good Value",
      "text": "I purchased the MVP Prime cather's mitt and pitcher's glove. Love them! I have large hands so these gloves designed especially for high school level and above may be a slight tight fit if you also have large hands. They fit just right for my ladies' hand.",
      "rating": 5.0,
      "verified": false,
      "author": "1oYrsafteR",
      "helpful_votes": 0,
      "publication_date": 20191001
    }
  ],
  "product_meta": {
    "title": "Mizuno MVP Prime Baseball Glove Series",
    "rating": 4.8,
    "feature_bullets": [
      "Bio soft leather: professional style smooth leather that has the perfect balance of oil and softness for exceptional feel and firm control that serious players demand",
      "Professional level lace: same durable lace that's offered in our professional-level gloves",
      "Outlined, embroidered logo: for a rich, premium look",
      "Right hand Throw= worn on left hand, left hand Throw= worn on right hand",
      "Right Hand Throw = Left Hand Glove, Left Hand Throw = Right Hand Glove"
    ],
    "specifications": {
      "Date First Available": "June 28, 2018",
      "Manufacturer": "Mizuno",
      "ASIN": "B07F3C4CBV",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Baseball",
      "Sports & Outdoors",
      "Team Sports",
      "Catcher's Mitts",
      "Sports & Fitness",
      "Mitts"
    ],
    "price": 94.21
  }
}