{
  "website_summaries": [
    {
      "verdict": "Premium look with quality to match. Set comes with two craftsman paddles. Beach-ready set with a matching drawstring bag and ball. Attractive and easy to clean.",
      "pros": [
        "Paddle is made from pine, sapele, and beechwood for a unique stripe design",
        "Neoprene wrap creates a comfortable grip that stays in your hands during play",
        "Lighter, smaller paddles",
        "Opposing wrap colors are a bonus"
      ],
      "cons": [
        "Inconsistent packaging and reports of the grip coming undone after only a few games",
        "Could be hard to hold for kids"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice raquets",
      "text": "Excellent raquets. Use to buy cheap ones until I decided to go for this pair. Big difference. Will deffenetly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa Leon",
      "helpful_votes": 4,
      "publication_date": 20191010
    },
    {
      "title": "A Lot Of Fun",
      "text": "We have played paddleball a lot, since we live on the beach, but this takes it to the next level. The paddles are slightly smaller than the American style paddles, lighter, and springier. It makes the game faster and more challenging. They also look really nice. I highly recommend these paddles",
      "rating": 5.0,
      "verified": true,
      "author": "Gio",
      "helpful_votes": 5,
      "publication_date": 20180711
    },
    {
      "title": "Great rackets!",
      "text": "These are awesome! A bit heavy, but I think that's just part of the design for this game. I think these are a good option for beginners that are will to invest a bit more for nicer racquets. The game is super fun.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Sanchez",
      "helpful_votes": 2,
      "publication_date": 20200126
    },
    {
      "title": "A bit too heavy",
      "text": "These paddles are extremely well-made but they are too heavy in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 3,
      "publication_date": 20190809
    },
    {
      "title": "Not worth your buck!",
      "text": "Good material, perfect bag and good ball included. A bit small, the grip came out the second time I played with my wife, over priced for quality considering the grip came off on SECOND time I played.",
      "rating": 3.0,
      "verified": true,
      "author": "Tacito",
      "helpful_votes": 4,
      "publication_date": 20190110
    },
    {
      "title": "Items missing inside the box.",
      "text": "Worst packing in my amazon history. It came open and inside the box just one paddle. My son sad he didn't get his present as expected.",
      "rating": 1.0,
      "verified": true,
      "author": "B & L",
      "helpful_votes": 2,
      "publication_date": 20190518
    },
    {
      "title": "Five Stars",
      "text": "Awesome paddles for the beach...both adults and kids could enjoy them",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Didn’t come with a ball like it said",
      "text": "Didn’t come with ball. Paddles look nice. Not sure how to get the ball that I paid for as part of the set.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Totally recommend! The paddles are hi-quality",
      "text": "Totally recommend! The paddles are hi-quality, thick and well finished. I bought from another brand and had to return, but now with this model I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Gustavo",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "QUALITY MADE",
      "text": "I LOVE THESE RACKETS! THEY ARE HIGH QUALITY AND EVERYONE ON THE BEACH IN GREECE WAS ASKING WHERE WE GOT THEM!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Alevras",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Beautiful set. Very happy with product and the packaging. Would highly reccommend",
      "text": "Very well made, beautiful wood. Would highly recommend and will buy another set myself. Ball high quality, too. Came with nice canvas bag to store paddles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimie B.",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Quality and skill required.",
      "text": "High quality. More challenging than similar type games. This one is wood feels good in the hands and a game that improves with practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael W Gunning",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "split in two second time used!!!",
      "text": "second time i used it, it split in two!!! this was an expensive set and didn't last any time! horrible quality!!",
      "rating": 1.0,
      "verified": true,
      "author": "Stig Ravdal",
      "helpful_votes": 0,
      "publication_date": 20201126
    },
    {
      "title": "American version of Brazilian frescoball",
      "text": "Nice cheaper alternative to the real deal from Brasil. Also lighter which for me, is nice. Haven't used it yet, so not sure how it will handle once wet from playing on the beach.",
      "rating": 5.0,
      "verified": false,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190621
    }
  ],
  "product_meta": {
    "title": "Hammer Crown Frescobol Paddle Ball Set (Beach Stripes)",
    "description": "This frescobol paddle set comes with 2 natural wood paddles, 1 ball and a cool canvas bag. The paddles are made with 9 different individual pieces of pine, sapele and beech wood that are bonded together to form this eye catching beach striped design. The handle of each paddle is wrapped with a neoprene grip. 1 Paddle has a black grip and the other paddle has a blue grip. Each paddles weights between 11-13 ounces, so they are light enough to play all day. The paddles have a nice water and sand resistant finish on them. Some people call these beach bats or paddle ball or even beach pickle ball. Unlike pickleball, frescobol is a beach paddle sport where you work with your partner to hit the ball back and forth as many times as you can without allowing the ball to hit the ground. Some other names for this type of beach paddle game around the World are Matkot, Beach Tennis, Smash Ball and Raccettoni. Grab a friend and start playing the fast paced game of frescobol now.",
    "rating": 4.5,
    "feature_bullets": [
      "Comes with (2) Solid wood paddles (16.5” Long 7.75” Wide)",
      "Comes with (1) 2.25” diameter frescobol ball.",
      "Comes with (1) Canvas draw string bag.",
      "Made from 9 different individual pieces of Pine, Sapele and Beech wood.",
      "Light enough to play all day long. Each paddle weighs 11-13 ounces"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "16.5 x 7.75 x 0.62 inches; 2.54 Pounds",
      "Date First Available": "May 15, 2018",
      "Manufacturer": "Hammer Crown",
      "ASIN": "B07D3CVJTR",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Fitness",
      "Sports & Outdoors",
      "Tennis & Racquet Sports"
    ],
    "price": 74.95
  }
}