{
  "website_summaries": [
    {
      "verdict": "Displaying the classic and simple aesthetic of your well-loved Keds sneakers, the Keds Courty’s main strengths are its simplicity, versatility and optimal comfort. With its straightforward design consumers are offered plenty of opportunities to mix and match with a wide array of casual ensembles.",
      "pros": [
        "Comfortable is a frequent word has used in describing the Keds Courty",
        "Several shoe users have remarked at how nicely has padded this pair is thanks to its Dream Memory Foam footbeds",
        "The sneaker’s simple aesthetic is commended by most consumers as it is versatile and easy to dress",
        "A good number of commenters have found it to be cute and appealing",
        "Few purchasers have adored this kick so much that they have bought multiple pairs",
        "Some wearers have commended the quality of this shoe’s construction"
      ],
      "cons": [
        "A number of shoppers wished that it came in more colorway options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.7,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good value, except for one thing...",
      "text": "The delivery time was very quick...just a couple of days. I liked the style so much I bought a blue and black pair. The pricing was good and the memory foam insert is very comfortable. The only drawback is that while wearing the sneaker, I started to feel as if my feet were too flat against the flooring/ground with each step. Then I realized it was because there is almost no arch support in these shoes. I had to go out and buy a pair of arch supports; once they were inserted, I felt the difference immediately. The sneaker just fit better overall and that sense of being \"flatfooted\" was no longer there.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael A Ferullo",
      "helpful_votes": 5,
      "publication_date": 20200813
    },
    {
      "title": "Just a Nit: Shoelaces are Worthless",
      "text": "Love these Kids sneakers. This is my 3rd pair. The quality of the shoe is great. Fit is great. However...this last pair came with shoelaces that will probably break in another week or so. Quality of the laces that are paired with this high quality sneaker is more than disappointing -- especially since the price keeps going up, albeit expected. History: 1st pair came with a sturdy, grey lace that matched the shoe. Really nice. The 2nd pair came with sturdy, white laces. Not as nice looking but still nice quality laces. This 3rd pair's laces are beyond acceptable for this price point. Yes, I know, just a nit.",
      "rating": 3.0,
      "verified": true,
      "author": "JaneW",
      "helpful_votes": 3,
      "publication_date": 20200511
    },
    {
      "title": "Can't be Keds",
      "text": "I really liked the shoe and the 9 1/2 fit just right in the heel area but it went wrong in the toe area. It was so wide as if it belonged to a wide not medium. I've worn Keds for a long time with no problems. This just doesn't work for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Kantuck",
      "helpful_votes": 6,
      "publication_date": 20190717
    },
    {
      "title": "I wasn't aware that my feet were wide...",
      "text": "...and I still don't think they are. I was really pleased with these shoes at first, they look nice and even have a bit of padding on the sole but as I continued to wear them my opinion changed. The toe box was too tight but not tight enough that I noticed it before it was too late. I'd never had this problem with Keds even when I was traveling abroad and walking all day everyday. ~ get at least a half of a size up, I honestly regret buying these .",
      "rating": 1.0,
      "verified": true,
      "author": "Brickysmells",
      "helpful_votes": 3,
      "publication_date": 20191012
    },
    {
      "title": "Wide foot bed, comfortable supports, very practical, not super cute in 08/10",
      "text": "The arch support is really nice. Easy to match to any outfit. Super comfortable for all day wear. Regarding the fit, it’s pretty wide/loose for a regular size. The sides of the shoe are very wide, which makes an orthopedic affect. BUT if comfort and good quality shoe is the main need (not cuteness) then this is a good purchase. 08/10",
      "rating": 4.0,
      "verified": true,
      "author": "M.D.",
      "helpful_votes": 2,
      "publication_date": 20191019
    },
    {
      "title": "Perfect Comfort",
      "text": "I’ve worn Keds for 50 years and these are by far my favorite. COMFORT, style and fit. I wear a 9.5 slim closed toe shoe and this 9.5 Med fits perfect, with ankle athletic socks and without. Wouldn’t change a thing. Did I mention that they are COMFORTABLE ? The toe box, arch and heel feel like they’re sitting in little clouds.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Anne Burnette",
      "helpful_votes": 2,
      "publication_date": 20200715
    },
    {
      "title": "Comfortable",
      "text": "These replace a very similar Keds that is discontinued, I like the fit, perfect in the toe area, I have a bunion on one foot and these do not hurt, slightly narrower in the heel, most other brands are too wide, the cushioned insole is nice, like the traction on rubber sole, and the extra material in the toe area. These are the only sneaker I can purchase on-line and know that they will fit my size 7 perfectly. And I can walk all day in comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "D. F.",
      "helpful_votes": 3,
      "publication_date": 20200210
    },
    {
      "title": "Fit great, as described. Quality is lacking.",
      "text": "I’m a little Disappointment with the quality of this pair of shoes. I have purchased 4 pair over the last year because at my job they get so dirty. This pair however I have only wore a few times and the rubber around the bottom is separated.",
      "rating": 3.0,
      "verified": true,
      "author": "Tracie Byers",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Cute but narrow",
      "text": "These are very cute shoes for everyday. I was looking for a cute sneaker to wear to work now that my office has gone to casual clothing. These are nice, but they are narrow on my slightly wider feet. Not the most comfortable, but seems fair for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Maggie Thomas",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Love them",
      "text": "Second pair, I love them. They are good durable quality, however they may leave blisters if you don’t properly break them in. Once broken in they will become your favorite pair of “old kicks” to throw on for a casual day out or to pair with a cute outfit.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsy Bryce",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Happy Wife!",
      "text": "Product arrived as advertised, on time and in original packaging. Complete satisfaction and my wife was happy with the fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Gyulveszi",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Good for my one high arched foot.",
      "text": "I have been struggling to find shoes that fit my weird high arched foot. I should note that this didn't used to be a problem until I had my daughter three years ago. Now I really struggle finding shoes that fit my right foot well. Keds Classic have fit well in the past but they don't have a lot of cushion. These updated pair are wonderful and fit both of my feet!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Nice shoe",
      "text": "This shoe is very nice and well made. The insole is very comfortable. They are a little snug at the toe box but I have a odd shaped foot lol. Overall nice shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Staffeldt",
      "helpful_votes": 2,
      "publication_date": 20190929
    },
    {
      "title": "Okay",
      "text": "I love the brand but needed more support than this shoe offers. Another Keds sneaker might be better. It felt flat and without much cushioning or arch support.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Dawson",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "like, but slippery.",
      "text": "I love the shoe; looks nice, and well made, but they are narrow, especially across the base of the toe area, and the heel took awhile to break in. I love the inner sole and arch. I took away a star because of the traction of the outer sole. It looks like it would be good but is not; it is slippery on dry surfaces, I have not tried wet. Traction is important to me, and I have other keds which are good.",
      "rating": 4.0,
      "verified": true,
      "author": "cam",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Courty Core has soft collar",
      "text": "The soft collar on this shoe makes it more comfortable than the non-padded edge of the Champion model shoe. The fit is good and the soft foam in the foot bed makes it feel bouncy.",
      "rating": 5.0,
      "verified": true,
      "author": "teacherg",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Love These",
      "text": "I love these tennis shoes. Very breathable for the summer and comfortable for walking. Not to mention the great price compared to other places.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa daidone",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Comfort",
      "text": "I love that this shoe is very comfortable that you can walk all day with them. I wasn't sure of the size that I ordered would fit accurately and I wanted to cancel the order. Now I have no regrets of purchasing this item and would highly recommend it to anyone especially MOMS.",
      "rating": 5.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Nice shoes",
      "text": "The shoes are great. However the right shoe had a defect and there was a higher raise in the sole which is annoying but I’m not wearing them very often so I’ll just put up with it. Other than that they fit good and are cute",
      "rating": 5.0,
      "verified": true,
      "author": "Dena otto",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Classic",
      "text": "Love these sneakers. The price was competitive, and these arrived quickly. They’re well built, comfortable and cute.",
      "rating": 5.0,
      "verified": true,
      "author": "D&M",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Changes not good",
      "text": "The insole is not the memory foam cushion and support of the old style. Not comfy at all. Disappointed that feature changed. They are cute though",
      "rating": 3.0,
      "verified": true,
      "author": "danette j.",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "These are great for a workout",
      "text": "I really like these, but I wish I could find the courty suede in my size!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary J. Alexander",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Narrow shoe for narrow feet",
      "text": "My pubescent female spawn completely adores these. She has a narrower than norm foot and has the hardest time finding cute shoes that fit her feet comfortably. Will purchase more.",
      "rating": 5.0,
      "verified": true,
      "author": "Yaya Ma",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "True to size.",
      "text": "I liked everything about the shoe, tried othe on and was not disappointed at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma Forte",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "I like them",
      "text": "I've worn Keds shoes for like 30+ years now. I like this style a lot. The fit is better than the old fashion \"champion\" style.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Cute shoe but narrow fit",
      "text": "I loved the look of this style. Unfortunately they run narrow. I have a high instep which doesn't help the fit either. They have a gel pad in them which can attribute to the fit. I was not able to remove it. It may help to go up a 1/2 size not sure.",
      "rating": 3.0,
      "verified": true,
      "author": "Chicki B",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great classic Keds",
      "text": "This is my third pair of this shoe. Love the fit, ease of wearing with jeans. Perfect for watching soccer and baseball games. Very comfortable. Can be thrown in the washing machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbmom",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "An alternative to slippers",
      "text": "So I bought these to bum around the house in and they were a bit stiffer than my last pair but fine do the job. Nice to see them available online because I couldn’t find them in stores",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "A great shoe!",
      "text": "I love everything about these shoes: very stylish tennis shoes, comfortable, the color I chose is perfect. I love wearing them with blue jeans because they look so cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Juanita G Vance",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Runs super small",
      "text": "Loved the sneaker, but the run small and narrow. I’ll have to return it.",
      "rating": 4.0,
      "verified": true,
      "author": "Shortmom33",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Love these Keds",
      "text": "I love these Keds, although I thought they would be a little More comfy. Iadded Dr. Sholls I sertsand that helped. The color is a beautiful gray.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna Acevedo",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Very good",
      "text": "This is not my first purchase of this product. Always fit as expected and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "sally",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Great shoes!",
      "text": "This is the second pair that my daughter has had. She loves them! She has a little bit of a wide foot but has no issue with these being too tight. Says they are comfortable to walk around in. She’s ruff on shoes but these hold up good.",
      "rating": 5.0,
      "verified": true,
      "author": "TN’s home",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Can't go wrong with Keds!",
      "text": "Keds are the perfect casual shoe! I wear them with jeans and/or shorts and they are perfect. And I love these that have the extra cushion inside - love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Love!",
      "text": "I love this shoe!! The only ones I can honestly wear. Very Comfortable, especially since I'm standing on my feet all day! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Elena Martinez",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Good quality, fits  abit tight",
      "text": "Good quality shoe but the fit is tight, especially on my wider foot. Hope it will stretch out soon. Fast shipping..",
      "rating": 4.0,
      "verified": true,
      "author": "M. Morder",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Poor design",
      "text": "I like the pair I bought from you before these.",
      "rating": 1.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Perfect fit!",
      "text": "I love my shoes! They fit perfectly, and no issues with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette Garcia",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Love them",
      "text": "Always wanted some! Finally got them for a every day shoes to wear",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Burden",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Casual shoe not an athletic shoe",
      "text": "Comfortable to kick around the house ir run errands in.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Good for long walking",
      "text": "Walked everywhere in LA. Only wish the come in wide",
      "rating": 5.0,
      "verified": true,
      "author": "freshnfab",
      "helpful_votes": 0,
      "publication_date": 20190531
    }
  ],
  "product_meta": {
    "title": "Keds womens Courty",
    "description": "Love the comfort and style of this everyday essential sneaker from Keds®. Twill upper with tonal stitching. Lace-up closure for a secure fit. Jersey lining for all-day wear. Dream Foam™ footbed for added comfort. Rubber outsole. Spot wash, air dry only. Imported. Measurements: Weight: 9 oz Product measurements were taken using size 7, width B - Medium. Please note that measurements may vary by size. Weight of footwear is based on a single item, not a pair.",
    "rating": 4.4,
    "feature_bullets": [
      "Sport Architecture",
      "Dream Foam Memory: This cushiony footbed features a thick layer of upremely soft memory foam, enhanced with supportive and breathable Dream Foam underneath for ultimate comfort.",
      "Outer Material: fabric",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Heel Type: no-heel",
      "Shoe Width: medium"
    ],
    "specifications": {
      "Product Dimensions": "25.4 x 38.1 x 15.24 cm; 272.16 Grams",
      "Date First Available": "8 Jan. 2019",
      "Manufacturer": "Keds",
      "ASIN": "B07MJZT97H",
      "Item model number": "WF60073",
      "Department": "Women's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 88.3
  }
}