{
  "website_summaries": [
    {
      "verdict": "All-around high-quality set of egglettes that are truly dishwasher-safe. A big hit among camping enthusiasts.",
      "pros": [
        "Mess-free way to make on-the-go breakfasts and properly portioned snacks",
        "Set is nontoxic, BPA-free, and nonstick",
        "Most popular for reliable hardboiled-egg cooking",
        "Easy to remove the shell with tool for those with dexterity issues"
      ],
      "cons": [
        "Some had trouble getting the egg out perfectly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy on the go hard boiled eggs",
      "text": "I loved this product because I have been making boiled eggs often and I literally can’t stand taking off the shells. The egglett holders stand upright and the holder for all the eggs fits into a holder so that you can remove them all from the water at the same time. The holder isn’t super large so you don’t need a super huge pot to hold them in but larger than a regular sized pot. You can also put them in without the holder. Great product and totally worth the cost",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Bochbot",
      "helpful_votes": 14,
      "publication_date": 20180724
    },
    {
      "title": "Pam, use Pam!!",
      "text": "These are great but, if you forget the Pam you will be scrubbing for a while. You have to turn inside out and use a scrub pad to get them clean. Don’t forget the Pam!! Other than that they are perfect for on the go bite size omelettes.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Rehberg",
      "helpful_votes": 9,
      "publication_date": 20181230
    },
    {
      "title": "Easy to use",
      "text": "The product is very easy to use and the eggs are cooked just right. I highly recommend it! Now I don't have trouble getting all of the egg shells off the eggs.",
      "rating": 5.0,
      "verified": true,
      "author": "tlf",
      "helpful_votes": 11,
      "publication_date": 20180906
    },
    {
      "title": "The ring makes a big difference",
      "text": "Made my Thanksgiving to avoid struggling to peele eggs for dressing! This is so easy! The ring is what makes these so good—they won’t turn over in the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Boyd",
      "helpful_votes": 8,
      "publication_date": 20181126
    },
    {
      "title": "Sketchy....",
      "text": "I don't think I trust this thing. I bought it because it said bpa free, but there's misspellings on the box, the instructions have some rusty staple holding it together... The cups have some black specks molded into the silicone. I don't think I trust using it.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany D",
      "helpful_votes": 7,
      "publication_date": 20181113
    },
    {
      "title": "Beauty is only skin deep!",
      "text": "Not the prettiest hard boiled egg, but worked perfect the first time. Super easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20180816
    },
    {
      "title": "Easy",
      "text": "I love how easy it is to get perfect eggs every time! No peeling required!",
      "rating": 5.0,
      "verified": true,
      "author": "Celena",
      "helpful_votes": 6,
      "publication_date": 20181022
    },
    {
      "title": "Works Perfectly!",
      "text": "The product works just as advertised. Just follow the simple directions and you will be completely satisfied. No more egg peeling!",
      "rating": 5.0,
      "verified": true,
      "author": "kimo",
      "helpful_votes": 4,
      "publication_date": 20190324
    },
    {
      "title": "Love it",
      "text": "I found if you spray it it works better then brushing it with oil. I really like it no more shells crunch in your egg salad.",
      "rating": 5.0,
      "verified": true,
      "author": "barbara rahn",
      "helpful_votes": 4,
      "publication_date": 20190307
    },
    {
      "title": "It works",
      "text": "This thing actually works! My husband loves boiled eggs for breakfast but they never peel easily. This egg cooker is the answer. I did get a little water in the first ones but I discovered it was because I didn’t tighten the tops. The 4 stars is because I didn’t get an instruction manual but I did find instructions online.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily Hall",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Inadequate instructions, hard to clean",
      "text": "The instructions did not address the odd \"rings\" that were part of the package. Turns out, the silicon cups have to be stuffed into the rings before the tops can be screwed on. Despite greasing the silicon cups per instructions, they did not come clean, nor did turning them inside out and scrubbing work. They're not suitable for a dishwasher – too light. Product was delivered one day, and put in the rubbish bin the next.",
      "rating": 1.0,
      "verified": true,
      "author": "Busy Guy in Peachtree City",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Well worth the cost",
      "text": "These curtains are elegant and beautiful! Very well made. Priced incredibly low for the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181211
    },
    {
      "title": "Great product!",
      "text": "I have been a set of these for a long time. Glad I finally got them. I couldn't be happier with them, and the service was great!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Martino",
      "helpful_votes": 4,
      "publication_date": 20190305
    },
    {
      "title": "So easy",
      "text": "If you are on a low carb diet or cook alot of eggs, this will help alot. The instructions are easy to follow. It saves me alot of time in the morning because you dont have to worry about any egg shells. Also good if you like an omelette. You just add the meat and veggies, put it on the stove, and by the time you finish getting ready, your breakfast is ready.",
      "rating": 5.0,
      "verified": true,
      "author": "desheeena holloway",
      "helpful_votes": 2,
      "publication_date": 20181126
    },
    {
      "title": "Looks good",
      "text": "Have not used this item as yet. It was purchased as a Christmas gift. I'm sure it will be enjoyed; but no review yet...",
      "rating": 4.0,
      "verified": true,
      "author": "Sam H",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Not what was expected",
      "text": "This cooker does cook the eggs and they are ok but there seems to be a very thin line between done right and not done. I guess I was just a little optimistic about what to expect. The shape of the eggs does require some time to accept.",
      "rating": 4.0,
      "verified": true,
      "author": "Fulltime traveler",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Does what it says",
      "text": "A bit hard to use and clean but my husband says it’s totally worth not dealing with hard-to-peel eggs at lunchtime.",
      "rating": 5.0,
      "verified": true,
      "author": "angelstar",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Far too big for my pans",
      "text": "The ring structure that holds the egg pods was far too big for my pans, so I could not use it. I returned it & lost $5.00. I know a lot of families may have larger pans, but watch out just in case.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarahbigsmiles",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "that it worked",
      "text": "product to flimsy-no directions on how to use-wasted 12 water-soggy eggs before I figure out how to use it and still left me with waterery eggs-covers are too flimsy to be screwed on tight and water gets in.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob S",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "No more messed up eggs",
      "text": "I used it for the first time and it was pretty easy to do. The eggs turned out perfectly and the cleanup was no problem. I got tired of half my hard boiled eggs ending up I’m the garbage. No more.n 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Grummann",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Almost impossible to get out clean smooth hard boiled egg.",
      "text": "Very disappointed. I gave it a way. I followed the instructions to the letter and they came out looking like someone had been nibbling on them.",
      "rating": 1.0,
      "verified": true,
      "author": "kim",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "No good",
      "text": "Eggs didn’t have the shape of a boiled egg, I sprayed oil in each egg container and still was difficult to get out",
      "rating": 1.0,
      "verified": true,
      "author": "Gerry",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Not for me",
      "text": "The eggs actually stuck they were more work to get out then the other cooker I bought so I give them a one",
      "rating": 1.0,
      "verified": true,
      "author": "Sue E.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Ease of use",
      "text": "As advertised. very simple to use. eggs come out perfect every time. No more digging out soft boiled eggs from the shell.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Love it!",
      "text": "I love this thing. Its so easy and no more peeling egg shells!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Run. Better off making scrambled eggs....honestly",
      "text": "I have yet to make proper hard boiled eggs with this device. Waste of money, time and eggs.",
      "rating": 1.0,
      "verified": true,
      "author": "Cisco",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Not happy eggs",
      "text": "This item did not meet to expectations, Top kept falling off and the egg would spill over into the water. Was not happy with this item at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Love it",
      "text": "It is easy to use and no more peeling eggs",
      "rating": 5.0,
      "verified": true,
      "author": "bettie wiseman",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "They work easy enough for kids to use them!",
      "text": "My niece came to stay with me this summer and has been very interested in learning her way around the kitchen. She saw these on TV and wanted to try them so much!! When we ordered them, my expectations weren't very high. After we tried them, I am a firm believer in these being the only way to boil our eggs! I can't wait to try adding in my own cheeses and veggies for a quick and convenient breakfast!",
      "rating": 5.0,
      "verified": true,
      "author": "Galavanting Gabaldons",
      "helpful_votes": 7,
      "publication_date": 20180626
    },
    {
      "title": "Perfect boiled eggs!",
      "text": "My 2 year old LOVES boiled eggs, but I am terrible at peeling them. These are perfect for us! I love that they make 6 at a time and they slide out of the silicone molds effortlessly. The cooking time on the directions was spot on.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Miller",
      "helpful_votes": 9,
      "publication_date": 20180730
    },
    {
      "title": "Love it!",
      "text": "Product arrived quickly, in excellent condition. Works as advertised, Eggs come out sooo tasty. Just spray some PAM or brush some oil in the silicone cups, add your eggs, and voila! Eggs to perfection. Read the enclosed instructions for more detail. Would recommend, and purchase again as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Galadrial",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Love This Product",
      "text": "It is very easy to use. I love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Maltie Singh",
      "helpful_votes": 2,
      "publication_date": 20181112
    },
    {
      "title": "Perfect for hard to peel eggs",
      "text": "They work perfect for the fresh eggs we get from our chickens. The fresher the egg the harder it is to remove the shell. These are the perfect answer.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie kyelberg",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "EasyEggie Egglette",
      "text": "These work great! I found them to be easy to use and easier than trying to peel the shells off of the eggs when boiled.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveE",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Quality product, quick ship and wouid buy again",
      "text": "Love these. We mix together different things to make it more like scrambled eggs and use some for straight hard boiled for salads or quick snack! Easy clean up:)",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllis L. Messerla",
      "helpful_votes": 5,
      "publication_date": 20180809
    }
  ],
  "product_meta": {
    "title": "Egg Cooker Silicone Cups - Soft/Hard Boiled Eggs Without Shell - 9in1 Set PREMIUM QUALITY NonStick | 6Cups, Holder, Free Brush&Spoon, Instruction | The Original Set by EasyEggie!",
    "rating": 3.4,
    "feature_bullets": [
      "✅ TIRED OF PEELING EGGS?: EasyEggie HIGH QUALITY Egg Cooker As Seen On Tv is perfect for you and it's easy to use. Stop peeling and start cooking hard boiled eggs without shells with our silicone egg maker. Choose Quality Trust made to Last. Save time when you're in a hurry!",
      "✅ QUICK FUN MEALS: EasyEggie non stick silicone egg poacher allow you to create perfect hard/soft boiled or scramble eggs easily, without having to mess with the shell peeling process. Create new recipes by adding veggies, bacon amd cheese. Same taste, same look, no peeling!",
      "✅ SMART HOLDER SAVES YOUR EGGS: Without the holder, it’s easy for egg boiling pods to tip and fill with water, completely ruining your eggs. EasyEggie holder keeps your eggs upright and together. No more wasted eggs with EasyEggie egg poacher!",
      "✅ EASY TO USE AND EASY TO CLEAN: Just spread a generous amount of oil and crack your eggs, then pour them into our silicone cups. Once the lids are on, just place in a pot and boil with the holder. Non stick silicone design allows them to slide out easily with the help of a spoon. Dishwasher safe! Instruction included!",
      "✅ NON TOXIC, BPA FREE SILICONE, NO RISK PURCHASE: Our super easy egg cooker is more than just easy, it’s safe too. EasyEggie use the best materials so you don’t have to worry about possible contamination. If you don’t absolutely Love it, just send us a message and we will Refund or Replace your Purchase, NO QUESTIONS ASKED! Please contact the Seller EasyO in the unlikely case of receiving a product that does not comply with the Product pictures. Click “Add to Cart” Now!"
    ],
    "categories": [
      "Home & Kitchen"
    ],
    "price": "",
    "specifications": {}
  }
}