{
  "website_summaries": [
    {
      "verdict": "The OnePlus 6 is an excellent phone and gives you many of the features of more costly flagship phones.",
      "pros": [
        "The OnePlus 6 is blazing fast, shoots amazing portrait mode photos, has a polished refined design and costs much less than other flagship phones"
      ],
      "cons": [
        "It lacks waterproofing, wireless charging and has a shorter battery life than the OnePlus 5T",
        "In the US, the phone doesn't work on CDMA carriers like Verizon and Sprint"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 9.0,
        "Camera": 8.0,
        "Battery": 8.0
      },
      "publication_date": 20180530,
      "rating": 8.5,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "FALSE ADVERTISING, SCAM...THIS IS *NOT* an A6003, it's an A6000 (rated the seller a 1 star for this)",
      "text": "Scam scam scam scam scam hoping buyers don't check the system settings to see what model they actually bought. Description sounds good, box matches description (A6003 with US warranty), but open it up and turn the phone on then go in to Settings and check what the actual model is....A6000. NO BAND 71 SUPPORT FOR TMOBILE USERS. SCAAAAAAM SCAAAAAM SCAAAAAM! Not the first time either, Amazon needs to do something about this ongoing garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Subsonic",
      "helpful_votes": 39,
      "publication_date": 20190405
    },
    {
      "title": "It is a A6000 version not A6003 as advertised",
      "text": "The phone works fine, but it is an A6000 version not A6300 version, so be aware TMobile subscribers",
      "rating": 3.0,
      "verified": true,
      "author": "Dzung N.",
      "helpful_votes": 40,
      "publication_date": 20181005
    },
    {
      "title": "Buyer Beware: not the model advertised: no warranty, doesn't work on all US LTE bands",
      "text": "False advertising. I received the international version (model A6000, which is made for the Indian and Chinese markets), not model A6003 which has a US warranty and includes LTE band 71. Summary, they're pulling a fast one on you by sneaking a cheaper phone into the box and description of a more expensive one. If you don't mind, then you might as well buy from a seller who is selling the international version for 25% cheaper. Since that's what's inside the box anyway.",
      "rating": 1.0,
      "verified": true,
      "author": "A J",
      "helpful_votes": 20,
      "publication_date": 20190418
    },
    {
      "title": "Worked in Japan",
      "text": "OnePlus6 worked fine in Japan. It's a good phone, nothing wrong to say about it Deliver with no headphones",
      "rating": 4.0,
      "verified": true,
      "author": "Teddy",
      "helpful_votes": 3,
      "publication_date": 20180929
    },
    {
      "title": "Best to buy",
      "text": "Amazing cellphone worth buying battery life is awesome and camera no complaints",
      "rating": 5.0,
      "verified": true,
      "author": "Saurabh shende",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Very surprised by the quality",
      "text": "Pre owned phone without any blemishes. Performs beautifully. Just like new. Amazing!!!",
      "rating": 5.0,
      "verified": true,
      "author": "TripOG",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "It's the best phone",
      "text": "Seller is very nice n kind...it's just the price is too high",
      "rating": 5.0,
      "verified": true,
      "author": "Richa",
      "helpful_votes": 2,
      "publication_date": 20181101
    },
    {
      "title": "Face Recognition is crazy fast!!",
      "text": "Perfect phone. So sleek and fast!! Snapdragon 845 and latest Android Pie. OnePlus has a customer for life.",
      "rating": 5.0,
      "verified": true,
      "author": "KingLev5150",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Bang for your buck !",
      "text": "Everything about this phone is great although i got the 128GB version.",
      "rating": 5.0,
      "verified": true,
      "author": "Arun Nambiar",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Better than Apple",
      "text": "Fast, smooth, I get about 13-15 hours on one charge and only takes about 1/2 hour to charge from 0-100",
      "rating": 5.0,
      "verified": true,
      "author": "nathan",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Highly priced for no reason",
      "text": "You can surely not find a better phone than this for the actual price which is at the One Plus 6 official website",
      "rating": 1.0,
      "verified": true,
      "author": "Jayesh",
      "helpful_votes": 17,
      "publication_date": 20181005
    },
    {
      "title": "Great phone, amazing camera",
      "text": "Can't beat it for the price. I'm really loving the 6 so far",
      "rating": 5.0,
      "verified": true,
      "author": "M. VDW",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Got my One Plus 6",
      "text": "I was debating for a while what type of phone to get, I used to carry a BlackBerry Priv, before that I had Galaxy phone, and before this one, I was using the One Plus 2. So the choice was I better get a real upgrade. Very happy so far...",
      "rating": 5.0,
      "verified": true,
      "author": "J. Juan Calderón",
      "helpful_votes": 3,
      "publication_date": 20181010
    },
    {
      "title": "This phone is perfect",
      "text": "I freaking love this phone the software is simplistic and just intuitive and the hardware is top notch. If you are looking for something to break away from the Apple ecosystem and you hate Samsung's bloatware look no further than OnePlus.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward",
      "helpful_votes": 5,
      "publication_date": 20181211
    },
    {
      "title": "It's what was promised.",
      "text": "A little expensive compared to the OnePlus website but they don't produce this model anymore so I didn't really have a choice. However, it is exactly as promised, no flaws, a brand new phone and has worked very well for me so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Mburkey",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Good product",
      "text": "I bought the phone as a gift and recipient was very happy. Be sure to purchase USA version if you live in the States!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Alice Wistman",
      "helpful_votes": 2,
      "publication_date": 20190130
    },
    {
      "title": "Bang for your buck",
      "text": "After searching through reviews, I stumbled across this gem. It's fast, powerful, and fair priced.",
      "rating": 5.0,
      "verified": true,
      "author": "JebusTSS",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Excellent phone, but A6000 and not A6003",
      "text": "Love the phone. Hate that it is falsely advertised as A6003 when it is an A6000",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "its sop fast",
      "text": "i never iexpect in this phone was so cool and Fabulous Thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Fahad Abdullah Salem",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Bad camera, terrible reliability and customer service",
      "text": "I loved this phone for the first 7 months I've had it. With the exception of the camera, especially it's low light capability and the fact that the app is outdated and clunky. Now for the last week the phone has been getting more and more quirky about charging, and is now almost not chargeable. I contacted customer support and they want me to send it in for an out of warranty repair instead of doing a warranty exchange on it! The phone is only 8 months old!",
      "rating": 2.0,
      "verified": false,
      "author": "Dilan",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "For folks saying there are better, cheaper phones, they're wrong. This is unlocked (no contact).",
      "text": "Excellent phone currently running Android Pie and smooth no bloatware Oxygen OS. Better cost directly from OP own site. Excellent customer support. Love it... My 5th one plus phone",
      "rating": 5.0,
      "verified": false,
      "author": "AndsterManNYCTop Contributor: Pets",
      "helpful_votes": 6,
      "publication_date": 20181010
    },
    {
      "title": "Greatest phones ever",
      "text": "OK I've had a one plus 3 for going on 3 years now and its hands down the best phone I've ever had. It still competes with all these new phones, all you people bitching about the one plus 6 have obviously never known the pleasure of holding one of these beauts.",
      "rating": 5.0,
      "verified": false,
      "author": "Yarmoisblazin",
      "helpful_votes": 5,
      "publication_date": 20180918
    },
    {
      "title": "Great phone, ridiculous price.",
      "text": "This really is a great phone. But you can buy it directly from Oneplus for $579.",
      "rating": 5.0,
      "verified": false,
      "author": "J Cope",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Garbage",
      "text": "Phone sucks. Usb 2.0 only! Have fun filling up that 256gb at usb 2.0 speeds. Software is terrible, can't get it to connect to computer to transfer files. Transferring over from iphone is a no-go. If you have an Iphone, stay away from this headache.",
      "rating": 1.0,
      "verified": false,
      "author": "Cris",
      "helpful_votes": 11,
      "publication_date": 20180804
    },
    {
      "title": "To expensive",
      "text": "For that price you could get a better phone like the Galaxy S9 plus or the Samsung Galaxy Note 8, or even an Iphone. There are even other cheaper brands and mid range phones that are a better buy.",
      "rating": 1.0,
      "verified": false,
      "author": "Jose Sabat",
      "helpful_votes": 14,
      "publication_date": 20180718
    }
  ],
  "product_meta": {
    "title": "OnePlus 6 A6003 128GB Storage + 8GB Memory Factory Unlocked 6.28 inch AMOLED Display Android 8.1 - Midnight Black US Version",
    "description": "Color:Midnight Black| Size:8GB//128GBDual Camera with image stabilization shoot clearer photos and optimized for low-light and portrait photography. Our highly rated 16 + 20 MP cameras both with f/1.7 aperture help you capture crystal-clear shots. Design Expand your perspective Leap into a truly immersive flagship experience. Our Full Optic 6.28 inch AMOLED 19:9 display complements the masterfully crafted body for a sleek, yet resilient design. OxygenOS Software based on Android 8.1 is so smooth, you’ll notice the difference The best of Android refined. OxygenOS is streamlined with feedback from our users for a refreshing user experience. Performance Packed with incredible power and speed Your experience with Qualcomm Snapdragon 845 optimized, thanks to a seamless combination of hardware and software. Dash Charge Probably the best charging solution on the planet A day’s power in half an hour. Dash Charge, our signature powering solution, is the end of overnight charging. Network Move with freedom Ready to take on the world. Travel hassle-free with our unlocked Dual SIM flagship.",
    "rating": 4.6,
    "feature_bullets": [
      "OnePlus 6 US Version, Operating System: OxygenOS based on Android 8.1 Oreo, CPU: Qualcomm Snapdragon 845 (Octa-core, 10nm, up to 2.8GHz), 8G Memory + 128G Storage, Sensors: Fingerprint, Hall, Accelerometer, G-sensor, Electronic Compass, Gyroscope, Proximity, Ambient Light Sensor, RGB, Sensor Hub. Dual SIM - works with all GSM carriers in US including AT&T, Cricket, Straight Talk, NET10, T-Mobile, and MetroPCS and more. \"NOT COMPATIBLE WITH VERIZON AND SPRINT\".",
      "Display Size: 6.28 inches AMOLED Display | Resolution: 1080 x 2280 pixels, Aspect Ratio: 19:9 | Type: AMOLED | Supports sRGB, DCI-P3 | Cover Glass: 2.5D Corning Gorilla Glass 5",
      "Dual Rear Camera: 16MP (f/1.7) + 20MP (f/1.7) Dual LED Flash, Video: 4K resolution at 30/60 fps | 1080p resolution at 30/60 fps | 720p resolution at 30 fps | Super Slow Motion: 1080p videos at 240 fps | 720p video at 480 fps, Time-Lapse, Video Editor. Front camera: 16MP, Video: 1080p resolution at 30 fps | 720p resolution at 30 fps, Time-Lapse.",
      "FDD LTE: Band 1/2/3/4/5/7/8/12/17/18/19/20/25/26/28/29/30/66/71, TDD-LTE: Band 34/38/39/40/41, TD-SCDMA: Band 34/39, UMTS(WCDMA): Band 1/2/4/5/8/9/19, CDMA: BC0/BC1, GSM: 850/900/1800/1900 MHz",
      "In the box: 1x OnePlus 6 | 1x Screen Protector (pre-applied) | 1x Translucent Case | 1x OnePlus Fast Charge Type-C Cable | 1x OnePlus Fast Charge Power Adapter (US Charger), a days's power in half an hour | 1x SIM Tray Ejector | 1x Quick Start Guide | 1x Safety Information"
    ],
    "specifications": {
      "Package Dimensions": "7.05 x 3.86 x 2.28 inches",
      "Item Weight": "1.16 pounds",
      "ASIN": "B07DDJQH9T",
      "Item model number": "A6003",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.6 out of 5 stars1,255 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#291,261 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android 8.1",
      "Other display features": "Wireless",
      "Form Factor": "Smartphone",
      "Colour": "Midnight Black",
      "Manufacturer": "OnePlus",
      "Date First Available": "May 22, 2018"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": 309.0
  }
}