{
  "website_summaries": [
    {
      "verdict": "This reasonably-priced punch set works well on leather, but can also be used for metal work.",
      "pros": [
        "Comes in a nice storage box",
        "Can create a deep hole",
        "7 sizes of holes",
        "Works good for belt leather, but can also punch through sheet metal and brass"
      ],
      "cons": [
        "While the storage case is labeled, there are no sizes marked on the bits"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent Fabrication Tool",
      "text": "Awesome product at a great price! I do a lot of aluminum panel fabrication and holding a drill for hours becomes cumbersome. This is a tool I’ve been needing for years and I’m glad I finally pulled the trigger on this one. The adjustable depth gauge makes it really easy to do a ton of holes around the edge of a panel quickly and accurately. I like that this tool came in a hard case with a spot for each of the dies. I would reccomend this punch to anybody who is looking to save time in their fabrication process.",
      "rating": 5.0,
      "verified": true,
      "author": "Kapono Fuller",
      "helpful_votes": 4,
      "publication_date": 20181109
    },
    {
      "title": "Extremely pleased!!",
      "text": "I was a little worried about how inexpensive this tool was. I was worried that it wouldn’t punch through 16 GA steal sheet. But it worked like a charm! (Had to apply some decent force in order to puncher it, but I’d imagine that any adult could achieve this) The only reason I didn’t give it 5 stars was because the offset bracket wasn’t as easy to precisely set as I Had imagined. Not that I necessarily required such a high tolerance, but I would definitely recommend using a measuring tape when setting its position. Nevertheless, I was Extremely happy with this purchase...especially for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Devin Bowersox",
      "helpful_votes": 2,
      "publication_date": 20190508
    },
    {
      "title": "A nice punch well worth the money",
      "text": "If you want to punch holes in soft copper, brass, aluminum, or some other type of sheet metal that of a reasonably thin gauge this thing is the ticket. It will punch nice clean holes of several different sizes through reasonably sized thicknesses of metals which are not hardened. Don’t try to punch through hard steel or something like that. This is a tool that should last a lifetime unless you’re using it in a commercial setting in which case you eventually might wear out the dies after years of use.",
      "rating": 5.0,
      "verified": true,
      "author": "WB5MGR",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Good for thin sheets doesn't really like 16 guage.",
      "text": "Overall a good buy for the money, just not really heavy duty. The handles could be a few inches longer, and the dies tend to round the material close th the holes. If you're using this to punch sheet metal thinner than 16 gauge, it'll probably do fine. It worked good for 2 days of punching 16 gauge. I decided to double up to line up the sheets, and then added some steel pipe to the handles for leverage. That's probably where I messed up, it broke.",
      "rating": 3.0,
      "verified": true,
      "author": "Stefan Costea",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Nope",
      "text": "Tried to use it one time and the think broke it bent and didn’t even punch a hole please see photos",
      "rating": 1.0,
      "verified": true,
      "author": "unicorn",
      "helpful_votes": 3,
      "publication_date": 20190222
    },
    {
      "title": "Pass on this one",
      "text": "Not impressed. Product description indicates it is suitable for leather and belts. Poor tolerance fit with the punch and die, probably why it cuts ragged, incomplete holes and you have to tear the pieces off.",
      "rating": 1.0,
      "verified": true,
      "author": "Roy Smith",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "You want a hole where?",
      "text": "Absolutely excellent tool for punching holes in 18 and 20 gauge copper sheet for jewelry making. Easy to change size and flexible placement of the holes. Does not distort the metal when punching the hole. Great investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly U",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Deffective tool. T notch does not match with punch center.",
      "text": "Mine has a disastrous fabrication problem. The pivot arm \"T\" notch is misaligned with respect to the punch center aprox by 1/8\", so the punch cannot slide in the notch (see photo). So bad luck I got a deffective product. I'l write to claim.",
      "rating": 1.0,
      "verified": true,
      "author": "David CR",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "It hasn’t failed yet but I have doubts",
      "text": "It feel like it’s not gonna last a long time. The 1/8” punch feels like it will crack. The actual mechanical lever handle feels strong. It will strengthen your grip be ready. I bought a dozen drillbits in case it fails.",
      "rating": 3.0,
      "verified": true,
      "author": "Hermanator",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Great price.",
      "text": "I used to have a similar puncher and when I need to replace it I found this one. I was skeptical at first because of the price, but I'm very happy I got it. It's is well made and the case keeps all the part organized.",
      "rating": 5.0,
      "verified": true,
      "author": "chicagoguy",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "It's a punch!",
      "text": "Quick service via Prime and a reasonable price for this punch set. Nearly identical versions of this set are available on Amazon in various packages. The kit arrived in good shape and all of the punches and dies thread into the handle just fine. Punched a few holes in light gauge sheet metal without difficulty.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "kenifix1",
      "text": "the punch tool works well, but a suggestion,, a way to keep the bottom die to stay in place and not be able to turn on threads by itself.",
      "rating": 5.0,
      "verified": true,
      "author": "warm feet",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Best ever outstanding",
      "text": "Incredible I can’t squeeze with one hand I have little hands. But I went right through a mixed metal like cold butter. So much better than drilling what a great product. Yippee!",
      "rating": 5.0,
      "verified": true,
      "author": "P",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "It’ll do.",
      "text": "Fairly easy to use. Not the sturdiest construction, but it gets the job done. If they put out a newer model with larger size options, I’d give it a go.",
      "rating": 3.0,
      "verified": true,
      "author": "bruinsfan",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Heavy Duty is accurate.",
      "text": "I do some light metal/leather crafting, jewelry making and thought this would be handy. When it says heavy duty, it really means it. I sent this out to the garage for the boys instead of in my craft room. Hey, at least they were excited!",
      "rating": 4.0,
      "verified": true,
      "author": "bishop0312",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Very well manufactured.",
      "text": "Use this to punch holes in thin metal. Good sturdy tight tolerances, so the tool is not sloppy. The punch goes into the receiver with hole in it, with close clearance. This is needed so metal does not flow into the hole as the punch handles are forced together. This will cause binding. Punch rod that makes the hole will wear. This tool is coated with something that is very chrome shinny. This will not rust.",
      "rating": 5.0,
      "verified": true,
      "author": "NATHAN",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "This works",
      "text": "This tool does what it is designed to do. The only downside is that you need to have some hand and arm strength.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian  Fraser",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Worth it!",
      "text": "Used for punching holes in thick leather sandal straps. The products used in the past broke before completing the task. This product is heavy duty and is ready for more use",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffdawn64",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "poorly machined",
      "text": "while this is a sold heavy plier the punch and the die dosent line up. I had to turn the punch every time to check it would go through. I can see the die edge is going to chip. I wont be using this tool",
      "rating": 2.0,
      "verified": true,
      "author": "Donnz49",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "work great",
      "text": "Lost my original set (from 1961) and now I am able to do what I need with these..",
      "rating": 5.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Big burr",
      "text": "Punch left an 1/8 inch to 1/4 burr , crappy when dropping in ceiling panels. Difficult when going through tee and angle with burring",
      "rating": 2.0,
      "verified": true,
      "author": "PARES",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Hole Punch Set",
      "text": "How to put it together to get it to work would be very helpful. I'm unable to use it now.",
      "rating": 1.0,
      "verified": true,
      "author": "annetm",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "when light duty doesn't work",
      "text": "works well on leather or sheet metal faster than drill",
      "rating": 4.0,
      "verified": true,
      "author": "John A. Altemus",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Exactly what I needed for the job.",
      "text": "Purchased this tool for securing metal roofing trim. Worked awesome, easy to use and will definitely use on other projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Staffeldt",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Forget drilling and deburring again! This tool is what you need!",
      "text": "We have increased production times from hours to only minutes by using this hand punch tool. Very recommended. if you are tired of drilling and deburring holes then this tool is exactly what you need. Excellent product and excellent service provided by the Seller.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Did the Job !!",
      "text": "Excellent tool that punched holes in the sheet metal with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "AzBob",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Not machined properly",
      "text": "The smallest punch that I needed (2mm) was not machined down properly to fit into the tool. I was not able to use the tool for the purpose I bought it for.",
      "rating": 1.0,
      "verified": true,
      "author": "Robin Hall",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Works as intended",
      "text": "I use this to punch holes on .080 Kydex sheets. Works great. I also made a hole on a leather belt. Works as intended, no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Emperor's Direct",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "The punch and dies can be a bit tricky to align.",
      "text": "Great for light gauge sheet metals, the dies and punches are fairly well made, but the alignment engineering make it a bit difficult in tight locations.",
      "rating": 4.0,
      "verified": true,
      "author": "Slushmugg",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Great buy",
      "text": "Super sturdy set— used to pinch small holes in pennies for an art project— many different gauges for any project—",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Great Tool",
      "text": "I brought this to put some homes in a couple of belts but also used it to punch a couple of home in some metal.",
      "rating": 5.0,
      "verified": true,
      "author": "Starblazer60",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "eliminate steps in process",
      "text": "I make copper jewelry using the cold connection process. This device helps me complete projects quicker than drilling holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great quality tool",
      "text": "Great hole punch set, a must have for any collision tech/ auto body repair tech!",
      "rating": 5.0,
      "verified": true,
      "author": "Southern Bread",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Know the limitations of product.",
      "text": "I will use it occasionally for projects around the home. It was reasonably priced and arrived on time as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "geeting",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "It’s very sturdy",
      "text": "This punch works great I even use it on stainless steel for different size holes...",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Scott Hoge",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Very happy whit it",
      "text": "Works perfect, I had a few pneumatic punch machines, I’ll prefer this one",
      "rating": 5.0,
      "verified": true,
      "author": "Nylsson&viri",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Good tool",
      "text": "Great purchase. Accomplished the task purchased for with ease. Could use instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "Anita K. Pena",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "when I need a hole  certain size this tool will do the job, I LOVE IT!",
      "text": "I use this to make holes for my jewelry. Thank you and the price is right.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Heavy Duty Hole Punch",
      "text": "Haven’t used for project yet, but I tested it and it performed as expected. Received very quickly. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Arnold-Anderson",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Tools",
      "text": "Great product I've probably punched close to 400,000 holes with no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Piece of junk",
      "text": "This punch broke literally the first time I tried to use it. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam Holt",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Not satisfied!",
      "text": "Very difficult to punch a 3/16 hole in 20 gauge metal studs.",
      "rating": 1.0,
      "verified": true,
      "author": "DP",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Incredible value",
      "text": "I purchased this machine with limited expectations but was pleasantly surprised when it arrived (the next day). It is solidly built and operates smoothly. I would have given it a fifth star in the ease of use category but is arrived without instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Just what I needed.",
      "text": "Happy with purchase it was exactly what I wanted, came quickly, & easy instructions enclosed.",
      "rating": 5.0,
      "verified": true,
      "author": "Debi ",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "A good product.",
      "text": "The punch exceeded my expectations. It punched holes in thin tin material like cutting butter with a hot knife. I would recommend this product to any one.",
      "rating": 5.0,
      "verified": true,
      "author": "glen Barton",
      "helpful_votes": 0,
      "publication_date": 20190217
    }
  ],
  "product_meta": {
    "title": "ABN Power Punch Heavy Duty Hole Punch Set – Metal Hole Punch, Heavy Duty Hole Puncher Hand Punch 3/32in to 9/32in",
    "rating": 4.4,
    "feature_bullets": [
      "PUNCH HOLES IN YOUR PROJECT: The ABN Hole Punch Tool is a heavy duty punch and dies kit that has a high-leverage design and comfortable grips that allow you to manually create clean holes through sheet metals up to US 16 gauge; For mild sheet steel, aluminum, brass, polyurethane, plastic, canvas, cardboard, paper, shoe; Additionally use as a leather punch, belt hole puncher, metal hole punch for jewelry, and watch hole puncher; Not recommended for stainless steel such as silverware and utensils",
      "PERFECT SIZE: Creates holes that are from 3/32-inch to 9/32-inch in diameter and includes a stop gauge for consistent spacing; 7 sizes of punches and dies include 3/32-inch (2mm), 1/8-inch (3mm), 5/32-inch (4mm), 3/16-inch (4.5mm), 7/32-inch (5.5mm), 1/4-inch (6mm), 9/32-inch (7mm); 1.75-inch (4.4cm) throat depth to punch holes as close as 1.75 inches away from material edge",
      "EASY TO USE: This sheet metal punch uses interchangeable heads to pierce holes in a material of your choosing; Select a proper size punch and die, remove nut near handle using die adjustment tool, move connection bar, place punch on the head of hand punch, rotate nut by again using the adjustment tool to adjust caliper, and set distance between the edge and the hole; Apply lubricant (not included) after use to reduce friction, ensure a clean cut, and prolong tool life",
      "SIMPLE STORAGE: Heavy-duty 8.75” x 4.6” x 2” inch (22.2cm x 11.7cm x 5.1cm) plastic blow-molded carrying case for easy transportation, safe storage, and quick organization",
      "PACKAGE CONTENTS: Package includes (1) metal punch tool, (7) punches, (7) dies, (1) attached throat depth gauge, (1) die adjustment tool, and (1) storage case for your convenience"
    ],
    "specifications": {
      "Manufacturer": "ABN",
      "Part Number": "8642",
      "Item Weight": "1.5 pounds",
      "Product Dimensions": "9 x 4.75 x 2.2 inches",
      "Material": "Mixed materials",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "This product has a manufacturer warranty against defects in materials and workmanship for a period of ONE",
      "ASIN": "B07D7HJQ5Z",
      "Customer Reviews": "4.4 out of 5 stars130 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#29,524 in Tools & Home Improvement",
      "Date First Available": "May 22, 2018"
    },
    "categories": [
      "Hole Punches",
      "Hand Tools",
      "Tools & Home Improvement",
      "Punches",
      "Power & Hand Tools"
    ],
    "price": 28.49
  }
}