{
  "website_summaries": [
    {
      "verdict": "High-end convenience and efficiency at a mid-range price.",
      "pros": [
        "Fairly easy to use",
        "Includes food scale which makes this a great choice for meal prepping",
        "Includes starter set of bags, but takes all universal types"
      ],
      "cons": [
        "Drip tray is not removable for cleaning",
        "Auxiliary suction device is available but not included"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great value for the money",
      "text": "I am very happy with this unit. It's just right for our household use. Hamburger meat, steaks,chicken, and pork chops are sealed perfectly. (Please be sure to read/follow the directions). The scale on top is a perk. Have used the scale more than I thought. The scale is easy to use and read.",
      "rating": 5.0,
      "verified": true,
      "author": "Okie wife",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Hard to lock and defective...",
      "text": "This item sealed bags for me perfectly and loved that it has a scale. However, it didnt vacuum with the seal. Maybe this one is a fluke. I also didn't like that I couldn't just push the lock buttons in. I had to lean into it and put body weight into it to get them to lock in place which is difficult with arthritis. I'm replacing for one with WAY MORE positive reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "S Hedgcoth",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Great Value At A Great Price",
      "text": "This is my first food vacuum and I absolutely love it. It is so simple to use and really sucks all of the air out. I've used it on sliced fruit, crumbled cheese, bricks of cheese, various meats (cooked and raw), and it vacuum seals them all with ease. I hate to waste food so being able to prolong the quality and expiration date is amazing. I haven't used the scale since I don't really have a use for it I bought this model because of the price and brand. I read reviews on other, cheaper food vacuums that said spending a little extra on a Nesco was a better investment and so far I'd have to agree. 👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa Vernon",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Great",
      "text": "First vacuum sealer I’ve ever owned. I got it on a sale and it had great reviews. This is the best investment I’ve made. I will eventually upgrade though not in a hurry as this works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "A little wonder.",
      "text": "This is easy to use and seals well. Great sealer for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Saves Money and Waste",
      "text": "My food stays fresh longer and it's so easy to use. I can now buy bulk packages of almost anything and repackage efficiently into smaller, more convenient portions. It's a great money saver.",
      "rating": 5.0,
      "verified": true,
      "author": "DLA",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Good value",
      "text": "I haven’t used this product yet but seems to be good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Buy it.",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Worth the money",
      "text": "Absolutely thrilled with this purchase. Wish we would have bought it sooner! Used it to pack 40lbs of chicken breast in about 30 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Love it.",
      "text": "Love this food saver. Worth it. I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Disappointed",
      "text": "Nothing worked on it, seal didn’t even heat up, no suction at all. Only thing that worked was the scale...",
      "rating": 2.0,
      "verified": true,
      "author": "Chris withrow",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Excellent for family’s need and reduces waste.",
      "text": "The Nesco does exactly what it is suppose to do. Fits our family’s needs and reduces waste. Plus, the weight scale is very helpful. A good price!",
      "rating": 5.0,
      "verified": true,
      "author": "Hawkeye",
      "helpful_votes": 3,
      "publication_date": 20190812
    },
    {
      "title": "I am in LOVE with this machine",
      "text": "I am OBSESSED with this vacuum sealer, I use it for food and for my business too. It works great. I use it for everything that goes in my freezer to prevent freezer burn. But also use it to vacuum seal packages of personal care items that I sell. That way there are no leaks. So easy to use, and I got it n sale. Excellent value. I recommend this to resellers and anyone that shops bulk and freezes meat or veggies.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "No more freezer burn with vacuum sealed foods.",
      "text": "Love this machine for vacuum packing foods. Doesn't take up a lot of space. Gives a good seal. However, the bags that came with it are not the best. I recommend the Food VacBags by Vesta sold on Amazon. They held a seal better than the ones that came with this machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great wedding gift",
      "text": "This is a great gift for a wedding. Once of those kinds of gifts that when the bride begin to use her kitchen she will remember you each time she uses it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Gomez",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Portion control Made Simple",
      "text": "between everyone's special diets and a productive garden, a sealer is essential. this one by Nesco fits the bill. I love the scale on topo though am perplexed as to why it requires 2 AA batteries. Not a big deal; just seems that it should be able to run on the same source as the machine. the batteries are included so sit is really a non-issue. In any event, operation is straightforward. You can use any brand bag that fits. It is fast and efficient. Very pleased with this Nexco sealer.",
      "rating": 5.0,
      "verified": false,
      "author": "Antigone Walsh",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great to have",
      "text": "I have never owned one of these, but it's come in quite handy. I have been using it regularly for packing extra meat in the freezer, shelled nuts, and candied nuts. I love the fact that it has a scale on top too. It is simple to use and seals quickly. The one star ding is for the terrible quality bags that it comes with. I had to go and purchase a different brand because 4 different bags that I sealed (and double sealed two), had air back in them within 20 minutes. The new brand bags didn't have these issues. I would highly recommend and purchase again. I'm just sorry I waited so long to have one!",
      "rating": 4.0,
      "verified": false,
      "author": "AZmom",
      "helpful_votes": 0,
      "publication_date": 20181128
    }
  ],
  "product_meta": {
    "title": "Nesco VSS-01 Automatic Food Vacuum Sealer with Digital Scale and Bag Starter Kit, Silver",
    "description": "The Nesco Vacuum Sealer with Digital Scale makes it easy to prep, weigh and preserve your favorite fresh foods with the Nesco name everyone trusts. This double-duty appliance is compact to save kitchen counter space, with a stainless steel finish to match any décor. Portion control and meal prepping is easy and convenient with the Nesco Vacuum Sealer with Digital Scale. \n\nThis easy-to-read Digital Scale can weigh up to 11 lbs of food, down to .01 ounces, making it simple to weigh out perfect portions of meat, produce or whole grains. The smooth Tempered Glass Scale Platform is easy to clean, while the Scale can be tared to account for food containers. The Digital Scale is powered by two AAA batteries (included), and runs independently from the Vacuum Sealer. \n\nMultiple functions on the Vacuum Sealer make it easy to size it up and seal the deal. The “Seal” function produces an airtight, break-proof seal in one touch, while the “Vacuum & Seal” function makes it simple to preserve any food, no matter how fragile, perfectly every time. This Vacuum Sealer works with all universal brands of Vacuum Sealer style bags, and comes with 10 Nesco Brand Vacuum Sealer Bags in two sizes (8.6” x 11.8” and 11” x 13.75”). Storage of the Vacuum Sealer with Digital Scale is made easy with the built-in Power Cord storage under the unit.",
    "rating": 4.4,
    "feature_bullets": [
      "Prep, Weigh and Preserve with the 2-In-1 Vacuum Sealer with Digital Scale",
      "Multi Function Vacuum Sealer provides airtight, break-proof seals in seconds",
      "Battery-Powered Digital Scale weighs food items up to 11 lbs.",
      "Built-in power cord compartment under the unit allows for easy storage",
      "Tempered Glass Platform and Compact Design",
      "Includes (5) 8.6\" x 11.8\" and (5) 11 x 13.75 NESCO Brand Vacuum Seal Bags",
      "For use with all universal Vacuum Sealer style Bags and Rolls",
      "Two \"AAA\" Batteries Included",
      "Sealer and Scale can be used together or independently from one another"
    ],
    "specifications": {
      "Product Dimensions": "14.3 x 5.5 x 3.4 inches",
      "Item Weight": "4.4 pounds",
      "Manufacturer": "Nesco",
      "ASIN": "B07FKXQSFM",
      "Item model number": "VSS-01",
      "Batteries": "2 AAA batteries required.",
      "Customer Reviews": "4.4 out of 5 stars59 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#251,436 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 13, 2018"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Specialty Appliances",
      "Vacuum Sealers",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}