{
  "website_summaries": [
    {
      "verdict": "More than just a Bluetooth speaker, this little gadget plays music and tests your creativity. However, it's somewhat expensive and may have some quality issues.",
      "pros": [
        "A good choice for budding artists and creative types, as it pairs with an app for creating pixel creations on the screen",
        "16 x 16 pixels",
        "retro-looking design",
        "Sound is clear and balanced",
        "battery life is good",
        "Fun to change the designs to fit your preferences or the occasion"
      ],
      "cons": [
        "Pricey",
        "Some models had issues – couldn't sync, didn't stay connected, or wouldn't hold a charge"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Unique alarm/speaker",
      "text": "Love the product so far! I bought to mainly for the alarm purpose but the cool pixel art creation option as well as the pretty decent speaker quality sets it apart from cheaper options! I wish the battery life was slightly better but it’s nothing to knock it down a star!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 83,
      "publication_date": 20180909
    },
    {
      "title": "Great quality sound and so much FUN!",
      "text": "I absolutely love this little thing. The sound quality is amazing for a speaker so small. Battery life is excellent and the pixel art options are endless and so much fun. I got a great deal on the black model - I guess no one wants black but I love it. Can’t wait to see what Divoom has in store for us next.",
      "rating": 5.0,
      "verified": true,
      "author": "Silver Shoes",
      "helpful_votes": 92,
      "publication_date": 20181110
    },
    {
      "title": "Fun, Customizable Display And Great Speaker!",
      "text": "Fantastic little device! I'm not sure what I expected, but it wasn't this! The display is vivid and fun, with a retro feel. The animations look great and the content is highly customizable. On top of that, it's actually a really good Bluetooth speaker! Was seriously surprised by the sound quality and the bass that this thing puts out! The app is a little funky and janky, but it works and isn't required once you finish customizing everything. All in all, I'm super pleased with the purchase and it's currently my favorite new little gadget.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan M",
      "helpful_votes": 82,
      "publication_date": 20200615
    },
    {
      "title": "Better Sound than Amazon Echo Spot",
      "text": "I use the tivoo as an external Bluetooth speaker for my PSTV. The sound trumps the Echo Spot, way more bass. I normally use a head set for gaming but the PSTV doesn’t have a head phone jack so this is a work around without using a Bluetooth head set.",
      "rating": 5.0,
      "verified": true,
      "author": "Double Action ",
      "helpful_votes": 24,
      "publication_date": 20200924
    },
    {
      "title": "Super cool and cute! Definitely recommend.",
      "text": "I love these pixel products. They are really neat and definitely a pleaser as a present. They are really easy to control through an app and they have many different options for designs to have appear on the screen. I love using it for writing notes, quick one or two word phrases, and for decoration on my desk. What’s also a plus is the super cute baby pink color of the actual TV. I definitely recommend this product. I’m going to keep getting it as a birthday present for my relatives and friends. Super cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 111,
      "publication_date": 20200113
    },
    {
      "title": "Awesome!!",
      "text": "We'll see how long the battery lasts? Others on here had problems. Love this thing. So cute and sounds great. The app for android is actually easy to figure out. Bluetooth must be paired within the app. That's a negative but the app is needed for the radio function and controlling the built in mp3 player/tf card. Hope it lasts because I love this thing!",
      "rating": 5.0,
      "verified": true,
      "author": "eric carney",
      "helpful_votes": 51,
      "publication_date": 20200829
    },
    {
      "title": "Battery life short. Very disappointed! Not what was advertised..",
      "text": "I wanted to like this because I was so excited to get it. Was very cute and looks very exciting but as I started to use it was very disappointed. The battery life is terrible. When the battery goes out especially in the middle the night, it makes a very loud sound that woke me up Two nights in a row.. The instructions are so tiny that my guinea pig might be able to read them. The app is impossible to use it very hard to understand. So it’s going back I have better things to do with my money on something that is not worth the issues or the time.",
      "rating": 2.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Retrofuturism at it's best.",
      "text": "I had purchased the Divoom Timebox Mini in the past and now this one. They are pretty similar in quality. It feels sturdy and well put together. The Tivoo has added features and way more graphics it can handle. The controls are a little gimmicky. The front of the device has three controls. One is volume, one selecting audio source, and a selector of channels is very cool. If you love pixel art, this is for you. The audio quality is very good for a mini speaker as well. I love what this thing can do.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 13,
      "publication_date": 20200718
    },
    {
      "title": "Im so happy...like a little kid :D",
      "text": "I LOVE this product, saw it randomly on youtube, decided that if the sounds sucks, ill just use it as a prop in my youtube videos..BUT..sound is super super impressive, i honestly use it in my office as a speaker, bass is powerfull and sound very crisp....love ALL the funcitons that it has, use it as morning alarm....only bad thing is..now i have to have them all HAHA :D",
      "rating": 5.0,
      "verified": true,
      "author": "dusan jovic",
      "helpful_votes": 55,
      "publication_date": 20200129
    },
    {
      "title": "Cool but battery life is short",
      "text": "It's very cool and there are tons of designs you can choose for the display. However, the battery only lasts for a day. I have to charge it every night.",
      "rating": 5.0,
      "verified": true,
      "author": "Chaos",
      "helpful_votes": 57,
      "publication_date": 20190131
    },
    {
      "title": "Divoom Tivoo Retro Bluetooth Speaker = LOVE IT!",
      "text": "So, I am a bit of a tech nerd. I have all the latest current brand name items on my desk (i.e. smart speakers, small lights, hi-def cameras, etc.). These functional items and sometimes required. The “Divoom Tivoo Retro Bluetooth Speaker” is a must have desk accessory for anyone that appreciates the nostalgic past while bringing in the present needs of today (i.e. Bluetooth speaker, quality sound, etc.). At first I thought it just to be a “novelty” but it is sooooo much more than that. It is functional on all levels and looks fantastic! Job well done Divoom! Folks, you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerald T Herron",
      "helpful_votes": 54,
      "publication_date": 20190214
    },
    {
      "title": "Requires location permission...  why?",
      "text": "I don't simply give phone permissions. It absolutely requires permission to get device location and files on the device. I can think of no reason why it would need location, so now I can't use the app, which means I can't customize the display unless I'm willing to let them poll my location. Update: More reasons to hate this device. You better setup your custom channel right the first time, because once you do you can't edit it again. The app is just plain bad.",
      "rating": 1.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Get it! It’s literally awesome and adorable.",
      "text": "This is awesome. It’s so much better built than I expected. Speakers are LOUD, really nice bass. The animations are so cool too. It’s so much better than the LaMetric (I have two of those too) and it’s way cheaper. I wouldn’t have bough lametric had I known about this product first. I saw it on someone’s tech vlog and thought it was awesome. Definitely a safe buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared Stanton",
      "helpful_votes": 59,
      "publication_date": 20190302
    },
    {
      "title": "Great design but not so great audio and battery.",
      "text": "So I've had this speaker for a while its great its got alot of features But there were 2 major things that ruined it for me the battery is inconsistent on mine i would have the speaker in clock mode only and it bould die in the and sometimes it would last me 2 days max. The second part that annoyed me a bit was you cant really use an equalizer to put a bit more bass it will just lower the volume on the voice or the other instruments other than everything else was fine and the 3.5mm cable is really short and thin",
      "rating": 3.0,
      "verified": true,
      "author": "Sam7357",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "COOL DEVICE!",
      "text": "We have had this for a month or so and we love it. The kids like how it looks and it's easy to see the time at night, we can play music through it, and have the coolest designs on the screen. It's fun discovering all the creative things this tiny device can do - from changing the colors, to displaying the temperature, to changing the design that shows up, and we are constantly discovering different things it can do. Loving the connection it's creating with my 7 year old son as we play around with this innovative tech device. We are very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Fife",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Divoom Tivoo Pixel Art Speaker Works great!",
      "text": "I amazed at the build quality, sound quality and just how well this Divoom Tivoo Pixel Art Bluetooth Speaker works. Connects to Android or iOS with no issues. Great for all ages who can operate a smart phone. I highly recommend this product. So much fun to use. I play music on it and the sound is very impressive from such a small product. The app allows you to do so much with it. Example: set multiple alarms, differnt screen art to choose from, soothing sounds to help you sleep with built in timer. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Nim Nice",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "More than meets the eyes and ears",
      "text": "I’m continually impressed with Divoom’s offerings. From the clever packaging to the better than expected quality of materials, this tiny yet solid little “tv” has a lot more punch and bottom end than it physically looks like it can have. I just wish it came in more colors.",
      "rating": 5.0,
      "verified": true,
      "author": "porkloin2000",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Worth every penny!!",
      "text": "This is by far the best Bluetooth speaker. The sound is crystal clear and it can get loud for its size. The pixel art/animation is amazing with the ability to control from phone (download the app) or from the speaker it self. It has games, alarm, sleep mode, create your own pixels, creat your own music and the list goes on. Once my friends saw this and what it can do they all bought one as well. You will be absoulty satisfied with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "great personal sized device",
      "text": "picks up your BT signal asap no issues with a pretty good range, I bought this for my wife to use for sitting outside in the morning drinking coffee her other one is much larger and has several cords, this is quicker and easier to use and if your'e not looking for super high volume it does pretty good, plus its kinda fun to play with, these make great presents",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Fun creative clock and speaker.  Love it!",
      "text": "I recieved my speaker today. Works great! I had a few issues logging into the app but it downloaded fine and has a ton of fun features. I quickly figured out how to download images to it and its super cool that there is a comunity area where you can post your creations. I am looking forward to making animations of my own.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike M.",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Great pixel art, good sound, but the screen could be brighter",
      "text": "This is a solid bluetooth speaker that sounds great and is combined with a 16x16 pixel art screen that plugs into the Divoom ecosystem. The pixel art options are awesome, with the ability to show animations, change with the music, act as a clock, tell you the weather, etc. My only complaint is that the screen isnt very bright and depending on your look angle and lighting in the room can be hard to see. I also have a Pixoo which has an AWESOME/bright screen. By contrat this one is a little disappointing. However, the price point is good considering you also get a great bluetooth speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "ground_gainer",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Yeeeeeaaaasssssss!!",
      "text": "I wasn’t sure about this item because I was looking for something loud enough to fill a small apartment with sound but damn... now I understand the price you are paying for the aesthetic of a retro tv it’s cute but DAMNN this speaker is loud af and packaging was so cute too! It came in a sturdy plastic box with foam surrounding it so it’s well protected. This is a cute speaker great for an office or something",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara B.",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "So cool, I have to buy more as gifts",
      "text": "For tiny little thing it has incredible audio quality even as a Bluetooth speaker and for conference calls. Everybody that thinks it's the coolest thing in wants one. The quality of the pixels is about what you'd expect for something like this very 8-bit lo-fi. But I'll be damned if it isn't the coolest thing on my desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim90210",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Awesome Desk Accessory",
      "text": "This little guy is awesome to keep on your desk or in your living room. For as little as it is, the sound quality is actually pretty good (considering this thing is tiny). The speakers definitely pack a punch. The only bad thing about this little guy is the app used to control it, as i is kinda crumby and sometimes I set certain settings for the tivoo in the app and when i reopen the app those settings are back to default, which is kind of annoying. Definitely I fun little purchase however.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Stops Working After A Little While",
      "text": "Everything was good for just about 15 months then it just died, completely stopped working. I searched online for a solution and there are many people experiencing the same problem with no fix",
      "rating": 2.0,
      "verified": true,
      "author": "Auth0rized",
      "helpful_votes": 2,
      "publication_date": 20200924
    },
    {
      "title": "App takes the fun out of it",
      "text": "The device was great but your forced to use the app. To use the app you have to be online. You have to create an account and you have to tell it where exactly you are in this world and let it look at all your pictures. Do all that and it still doesn't work worth beans. I didn't want to return but I can't customize anything or even set the clock! Do yourself a favor and stay away. Google Play reviews on the app says it all.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabriel K.",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Nerd Husband Approved",
      "text": "My retro-loving husband loved this little thing. We also have multiple Bluetooth speakers around the house since he’s always listening to music. This little device has great sound and so many ways to personalize it. He has a fascination with Pixel art so this was the perfect gift for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Brown",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Grate However...",
      "text": "I like this speaker the moment I 1st seen it. Has very nice sound and grate LED matrix. However not open source, cannot program matrix with 3rd party app or on a linux machine. Clunky almost unusable android app. If server go down or shutdown then what ever you have stored in memory on the speaker is what you got left.",
      "rating": 3.0,
      "verified": true,
      "author": "Xev_29a",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Hardware is great, software is terrible",
      "text": "The device is awesome, but the software is pure garbage. I really wish that the app would be reworked to allow the ability to update your location for weather (can't), or that one channel would show the clock plus some different image animations (can't). You get a clock, date, temp, weather, and random pictures for the first channel. Found cool pictures to use for that first channel? Too bad. If you are looking at this as something to set on your desk, just wait for now until the app is updated or you will be frustrated as others are currently. Want an interesting bluetooth speaker? There are way better options for the price.",
      "rating": 2.0,
      "verified": true,
      "author": "T Whitson",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Awesome little Device",
      "text": "I love my DIVOOM TIVOO. First off, the packaging it came in is extremely nice, which was a great tough. It came with cords, stickers, and even post cards included. Its small, but it is a perfect desk accessory. The brightness is very bright at the top setting and extremely adjustable which I appreciate because it allows me to turn the brightness down at night so that it doesn't light up my room. I also love that you can have the device rotate between the time, temp., weather, and several other screens. This works really well as a small alarm clock, which is how I currently use it. All in all, a great device with endless possibilities!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "This little toy is really cool",
      "text": "Found this listed on a \"gadgets to own\" video, and thought it looked interesting. It's a fun little toy, makes a great clock, and the speaker is surprisingly good, for the small size and inexpensive price. Sounds much better than any clock radio I've ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Kosloske",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "NOT WHAT I EXPECTED!!!",
      "text": "Not what I expected. I watched the video review on the giveaways and it made it seem like it was great. Sound is not that good, not loud at all. When I try to play music in the app it doesn’t work. Can only play through airplay. It looks cool and quality seems good but that’s about it. Battery doesn’t last that long. I have to leave it plugged in so that at least it works like a night clock!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Kristian M",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Great desk decoration!",
      "text": "Aside from it being smaller than expected, it works great. I purely use this as a pixel art desk decoration rather than anything else, but all of its other functions are fun to use and handy to have. Pixel art is bright, flexible, and easy to switch around. It's retro TV design makes it a unique little gadget. Packaging was also very high quality. Will definitely add more of Divoom's products to my desk in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "CozyDia",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Retro and fun!",
      "text": "My 12 year old daughter only turns this off when sleeping, she loves it!! I love the colorful display, very awesome product!!",
      "rating": 5.0,
      "verified": true,
      "author": "hotpepperdoll",
      "helpful_votes": 34,
      "publication_date": 20190101
    },
    {
      "title": "Cute but nobody cared",
      "text": "It’s cute but look, it’s just a speaker. Kids didn’t “get it” and haven’t spent any time with it. Adults might use it and think it’s cute. The app is not user friendly and not near as cool as I thought it would be. Really kind of a waste. Just buy a speaker.",
      "rating": 2.0,
      "verified": true,
      "author": "Kymber Arvin",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Nearly perfect for pixel art.",
      "text": "Bought this solely for pixel art display. Have not used sound or battery. For pixel art, overall it works great, only real complaint is lack of ability to repeat individual pixel X times or set duration before moving to next pixel art in series.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Roadfeldt",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "How can be a bluetooth speaker  so brilliant today?",
      "text": "This is one of the best electronic devices I have purchased for years. Of course everyone buy it for its pixel display, but I never imagine this can be so addictive to play with. The app allows you to create your own pixel arts and project it on the small screen, or share with users around the world. A very great idea to allow people not only interact with their own devices but the real user community. And it has been in the market for almost two years (how could I miss it?)! Good sound quality (from a layman's perspective).",
      "rating": 5.0,
      "verified": true,
      "author": "KaguyaSama",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "I Love it!!",
      "text": "I love it is so beautiful, the material of the box is very resistant plastic I use it to transport it the only bad thing is that it does not have a safety cover is removed very easily, the horn at maximum volume without equalizing distorts and emits a shrieking and annoying sound, it is only for small spaces, the battery runs out very fast if you leave it with the animation it consumes a lot of energy, obviously it is only for entertainment, I would love to buy another two more soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Redfield",
      "helpful_votes": 54,
      "publication_date": 20190130
    },
    {
      "title": "Garbage product died within six months",
      "text": "I've had the device for less than six months when all of suddenly it died with no way to turn it back on. Trying to get support from Divoom is a lost cause they have little to no way to be able to contact them for support.",
      "rating": 1.0,
      "verified": true,
      "author": "Wave Phillips",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Vast creative outlet",
      "text": "This thing was originally purchased as aprop for inside my custom pc but now it’s much more once I realized its capabilities. If you have kids between 5 and 15 this would be a great gift for them",
      "rating": 5.0,
      "verified": true,
      "author": "Jason stewart",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Grate item u can’t just have one !!!!!!!! We love them so much we have to get more",
      "text": "Love it so much we are going to order more love the retro look and the silky shiny finish !!! The sound will blow your mind and the colors on the pixel are awesome !!!!!!!!!! I just order the Tivoo max white for my living room ⭐️⭐️⭐️⭐️⭐️",
      "rating": 5.0,
      "verified": true,
      "author": "Victormolina",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "100% recommend!",
      "text": "Shipping was super fast! This is the cutest thing ever! You can download their app and choose from thousands of digital designs and set them to play on your speaker. The sound quality was really great, exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie C.",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Fun, well made and entertaining",
      "text": "Sounds big for its small cartoon appearance. Easy to use and encourages exploration. Have given as gifts to a 20 something and a 60 something, both loved it. Probably the best $50 dollar gift out there for an iPhone owner.",
      "rating": 5.0,
      "verified": true,
      "author": "Recently there",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "My boyfriend loves it!",
      "text": "Got this as a gift for my boyfriend and he’s obsessed with it! When I first gave it to him he downloaded the app and spent 4+ hours making pixel art and customizing it. When I go visit him he usually has it playing and will bring it along in the car to use instead of his radio on road trips. I’m so glad I got this for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Winkler",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Great add-on for my office",
      "text": "I bought this product to put it on my office desk to add a funny touch while having the clock functionality. I love the TV shape, you can even setup different \"channels\" with some specific information or just a funny art. You can create your own or select one of the hundreds available through the app. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Julio Diaz",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "NOVEL!! CUTE!!! FUN!!!",
      "text": "THIS IS A GREAT PRODUCT FOR THE PRICE. THE MORE EXPENSIVE ONE WAS ACTUALLY TRASHY COMPARED TO THIS LITTLE GUY. I RETURNED THE BIG ONE AS IT DID NOTHING TO COMPARE TO THE LITTLE ONE. GREAT BUY!",
      "rating": 5.0,
      "verified": true,
      "author": "Floydboy",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Recommend",
      "text": "This was one of the things my boyfriend wanted for Christmas. When I was ordering it, I thought it was silly and I didn’t understand the point of it honestly. But once he opened it and put it together, it ended up making me want one too! It’s so cute and weirdly makes you happy getting to personalize it and make it your own. I recommend for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Fantastic product!!!",
      "text": "This was a gift for my teenage son. He absolutely loved it. He carries it around everywhere, the speaker is quite powerful for such a small device (better than my own bluetooth speaker). Will buy one for my daughter who now very much wants one.",
      "rating": 5.0,
      "verified": true,
      "author": "Chantal",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Awesome little speaker!",
      "text": "I love this little speaker! The sound is great, you can customize the display, play games, or just use it as a clock. It’s super easy to use the app and the speaker is adorable. Divoom makes great products and the packaging is really nice and protects it during shipping extremely well.",
      "rating": 5.0,
      "verified": true,
      "author": "Deeann",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Powerful, crisp, clear sound in a small package",
      "text": "The sound is very impressive! Would never think such a small speaker could produce such amazing, quality sound. More than just a speaker - alarm, stop watch, temperature, weather, create music, play games,tons of pixel art.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Looper",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Good, but not without issue",
      "text": "So I want to say I really enjoy this speaker, from ascetic to function. That being said I bought this about 8 or so months ago, and I would have given that one 5 stars, however it died without a clear reason. So I buy a replacement, works well enough... The problem is the LEDs have a blue shift that is very noticeable which left me questioning their quality control and keeps me from giving 5 stars. Overall cute useful device, but it might be a mixed bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Speedpoato",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "We’ll worth it",
      "text": "This thing has lasted me years as my main speaker for my small bedroom. It’s not perfect, and it’s not necessary/ But it sounds great for the size, and there’s nothing else like it. It just looks good",
      "rating": 5.0,
      "verified": true,
      "author": "Pasta",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "It is a fun little gimmick",
      "text": "Awesome little blue tooth speaker! The app is easy to use and the animations are fun with plenty of content already available.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. E",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Pixel art could be better...",
      "text": "As a speaker, it works well. Okay sound and features for the money. However, most of the pixel art found on the app can't be displayed well. I was super frustrated to keep finding awesome pixel art that would look terrible on the screen. It's okay, but it could be better. Maybe if they had a screen with a bit more pixels, it would be way better.",
      "rating": 3.0,
      "verified": true,
      "author": "Josean Ortiz",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Expensive for a speaker that can only be used indoors, sitting on a desk",
      "text": "Removed one star because the speaker arrived with a cracked knob. This could have been caused by being pressed into the packaging too hard by the manufacturers. Overall quality is nice. Speaker has a good weight to it and the app has a lot of customizable features.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashton",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Cool little speaker.",
      "text": "Dials on tv control channel and volume. Front power button changes input from bluetooth to 3.5 jack. Back power button under panel is what actually turns it on. 3.5 jack can give feedback on some items. All in all good sounding little speaker and suprising loud.",
      "rating": 5.0,
      "verified": true,
      "author": "J Naber",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Love this little guy!",
      "text": "This thing is so fun! I bought it as a prop for a video game wedding but now use it all the time. The sound is surprisingly good for it's size and it looks great on the shelf even when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "LauraH",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Very Cool!!",
      "text": "I am in love with this little gadget! I am so glad I found this on the amazon discover page. It’s a cool little addition to my gaming setup. I can’t wait to use all the cool features",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 8,
      "publication_date": 20181012
    },
    {
      "title": "Be careful",
      "text": "This piece of junk shorted out then sparked and then started to smoke and ended up catching on fire. Scary do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "Hi",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Really good audio and battery life",
      "text": "Got this initially just for the pixel art. But the speakers were wow!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Q",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Fun little Bluetooth speaker",
      "text": "Nice little fun Bluetooth speaker I love the look and all the different pixel pictures and what you can make with it very fun and would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great sound and looks so cool!",
      "text": "I love this bluetooth speaker. Easy to set up and pair, battery life is good, sounds pretty well and loud and looks so nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Doctora Beauty",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "After a couple months... It died",
      "text": "It's pretty neat Edit: it WAS pretty neat. Mine failed just like everyone else's. I guess the internal battery is extremely cheap. Won't take a charge anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Cliff",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Worth it",
      "text": "This box can kick butt with the sound quality! So much that my son loves it that I’m ordering one for myself",
      "rating": 5.0,
      "verified": true,
      "author": "Chrystal",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Nice speaker but not as a clock because of battery consumption",
      "text": "Nice sound and bas depth effect but its high battery consumption to be work as a clock need battery saving system and better software efficiency, and more tools for customizing",
      "rating": 4.0,
      "verified": true,
      "author": "Computerchy",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Good sound",
      "text": "Pro: good sound and cool features Con: too short of a range using BT as compared to my other BT units",
      "rating": 4.0,
      "verified": true,
      "author": "Clyde",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Fun, high quality and great sound!",
      "text": "This product is so good I actually bought two of them in case my first one breaks! For its size and price range, sound is amazing. Build quality is very high and the stuff you can do with it is surprising to say the least! I love it and would recommend it to anyone who likes gadgets!",
      "rating": 5.0,
      "verified": true,
      "author": "Ramiro A. C. Souto",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Cute!",
      "text": "I love this! The feeling of the speaker is such high quality and being able to create your own pixel art to display on the screen is incredibly cute",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca H",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Registering the product",
      "text": "was unable to register the product and had not instructions as to how to do it. Product support lacking.",
      "rating": 3.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Fun as heck!",
      "text": "The build quality is amazing! Even the box it comes in is made of nice plastic, and not cheap cardboard. Lots of fun animations to play with, make custom pictures, play games, etc. Bluetooth speaker is also loud and good, rich quality. Highly recommended to anyone who wants a fun little device for the bookshelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "AUX not shielded causing buzzing",
      "text": "Looks great and sounds great. If you want to listen to AUX port you have to pull out the charger else buzzing. Loud. Buzzing.",
      "rating": 3.0,
      "verified": true,
      "author": "robert",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Opens up all sorts of ideas",
      "text": "Good software attached. Hope the keep adding to its features. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "clint",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "All I Can Say is WOW",
      "text": "The sound that comes out of this little Retro TV is AMAZING. Loud and clear! I use it daily at work! Love the screen and all the artwork you can make or choose from!",
      "rating": 5.0,
      "verified": true,
      "author": "MrTaylorM",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "I absolutely love this little thing",
      "text": "oh man,, I absolutely love this little thing the sound quality of this thing is just amazing. love the oldschool style just show it to your friends and they will be amazed of it. it is so cute! so many functions in the app. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Mikheil Tsitsiashvili",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Good quality speaker",
      "text": "I bought this for my wife for Christmas and she has been really impressed with the overall quality of this speaker. Surprisingly good and loud sound, solid build it feels high quality in your hand, and it has a lot of software features that give you some fun. The packaging is very nice as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanis",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Awesome",
      "text": "I wasn't sure what to think about this little speaker but it is awesome. I got it as a gift for my son and he has really enjoyed using it to create his own pixel art. The only problem is that the battery doesn't last for long but I guess that is to be expected. The sound quality of the speaker is great.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Frazier",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "must have item for yourself, and as gift for that special some 1",
      "text": "Super cute ,compact, pretty good sound..awesome pixel to choose from..easy to use Love this item. Received before due date...",
      "rating": 5.0,
      "verified": true,
      "author": "Elisia Kellogg",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "amazed",
      "text": "The sound quality is nicer than I expected, and it’s really loud to a point that I was shocked. I keep my speaker plugged in all time to make it a little clock on my table. Little pixel arts are cute and fun to look at, the app for it is amazing. Definitely worth the money 💓💓",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie Yu",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Unique find👍",
      "text": "Sounds loud for little speaker and it's easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "America",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "I LOVE my Divoom",
      "text": "Can not recommend this enough. I bought one for a friend just so they would have one and not get sick of hearing me talk about mine.",
      "rating": 5.0,
      "verified": true,
      "author": "apersonofinterest",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Amazing",
      "text": "This is the coolest thing I’ve ever bought in my whole life.",
      "rating": 5.0,
      "verified": true,
      "author": "Apathy Kills",
      "helpful_votes": 2,
      "publication_date": 20181223
    },
    {
      "title": "Good buy.",
      "text": "Good clear sound. The pictures are a fun add to this.",
      "rating": 5.0,
      "verified": true,
      "author": "cody sharp",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Amazing sound for its size",
      "text": "This a neat little gadget and you get a lot of bang for your buck! Worth it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Glynda",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Definitely worth the money",
      "text": "Battery life will last about 12-16 hours without playing music, which is what I used it for (as a display). The sound quality is average but not bad for the size of the speaker. The features are what really stand out and makes this little tv speaker an awesome curiosity on your desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach Wagner",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Good price, sound quality & so cute",
      "text": "I love this speaker, it sounds amazing and it’s super cute. I use it all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Katlynisgreen13",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great for 10 year old daughter easy to use.",
      "text": "The Tivoo Pixel Art Bluetooth Speaker was a Christmas present. The device is easy to use and the app that is needed to transfer pixels is great and easy to use and create your own Pixels. The alarm clock is another plus for getting up for school.",
      "rating": 5.0,
      "verified": true,
      "author": "Garry Lee Tweed",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Fun speaker",
      "text": "Sound is decent, has a lot of customizing. The only thing is I'm not sure where the device gets its weather information from it doesn't seem to match up with my local area and I can't get it to match up with my local area.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Kawamura",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Worked for a while",
      "text": "It worked great for about 6 months. I had it connected to my iPod via Bluetooth streaming music in my bedroom 24/7. I came home after work one day and it was powered off. I couldn’t get it to turn back on. Dead as a door nail.",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher L Jones",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Desk gadget king",
      "text": "Awesome little pixel art speaker. And man it’s packing a huge sound in this small package. Very fun desk item!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Neumeister",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "The speaker is ok, but not worth the money!",
      "text": "It is pretty cool speaker, but it needs more bass and the battery dies within 45 mins to an hour",
      "rating": 3.0,
      "verified": true,
      "author": "CSherman242",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Fun product",
      "text": "Fun little speak, great sound for the size, looks great on my desk Update: I was promised a dree anker dual port usb charger that was never delivered!",
      "rating": 5.0,
      "verified": true,
      "author": "SDD",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Not one for BT speakers, but this is my exception.",
      "text": "This is the most unique BT speaker I've ever seen. The sound quality for the price is more than fair. I love how the companions app let's you create your own pixel art, and well as download others' creations.",
      "rating": 5.0,
      "verified": true,
      "author": "Reverse Sandrosis",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Love this product.",
      "text": "The animation is very smooth. There's actually a ton of fun & interesting things you can do on it, like play music, make your own pixel art pictures or animations. The games are fun to play, too. The bluetooth is easy to connect to as well. I definitely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Corey D.",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "MUST HAVE",
      "text": "This is an awesome little speaker, lotsa bass. The pictures in the gallery are super fun. Fun to try to make your own. I love everything about this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Great desk-toy speaker",
      "text": "Frigging awesome desktop speaker. So many great animations and features. Actually has great sound for such a little device",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A Weller",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "I love it",
      "text": "I use this by my computer while gaming. Its got a deep full sound and for that reason alone is worth the money, then add the app and the customization and its near perfect. I keep mine plugged in now, but battery life is rough.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "must buy !!!!!",
      "text": "this speaker is everything i wanted and more, i dont usually leave reviews but its so loud and super cute. the app is generally easy to use and it's unique how you can make your own or use other peoples art. i would buy this again 10/10",
      "rating": 5.0,
      "verified": true,
      "author": "chrissy",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Great product",
      "text": "Arrived in a very seccure box and came with an aux cord and a charger cord. The speaker was already charged when I opened it so I tried it out immediately. Very good sound quality and very fun to mess with.",
      "rating": 5.0,
      "verified": true,
      "author": "KJ",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Fun Device but....",
      "text": "Smaller than expected.....images and clock are hard to adjust....especially the alarm settings.......great sound and good multifunction device for the phone...",
      "rating": 4.0,
      "verified": true,
      "author": "klh123",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Fun Little BT Speaker",
      "text": "I love this gadget but I'm disappointed that it was delivered with a chip out of it. I ordered white so it's fairly noticeable. I expected flawless for the price of this tiny speaker...",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Henne",
      "helpful_votes": 0,
      "publication_date": 20200414
    }
  ],
  "product_meta": {
    "title": "Divoom Tivoo Retro Bluetooth Speaker - Pixel Art DIY Box, RGB Programmable 16X16 LED, Support Android & iOS; TF/SD Card & Aux 3.9X3X3.2 Inches(Black)",
    "description": "Color:BlackWHY SHOULD YOU CHOOSE TIVOO PIXEL Pixel Art DIY BLUETOOTH SPEAKER?>\nRetro and funky TV appearance, super strong function and classic pixel art, first-class sound quality, powerful bass. Tivoo is a great product and gift makes you have super awesome experience.\n\nDO YOU MISS THE OLD STYLE PIXEL ART? LOOK HERE!\n16*16 pixel screen satisfied your creation. We got a pixel art community in our app, all of the people who are into pixel art having fun in here. We make images even animation and we show to others.\n\nHD SOUND QUALITY AND POWERFUL BASS!\nTop-level configuration and unique architecture brings you the best sound quality. Under 75 signal-to-noise ratio, powerful bass. V5.0 blutooth, support aux & bluetooth & sd card.\n\nSTOP BOTHERING FOR CHOOSING A GIFT. THIS IS YOUR BEST CHOICE.\nAre you still considering to buy a normal bluetooth speaker as a gift? Too boring! Tivoo bluestooth speaker, more than a speaker. And you will know it.\n\nA MUST-TO-BUY! JUST ADD TO CART NOW!!!",
    "rating": 4.6,
    "feature_bullets": [
      "♪ Dioom Compact Retro Bluetooth Speakers - The Tivoo Bluetooth speaker only takes a space of 3.9 x 3.2 x 3.2 inches; 6 Watts of power delivers surprisingly loud volume,Perfect put in office, dorm room, apartment, yard, garage, campfire, beach, whatever you need it to do",
      "♪ Loud Sound - With an acoustic enhanced design, 360°audio direction w/bass port;Small volume bass dynamic compensation, attainable 75 signal-to-noise ratio, high fidelity and noise reduction effect,delivers the finest audio in such compact body",
      "♪ Pixel Art Creation Display - Easy toaccess to over 1000+ designer in our app community and get inspiration to create amazing pixel art design at your finger tips. We also prepare numerous pixel art creation tools for you in Divoom APP, you are free to spark your imagination with this smart pixel kit",
      "♪ Retro Fashion Style - It uses square design,not only blends modern technology with retro classic aesthetics,also combining the latest digital audio tech with Retro unky TV shape appearance, let we feel like back into the golden age of music in retro, enjoying a soothing moment in today’s busy life",
      "♪ Build- in Handy Daily Tools - Build-in helpful daily functions. Just connect Our Divoom application, and you can get quick notifications from social medias, like Twitter and Instigram. Free to check the led screen of time, weather, thermometers"
    ],
    "specifications": {
      "Product Dimensions": "3.9 x 3.2 x 3.2 inches",
      "Item Weight": "13.4 ounces",
      "ASIN": "B07FMJFCDJ",
      "Item model number": "TIVOO",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.6 out of 5 stars388 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,390 in Amazon Launchpad",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 1, 2018",
      "Manufacturer": "Divoom"
    },
    "categories": [
      "Portable Audio & Video",
      "Portable Bluetooth Speakers",
      "Electronics",
      "Portable Speakers & Docks"
    ],
    "price": 54.0
  }
}