{
  "website_summaries": [
    {
      "verdict": "Combining the highly maneuverable B-Lively stroller and the super-secure B-Safe Ultra infant car seat, this is an excellent choice for busy, safety-conscious parents.",
      "pros": [
        "Lightweight stroller with one front wheel for jogging and easy turning",
        "One-handed folding mechanism",
        "Car seat features double-layered impact protection and is LATCH compatible"
      ],
      "cons": [
        "Child will outgrow the car seat before the stroller"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I love... but a few flaws",
      "text": "Car seat came broken where the seatbelt is held down by if I’m not using the base. The seat also gets stuck to the base making it very difficult to lift up. I bought this Stiller system thinking it would be good for walking, which all around the stroller is built perfect for, except for the wheel material. The tread on all my wheels are so worn down and my baby is only a month and a half old. At this rate I will be having to replace the wheels every few months.",
      "rating": 2.0,
      "verified": true,
      "author": "BMDRAK",
      "helpful_votes": 4,
      "publication_date": 20190805
    },
    {
      "title": "Impressive!",
      "text": "Bought as a gift for my niece. My brother loves it and they use it every day. Very good and reliable travel system. I would recommend this product as it does not appeals cheaply made.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 3,
      "publication_date": 20190412
    },
    {
      "title": "Very Safe",
      "text": "I bought this for my first baby. I really liked the safety rating and felt it was the best choice for her. Infant seat is a little heavy, but very well made. It was difficult to install the base in my car, but once we figured it out it fits very snug and secure. The click connect is amazing. The stroller is so nice and turns so easily. Very smooth ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney Bramer",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Dependable",
      "text": "Easy to assemble easy to use. Dependable and very durable. It’s one of the best travel systems on the market in my opinion. The seat is easy to detach from stroller to car seat in 1,2,3. All in one system that is worth the purchase. The car seat must be approved by the hospital which allowed you to leave with the baby and this product does just that. This system is also good for when the baby becomes a toddler, just remove the carriage. Best investment ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Mellie",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great easy to use and very nice",
      "text": "Very pleased, bought this for my daughter and was with her after my granddaughter was born, thus was very easy to use. And it’s great quality. I did a lot of research before buying this for my first beautiful granddaughter and it met all expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Cheaper here then other places",
      "text": "It’s a nice one and cheaper here then other places such as Buy buy Baby. Save your money here. 👌",
      "rating": 5.0,
      "verified": true,
      "author": "MRS. GONZALEZ ",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Good product for value!",
      "text": "This is a good stroller, sturdy. Will keep your little one safe. It is a bit heavy but my wife can carry it without any problem. If you want safety go with this stroller. All American!",
      "rating": 4.0,
      "verified": true,
      "author": "Honest Reviews",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Safety",
      "text": "Our daughter picked this product out as the best one for the arrival of our first grandchild❤",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmie/Donna Shato",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Best stroller ever",
      "text": "the mom loved this gift. It was thoroughly researched. And when opened, lived up to all the expectations. Have not had it long, so unable to talk about durability, but it is very lightweight and easy to maneuver. Would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "ACW",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Easy but heavy",
      "text": "I love my travel system. The car seat is a little heavy but it’s very easy to use and the stroller is easy to fold and put away and was easy to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Cute and easy",
      "text": "Moves easy. Easy to put on and take off the car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "momable",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Great Fit!",
      "text": "I bought this Travel System for my grandchild who will be born in December. I purchased this due to the high ratings it received on Amazon reviews and a strong recommendation from a good friend's grandchild who was also expecting a baby and all of their friends own and recommended this System. My son and his wife installed the car seat with little or no problems and then had to have it \"certified\" by the MD fire department! It passed inspection with flying colors in the the back seat of their Mini Cooper \"Countryman\". They loved the seat and the red color I purchased for them! I don't think you will be disappointed with this Britax B-Lively 35 Travel System!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Sharon L. Caplan",
      "helpful_votes": 18,
      "publication_date": 20181127
    },
    {
      "title": "Best customer service ever from Britax",
      "text": "The stroller came defective. The adaptor to hold the canopy in the right side was not in place. Looks like it was torn away. The one in the left side is ok. So I can not install the canopy. For the rest, the stroller looks fantastic. Great color as advertised and it’s pretty easy to maneuver. But because this problem I only give one star unless they can offer a solution. UPDATE 18-3. After contacting Britax Customer Service, I received a new stroller for free. And it came pretty nice. I will try to upload photos. It is pretty safe and functional, easy to operate for my still pregnant wife. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben R",
      "helpful_votes": 7,
      "publication_date": 20190222
    },
    {
      "title": "SENT ME A PRE-OWNED ITEM",
      "text": "PRODUCT IS HORRIBLE, OPENED AND UN-WRAPPED. DOESN'T FIT CAR PROPERLY AND HARD TO INSTALL. WHEN CUSTOMERS SPEND THAT MUCH MONEY. THEY DON'T WANT AN ITEM THAT'S ALREADY BEEN USED!!! WOULDN'T RECOMMEND!",
      "rating": 1.0,
      "verified": true,
      "author": "gerry",
      "helpful_votes": 5,
      "publication_date": 20190318
    },
    {
      "title": "Only brand we use",
      "text": "Umm...yes. we use all britax baby items. We have the britax marathon for my son. Now with the baby on the way we need another. The combo of stroller and carseat are a must. The car seat is the simplest to install and take out. We use the anchor hooks in the car. The stroller is one of the easiest we used to collapse and open. 3 other kids I used a few brands and wish I found britax before. If you haven't use britax yet your missing out.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan magliazzo",
      "helpful_votes": 2,
      "publication_date": 20190616
    },
    {
      "title": "Love these so much!",
      "text": "I love the ease of use with this stroller, my baby often falls asleep in the stroller! My only issue is the car seat sticks a little when coming out (safe, so no real complaints) and the folding cover for the sun sometimes comes off track but is easy to put back on. Make sure to put the front wheel of the stroller on correctly! I put it on wrong and thought I would break it but I was able to fix it. The car seat is also beautiful and all works as expeted. Also very easy to adjust shoulder straps for baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Bri G",
      "helpful_votes": 2,
      "publication_date": 20190715
    },
    {
      "title": "!!!!!USED!!!!!",
      "text": "This product I waited for 10 days for it to arrive. It states BRAND NEW on website however when it got delivered, the car seat was sticking out as if the box was too small. The tape looked like someone had did it. Definitely a used item as soon as it arrived, my husband and I didn’t even bother to open it. Wrong description on website!!!! So frustrating used items are sold and being labeled as brand new. Now we have to go out and actually buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "GoldenCity22",
      "helpful_votes": 2,
      "publication_date": 20191211
    },
    {
      "title": "Love love love",
      "text": "Our second Britax stroller/carseat combo. We absolutely love them! It is so convenient and very easy to get out of and into the car. These things are so durable and sturdy. We beat up our first set and it held up to all the abuse. Easy to keep clean and kiddos seem to like them. Won't ever buy anything different, totally worth the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "A.Logue",
      "helpful_votes": 3,
      "publication_date": 20190305
    },
    {
      "title": "A must have travel system worth the money!!",
      "text": "This is the best system for new parents it’s worth every penny spent!! The car seat is light and easy to install I love how simple it is the install the car. It’s so easy to install that sharing with multiple cars is possible unlike other car seats I have used which make this task near to impossible and difficult. The stroller is as they describe a one handed release it is smooth and sturdy while still being light and easy to fit into trunk of car. I’m so happy with my travel system I love this brand it was my first time purchasing a britax product and I’m very impressed with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Janette",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Great stroller system",
      "text": "All the other positive reviews are right. This thing is the best! Easy to maneuver and fold. Lightweight and attractive (I even got a complement on it). My in laws were able to quickly assemble it while I was in labor (water broke same day this shipment arrived) Overall I'm quite pleased with this purchase and I think you will be too",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Great combo!",
      "text": "This is a great combo and value. I love Britax products and have always been impressed with the quality. My only complaint is that when you unlatch to open the stroller it’s a little awkward, but the stroller folds up easily. I like that the infant seat has a slim fit since we have three kids in the backseat (one in a booster, one is this car seat, and one in a seat belt). Overall - I would buy again and recommend to friends and family.",
      "rating": 4.0,
      "verified": true,
      "author": "Dyer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "It's almost perfect!",
      "text": "Such a great combo, and the locking mechanisms are great! Love how portable the stroller is, but the storage below it is really small. Wish it could have more storage, and it would be better if it were easier to take the carrier in an out of the stroller mounts. We have to step on wheels in order to get it to separate. Would be great it easier to take in and out. Overall, great deal for durability and simplicity, but a little too small at times.",
      "rating": 4.0,
      "verified": true,
      "author": "alecmg1214",
      "helpful_votes": 0,
      "publication_date": 20201025
    },
    {
      "title": "Excellent Product",
      "text": "I purchased this stroller / car seat product from amazon because the price was slightly lower when compared to retail stores and my color option (red & black) was not available in stores. The product required minimal assembly - only some adjustments on car seat to fit baby. This is my second time purchasing a Britax product. I previously had a front facing child car seat for my eldest child.",
      "rating": 5.0,
      "verified": true,
      "author": "GK",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": ".",
      "text": "I love this set, although I do feel it's not wide enough . The button to release you have to really press it I feel it sticks a little. I love how the cover on the stroller is huge. It doesnt have a bassinet option which sucks becuase we always have to strap the baby in her car seat to go for walks .. I bought a cup holder for the stroller so I can place my coffee in when we go for walks. I feel the car seat is great besides the width Folds easy",
      "rating": 4.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Amazing and beautiful",
      "text": "I searched for a very safe yet stylish car seat/ stroller combination. This has by far met and exceeded my expectations. Extremely easy assembly. Mobility is fantastic. And it’s very pretty! Baby is going to be here 3/14 and I feel very ready now that it’s all ready to go!",
      "rating": 5.0,
      "verified": true,
      "author": "ShawWill",
      "helpful_votes": 2,
      "publication_date": 20190307
    },
    {
      "title": "Great stroller; don’t like the car seat",
      "text": "The only issue I have with this is the car seat itself; it is very deep forcing you to position the baby in a certain way, the straps seem really weird like they aren’t high enough and the whole thing is very narrow; too narrow for an infant head insert. Very disappointed in the car seat design. I do wish the stroller had a brake - maybe I missed it.",
      "rating": 4.0,
      "verified": true,
      "author": "LE",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "We like it but we don’t love it.",
      "text": "The three will design of this makes it very easy to turn in maneuver. But it also means he drives a little crazy. It does not go straight well. It’s very hard to do with one hand. The release clip to get the car seat part out of the car seat base or the stroller is a bit sticky. We have to finagle it most of the time. Overall we are mostly pleased but there are a few things that cause us trouble.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Wilpitz",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Best travel system!",
      "text": "After a intensive search about safety, compare diferents travel system, listen my friends opinion, I chose britax and Im so happy with the product, I ordered a open box because it was a little bit off to our pocket and literally it was like new, I recommend taking a risk with an open box, in my case only the large package came as battered but the product is perfect and I am delighted with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Decent",
      "text": "What I like is that it isn’t huge. It does move around easily. I wish it had a cup holder made into it. Just read instructions throughly to make usage very easy. There are also tutorials on YouTube .",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel Mitchell",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Awesome!",
      "text": "This was a great deal! It works perfectly. The only complaint we have is that you have to buy the tray/cup holder and stuff separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Amberlee",
      "helpful_votes": 2,
      "publication_date": 20191211
    },
    {
      "title": "Keeping children safe.",
      "text": "This seat was purchased for my granddaughter. As a car seat tech I know the importance of buying a European seat because of their safety standards.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheldon",
      "helpful_votes": 2,
      "publication_date": 20190712
    },
    {
      "title": "Gorgeous & functional",
      "text": "This took about 15 minutes from opening the box to fully assembled. The ease of opening and closing the stroller is AMAZING! So glad we got this for baby #2 😆comes with the car seat and base, as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney ",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Love it!!",
      "text": "Love love loveeee this stroller. So durable, and drives on any terrain. It is a bit on the large side especially when attaching the car seat on top of the stroller but my 3 year old fits perfectly into the stroller. I can us using this for quite some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Eliza Cee.",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Recommended by second time mom, number 1 for safety rating.",
      "text": "Easy to install, love the way it tightens down, baby is snug and looks comfortable. Pick this one because it had the number 1 safety rating for car seats. Stroller is easy to unfold and fold, the pocket is great for moms with big phones and limited pockets. Like that you can also cover the baby completely up and still be able to see them and keep bugs and the sun away.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Safe, secure, easy to maneuver",
      "text": "I was 8 months pregnant when I assembled it. Very easy to put together. It was delivered quickly, got it in a couple of days. My baby is only two weeks old but so far I love everything about the car seat, feels so secure and sturdy. I haven’t used the stroller yet but I love how easy it is to maneuver, I love the color and the fabric. Also it’s light weight and easy to fold basically press a button and pull the middle cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great Product for Price",
      "text": "Very excited to recieve this! My little guy will be here in May.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 3,
      "publication_date": 20190202
    },
    {
      "title": "Easy to use and quick to fold",
      "text": "I really like that I can grab this stroller and fold it with one hand. The car seat adapter is a little stiff and does make it difficult to remove the britax car seat from the stroller. That was my only complaint. The stroller maneuvers easily enough and is good for jogging.",
      "rating": 5.0,
      "verified": true,
      "author": "Candace S.",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Great stroller",
      "text": "I went to Buy Buy Baby to “test drive” this stroller. It was very stylish and easy to handle with one hand. I’ve now had it for 4 months and love my choice. I was skeptical of the plastic wheels but in our desert area we have a lot of goat heads and they flatten rubber tires.",
      "rating": 5.0,
      "verified": true,
      "author": "SCD",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "LOVE LOVE LOVE!!! ❤️❤️❤️",
      "text": "Perfect, exactly what I was looking for for so long! This doesn’t even begin to describe how fabulous this stroller is. I can’t wait to go on walks with my little one! It moves so nicely. Assembly is SO easy. And even better my son didn’t want to get out so that in my opinion speaks measures! We’ve always loved the Britax brand but this just gave us so many more reasons to love this brand! We won’t be using any other brand!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Do not buy open box fromAmazon",
      "text": "Opened box no scratches or blemishes says the description, reality is someone sent back a used stroller dirty and then it was sent to my daughter for her new baby. Not happy with Amazon or with Britax",
      "rating": 1.0,
      "verified": true,
      "author": "Tim and Marisela",
      "helpful_votes": 3,
      "publication_date": 20190722
    },
    {
      "title": "I love it!",
      "text": "So as a first time mom I did a ton of research on car seats and strollers. I had went to BuyBuyBaby to look at them and test them out and knew Britax was what I wanted. The car seat is easy to adjust for when they get bigger, the stroller is amazing and rides smoothly. I’ve been using it for the past 6 months now and I’m very happy with my purchase. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Bobbi Duke",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Hard to steer",
      "text": "I hate this stroller. Its very hard to maneuver and it makes my wrists and arms hurt every time I use it. I HAVE to use both hands to get this stroller to steer straight. It usually steers to the left/ right when I want it to go straight. Was not expecting this issue since it wasn't a cheap strlloer. Would not recommend this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Safe, easy, & worth the price!!",
      "text": "Everything came in perfect condition; directions are easy to follow; stroller is relatively easy to breakdown and open up; car seat isn’t light but very secure for our infant; would recommend to others in a heartbeat. I feel like this is a very safe travel set and as new parents ...we are overly cautious of alot!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Best travel system",
      "text": "We love the travel system. The newborn sleep nicely in the car seat. And my 6 years old boy can be able to fold the stroller, that’s how easy it is to fold...",
      "rating": 5.0,
      "verified": true,
      "author": "Regina D.",
      "helpful_votes": 2,
      "publication_date": 20200124
    },
    {
      "title": "Perfect for small packages",
      "text": "My baby was born early and NICU said I would need a car seat for a 4lb baby. This car seat was perfect! The nurses commented they had not seen one like this and they were impressed. It held my baby just right. I was glad I didn't have to go out and purchase another one on the fly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Love- best stroller",
      "text": "Had this stroller with my middle child, but I gave it away after he grew out of it. So I had to buy again for my last baby. Best stroller ever, smooth ride, easy to assemble, and so easy to fold up!!!! Love",
      "rating": 5.0,
      "verified": true,
      "author": "Jrmb",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Fantastic Design!",
      "text": "1) Light in weight compared to other products. 2) Perfectly sized wheels which helps roll the stroller over minor bumps in the walkway. 3) Easy to lock the wheels. 4) Nice canopy which protects the baby from sun, rain and bugs. 5) Looks very sleek and classy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "All in one.",
      "text": "Fairly easy to use and once the car seat base is installed you don’t have to worry about it. Although I do recommend checking it every few days.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty Zamora",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Good buy IMO.",
      "text": "This is great. Collapses with nearly one hand. Not heavy or hard to manage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190127
    },
    {
      "title": "Easy assembly",
      "text": "We haven’t used it yet; still pregnant. But it was extremely easy to assemble, directions are easy to read in regards to using different features. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara O'Connell",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Glides like a dream",
      "text": "Love this stroller. So light weight and easy to maneuver",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina Ortiz",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Don’t waste your money!!",
      "text": "Car seat is awesome. The stroller is a POS!! The stroller broke after 6 months and Britax customer service was no help whatsoever. Shame, for the price you would think it’s better quality. I don’t know how or why it broke, we took very good care of it. Don’t recommend to anyone!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon S.",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Great",
      "text": "Love this stroller!! The only awkward comment worth mentioning is how to open the stoller after folding it down. There is a lever on the side that you push, while simple, completely opens backwards from my dominant hand making the switch weird to unfold.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Awesome",
      "text": "So easy!! Love all of the pockets. Moves easy in tight spaces and easy to steer with one hand! My husband and I are obsessed and our son falls asleep every time he is in it! 🙌🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Revell",
      "helpful_votes": 2,
      "publication_date": 20191212
    },
    {
      "title": "Great value",
      "text": "Works great! Kind of sticky clicking the car seat into and out of the stroller but other than that I love it. Needed to buy a nicer stroller organizer since this didn’t come with a cupholder",
      "rating": 5.0,
      "verified": true,
      "author": "Acuna",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Love!!",
      "text": "Great carseat and stroller set! The carseat is a little heavy but the quality makes it worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "T Awaldt",
      "helpful_votes": 2,
      "publication_date": 20190316
    },
    {
      "title": "Awesome product!",
      "text": "I’m a first time momma and received my Britax travel system today and absolutely love it!! Easy, quick installation, easy to fold up for travel, and the overall quality is amazing. I love the click connect system, so easy to use!! And it has awesome storage on top and the bottom. Can’t wait until our little man gets here so we can actually use it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "We are happy",
      "text": "the infant seat is a little heavier than the Chicco but we are happy with the whole set up and safety of this product",
      "rating": 5.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Only get the car seat and not the stroller",
      "text": "First time mom and I do not recommend this combo. My baby hates being in her car seat in this. There is also a small compartment for shopping. I never review items, I would suggest getting a lighter combo or only the car seat and a better stroller. It’s a pain, not worth saving a bit to bundle.",
      "rating": 2.0,
      "verified": true,
      "author": "genavi huerta",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Love at first sight ❤️",
      "text": "I’m so in love with my soon-to-be little man’s stroller 🥰!!!! I bought it originally for the color since that’s what caught my eye 👁. It was super easy to put together, easy to put down and the front wheel turns perfectly. I must say it again- I love this stroller it’s everything I want and need it to be! ☺️",
      "rating": 5.0,
      "verified": true,
      "author": "ChocolateHershey",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Grateful I went with this choice!",
      "text": "I did so much research on a stroller/carseat system as a first time mom. This system is awesome, easy to use, and durable. Been using it for 3 months now and LOVE the front access to the storage underneath, the peekaboo shade, and the ease of transition from stroller to the carseat base. Definitely worth its money!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle G",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Really snazzy looking and easy to assemble",
      "text": "The stroller was easy to use, durable materials, very smooth glide and easy to navigate. I was not so pleased with the car seat installation instructions but I got it in there.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlin Menefee",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Best travel stroller",
      "text": "Luxury brand, lightweight and easy to fold. Good for travel, TSA approved. I highly recommend this if your looking for something like TV this one.",
      "rating": 5.0,
      "verified": true,
      "author": "CYBERMANIA",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Easy and convenient to use",
      "text": "Really easy to move infant in and out of car. The stroller folds for storage quickly. I've been really happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "DynomiteGirl",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Id recommend",
      "text": "Very good stroller. The car seat is slightly hard to put a new born in though",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Almost perfect!",
      "text": "Carseat is heavier then most brands, other then that, love ❤️ it",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy Peters Friessen",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "She loves it!",
      "text": "This was a gift for my sister's first baby. She loves it and says she gets compliments all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great item",
      "text": "Easy to assemble. Car seat is easy to take in and out of the car and on to the stroller. The stroller is easy to un/fold. Car seat and stroller can get a bit heavy to lift. Stroller is easy to maneuver around.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "This is the best buy we have made for baby!!",
      "text": "LOVE this system! It makes everything so easy! This is our first baby and we decided to splurge a little on the travel system. No regrets whatsoever!",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great combo!",
      "text": "This stroller is amazing! Light weight , easy to fold, maneuvers easily!!",
      "rating": 5.0,
      "verified": true,
      "author": "Hilyb",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Easy to assemble",
      "text": "Haven’t used it yet. I ordered for my upcoming baby. But when we open the package, super super nice car seat combo. Comfortable and easy to assemble. Can’t wait to use it❤️❤️❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Vivian Wong",
      "helpful_votes": 0,
      "publication_date": 20201029
    },
    {
      "title": "So far so good",
      "text": "Set up was very simple and easy. Everything works just like it’s supposed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Pill Doctor",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Looks great and easy to install",
      "text": "We have not used it yet, but it was easy to install and it looks very flexible to use.",
      "rating": 5.0,
      "verified": true,
      "author": "B4uBy",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "They were registered at amazon.",
      "text": "Again a wonderful product. But my daughter won’t get to enjoy it because her beautiful baby girl died!",
      "rating": 5.0,
      "verified": true,
      "author": "Nsratchet1@comcast. Met",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Safety",
      "text": "Love it. Very easy to use. I just need to get it inspected by the fire department.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Crosby",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Great product",
      "text": "This product is worth the money!! Easiest assembly, great quality, and best safety. My husband assembled the stroller in less than five minutes. It’s easy to breakdown and easy to attach car seat also. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "michaela",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great",
      "text": "Very sturdy, though somewhat heavy to put in the car. I feel confident in using it though since it is so sturdy. Very easy to assemble and attach with carseat system. Glad I bought",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Best carseat/stroller for the money",
      "text": "Very versatile and easy to use product. The stroller is easy to maneuver, and doesn't seem too bulky to shop with. Carseat fits newborn baby safely, and is easy to adjust as they grow.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Madamba",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Compact stroller is great for apartment living",
      "text": "The carseat retains heat. My baby tends to be sweaty after sitting in it for too long. Not a great fit for a summer baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Anh T.",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "So easy to use",
      "text": "It’s perfect and easy to use! We love this combo",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen Miller",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Ease of use",
      "text": "Great car seat/Stroller travel set! Can’t wait for grandchild to arrive and use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne W. Ammons",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great Quality",
      "text": "I love how it easily maneuvers without any issues. Great quality, great choice for my newborn. Its pricey but good stroller set.",
      "rating": 5.0,
      "verified": true,
      "author": "Luda",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Love this",
      "text": "I absolutely love the car seat and stroller and combo I thought plan black would be to simple but after putting a head rest it’s perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Breanna ",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Easy to use and great quality!",
      "text": "Great quality and works wonderful for my 7 month old or almost 3 year old. Folds up nice and small.",
      "rating": 5.0,
      "verified": true,
      "author": "Hailey Starks",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Easy To Fold",
      "text": "I love the easiness of this system! The stroller is light weight, but the carrier is a little heavier that I would like! I like the easy to fold stroller the most, it makes it convenient when handling.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady TK",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Research what you buy before purchasing",
      "text": "Pulling the handle to collapse doesn’t always work - have to push the button then pull the strap.. shouldn’t be that way. Other then that I love it I feel the car seat is much safer then others I’ve used in the past",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Cruz",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Easy install",
      "text": "My wife and I love these!!! You won’t be disappointed!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Wilkin",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Sent me the wrong color 😔",
      "text": "It's an awesome product but im really disappointed that they sent me the wrong color. I ordered the dove color since black gets to hot and they sent me the Raven (black). Also the warning lables on the inside of the carseat can't be removed, it's just unattractive.",
      "rating": 4.0,
      "verified": true,
      "author": "Brooke Schmith",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Travel system",
      "text": "Love this system but do wish stroller had adjustable handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Dowdy",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Awesome car seat and system.",
      "text": "So happy we spent the extra money and went with this system",
      "rating": 5.0,
      "verified": true,
      "author": "Helissa Bell",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "I’m happy with it.",
      "text": "It’s super easy to open and close. Light weight and easy to maneuver. Car seat snaps easily into the base and stroller. Overall a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine ",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Awesome product!",
      "text": "I love this travel system! It is easy to use and I feel my baby is super safe in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Missing Wheels",
      "text": "Just ordered this stroller and received it 2 days ago. Only to open the box and realize the back wheels are missing.",
      "rating": 1.0,
      "verified": true,
      "author": "B huuh",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great product",
      "text": "The only thing that is a negative is... it’s too heavy. I guess it’s time to start building my biceps.",
      "rating": 4.0,
      "verified": true,
      "author": "Phyllis Aucoin",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Simply amazing",
      "text": "Britax B-Lively is a great stroller. I really cannot say anything negative.. Easy to use, lightweight and it has great materials.",
      "rating": 5.0,
      "verified": true,
      "author": "Giorgi Bakradze",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Here we come!",
      "text": "well made but very pricey! It is easy to fold and maneuver and safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Great Purchase!",
      "text": "So happy with this system! highly recommend. easy to put together & use. Love that its functional past the baby stage too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Great product! Highly recommend",
      "text": "Absolutely love this product. I did a lot of research before buying this combo and I am very happy with my purchase. It was easy to put together and is very stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Good quality",
      "text": "Very easy to maneuver, great that you are able to reach the basket from front, great storage area with zippers, beautiful looking stroller!",
      "rating": 5.0,
      "verified": true,
      "author": "Mina",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Light weight",
      "text": "Light weight. Bought for a friend and she absolutely loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181012
    }
  ],
  "product_meta": {
    "title": "BRITAX B-Lively Travel System with B-Safe Ultra Infant Car Seat, 2 Layer Impact Protection, Birth to 55 Pounds, One Hand Fold, XL Storage, Ventilated Canopy, Easy to Maneuver, Gris",
    "description": "Color:Gris| Style:Travel System B-Safe UltraCruise smooth with the B Lively & B Safe Ultra Travel System combining the Britax B Lively Lightweight Stroller, B Safe Ultra Infant Car Seat, and Britax car seat adapters in one convenient box. Featuring an all wheel suspension system for everyday easy strolling, the B Lively Stroller will not weigh you down thanks to its lightweight frame. Designed with multi tasking parents in mind, the 3 wheel configuration for smooth maneuverability and one hand quick fold make this Britax stroller easy to navigate and transport. The large UV 50+ canopy with breathable ventilation window provides protection for your child on sunny or rainy days, and has a large zipper pocket on the back, while the peek a boo window lets you check in on your little one without disrupting their nap. A near flat stroller infinite recline keeps them comfortable on the go. Before heading out, store your baby gear in the extra large stroller storage basket with convenient front access. The Britax B Safe Ultra Infant Car Seat is specially engineered with Britax's top safety technologies. In addition to the two layers of side impact protection, the patented Safe Cell Impact Protection System includes a steel frame, energy absorbing base, V shaped tether to minimize seat rotation and staged release stitches that slow and reduce forward movement in the event of a crash. Easy installation using SafeCenter Latch and built in lock offs makes it simple to secure the infant car seat base. You can also install without the base as needed using the European Belt Guide. The B Safe Ultra car seat is FAA approved without the base. Using the included Adapter, you can securely attach the infant car seat to the stroller to make a brilliant travel system that is perfect for your lifestyle. The B Safe Ultra Infant Car Seat can be used 4 35 pounds, height 32” or less. The B Lively Stroller can be used from birth to 55 pounds. Maximum unfolded stroller dimensions 33\" L x 23\" W x 40\" H. Interior seat width 11”. Infant Car Seat dimensions 17.75” W x 25” H x 30.62” D, harness slot heights 5.5 to 11 inches.",
    "rating": 4.7,
    "feature_bullets": [
      "Travel system includes B safe ultra infant car seat and base, B lively stroller, and car seat Adapters",
      "Surrounded in safety: car seat has 2 layers of side impact protection, steel frame, and Impact absorbing base",
      "Convenient features: one hand quick fold for easy transport, extra large storage basket, quiet peek A Boo window, and large UV 50+ canopy",
      "Relax & recline: ensure the best vehicle installation and accommodate sleeping children; install with LATCH to secure the car seat base or the European Belt Guide without the base as needed",
      "Fit: B safe ultra infant car seat rear facing 4 to 35 pounds, seat area 13 inches D, 8.75 inches W; dimensions 17.75 x 25 x 30.62 inches (wxhxd). B lively stroller birth to 55 pounds; maximum unfolded dimensions 40 x 24 x 39.5 inches (lengthxwidthxheight)"
    ],
    "specifications": {
      "Product Dimensions": "33 x 23 x 40 inches",
      "Item model number": "S05588100",
      "Is Discontinued By Manufacturer": "No",
      "Maximum weight recommendation": "55 Pounds",
      "Number Of Items": "1",
      "Style": "Travel System B-Safe Ultra",
      "Batteries required": "No",
      "Rear-facing minimum child weight": "4 Pounds",
      "Rear-facing maximum child weight": "35 Pounds",
      "Item Weight": "31 pounds",
      "ASIN": "B07FLRWKV2",
      "Customer Reviews": "4.7 out of 5 stars884 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#3,774 in Baby"
    },
    "categories": [
      "Car Seats & Accessories",
      "Baby Products",
      "Car Seats",
      "Baby",
      "Infant"
    ],
    "price": 449.99
  }
}