{
  "website_summaries": [
    {
      "verdict": "You'll save weight by not carrying fuel to run this option, but starting and maintaining a fire to cook by could be a problem, particularly in the rain.",
      "pros": [
        "Solely uses fuel such as wood, pine cones, and leaves",
        "Can add fuel without removing the pot from the stove",
        "Boils 34 ounces of water in 7 to 10 minutes",
        "Weighs 9.17 ounces, and broken down it measures 4.5 by 3.9 inches",
        "Made from stainless steel",
        "Stable, and easy to put together",
        "Includes a nylon carry bag"
      ],
      "cons": [
        "There is no solid alcohol option here",
        "cooking fire is dependent on what you can find to burn",
        "Does not come with instructions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hot burning little stove!",
      "text": "I didn't expect much from this stove...appeared to be to small to be very efficient. However, twice now I have boiled water for my lunch with it.....and both times I had water boiling within about 4 minutes....from when I lit the stove! As with any of these stick stoves, having dry fuel is the key. Bigger stoves can dry the fuel as it burns, with this small of a stove it won't be good at that. I bought this pot set to put the stove in...it just fits in the smaller one, fits nicely in the bigger one with room for other small goodies....",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 16,
      "publication_date": 20180827
    },
    {
      "title": "Compact, Sturdy - seems like a high quality stove.",
      "text": "I purchased for my Earthquake \"Prepper\" kit after reading that @StoneKettle had a \"burn anything\" backpacking stove he uses during hurricanes in Florida. Seemed like a great idea as backyard BBQ propane runs out eventually, but every home has a bunch of paper, wood, etc available to burn. Haven't actually used it yet, but it is sturdy and great build quality. Nests into a small 5x5x5\" box and hardly weighs a thing. Just big enough for a small 8\" skillet or 8 cup pasta pot.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin M. Hubbard",
      "helpful_votes": 10,
      "publication_date": 20181104
    },
    {
      "title": "Meh...I've seen better made",
      "text": "I purchased three of these type stoves, by three manufacturers on the same day. This is my least favorite of the three. It IS lighter weight than the others but it is because the metal it is made from is thinner. It is also unpolished leaving sharper edges. This can be a problem if you cut yourself during an emergency situation which is what I had planned to use it for. It is also smaller in diameter than the others I have purchased. Also the carry bag isn't stretchy and more difficult to take out and replace the stove. I wouldn't purchase this one again as the others were better made and at the same price point.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Farrell",
      "helpful_votes": 4,
      "publication_date": 20190526
    },
    {
      "title": "Like it.  Straight into the Survival Bag.",
      "text": "I like it. Wish it didn’t take up quite as much space, but it’s a nice little camp burner to go into my survival bag. I had a propane one before, but had to carry tanks in the bag too—didn’t like that. I tested this out with just a couple small sticks from my back yard and it boiled water fairly quickly. Obviously not as fast as the propane one, but quick enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 7,
      "publication_date": 20190110
    },
    {
      "title": "Metal frame need to be slightly thicker to make it perfect",
      "text": "Good concept little traveling stove. I like all pieces can fit inside the pouch without any issues. Pretty easy to assemble once you watched the video from the item page because like others mention no instruction what so ever comes with the box. Wish the metal was thicker to make it sturdier especially dealing with fire and cooking with it. The two pieces of metal that act as a stand definately need to be thicker. It's too thin in my opinion. It also slightly wobbles once placed correctly. Overall it's usable and a great idea for emergency usage.",
      "rating": 4.0,
      "verified": true,
      "author": "Shark BaitTop Contributor: Cycling",
      "helpful_votes": 4,
      "publication_date": 20190423
    },
    {
      "title": "Works well, good to have on a camping trip and around the house",
      "text": "The Vinida works well. It can bring water to a boil in about 4-6 minutes. The transverse arrangement makes for a solid base for cooking pots and kettles. I will always bring one on a camping trip as a backup. Another use for it is to help get things going in damp conditions. We were at a campsite, where it had rained, and all the wood was damp or wet. While we cooked on standard portable camp stove, we wanted to get a camp fire going. By concentrating the heat, and having proper ventilation, the Vinida was able to pretty quickly begin a hot fire that gave us enough coals for us to get a larger camp fire going.",
      "rating": 4.0,
      "verified": true,
      "author": "SciPub",
      "helpful_votes": 4,
      "publication_date": 20181118
    },
    {
      "title": "Easy to use - perfect addition",
      "text": "This was much smaller than I thought it would be, but it is perfect for heating water and making smores on camping trips. It came with a bag to carry all the pieces. It's very portable and doesn't take up much space at all. It's easy to get a fire going. Great addition to camping trips or to build a quick fire when your kids want smores.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Kennedy",
      "helpful_votes": 5,
      "publication_date": 20180903
    },
    {
      "title": "Poor quality inspection",
      "text": "The sheet metal was not properly polished after cutting and the edges are razor sharp. I missed cutting the extensor tendon of my middle finger by 1-2 mm. If I had been on a trail I would have had to call for help it bled so much. Buy it but you will need to handle with gloves for safety, and dont buy it as a present for someone without warning them.",
      "rating": 1.0,
      "verified": true,
      "author": "augustus",
      "helpful_votes": 3,
      "publication_date": 20190318
    },
    {
      "title": "Nice compact camping stove",
      "text": "The stove is light, easy to assemble, and is constructed with quality materials. The finish is a bit rough, so you may have to file it down in a few spots. But overall, pretty good! The fit into the carrying case is a bit tight. *** If you liked my review, please consider clicking the “Helpful” button. I try to do a good job on all reviews, and appreciate your votes. If you have improvement suggestions or comments, please let me know. Ask a question in the “Have a question?” space at the top.***",
      "rating": 4.0,
      "verified": true,
      "author": "Engineer D.",
      "helpful_votes": 3,
      "publication_date": 20190212
    },
    {
      "title": "Cool gadget",
      "text": "Really love this little stove! Like other reviewers have stated, there are no directions on how to assemble. Once I figured it out, I marked it for future reference. Got this as a backup for “camping indoors” when hurricanes hit and we don’t have power for several days. Just use it only outside though. Not sure if you could use it inside if you have a wood burning fireplace to set it in. Anybody try that yet? Fast shipping. Will definitely take this on a real camping trip in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "ABGM",
      "helpful_votes": 3,
      "publication_date": 20181007
    },
    {
      "title": "Nice little stove",
      "text": "While there were no instructions in the packaging, it doesn't take much to figure out how it goes together. It is not the smallest stove out there but it works well with the Stanley camp mug that I use.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 5,
      "publication_date": 20180811
    },
    {
      "title": "No gas!",
      "text": "I bought this camping stove for my upcoming treckin trip to the white mountains. I like the that it can be broken down to make it as compact as possible and that you don’t have to carry fuel with you. I am cautious of just using wood and kindling especially if it is wet conditions. The only thing I didn’t totally like about the product is that the metal seems a thin and it may break down after a few uses. After my trip I plan to report back on how well it worked.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20190117
    },
    {
      "title": "Works well enough",
      "text": "It works well enough, but it would have been really nice if some directions were included (to describe how it all fits together). It was not intuitive out of the box, but I was eventually able to figure it out. The air circulates well through the stove and causes wood to burn quickly. Definitely a lighter weight metal and could easily be damaged if not cared well enough. Anyways, it does what it should, but additional directions and clarification would be helpful.",
      "rating": 4.0,
      "verified": true,
      "author": "Braden",
      "helpful_votes": 2,
      "publication_date": 20180914
    },
    {
      "title": "The best",
      "text": "This is the most compact, easy to assemble stove. Amazing how sturdy it is!! Using it in our emergency go bag. When you start researching these portables, you will find this design easily allows you to add small pieces of wood, pine needles (my favorite fire starter) etc. Some stoves have the side opening right up against the top so you could burn your hand if your pot/pan is on the stove. Would be a hassle to have to take the pot/pan off to add to your fire. Not so with this one!! Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "You still need a way to start the fire!",
      "text": "It’s light , and easy to use. But it turns everything around it charcoal from the flames, my pot was originally red! It took 6 minutes to boil that pot of water. It burns whatever it’s sitting on also. It take a bit to cool off enough to put back in your pack, probably the second biggest issue besides the burning. As far as doing what it claims to do, it does that awesome. Just some nuances that makes this more of a campsite tool vs backpacking. The last picture Is coloring after fire. Still had great structural integrity after.",
      "rating": 4.0,
      "verified": true,
      "author": "Gavin Thomas",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Light Weight, Great Piece of kit",
      "text": "I now have this as my pack stove for my need it now coffee kit. While Sterno is slow, the whole can will fit inside the kit, and the box it comes in is a great additional layer of protection, this stove and my Stanly Cup make up my anywhere, anytime, Coffee Now kit. Thanks, and HOOAH!",
      "rating": 5.0,
      "verified": true,
      "author": "Crazy Compton",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "FELL IN LOVE",
      "text": "This is the best wood stove for camping there is bar none. I am spending 2 months in deep woods in Ohio, I brought along 6 small wood stove to test. This out shines every one of them. I also didn’t test this one, told myself what the heck; I will give it a chance. It won me over big time. Roaring fire and burns for a loooong time. I ride motorcycles and this is my go to wood stove. I do use a little gas canister for morning coffee. Buy, buy, BUY!!️",
      "rating": 5.0,
      "verified": true,
      "author": "Noel Stephenson",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Very Compact and useful for camping",
      "text": "I purchased this because it'll be useful for camping and cooking. Very easy to set up and it is light weight and compact. I was surprised at the quality of the material because the durability is much better than I initially anticipated. My only gripe and the reason I put the rating as a 4-star is because the one I received does not look entirely new and there are some scruffs and dark spots on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great Stove",
      "text": "I wanted a stove for bug out bag that I could get some leaves and twigs and have a fire instead of depending on propane containers (they make for heavier bug out bags). I am very pleased with this and I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "newbeginning",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Simple easy, hard not to like",
      "text": "This thing is pretty sweet, it is easy to set up and the wood burns well if you can get a good foundation. The vents on the under compartment keep the fire burning hot so heating a small skillet is not hard. Or i like simply laying hotdogs or a burger along the top no other tools required, unless you count the bun.",
      "rating": 5.0,
      "verified": true,
      "author": "Quin C.",
      "helpful_votes": 2,
      "publication_date": 20190216
    },
    {
      "title": "Perfect size for our family",
      "text": "So, I got this stove because I needed something small & portable that would still be able to cook sausages and hot dogs on a hike for my kids & husband. This is perfect! It was so small that the space & weight it adds is completely negligible. I’m so glad I found this stove-I can see us using this so much when we go out in nature!! It held up great as far as durability in our first use, so I think it’ll last for a while!",
      "rating": 5.0,
      "verified": true,
      "author": "Dara Brown",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Lightweight, easy to use.",
      "text": "Really surprised by how well it works. I'm not sure how long it will last but for the money it will serve its purpose. It isn't good for a tiny fireplace but is great for heating stuff up, you just have to constantly feed the fire with little sticks and stuff. Very light weight....also this means easy to knock over. I like it. Just need to file down the metal edges",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Murphy",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Bottom holes too large coals and burning twigs fall out the bottom",
      "text": "Assembles easily and fairly sturdy. Bottom holes too large - coals and burning twigs fall out the bottom. Too easy to overload the stove where combustion dies down and smoke increases. Handled 30 minutes of heat pretty well. No signs of heat warping. Cools quickly. Because the holes are too large you need to carry water to douse the coals underneath when done cooking.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert D.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Lightweight and functional",
      "text": "Box arrived in pristine condition but was missing a part. Customer service was super fast and helpful. Product is very lightweight but functional. SHARP EDGES so watch the kids! Work great for roasting hot dogs on a family picnic and the kids enjoyed gathering little sticks.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Leach",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Smaller than pictured",
      "text": "This was not as pictured...very very small. It came with no instructions.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 4,
      "publication_date": 20181018
    },
    {
      "title": "Camping Stove",
      "text": "Haven't tried it out yet. Will have to try it out before I have to really use it. It is smaller than I expected but I guess that is good since you need to travel light whether going camping or when using it during evacuation and survival.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Kuykendall",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Love it!",
      "text": "I got a small gas stove too, but figured I should have a wood burning alternative just in case. This little gizmo is an engineering genius. Okay, that may be over the top, but it assembles easily and works great. I couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mangetout",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "For building a small cook fire...",
      "text": "Make no mistakes here-this is three tin cups, albeit put together in a rather ingenious fashion. You have to build a fire underneath it; this requires constant supervision or it will go out before it cooks anything. That being said, why is this not the most popular way to cook something on the trail?",
      "rating": 4.0,
      "verified": true,
      "author": "Darren",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Portable stove",
      "text": "I bought this portable stove to use when I go camping. This stove is light and portable. The set up is not intuitive to set up so I had to check how this was set up first.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter T.",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Personal Camping Stove",
      "text": "I'm the only person in the family that's vegetarian so this camping stove is perfect for me. Its my personal camping stove. I can cook all my food separately now. I like how it came with a mesh bag to store all the items and it can also fit nicely in my backpack. I love it thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "Great camp stove",
      "text": "I got this as a back up stove for camping, and used it for cooking breakfast during my last camping trip. It is really easy to use! I like being able to be propane free during camping trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Nice Emergency Kit Addition",
      "text": "Got this for my emergency kit in cases where there is no electricity or gas for days. Very compact and disassembles into a small profile kit that can be taken with you on camping trips. As a just in case backup this comes in handy and gives a convenient option in emergencies.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "DO NOT BUY",
      "text": "the craftsmanship is horrendous! I cut my hand trying to just get it out of the carry bag. my son, with a pair of safety scissors, could have done a better job making a camping stove then this thing. every cut is sharp and jagged. sorry, but not worth the risk for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "It worked surprisingly well",
      "text": "When I received the package, I thought I probably just wasted my money. But, it actually turned out to work pretty well. You have to keep it on a brick or something, but for the price it was perfect. I used charcoal and it stayed lit pretty well. Didn't boil quite as quickly as the video, but worked much better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Que",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Easy, reliable, and convenient",
      "text": "This stove is awesome!!!! Typically I would use an fuel pocket stove but at times I would completely forget to get new canisters so it was a waste to bring. This is convenient because I just burn branches and material easily found around me. It cooks well and is easy to clean. I highly recommend it simply on the fact it's less maintenance and you have plenty of fuel.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody shenk",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "works great",
      "text": "what a camp cooker no gas powered, this baby does well with small sticks. Endless supply",
      "rating": 5.0,
      "verified": true,
      "author": "zonian79",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Light, light, light!",
      "text": "Worked like a charm. Will save on the weight when I go hiking next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Marco A. Rodas",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Great light weight stove",
      "text": "Loved this little stove. It Has a few quirks to get use to when using. Highly recommend using it before our backpacking or camping. The only other bad remark - wish there was a fiber mesh on the bottom to rest wood when starting a fire",
      "rating": 5.0,
      "verified": true,
      "author": "not listed",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "This is a cool little wood burning stove! Great price too!",
      "text": "I bought this as a gift for my brother who is a hiker on the AT.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Watts",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Naturally blazing!",
      "text": "So easy to use. I am surprised at just how quick the fire gets going. You will have to keep feeding the fire while you cook, but I love doing it. So nice to use twigs and sticks for cooking while camping.",
      "rating": 5.0,
      "verified": true,
      "author": "David J Heiser",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Useful for what it is",
      "text": "Compact. For sure. Quick to set up. Kind of. Hell of a useful little stove (when the need arises). Definitely.",
      "rating": 5.0,
      "verified": true,
      "author": "Leopoldo Farias III",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Sharp edges... It's better than a folding 5 dollar stove!",
      "text": "The knitted bag is cheap, and the stove is hard to put back in. It was a challenge to light with a ferro rod... Do able, but a challenge. The edges are sharp, I got cut",
      "rating": 2.0,
      "verified": true,
      "author": "G.R.",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great stove",
      "text": "Outstanding stove for back pack camping works great. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Portable Stove",
      "text": "LOVE the portability and the fact that I can use wood to cook with instead of having to buy fuel or candles .",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "zombie stove",
      "text": "bought it for the apocalypse-hope to never need it :)",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lettich",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Handy item for carrying when space is limited",
      "text": "Not heavy duty, but useful when cooking for one or two people.",
      "rating": 5.0,
      "verified": true,
      "author": "PEN NAME",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Works great.",
      "text": "Wanted a stove that was light weight and used twigs. This works great o have used it 5 times since it arrived. It is affordable and exceeds my expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Zedrea Off Grid",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Impressive little wood burner",
      "text": "Had doubts but this little guy really burns well and puts out the heat. Boiling water in minutes. Simple and compact.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Great product",
      "text": "Works amazing, boiled about 4 cups of water in about 10 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis J Wickersham",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Quality assurance issues",
      "text": "The product came with identical pot holder cross pieces and is not useable.",
      "rating": 2.0,
      "verified": true,
      "author": "John COle",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Worth the Price",
      "text": "Seems to be a Quality product, well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger A.",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great Compact Stove",
      "text": "Used for a couple hours seems to be holding up and air flow helps for big flames.",
      "rating": 5.0,
      "verified": true,
      "author": "AnonymousE",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Worked great.",
      "text": "Easy to get started. Easy to keep it going. Will be using it more and more.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Henning",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Very light and compact",
      "text": "Very compact and light, traveled well. No instructions, so it took a couple of minute to figure out assembly.",
      "rating": 4.0,
      "verified": true,
      "author": "Dominique Black",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Value!",
      "text": "So far it has exceeded my expectations for the price range. It's easy to load extra material in while it's burning to maintain the fire for a larger pots , and it's still stable while holding said larger pot for a bigger group.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Great!",
      "text": "Used on many trips. Light small and works great! Good for emergencies too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Be careful with this stove",
      "text": "Light weight, nearly every cut out is very jagged and dangerous.",
      "rating": 2.0,
      "verified": true,
      "author": "Hiker1078",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Good not great",
      "text": "Hard to keep a hot fire for extended time requires a lot of attention",
      "rating": 4.0,
      "verified": true,
      "author": "M Rubin",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Couldn't be happier of this purchase..",
      "text": "We are very happy of the small size and great fire to cook hamburgers on cast iron . Couldn't be happier with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Whitlatch",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "WRONG PIECES BUT...",
      "text": "Wrong parts sent. Great little stove. Mix up with the upper flats of metal that holds a pot or pan in place. I am sure it will be a challenge to get the correct one's :)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Good price, great design",
      "text": "Very light, very simple design, works very well . Will purchase more for emergency, for backpacking, hot cup of coffee while trout fishing.",
      "rating": 5.0,
      "verified": true,
      "author": "david v.",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "ok product",
      "text": "light weight and portable but a little bit small. well this is to be expected when buying something portable.",
      "rating": 4.0,
      "verified": true,
      "author": "YY",
      "helpful_votes": 0,
      "publication_date": 20190325
    }
  ],
  "product_meta": {
    "title": "VINIDA Camping Stove Backpacking Stove Survival Stove - Portable Lightweight Wood Burning Stove with Nylon Carry Bag for Hiking Climbing Fishing Picnic BBQ",
    "rating": 4.4,
    "feature_bullets": [
      "🔥【FREE FUEL & NATURE FRIENDLY】Wood Burning Camp stove uses twigs, leaves, pinecones and wood as fuel. Free up more space in your backpack and no more spending money on heavy, polluting and expensive white gas or liquid canister fuel",
      "🔥【EFFICIENT DESIGN & FAST BOIL TIME】Backpacking Wood Stove boils water(34 fl oz) in 7-10 mins. It creates clean gasification that causes a third combustion. It allows fuel to burn more completely with less smoke",
      "🔥【COMPACT & LIGHTWEIGHT 】Backpacking Stove weighs only 9.17 oz and 4.5\" Diameter, 3.9\"/7.45\" Tall (Packed/Assembled). It nests inside a Nylon Stuff Sack leaving you with more room in your backpack. It is suitable for 1-2 people use",
      "🔥【STURDY & EASY TO INSTALL】Made of premium stainless steel. The collapsible 4 parts are very easy to install and disassemble . The portable stove is even STABLE enough in windy conditions",
      "🔥【WHAT YOU GET】1 x Wood Camping Stove,1x Nylon Stuff Sack, You don't have to worry about any quality problems. Our products have passed strict quality inspection. Please feel free to buy. If you have any questions, please contact us."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "4.8 x 4.7 x 4.6 inches; 8.01 Ounces",
      "Date First Available": "December 21, 2017",
      "Manufacturer": "VINIDA Direct",
      "ASIN": "B07F8PFQ53",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Stoves & Grills",
      "Sports & Outdoors",
      "Camping Stoves",
      "Camp Kitchen",
      "Camping & Hiking"
    ],
    "price": ""
  }
}