{
  "website_summaries": [
    {
      "verdict": "Easy-to-use sensors affix to the end of the club grip, accurately measuring swing analytics.",
      "pros": [
        "With the data from the sensors, golfers can figure out their strengths and weaknesses",
        "Uses a smaller and lighter size of sensor, so it shouldn’t affect your swing negatively",
        "All data is transmitted to a smartphone app, so you always have it available",
        "App will make suggestions for how to play particular shots based on your swing data"
      ],
      "cons": [
        "Pricey",
        "Takes a bit of tech know-how to use it properly and gain the most benefit from it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Why didn't I buy this sooner?",
      "text": "I've played 4 rounds with this system so far and can already see how this will improve anyone's game. It took like 5 minutes to set up and download the course and then you just play and it records all your shots. Then after the round, you get a ton of stats back that are super helpful. Have gotten my club distances dialed in and constantly using the rangefinder to get plays-like distances during the round. I've just unlocked the Caddie feature so I'm sure that's a game-changer too. My only question is why did I wait so long to get this??",
      "rating": 5.0,
      "verified": true,
      "author": "GolferGirl",
      "helpful_votes": 12,
      "publication_date": 20180927
    },
    {
      "title": "Not happy and will probably send back for refund",
      "text": "Somehow my round of 83 today became a 55 in the Arccos app. Totally unsatisfied with this system. Technology is not ready for prime time.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey Bergman",
      "helpful_votes": 10,
      "publication_date": 20190215
    },
    {
      "title": "What a waste of time.",
      "text": "Tried to pair 4 different sensors including the putting sensor, non worked. Luckily they offer very detailed trouble shooting such as \"don't be alarmed if the club pairs very fast\" due to their advanced technology... What a joke, I'll be returning these.",
      "rating": 1.0,
      "verified": true,
      "author": "Kirk Erickson",
      "helpful_votes": 5,
      "publication_date": 20190810
    },
    {
      "title": "Love it (mostly)",
      "text": "An amazing idea and the most useful info on shot statistics. Plus, it comes with an accurate gps golf program to see the course while playing and record scores. Once it starts giving caddie recommendations based on my shot history including wind and elevation consideration, you see how ambitious this product is. Because of that it is complicated and distracting while playing. Editing shots at first is cumbersome and battery usage is way too much but I'm getting familiar now so it is getting better. Bottom line - I needed real world distance expectations for each club and this is the only way to get it.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Druce",
      "helpful_votes": 2,
      "publication_date": 20190618
    },
    {
      "title": "Still up in the air",
      "text": "I purchased these as a last-minute Father's Day! My husband loved them at first and just had a few things to work through. He has an android and it was a little hard because the phone must stay on the whole time. We worked through that issue. We had to buy a special putter sensor because his shaft was not hollow. We didn't mind doing that but now - all of the sensors are falling off into the bottom of the bag. We are still up in the air but maybe returning unless we find a solution.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Coggins",
      "helpful_votes": 2,
      "publication_date": 20200807
    },
    {
      "title": "If you like golf you should get these",
      "text": "After thoroughly researching the reviews on these I expected a good product with minor flaws. I took them out for the first time today and am blown away. The GPS tracking is ridiculously accurate and I had absolutely no issues with any shot being picked up by my galaxy note 9, even on putts which I've read to be an issue sometimes. I know it's only one rd but after seeing what these sensors and app can do I'm excited to get out there and keep using it to get the caddy tools. Wish I had a couple more hands so I could give arccos 4 thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "kegemo34",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Great Purchase, Accurate and Great Feedback..",
      "text": "Pairing takes some patients as some sensors will pair right away some take a little moving around. But all paired with my outdated galaxy S7 edge. On the course out of 2 18hole rounds and 203 strokes I only had about 6-7 shots not register, but I look at phone after every shot, and had to manually entered club(not distance) easy. When putting make sure to mark flag location(I just stand by hole and hit mark flag on screen). Overall I think this is a great tool for helping get my handicap below 25+. Also I make sure to run sensor diagnostic prior to leaving house to make sure each club is still paired.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth A Lyman",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Worth it",
      "text": "I love this, at first I was hesitant on buying this because of some reviews but I went ahead and took a risk. Never turning back! One of the bigger things brought up was having to play with phone in pocket. I’m a female and 9/10 I’m playing in a skirt and I have the iPhone 8 Plus. I didn’t mind it at all. I’m now playing smarter and have shaved off a few strokes. Couldn’t be happier! So far I’ve only played 3 rounds with it but I can’t wait to play more with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bianca",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Overall does the job",
      "text": "i use mainly to determine club distance. But, for scores...way too many error's that occur when clubs bang or practice swing or putts. Also, really need to only use with phone in pocket.....apple watch does NOT work properly..... will get the new sensor when comes out shortly.",
      "rating": 4.0,
      "verified": true,
      "author": "Verified Consumer",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Not good for Android",
      "text": "It much luck syncing with pixel 2XL phone. Half the clubs won’t register during a round, Friends who use this product with iPhone seem to be havin better luck. Want to return the product,",
      "rating": 2.0,
      "verified": true,
      "author": "kathrin krosbakken",
      "helpful_votes": 4,
      "publication_date": 20190615
    },
    {
      "title": "Not worth the price!!",
      "text": "It’s a great idea, but the technology is not there. I’ve played over 10 rounds with the sensors. Not one round has been accurate. I’ve done all the trouble shooting and it’s still very inaccurate. I find myself stressing over trying to get it to work and editing shots, rather than focusing on my round. Customer assistance is a waste of time if you try them. All they do is say you are using the product incorrectly. If you buy one. Good luck, and hope you have better luck than I have.",
      "rating": 1.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Arccos Caddie does not detect many shots.",
      "text": "I found the Arccos system to miss as much as 10 shots during a round of 18 holes of golf. Most are missed putts, but I had a sand shot, a 7I shot on a par 3, and 2 chips missed during a round. You must catch the errors quickly to avoid complicated edits following the round, which increase errors for statics calculations. Watching for errors caused delays to start the next hole, so I impacted the pace of play for my foursome. I was so distracted by checking the phone that my golf game was made worse since I was not focused on my upcoming shot.",
      "rating": 2.0,
      "verified": true,
      "author": "steve ivey",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Awesome!  (but doesn't work at night, twilight)",
      "text": "Awesome! (but doesn't work at night, twilight). Great data. Easy to use. Slightly annoying to look at the screen when you have to keep putting the phone in your front pocket for the swing, then pull it out in order to see the distances, etc. Helps a lot to use with Apple Watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great device for helping on being a better golfer.",
      "text": "if your breaking down a round after you played and looking where you lost and gained shots this is a must, i love the feature of looking at hole history and your shot overlay, breaking down your Handicap it will tell your your weakest section and area to focus on. i love all the stats from Driver to GIR and the new added this year of Slope and wind is great as i was almost going to but a range finder with slope for 500 but this does all that and more for only 200, Great investment for someone who is a stat Nerd or Just looking to improve there Game",
      "rating": 5.0,
      "verified": true,
      "author": "meredith mccarthy",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Happy with my purchase and the performance.  It has helped improve my game.",
      "text": "We have about 15 rounds posted with Arccos now and am now beginning to get true distances on my clubs. I am pulling different clubs now and feel g better about my distances. There is always some level of editing required but over time they become easier to apply. Keeping the phone in my pocket is not the problem I assumed. Looking forward to getting 60/70/80 rounds in and truly seeing the gaps in my irons and beginning to use the caddy function with more confidence. I love the product. I have offered the need for a more dynamic score card which I hope they are working on.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Boyd",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Not worth the $$$ but will be good one day",
      "text": "Great idea, technology still has a long way to go, if you miss one shot that doesn’t read your round will be inaccurate the rest of the way very difficult to edit and operate. Also takes a lot of focus away from actually playing.",
      "rating": 3.0,
      "verified": true,
      "author": "Vintage Landscapes LLC.",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Game Changer",
      "text": "Provides accurate distance and maintains decent stats on your club usage. Only downside is the drain on the Apple Watch, but it has become better over the last round played. Started with 100% battery and ended with 14%. Looking forward to getting more play and better stats as time goes on. The app and website interface are great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "DAK",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Completely upped my game!  Love this device.",
      "text": "Cannot believe how simple this is to use and how effective it has been in upping my game! I enjoy golf, and have a good swing from playing field hockey my whole life. My challenge has been some days I crush the course, and others it crushes me. With this device, I feel like I have a personal caddie and will never look back. This product is a must give this holiday season.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "Disappointed",
      "text": "The first round I played was pretty decent. Only missing a few shots here and there. The app isn't extremely easy to add shots when missed which isn't ideal. The second and third round I played while trying to use these only lasted about 3 holes before I shut off the app because they shots were tracking randomly and the app froze on the second hole and wouldn't let me move forward. I contacted support but they were not very helpful. Same cookie cutter answers as the FAQ page.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris B",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "I love it and my profile switched to my new phone no issues",
      "text": "I love the app, having to keep the phone in my front pocket or on the belt clip is a bit in the way but I understand why. its extremely accurate and the only time i have issues is when its my phone not the app. No complaints. I will probably buy the Cobra clubs that come with them next time purchase clubs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Could of been good....",
      "text": "Bought these for my husband. Big golf “pro”. We were all excited to use and while we were pairing we discovered one didn’t work and one had paired to the wrong club. Big disappointment for me. But I wrote the company and started the return. They refunded my money with no problems. I may try again later. So far I haven’t.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Sabado",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "The best thing to happen to golf in a long time",
      "text": "This is the best thing to happen to golf in a long time. I’ve tried many other devices such as launch monitors and GPS to get an idea of how far I hit my clubs...Arccos does everything better. I can look back at my round to see how far I hit a club on a specific hole. I can plot my distance to carry a hazard. The more I play, the more accurate Arccos becomes.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Reader",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "As Advertised!",
      "text": "Great app for learning both the yardage of your clubs and distance to pins. I am a very average golfer and am learning how to measure my swings and understand the associated distances. This app is a recorder on the course. It is my note keeper! Try it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tennessee Reader",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Definitely a game changer",
      "text": "Have only played 2 rounds with it so far and based off of my first round I was already getting club suggestions in the second round. Made me feel more confident in the club I had in my hand. As I play more round the yardage will get more precise and it will be even better. So far I am extremely happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Pro",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Game Improvment",
      "text": "First off I must say customer service is second to none. Prompt reply and knowledgable staff made the transition to a new way of following your progress seemless. The system preforms as advertised it's all all the data you could ever need. Do a serch utube and you can see all features and reviews. I highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "mead51",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great!",
      "text": "Purchased for my husband to surprise him just for fun. He went absolutely nuts. He loves these! He said it really helps him focus and improve his scores each time he plays. They look and fit perfectly and we have yet to find a course that isn’t on the app, private or community. A really nice gift!",
      "rating": 5.0,
      "verified": true,
      "author": "HCO",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great data system",
      "text": "Love having the Data on my game being recorded and compiled. Really helping my game at both a club level and course level.",
      "rating": 5.0,
      "verified": true,
      "author": "brian d. mcdonell",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Terrible to sync",
      "text": "Have had major issues with this product. Need to have your phone on you while you golf and have been giving me inaccurate readings. I’d love to think I have a 380 average drive......but I don’t think it’s accurate",
      "rating": 1.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "One of the sensors doesn't sync",
      "text": "One of the sensors is malfunctioning and doesn't sync to my club. I would like for then to send a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Gina N.",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Love the accuracy of this product",
      "text": "So far I love this product! Well worth the money. I can’t wait to start taking advantage of the caddie features, still need to get my first 5 rounds in.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Long",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Best System I've Found",
      "text": "Been through a lot of these products. Works the best! Always great products and reasonable prices. A+ from Me!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Its great knowing the averages of each club",
      "text": "I don’t like having to carry my phone but I pre-ordered the clip on sensor, everything else I love",
      "rating": 5.0,
      "verified": true,
      "author": "K Grate",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Works great, takes a little getting used too",
      "text": "Works great, had an issue with the watch app being stuck on a course I played weeks ago, but uninstalled and reinstalled app and it was all good",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny B",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Overall good",
      "text": "The app itself is helpful even if you are not tracking shots. GPS is not perfectly accurate. Doesn’t seem like a huge deal but it attempts to track to the yard. This is especially noticeable on the greens where GPS will jump around. Overall interesting but I would wait a few years until things are really accurate",
      "rating": 3.0,
      "verified": true,
      "author": "Robert T",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "It doesn’t work.  It makes playing golf a chore.",
      "text": "Unreliable. Recorded almost half the shots. Be prepared to spend all round on your phone, correcting for what it missed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen S.",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "Stats overload",
      "text": "It tracks everything but runs your phone down. Does not work well with my iwatch.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "A must have for any golfer!",
      "text": "This was a present for my golf fanatic dad for Christmas. He is obsessed with it. Easy to set up and super accurate. Recommended to any golfer who wants to accurately track their game.",
      "rating": 5.0,
      "verified": true,
      "author": "Tayler Young",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "The best product out there.",
      "text": "I must say well worth the only! If you are trying to understand the analytics behind your success and failures, this product will definitely provide that. I am blown away by how deep it dissects your rounds and overall play.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Hydro",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Keep it in the front pocket so it works well!",
      "text": "Really nice to see your round depicted graphically with all the distances. Still learning how to interpret all the stats but the information is great. It doesn’t really get my putts that well but it’s ok, I can generally add them manually.",
      "rating": 5.0,
      "verified": true,
      "author": "Ignacio Giraldo",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Easy to use!",
      "text": "Easy to use, easy to install and awesome functionality. Love reviewing my stats after each round.",
      "rating": 5.0,
      "verified": true,
      "author": "Maximo G.",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Easy setup - improves focus on game",
      "text": "I really like this system, I start my round and don't look at it much during play but it really helps me to focus on my game and to work on the weakest parts - like approach shots for me! The visuals are awesome and I find it very accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Accurate",
      "text": "Easy to use and very accurate. Great numbers and assistance with finding yardage and the caddie feature is top notch",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon P.",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "I enjoy the Arccos system",
      "text": "The Arccos Caddie is great tool to track your shots, I have had a few shots that were not picked up by the app but overall I enjoy using this system.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel colon",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Works awesome",
      "text": "The way it automatically keeps score and the way it works with the Apple Watch",
      "rating": 5.0,
      "verified": true,
      "author": "Red R",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Awesome",
      "text": "This thing has helped my golf game so much it’s like having a caddie in your pocket",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Merlino",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Must have",
      "text": "Arccos let you understand your game more and help you to lower your score",
      "rating": 5.0,
      "verified": true,
      "author": "pkoon",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Easy to use",
      "text": "What you see is what you get.. very accurate sensors.. that give you a lot of information to improve your game",
      "rating": 5.0,
      "verified": true,
      "author": "ARRAGON F.",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Great Purchase!",
      "text": "Love the Arccos cobra connect smart sensors and the smart caddie! I hope they add a range function eventually or a practice mode to help review swing patterns.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris P.",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Good for tracking and distances.",
      "text": "So far so good. Only 3 rounds in but it’s working well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Very helpful",
      "text": "Very easy to use. After a few rounds already learning more about my game",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Pecoraro",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Works  flawless for me",
      "text": "Love this system gives me great insight on what clubs to hit, what I need to work on",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190320
    }
  ],
  "product_meta": {
    "title": "Arccos Caddie Smart Sensors Featuring Golf's First-Ever A.I. Powered GPS Rangefinder",
    "rating": 4.4,
    "feature_bullets": [
      "Winner of four-straight Golf Digest Editor’s Choice Awards for “Best Game Analyzer, ” Arccos Caddie is golf’s first and only fully-automatic performance tracking system. It features 14 sensors, one for every club in your bag.",
      "Access to the award winning Arccos Caddie app, golf’s Smartest Caddie.",
      "Automatic shot tracking, hands-free fully automatic data capture.",
      "A. I. Powered GPS Rangefinder, first-ever rangefinder that adjusts in real-time for wind (including gusts), elevation, temperature, humidity and altitude providing the most precise yardage in the game the Arccos Caddie Number.",
      "Personalized Caddie Advice that leverages A. I. to provide you with your optimal strategy.",
      "Smart Distance Club Averages, know how far to actually hit all your clubs so you select the right one for every shot.",
      "Advanced Analytics powered by strokes gained providing personalized performance breakdowns to guide practice and equipment choices.",
      "Includes a 1-year subscription valued at US$99. 99."
    ],
    "specifications": {
      "Date First Available": "January 31, 2020",
      "Manufacturer": "Arccos Golf",
      "ASIN": "B084DWXN7T",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Golf Course GPS Units",
      "Sports & Handheld GPS",
      "Sports & Outdoors",
      "Electronics",
      "GPS, Finders & Accessories"
    ],
    "price": 179.99
  }
}