{
  "website_summaries": [
    {
      "verdict": "The Nike Flex TR 8 received a lot of positive feedback from shoppers who liked its overall appearance and available color options. It was also said to be a very comfortable Nike trainer for most types of gym workouts.",
      "pros": [
        "Almost all of the consumers commended the style and colorways of the Nike Flex TR 8",
        "The comfort offered by the trainer exceeded the expectations of many users",
        "According to numerous wearers, the shoe was true to size and width",
        "Plenty of gym-goers claimed that the footgear was great for various types of workouts because it provided adequate support",
        "The lightweight and breathable upper was lauded by a fair number of owners",
        "Some reviewers liked that the merchandise was quite flexible"
      ],
      "cons": [
        "A couple of individuals were dissatisfied with the mesh upper because they thought it was too thin and felt rough"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.0,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Get wide even if you have narrow feet",
      "text": "I have narrow feet but decided to get wide for the first time and what a relief! I am on my feet for 10 hours at work, and at the end of the day my feet always hurt due to swelling. I gave 4 stars because there is no arch support. After I inserted Dr. Scholl's work massaging gel insoles, they feel like walking on clouds!",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Bubbles",
      "helpful_votes": 10,
      "publication_date": 20190724
    },
    {
      "title": "A little narrow in the toe area.",
      "text": "I have had 2 pairs of Nike Flex 4.0. They are hard to find now and thought I would try this one as an option. They are comfortable but they are more narrow in the toe area. I wear an 8 medium, and this is my only problem with the shoe. I do cross training and outdoor walking.",
      "rating": 4.0,
      "verified": true,
      "author": "Lucia Peck",
      "helpful_votes": 11,
      "publication_date": 20190105
    },
    {
      "title": "Good shoes!",
      "text": "This is my 2nd pair and I love them. Took me awhile to find them because they're not the newest model anymore. I was concerned because the shipping notification showed up as a t-shirt and not shoes, but they were perfect when they came in",
      "rating": 5.0,
      "verified": true,
      "author": "CFam",
      "helpful_votes": 5,
      "publication_date": 20190701
    },
    {
      "title": "Nice shoes",
      "text": "I bought these as a gift for my wife. She really liked a previous version of these shoes. They fit just as expected. She really likes pattern and material on the upper.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 7,
      "publication_date": 20190413
    },
    {
      "title": "Very good fit",
      "text": "These are very comfortable shoes. I have plantar fasciitis, so wear half-length arch supports and with them, these are the perfect shoe. I love the color, too!",
      "rating": 5.0,
      "verified": true,
      "author": "MrsKK",
      "helpful_votes": 5,
      "publication_date": 20190528
    },
    {
      "title": "Comfortable, looks great",
      "text": "Fit is good for length but they are a little snug for width around the middle and arch of the foot. Comfortable otherwise. I'm sure the will stretch as I wear them more.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachaelw_08",
      "helpful_votes": 5,
      "publication_date": 20190412
    },
    {
      "title": "Narrow",
      "text": "I've had previous versions of this shoe and found them extremely comfortable and durable. They seem to have changed the shape of the shoe, with this version. It looks longer and is narrow across the bridge of my foot. Just not comfortable and kind of weird looking. Sending back and going to search out an earlier version. I use this for circuit training.",
      "rating": 3.0,
      "verified": true,
      "author": "SWN",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Super comfortable! Great walking sneaker!",
      "text": "I really like this sneaker. I walk around 3 miles for work everyday comfortably and blister free !",
      "rating": 5.0,
      "verified": true,
      "author": "R.W",
      "helpful_votes": 2,
      "publication_date": 20190701
    },
    {
      "title": "Comfort & Style",
      "text": "Love these shoes! Super comfortable and very stylish on. I have narrow feet so sometimes shoes can feel too wide but these fit great and provide wonderful support. They were even comfortable the whole first day that wore them! I have not done any high impact exercising in them but I am on my feet all day and these shoes have felt great.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie V.",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Uncomfortable, Sent back",
      "text": "I have several pair of Nike training shoes and love them. There was something wrong with these. I couldn't get through one fitness class wearing them. They were so uncomfortable. I gave them a second try hoping I just needed to break them in. Still incredibly uncomfortable. I believe they were flawed because I do love my other Nike shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Logcabinmom",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Definite Like!",
      "text": "True to size like all of my previous Nike shoes. My only dislike- it doesn’t have a loop on the back of the shoe. I think most use that loop for hanging, but I use it to put on my shoe lol. Color is awesome! (Gray and purplish blue/violet)",
      "rating": 5.0,
      "verified": true,
      "author": "JustDrea",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Too small",
      "text": "I have naturally narrow feet so I never have to order wide shoes. However when I tried the shoes on they were so tight on the side it was giving my feet cramps.",
      "rating": 4.0,
      "verified": true,
      "author": "Sara Hawley",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Good shoe but narrow toe box",
      "text": "Good looking shoe. Does seem a bit tight in the toe box and around the width of the foot.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruth Zwieg",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Comfortable",
      "text": "My favorite shoe for exercising and walking will purchase again",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Clark",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great quality and fit!",
      "text": "I love these shoes! I wear them out at the gym and buy a new pair. I wear them for lifting and cardio at the gym!",
      "rating": 5.0,
      "verified": true,
      "author": "HeatherB",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Nice shoe",
      "text": "The insole was cut a little smaller than the inside of the shoe, but i just replaced them with gel insoles since i use these for work shoes, probably not a common thing to happen.",
      "rating": 3.0,
      "verified": true,
      "author": "Lesa Brassard",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Disappointing",
      "text": "The fit was way too small. Quality not what I expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Kally",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Just like the first pair I had",
      "text": "I had this exact shoe and wore them completely out. They are a couple of versions out of date so I was happy to find exactly what I wanted on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth L Mathews",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "They fit , and we’re comfortable right off",
      "text": "I’m so thankful these shoes came so quickly , I’ve never ordered shoes online, and to my surprise they fit perfectly , now I’m out walking again, thank you",
      "rating": 5.0,
      "verified": true,
      "author": "christine nicolulis",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Fitness",
      "text": "I Jazzercise and needed new shoes. I have a hard time finding my small size (5.0) and it seems I could only find it online. The shoe fits perfectly and It feels great when I do my workout. Since I jump around alot, the shoe has it great.",
      "rating": 5.0,
      "verified": true,
      "author": "Elenita V.",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Love Love Love",
      "text": "I’m in love with these trainers! I usually wear running shoes but really needed this type of shoe for my workouts. They fit great. Look great, even with jeans or capris!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Foster",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Poor quality “NIKE” shoes",
      "text": "These now have holes in both front toes. This has never happened to me before these shoes. I t makes me wonder if they are counterfeit?",
      "rating": 1.0,
      "verified": true,
      "author": "SUSAN G.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Good fit!",
      "text": "I love the shoes! They are perfect for yoga or cross-training. I would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Comfortable overall but narrow in toes",
      "text": "Light weight nice. Maybe too narrow at the toes for most people",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin L. Bryant",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "ok",
      "text": "only had these about 2 months and already has a hole from my big toe rubbing the inside",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany Farley",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Runs small",
      "text": "Light weight but I needed a whole size larger than my normal size in tennis shoes",
      "rating": 4.0,
      "verified": true,
      "author": "Alyssa Ferguson",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Review",
      "text": "Every pair of Nike I buy I always wear a size 10. These however dont fit right. Have me wondering are they real Nike",
      "rating": 1.0,
      "verified": true,
      "author": "Taunya Hicks",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "It’s a Nike Sneaker",
      "text": "Fit as expected for Nike’s narrow because wide is not offered but support is good",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Practically perfect in every way.",
      "text": "Fast delivery. Exactly as advertised. Very happy with these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Very comfy",
      "text": "Only had them a week but I have worn them every day to work and they are comfortable .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Know if you need a wide or not!",
      "text": "I like the color of my sneakers! I had to get a little bit bigger for a broken ankle!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Anderson",
      "helpful_votes": 0,
      "publication_date": 20190628
    }
  ],
  "product_meta": {
    "title": "Nike Women's W Flex Trainer 8 Fitness Shoes",
    "description": "Trainers woman Nike w Nike flex trainer 8 924339-500.",
    "rating": 3.9,
    "feature_bullets": [
      "Lightweight, Flexible Foam Cushioning",
      "Ultralight, Super-Strong Flywire Cables Integrate With The Laces For Exceptional Support As You Move From Side To Side.",
      "Outer Material: Synthetic",
      "Inner Material: Manmade",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Heel Type: Low-Heel , Wedge",
      "Shoe Width: Medium",
      "Deep Grooves And A Tri-Star Pattern Allow The Sole To Flex Naturally With Your Foot. Rubber Pods In High-Wear Areas Offer Durability And Multi-Directional Traction.",
      "Durable Mesh Provides Lightweight Breathability When Your Workout Heats Up.",
      "Foam collar for comfort around your ankle"
    ],
    "specifications": {
      "Date First Available": "4 Jun. 2014",
      "Manufacturer": "Nike",
      "ASIN": "B07G7F7MYZ",
      "Item model number": "924339",
      "Department": "Women's"
    },
    "categories": [
      "Indoor Court Shoes",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 79.79
  }
}