{
  "website_summaries": [
    {
      "verdict": "If you love lattes and solid drip, the Ninja Cold Brewed System is worth the price.",
      "pros": [
        "The Ninja Hot and Cold Brewed System brews lots of tasty drip fast",
        "It brews in multiple sizes",
        "It has a milk frother for latte-style drinks",
        "It uses a separate filter for tea",
        "It's compact and attractive"
      ],
      "cons": [
        "It brews a little hot and a touch bitter",
        "Its cold brew mode lacks flavor and strength",
        "There's no manual setting for custom brews"
      ],
      "aspects": {
        "Performance": 7.0,
        "Design": 7.5,
        "Features": 8.0,
        "Maintenance": 7.5
      },
      "publication_date": 20190503,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Amazing!",
      "text": "I made my first cup of coffee and I’m totally in love. The simplicity, flavor, texture, versatility are unbelievable. I can’t believe I had to be “sold” to try this and to consider giving up my K cups. I have both brewers set up and one is being unplugged and given away because of my Ninja. I feel like a barista (without any training). Even the frothing and cleanup is a breeze. A few extra minutes is well worth it. I can’t wait to make every possible combination of tea and coffee beverages.",
      "rating": 5.0,
      "verified": true,
      "author": "Shari",
      "helpful_votes": 118,
      "publication_date": 20181130
    },
    {
      "title": "Coffee tates like Plastic and chemicals",
      "text": "while this Machine is nicely built and functions without any Problems, I noticed a strong chemical Smell from the Through brew Lid and the Seal from the Carafe which also transfers to the Coffee. However, if I brew without the Lid directly into the cup, the taste is pure coffee. Contacted Ninja Customer Service and was told I would receive a Return Shipping Label and the Machine would get replaced, I never received the Label. Even after placing 3 Phone Calls, they don't seem to be capable of emailing a simple Label! On a side note, I do receive promotional emails, so I know they have the correct email Address! I will return the Product and shop a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 98,
      "publication_date": 20181201
    },
    {
      "title": "Great, wish there was a hot plate",
      "text": "Love everything besides the fact that there's no hot plate. The steel pot keeps it warm for a good amount of time, but if you like your coffee hot and not warm, a plate would help.",
      "rating": 4.0,
      "verified": true,
      "author": "Arkie",
      "helpful_votes": 67,
      "publication_date": 20181202
    },
    {
      "title": "Item arrived defective",
      "text": "Is it true that people only tend to write reviews when they've had extreme positive / negative experiences (bear in mind too that I'm grumpy since I DON't HAVE A COFFEE MAKER lol)? Yes it is!! So.....followed directions, it began heating, moved maybe 2 oz of water....then stopped.....never to heat again. Ninja customer service agreed that it was defective....so I am shipping it back....Amazon return. I'm rolling the dice...going to try the sister model....with the glass carafe.....worried too much about cool down coffee.",
      "rating": 1.0,
      "verified": true,
      "author": "B. Davis",
      "helpful_votes": 40,
      "publication_date": 20181215
    },
    {
      "title": "Bad Coffee!",
      "text": "I too wanted to love this coffee bar. I used it for a month and returned it. It is a jack of all trades and master of none. Tried the Rich, Classic, and over ice settings and the flavor was awful on all of them. I made some adjustments on amount of coffee and grind to no avail. I am a good coffee connoisseur and use fresh beans, grind them myself, and use filtered water so quality should no be the issue. It was also cleaned and several pots of water run through to no avail as well. Still bad tasting coffee. Not impressed!!",
      "rating": 2.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 6,
      "publication_date": 20191007
    },
    {
      "title": "Thermal carafe doesn’t keep coffee hot for long",
      "text": "Returned after one day. I didn’t know that the one with the thermal carafe does not have a hot plate. My coffee is usually made an hour before I get up so that my husband can drink a cup before he goes to work, usually my coffee is hot enough that when I had cream it is still hot. This is not the case with the thermal carafe, my coffee was barely lukewarm once I added cream.",
      "rating": 2.0,
      "verified": true,
      "author": "MCook",
      "helpful_votes": 7,
      "publication_date": 20190919
    },
    {
      "title": "Disappointed",
      "text": "I had the first Ninja Coffee Bar with the glass carafe and loved it. Thought I would purchase the newer version so I could make tea as well. The thermal carafe does not keep the coffee hot. The frother does not seem to work as well as my previous Ninja. I am very disappointed in the product. Glad I kept my older one so I can go back to using it after returning the new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 10,
      "publication_date": 20190606
    },
    {
      "title": "Bad wiring?",
      "text": "Would be the best coffee bar i ever had.. Except... the milk frother short circuits the entire unit, making it unuseable/scary (Definate defect in the machine not my outlets)",
      "rating": 1.0,
      "verified": true,
      "author": "GalaxySurfer™",
      "helpful_votes": 10,
      "publication_date": 20181213
    },
    {
      "title": "Coffee gets cold too quick",
      "text": "This model has no heating plate for the carafe. I’m returning it and getting the model with the glass carafe and burner. What is the sense in being able to make a full pot of coffee if you can’t keep it hot? The carafe is stainless steel but I brewed a pot this morning and by the time I came back in from walking my dog it was already almost cold. I would only buy this model if you plan on making ice coffee or single cups for the most part. You also can’t change the temperature on this one!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190915
    },
    {
      "title": "DO NOT BUY THIS!",
      "text": "Just received today. Followed cleaning instructions, etc. It won't work. I called tech support only to find my NEW product isn't working! He'll send a replacement part!! No thanks. It's going back immediately. I'll never buy NINJA product again!",
      "rating": 1.0,
      "verified": true,
      "author": "Richard R.",
      "helpful_votes": 6,
      "publication_date": 20190430
    },
    {
      "title": "Works great, for a little while.",
      "text": "It worked great for a few weeks. Then the water container started leaking. You need a bottle scrubber to clean the carafe, because it says do not put in the dishwasher. I haven't had to run the cleaning cycle yet. This seems to be the marketing strategy of ninja. They make innovative products that work ok for a while. They seem to all be manufactured as cheaply as possible. I would be a lifetime buyer of ninja products if they increased their manufacturing quality. It seems like you pay for the engineering, but the actual product is overpriced for durability.",
      "rating": 3.0,
      "verified": true,
      "author": "Curryfiend ",
      "helpful_votes": 4,
      "publication_date": 20191207
    },
    {
      "title": "A $40 machine priced at $179. AWFUL! Leaks Everywhere - Can't Recommend",
      "text": "I saved up for this and was so excited to get it. I have to say I feel duped and scammed by the descriptions and the reviews. This brewer is an overpriced toy. It is not for a serious coffee lover. Pros: Brews fast. Cons: Leaks EVERYWHERE from the reservoir. Not 'steal a cup' so you wait til it's 100% done brewing or it leaks everywhere. If you don't close the filter basket all the way it blows up like a hot coffee waterfall everywhere. Cant tell how much coffee is in the carafe because it's metal. No hot plate.",
      "rating": 1.0,
      "verified": true,
      "author": "Ms. Anthropic",
      "helpful_votes": 2,
      "publication_date": 20200312
    },
    {
      "title": "Disappointed in the Carafe",
      "text": "The coffee this machine makes is superior, however, I am so disappointed we got the \"upgraded\" Ninja that doesn't have a heating element, but a thermos style Carafe. My husband makes the coffee, I usually wake up 1 - 1 1/2 hours later. With all the \"double walled\" technology, I mistakenly thought the carafe would keep the coffee hot ... NOPE. It's nothing better than luke warm and I am so disappointed we didn't get the glass carafe with the heating element and now that we have used this machine and thrown away the box I cannot return it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly N.",
      "helpful_votes": 4,
      "publication_date": 20190517
    },
    {
      "title": "Impressive",
      "text": "I was hesitant and skeptical after reading all the great reviews. But after using it for over a month now and trying several specialty recipes, I'm very impressed. Don't understand why, but cappuccino tastes just like from a coffee shop, the cold brew is amazing. Regular coffee tastes better than from my old Capresso. The carafe keeps coffee warm enough for up to 2 hours. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "WesK",
      "helpful_votes": 4,
      "publication_date": 20190112
    },
    {
      "title": "The smell that won't go",
      "text": "This product looks great, but so far, the only thing I've run thru it is countless amounts of water and water + vinegar, in vain attempts to get rid of a smell that simply won't leave. I'm preparing to return this, and would advise anyone considering to reconsider as it can't possibly be safe.",
      "rating": 1.0,
      "verified": true,
      "author": "W L",
      "helpful_votes": 5,
      "publication_date": 20190426
    },
    {
      "title": "It leaks all over the counter!!",
      "text": "I'm so depressed about this coffee maker! We've had it for about a year and it was working great until a few months ago when it started leaking badly at the base of the water tank. I called Ninja customer support and they sent us out a new base but for a $20 \"shipping fee.\" I wasn't happy about the fee but was willing to pay it to get this very expensive coffee maker to stop leaking. It stopped for awhile and then started leaking again. I will never buy another Ninja. So discouraged!!",
      "rating": 1.0,
      "verified": true,
      "author": "Julie N.",
      "helpful_votes": 2,
      "publication_date": 20191025
    },
    {
      "title": "Water Leaks Everywhere",
      "text": "I was so excited when I bought this coffee maker! I thought spending top dollar on a \"top of the line\" machine would yield exceptionally good coffee, keep my coffee hot, and be....well, top of the line. No such luck. Water leaks all over the counter, and it doesn't keep the coffee warm as expected. (It only keeps the coffee warm as long as the pot is completely full.) The coffee flavor is on par with every other coffee maker you can get for way less money. I'm going back to my former brand. Do yourself a favor...spend half the money and save yourself the constant pain of cleaning up water non-stop.",
      "rating": 1.0,
      "verified": true,
      "author": "A.L.",
      "helpful_votes": 3,
      "publication_date": 20191111
    },
    {
      "title": "Water Leaks",
      "text": "The water reservoir started leaking around 8 months of daily use. Now, after a year, it leaks to the point where I am considering no longer using it. We like to prepare everything before we go to bed, and then just have to hit the button to start the coffee when we wake up. However, by the time we wake up, about a cup of water is all over the counter. At this price point, a coffee maker should not be doing this. Yes, we have cleaned it...several times, using the built-in feature, and manually.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike G",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "The unit is not heated!!!",
      "text": "Set your timer for a nice hot coffee in the morning. It brews at the time you set. However your coffee will fill into a metal caraf that is cold resulting in a luke warm cup of coffee. This unit doesnt have a heating element. Therefore if you make a full or half caraf of coffee your second cup is sure to be cold. This unit costs way too much for it not to have a heated pad for the caraf to set onto. I would highly reccomend another manufacture. I dealt with luke warm coffee for 4 month until this POS went straight to the garbage can.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Wells",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Chemical smell won’t go away.",
      "text": "Don’t buy this coffee maker. The chemical smell and taste from the carafe is overwhelming. No matter how long you soak or wash it. And the company customer service is horrible. You wait on hold and they want to trouble shoot. How do you troubleshoot a chemical smell? Don’t waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "I don’t normally do this. ",
      "helpful_votes": 5,
      "publication_date": 20190416
    },
    {
      "title": "Lemon only worked a few months",
      "text": "This coffee machine was great for about two months. Then it would not pump water. So there was no descaling to be done. Called Amazon they would not back the product said to call manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Jae S.",
      "helpful_votes": 3,
      "publication_date": 20191109
    },
    {
      "title": "BEWARE! DO NOT BUY! IT WILL DIE ON YOU",
      "text": "I bought this product in Nov 2018. It worked great for a year. Then suddenly it stopped working. Now it just keeps saying \"add wtr\" even if reservoir is full. It will not brew even the smallest cup of coffee. This is a common complaint about this item. I called Ninja and they said they can ship a new unit to me for $20. Before this I had a $80 Keurig that worked great for 5-6 years and will still work if I pull it out from storage. Save your money and go with a better company than this crap. I am honestly disappointed in Ninja for not backing up their product. It was good while it lasted.",
      "rating": 1.0,
      "verified": true,
      "author": "AmitD",
      "helpful_votes": 2,
      "publication_date": 20200415
    },
    {
      "title": "Awesome",
      "text": "I love this coffee maker. My husband who doesn’t drink coffee also loves it, for its tea feature. Between the 2 of us we use it 4-6 times a day.",
      "rating": 5.0,
      "verified": true,
      "author": "J Maher",
      "helpful_votes": 6,
      "publication_date": 20181230
    },
    {
      "title": "Where Has This Been All of My Life???",
      "text": "We are coffee aficionados. Coffee connoisseurs. OK, we're Coffee Snobs. The point is we really, really love coffee. Before, we would just buy whatever coffee was cheap, pre-roasted, pre-ground and ready to brew. Then, we moved to more robust, flavorful blends from around the world. Next, we moved towards grinding the roasted beans and brewing immediately. Finally, we purchased this and have fallen in love with our coffee even more (if that is possible). I don't proclaim to know the science behind a great 'cuppa joe', but my taste buds sing and soar after brewing a pot of coffee with this product. I can make it iced, hot, cappuccino, whatever my heart desires! I love my Ninja!",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Miraculous Appliance!",
      "text": "One of the best appliances I’ve ever owned. It does it all and we are having so much fun making specialty drinks. We are both coffee and tea drinkers and this product eliminated the need for our electric tea kettle, brewing tea at the correct temp for all varieties. We love the ability to make perfectly tasting coffee in various sizes from one mug to a full carafe- it avoids wasting grounds. The frother is awesome and works well. Intuitive machine and we are extremely pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "EAP",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "The best!",
      "text": "We've been using this for over a month now at our office and everyone loves it! It makes great coffee, iced coffee, hot and cold tea as well as more fancy drinks. We love how we can make a little or a lot too depending on the time of day! No complaints at all on this! Several want one for their home now!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190828
    },
    {
      "title": "LOVE!!!",
      "text": "Love this coffee machine! I love that I can make a single cup without adding more Kcups to the landfill!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181129
    },
    {
      "title": "Great variety",
      "text": "After years of use my Keurig bit the dust and we decided to try something else. I love the variety that this provides as well as lower environmental impact than the k-cups. With both tea and coffee, over ice, cold brew, single cup vs carafe and other options, this makes great coffee and tea any way you like. Granted, you could make your own adjustments to a traditional coffee pot and tea kettle but with this, you just toggle a few options and don't have to worry about the details. My wife and I find ourselves drinking more coffee and tea with this than we did before.",
      "rating": 5.0,
      "verified": true,
      "author": "George Gilman",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Great variety of brew sizes and no K Cup reliance",
      "text": "We love this little coffee and tea maker. The ability of it to brew every size from carafe to small cups sold it and the permanant filters mean no KCups needed. Filters rinse out very easy or tou can remove the permanent filter and use a #4 paper filter. The machine adjusts water temp and brew time based on what you select for the best flavor. During brewing the machine raises up the filter section to create a seal to prevent water from coming out and very little steam is seen escaping We brewed a carafe of tea and put it in the refrigerator, over two hours later it was still steaming during pour.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Simpson",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Be your own barista!",
      "text": "I bought this as a graduation gift for my daughter who LOVES fancy coffee drinks. This thing does it all AND does it so well! She is in coffee and tea heaven as she is making her way through the nifty recipe book that came with it. As she sipped away on her latest cup, she remarked, “Dunkin and Starbucks who?”, lol. Yep, it’s way better! She’s made me quite a few and I second her opinion. This little machine will turn you into a barista overnight! And of course, Ninja has done it again! Fabulous!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Great tasting coffee, easy to use and great shipping!",
      "text": "Replaced an older Ninja Coffee maker with this new one. Decided to stick with the Ninja because it was the only model I could find that had a stainless steel carafe, did different cup sizes, ice coffee all in one. Since the old one always made a decent tasting cup of coffee I was hopeful this would be just as good. FIRST the shipping was fantastic, received the machine within less than 20 hours of ordering. Unpacked it right away, followed directions for the first use and made our first pot of coffee. Not disappointed at all, great tasting cup of coffee, quick, perfect temperature. Hoping to get as many years out of this as we did our last Ninja.",
      "rating": 5.0,
      "verified": true,
      "author": "Skmcb ",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Love the coffee maker but it leaks...",
      "text": "Have had this coffee maker now for a few months and it works as advertised, the problem is it has been leaking from the onset. It appears to be leaking from under the machine. My daughter bought one and has experienced the same problem. Very expensive coffee maker for this kind of issue. Going to see what I can do with customer service but 90 days after purchase not sure how much support I will get...",
      "rating": 2.0,
      "verified": true,
      "author": "George Z.",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "Getting loud and overflowing",
      "text": "We had to place the device once before under warranty for making too much coffee than selected and overflowing and now that warranty's expired the machine is now whirring very loudly when in use and making too much coffee AGAIN. we've cleaned it twice now but with no change to the machine. The bottom of the water tank leaks a bit but not enough to where that's the reason for this overflow. I'm at a loss at what to do with this thing now...",
      "rating": 2.0,
      "verified": true,
      "author": "Squid",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "User friendly and cheaper than star$$$",
      "text": "Love this coffee maker. The versatility in how much you can brew and what you can make is amazing. It is also easy to use after a quick scan of instructions and recipes. My four kids all use it and they range in age from ten to 16. Great way to reduce their number of Starbucks trip requests!",
      "rating": 5.0,
      "verified": true,
      "author": "MamaKD",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Awesome! I love this coffee maker!",
      "text": "We really love this coffee maker! I love that there are many brewing options. Having the thermal carafe is perfect for my husband and I especially love the frother attachment. You do have to preheat the milk, and it’s not like a latte... more like a cafe au lait..but the frother attachment is great. For the price, this is super easy to use and high quality. I shopped around, reading reviews on several machines and I am extremely satisfied with my purchase. I also bought a Shardor burr type grinder that works awesome with this Ninja Coffee Maker.",
      "rating": 5.0,
      "verified": true,
      "author": "TLou",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Not impressed with the construction",
      "text": "Like the idea, like the device, like the abilities to brew many different sizes of coffee. HOWEVER, after only a dozen or so carafes/cups of coffee, the water reservoir leaks and floods the countertop and floor (it has buckled our hardwoods as it leaked a carafe+ of water that sat on the wood overnight). So, we can't use the timer any longer because the coffee/tea must be brewed manually to prevent leaks. Not a fan so we will be replacing it with something that won't cause a few hundred dollars in damage to our floors. If I could return this device, I would.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Great product even for the price.",
      "text": "I was skeptical if the product could live up to it's bragging rights. Overall it does all it says it will very well. The one issue I face is not being able to reheat up the caraffe after it's cooled off due to lack of hotplate. This is more of user error as I should be making cups of coffee instead of caraffea.",
      "rating": 5.0,
      "verified": true,
      "author": "DancingMad",
      "helpful_votes": 2,
      "publication_date": 20190117
    },
    {
      "title": "Amazaballz!",
      "text": "Amazaballz! My last ninja coffee machine carafe broke and I couldn’t buy a replacement for some reason. I decided to upgrade to this one. This is day two and I am in love! I’ve made it over ice and regular and it’s so good! The measuring spoon that came with it has been so helpful and the coffee is not bitter. I am so happy. Almost spend a ton more to have something fancier and I’m so glad I bought this instead!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "So far so good!",
      "text": "I have struggled to make iced coffee at home all my life so I finally splurge as spending money on coffee everyday is getting ridiculous! Tried it for the first time today. Used a ordinary brand of coffee had some syrups laying around which surprisingly have a long shelf life and it came out great! Easy to do haven’t cleaned it yet but can’t imagine it to be difficult. Figure it will pay for itself in no time!",
      "rating": 5.0,
      "verified": true,
      "author": "scammask",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "This machine does it all!",
      "text": "I love Ninja products but was hesitant to spend so much money on a coffee maker! I'm so glad I decided to do it. We drink our coffee hot in the few months of cold weather that we have, but most of the year, we drink iced coffee. The iced coffee with the frothed milk taste just like getting it at a coffee shop!!! Love that you can pick what size drink you want to make. I had originally thought about getting a Keurig but then realized how much plastic would be used with those pods - such a waste! I still haven't made tea in it but definitely want to try it out soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy W",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Worth it",
      "text": "My wife enjoys coffee, while I like tea and this machine delivers both in impressive fashion. The functions are easy to operate and the taste is very good. The spoon makes correct sizing simple because it is labeled accurately and the size of the unit is neither too large or small. The included recipe guide is also nice and with little effort you can make drinks that look almost identical to the pictured items and the taste it top notch. The frother is also extremely easy to use and its put away design is very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew G",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Versatile Product",
      "text": "I love all of the different capabilities of this coffee maker, and it is worth the price. It does take a few weeks to learn how to make the brew exactly how you want it, so be patient while trying to figure this out. I appreciate having different baskets for tea and coffee. The frother works excellent and is easy to clean. I enjoy having many coffee and tea options. I do wish the water reservoir was larger, but it isn't a problem that I would knock this product down a star.",
      "rating": 5.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Best coffee/tea brewer!",
      "text": "I've had this for a little over a year and it gets used several times a day, every day. It is still going strong! I couldn't be happier with this purchase. The milk frother is a nice touch for making specialty coffee or tea at home without paying outrageous prices at the big boxed coffee shops. I can't think of a single complaint with the device in about 15 months of owning it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rashid",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great product",
      "text": "Absolutely love this product, making tea is so much easier now. Not that it was hard before but less thoight goes into it. And it taste wonderful. The cold brew is not the best but if you put more coffee in than usual it's not bad. I had the older Version of the ninja coffee bar and loved it but it started leaking on me. After a move so decided to upgrade l, glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Ojalegria",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Bought it for the cold brew setting.",
      "text": "I have used the regular coffee and green tea setting once and both worked great. The main reason I got this is for the cold brew setting which works perfectly. Ive used the pitcher you put in the fridge overnight and they turned out great coffee but are a pain to plan ahead with. This unit turns out the same level of flavor and strength as that but in a fraction of the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian R Robertson",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Slow sipper? Coffee for company? Not this one.",
      "text": "I was excited to receive this product as there are many neat options. However, while it says that the stainless steel carafe keeps coffee warm, there isn't a way to KEEP it warm. That is, there isn't a pot warmer on the bottom. It's just plastic. So if you like a few cups of hot coffee over an hour or so, you will want to choose a different product than this one. So disappointed!!",
      "rating": 3.0,
      "verified": true,
      "author": "Tim & Lisa",
      "helpful_votes": 4,
      "publication_date": 20190430
    },
    {
      "title": "best purchase ever",
      "text": "we left Keurig because buying pods just got too expensive some coffee's would cost $1.00 or more per pod! this machine can make one cup or 12 cups with the only adjust being the amount of coffee you put in. the flavor is amazing. and it is so easy to use. if it died today I would buy another one no questions asked.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Nall",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Best daily use coffee maker I've owned in my 75 years.",
      "text": "This is a phenomenal machine. It is extremely easy to use and it's versatility is superb. Coffee flavor is excellent for this kind of maker. Only an American Press device is truly superior. It is akin to a \"pour over\" system. Both of those devices require more effort from beginning to end. We are very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Very pleased",
      "text": "I did a ton of research Before buying, originally I wanted a single serve k-cup style coffee maker but after hearing some not so good things and looking at the price of k cups I decided to go With the ninja. I love that I can get single serve, to go cup, half carafe and full carafe. The one complaint from people that I read was no hot pad so I went with the stainless steal carafe and when I went to dump what was left of my coffee out of the carafe the coffee was still hot. The coffee comes out very hot from the machine as well which I love. Overall I am very happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Doofy",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Wonderful until..",
      "text": "We absolutely love this machine, but unfortunately a little after the first year we're having a problem with the machine. The part where you place the coffee grinds/filter has decided that it wants to pop out for every blend except for rich (sometimes) and has been quite frustrating as anything else will only give us a third a cup when set for XL.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "LOVE IT",
      "text": "I really love coffee, but I'm far from a snob. I wanted a reliably good cup coffee each morning from decent beans, and I have been very pleasantly surprised! I use it every day, and lately I've been making coffee in the morning, and iced tea in the afternoon. The cold brew and over ice functions are perfect! And the hot coffee is flavorful and delicious. It's easy to clean, easy to refill water, and easy to use! Admittedly I forget about the milk frother often and haven't used it, I also haven't used the Specialty function. However, if they're anything like the other functions, I'm sure it'll be great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great Machine.  Save on Pods",
      "text": "This makes great coffee by the cup. Do not need the expensive and environmentally wasteful pods. Not only that it has a water reservoir so do not even need to refill for every cup. Instead of putting in a pod, all I do is put in a paper filter, add some coffee and a hot cup pours out quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Nevsky",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Best thing ever",
      "text": "Easy to use. I’ve made hot/cold teas and coffees, lattes and with the teas both loose leaf and bagged tea. Fast, great flavor. With regards to the frothed I have an espresso machine that uses steam so warms the milk. This machine does not warm the milk while frothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Yolanda",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "Great Coffee Machine",
      "text": "I had a Keurig before this coffee machine. This if far better. You don't have to worry about special cups or coffee filters. It does both tea and coffee which is great for my family. Wish I would have bought it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Not worth it",
      "text": "I was very disappointed, the machine arrived defect. I could not even get the machine started. The settings did not work .",
      "rating": 1.0,
      "verified": true,
      "author": "Astrid ",
      "helpful_votes": 4,
      "publication_date": 20190410
    },
    {
      "title": "Bitter is right.",
      "text": "I thought it was just the coffee or the water being used. But we've tried 5 different beans. All freshly ground. Weve used filtered spring water. And it still doesnt wash away the bitterness. I've started grinding my beans on a 8 / 12 for coarseness from the conical burr grinder. That has helped some. But the way it brews coffee just leaves something to be desired.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Miessner",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Ninja Customer Service is Awful!",
      "text": "Really enjoyed this coffee maker after going through several before. It started having issues less than a year after purchase. When I called Ninja the rep was so rude and dismissive. Further as he began troubleshooting the problem rather than waiting for it to run a cycle he simply hung up on me. We have purchased a number of Ninja products but I will think twice going forward if this is how they treat their customers.",
      "rating": 3.0,
      "verified": true,
      "author": "Knott Thanyapolpalakorn",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Coffee isn’t warm enough",
      "text": "I was disappointed in the temperature of coffee at brew and the amount of time the thermal pot would keep the coffee warm. It’s just not warm enough for me for the price point. I returned this item. Everything else about the Ninja Coffee Machine met my expectations as I previously owned one.",
      "rating": 4.0,
      "verified": true,
      "author": "Alvin’s Attic",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Dayum. Yes. Buy it.",
      "text": "Holy crap, this does so many thing. Entirely different flow for your tea so it doesn’t get all coffee tasting, and it is quick. Super quick. Read the instructions, and you’ll just figure the rest out as you go. I love that it does a cup or a carafe or half carafe. This makes a damn good cup of coffee. Highly recommend the insulated carafe version.",
      "rating": 5.0,
      "verified": true,
      "author": "Saraea",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Just AWESOME!",
      "text": "I have been able to remove no less than 4 appliances from our counters after purchasing this coffee bar. It has replaced a cold brew coffee maker, an espresso maker, our coffee maker, and our tea maker. The hot and cold brew coffee produced from this maker is just fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Annonymous2017",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Great coffee, leaky carafe!",
      "text": "We have loved the coffee that brews in this pot! However the stainless steel carafe is a poor design, unless we are extremely careful it makes a mess while pouring. There is not a good spout. I also got the stainless option because my husband likes to sip coffee all day since he's working from home but unfortunately it doesnt keep the coffee hot for super long like we were hoping. Before this we had a simple Mr coffee pot with a stainless carafe that sealed shut and poured well, it literally kept the coffee hot all day. Shucks anyways!! But we do enjoy our coffee and this is a fun pot, just keep a dishrag handy😆",
      "rating": 3.0,
      "verified": true,
      "author": "Justin Muhonen",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "OMG!!️❤️TOTALLY IN LOVE!!️👍🏻❤️",
      "text": "I am TOTALLY in LOVE with my brand new Ninja Hot and Cold Brewed System, Auto-iQ Tea and Coffee Maker with 6 Brew Sizes, 5 Brew Styles!!!!!! Best Coffee/Tea Hot/Cold Brew I have ever owned!!!! Absolutely OVER the MOON with this machine!!!! Oh! HAPPY BIRTHDAY TO ME!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CanaPana",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Worth the dollars",
      "text": "I finally gave in and bought a coffee maker that makes good coffee! Love it. Have already saved loads of dollars from making coffee at hone, and not buying out. It’s also fast to get a cup brewing, so I never worry about running late to work, and risking the terrible coffee they provide.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Great for dual purposes",
      "text": "So Im a tea drinker he is a coffee drinker. This machine is a match made in heaven for the these two polar opposites. The coffee recipes that come with the machine is a little strong, but with the loose leaf tea that I use very accurate. Very well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "DAS",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Great product at an awesome price!",
      "text": "I am in love with this coffee maker. It makes every drink that I fancied in Starbucks! The best thing about it is that the user controls everything from how strong you want your coffee to adding other ingredients like orange peels and chocolate powder. I had been looking for such a machine for so long since I really like coffee throughout the day. And this Ninja coffee maker has finally made my day! :D",
      "rating": 5.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great transaction...",
      "text": "Wanted to step up my coffee, add the tea station, and cold brew ability. Just like any new appliance you have to adjust to your taste. Makes a good coffee, tea but I'm still playing with it to find what is my perfect cup. Item was as stated, fast shipping, great seller, and highly recommended...Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Punk",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Ninja doing what Ninja does best.",
      "text": "This thing will sneak up behind you and attack you with delish coffee creations. Much like it's namesake (Ninja) this thing will sneak up and kill the over-confidnet Samurai Lord (Starbucks and Dutch Bros.) With delicious Shurikens of cold brew coffee and deadly caltrops of perfectly brewed homemade tea.",
      "rating": 5.0,
      "verified": true,
      "author": "Franklin Ferny",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Worth the money!!!",
      "text": "I was anticipating on spending so much for a coffee maker until I started reading about it. It’s perfect for coffee and tea drinkers! I drink coffee in the morning and then tea in the afternoon so this is a perfect coffee machine. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "ACP",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Lots of options that all taste great!",
      "text": "I shopped for a coffee bar for probably 6 months. Because of the cost you want it to make all brews you like. I was mostly shopping for a strong cup of coffee and cappuccino. And it does both very well. The added bonus was iced tea. I love that I can just make me a glass of sweet tea whenever I want. The only con is the operation manual. Not much there, so thank goodness for YouTube.",
      "rating": 4.0,
      "verified": true,
      "author": "Beverly Wells",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Ninja Hot and Cold Brewed System review",
      "text": "The menu, mode and setting the clock are very intuitive. The karaffe has a wide enough opening to clean it thoroughly. The karaffe screw top lid is really a nice spout formation. The basket for coffee grounds is easy to clean. It brews bulk leaf tea really nice as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawnie lamborn",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Best coffee pot ever!",
      "text": "I ❤❤❤❤❤ this coffee pot!!!! Replaced my Keurig with this and it was the BEST decision ever! Very versatile, easy to use and it makes good coffee! My husband and I have different coffee palettes and this allows for both of us to be happy and have only one cost effective machine!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Steffensmeier",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "100% junk",
      "text": "The product is defective and Ninja knows it. Just google the product # and you will see customers are all having the same issue, reporting them to Ninja and getting no resolution. After we had ours for 8-9 months, the water reservoir started leaking all over the countertop and floor. We do everything Ninja recommends and it still makes a huge mess before or after almost every pot. We no longer trust setting it to brew for the next morning and feel like we have to watch the machine to catch it from leaking everywhere. It’s a waste of money, don’t even bother!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Used it about three times and then was clogged need to be cleaned over and over again what a pain",
      "text": "Used it about three times and then it was clogged need to be cleaned over and over again what a pain directions are crappy",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Miller",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "I love this coffee maker",
      "text": "I received this last week and I have to say it's my favorite coffee maker ever. I noticed, though, that the coffee is a bit stronger (which I like) when you make it by the cup. I love all the different settings and the frother is perfect and fast. Love Love Love!! Oh, and the coffee is hotter than my other coffee makers I've owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekkah S. Littman",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Amazing drinks!",
      "text": "I adore this drink station! I enjoy tea, coffee and brewed broth. This does all of these better than anything else I have used. Different strengths and sizes are perfect. I love the carafe that came with it. So happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Hoo Loo Voo",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Best ever!",
      "text": "This is sooo much more than just a coffee maker and it’s definitely the BEST machine that we’ve owned. It makes hot tea and coffee every morning at our house, the carafe keeps my coffee hot for hours, the tea seeps perfectly and the water is a perfect temperature-HOT. It has multiple brewing options, easy to use, a frother, measuring spoon... I can’t brag enough about our newest addition to the family. ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Nicolas V Reinbold",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Ninja Hot & Cold Brewing system",
      "text": "I love this fantastic Ninja coffee machine. I've had several coffee machines from different companies, this Ninja tops them all. It comes with a 40 irresistible coffee & tea recipe colorful booklet that I looked through and wrote out a list of supplies that I needed and I have to tell you that WOW! The ice tea choices, iced coffee choices, and all the rest, yes, I have tried them all. Drinking them you feel you just order from a coffee shop. I' am so pleased that I make something every day, so delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "kathy",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Charge for shipping under warranty",
      "text": "Worked perfectly for 1 year made ok coffee no better or worse than anything other machine. All of a sudden stopped working. Company wants 20$ shipping to replace the defective product under warranty and they charge tax on that shipping.",
      "rating": 2.0,
      "verified": true,
      "author": "JENNIFER",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "A must-have",
      "text": "Absolutely love this coffee maker so much that I’m not even sure how I survived before it. So many options for coffee types, size, maybe you want tea..it does that too! I’ve saved so much money just by making my own coffee at home. The frother is super easy to use too! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "bg29",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "We LOVE it!",
      "text": "Got this for my husband for Valentine's Day, after he was subtly complaining about my smaller coffee pot. We both love it! Makes a great cup, use the XL Tumbler option (into the carafe) and it makes the perfect amount for two large mugs... my husband uses the loose leaf tea option often, too. Can't wait for the summer to use the cold brew option! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie Sozz",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Who knows how it makes coffee - arrived crushed",
      "text": "Arrived crushed in the box. Somewhere along the shipping route the Ninja was badly damaged and it was delivered anyway. Now we get to go through the hassle of returning it and waiting for a refund. Refunded in the form of amazon gift card. Reordered the Ninja coffee pot and we really like it. Brews a great cup of Joe!",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Finally, no more spills while pouring coffee",
      "text": "Super nice coffee and tea maker. Finally, I don't have to clean coffee spills every time my husband is drinking coffee. This is an excellent design that avoid spilling when you are pouring coffee or tea. Keep the coffee warm for several hours, and it is super fast.",
      "rating": 5.0,
      "verified": true,
      "author": "KC Newton",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Love it (but it leaks sometimes)!!",
      "text": "Absolutely love this coffee maker and all the cool options it has. There’s a frothing tool build in which is super convenient. Only reason I can’t give it a 5 star is an issue with the unit leaking water all over the counter if you fill the tank even a smidge over the max line.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Roper",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "DO NOT RECOMMEND. DO NOT BUY!",
      "text": "Bought this after having a cuisinart coffee maker that lasted forever. I did a decent amount of research, as my husband and I brew coffee 2x a day. Less than 6 months later this happened. Called ninja and they are sending a base replacement but I still had to pay $20 for shipping, which sounds ridiculous given that it is not my faught this is broken. I am really hoping the replacement works because otherwise I will have to get another coffee maker, and this time it will not be ninja. DO NOT RECOMMEND THIS CRAP.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey D. Gordon",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "This is a GREAT machine",
      "text": "I recently switched from a reservoir-type Bunn thermo-carafe type that was my standard for years. I bought this when my daughter finally talked me out of it. This maching is great, it keeps the coffee hot for as long as I need, it is easy to use. the Melitta filters also add to the experience!",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Carafe does not keep coffee hot. Must microwave every cup poured more than 30 minutes after brewing",
      "text": "Coffee is not hot. This pot does not brew very hot coffee and the thermal carafe does not keep the coffee warm. There is no heating element like on a glass carafe model. I would not recommend this for making hot coffee/tea drinks. The cold brew (coffee and tea) are cool but the real appeal is having an appliance that does everything.",
      "rating": 1.0,
      "verified": true,
      "author": "Arie Sherlock",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Nothing bad to say! ☕️🥇",
      "text": "Merry Christmas to me. I’ve made classic, rich and specialty brews. All good, all perfect. Set the auto on. worked great. Brewed single cup and full carafe.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Vass",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "This makes delicious coffe but doesn’t keep the coffe warm for even 10 minutes.",
      "text": "I love this coffee pot but... it does not keep the coffee hot at all. First cup is extra warm, not hot, but delicious . 10 minutes later it’s luke warm. I am so disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Diane Tone",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Love this brewer!",
      "text": "I bought this for the office. It's great for when someone wants a cup in the afternoon but don't need to make a full pot. The frother works great. This was a big hit in the office.",
      "rating": 5.0,
      "verified": true,
      "author": "SA",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "How much can you damage a package during shipping?",
      "text": "This is how our package just arrived from USPS. We are moving to a new house and this is a house warming present... hopefully it actually works!",
      "rating": 2.0,
      "verified": true,
      "author": "Erica R",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Looooove this is so worth the price",
      "text": "Love this coffe maker... love love love cant say enough... the flavor of the coffee truly comes through... and so easy to use and clean.. and love the look and that it doesn't need pods...",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "LOVE IT!!",
      "text": "So, this is my first large purchase from amazon. I love this coffee maker!! I honestly have tried every coffee setting and the specialty makes amazing lattes! I personally like my coffee pretty strong, so I tend to do heaping scoops but its very convenient to have a standard scoop on the machine. The frother is also incredibly easy to clean and works really well! I've only been using this coffee maker for about a month but I think so far it's holding up really well!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabby B",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great Product",
      "text": "Excellent coffee maker with the ability to make a single cup. It has many options for coffee and for tea. The stainless steal carafe keeps the coffee hot for a long time, well over 2 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Schultz Family of Four",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Very happy wit it so far.",
      "text": "Makes great tea and coffee and relatively easy to use (although no where near as easy as a Keurig). Water reservoir is way too small and difficult to fill. Frothier works very very well. Solidly built.",
      "rating": 4.0,
      "verified": true,
      "author": "BSSKJBDL",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Easy to use & looks great",
      "text": "Super easy to use. I’m so happy to be able to brew a single cup of coffee at the strength I like and without adding another little plastic cup to the landfill. Also glad to be able to have a single coffee maker that brews both pots and cups instead needing two separate ones taking up counter space.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcy B",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Makes a delicious cup of coffee and offers really cool options for other types of drinks",
      "text": "This is probably one of the best products that I own. Consistently brews a delicious cup of coffee (I drink it black) and has really cool options for cold brew as well as tea. My wife and I have made the iced tea from the recipe book (with half as much sugar) many times for parties and ourselves. We usually end up making a few batches to fill a larger pitcher. We opted for the more durable stainless steel carafe, because our cat likes to knock glass things off of the counter....",
      "rating": 5.0,
      "verified": true,
      "author": "scoullar",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Very bad quality and taste.",
      "text": "It is the worst coffe maker ever. I got the coffe maker and when I tried it, its taste was very unpleasant. Also, the product came with a missing part and when I returned it, the seller returned me a partial refund which is 100 dollars less than the whole amount. Not recommended product with bad quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Fredy",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Coffee makes me happy!😁",
      "text": "What a thrill this little baby is. First cup of coffee from the get go was perfect. What a world of difference it really makes having the right coffee machine. Combine this with my Death Wish ground coffee I'm off and running every morning with a smile on my face!",
      "rating": 5.0,
      "verified": true,
      "author": "fancynancy",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Excellent Machine",
      "text": "Great coffee! Very versatile machine, one cup or full pot. The cold brew is really handy. It separates the filters for tea and coffee so there is no cross flavor contamination. All around a solid five stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Josephine M Moore",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Clogged too fast",
      "text": "Easy to use, but im having problems sometimes at the time of brewing. It won’t brew the correct size amount. It may be clogged but just bought this product a couple of months ago and it’s not asking to clean yet. BTW i do use filtered water",
      "rating": 4.0,
      "verified": true,
      "author": "Daniela",
      "helpful_votes": 0,
      "publication_date": 20200914
    }
  ],
  "product_meta": {
    "title": "Ninja Hot and Cold Brewed System, Auto-iQ Tea and Coffee Maker with 6 Brew Sizes, 5 Brew Styles, Frother, Coffee & Tea Baskets with Thermal Carafe (CP307)",
    "description": "Go beyond the coffeehouse with the Ninja Hot and Cold Brewed System. This brewing system gives you the ability to brew hot, flavorful cups of coffee and tea or over-ice beverages, all powered by Advanced Thermal Flavor Extraction Technology with Auto-iQ. 2 Ways to Enjoy Over Ice Coffee and Tea – Choose between smooth, naturally sweet Cold Brewed coffee or tea and vivid, authentic flavored Hot Brewed iced coffee or tea that's never diluted. Specialty Coffee and Tea Favorites – Combine super-rich coffee and tea concentrates with hot or cold frothed milk to create delicious coffeehouse-style drinks.",
    "rating": 4.5,
    "feature_bullets": [
      "Coffee and tea brew settings: Brewing technology offers an array of coffee and tea options",
      "Cold brew coffee and tea: Brew over ice at a lower temperature for smooth, naturally sweet flavor in 10 to 15 minutes",
      "Smart basket recognition: System recognizes basket and displays coffee or tea drink options",
      "Separate coffee and tea baskets: Brew coffee or loose or bagged tea to keep flavors separate",
      "6 brew sizes: Brew anything from a single cup or travel size to a half carafe or full carafe in your coffee maker",
      "5 brew styles: Choose your strength with classic, rich, over ice, cold brew, or specialty",
      "Brew directly into a cup with the coffee brewer: Use any brand of coffee or tea, loose leaf or bagged",
      "Tea type: Select your tea type and the system knows the temperature and number of steeps needed",
      "50 Ounces (10 cup) thermal carafe: keeps your coffee and tea hot upto 2 hours"
    ],
    "specifications": {
      "Product Dimensions": "11.81 x 10.01 x 15 inches",
      "Item Weight": "17.25 pounds",
      "Manufacturer": "Ninja",
      "ASIN": "B07FX73Y7H",
      "Item model number": "CP307",
      "Customer Reviews": "4.5 out of 5 stars1,259 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#11,285 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 1, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Coffee Makers",
      "Coffee, Tea & Espresso",
      "Coffee Machines",
      "Kitchen & Dining"
    ],
    "price": 199.99
  }
}