{
  "website_summaries": [
    {
      "verdict": "An attractive name necklace made from stainless steel with 18 karat gold plating.",
      "pros": [
        "A large number of names are available, so you're more likely to find the one you want on the list",
        "Comes with 18-inch gold-colored chain",
        "Velvet gift pouch included"
      ],
      "cons": [
        "Unusual names not available"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product.",
      "text": "It doesn’t get ugly after showering with it multiple times, no chips. I fall asleep with it on and it hasn’t torn on me.",
      "rating": 5.0,
      "verified": true,
      "author": "A. M. GUILLEN",
      "helpful_votes": 60,
      "publication_date": 20191201
    },
    {
      "title": "It’s perfect!",
      "text": "I love it! I wanted it smaller and shorter, but it’s ok.",
      "rating": 5.0,
      "verified": true,
      "author": "britnight",
      "helpful_votes": 50,
      "publication_date": 20191022
    },
    {
      "title": "Smaller than advertised",
      "text": "It's made beautiful but extremely small. I'm very upset it's not as advertised.",
      "rating": 3.0,
      "verified": true,
      "author": "Destiny J",
      "helpful_votes": 19,
      "publication_date": 20191012
    },
    {
      "title": "Sturdy and long lasting",
      "text": "My little cousin love her necklace and I actually ordered one for myself a year ago and it’s still gold and lasting!",
      "rating": 5.0,
      "verified": true,
      "author": "Emmanuel",
      "helpful_votes": 47,
      "publication_date": 20181024
    },
    {
      "title": "Perfect gift for a young girl!",
      "text": "I ordered this for my daughter as a gift for her 6th birthday. She absolutely loves it and wears it about everyday! Still in perfect condition! Her skin is sensitive and we have had zero issues. Comes in a small velvet pouch that we store it in still for safe keeping. I don’t know if me as a grown woman would wear it was it’s rather small, it might be a choker on me but I’ve never tried it on.. letters are small also but perfectly fitting for someone younger. My daughters name also just has 4 letters. It is lovely though I recommend for anyone 5-18 yrs old.",
      "rating": 5.0,
      "verified": true,
      "author": "WhitneyG",
      "helpful_votes": 35,
      "publication_date": 20200219
    },
    {
      "title": "Cute Monogram Necklace",
      "text": "Cute & affordable gold name plate necklace - my new favorite accessory! Saw this for a steal at $10 so picked one up for me and a couple of my nieces. The chain is long and has links at the end to adjust the necklace length for various looks. The only drawback is wishing more name options were available or an option to customize the name so I could also pick up necklaces for my daughter & sisters. Worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 36,
      "publication_date": 20200101
    },
    {
      "title": "Lily necklace is very small print.",
      "text": "I bought 3 necklaces for my girls for Christmas. The quality of the necklace is fine for the price but the lettering on Lily's is much smaller compared to my other two daughters necklaces. That's the only reason I'm giving it a 2 star.",
      "rating": 2.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 13,
      "publication_date": 20190102
    },
    {
      "title": "Beautiful necklace",
      "text": "My son gave this to his friend for her birthday. She loves it. It's simple and sophisticated. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Makes Stuff",
      "helpful_votes": 37,
      "publication_date": 20190108
    },
    {
      "title": "Love this purchase",
      "text": "It’s a very pretty necklace I bought for my elderly Aunt. But it will make a nice gift for any age. Who doesn’t like having their name in gold- To help them feel special. My Aunt has Dementia and sometimes saying her name helps her immensely to function better.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen O.",
      "helpful_votes": 31,
      "publication_date": 20200228
    },
    {
      "title": "Great deal!",
      "text": "I never write reviews, but felt this value is so exceptional I had to give them credit. Purchased one of these for my daughter and niece. They arrived in two days (prime). The quality is outstanding in my opinion. For the quality, price, and speed of delivery, I do not think you will find a better gift value anywhere. Looking to purchase more for additional nieces. Would like to see them add the name Kyra. My daughter is a petite six year old. I was afraid it would be too large for her when it arrived. It was the perfect size for her.",
      "rating": 5.0,
      "verified": true,
      "author": "1 great life",
      "helpful_votes": 30,
      "publication_date": 20190514
    },
    {
      "title": "Cute",
      "text": "Santa gave this to my 9yr old daughter, she loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina K Marcus",
      "helpful_votes": 33,
      "publication_date": 20181229
    },
    {
      "title": "Much appreciated",
      "text": "I got this as a gift for my 10y old sister and she loves it. It’s lightweight, it hasn’t changed colors and it doesn’t irritate her sensitive skin. She thanks you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 30,
      "publication_date": 20190802
    },
    {
      "title": "You get what you pay for",
      "text": "Very cheap looking... it’s the bright yellow gold that shines brightly but is too yellow. The chain is also way too long, even when using the smallest option. Obviously for the price, it may be worth it but it’s more cheap looking then I expected. The photo shows the clasp is broken after only opening/closing a few times & the other photo shows the length (on the shortest setting).",
      "rating": 1.0,
      "verified": true,
      "author": "Baybv1",
      "helpful_votes": 3,
      "publication_date": 20200120
    },
    {
      "title": "Very nice!",
      "text": "Very nicely made. This was for a bday gift and my daughter’s friend loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "A.P.",
      "helpful_votes": 30,
      "publication_date": 20181126
    },
    {
      "title": "PERSONALIZED NAME NECKLACE (-In Good) EXCELLENT PURCHASE!!!!",
      "text": "LOVE MY NECKLACE!!!! ITS ABSOLUTELY PERFECT!!!...BEEN WEARING IT NON-STOP(****MADE W/THE REAL THING!) FITS TO YOUR WANTED LENGTH,-WAITED TO GIVE REVIEW,AS I WANTED TO SEE HOW IT WEARS---*****CONTINUES TO LOOK BRAND NEW!! **BEAUTIFUL LETTERING,AND CHAIN! DEFINITELY RECOMMEND FOR YOURSELF--*OR A PERFECT GIFT*!!!!! ***♥♥♥♥♥♥♥👍👍👍👍👍👍!!!!!!! PERFECT AND EXCELLENT PRICE!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 25,
      "publication_date": 20190915
    },
    {
      "title": "It's good for the price",
      "text": "This thing is honestly the cheapest thing you can buy. But since its $10 you should expect it. Once I took it out the package it already started bending. I was able to put it back in place but it's super fragile. Honestly though, for the price, it's super worth it. Not to mention it got here in a couple of days. So if you're looking for something that's easy on your pockets and still looks good this is ideal for you. Plus it does look great. I think it's worth it so go for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Coco",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Good necklace",
      "text": "I liked it but I wish the chain was a bit shorter",
      "rating": 4.0,
      "verified": true,
      "author": "TaraCap",
      "helpful_votes": 3,
      "publication_date": 20190624
    },
    {
      "title": "Bad quality control.",
      "text": "Ordered the product to arrive before Christmas. Ordered the name Patricia. When the product arrived it said margret causing quite a issue on Christmas.",
      "rating": 1.0,
      "verified": true,
      "author": "jay",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Five Stars",
      "text": "Very good. I bought this as a gift and it was great!",
      "rating": 5.0,
      "verified": true,
      "author": "Nutikah",
      "helpful_votes": 29,
      "publication_date": 20181017
    },
    {
      "title": "Cute/cheap",
      "text": "Bought for my toddler since she just started liking necklaces and she loved it. I wish you could choose what size you wanted because it is a little to long for her and gets tangled fast. I’ll just save it for when she gets older. It’s cute you can tell it was made with cheap material but honestly for $10 and for a toddler it’s not bad. I’m going to just coat it with Clear nail polish so it doesn’t turn her neck green.",
      "rating": 4.0,
      "verified": true,
      "author": "D’Angelo",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Didn't get my name right",
      "text": "Update: brought this item again and they still got my name wrong. They sent me Alana again my name is Arianna. My second time writing a review because my first one got denied. But anyways I did receive my necklace but too bad it wasn't my name.",
      "rating": 1.0,
      "verified": true,
      "author": "Unknown",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "❤️",
      "text": "first of all , i never do reviews 😂 . second , i got my daughters name \"penelope\" which is already super hard to find these days so i usually have to pay extra to get it customized which means it takes longer to receive . that wasn't the case here ! they had her name available for me & i got my 2 day shipping but it came in one day ❤️ very happy with appearance also because although it's an inexpensive necklace , the gold plating was done beautifully so it doesn't look cheap at all . i forsure recommend .",
      "rating": 5.0,
      "verified": true,
      "author": "nelly",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Wrong item",
      "text": "Ordered the “Hayley” necklace and received the Holly 😐😑 I was so excited to FINALLY have something with my name spelled correctly 😅 of course, it was too good to be true. Lol",
      "rating": 1.0,
      "verified": true,
      "author": "steve w.",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Cute and worth it for price",
      "text": "It’s really cute and a good deal for the price. This is actually my boyfriends name and not necessarily a common one so I was surprised to find it already made without having to customize which can be expensive. It feels a little cheap but not bad which is why I gave it 4 stars. I also wish I could pick the length as it doesn’t sit exactly where I like but that’s just personal preference.",
      "rating": 4.0,
      "verified": true,
      "author": "Kiana hall",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "So adorable!",
      "text": "This makes a great gift! Very personable and adorable. I only gave to 4 stars for now because not sure how well it will hold up or if it will change color. First impression is 5 stars though.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Mac",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Cute but tarnishes quick?",
      "text": "3 stars because it's adorable and such a comfy length. Based on other's reviews I want to say maybe i got a bad one because it oxidized a bit just from trying it on it seemed. It was doing an odd coppery thing almost immediately. I wanted to love this so much. But i had to return it. Maybe will rebuy and try my luck elsewhere.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle Clara",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Arrived damaged",
      "text": "The necklace was broken right out of the package. I bought it as a gift for my daughter & gave it to her after the return window closed not realizing the necklace was damaged. The clasp is loose & doesn’t close. Now we’re stuck with a necklace she can’t wear.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Love this necklace!",
      "text": "I had an authentic sterling silver Mexican nameplate that I can't find and was so excited to snag this one at a fraction of the cost. It is light, so definitely on the cheaper side, but doesn't look like it at all. Big selection of names, and even came in cute, giftable packaging. Definitely 5 stars, I highly recommend for fashion jewelry!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Alfaro",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Cute necklace!",
      "text": "Cute necklace and comes with a pouch to store it in. For the price you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 2,
      "publication_date": 20200624
    },
    {
      "title": "Beautiful and she loves it!",
      "text": "Absolutely perfect gift for young woman's birthday. Great selection of names. She ADORES it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 2,
      "publication_date": 20200208
    },
    {
      "title": "Not all are created equal",
      "text": "Bought one for each of our girls. Other reviews mentioned they weren’t all the same size, thought it might be due to number of letters/ letter size but it is not. The (much) smaller one ended up being the younger one’s so it worked out. If you’re buying one it’s great, more than one buyer beware.",
      "rating": 3.0,
      "verified": true,
      "author": "B.G.",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "No clasp",
      "text": "Unfortunately it had no clasp and the clasp was not in the packaging anywhere. Kind of a letdown as it was given as a gift. They did replace it but now I have to get the first one from the recipient it in order to return it. Just a hassle.",
      "rating": 2.0,
      "verified": true,
      "author": "sueme",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Loved it !",
      "text": "Way better quality than I expected. Looking forward to wearing it more often and hoping it will last!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Pena",
      "helpful_votes": 2,
      "publication_date": 20191202
    },
    {
      "title": "Shiny & cute",
      "text": "So cute! I've been wanting the necklace for the longest time. When I found this item for $11 I had to order it! Just received it yesterday. Hoping it doesn't turn colors or tarnish. I might order a 2nd one as a backup. A must buy.",
      "rating": 5.0,
      "verified": true,
      "author": "MZDYMND34",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "It’s a beautiful necklace!",
      "text": "The product itself is beautiful, the packaging was not. It comes in a small cotton package. I replaced it with a gold gift box. I think that my niece will love it and I ordered my other nice one as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Nela",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "cute but broken",
      "text": "well. i ordered my name in the name necklace.. got it.. super cute.. but when i took it out to put it on it broke.. so dissappointed.. i am returning and requested a replacement.. fingers crossed ...",
      "rating": 3.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "To flimsy and looks to fake",
      "text": "Ummmm well my honest opinion about this it's good size for adu6not for like kids chain is long and very flimsy looks very fake like it will turn green after some wetness but all in all it's an ok necklace!! Disclaimer I purchased it from my own money",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle Resendez",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great!",
      "text": "Great piece of jewelry for the price. I have purchased more. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Lovely necklace!",
      "text": "I purchased this necklace for my 7 year old grand daughter and was so pleased when it arrived! Its quite sturdy and looks much nicer than the inexpensive price I paid for it. My grand daughter was trilled with the gift and has been wearing it every day! Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Exactly what i was looking for",
      "text": "The kid asked for this for Christmas, but We have plans to buy them a gold name plate for their Quince; this will not be till July 2020. So I got them this one for the mean time It was exactly what they wanted. It is a bit small and its thick not flat like the one we plan on getting from a jeweler. 5 stars because it saved me from having to ruin a surprise.",
      "rating": 5.0,
      "verified": true,
      "author": "Evan ",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Beautiful but tarnishing fast!",
      "text": "It's beautiful however it does tarnish pretty bad. I only wore it 3x and it stayed safely in it's bag and it still tarnished. I feel it's price fairly high for costume jewelry that ends up tarnishing. Still a beautiful piece but not something that will last.",
      "rating": 3.0,
      "verified": true,
      "author": "Grace Garcia",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Granddaughter loved it!",
      "text": "This was a Christmas gift for our 12-yr-old granddaughter and she absolutely loved it. Well made, reasonably priced, and just the right length. She wears it every day without fail - I guess that's probably the best review of all, right?",
      "rating": 5.0,
      "verified": true,
      "author": "nonigrams",
      "helpful_votes": 24,
      "publication_date": 20200111
    },
    {
      "title": "Affordable name necklace",
      "text": "Beautiful necklace. Came in a nice gift able packaging. Necklace is good quality and doesn’t look cheap. Has not tarnished. Affordable and trendy. Follow me on Instagram @affordablestylesnicole",
      "rating": 4.0,
      "verified": true,
      "author": "B Barker",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Seller goes above and beyond!",
      "text": "This is a great seller - I cannot say enough nice things about how I was helped and treated. Without going into the details, let me say that this seller goes above and beyond what is required to please the buyer! You will not go wrong buying with Awegift!!! Awegift is Awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "mhastings",
      "helpful_votes": 24,
      "publication_date": 20191205
    },
    {
      "title": "Brassy Color",
      "text": "Came packaged just fine. However, the necklace, even for $10 looks like tarnished brass. Does not match my gold at all. More of a gumball machine quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Minnesota girl.",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Perfect Gift",
      "text": "I purchased these for my granddaugthers and they loved them. They have very unuusally names but i was impressed you had their names. They were so excited. It would be nice to see more unusually names for the furture",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis The Mennis",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Okay necklace...",
      "text": "This was a somewhat good present for my 15 year old niece. Although, the name was huge and cheap looking. I would not give this as a present to a grownup.",
      "rating": 3.0,
      "verified": true,
      "author": "Danid",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Sppears to be well made",
      "text": "Daughter bought as it matches her name. Have not seen her wear it, unable to verify quality",
      "rating": 5.0,
      "verified": true,
      "author": "Barnabyj2010",
      "helpful_votes": 26,
      "publication_date": 20190213
    },
    {
      "title": "Super cute and worth the $10",
      "text": "Super cute for a gift ... durable but definitely something you don’t want to get wet or leave on for a long time... so far after a week it’s held up nicely! I’ll Come back and update my review in a few weeeks",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 24,
      "publication_date": 20191229
    },
    {
      "title": "Impressed",
      "text": "I love it!!!! Beautifully made. Love having personalized items for my daughter. I am very impressed with the customer service as well!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Good value for the money",
      "text": "It’s a cute little necklace, I got it for my daughters 15 birthday just to give her a little something to go with her big gift. It’s a good value for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "MzRisha",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Very nice",
      "text": "Very nice!! Hasn’t faded at all and have been wearing it for a while now!! I used a different chain then the one picture! Worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "kristie",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Cute dainty necklace",
      "text": "Very pretty. Got it for my 13yr old daughters bday n she absolutely loves it!!. It was very pretty hasn't turned skin green so that's even better.",
      "rating": 5.0,
      "verified": true,
      "author": "telnisha",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Nice gift!",
      "text": "This is a gift for my daughter. She loves it and wears it a lots. It has not changed the color after one week. It looks real gold! Hope there are more names available to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "shopper02",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Very, very Nice!",
      "text": "Given the very complete set of names they offer and the nice presentation, this one is a winner! Great pricing for a very nice gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Buy it!",
      "text": "Great for the price! Super cute! They usually sell this stuff on insta for a higher price but here it is a good price and the quality is very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Cute but small and color dim",
      "text": "Necklace is cute. She wanted her name. Its small. And the back side of the name is shinnier then the back. She says she is still wearing it though. :)",
      "rating": 3.0,
      "verified": true,
      "author": "D. H. Sargent",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "✅",
      "text": "My daughter is happy with her chain because of its prices, it exceeded my expectations. He uses it to bathe and look the same",
      "rating": 5.0,
      "verified": true,
      "author": "AriannisHillTV",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Cute!",
      "text": "Cute for the price! I have a feeling this will tarnish quickly if worn every day, it’s that type of material.",
      "rating": 5.0,
      "verified": true,
      "author": "endostrong ",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Beautiful!",
      "text": "My daughter loves this necklace! Super fast delivery and great quality for the price. Hasn’t changed colors and she has had it for awhile now!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Rendfrey",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "It's OK",
      "text": "I really like the size of the name. I'm a little concerned that the chain will break easily. Nice present for a young teenager.",
      "rating": 4.0,
      "verified": true,
      "author": "Dogboy501",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great price for what I purchased !",
      "text": "Arrived very late a night my wife and I were in bed but, the chain with her name on it was very nice and a good deal for what I paid ......THANK YOU !!!!!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Don Watkins",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Winning at gift giving",
      "text": "I got this for my mother in law as a gift and it is perfect! She loves it, it is high quality, and she wears it all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Pretty",
      "text": "Bought this as a last minute Christmas gift for my 16 year old daughter. She loves it, and she’s a picky kid to shop for. She wears it everyday, so far it’s holding up great!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Cute!",
      "text": "Granddaughter loves it. Seems to be sturdy...gave it at Christmas and its held up so far...she is 13 so that's pretty good!",
      "rating": 5.0,
      "verified": true,
      "author": "michelle sanford bethea",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "great gift for teen",
      "text": "teen girl wanted this for Christmas. I was worried about her losing a more expensive option. This is perfect for the fashion of the moment.",
      "rating": 5.0,
      "verified": true,
      "author": "Road trippin mama",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Don't hesitate!",
      "text": "I bought this for my granddaughter as a Christmas gift. It is beautiful, well made and appropriate for any age range. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Mistee",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great Quality and really pretty",
      "text": "I gave my daughthers these necklaces for their bday its def suitable for kids if you dont want nothing to big nor fancy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nefetera Roberts",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Cute necklace - just as pictured",
      "text": "Cute Necklace - just as pictured. Quick delivery. I gave this to my daughter on New Year's Eve as she is expecting and this is the name she is going to name the baby. She loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "DONNA",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Beautiful Quality and inexpensive",
      "text": "This necklace was exactly what i wanted.It is so pretty and excellent quality.I wasn't sure it was going to be that great at the cheap price but boy was i wrong!! I love it and reccomend to others",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Hout-Growden",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Ordered a necklace, got a bracelet",
      "text": "I ordered a necklace and got a bracelet. It’s pretty small too, good thing I ordered it for my 9 year old. I’m sure she’ll like it but just not what I ordered.",
      "rating": 3.0,
      "verified": true,
      "author": "jeniclara",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Excellent Product...!!!",
      "text": "Great product , well made , excellent quality ... After this purchase I order two more for my nieces and they love it...!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MS MTY",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Cute and great quality",
      "text": "Very trendy, and cute. I bought this as a gift for my daughter and she was very pleased with it. Great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Barger",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Love it!",
      "text": "I found the perfect necklace! I wanted something long which i was able to adjust it through the chains at the necklace and stack on top of my other necklace! However the product for the price paid is a steal! This necklace is also perfect for gifts, i will for sure buy this necklace again!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Fernandes",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Highly recommend, so pretty!",
      "text": "I really love this necklace, it shipped fast and I’ve been wearing for a little over a week now and good quality for the price. I don’t wear it sleeping or showering however to hold the quality. I would recommend, can’t beat the price for such a pretty necklace.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Good gift for a child",
      "text": "Good for a young child who is impressed by seeing her name and isn’t really concerned about quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Kenzilla",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "The product",
      "text": "Seller is really nice and product is perfect for gift. Got it for a friend of mine it’s very nice looking. Seller was very fast to respond to any questions I had about my package. I would highly recommend purchasing from this seller. I give it two thumbs up. Good quality product and excellent customer service!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Good deal",
      "text": "Beautiful necklace. Decent length. It’s great for price. I personally just don’t like the hook used to keep necklace on neck. Poor quality. May switch that part out",
      "rating": 4.0,
      "verified": true,
      "author": "Kayla Anderson",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Nice quality",
      "text": "Gave to daughter who loves it. She was gifted a similar name necklace and it broke after a few uses. This brand seems to be better quality. Looks nice on her.",
      "rating": 5.0,
      "verified": true,
      "author": "dhdozier",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "LOVE this necklace absolute gorgeous!",
      "text": "Purchased for a gift and I’m amazed at the quality and ordered One for myself!!!! Super shiny. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Michele ",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "A great gift for a teen",
      "text": "I looked everywhere online to order a necklace but couldn't order because they could only do 8 letters and my daughter's name has 9. I was pleased that that I was able to get all letters done. The gold color and the font doesn't look cheap and my daughter loved it! I will probably order a replacement for when it wears out. Also, I had a question and the seller was very responsive.",
      "rating": 5.0,
      "verified": true,
      "author": "Olga Vaz",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Very pretty and not too big",
      "text": "Got this for my daughter who is in high school. She gets compliments all the time from other teens. It looks really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki DuMond",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Pretty necklace",
      "text": "Pretty chain and the name is nice and clear. Giving as a gift to my friend for Christmas... we'll see how it holds up!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Hess",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Very good",
      "text": "I bought this for a Christmas gift to my sister and she loves it.. and she is a picky one. She says she gets a lot of compliments . I'm happy I got it for her",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Cute for teens",
      "text": "Really cute necklace a little longer than I expected but it’s still pretty and had really fast shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Felecia",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Beautiful necklace!",
      "text": "This was a Easter gift for my granddaughter. She loved it! It is very pretty and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Love it",
      "text": "I love my name necklace. My bf bought it for me and I love it. The chain is adjustable which is great so you can switch it up depending on what you're wearing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Good for a little girl",
      "text": "Quality is about right for the price, heavy enough that it wasn’t bendy. Name is larger than I expected, but my daughter loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kbabs",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great Style and Value!",
      "text": "Got one of these with my daughters name and it looks wonderful. Great quality and value compared to some of the other plated necklaces on here.",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Beautiful necklace",
      "text": "This is a great quality necklace, but I had to send it back bc my son broke up with this girl.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Cheaply made",
      "text": "This necklace is a prime example of you get what you paid for... It's not as nice as it is in the pictures.. it's very cheaply made.. will turn your neck green within the first few hours of wearing.. DO NOT RECOMMEND BUYING!!",
      "rating": 1.0,
      "verified": true,
      "author": "nicholas harding",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "No color changing",
      "text": "Ordered in March, I wear it often and no color changing. Nice size & length",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine Boyd",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Great name necklace for Granddaughter!!",
      "text": "My granddaughter loved her necklace for her 6th Birthday. Beautiful! Great quality!!",
      "rating": 5.0,
      "verified": true,
      "author": "sharon pritzker",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great gift, ships fast.",
      "text": "Great gift for teens, it is good quality and name is clearly done. Shipped fast and priced great.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Kitterman",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Looks good",
      "text": "Great for my brother he LOVESSSSS it and for that I LOOVVVEEE it he knows it’s not real so he doesn’t wear all the time but it’s great for the price and it still looks good he takes very good care of his things I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Yasmine ",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Great price - nice quality necklace!",
      "text": "Beautiful necklace - my daughter loved it! Looks like a high-quality necklace but at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia in DC",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Dollar store worth",
      "text": "Not even a week into having this necklace, the chain broke. Dissapointed in this iten overall.",
      "rating": 1.0,
      "verified": true,
      "author": "Breanne",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Love!",
      "text": "My niece loved her necklace so much for Christmas she could not wait to put it on!!",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn Wilson",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great quality!",
      "text": "This is a great gift! I bought it for my daughter for her birthday and she wears it everyday! The necklace has a really good quality to it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Campa",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Mallory necklace",
      "text": "Cute necklace. Bought it for my daughter who wore it all summer long in chlorine, the shower and in the ocean. It never turned her neck colors or turned colors itself. Decent quality for good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201019
    }
  ],
  "product_meta": {
    "title": "Awegift Personalized Name Necklace 18K Gold Plated New Mom Bridesmaid Gift Jewelry for Women",
    "description": "About us Awegift\n\n \n\nOur brand is registered in the US. The meaning of the brand Awegift is awesome gift, each of our products is designed by our designers.\n\n \n\nOur necklace is made of stainless steel. No distortion, no stain, no rust, no corrode,no deformation, long time stay metal color and shine.\n\n \n\nEach of products comes with a elegant package ready for your family, friends.\n\n \n\nHow to take care of your jewelry?\n\n \n\n1. Avoid your jewelry touch Acid Alkali and other Corrosive Chemicals.\n\n \n\n2. Do not wear jewelry during exercise, bathing and swimming.\n\n \n\n3. Keep your jewelry in gift bag, mirror polished jewelry should be avoided touching sharp things, we suggest to clean them with soft cloth.\n\n\n\n\n\n\nPRODUCT DETAILS\n * Package Dimensions :3 x 3 x 0.6 inches; 3 Ounces\n * Department :Womens\n * Date First Available :March 15, 2020\n * Manufacturer :Natali\n * ASIN :B085X8TYRZ\n\n * Amazon Best Sellers Rank: #1,774 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #5 inWomen's Pendants \n    *  #1 inGirls' Pendants \n    *  #551 inMen's Fashion \n   \n   \n\n * Customer Reviews:4.6 out of 5 stars3,241 ratings \n\nAbout us Awegift\n\n \n\nOur brand is registered in the US. The meaning of the brand Awegift is awesome gift, each of our products is designed by our designers.\n\n \n\nOur necklace is made of stainless steel. No distortion, no stain, no rust, no corrode,no deformation, long time stay metal color and shine.\n\n \n\nEach of products comes with a elegant package ready for your family, friends.\n\n \n\nHow to take care of your jewelry?\n\n \n\n1. Avoid your jewelry touch Acid Alkali and other Corrosive Chemicals.\n\n \n\n2. Do not wear jewelry during exercise, bathing and swimming.\n\n \n\n3. Keep your jewelry in gift bag, mirror polished jewelry should be avoided touching sharp things, we suggest to clean them with soft cloth.",
    "rating": 4.6,
    "feature_bullets": [
      "Unique tiny name necklace perfect birthday bridesmaind gift for women mother,wife,daughter, sister, friend, niece, girlfriend,classmates...",
      "Necklace made of stainless steel 18K real gold plated, not fade, rust, tarnish, corrode, stain and turn black,durable. Hypoallergenic and look more beautiful and smooth.",
      "Minimalist awesome design and detail is very attractive, and it is comfortable to wear. Necklace chain length 18\"+2\"extension.",
      "Prefect gift with elegant package ready for giving, will be your best choice.",
      "100% good quality guarantee,If you have any displeasure about our pendant necklace,We promise free Money-back."
    ],
    "specifications": {
      "Package Dimensions": "3 x 3 x 0.6 inches; 3 Ounces",
      "Department": "Womens",
      "Date First Available": "March 15, 2020",
      "Manufacturer": "Natali",
      "ASIN": "B085X8TYRZ"
    },
    "categories": [
      "Women",
      "Clothing, Shoes & Jewelry",
      "Jewelry",
      "Pendants",
      "Necklaces"
    ],
    "price": 11.97
  }
}