{
  "website_summaries": [
    {
      "verdict": "Stands out for its ease of use and its large grilling area, making it the perfect choice for a larger family.",
      "pros": [
        "Easy to use – just set it up and forget it",
        "Grill has a large surface area and generates a consistent temperature",
        "We love that it is versatile enough to be used for grilling, smoking, baking, roasting, braising, and, of course, barbecuing"
      ],
      "cons": [
        "While it can be easily assembled on its side, you may need help getting it upright, as it is very heavy",
        "No way to easily drain or swap out the pellets in the hopper"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Died 8/28",
      "text": "The igniter failed today, went to check on meat and the fire box was full of pellets, emptied the pellets, tried to start and the igniter failed. Purchased 6/5/2019",
      "rating": 1.0,
      "verified": true,
      "author": "Don Lucius",
      "helpful_votes": 52,
      "publication_date": 20190729
    },
    {
      "title": "Going to need more Lipitor.",
      "text": "Easy to assemble. I have been using it almost every day. Great for ribs. Not so good for burgers or steaks because it doesn't get hot enough to sear the meat, but great for ribs-use the 3-2-1 recipe.",
      "rating": 5.0,
      "verified": true,
      "author": "p. Schofield",
      "helpful_votes": 18,
      "publication_date": 20190704
    },
    {
      "title": "Perfect for large meats!",
      "text": "The size of the Pro 34 is nice. As you can see in the photo I was able to smoke 3 18 pound briskets side by side. All of them turned out great. While it does not have the Wifi, you can buy blue tooth thermometers which give you the temps you just can’t control the grill. Works great and gives great results.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard B Young, Jr",
      "helpful_votes": 13,
      "publication_date": 20190903
    },
    {
      "title": "This is the best smoker.",
      "text": "This is not the fancy new model with WiFi, but works great. The digital display shows the temperature inside and the temperature in the center of the meat. Temp stays within 5 degrees of desired setting.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan S",
      "helpful_votes": 11,
      "publication_date": 20190725
    },
    {
      "title": "Best grill ever",
      "text": "Best grill ever. I get compliments from my wife, peers, co-workers, and comments like \"this is better pork that i've ever had at any restaurant\" and \"that's gotta be the best pulled pork i've ever had\". transform yourself into a pitmaster and it's about as difficult to use as a crock pot. turn it on, throw down some meat, and let the smoke roll. I don't use it much as a grill for burgers and brats, but I use it mainly as a smoker. fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian B",
      "helpful_votes": 11,
      "publication_date": 20170918
    },
    {
      "title": "Great Purchase",
      "text": "Directions were funny. Was thinking my husband was crazy for this purchase but we are loving it more everyday",
      "rating": 5.0,
      "verified": true,
      "author": "TGSNmom",
      "helpful_votes": 7,
      "publication_date": 20190724
    },
    {
      "title": "Auger not hooked up",
      "text": "I was so excited to get my traeger grill. I got it all put together. Turned it on and ...nothing was spinning. I looked and looked and found this little pin in a plastic baggie down inside the motor part. Looks like the auger wasn't attached to the actual motor which means I have to take the whole thing apart. It doesn't show this anywhere in my instructions and I'm not very pleased.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200801
    },
    {
      "title": "Traeger Grills TFB88PZBO Pro Series 34 Pellet Grill and Smoker, 884 Sq. In.",
      "text": "I received the Traeger today and assembled it in 45mins it calls for 2 people to assemble but I was able to do it myself the directions are easy to follow and the directions tell you to start with a six pack of beer i was only able to drink one beer cause it was so easy to assemble by far the best pellet grill I have ever bought I just wish I would have just bought a Traeger sooner and not have wasted money on other grills and smokers I promise you won't be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Patrick Mansour III",
      "helpful_votes": 3,
      "publication_date": 20200601
    },
    {
      "title": "Don't buy Taeger PRO34.  Its an old model, new models have been improved over time.",
      "text": "auger shear pin was not properly installed and dropped and disconnected from the motor. Bought old model for a new price. Ended up with an upgrade, stronger auger design PRO780. Built better with upgrades such as variable speed fan, thicker fire box. Improved auger system with a WIFI. Was planning to upgrade the PRO34 TO WIFI, sure glad it broke and returned it to AMAZON. BOUGHT my PRO780 from a reputable dealer who had more spec info then what was supplied by Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Mathew Duran",
      "helpful_votes": 2,
      "publication_date": 20200710
    },
    {
      "title": "Various issues",
      "text": "The Traeger showed up damaged. The box had been dropped. I suspect it was the shipping company as he tried to assure me the rip in the box was no big deal as soon as he dropped it off. The unit had multiple dents. I opted to give it a shot anyway. Does not reach the proper temperatures (even on a hot day), probes were not accurate within 20 degrees, and the pellet ash tray was full after just a few hours of use and \"smoked out\". That makes the unit unusable for a long smoke.",
      "rating": 1.0,
      "verified": true,
      "author": "Shack",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Broken product.",
      "text": "The item came in and I immediately started to assemble. To my dismay, it was missing handles and the legs to the device wouldn’t fit. On closer inspection, the whole side of the grill was dented and distorted. Do NOT buy from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Ricky G",
      "helpful_votes": 4,
      "publication_date": 20200515
    },
    {
      "title": "2nd traeger",
      "text": "What can I say...its a traeger. Awesome. Worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank B",
      "helpful_votes": 4,
      "publication_date": 20190623
    },
    {
      "title": "Amazing smoker!",
      "text": "I have never personally smoked meats before however I have been around the process. This smoker was easy to set up and the operating instructions are clear. This smoker is truly a set it and forget it model as the temperature control works amazing! It comes with meat probes to ensure each type of meat reaches the appropriate temperature and the best part about it is that it is all digital. The meat thermometers and the actual grill temp can be seen from the outside so the lid never needs to be opened. All in all this is a great brand and I am completely satisfied with the ease of operation and final product it produces!",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Nugent",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "No owners manual included.",
      "text": "The package contained no owners or assembly manuals. When I looked on the Traeger website for tips and instructions to assemble, they show a whole \"Start here\" box that comes with the grill. My grill did not have this box so who knows what else I may be missing. Now I'm stuck looking for an online assembly manual when I should have had this completed by now.",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse R.",
      "helpful_votes": 3,
      "publication_date": 20190728
    },
    {
      "title": "Arrived damaged",
      "text": "After eager anticipation of the arrival of our smoker, it arrived significantly damaged. I now have to wait another week for a new one, hopefully one that isn’t damaged. I’ve waited several years to make this purchase, so I am quite disappointed. Will review again once I receive one that is in good condition.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Wagner",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Best Purchase Ever!",
      "text": "Best birthday surprise ever for my amazing husband! He was so excited when our Traeger Grill smoker arrived. The first time that he enjoyed putting something together. The recipes and food that he has made have been “home runs”! It can hold so much more than the first one. Perfect for our family dinners and hosting friends!",
      "rating": 5.0,
      "verified": true,
      "author": "signa morgan",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Food is fantastic!",
      "text": "Did not dislike anything about the grill/smoker. Took a few times using it to get the time to cool down. Without direct flame it’s a small learning curve. Everything that has come off it, salmon, chicken, burgers and a pork butt has been fantastic! Love the grill!",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick A. Schwomeyer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Not for me.",
      "text": "Pellets are too expensive, too big to get warm or even cook, a smaller one might be better. Power goes out all the time at my house and this does not work if the power goes out where propane does. I sold this for half the money, not worth the hype .",
      "rating": 3.0,
      "verified": true,
      "author": "ANTHONY MAIERS",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Arrived damaged - twice!",
      "text": "This item arrived the first time damaged with clear damage to the box and dented in such a way that a leg could not be installed. We called and replaced it only to receive the second one damaged, as shown in the pics. At this time we can only return it - limited number of replacements per order. But the cost of this smoker is now more than double what we paid originally. Currently scheduled to have the item picked up and returned - I hope that goes better than the rest of this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Works Great!",
      "text": "In our first time use we smoked 2 racks of ribs, 2 large chickens, and a 10 pound beef brisket. Everything came out better than imagined!",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Doesn’t live up to its name UNRELIABLE",
      "text": "Unfortunately, have had this smoker for only a couple months and have not even used it 6 times. The flame constantly goes out and when we contacted Traeger to get advise, it was useless. The auger doesn’t seem to be pushing pellets through, so now we are instructed to take the grill apart to investigate. I’d expect them to stand by their product and repair or replace the item given how new it is.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon Moayeri-Mina",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "This is as great as everyone says it is.",
      "text": "Once it's set up, it is so easy to use. Same great taste as a gas grill but so much easier to use. No guessing when to put things on. Everything comes out so good. This is by far the best grill we have ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Barton",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "My husband loves his Traeger Grill",
      "text": "Got this grill for my husband, took a little longer for it to come but when he got it he was very excited. He has cooked on it several times since he got it and he loves it. Hopes to have it and use it for many years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee A. Lincoln",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great Grill & Temperature Control",
      "text": "We have really enjoyed using this grill. It does a great job.",
      "rating": 4.0,
      "verified": true,
      "author": "KIF",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Please check your grill before the delivery company leaves.",
      "text": "Product had several dents in it about 3 to be exact. After removing it from the box. Even the hopper had a dent. I guess it gives it character! The box wasn’t in the best of shape. So that should’ve been a sign. But everything works so far. I wish it would’ve come with a shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hydron",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Worry free",
      "text": "Love this smoker, it makes smoking meat task free for me.",
      "rating": 5.0,
      "verified": true,
      "author": "P.K.",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "This Traeger is super easy to use",
      "text": "Was always afraid of smoking meats, not anymore! This Traeger is super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "El Jeepo",
      "helpful_votes": 4,
      "publication_date": 20170625
    },
    {
      "title": "Five Stars",
      "text": "Best money I have spent in a very long time",
      "rating": 5.0,
      "verified": true,
      "author": "Kim F.",
      "helpful_votes": 4,
      "publication_date": 20161212
    },
    {
      "title": "Great product! Great service",
      "text": "Grilling/ smoking never been easier. A rookie couldn't screw this up! Great product! Great service!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170815
    },
    {
      "title": "Never going back to charcoal",
      "text": "Tired of propane and charcoal- Fast warm up and easy to use- should have included a shelf for the price. Blower is a bit loud - smokes and cooks evenly. Can cook 8 whole chickens at one time with no flare ups!",
      "rating": 5.0,
      "verified": true,
      "author": "Barefooter",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Go for bigger",
      "text": "Definitely go for the larger size, it’s worth the extra $",
      "rating": 5.0,
      "verified": true,
      "author": "Bmfharding",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Very good brand",
      "text": "The best investment ever. We are enjoying delicious and easily cooked meals.",
      "rating": 5.0,
      "verified": true,
      "author": "Irina",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "This thing is amazing!!!",
      "text": "I use this thing to cook all the time and it’s absolutely awesome. So easy to use and the possibilities are endless. You can literally cook almost anything on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Temp swings.",
      "text": "I am still figuring some things out but have had it about a month and a half now. The only complaint I have is the temperature swings. I might be watching it too closely but feel like the temp swings 30 to 40 degrees for a few minutes when it drops new pellets in.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "DON’T BUY THIS GRILL",
      "text": "This is a terrible product. DON’T BUY THIS GRILL. I have used it probably 5 times and it’s already broken. I will be trying to return it because it will not heat up. I don’t hear the auger feeding the pellets anymore. This product is not dependable.",
      "rating": 1.0,
      "verified": true,
      "author": "chris niehoff",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Perfect gift!! For sure to get you laid!!",
      "text": "The perfect Christmas present!! He loves it and it has definitely cut down on my cooking time... he wants to Traeger everything and I love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Pro-Chef Approved!",
      "text": "I am a professional chef. I've just purchased a catering kitchen trailer with a barbecue deck on the rear. This beautiful grill will be put to work, and after a couple of trial runs, I'm feeling confident that this is exactly the right smoker/grill for the job!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Stayner",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "We found the “missing” leg!",
      "text": "We found the leg and caster! We thought it was missing because it was not with the other legs. The “missing” leg was under the grill packaging.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Very good grill",
      "text": "Very easy to assemble. This is well worth it. I am going to be doing some real cooking now.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Amazing",
      "text": "Best BBQ and smoker! Easy to use app has a lot of recipes, ideas and how to videos. Should’ve gone with pellets years ago",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN CLOWE",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great product",
      "text": "My husband loves it and we’ve used it for weeks now",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "IT IS BEST TO KEEP THIS GRILL AWAY FROM MOISTURE",
      "text": "tried this grill for the first time on memorial day , easy cooking compared to charcoal ,",
      "rating": 5.0,
      "verified": true,
      "author": "p graham",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Damaged",
      "text": "We love our Traeger but when Unboxed found that one side was damaged. Dented in.",
      "rating": 4.0,
      "verified": true,
      "author": "Marebear",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Very happy customer",
      "text": "I can't say enough about their product it's worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Matlack",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Temperature control is not good.",
      "text": "This grill has been a disappointment. It’s suppose to get up to 450 degrees, but it barely gets up to 300. Not sure if it’s a bad heating element, but not happy with the product after spending so much money on it.",
      "rating": 2.0,
      "verified": true,
      "author": "Domenica Koch",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Happy Hubby",
      "text": "Got this for the hubby for Father’s Day!! He absolute loves it! Food tastes so much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Arrived Damaged",
      "text": "I read reviews that others received damaged goods from this seller by we took a chance. Totally dented on the side. Delivered in a box with wet corners. Had high hopes. Now have a dented 700 dollar grill.",
      "rating": 1.0,
      "verified": true,
      "author": "tammy cole",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great grill.",
      "text": "Excellent construction. Easy to assemble. Works perfectly. Doesn’t get as hot as I hoped but does a good job.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg Bruton",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great smoker",
      "text": "Good smoker. Temperature fluctuates quite a bit but that might be normal. Very happy with purchase and excited to what I’ll make in future",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell O'Connor",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Very sad",
      "text": "When I put together the smoker it was pretty easy. When we finished it was dented . Very disappointed paying that kind of money and it was dented.",
      "rating": 5.0,
      "verified": true,
      "author": "kittypolly",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Great BBQ",
      "text": "I bought this with the expectation it would be awesome and it has not failed me. You just need to put on the meat and it does the rest. Amazing and would recommend it to all",
      "rating": 5.0,
      "verified": true,
      "author": "G McPhail",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Best smoker ever! 2 thumbs up!!",
      "text": "This is the best smoker that I have ever had! It is so easy to use and clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Excellent",
      "text": "This is amazing, my husband grills everyday, everything he makes takes just right.",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "6 Pack Assembly!",
      "text": "I love my new Traeger grill! It's everything I expected and more! Assembly was very easy when you follow the 6 pack of beer instructions! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle W.",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Damaged",
      "text": "Box came completely damaged and grill inside was heavily damaged. Very disappointed in quality control",
      "rating": 1.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "It's not just a grill!",
      "text": "I've been waiting a long time to buy a Trager, never disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Art",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "This is our 3rd Traeger grill",
      "text": "Of all the models of BBQ's we have looked at- Traeger is the BEST",
      "rating": 5.0,
      "verified": true,
      "author": "Delores Drake",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "works like a charm",
      "text": "I smoked ribs at 180'f for 24 hours and I never had to add any more pellets. The ribs turned out great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Conway",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great Grille",
      "text": "The temperature control is fantastic. It maintains a study and accurate temperature.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard W Guthrie",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "If you light it...they will come!",
      "text": "This grill is so easy to use. Takes a beginner to a pro in no time!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Wills",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "I like my Traeger Grill.",
      "text": "I like ease of use. I like the ability to get a smoked function and gas-like type function on this grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Rorger W. Cornelius",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "5 stars",
      "text": "Fantastic grill. Makes cooking so much easier and the product is second to none.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Traeger's are the best",
      "text": "My kids and I purchased this for my husband for Father’s Day. He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharell",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Love this grill!",
      "text": "I had the smaller, portable one.... but the controls on this one are so much more accurate",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Lloyd",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Awesome",
      "text": "Bought this for my husband. Best thing I’ve done the meat is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon russell",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Beyond expectations",
      "text": "Quality is obvious! This is not cheaply built. We love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyann",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "The controls",
      "text": "I use it all the time to cool. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "robert young",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Outstanding smoker",
      "text": "I have used a variety of smokers over the years, but this one is, hands down, the best ever. It is indirect heat, with a fan that makes it a convection oven. It holds the desired temperature very well as long as needed. At lower temperatures, it puts out great smoke for \"low and slow\" BBQ. We just love this unit!",
      "rating": 5.0,
      "verified": true,
      "author": "James M.",
      "helpful_votes": 7,
      "publication_date": 20170811
    },
    {
      "title": "Great vendor.",
      "text": "Great vendor... the unit .. I am not sure it is worth the price on it. I had it now for a few months cook on it no less than 3 times a week, however it is made of cheap materials so in less than 3 months the bottom is already warped.. bended. I keep it clean and make sure to care for it, but i see myself having to replace the metal that holds the charcoal.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Gallegos",
      "helpful_votes": 6,
      "publication_date": 20170207
    },
    {
      "title": "jUNK",
      "text": "Junk do not buy! Only worked 2 times and after many attempts to contact Traeger they either hung up after 30 to 40 minute hold time sent wrong replacement parts that had nothing to do with issue, Auger wouldn't rotate and was sent new auger., my auger was fine. Poor customer service, I suggest that if your think about buying this item you call first and see hold long you will be placed on hold before you get a person on the other end.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200720
    }
  ],
  "product_meta": {
    "title": "Traeger Grills TFB88PZBO Pro Series 34 Pellet Grill and Smoker, 884 Sq. In. Cooking Capacity, Bronze",
    "description": "Grill, smoke, bake, braise, roast, or barbeque. Features 884 sq. In. Of cooking space - main rack 34 in. X 19 in. (24 burgers), extra rack 34 in. X 7 in. (16 burgers). digital pro Controller with advanced grilling logic. Dual meat probes to Check internal meat temperatures. Sawhorse chassis for added stability. Includes: Hopper clean-out, all terrain wheels with locking casters, cookbook, & assembly tool kit. Fueled by 100% pure hardwood pellets for authentic wood-fired flavor.",
    "rating": 4.5,
    "feature_bullets": [
      "Never use gas or charcoal again: cooking with wood just tastes better. Traeger created the original wood-pellet grill as the ultimate way to achieve wood-fired taste",
      "Versatile barbecue cooking: hot and fast, or low and slow, the Traeger Pro Series 34 pellet grill offers 6-in-1 versatility to grill, smoke, bake, roast, braise, and BBQ food to juicy perfection",
      "Precision temperature control: The Digital Pro Controller rocks Advanced Grilling Logic, which maintains a +/- 15 degree F temperature control to guarantee precision grilling",
      "Sturdy and Durable: Powerful steel construction and durable powder coat finish, easy to clean porcelain grill grates and all-terrain wheels",
      "Large cooking capacity: 884 sq. in. cooking capacity that can accomodate 8 chickens, 7 racks of ribs or 40 burgers"
    ],
    "specifications": {
      "Product Dimensions": "27 x 53 x 49 inches",
      "Item Weight": "163 pounds",
      "Manufacturer": "TRAEGER PELLET GRILL",
      "ASIN": "B07GL7PNPQ",
      "Item model number": "10251",
      "Customer Reviews": "4.5 out of 5 stars301 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#83,424 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Grills & Outdoor Cooking",
      "Smokers",
      "Grills & Smokers"
    ],
    "price": ""
  }
}