{
  "website_summaries": [
    {
      "verdict": "A sleek and stylish phone case with a fun cultural reference.",
      "pros": [
        "It’s lighter and smaller than other series, but it’s also less expensive and easier to wield",
        "This latest case for iPhone X or Xs features designs from Star Wars or Disney animated classics"
      ],
      "cons": [
        "Does not come with screen protection",
        "Case may get scratched easily"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Scratches SO easily.",
      "text": "I’m pretty gentle on my phone, so when I saw scratches appearing on the case days after using it I was really disappointed. It’s been a month since I’ve used the case and frankly it looks like I’ve had it a year. I don’t go anywhere. It sits on a desk or my headboard when I’m not using it. I haven’t dropped it. It doesn’t go loose in my purse. And yet, it’s lost all of its gloss and it’s completely trashed from very basic use. So very disappointed with this case.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela Rick",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Good case",
      "text": "I love the one piece design, it protects the screen by lifting it up off of any surface. I love the Chewbacca picture in the back. However after 7 months the design is showing signs of wear. The color is fading we’re I hold it and it is getting scratched from were I put it down.",
      "rating": 4.0,
      "verified": true,
      "author": "Colin D.",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Princess cases = SCRATCHES",
      "text": "Ordered the Snow White iPhone XS case, shipping was fast but came with scratches. Placed a return for the same product, as I liked the case just wanted one that was new as stated in the listing, only to receive another case that is scratched, equally if not worse. Are your cases brand new? If they’re used I think the prices should be dropped at least another $10 if you’re going to provide used products. Very disappointed. Returning once again",
      "rating": 1.0,
      "verified": true,
      "author": "K Escareno",
      "helpful_votes": 3,
      "publication_date": 20190818
    },
    {
      "title": "Solid Case with Subtle but Awesome Logo",
      "text": "This is a solid case that is a must have for any true sith lord . Instantly upon putting it on my iPhone Xs I could feel the power of the force giving me focus. This case has held up despite the constant drops and abuses by the young padawans. Although I wish the logo would be a little bigger, I've had it a few months now and as you can see the Darth Vader logo has not peeled or washed out. Definitely recommend this case if you want step up your Star Wars game.",
      "rating": 5.0,
      "verified": true,
      "author": "Ish B",
      "helpful_votes": 3,
      "publication_date": 20191208
    },
    {
      "title": "Great case!",
      "text": "I personally love this phone case. I chose Otterbox because I’ve used their other cases before and they are sturdy. I was looking for something protective, but not too bulky and this case is just it! I have two kids and I’m dropping my phone constantly and so far, so good. Plus it has Chewbacca on it so that’s a win all on its own! 10/10 a great case!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200311
    },
    {
      "title": "I loved my cover for the iphone 7",
      "text": "Box itself is quality but Otter box doesn't have any decent looking covers for the i-phone X. I loved my cover for the iphone 7, with pink, black and white stripes, why can't you make one like that in a iphone X??",
      "rating": 3.0,
      "verified": true,
      "author": "SP",
      "helpful_votes": 3,
      "publication_date": 20180629
    },
    {
      "title": "Saved my phone",
      "text": "As much as I try to hold on to my phone, it just seems to want to constantly commit Suicide. Always jumping out of my hand(s)/purse/tables/etc. this case has saved my ridiculous expensive phone. Gone are the days where I could live with free phones, now I neeeeed a gagillion GBs and bunch of camera lens. So, this case has done its job, kept my phone in on piece and functional.",
      "rating": 5.0,
      "verified": true,
      "author": "CinnTaNo",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Meh",
      "text": "This scratches very easily. I had it a day, and the only place that it was in that **could've** been scratched at all was my purse. So I'm assuming my keys rubbed up against the phone case and scratched it.",
      "rating": 2.0,
      "verified": true,
      "author": "LBell",
      "helpful_votes": 2,
      "publication_date": 20180513
    },
    {
      "title": "Artsy",
      "text": "Comic fan here. This case is great. Strong otterbox protection I know and love (with their low-profile line) with a very artsy comic book cover. Plus it's got Rocket Raccoon on it, full stars.",
      "rating": 5.0,
      "verified": true,
      "author": "N00basaurus",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "LOVE IT!!",
      "text": "I LOVE Snow White! It is hard to find Snow White items. This case is really well made by Otterbox. It feels durable and has raised edges to protect the screen. The case has some specs of glitter in it that weren’t very visible in the photos. These are a nice touch! I love this case!!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendeelou ",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Best case I’ve ever had",
      "text": "This is the second time buying this case. Bought the original over two year ago and I’ve dropped my phone many times and never suffered a scratch. I finally wore down the rubber around the charging port and decided to replace it with the same one. It’s so thin, yet protective. My favorite case yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis K B",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Cute design",
      "text": "Like any other clear case, it starts to yellow over time but I think that’s just something to be expected with purchasing clear cases, they’re never going to stay clear. Overall, I love the design, gotten compliments on it. And my toddler has gotten to my phone and dropped it on our tile floor and my phone survived.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki Armstrong",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great Phone Case",
      "text": "It made all my wonderful and wildest dreams come true -as told by my husband.",
      "rating": 5.0,
      "verified": true,
      "author": "Cass",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Good Review Here",
      "text": "Easy to get on and off. Haven’t dropped my phone yet to see how durable it is but I usually trust OtterBox products. Much cheaper to buy Prime than OtterBox. Wonderful art work!!",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Beware of Scratches",
      "text": "I purchased the Mickey Mouse phone case and was happy with what I received. Cute design and looks just like the picture. However, after less than 12 hours (I was working so I didn’t use my phone too much and it was in my back pocket) I noticed 3-4 very noticeable scratches. Pretty disappointed with that because it will just get more scratched with continued use. Overall, I like the slim feel and the design. It just scratches easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "What you expect",
      "text": "Great and awesome case. All to expect from otterbox. Only grip is it super wide. Even with my large hands I find it uncomfortable to hold one handed. But all in all it’s a great case",
      "rating": 5.0,
      "verified": true,
      "author": "E.W",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Not worth the money!",
      "text": "The case was nice at first, seemed very durable and of good quality. However, I’ve had the case for 4 months and the outside edges of the case are not flush, leaving for the back of the case INCLUDING the storm trooper decal to peel and completely come off! Not worth the money at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Great protection!",
      "text": "Love how slim it is. Had a bulky phone case and it was hard to keep it in my pockets. This one makes it feel like your phone has nothing on it. I’ve dropped it a few times and this case kept my phone from getting damaged!",
      "rating": 5.0,
      "verified": true,
      "author": "yasmeen",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Returning item",
      "text": "Needing to return It didn’t fit the phone and unfortunately I missed the return window😢 now I’m stuck with a case I can’t use",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Great",
      "text": "It’s great, it’s Otterbox. But 33 dollars isn’t my cup of tea",
      "rating": 5.0,
      "verified": true,
      "author": "CSŁ⭐️",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Not durable",
      "text": "I’ve been using this case for two days, have not dropped it, but the back of the case (where the design is located, is scratched terribly. It didn’t come scratched (although the packaging had obviously been opened because there wasn’t even tape hoping the box closed), so two days of normal use and it’s scratched to hell.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Best case I've ever had",
      "text": "Durable, feels great in my hand, and fit the phone perfectly. Worth the extra money !",
      "rating": 5.0,
      "verified": true,
      "author": "James Tibbetts",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Pretty",
      "text": "Got this on sale for my sister for Christmas. She loves it. Yay.",
      "rating": 5.0,
      "verified": true,
      "author": "Janee",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Love it!!!",
      "text": "I ordered this phone case because my old one was starting to wear out with age, and being a huge venom fan, I bought this case! I got it brand new, my only issue was the smallest nick in the center of the logo. It’s barely noticeable however, and you can’t see it really at all. I love this, and it glows in the dark!! A HUGE must have for any Venom fan! Keep up the awesome work otterbox!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "It’s good, but....",
      "text": "It’s a good sturdy case. I just feel like the paint is not the best. It’s been chipping away at the corners. Other than that everything about the case is great",
      "rating": 5.0,
      "verified": true,
      "author": "polina tomuta",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Easy scratched and smudged on the back side.",
      "text": "The back part is very shiny, can easily smudged and also scratched susceptible. It also is Slightly thicker than other slim otterbox. Mine already scratched within 2 days due to keys and rubbing rough surface. Very delicate and you have to be really pay attention how you place your phone with other stuffs rubbing off.",
      "rating": 2.0,
      "verified": true,
      "author": "Sugandi Sarosa",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great product - great price!",
      "text": "I love my case, not only does it show my fan-ism for the MCU but the quality of this product is optimal! I look forward to burying more from OtterBox (hopefully more on Avengers will come) but my next one will definitely be a Star Wars case!",
      "rating": 5.0,
      "verified": true,
      "author": "Guadalupe Garcia",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Highly recommended",
      "text": "It holds up really well especially considering how hard I am on phone cases. The artwork is really cool and it hasn’t faded or chipped which I was worried about.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary fowler",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Great price",
      "text": "Color is vivid and being a big Disney fan I lobe this case. Great price and quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Disney Mom",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Love it",
      "text": "It doesn’t sit flat so when I put my phone on the table it spins like a fidget spinner. I appreciate it 😉",
      "rating": 5.0,
      "verified": true,
      "author": "N. Jackson",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Beautiful case!!!",
      "text": "It is perfect! It is the perfect fit for my phone, very good quality as otter box always is! My phone feels very secure and protected, you can’t go wrong with otter box and Disney!! I love this case!",
      "rating": 5.0,
      "verified": true,
      "author": "Susana N.",
      "helpful_votes": 2,
      "publication_date": 20180405
    },
    {
      "title": "Durability",
      "text": "Husband loves it. What not to like. Like the feeling of it and thick enough to protect the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Christin cosuineau",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Back of iPhone X cracked",
      "text": "I’ve had other Otterbox products in the past with no issues, but this product is a disappointment. The back of my iPhone X shattered after I dropped it once. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "SDA",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Cute",
      "text": "This is a good phone cover. It’s super cute, and being in Florida close to the Parks, I get tons of compliments. However, I’m not sure how protective it is. Ask, the pink rubber border gets dirty really easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Pearls",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Perfect",
      "text": "adds a little weight, but that should be expected since it’s an extremely durable case. the artwork looks great and seems to be pretty scratch resistant. otter box makes the best cases.",
      "rating": 5.0,
      "verified": true,
      "author": "Cupiid",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Its great, but wish they made it for Iphone Xs Max",
      "text": "Its great, but wish they made it for Iphone Xs Max, so I had to return it.",
      "rating": 5.0,
      "verified": true,
      "author": "themonkeysin",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Love love love",
      "text": "Love love love worth every penny and my toddler loves it and drops it! Wouldn’t get any other brand besides sonix",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine Goldin Blais Chambers ",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Fits iPhone XS Perfectly",
      "text": "It was easy to put this Otterbox on my iPone. I love the white background with red Mickey heads, and black lettering, subtle but definitely Mickey.",
      "rating": 5.0,
      "verified": true,
      "author": "Nanny32162",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great case!",
      "text": "I love this case! It is very durable has a nice edge that helps protect the screen. Very durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly McDonnell",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Very satisfied",
      "text": "I’m very hard on my phones and this case has protected it as well as the thick clunky otter box cases. It’s thin light weight and so cute. I couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Cute",
      "text": "I bought this case as a gift. It’s very cute and has great protection",
      "rating": 5.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Sleek and subtle",
      "text": "I love the style of this case. I love Star Wars but have to balance being professional and fanboy is the challenge. This case meets that challenge.",
      "rating": 5.0,
      "verified": true,
      "author": "Merritt W Reece",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Awesome case!",
      "text": "This case is is very stylish and protective. The only con I found was that the case itself can get slippery & I have dropped it a few times. But like I said in the begging it does protect your phone",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Alvarado Godoy",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Looks awesome!!",
      "text": "Not really a value for the money, I could have gotten it the same price at the other box website. but it’s a real otter box, and is great for protecting my phone. Got here quickly and the boba fett image is awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Donovan Flores",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great product",
      "text": "So pretty and glossy I wish BB-8 was a shinier shade of gold but oh well. The case is durable. I drop my phone weekly and it’s help up amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Boelts",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Best case for iPhone X",
      "text": "Best Phone case out there hands down. Really sturdy feel. Not too bulky. Clean and minimalistic design. Got the Deadpool design. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "LaujS",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Get it",
      "text": "A sturdy but relatively slim case, with a fully functioning glow-in-the-dark feature, and epic design. What’s not to love?",
      "rating": 5.0,
      "verified": true,
      "author": "GabesaurusRex7",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "What expected, but not durable",
      "text": "it good, but its scratch with the time. For the price should be more durable. It's hard, and a good protection for the cell phone",
      "rating": 3.0,
      "verified": true,
      "author": "Alexandra Caraballo",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Perfect",
      "text": "Was marked as used but looked brand new to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Tuppence",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Good case, terrible paint job.",
      "text": "The case itself is great, the only issue is after less than 6 months, there’s a spot where the image is worn off.",
      "rating": 1.0,
      "verified": true,
      "author": "Zachary and Chelsea Porter",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Scratches really easy",
      "text": "Love the design, but by the second day it was already scratched. The material in the back is like a shiny plastic that scratches really easy. I can’t return it, but I would not buy it again",
      "rating": 1.0,
      "verified": true,
      "author": "Ernedgli Morales",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Solid",
      "text": "Wish that I had this case when I bought my phone!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Whitaker",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Saved my Disney vacation!",
      "text": "Dropped my phone on concrete (bounced twice) then I stepped on it when picking it up...phone survived and case only got a couple scratches! Saved my vacation!",
      "rating": 5.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Durable!",
      "text": "I have had this case for a long time now and it still looks brand new, and trust me I’ve dropped it many times. Super durable and well worth it",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Lueras",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Would Totally Buy Again",
      "text": "The protection is great, and it has Mickey Mouse ears. What more to you need!",
      "rating": 5.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Awesome phone case",
      "text": "Love this case. I still need to get a screen protector, but the case is solid and looks good. Also works with wireless charginf.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Garcia",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Mickey is Adorable!",
      "text": "I love this phone case. I get compliments all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "Elisha",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Fast delivery and excellent quality",
      "text": "Love the glow in the dark feature & how sleek the case itself is. It was very easy to put on the phone & arrived quickly",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Cute case besides cutting into my face",
      "text": "Hurts my face when I talk. Like the edges are too sharp. Very durable as it is an Otterbox though!",
      "rating": 3.0,
      "verified": true,
      "author": "Williams Fam",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Otterbox is the best",
      "text": "Love it. I accidentally dropped a few times (prone time dropping phone) and it’s still nice, no scratches.",
      "rating": 5.0,
      "verified": true,
      "author": "blueecrushh",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "plastic yellows",
      "text": "I hadn’t even used it and when I took it out of the box this morning the plastic was already yellowed :( so sad.",
      "rating": 1.0,
      "verified": true,
      "author": "Irene",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Good case",
      "text": "The back gets scratched up around the edges easily but other than that it has protect my phone pretty well.",
      "rating": 5.0,
      "verified": true,
      "author": "atticus",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Good product!",
      "text": "As promised in the description. This is the second otter box of this kind and I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Hatchett",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Sturdy and good quality product",
      "text": "My iPhone X has had one too many falls. Survived it all because of this sturdy case. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kalyan Bala",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Great buy!",
      "text": "Great case! Huge Marvel fan, so this case is definitely Marvelous!",
      "rating": 5.0,
      "verified": true,
      "author": "Jibby-Jangles",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great value for great quality",
      "text": "This Otterbox Disney phone case is adorable, durable, and is priced below it’s value.",
      "rating": 5.0,
      "verified": true,
      "author": "Leanne",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Broke within months",
      "text": "It broke a few months after use. I spent $45 on this case. What a waste. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Sukhmanii K.",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Protects phone great",
      "text": "Great product and has awesome colors. Super easy to hold on to.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Wilson",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Sleek Design - and Durable",
      "text": "Fantastic product! Sleek and durable. Exactly what I wanted. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Alperen",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Looks great protects the phone!",
      "text": "Daughter is a huge Chewbacca fan. Otter box give Dad peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Wehner Jr",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Ugh",
      "text": "Was wrong product and returning it was to complicatedoh well",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "That it’s not worth $30",
      "text": "Was a really nice case but it got scratched too easy and it got indentions too easy also",
      "rating": 4.0,
      "verified": true,
      "author": "Aiden ",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Fun and sturdy",
      "text": "Love the case. My 5 year old loves it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine N. Smith",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Great Case",
      "text": "This case is sturdy, gorgeous and Disney stylish. I am tough on my cases, hazard of the job, I have already dropped this case about 5 times and other than a few scratches in the corners, which you can barely see it looks amazing! You can not beat the value for the money and is an Otterbox which means quality. Will recommend this style case for any but specially for those like me that are a little hard on our cases. 😬",
      "rating": 5.0,
      "verified": true,
      "author": "BookwormMomma",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Disney Fans!",
      "text": "Big Disney fan here and wanted something fun for my iPhone, very easy to put on to phone and phone seems very secure. I dropped my phone on accident a couple of times with the phone case on and it has withstand scratches and absorbs some of the shocks, even saved my screen from being cracked.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald aka rates",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "It's nice but bulky",
      "text": "This is for star wars fans like me! I did like very much but it's kind of a big and bulky case! it does protect the phone! I do reccomend",
      "rating": 4.0,
      "verified": true,
      "author": "F. Indech",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Fantastic case, scuffs a little, great protection",
      "text": "I've really enjoyed using my OtterBox Symmetry Mickey case. OtterBox has always gone above and beyond in protecting my phone and this case is no different. Pros: Lightweight, sleek, easy to hold, great protection, love the colorful images and of course MICKEY! Cons: A little hard to remove to clean vents/ports, but not that big of a deal",
      "rating": 5.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Perfect",
      "text": "Typical otterbox. I really wanted a sleek case but those just aren’t durable. This one isn’t huge but I can throw it around at the gym and drop my phone getting out of my car without a care in the world. Plus I love marvel and the colors",
      "rating": 5.0,
      "verified": true,
      "author": "Phoenix",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Fabulous! But...",
      "text": "I absolutely love this case, don't get me wrong! It's the perfect subtle Star Wars accessory for anyone! My only issue with it is that the back can be easily scratched since it has a high gloss finish. I love this case so much nonetheless! I definitely recommend it because it keeps your phone safe and secure.",
      "rating": 4.0,
      "verified": true,
      "author": "TheBlindJedi",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Great case",
      "text": "I really like the Otterbox Symmetry cases. They are very thin but durable and protective. I’m a big Disney fan do this case was perfect for my phone.",
      "rating": 5.0,
      "verified": true,
      "author": "AmaNic",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Very cute!!",
      "text": "Very cute Mickey Case. Sturdy. Arrived fast! Nice packaging! Wish Otter had made the front face rim of the case red instead of black. Otherwise, it's perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Joyful Family",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Unique looking",
      "text": "I love this case. Very unique looking for a super mom’s phone! I bought the used like new from amazon wear-house, but it came with fee scratches already which I didn’t mind for the bargain price that I paid. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "alissar",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great case",
      "text": "Easier to hold than I was expecting. My wife loves it. It’s help up well now for about a month- still looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Itsme",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Good quality product",
      "text": "Ive been using this case for a little over a month now and it seems to be holding up nicely. Cute Disney design that my nephew loves to look at.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Newton",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Otterbox for iPhoneXS",
      "text": "Love this case. The Marvel design is great for a fan like myself, and it protects my phone while still being able to charge wirelessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuck in Reverse",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Works great so far",
      "text": "Its Darth Vader in the phone case! So long as it doesn't break I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Superb Product",
      "text": "Amazing product & really cute! The only bummer is that it’s clear so you can see the scratches on it from wear & tear. Other than that, it’s a superb product.",
      "rating": 5.0,
      "verified": true,
      "author": "PRgirlie",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Sturdy and cute",
      "text": "I LOVE this case! It is so sturdy and the fact that BB-8 is on it is awesome (I have a lot of BB-8 stuff) very well made",
      "rating": 5.0,
      "verified": true,
      "author": "Iliana",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "The coolest phone case ever!",
      "text": "This is the coolest phone case ever. There’s grip padding on the sides. I like that OtterBox has a line of thinner cases instead of the bulky cases. The Marvel Endgame design is awesome and certainly a conversation starter.",
      "rating": 5.0,
      "verified": true,
      "author": "Doris D.",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Durable and cool",
      "text": "Glows in the dark, shows everyone you are Venom, protects your phone. What more could you ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean O.",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "The case is good for iPhone X no for iPhone XSMax",
      "text": "Is good material but no the right size for my iPhone XS Max this case is for iPhone X",
      "rating": 5.0,
      "verified": true,
      "author": "Astri ",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Great product",
      "text": "Really liked this product! It was cheaper to buy it here rather than the actual website. Husband loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "jenny",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great quality",
      "text": "This phone case is super durable and has held up great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "A good one",
      "text": "the price went up in a few days after I got this case. It looks great! Too bad couldn’t get another one at the same price anymore:(",
      "rating": 5.0,
      "verified": true,
      "author": "Truth",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "I love everything STAR WARS.",
      "text": "This case is the best case I have ever purchased. It fits my hands perfectly has a nice grip and it’s STAR WARS. the colors are bright and beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi Mathews",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Awesome case",
      "text": "Protects better than I hoped, I have dropped a few times and no breaks so far (knock on wood!).",
      "rating": 5.0,
      "verified": true,
      "author": "chandler",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great product",
      "text": "I absolutely love my new case. As always outter box it worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "LOVE IT!",
      "text": "I have had this case for a couple of months now, it provides great protection for being so small, easy to hold and holds up to being dropped etc. Would definitely buy it again! Maybe star trek next time",
      "rating": 5.0,
      "verified": true,
      "author": "ace powell",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Sturdy but not flat",
      "text": "Cute and sturdy case, definitely protects my phone. My only complaint is that there is a “high point” in the center of the case so my phone twirls if on a flat surface. Highly annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "hd",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Buy it already!!!",
      "text": "10/10 the look and durability are incredible!!! I love the glow in the dark logo/lines and get a ton of compliments. I would definitely buy it again",
      "rating": 5.0,
      "verified": true,
      "author": "lizzy",
      "helpful_votes": 0,
      "publication_date": 20191005
    }
  ],
  "product_meta": {
    "title": "OtterBox SYMMETRY SERIES STAR WARS Case for iPhone Xs & iPhone X Resistance Red",
    "description": "Color:Resistance RedOtterBox Star Wars cases reimagine vintage favorites and unleash new heroes for every generation. Certified Drop+ protection keeps your phone safe and the ultra-slim profile easily slips in and out of pockets. Plus, Symmetry Series installs in a flash thanks to a one-piece design and custom-shaped fit that displays the sleek look of your device. Express your allegiance and live your Star Wars story with OtterBox cases.",
    "rating": 4.6,
    "feature_bullets": [
      "Compatible with iPhone Xs AND iPhone X",
      "Thin, sleek, stylish, pocket-friendly design, with wraparound colors and graphics add seamless style",
      "Easy installation protects and stylizes your phone in a flash",
      "Includes OtterBox limited lifetime warranty (see website for details) and 100% authentic",
      "Dual-material construction absorbs shock and withstands drops, plus raised beveled edge keeps your touchscreen safe"
    ],
    "specifications": {
      "Product Dimensions": "5.9 x 3.09 x 0.48 inches",
      "Item Weight": "1.28 ounces",
      "ASIN": "B07GSB1138",
      "Item model number": "77-58403",
      "Customer Reviews": "4.6 out of 5 stars905 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#8,497 in Cell Phones & Accessories",
      "RAM": "1 GB",
      "Other display features": "Wireless",
      "Colour": "Resistance Red",
      "Included Components": "Cell phone case, Instructions",
      "Manufacturer": "Otter Products, LLC",
      "Date First Available": "August 3, 2018"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Basic Cases",
      "Cases, Holsters & Sleeves",
      "All Departments"
    ],
    "price": 43.0
  }
}