{
  "website_summaries": [
    {
      "verdict": "Kids love this bounce house's roomy play area and bold colors, while parents approve of the easy assembly and reasonable price.",
      "pros": [
        "Cute castle design paired with a wide slide provides hours of fun for up to three kids at a time",
        "Can accommodate 250 pounds",
        "Sets up in minutes and comes with a blower",
        "Affordable"
      ],
      "cons": [
        "Material feels thinner than that of models that come with higher price tags"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Update on previous review",
      "text": "I bought this for my grandson for Christmas and it broke after two months use. Since the return period had expired, I had to purchase another jump house for my grandson who has autism and loves to use this as a safe, fun way to get rid of excess energy. . Thankfully, after my previous review, the seller refunded my money for the second jump house and my grandson is over the moon happy. This shows the seller stands behind his product and has great customer service. I will buy from and refer others to buy from this seller. Thank you, you have made myself and my grandson extremely happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Finch",
      "helpful_votes": 216,
      "publication_date": 20190313
    },
    {
      "title": "Love it!!!",
      "text": "Love it perfect for my 3 year old its pretty big its not as small as i though",
      "rating": 5.0,
      "verified": true,
      "author": "Ramos408",
      "helpful_votes": 114,
      "publication_date": 20190315
    },
    {
      "title": "🌟 🌟 🌟🌟 🌟🌟  Happy k!dz Happy madre!",
      "text": "I hade been checking on price for this item over a year cheapest one before I found this was $600 and I thought I was going to get a very little one I saw at toys are ur for $150 but to my surprise this jumper it's big and my big heavy 💪😁🥊boxer 19 year old son couldn't resist going in I really thought it was over for poor jumper but nope he enjoys laying there while 3 other kids jump around him",
      "rating": 5.0,
      "verified": true,
      "author": "CASTILLO J",
      "helpful_votes": 29,
      "publication_date": 20190912
    },
    {
      "title": "Exactly as pictured. Love this!!",
      "text": "Plenty big. Can hold several kids. Even my husband and I can get in and it still holds air really well! My kid loves it and all the other kids that come over and jump in it. Can’t wait to get it outside this summer!",
      "rating": 5.0,
      "verified": true,
      "author": "Casey kemp",
      "helpful_votes": 28,
      "publication_date": 20190307
    },
    {
      "title": "Blower Broken",
      "text": "We bought this in September and used it a couple times over the winter (under 10). When we brought it out to use now that the weather is getting is warmer, the blower has stopped working. The reset button will not stay depressed and I tried emailing Action Air and have not been able to get someone to respond to me. I am extremely disappointed as we have hardly gotten any use out of it!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessb326",
      "helpful_votes": 5,
      "publication_date": 20200513
    },
    {
      "title": "Buy this now don’t hesitate!!!!",
      "text": "I have 4 boys! I ordered this for my 7 year olds birthday party and it was a HIT!!! It’s was easy to set up and it’s sturdy and the size is just right!!! It is perfect!!! The seller is so awesome and nice!!! I would definitely recommend and I will shop again!!!",
      "rating": 5.0,
      "verified": true,
      "author": "samantha",
      "helpful_votes": 4,
      "publication_date": 20200607
    },
    {
      "title": "Great bounce house!",
      "text": "Great bounce house. Was honestly afraid it would be too small or not quality enough to hold up to my 8 year old and 5 year old— but it has been perfect! They love it, arn’t bored, and we love that they want to play outside! Easy to fold up (but doesn’t go back in the cart bag well) Get it — it will be a hit!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Thompson",
      "helpful_votes": 3,
      "publication_date": 20200908
    },
    {
      "title": "Slide ripped within 2 weeks",
      "text": "Disappointed - I bought this for my son’s birthday and within 2 weeks the slide ripped. Now the bouncy house will not inflate and my 8yo and 3yo are sad. When I went to my order information I could not figure out how to reach out to the company.",
      "rating": 1.0,
      "verified": true,
      "author": "Redfish222",
      "helpful_votes": 4,
      "publication_date": 20190920
    },
    {
      "title": "Received defective item (poor seams)",
      "text": "I received a new unit and upon setup noted that the stitched seams had quality issues (bad sewing), I contact the vendor and once they had pictures of the issue promptly sent a replacement, took about 10 days. I have had the chance yet to try the replacement to see if it has any QC issues. At least the seller was attentive and replaced the defective item (sent a replacement house only no fans of other stuff which is fine). I will update this review once I have had the chance to look over the replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl J.",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "The nap maker",
      "text": "Bought this while we’re social distancing to burn some energy. My 3 year old and 4 1/2 year old love it and bounce until they’re sweaty. Then take an awesome nap. We’ve blown it up only a handful of times for 30-60 min but seems super durable. Will update if I need to!",
      "rating": 5.0,
      "verified": true,
      "author": "soonersonia",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Must read, honest and truthful review!",
      "text": "This product isn't that big, but it is completely worth buying! 💥Pros- it's worth every penny, also just the right sizes for (PETITE) 3-7 year old only. 💥Cons- if you have heavy children it will deflate often. Because it's not big at all. -only about 5-10 petite kids at a time, heavier kids had to find something else to do, or it will deflate. P.S order a bigger one if you babys on the heavier side!",
      "rating": 4.0,
      "verified": true,
      "author": "KayKay",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Holes all over.",
      "text": "I received bounce house today and when it was inflated upon inspection I could hear air coming through and visibly see tiny holes all over bounce house. Description says THICK and DURABLE. I mean seirously.. I literally just unboxed and inflated this and already has holes all over. Very upsetting.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristin T ",
      "helpful_votes": 3,
      "publication_date": 20190718
    },
    {
      "title": "Fun time!",
      "text": "I bought this product because I always have outdoor birthday parties for my son and I was done borrowing the neighbors. I compared the price to a few other websites and decided to order. So glad I did we love using it in the backyard whenever there is a party or if my son just has a friend over! Folds up back into its box and is very easy to inflate.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Not as good as Little Tykes.",
      "text": "We bought both this one and the Little Tykes bounce house. This unit seemed fine, but the material is noticeably thinner. That alone was enough for us to choose the Little Tykes one. If you wait for a sale (as we did) the Little Tykes one can also be had for cheaper.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin Esplin",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "BUY IT!",
      "text": "At first, I was a little skeptical Bc of the other comments stating it was not durable. However, once I read about the customer service I knew I had to purchase. I am very happy I did because this met my expectations 100% I was in between this one & the little tikes one. I’m happy I went towards this one. My one year old even had fun jumping. As well as kids under 5! They loved it so much. If you’re considering this bouncy house, go for it! I was renting one every time. I should’ve purchased this one a long time ago!",
      "rating": 5.0,
      "verified": true,
      "author": "X",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Great quality and fast shipping.",
      "text": "Ordered this for my two year old but my little cousins who are tall little gals as well as my niece and nephew all can jump in there with no problem. There is a weigh limit but even with my toddler and four other big kids this thing was pretty strong. Easy and fast to blow up, and easy to put up as well as long as you deflate it all the way. It fits in the carry bag just fine. Overall great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Garsaya",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Awesome product that can be assembled fast and easy with convenient storage ability",
      "text": "This is a great bounce house for parties. Great investment because to rent one of these is the same price. Now we can break this out whenever we have a small get together. Easy to set up and a convenient storage bag that is small enough to store inside our house. I would highly recommend buying this for people who have little kids especially during this pandemic.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew M. Malone",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "A toy for them, something to drain their energy for you!",
      "text": "Bought it for my toddler's birthday and it is one of her presents she still asks for. Plus, it does a great job at wearing her out. Takes only a few minutes to inflate and, once you get the hang of it, less than ten to put away. Small enough to fit in our yard, but big enough for me to jump in with her. Got a tiny hole in the seam after 5 months, but was super quick to repair. For the cost, a great investment.",
      "rating": 5.0,
      "verified": true,
      "author": "MaikaJacoba",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Great bouncy",
      "text": "We purchased this bouncy last fall and some reviews made me a bit nervous but I decided to get it anyways and I’m so glad I did! My son Loves his bouncy and it has held up great so far through a birthday party with a bunch of kids and a few bbq’s and then being used a bunch through this pandemic.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great if not for the tear it came with",
      "text": "Used the item for 10 minutes and found a tear in the ramp seam. besides that it's a great value, kids love it.",
      "rating": 1.0,
      "verified": true,
      "author": "navalsoccer",
      "helpful_votes": 2,
      "publication_date": 20191221
    },
    {
      "title": "AWESOME!",
      "text": "WOW!! This is BIG!! Moved my couch and things out of my living room (for now) and my grandkids and I had a squealing good time! Took it back down....deflates pretty fast and sets up in a minute or so...Folded up til next time. Can't wait to get it outside....Snow on the ground for now....Fun for kids and bigger people :-)",
      "rating": 5.0,
      "verified": true,
      "author": "sandy101",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "As pictured but arrived with small holes",
      "text": "Came as pictures advertised Very easy to inflate. Nice that it came with its own blower. It Did arrive with small holes in several areas. The holes are separate from the seams. They do not seem to be an issue as far as keeping bounce house inflated but should have arrived in perfect condition as I bought it new. Have not tried folding to put away yet so I can’t comment on the ease. Looking forward to setting up in our basement to combat Michigan winter boredom",
      "rating": 4.0,
      "verified": true,
      "author": "Macauley",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Perfect for pre-schoolers",
      "text": "Wish I got this two years ago! Got it for my twins’ 4th birthday party, set it up in the garage, and all the kids loved it. Ranged from 4 to 7 yro. You can see the 7 yros will outgrow it quickly, but perfect for pre-schoolers. I may have lost my garage parking space for a couple of years, but worth it if it tires out my twins!",
      "rating": 5.0,
      "verified": true,
      "author": "T Sam",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Power chord and outlet get too hot to use!",
      "text": "The power chord and inside outlet get extremely overheated as soon as the power is turned on where you can’t even touch the chord with bare hands. Using this is a big liability, afraid it will start a fire. Have not heard back from vendor if this is common or a faulty blower!",
      "rating": 1.0,
      "verified": true,
      "author": "Raven",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "No more jumping on the beds",
      "text": "My kids love this thing. Non stop jumping. Now my beds and couches are saved!! It not made out of the heavy duty plastic like the ones you rent. This is made out of a softer material.",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Priceless",
      "text": "This was purchased so it could be blown up inside and played in inside the house. It is a perfect fit! The fan isn’t loud, it’s sturdy and doesn’t flip around when there is jumping or bouncing around and I feel secure that my child is safe when playing in it. Best purchase I’ve made!! Great investment and has been a literal lifesaver during this pandemic!",
      "rating": 5.0,
      "verified": true,
      "author": "HILARY NELSON",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great bouncer",
      "text": "I have a four year ild and recently had her birthday, They all had a blast using the bouncer. I even let my 10 month old crawl on the mattress and he enjoyed it as well. Very easy assembly but closing it up may be tricky in order for it to fit in the carrying bag. Overall a great thing to have when having kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Not worth the money",
      "text": "After one day the air chamber in the slide broke and blew up 3x the size and it wouldn't stay flat on the floor and couldn't be used",
      "rating": 1.0,
      "verified": true,
      "author": "Lynn T.",
      "helpful_votes": 2,
      "publication_date": 20200713
    },
    {
      "title": "Crap",
      "text": "Within 3 minutes of the bounce house being up, the slide ripped and the whole thing collapsed on my 6 year old. Very unimpressive. This was a gift for my 9 year old and she is quite upset that she can't nice. Shame on this product for giving my kids false bounce dreams.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Whit",
      "helpful_votes": 3,
      "publication_date": 20190810
    },
    {
      "title": "Excellent product",
      "text": "Product arrived quickly and in excellent shape. It is extremely easy to set up and take down. Two toddlers, 4 & 2, enjoy playing on it daily. We haven't taken it outside yet, though we may eventually. It was a great alternative to a trampoline, and safer, in my opinion. We love this bounce house!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacki Byrd",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great Summer Fun!!!",
      "text": "Fantastic! This was a birthday gift for my 5 and 3 year olds and they absolutely love it! Great size, inflates quickly and is super easy to use. Withheld hours of their bouncing and diving. Very much looking forward to using it all summer and into the winter!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Super fun!",
      "text": "Bought this for my grandchildren, best gift ever. So easy to set-up, made well. Hours and hours of fun. Don't hesitate to purchase, you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "flinky",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Good investment!",
      "text": "Good investment and entertainment for the kids a during this pandemic time! The downside is it cannot be easily fitted into the bag, but its not a big problem because we use it almost everyday. Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Joana S",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Ripped Seam",
      "text": "Seam ripped the 3rd time my kids used it. My kids are 5 (45lbs) and 3 (30lbs). I would have expected it to hold up better then that. It still blows up and I did patch it but it’s impossible to keep the seam patched.",
      "rating": 3.0,
      "verified": true,
      "author": "\"cicel23\"",
      "helpful_votes": 2,
      "publication_date": 20200331
    },
    {
      "title": "Live the color and it came with everything",
      "text": "The colors are soooo bright and it seems very sturdy. It came with a target on the wall and two balls that stick to it which I didn’t know about so that was a great surprise. Has the blower and everything you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren ",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Great little bounce house",
      "text": "I ordered this last minute for my daughter's birthday party, since the weather was going to be cold. It fit perfectly inside of our garage, to keep the kids out of the wind! Now, she jumps on it every chance she gets.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Great present for birthday!",
      "text": "So far so good... make sure you sure to supervise kids at all times... they tend to get wild in these things... it's not huge but a few toddlers can wear themselves out for naptime really quick playing in this. (Its not the same size as the ones you rent. Follow the weight limit.",
      "rating": 5.0,
      "verified": true,
      "author": "PapaSmuf2376",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "GREAT FOR FUN IN THE SUN",
      "text": "My nephews love this bounce house. It is super easy to set up. You simply lay it out and plug in the pump. The boys will play with this for hours. It's also very easy to roll it back up after play.",
      "rating": 5.0,
      "verified": true,
      "author": "Zi",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Best purchase during lock down!!",
      "text": "We purchased this right before the shelter in place happened for our 5 year old. It was the BEST decision we ever made! It fits in our downstairs (indoor) perfectly even though we have low ceilings, and on sunny days we lay down a tarp and move it to our backyard. Just perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Corrie Westmoreland",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Perfect for our three kids under 4!",
      "text": "Super easy to inflate, sturdier than I thought it would be, and my kiddos (3.5 year old and 1.5 year old twins) love it!!! Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian Eaton",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Blower quality is terrible",
      "text": "Edit: The seller sent a replacement! I'm so happy, and so are my kids. Thank you!! Here's hoping this one lasts! My kids used this once a week for less than a month and the blower stopped working (plug won't reset). It was great while it lasted, but I would not recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Amazing product to own!",
      "text": "I love this product! It is not only fun for kids to play in, but it brings smiles all around for adults seeing their children play. Worth the price. I went for the action air brand because of it's great customer reviews!",
      "rating": 5.0,
      "verified": true,
      "author": "Lost religion to find christ ",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great value!",
      "text": "We have had the bounce house about a month now, and we think it is great. I did alot of research before buying this one, and pleased with the choice so far. Have had up to 3 kids in it so far, and it held up well. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "rick l davis",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Great find",
      "text": "Everything about this bounce house is great! Being home we needed more to do at home with my toddler!! When it’s not full sun this is blown up with ease. And within minutes you can deflate and put away for another time.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary ann",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great for littles!",
      "text": "We are using for 2 30ish pound children indoors. So far it is holding up and working great. If you're an adult with dreams of jumping with them, you'll need something bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Graham",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Quarantine Stress reliever for the kids",
      "text": "My grandkids are having an awesome time with this doing this Quarantine",
      "rating": 5.0,
      "verified": true,
      "author": "Charles H.",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Strong, safe, and lots of fun",
      "text": "I bought this for my granddaughter. She and her friends had great fun in this at her 4th Birthday Party. Very strong and safe, and she plays on it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "John Hally",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Awesome purchase",
      "text": "Awesome bounce house! Easy to move & set up. Kids love it! Very sturdy. We have had it for a few months and would buy it again. We use it every day",
      "rating": 5.0,
      "verified": true,
      "author": "Busy Mom",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great bounce",
      "text": "My kids love it , I have a 6 , 3 , 2 year olds . They all enjoy and jump inside having fun. Good bounce and come with blow out .",
      "rating": 5.0,
      "verified": true,
      "author": "Lilian Giron",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great product",
      "text": "This was amazing I live in an apartment and blew it up inside it is durable great for outdoors as well it’s the perfect size for my 2 year old. This was his bday gift and you guys did not disappoint ! It’s huge even for indoors we love it",
      "rating": 5.0,
      "verified": true,
      "author": "Rachelle Higgins",
      "helpful_votes": 2,
      "publication_date": 20190616
    },
    {
      "title": "I highly recommend!",
      "text": "I was going to buy the Little Tikes bounce house but went with this one instead because of the reviews. It inflates super easy and is really durable. The cons are it is difficult to get in the carry bag and the jumping surface gets hot quickly. My daughter wore socks and that seemed to be ok. Overall I’m very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Good value, doesn’t last long.",
      "text": "Good value, but only lasted about 6 months of 3 day/week usage. It ended up ripping on the top of the slide as a toddler with socks bounced on it. I wouldn’t buy it again as I’ll opt for something more durable next time around.",
      "rating": 2.0,
      "verified": true,
      "author": "Erin Johnson",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Want a tired kid? Buy it.",
      "text": "Great for moderate sized indoor space like a basement. Works well outdoors as well. My daughter loves it, and that speaks for itself by keeping her occupied!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Ludwig",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Dissatisfied",
      "text": "Bought it last month for my sons party I had to post pone due to wildfires and bad air quality. Finally took it out of the box and blew it up for the first time today and it already had two holes. Very disappointed in the investment I made",
      "rating": 1.0,
      "verified": true,
      "author": "Candace Chambers",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Best money spent ever",
      "text": "We bought this rather than renting a bounce house for a bday party. Best money ever. Now that it’s cold the kids bounce in it every night! Fits easily in our basement.",
      "rating": 5.0,
      "verified": true,
      "author": "Bridgett",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Best gift ever!",
      "text": "I bought two of them for the grand kids for Christmas. They love them! And it’s so easy to put up. It takes no more than a minute for it to inflate. I put it in my garage when it’s raining and they wear themselves out playing in it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Culpepper",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Definitely would recommend",
      "text": "Bought this for my 2 yr old. Its alot bigger than I expected. My 15 yr and 14 yr old ended jumping in. My 15 yr is a boy so you know how rough boys can be. We love it and cant wait to keep using it",
      "rating": 5.0,
      "verified": true,
      "author": "B....",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Big Hit!",
      "text": "No experience with bounce houses but this one seems to be pretty well built and easy to use. Got it out of box and inflated in less than 10 minutes. We’ve used it a couple of times now so it is quickly paying itself off.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryant Perez",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Best Investment ever",
      "text": "BEST investment ever, bought for my daughters party and we use every weekend, it's great to have the kids play for hours out in the yard, there is no trouble going to bed later 🙌",
      "rating": 5.0,
      "verified": true,
      "author": "RJ & Yuni",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Not for indoor use",
      "text": "It says it can be used gor indoor. But there is no way that is possible",
      "rating": 1.0,
      "verified": true,
      "author": "ali hourani",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "THANK U ACTION AIR!!! AMAZING PRODUCT",
      "text": "Awesome product, cant believe it. Great price. Well worth the money. My toddlers love it. Wouldnt suggest big kids use it, it could pop. Fills up in less than a minute. Wish the top was a little taller and there was some sort of shield to block sun. Will use annually. Wore my kids out. Couldn't be happier. Thank you ACTION AIR. YOU GUYS ARE TRUELY THE BEST!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Happy kids!",
      "text": "Great for indoor or outdoor use!! We’ve used it a couple times now and we are not disappointed!! Perfect for our 1 and 6 year olds!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel J",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "So much better than I hoped!  Love it!",
      "text": "Bought for my granddaughters for their birthday. I was told \"BEST PRESENT EVER!\" by the 7 year old. It inflated easily & quickly. It's sturdy & well made & designed. I don't usually write reviews, but this truly deserved a thumbs up! I had concerns when ordering, but am very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Kris Steussy",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "so far so good",
      "text": "have been using for a couple of weeks now. 2-yr old using it daily in the basement. No issues at all, works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil Thomas",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Perfect Size and Easy Set Up",
      "text": "Money well spent! Purchased for my daughters 3rd birthday and it’s been used almost everyday since. The kids I babysit have cried not wanting to go home. Was going to leave it in storage when we went to Japan for 3 years but now I’m sending it with us to bring out on occasion. Fits 4-5 toddlers safely. If this one goes will order from this company again!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Durable",
      "text": "Great bouncy castle/house. Easy to set up and inflates in seconds. Kids enjoy it!! Then easy to deflate, fold/roll up and put in carrying bag.",
      "rating": 5.0,
      "verified": true,
      "author": "11bqb80",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Durable",
      "text": "We've been using it every day since Christmas. Even our 13 and 11 yr old jump on it. Of course, our kids are pretty thin. So far it's super durable and the kids LOVE it!",
      "rating": 5.0,
      "verified": true,
      "author": "Elisha Walton",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Awesome",
      "text": "We bought this for a wedding reception. It was awesome. Kids loved it. Very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "bruce yates",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Great bounce house",
      "text": "Perfect size for my 4 and 6 year old. They’ve had such a blast on it and spent hours on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Bounce away",
      "text": "This bounce house is a ton of fun for young kids. My kids have a blast on this . I keep it indoors and haven’t had any issues",
      "rating": 4.0,
      "verified": true,
      "author": "Bianca",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Pandemic lifesaver!",
      "text": "Bought during the 2020 pandemic for sheltering in place with the grandkids. It has been a lifesaver! They have a safe outlet for all their energy and, best of all, they been taking long naps and sleeping longer at night. Priceless!",
      "rating": 5.0,
      "verified": true,
      "author": "Mamanickles",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Good",
      "text": "Have had it for 3 mos. so far so good! About 6 feet tall, we use it indoors, takes up a pretty good anount of flor space. Fan is loud.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Wolf",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Holds up to rough use",
      "text": "My kids are 5 & 9 and they are super rough. We got it for Christmas and they love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Burton",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Not good quality",
      "text": "Not very good quality. Wouldn’t stay inflated almost as if the blower is not powerful enough. It also tore at the seems",
      "rating": 1.0,
      "verified": true,
      "author": "YMT ",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "Very sturdy for 1-4 children",
      "text": "My grandkids ages 4,7 & 10 played for HOURS on this! It was a fraction of the cost of renting one and we'll be able to use it again in the future! Grandpa wants to blow it up in the basement for winter, but I'm not gonna let that happen 🤣",
      "rating": 5.0,
      "verified": true,
      "author": "Deana M.",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Good material, bigger than expected",
      "text": "Had for a little over 3 months now, no real wear has been noticed. Some stains on front slide from children, there was a small tear from a cat but was patched and havent had any issues. Came a little bigger than expected also, kids love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven chase Barton",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Fun fun fun",
      "text": "My two grandkids think it’s wonderful. When they come it takes two minutes to have a backyard jump house. Very easy to set up!",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty J.",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Love this!",
      "text": "I bought this for my daughters first birthday party it was great. Came in perfect condition, blows up fast and we even went over the weight limit a little (more kids than expected) it held up great! Fits in the basement. Now it’s definitely my go to to tire the kids out they love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Malyssa ",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Good investment",
      "text": "Kids loved it! Gotta sit on it a bit to get the air completely out while folding.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika del Campo",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Kids Loved It",
      "text": "It served its purpose of entertaining the kids. Corner tips did not fully inflated. We got it to fit back in carry bag but packed bag and pump did not fit back in box. Not a major concern, just a nice to have for storage purposes. Overall, I liked the product and was pleased with the performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa D.",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Fun",
      "text": "Very easy to step up. My daughter loved it. I used it once, so not sure about durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Sasha R. Ramlal",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "A++",
      "text": "It was a huge hit for my sons 4th birthday In the description it said 3 kids or under 250 pounds so I was nervous about all of his friends wind to jump on it.. That thing is pretty durable there was like 6, 4 year olds trying to play wrestle mania in that thing...I was so worried but that thing was an A++ .. stars",
      "rating": 5.0,
      "verified": true,
      "author": "Kathrine",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Great value",
      "text": "Kids love it, bought it as a Christmas gift for them and it fits in our living room when inflated, great way for them to blow off steam.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Well done. Recommended",
      "text": "Sturdy, solid and very well done. It serves its purpose and the kids are happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "HORATIU SUCIU",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Great product!",
      "text": "My son loved it. Best gift ever, very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Great Product!",
      "text": "Great for smaller children. Very durable and our small family members enjoy it. Large enough for outside play yet small enough to inflate and use in our finished basement..which is nice. Weather has no real affect on when you can use it. Love that feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Junk",
      "text": "Literally the very first bounce but a 2 year old boy a seek busted and deflated. Junk don’t buy. Ruined a birthday",
      "rating": 1.0,
      "verified": true,
      "author": "tyler evans",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Love this product...it’s everything they say it is.",
      "text": "This product is awesome!! Very easy to set up and very durable. We bought this because our 2 year old granddaughter was visiting. We ended up with 5 girls age 2-8, they had a blast and it also makes a cool place for them to hang out and lounge in!",
      "rating": 5.0,
      "verified": true,
      "author": "kelly simile",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Lasted One Day",
      "text": "Ours had a hole in it after one day of use. Tried to patch it, but the hole just kept getting bigger. The repair tape did not work.",
      "rating": 1.0,
      "verified": true,
      "author": "BMAN",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "I like having this mini bounce house at my disposal.",
      "text": "This bouncehouse is so easy to setup. It inflates within minutes. My 2 and 3 year old loves it. Weight limit is about 300 lbs maximum. (Limit 3 children, 100 lbs or less per child)",
      "rating": 5.0,
      "verified": true,
      "author": "Zoua",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Kids love it",
      "text": "Kids love it. It takes up more room than I thought it would but the kids love it. It inflates in under a minute. When folded and rolled properly, it all fits nicely in the storage bag provided. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Very happy for my sons hit birthday party fun bounce house",
      "text": "Live the design and colors. So far been using it for straight 4 days. And it’s holding it up very good. Was a big hit for the birthday party. Very easy to pack back and put up.. I was even able to set it up in living room on a rainy day 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Worth every penny 🙌🏼",
      "text": "I wish i could give this more stars! Best purchase ever. Kids use this EVERY.DAY in our basement. Have had it for almost a year, two rough boys, and still in great shape. Lifesaver in the winter!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Hall",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "easy to set up",
      "text": "my granddaughter loves it! I set it up it the basement when the weather is bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet  R.",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great little bounce house!",
      "text": "Kids and parents approve. Had it for a week so far and the kids are having a blast jumping on it everyday after dinner (we live in a very hot state).",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great buy!",
      "text": "Inflates in seconds! Great to get kids' energy out on cold winter days. Our 3 boys are pretty rough on it and it has held up great!",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Fun!",
      "text": "Fits about three 5 year olds. Super easy setup. Don't even try to get it folded back into the bag it comes with. Impossible!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Harrison",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great product!",
      "text": "Kids had a blast! The dark blue gets really hot in the direct sunlight. Couldn't play on it half the day. Other than that, a very good product.",
      "rating": 4.0,
      "verified": true,
      "author": "kathy Phillips",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good for small kids",
      "text": "My 2 boys love this! Inflates in no time. Easy to put up and take down. My boys are toddlers.... wouldn't recommend for bigger kids.",
      "rating": 5.0,
      "verified": true,
      "author": "happy consumer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Kids love it!",
      "text": "Great overall! There is a party that won’t inflate all the way although it doesn’t affect the kids.",
      "rating": 4.0,
      "verified": true,
      "author": "mfox",
      "helpful_votes": 0,
      "publication_date": 20181009
    }
  ],
  "product_meta": {
    "title": "ACTION AIR [Updated Version Bounce House, Inflatable Bouncer with Air Blower, Jumping Castle with Slide, Family Backyard Bouncy Castle, Durable Sewn with Extra Thick Material, Idea for Kids(C-9745)",
    "rating": 4.7,
    "feature_bullets": [
      "polyster",
      "[Best Gift Idea]: This bounce house is perfect for gifts and holidays. A great gift for your children any time of the year wherever indoor or outdoor. Perfect for birthday gifts, Christmas gifts or to keep little ones busy whenever. The Action Air Bouncer will delight all children! Adding HITME for more fun now and search ASIN: B085L7FV3S or B085KVY9CZ.",
      "[Safe for Kids]: This bouncer is approved with a Children Product Certificate and has satisfied CPSC tests. The jumping area is surrounded by 3 sides of mesh safety netting to protect your children from falling while jumping. Air leak from all the seams is necessary because the product is inflated by constant air flow and this leakage is required to stop the product becoming over-inflated.",
      "[Extra Thick with Large Jumping Area]: Durable Sewn and extra thick jumping and slidingh area. Inflated size 12'L×9'W×6'H(ft). The inflatable bouncer can easily fit multiple children at one time with a maximum weight of 250 pounds.",
      "[Quick Set Up and Take Down]: Set-up and take down is easily done in under 3 minutes. This jumping castle is portable and perfect for the park, garage, backyard, etc. This inflatable bouncer includes the bouncer, air blower,repair patches,lawn stakes and a portable carrying bag. Easy to use and carry!",
      "[Customer Satisfaction]: Action Air is committed to providing consumers with the absolute best price and value on our entire line of products. All of our products qualify for a 3 months after service, Our service team will provide premium service to help solve any problem."
    ],
    "specifications": {
      "Product Dimensions": "144 x 108 x 73 inches",
      "Item Weight": "40 pounds",
      "ASIN": "B07G3S6VL1",
      "Manufacturer recommended age": "36 months - 10 years",
      "Best Sellers Rank": "#14,321 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars561 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "36 months - 10 years",
      "Manufacturer": "ACTION AIR"
    },
    "categories": [
      "Toys & Games",
      "Sports & Outdoor Play",
      "Inflatable Bouncers"
    ],
    "price": 239.99
  }
}