{
  "website_summaries": [
    {
      "verdict": "Fitbit's improved general-fitness tracker does just about everything well, and covers most everyday needs, including phone notifications. But the Fitbit Versa offers just a bit more.",
      "pros": [
        "The Charge 3 is affordable, lasts a solid week on a charge and can be worn while swimming",
        "It has a larger touchscreen and added features include app notifications, weather, stopwatch and timers",
        "Works with iOS and Android"
      ],
      "cons": [
        "Limited watch faces, and you can't get new ones or apps like the Fitbit Versa can",
        "Single haptic pressure-sensitive side button isn't customizable to start workouts",
        "No music storage or remote playback",
        "No GPS (but syncs with a phone's GPS to record runs)"
      ],
      "aspects": {
        "Design": 8.0,
        "Battery": 8.0,
        "Performance": 7.0,
        "Software": 7.0,
        "Features": 8.0
      },
      "publication_date": 20181110,
      "rating": 7.9,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not buy (yet)",
      "text": "Buggy and crashed constantly. After an update, it now only vibrates and doesn’t display anything. Cannot be restarted. Tech support has been unresponsive in escalation and will need to be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve B",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "This product isn't ready for the market yet",
      "text": "Very disappointed in this product. Only 5 clock faces on the Fitbit 3; there are 11 on the Fitbit 2. The FB3 doesn't show the date, nor does it give a clock face concurrently showing just the time and number-of-steps. Ummm...it's basically it's a step tracking watch; no one at Fitbit thought we might wanna see this info on the clock face???",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Alessandrini",
      "helpful_votes": 912,
      "publication_date": 20181013
    },
    {
      "title": "Excellent upgrade",
      "text": "I absolutely love this Fitbit- it’s my 3rd. A little wider than my Alta but doesn’t feel as bulky. I got the all black design and have worn all day every day for the past week. The clock face with hands (my choice) is so much easier to read than squinting at a digital readout. I love that I can see my steps and heart rate without changing screens. I like that I can see who is texting me - personal choice not having my call alert on. Overall really impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Cate612",
      "helpful_votes": 555,
      "publication_date": 20181027
    },
    {
      "title": "Nice update but NO option to display DATE",
      "text": "I never write reviews but I thought this would be a good one to rate. I've now owned all 3 of the Fitbit HR/Charge watches. This seems like a nice improvement so far. The touchscreen is simple to use and easier than the single button to control everything on the last two models. Huge omission is that the 5 clock faces that it launches with do NOT include a face with with the date like the Charge 2 has. I use the date all the time and will have to begrudgingly grab my phone to check the date now. Fitbit, if you're listening, please update this watch asap to include date! 3 stars for now",
      "rating": 3.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 441,
      "publication_date": 20181007
    },
    {
      "title": "Love it! -- Review Revised",
      "text": "Overall the Fitbit Charge 3 is better than the 2. However, I miss having the date on the clock face. And, the Weather feature very often shows, \"No Weather Data Please Try Syncing Your Phone\" after taping the Weather feature. Even when my iPhone is nearby. So that is an unreliable pain in the ass. Otherwise it could have gotten 5 stars. Raised to 5 stars with new clock face. Weather I am syncing as needed. All other features working perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "STLGUY",
      "helpful_votes": 103,
      "publication_date": 20181018
    },
    {
      "title": "Dead within two weeks and fitbit support is unresponsive",
      "text": "I had high hopes for this product. First the silent alarm didn't go off as scheduled and fitbit's solution didn't solve the problem. Then I updated the firmware. Then it died. The screen is black, a single green light flashing on the back of the device, and it's utterly unresponsive. I've spent at least an hour waiting for the next available agent to help me without it ever happening. As far as I can tell, this is a common problem and a common experience with the Charge 3 and with fitbit.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Gold",
      "helpful_votes": 136,
      "publication_date": 20181016
    },
    {
      "title": "If it breaks Fitbit won't replace it.",
      "text": "Stopped working after two months (screen went blank, won't charge, green lights no longer operating). I've done everything Fitbit listed in their support pages and it still won't start. Contacted Fitbit' s customer support and they didn't do anything except run through the same steps I had gone through (e.g., resetting over and over again). It seems like they're doing everything they can to not honor their warranty. I have contacted them three times and nothing has happened yet beyond just their reps making me restart it twenty times over. I would definitely recommend NOT BUYING THIS PRODUCT because a great number of them are defective AND Fitbit's customer support is very ineffective and really into wasting your time.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 70,
      "publication_date": 20190302
    },
    {
      "title": "Defects. Defects. Defects.",
      "text": "Returned my first one after 48 hours since the screen went dark...but the side button would still cause it to vibrate. This is a very common issue if you read other reviews or the Fitbit help forum. New fit bit last a week on a single charge, which is what I was hoping for. But then, during a sync with a 94% battery the device went completely dead. This is also a very common issue based on reviews and the Fitbit help forum. Maybe I’ll try again with a new device in a few months, but this feels like the case of announcing a release date and being forced to ship a product that just wasn’t ready.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 84,
      "publication_date": 20181019
    },
    {
      "title": "date function removed",
      "text": "Just received my new Fitbit Charge 3, am EXTREMELY disappointed that the date function was removed. So far, I am having other problems with it as well. Maybe those will go away with setup and learning curve but the date is gone. Wish I had my old Charge 2 back.",
      "rating": 1.0,
      "verified": true,
      "author": "Julia McSherry",
      "helpful_votes": 69,
      "publication_date": 20181009
    },
    {
      "title": "DO NOT BUY",
      "text": "I've gone through three of these things in a week. They all ended the same way, sad/frowny face after being on for anywhere from 6 to 24 hours. Don't waste your money on these for a while, too many bugs. Look over the Fitbit forums for this product and you'll find issues of them dying and a ton of connectivity and syncing issues. Finally, the oxygen sensor is deliberately disabled while Fitbit \"works of the best experience possible.\" Save your money and get a Garmin or spend a little more and get an Apple watch.",
      "rating": 1.0,
      "verified": true,
      "author": "Yeshua Watson",
      "helpful_votes": 31,
      "publication_date": 20181121
    },
    {
      "title": "Defective after literally 24 hours",
      "text": "This is a rip off. It worked amazing for 24 hours the. It stopped syncing. I’ve gone through all the trouble shooting online. I’ll be sending it back. It was amazing for the 24 hours it worked but if it won’t sync I don’t want it. It does not work as advertised. I waited a month for this thing. Do not recommend. I just hope I can return it since it was so expensive! If it worked like promised it would have been 5 stars. As is I’d give it zero stars if I could. It was my first Fitbit device but now I’m uncertain if I’d buy another.",
      "rating": 1.0,
      "verified": true,
      "author": "Cali",
      "helpful_votes": 63,
      "publication_date": 20181008
    },
    {
      "title": "Make sure it's compatible",
      "text": "I bought this for my wife. It seemed to connect to her new phone, but stopped working. I told her I would return it, but she got involved with Fitbit and for several weeks they kept trying to get it to connect. They are still stringing her along and now it appears her phone is not compatible. The phone OS is new enough, but the model is wrong. Too late to return for a model that will work. Make sure your phone and devices work before you buy.",
      "rating": 1.0,
      "verified": true,
      "author": "RE",
      "helpful_votes": 27,
      "publication_date": 20190205
    },
    {
      "title": "Notifications",
      "text": "I liked the charge 2 and I love the charge 3. Everything is working great after I installed the updated firmware. Handsome watch and black band. Much easier to navigate. It's a very good fitness watch, not a smartwatch.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S. Metz",
      "helpful_votes": 22,
      "publication_date": 20181018
    },
    {
      "title": "A disappointment",
      "text": "The alarm doesn’t work. The screen awake is bad you have to rise your hand in the air 100 times until it’s finally awake. Honestly I was expecting more. Such a waste.",
      "rating": 2.0,
      "verified": true,
      "author": "Mohammed Alreda",
      "helpful_votes": 68,
      "publication_date": 20181014
    },
    {
      "title": "This was a great purchase",
      "text": "This is my first Fitbit and I think it’s great. I haven’t worn a watch on my wrist in 20 years and it’s really comfortable. Comes with 2 bands - small and large - so getting your size shouldn’t be a problem. It was easy to set up with the iPhone app. I really like this model because it’s water proof. I have showered in it, washed dishes and even went swimming in it with no issues. I’d totally buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "kmleavens",
      "helpful_votes": 19,
      "publication_date": 20181027
    },
    {
      "title": "no hr, no sync",
      "text": "It worked as advertised at first, but just a few days later it stopped syncing and doesnt give heart rate anymore. hr is the only reason i bought it. Ive been off work this week so it isnt environmental, im wearing it correctly as per instructions, and i tried reboot to no avail, but at least it does display the right time. Im returning this one and putting my old beat up charge hr back on.",
      "rating": 1.0,
      "verified": true,
      "author": "daniel",
      "helpful_votes": 21,
      "publication_date": 20181119
    },
    {
      "title": "dead after 3 months",
      "text": "bought this for Christmas 2018, it is now March 2019 and the screen is dead. My wife wears it 4-5 times a weeks for monitoring her steps and activities. The screen went dead but the think still vibrates when you touch it. tried hard resetting it but still nothing. A little disappointed that it was not a made a little better, but electronics are really made cheaply these days. I will try to contact them for a replacement, and then hopefully update the review. My wife really likes it when it works.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Junkie",
      "helpful_votes": 17,
      "publication_date": 20190315
    },
    {
      "title": "Disappointed",
      "text": "There is no ability to tell what day it is, which I didn't realize was important until it didn't have it to use. Had a Charge 2 and liked it a lot, however, for some reason it stopped working. Decided to upgrade to the newer model, if I was buying a new one. I liked it till I discovered the glaring difference between the two devices. I might return and buy a different smart watch.",
      "rating": 3.0,
      "verified": true,
      "author": "Davi-Anne Page",
      "helpful_votes": 31,
      "publication_date": 20181008
    },
    {
      "title": "Don't expect any customer support",
      "text": "This product worked for exactly seven months, using an Android phone. No issues, great. Then it decided to stop syncing with my phone and began to have Bluetooth connectivity issues. Contacted Fitbit several times, went through all the troubleshooting, and in the end Fitbit blames me for it not working because it couldn't possibly be their device. This is my third - and definitely last - Fitbit. I would not recommend unless you own a pricey iPhone because apparently that's the only device Fitbit cares to consistently work with.",
      "rating": 1.0,
      "verified": true,
      "author": "Danette Y. Thompson",
      "helpful_votes": 14,
      "publication_date": 20190531
    },
    {
      "title": "SAD FACE",
      "text": "so after 33 days of use.. i got a sad face.. i ve tried to reset, long reset, disconnect/ reconnect.. one chat support.. called T support twice.. waiting for email from higher tier support. its been two days.. still no answer. i missed AMZ return window by 2 days. when it was working it was great!",
      "rating": 1.0,
      "verified": true,
      "author": "Big T",
      "helpful_votes": 18,
      "publication_date": 20181113
    },
    {
      "title": "Don’t buy this Just buy the charge 2",
      "text": "It’s not perfect but isn’t bad either. I don’t think it’s worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 16,
      "publication_date": 20181101
    },
    {
      "title": "It's Not Completely Ready Yet! Stay with your 2, but when its ready you are gonna love it!",
      "text": "So far I've had syncing issues. I've had to clear the app data and delete the device twice now. I have a Charge 2. This 3 doesn't seem to calculate as many steps. I haven't tested they both at the same time to truly say. however, it wears much better and is more comfortable then my 2. It does so much more, once i can figure it all out. Not gifting the 2 yet as alot of reviews have the 3 dying within a week to 1 month. mine has died twice. will update review later. At this time. stay with your charge 2.",
      "rating": 2.0,
      "verified": true,
      "author": "ceecee",
      "helpful_votes": 11,
      "publication_date": 20181024
    },
    {
      "title": "Easy set up and transition from other brand...",
      "text": "Just replaced my Polar. Love it. Easy to set up and like the additional silent alarms and intuitive dashboard. Very light weight and syncing was a breeze. This was the first day... We shall see what future use indicates...",
      "rating": 5.0,
      "verified": true,
      "author": "JustMe",
      "helpful_votes": 17,
      "publication_date": 20181008
    },
    {
      "title": "LOVE IT",
      "text": "I have owned various fitbit products over the years, and this is by far my favorite. The fitness tracking is linked to the GPS on my phone, however it is extremely accurate as far as I can tell. I have used the tracker to log runs, and lap swims and was pleasantly surprised by the accuracy of the distance measurement for both of those exercises. I did notice however, that the auto recognition does not work ALL the time for some of the activities, so you have to remember to set it when you start an excercise.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 14,
      "publication_date": 20181227
    },
    {
      "title": "Nice update",
      "text": "This is my third model of Fitbit. It doesn’t disappoint. I use the rubber type band while swimming. I bought an additional blue colored stainless band to dress it up. Both the sleeping and heart rate functions have improved. I have POTS postural orthostatic tachycardia syndrome so I like to see my heart rate through out the day and while sleeping. It’s nice that it can be worn swimming to check both time and heart rate while in the pool. I like the bands. They are comfortable and secure.",
      "rating": 5.0,
      "verified": true,
      "author": "salomsl",
      "helpful_votes": 13,
      "publication_date": 20181111
    },
    {
      "title": "Love this one!",
      "text": "Bought the less expensive version a few years ago & really glad I upgraded to this version of Fitbit (the HR Charge 3). It does all I need it to, all I want it to, has some fun surprises, useful new-to-me tools, and I feel it’s growing with me as I move forward in my health journey. It (happily) lacks distracting bullsh*t that people like me (insomniac artist-musicians riddled w/ dissociative tendencies) can get lost in (and pulled/lured off-course by). It’s a powerful tool and when it vibrates to let me know I have 10 more minutes to get steps in this hour, I feel loved. It’s a strange world we live in, but technology is proven good here.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Sadira Dorran",
      "helpful_votes": 10,
      "publication_date": 20190105
    },
    {
      "title": "Heart rate monitor pure failure!",
      "text": "This fitness tracker is pure garbage! Hands down the worse device Fitbit has made. Heart rate monitor is inaccurate and constantly goes out. Listen and listen well... Do Not Buy! Went through all trouble shooting and their escalation team... 2 replacements sent. Still heart rate monitor failure. Why have a fitness tracker that can't accurately keep track of calories burnt, sleep monitoring and heart rate? This device is 100% total failure. Fitbit needs to man up and recall all these devices and stop selling them. this is not a software issue this is all hardware.",
      "rating": 1.0,
      "verified": true,
      "author": "David Drake",
      "helpful_votes": 12,
      "publication_date": 20181205
    },
    {
      "title": "Excellent choice for fitness or smart watch",
      "text": "Works well, has the good Fitbit functions and program but also seems like a solid smartwatch. Compared it to my friends charge 2 and the screen is way way better. Hr monitor works well for me, it's pretty consistent. Steps counter works well too. I owned a surge previously and the charge 3 is better about not reading steps while sleeping/working in an office. Seems more accurate. Also to anyone concerned about Fitbit 's customer service, don't be. It's amazing. My surge stopped reading my hr after 3 months so they just sent me a brand new one. They were nice, very fast, and did more than what I asked.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 8,
      "publication_date": 20181021
    },
    {
      "title": "Don’t waste your money!",
      "text": "Where do I start... When I wake up I’ve already taken 200-400 steps. The touch screen only works when it wants to... when I’m driving it’s counting hills as flights of stairs! (113 flights in 1 day) A 3 hrs drive to work I got 5,000 steps in! I could go on and on! Very disappointed I’ve called Fitbit 3 times and haven’t heard back from them!",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler T",
      "helpful_votes": 14,
      "publication_date": 20181023
    },
    {
      "title": "Waste of money!",
      "text": "Don't buy this product. I can't believe I bought 2 of these. It is already fitbit's 3rd line of this product and thrley still cannot get it right. Go and buy another cheaper one that works better. My mom's $20 fitness tracker is better than this garbage. While I am driving, it tracks it as an indoor biking and guess what, i am not even with my phone!",
      "rating": 1.0,
      "verified": true,
      "author": "rodante mesa",
      "helpful_votes": 14,
      "publication_date": 20181028
    },
    {
      "title": "Product not ready",
      "text": "Is unbelievable that FITBIT would launch a product in this day and age with such shortcomings . Lots of bugs and unfinished functionality . No working silent alarms!!!!!! really . After three weeks of waiting for a fix I finally decided to return my unit and stick with my old Charge 2. After years of being a loyal FITBIT Customer I am extremely disappointed. This company needs to get their game back on track before reliable competition takes them out.",
      "rating": 1.0,
      "verified": true,
      "author": "Phil psg",
      "helpful_votes": 14,
      "publication_date": 20181105
    },
    {
      "title": "Better battery life and screen from Charge 2",
      "text": "Previously had the charge 2 and I'm pretty happy with Charge 3. It has great battery life so far. Also I like the clock face and you have options to have the today's date displayed. I really enjoy that's it water resistant. So whether I wear it swimming or wear it while giving my toddlers a bath I know it will hold up. Overall satisfied with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Cait B",
      "helpful_votes": 10,
      "publication_date": 20181028
    },
    {
      "title": "Disappointed",
      "text": "As a seasoned Charge wearer (both Charge 1 and 2) I havent been able to get any of the new features to work. Even after multiple updates. I havent been able to find a simple stopwatch feature like the Charge 2 had. I feel like a traded features I used on the Charge 2 for a Charge 3 that I dont have to take off when I shower; but without the features I liked. The apps that are \"installed\" dont open and there is very little help in the information section. I'd never trust this thing to pay remotely even if I could get the feature to work. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca Read",
      "helpful_votes": 9,
      "publication_date": 20181229
    },
    {
      "title": "So far, so good - works well!",
      "text": "I’ve had this for a few days now- so far, no problems at all. It had worked well - synced easily to my iPhone and all apps in the Charge 3 are working as expected. I even got the weather to start syncing properly (if yours isn’t, check your privacy/location settings on your phone). I also appreciate that one of the clock faces includes the date now - earlier reviews noted this was a problem. Overall, I’m very happy with the Charge 3!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Thebeau",
      "helpful_votes": 9,
      "publication_date": 20181029
    },
    {
      "title": "Not with it",
      "text": "Horrible step counter Off by THOUSANDS OF STEPS I AM wearing correctly and have it listed on my non dominate arm You have to raise your arms a million times for the screen to display",
      "rating": 2.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 22,
      "publication_date": 20181017
    },
    {
      "title": "Terrible product",
      "text": "Previous owner of charge and charge 2, considering returning it, terrible interface, no date on clock screen, sleep reminder no longer works, this is my last fitbit product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20181018
    },
    {
      "title": "Not what it claims. Piece of garbage. And no real help for is many problems",
      "text": "Not what it claims. Had this Fitbit since Oct. 9. As of yesterday (Nov. 21], it just quit syncing. Doesn’t track your sleep correctly and now it does not sync and with full battery it shows battery needs to be charged. As for sleep, it shows that you were awake at different times throughout the night when you know you were sleeping. I do not recommend this product. Update: don’t waste Your money. GARBAGE. VERY DISSATISFIED",
      "rating": 1.0,
      "verified": true,
      "author": "Anne M. McAtee",
      "helpful_votes": 9,
      "publication_date": 20181122
    },
    {
      "title": "Abysmal hardware quality",
      "text": "After seeing my FitBit products fail more than a dozen times over the past few years, my Charge 3 quit yesterday, and I decided not to seek support from the company. I don't really need this item in my life. No more FitBit.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Owen",
      "helpful_votes": 11,
      "publication_date": 20190403
    },
    {
      "title": "Cracked within one week of gentle use",
      "text": "I had this Fitbit for one week. I did not even make it to the gym with it or any kind of hard wear and tear. Just wore it around my house and on errands. I found a crack in the screen, contacted Fitbit and they have refused to replace it. This is my 3rd Fitbit and was very excited to upgrade. Fitbit states they do not replace for “normal wear and tear”, if this is considered normal wear and tear this watch is extremely low quality. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 10,
      "publication_date": 20190304
    },
    {
      "title": "Not a good pulse meter",
      "text": "I bought it to manage my pulse rate when I exercise. It only measures the pulse rate accurately if I walk slowly without moving my arms. Completely off (by 40 beats/minute) on the elliptical and doesn’t recognize the bike. I can be biking at 20 miles/hour and it says I am at 0.1 miles/hour.",
      "rating": 2.0,
      "verified": true,
      "author": "Louise Amell",
      "helpful_votes": 9,
      "publication_date": 20181030
    },
    {
      "title": "Surprisingly disappointing!",
      "text": "Truth in numbers; if you read enough reviews, you’ll find the same exact complaints I have. Recurring technical issues that multiple updates (and forced restarts) are failing to fix. It just doesn’t wake sometimes. Insanely inaccurate and sometimes outright false heart rate readings. Take it from a remorseful early adopter who wasn’t expecting such a lack of quality from a Fitbit product. I never had this kind of trouble with any of the handfuls of Fitbit products I’d purchased over the years. I bought 2 of these. I wish I hadn’t.",
      "rating": 1.0,
      "verified": true,
      "author": "F. A.",
      "helpful_votes": 10,
      "publication_date": 20181114
    },
    {
      "title": "It is a personal information harvesting device.",
      "text": "It is clunky and hard to use, with zero instruction. It asked to access my music library?!?!? There is no way to change the watch face.... The screen is tiny...basically this is a highly invasive personal information harvesting device....and I don't mean your steps or heart rate.....it is a creepy device that spies on you and reports back headquarters....and I don't mean in a tinfoil hat kind of way.....I mean helping you get healthy comes at a cost of letting Fitbit know EVERYTHING about you. If you limit the access in settings you reduce this to a crappy watch. (It's a crappy watch any way you have it configured.)",
      "rating": 1.0,
      "verified": true,
      "author": "Cus Tomer Sir Vice",
      "helpful_votes": 5,
      "publication_date": 20191010
    },
    {
      "title": "Don't waste your money",
      "text": "I've had my Fitbit charger for 3 months and it went bad. I'm going on my 3rd replacement and still having the sad face in less than 24 hrs. of being replaced. I contacted Fitbit and they don't want to give me my money back. I'm at a lost with this. So please don't buy this product it's a waste of your money and time.",
      "rating": 1.0,
      "verified": true,
      "author": "Maria Tillman",
      "helpful_votes": 11,
      "publication_date": 20181215
    },
    {
      "title": "Why fix something that isn’t broken?",
      "text": "Why fix something that isn’t broken? You would think they were just improve on the monitoring process four fitness (Heart rate, sleep analysis, steps).. no they make a laggy display that can’t even show the digital time, heart rate and date. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Dcs55030",
      "helpful_votes": 12,
      "publication_date": 20181030
    },
    {
      "title": "Best fitness watch period",
      "text": "Light, long battery life.love the apps they have. Does what it does really well. Very affordable. I wear it 24x7 now. Had an Apple Watch and got tired of removing it time and again for recharging it every day almost. Charge 3 lasts close to a week and charges in a jiffy.",
      "rating": 5.0,
      "verified": true,
      "author": "amazontribal",
      "helpful_votes": 8,
      "publication_date": 20181102
    },
    {
      "title": "Inaccurate heart rate",
      "text": "Garbage The heart rate is very accurate when resting but totally inaccuarte when walking. I tried trouble shooting and talked to customer support but that did not help. Will likely return this. If the heart rate is this poor, I have no faith in the sleep and other features.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Jones",
      "helpful_votes": 9,
      "publication_date": 20181122
    },
    {
      "title": "Do not buy this product. It is faulty.",
      "text": "I have had this for approximately 70 days. It no longer works at all. Over the last week it slowly started malfunctioning to where it just has a solid black screen. I took great care of this product and never even showered in it. I thought it needed charged but I checked it after 30 min and still a solid black screen but it was so hot I thought it was gonna explode or catch fire. Do not waste your money as I did. I did not buy the warranty because I take care of my things. This is a bad product.",
      "rating": 1.0,
      "verified": true,
      "author": "The Mailman",
      "helpful_votes": 8,
      "publication_date": 20190427
    },
    {
      "title": "Died after just two months of use.",
      "text": "I purchased this as a gift for my husband . He had a Garmin Vicodin for almost five years before upgrading to this Fitbit model. He asked for a new sport watch because he could no longer find the replacement batteries for his old one. So the rechargeable option on this watch was what sold it for me to give as a gift. After two months of use the watch no longer recharges nor will it sinc to his phone. It is useless. Of course it is now past the 30 day return window and it cannot be returned. While the older Viviofit was a good reliable watch, I do not recommend this upgrade model.",
      "rating": 1.0,
      "verified": true,
      "author": "Lgidget",
      "helpful_votes": 6,
      "publication_date": 20181213
    },
    {
      "title": "The product is broken",
      "text": "The watch stopped syncing and cant pair with fitbit or bluetooth. I just chatted with support for 2 hours and now they're escalating the case to a \"charge 3 specialist.\" Couldn't connect Charge 3 to Samsung s8 Active or Windows 10 PC. This is a little ridiculous, either I got a defective watch or their product is just broken. Regardless, I have to go through hours of support to get their product working.",
      "rating": 1.0,
      "verified": true,
      "author": "Roi",
      "helpful_votes": 9,
      "publication_date": 20181112
    },
    {
      "title": "Inaccurate - counts steps/stairs while driving!!",
      "text": "I read the reviews that it was inaccurate and thought - that won't be my experience. Well - I was wrong. On a 4-hour road trip, it said I climbed 67 flights of stairs and walked a marathon. Every road trip (and I have lots) it counts stairs and steps! I have tried clearing the data, setting it to non-dominant hand, and it is still inaccurate. To be fair, once set to non dominant hand it at least counts my actual stairs and steps correctly. I have not been cycling since the purchase so I don't yet know how it will do with that. I DO NOT recommend the Fitbit Charge 3.",
      "rating": 1.0,
      "verified": true,
      "author": "pscvpm",
      "helpful_votes": 6,
      "publication_date": 20190225
    },
    {
      "title": "Do Not Buy",
      "text": "Glitchy. I have had this Fitbit for 3 weeks. Twice, it stopped being recognizable by my other devices and wouldn't sync. I have spent more time with Fitbit customer service reps to get it back up and running. The first time, we basically had to reset it and I lost all my data. According the Fitbit forums, this has been an ongoing issue. If I could, I'd return it & get an Apple Watch.",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 8,
      "publication_date": 20181029
    },
    {
      "title": "Excellent Upgrade From Charge 2!",
      "text": "After reading a lot of negative reviews at the initial launch of this device, I was skeptical of whether or not this would be a good upgrade from my Charge 2. So I waited to get it until Black Friday deals were in, and I have to say - I LOVE the charge 3! The addition of timers, weather, and a better screen is really all I could ask for in an upgrade. The charge 3 also just looks nicer on the wrist. I hope some of the negative reviewers give this product another chance, because it really is a winner for Fitbit!",
      "rating": 5.0,
      "verified": true,
      "author": "Blake G.",
      "helpful_votes": 4,
      "publication_date": 20181201
    },
    {
      "title": "So disappointed. Beautiful tracker that doesn't connect or sync reliably.",
      "text": "I was very excited about the Charge3. I've been using my Charge 2 for almost two years, and it is very reliable. Unfortunately, my new Charge 3 wouldn't connect reliably to my Google Pixel when starting a run. Unlike the charge 2, where I could just click the button and start my run, the charge 3 would repeatedly fail to connect. After several minutes of fiddling with the Fitbit app on my phone, it would eventually connect. I did this for about week, and then gave up and sent it back. Syncing throughout the day was also an issue.",
      "rating": 1.0,
      "verified": true,
      "author": "J D",
      "helpful_votes": 7,
      "publication_date": 20181121
    },
    {
      "title": "3 days from the arrival, it doesn't work",
      "text": "3 days from the arrival, it doesn't work and cannot reboot. I ask support center, but don't receive the answer.",
      "rating": 1.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 54,
      "publication_date": 20181015
    },
    {
      "title": "Worked great for 2 wees then won't sync",
      "text": "I just got off the phone with tech support regarding this new Charge 3 since it worked okay at first then suddenly stopped syncing. After 30 minutes on hold and then almost two hours with two different tech support people the situation remains unresolved and the second tech finally gave up and said to just return the tracker which I am doing today. Sadly this was a Christmas present for my wife and now she is back to her old Charge 2. Reasearch, which I should have done prior to purchase, indicates that the Charge 3 is plauged with multiple problems and is not ready for prime time. Don't buy one!",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Mulligan",
      "helpful_votes": 5,
      "publication_date": 20190113
    },
    {
      "title": "Very functional!",
      "text": "I love that I can wear this in the shower, and enjoy the notifications!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon & Julia",
      "helpful_votes": 8,
      "publication_date": 20181019
    },
    {
      "title": "Charge 3 vs. Versa vs. Versa Lite - With Charge 3 - Less = More",
      "text": "I love my charge 3 so much! It's simple, sleek, and works well logging my exercise manually AND automatically. I've tried out the Versa and Versa lite as well. In my video I review and compare the Charge 3 with the Versa. Definitely check it out and decide which one makes sense for you! $119 is a great price for this device....also subscribe to my Youtube channel for more fitness tracker and other tech videos! @Justin_tech",
      "rating": 5.0,
      "verified": true,
      "author": "Justin_tech",
      "helpful_votes": 7,
      "publication_date": 20190606
    },
    {
      "title": "Released too early",
      "text": "The first unit I received was completely DOA. The replacement worked fine for a few weeks, but in the last week been shutting off randomly, and will not restart until plugged into the charging cradle, which means it's basically useless until I get back home. These issues seem to be extremely common and there's no word of a fix incoming, so back to Amazon it goes for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Lundy",
      "helpful_votes": 9,
      "publication_date": 20181102
    },
    {
      "title": "Lasts 4-5 months",
      "text": "When it works it did what it claimed. I got my first unit in Jan and by April the face was scraped and it wouldn’t do anything but buzz randomly on my wrist. Tech support sent me a new replacement unit in April and now in Nov, it’s doing the same thing as my old unit. I work a desk job and the most abuse this gets is when I wash dishes, I don’t even wear it in the shower. Not durable and the features aren’t enough of a wow that I would bother with a third one. Floor counts aren’t correct but I haven’t had issues with step counts. Sleep tracking seemed good while it worked.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa Macrae",
      "helpful_votes": 3,
      "publication_date": 20191125
    },
    {
      "title": "3rd Fitbit DO NOT BUY",
      "text": "This is by far the worse Fitbit I have ever seen, it does not even sync. Go to the Fitbit website and see for yourself. Sync issues, do yourself a favor DO NOT BUY, I missed the return dat by 4 days...,",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20181112
    },
    {
      "title": "Fitbit Charge 3",
      "text": "I usually am horrible with mechanical things. My son recommended this one. I actually set it up myself yesterday. I checked it regularly and watched it record everything. I checked online to see my sleep from last night. So far I am very pleased with this and hope it continues to work for me. I highly recommend this, if I can set it up anyone can. UPDATE, I started to have problems with the Fitbit. It would not scroll so I requested a replacement. It was sent out that day and I already have it. I have returned the first one. There was no questions asked. Great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 4,
      "publication_date": 20190222
    },
    {
      "title": "Don't waste your money",
      "text": "I have had repeated problems with this. It stopped syncing twice, now it is not taking a charge. I have no record of steps or sleep (which is the reason I bought it). However for some odd reason it shows calories burned and nothing else. Going back to my original Fitbit - basic but reliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Beverly Brinson",
      "helpful_votes": 9,
      "publication_date": 20181202
    },
    {
      "title": "Don’t waste your money!",
      "text": "Hated it! It stopped working (black screen) after 2 weeks! Went back to my Alta hr 0 stars",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 12,
      "publication_date": 20181028
    },
    {
      "title": "Upgraded, sure, but still pretty standard UX... similar to Charge 2 and Alta",
      "text": "I've had a few Fitbits over the past few years and the Charge 3 is honestly probably my favorite so far. Nice big display options, seems to track my movement better than the Alta, and still just as easy to use with the Android app. Had a few syncing issues about a week after getting it but as usual the FB help forums had an answer that eventually worked (so far). Extra features like timed relaxation/breathing exercises are new and different...not particularly my thing but could definitely be helpful to others. I also appreciate that they brought back the counter for flights of stairs.",
      "rating": 4.0,
      "verified": true,
      "author": "SassyBassilisk",
      "helpful_votes": 23,
      "publication_date": 20181022
    },
    {
      "title": "Mediocre. Unfortunately.",
      "text": "I had the previous model and was really happy until it just gave up one day. It was close to perfect ( except battery life which was ok). Do you think they would learn? Yes. But some cool Product Manager tried to mess with each and every feature and had to tweak and change it and it really lost its minimalistic but very functional beauty. Now it’s just a feature laden gimmick. You need another/ different charging cable, the old wrist bands don’t fit any,ore. And overall it has just become less intuitive. More steps/ clicks and even the app annoys you constantly with tips and messages you really don’t want. Mediocre. 3 Stars.",
      "rating": 3.0,
      "verified": true,
      "author": "jagxtreme",
      "helpful_votes": 2,
      "publication_date": 20200320
    },
    {
      "title": "Don't waste your money",
      "text": "This fitbit worked for about a month and today it died on me, its not responding at all, i have tried resetting it but even that did not help. When attach it to the charge clip it shows the smiley face and thats it. This product is useless i am so disappointed. I am not even able to return it as i am traveling abroad",
      "rating": 1.0,
      "verified": true,
      "author": "Hussain Al Naamani",
      "helpful_votes": 9,
      "publication_date": 20181102
    },
    {
      "title": "Extremely glitchy",
      "text": "I love Fitbit- this is my third device. I like the app and find their step trackers to be moderately accurate. I chose to get the charge 3 because it is waterproof and monitors heart rate and shows text messages. When it syncs to my phone it works well. Unfortunately it frequently refuses to sync to my phone. This makes my charge 3 unusable every 14 days or so - sometimes for up to 40 hours. I have an iPhone 6 which is up to date and is able to interact with other devices without trouble. This issue tends to happen every time I have to recharge my Fitbit.",
      "rating": 1.0,
      "verified": true,
      "author": "alexa 594",
      "helpful_votes": 5,
      "publication_date": 20190112
    },
    {
      "title": "Pleasantly surprised with color",
      "text": "A little early to do an in depth review. I’m all set up and everything working as advertised, so far so good. I was really worried the blue gray band would be too gray for my liking, but I was pleasantly surprised with how the color is more blue than gray. It really should have been called “denim”. As others have stated, it needs more faces. I REALLY miss having one with the date! Overall there are enough reasons to upgrade if you have the charge 2 like me. I’m so glad I did! So far my favorite 2 things are the count DOWN timer, and setting a calorie burn goal.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. Mae",
      "helpful_votes": 21,
      "publication_date": 20181009
    },
    {
      "title": "Wildly inaccurate",
      "text": "I've been using this Charge 3 for about two weeks. Recently I spent most of the day in the car on a road trip. At the end of the day, it said I climbed 17 stairways. LOL. I think it also really overestimates my steps. Maybe I just got the feel-good fitbit. I'm not that compulsive, but if you really care about accuracy, I would think twice about this fitbit. And it feels really cheap, which isn't the end of the world, but just sayin'. If I had saved the box I would return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam Noho",
      "helpful_votes": 4,
      "publication_date": 20181021
    },
    {
      "title": "A step backwards",
      "text": "I really wanted to like the Charge 3, but it's aesthetics are just poorly designed. It's frustrating to begin with that the Charge 2 bands I've collected over the last couple years won't fit on the new one, but even more frustrating that the way they attach lengthens the face of the Fitbit, making it pretty uncomfortable. I also thought it was inexplicable that they removed the ability to show the date and time at the same time - I constantly use it for that during busy days.",
      "rating": 2.0,
      "verified": true,
      "author": "Ben Eberle",
      "helpful_votes": 4,
      "publication_date": 20181113
    },
    {
      "title": "Practically Worthless",
      "text": "According to this piece of junk I'm sleeping less than an hour a night! Could that be why I'm writing this nasty review? I seriously doubt it as I do a lot better than that. One the other hand, the step counter is just the opposite. It gives me nearly double my actual exercise steps per day. Don't waste your money! But - it does keep good time! If you don't mind paying $150 for a plastic watch! Easily the worse $150 I've spent for a long time. Fitbit contacted me to let me know it was operator error.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry A Laird",
      "helpful_votes": 4,
      "publication_date": 20190323
    },
    {
      "title": "Disappointed in FitBit as a company",
      "text": "I finally broke down and bought the Special Edition Charge 3 white/graphite which also came with the solid black band. I absolutely love love love it!! But after 2 months, the band started tearing and peeling on the inside. When I tried to get a replacement (they do come under warranty), customer service informed me that they do not have a replacement for the white sport band. The only colors they have are berry, scarlet, or navy. Being someone who doesn't wear alot of colors, this was very disappointing. I love wearing my Fitbit and am completely let down they can't replace a band that \"they\" sell. Be ready for disappointment if your band rips.",
      "rating": 2.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 3,
      "publication_date": 20190715
    },
    {
      "title": "Less than a month and it is DEAD!",
      "text": "My Charge 3 was delivered on October 7. It was a great product, but from the first week, I had problems getting it to sync and to charge. I have contacted Fitbit customer service 3 times and in each case I was told that a manager would follow up with me. No one has contacted me. I ended up spending more money for a new charger in case that was the problem. It isn't. I have tried charging it from more than a dozen USB ports. That isn't the problem. My Charge 3 has now been DEAD a week and I am still waiting for Fitbit customer service to respond to me. I am extremely disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181113
    },
    {
      "title": "This device is just silly.",
      "text": "Based on a friend's recommendation, I bought this Fitbit for the sleep tracker. From what I was told, the profile of sleep might help me better understand my sleeping habits. After a week or so of use (I've had it for six months), I noticed it was reporting a full-night's sleep with REM, etc. even when I took it off in the middle of the night! The device is both silly and an expensive decoration on my nightstand. Nice job, guys!",
      "rating": 1.0,
      "verified": true,
      "author": "Redstone",
      "helpful_votes": 5,
      "publication_date": 20190526
    },
    {
      "title": "Sync issues",
      "text": "It worked for the first day. Now it will not sync",
      "rating": 1.0,
      "verified": true,
      "author": "RICHARD THOMAS ",
      "helpful_votes": 10,
      "publication_date": 20181016
    },
    {
      "title": "Accurate Pedometer + HR, that is it. NOT GOOD for Crossfit",
      "text": "Two stars because it works well as a pedometer and for tracking heart rate (as long as you are working at an easy pace). This morning I walked 2 miles and up 3 flights of stairs, pedometer tracked accurate but Fitbit gave me 15 flights of stairs. The Active Minute metric is complete garbage, I attend Crossfit 5 times a week and it has NEVER accurately tracked my heart rate or active minutes- a 60 minute class and Fitbit gives me 7 active minutes. NOT ONCE has Fitbit worked for Crossfit so it is fair to assume that it does not track any strenuous activity accurately. Buy a cheaper pedometer + heart rate because that is all this is",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190324
    },
    {
      "title": "Complete Garbage",
      "text": "I would not take this as a gift. I had 3 charge 3's in the past 6 months. They all completely die after a couple of months. Exchanges bring exactly the same problem. They also don't like to connect. The bands are NOT meant for men with any reasonable sized wrists. The company is soliciting user feedback to see if they need to make XL bands. Give me a break. Fitbit customer service is also terrible. I replaced this with a $39 Chinese fitness tracker that actually works.",
      "rating": 1.0,
      "verified": true,
      "author": "Head Kangaroo",
      "helpful_votes": 4,
      "publication_date": 20190507
    },
    {
      "title": "Stopped working after 8 days",
      "text": "After 8 days, simply stopped working. Screen dead. Returning for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "PJG",
      "helpful_votes": 16,
      "publication_date": 20181016
    },
    {
      "title": "Product only working with top tier devices.",
      "text": "After working properly for 2 weeks, my device stopped syncing information to my app. I was still getting notifications on the device, but no fitness or sleep data was being sync'd with the app. After researching and seeing a ton of people having the same issue, I attempted all of the fixes that worked for some users. After they didn't work, I reached out to Fitbit for support. They escalated my case only to report that my device (Moto G5 Plus) is not compatible with their app. This is terrible product development. Only after my return window closed did I learn of this news.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20181118
    },
    {
      "title": "Don’t waste your money.",
      "text": "I purchased this after not having a fitness tracker for a while. I was excited to have it again but after 3 days of wearing it, the screen went black, side button wouldn’t work, but the green light on the back was still blinking. I returned that one, got another, and it did the SAME THING. Anyways, don’t buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Golden",
      "helpful_votes": 4,
      "publication_date": 20181123
    },
    {
      "title": "Sad face of death after firmware update",
      "text": "I purchased this through Amazon Prime for my spouse - and for the first few weeks she was really pleased. Biggest positive was the water resistance. Since then - issues with tracking swimming, missed steps and a few quirks. The biggest issue is that now after the most recent firmware update - the entire smart watch is sitting there with a sad face. Not recoverable. Fitbit support are \"investigating\" - but from the look of the Fitbit support forums there are many, many people in the same situation. I'll update with any resolution - but for now it's too early and there are many software issues that mean this is a 1 star review. The band is effectively a brick.",
      "rating": 1.0,
      "verified": true,
      "author": "ezs",
      "helpful_votes": 2,
      "publication_date": 20181130
    },
    {
      "title": "Screen has permanent black lines appearing",
      "text": "I love the features of the Fitbit Charge, but after only 4 months use, there are permanent black lines appearing in the display. If this keeps up, I won't be able to read the screen. Need to get a replacement. (see related pics and vid) How do I get a replacement? Can't find the link in the AMAZON system...",
      "rating": 2.0,
      "verified": true,
      "author": "AP in OB",
      "helpful_votes": 5,
      "publication_date": 20190226
    },
    {
      "title": "Do not buy charge 3.",
      "text": "This is the most defective product I have ever purchased. Got one for my child and that went dead within a month. After multiple troubleshooting attempts it started working again. I got this in Feb, the battery kept draining, sleep tracker did not work and it died. Tried the same troubleshooting, the smile icon comes and it dies again. Would definitely like to return and request a refund. Have a charge 2 and it is the most flawless product. So disappointed with the charge 3",
      "rating": 1.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 4,
      "publication_date": 20190501
    },
    {
      "title": "2/3 Have stopped working",
      "text": "I bought three, 2 for family members and 1 for me, for Christmas 2018. We opened them and started using them 24 December 2018 and by 23 January 2019 the screen stopped working on one and another stopped counting steps. We're returning those 2 and will see if the 3rd one keeps working.",
      "rating": 2.0,
      "verified": true,
      "author": "Samuel Shelton",
      "helpful_votes": 5,
      "publication_date": 20190124
    },
    {
      "title": "Don't buy this unless you don't care about seeing your activity results on your phone.",
      "text": "This is a worthless piece of junk. There are so many mentions of the syncing problems. I contacted FitBit and they referred me to tech support who told me to try the things that they listed in their article referencing this problem, but they also acknowledged that this is a problem and that they were working on a fix (since October????) If I can 't sync it and therefore can't use it to see how I am doing, why would I bother to wear a fitness tracker.",
      "rating": 1.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 3,
      "publication_date": 20190101
    },
    {
      "title": "Disappointing",
      "text": "I've had the fitbit for 4 days. I'm an office worker and wanted to track my steps. I'm disappointed because even when I haven't moved from my desk, it will count hundred of steps. I called fitbit spry and they said it is acceptable because you're still moving at your desk. I confirmed with them that sitting at my desk for an hour working on my computer is equal to hundreds of steps. She responded with an enthusiastic yes. My common sense does not agree with that.",
      "rating": 1.0,
      "verified": true,
      "author": "Travis VanderSchaaf",
      "helpful_votes": 6,
      "publication_date": 20190403
    },
    {
      "title": "It is okay, but...not really a fitness tracker.",
      "text": "I don’t think this product deserves all of the single stars it’s getting. It works relatively well, but i wouldn’t call it a fitness tracker really. I got my a year and a half ago, and I don’t think it had ever tracked a cardio session for me. The heart rate it accurate until I get over about 150 bpm, then it drops to like 50 bpm, meanwhile I’m working my butt off. Sleep doesn’t track automatically sometimes, and the app is frequently wonky and I’ve had some connectivity problems. Overall, good device mainly for sleep and resting HR, but not really a fitness tracker.",
      "rating": 5.0,
      "verified": true,
      "author": "luke hall",
      "helpful_votes": 2,
      "publication_date": 20200515
    },
    {
      "title": "Wish I'd stuck with my Charge 2",
      "text": "I feel like the 3 is several evolutionary steps backwards from the Fitbit 2. Difficult to access different screens, no logic to the processes to find information and using the tracking sleep option only works sporadically. Which is why I got the thing. None of the reasons for the lack of sleep info on random nights hold true - the thing just doesn't track. Plus I hate having to keep squeezing and tapping snd pressing to even figure out what the time is. arghhhh. Skip this version if you are able.",
      "rating": 1.0,
      "verified": true,
      "author": "Auntie Pedantic",
      "helpful_votes": 4,
      "publication_date": 20190212
    },
    {
      "title": "Best product among the fitness monitoring device",
      "text": "I have been using apple watch since 2015 and have always been skeptical of wearing 24/7 because of the size and weight difference, and after a lot of thinking, I end up buying Fitbit to track my 24/7 days a week activity, and I cannot be more than happy with the results. Charging is the quickest ever on any device. The shower is the only time when I put my device for charging, and that time may vary from 15-20 min. Overall it's a fantastic product for the people who are active and monitor their daily activity and sleep pattern. ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Sandeep S.",
      "helpful_votes": 2,
      "publication_date": 20200805
    },
    {
      "title": "Defective",
      "text": "This was a replacement for the first one I ordered in December 2018. Had to replace it before the 30 days was up. Display stopped working, would vibrate but nothing on the display. Received the Replacement in January 2019 and now May 2019 it is functioning the same as the 1st one. Display not working, only vibrates. Very disappointed, this is a lot of money to spend for a short amount of time that it works.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheryl M Miller",
      "helpful_votes": 4,
      "publication_date": 20190529
    },
    {
      "title": "Do NOT recommend",
      "text": "Was great for maybe 2 weeks, then would not sync. I followed all the steps recommended and got it going again. Then it did it again. Had to send my watch in and got a replacement. That worked for maybe a month. Then it wouldn’t sync again and the time somehow was 6 minutes fast. Tried to troubleshoot with company but they could not figure it out. They would not send a replacement and for the past 2 months have just been saying they’re aware of the issue and working to resolve it. For spending nearly $200 on this, it’s so unfortunate they will not help. Wish I could give this one 0 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 4,
      "publication_date": 20190325
    },
    {
      "title": "0 Stars - Display failed after 4 months",
      "text": "I purchased 2 charge 3s on Black Friday. One for me and one for my wife. Sometime mid January, mine stopped working. The display is completely black and doesn't come back. I was within the return period, so I sent mine back for a refund. My wife's was still working, so I thought it might be fluke. Now (mid March) my wife's is having the exact same issues and we are no longer in the return period. I would have expected a $170 watch to last at least 2 years. This is terrible. I would like a refund or even an exchange, but I will not be purchasing anything from FitBit again.",
      "rating": 1.0,
      "verified": true,
      "author": "Jake Wallingford",
      "helpful_votes": 5,
      "publication_date": 20190320
    },
    {
      "title": "Great Product",
      "text": "I especially wanted the sleep monitoring feature, which works OK, but needs improvement on the time scale marks (more marks) and to shorten to less than 3 hours sleep processing is done, as well as give feedback on why processing gaps occur. Otherwise, this seems to be a great device with lots of features. Very comfortable to wear day and night. Contrary to some review, there is a clock face with the date on it, but is is only one of 5 faces available to select.",
      "rating": 4.0,
      "verified": true,
      "author": "gloria heistein",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "It doesn't work.....twice.  Shame on me.",
      "text": "I ordered the Fitbit Charge 3 originally as it was being introduced to the market as a new product. The first one didn't even charge, so I returned it and got another Fitbit Charge 3 from Amazon after talking with a foreign speaking Fitbit representative. The second Fitbit Charge 3 worked for about 2 weeks, then the associated computer tracking began dropping data, not syncing or pairing with my device, and finally started losing time on the watch function. I think it is a design flaw and would never purchase another one. Many similar complaints are found on line for this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181123
    },
    {
      "title": "Total garbage.",
      "text": "Worked well for the first 2 weeks. Third week, notifications stopped working. By the fourth week, the watch quit syncing with the app on my iPhone. The only way to get it to sync is to “remove the device” from my app and then “set up new device” again. Will sync once added, but stops syncing an hour later. Now it’s one day too late to return to Amazon. Fitbit customer service tries to help, but when they can’t figure it out they say I’ll be receiving an email from the warranty department, but I’m STILL waiting for their email. It’s a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 4,
      "publication_date": 20190208
    },
    {
      "title": "NOT WORTH IT",
      "text": "This thing is only useful for heart rate. Its inaccurate for sleeping doesnt even track it, and the steps can be counted with the smallest wrist movement. Not worth the price tag. Also dont fall for the credit card feature on it. Most if not all phones have it and let's be honest.. you wont find yourself in a store with a smart watch but without a phone. Gimmicky at best. Heart rate tracker was perfect and accurate but $98.98 for a a glorified heart rate tracker doesnt seem worth it in my book",
      "rating": 3.0,
      "verified": true,
      "author": "Cavan",
      "helpful_votes": 2,
      "publication_date": 20200624
    },
    {
      "title": "Poor customer support/tech support",
      "text": "My fitbit charge3 stopped syncing with my iphone. contacted tech support they couldn't reset my pasword or get THEIR software to send a new password request to my email regardless of browser terrible software tech had to forward problem to their higher tech support (their words) and said i had to wait 24-48 hrs to get email from them choose a different product, this one has TERRIBLE product support",
      "rating": 1.0,
      "verified": true,
      "author": "Rick H.",
      "helpful_votes": 4,
      "publication_date": 20190403
    },
    {
      "title": "Poor Quality",
      "text": "I ordered one and it didn't even last 1 day so I returned it to Amazon for a replacement. The replacement came right away but it only worked for 3 days then died. Each time, the screen stops working and it won't respond at all. I pre-ordered and waited a very long time for this to come in. I was very disappointed with the very poor quality. I'm returning it again and will try a competitors version.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 7,
      "publication_date": 20181030
    },
    {
      "title": "Problems syncing",
      "text": "I’ve had the Fitbit 3 about 2 weeks now and like some others I’m having issues with it syncing to my phone. I’ve also restarted, restarted my app, downloaded and reinstalled the app, turned on&off my phone along with Bluetooth. Nothing I do is working. So disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181017
    },
    {
      "title": "NO GO!",
      "text": "Nope - gotta work out the kinks before yall launch these things. Syncing is rediculous!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Caryn Kirkland",
      "helpful_votes": 7,
      "publication_date": 20181023
    }
  ],
  "product_meta": {
    "title": "Fitbit Charge 3 Fitness Activity Tracker",
    "description": "PRODUCT DETAILS\n * For warranty information about this product, please click here. [PDF ] User manual [PDF ] \n * Is Discontinued By Manufacturer :No\n * Product Dimensions :1.63 x 4.04 x 8.9 inches; 7.51 Ounces\n * Item model number :FB410GMWT\n * Batteries :1 CR2 batteries required. (included)\n * Date First Available :August 21, 2018\n * Manufacturer :Fitbit Inc\n * ASIN :B07G19YRMF\n\n * Amazon Best Sellers Rank: #101 in Sports & Outdoors (See Top 100 in Sports & Outdoors)  *  #3 inActivity & Fitness Trackers \n   \n   \n\n * Customer Reviews:4.1 out of 5 stars28,008 ratings",
    "rating": 4.1,
    "feature_bullets": [
      "Better measure calorie burn, understand resting heart rate & more with 24/7 heart rate tracking and a battery life of up to 7 days (varies with use and other factors)",
      "Choose from 15 plus exercise modes like run, bike, swim, yoga, circuit training and more, set a goal, and get real time stats during your workouts to see how you can keep getting better",
      "Automatically record time spent in light, deep and REM sleep stages and see Activity trends, health insights and personalized guidance in one place with Fitbit today",
      "Swim proof and water resistant to 50 meters, so you can track swims and wear in the shower; also connect to Smartphone GPS for real time pace and distance during outdoor runs and rides",
      "Stay connected to your day with everyday apps for weather and more and get called, text and smartphone app notifications on your wrist",
      "The operating temperature is 10 degree to 45 degree celsius; maximum operating altitude: 8,535 m"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.63 x 4.04 x 8.9 inches; 7.51 Ounces",
      "Item model number": "FB410GMWT",
      "Batteries": "1 CR2 batteries required. (included)",
      "Date First Available": "August 21, 2018",
      "Manufacturer": "Fitbit Inc",
      "ASIN": "B07G19YRMF"
    },
    "categories": [
      "Exercise & Fitness",
      "Activity & Fitness Trackers",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Fitness Technology",
      "Health, Household & Baby Care"
    ],
    "price": 119.93
  }
}