{
  "website_summaries": [
    {
      "verdict": "These cute and colorful little bears are a wonderful sorting and counting tool for younger kids. A novel introduction to color recognition and basic math.",
      "pros": [
        "Vibrant colors appeal to kids of all ages",
        "Assists with the learning of several skills, including counting, pattern-making, early math, matching, color recognition, and more",
        "Handling the tongs, bears, and cups helps polish fine motor skills and improve hand-eye coordination",
        "Excellent quality"
      ],
      "cons": [
        "Some parents felt the bears could be a bit larger"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "My toddler LOVES these",
      "text": "These are better than any of the counter bears I’ve seen in the stores, especially for the price. I’ve had them for a while and they have held up well. Everything is good sturdy plastic. The colors are vibrant. They are great for little hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Walker",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Fun, bright colors, multiple uses.",
      "text": "Bought this for my 2yr old to practice sorting and for my 7yr old to count out big numbers when doing her math homework. They are bright fun colors, easy to see, and a fun addition to add to your child’s math homework when adding and subtracting big numbers.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenisa",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "My 2 year olds favorite toy",
      "text": "This is my 2 year olds favorite toy. It keeps her so entertained and it helped us teach her her colors. I’ll definitely be giving these as gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley M.",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Love these little bears!",
      "text": "My 3 year old and 9 year old both love these little sorting bears. My kids will sit and make-up games and count and sort them. I really like this kit because of the price, and the little case keeps everything together. Wonderful product, great quality and value!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great for learning colors",
      "text": "I bought this for my 2.5 yo he loves it!! The bears are the perfect size for little fingers to grasp and the tongs/tweezers that came with it are flexible enough for a 2 year old but not so flexible that they break easily. The case is great too. Nothing worse than sixty small plastic bears all over the playroom. Would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Love them will recommend them",
      "text": "Can be used for learning to count or learning colors I love them and baby loves them more.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa Acosta",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "My daughter loves these!!",
      "text": "I had these when I was in school, I had to get them for my kiddos too. My daughter loves these and the colors are bright and it is all made very good and heavy. Very good quailty and buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great!",
      "text": "Great Quality and value my 2 year old son loves them and they are great for teaching counting and colors",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Russ",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Great for OT",
      "text": "I bought these for my son's OT office as a thank you for their work. All of the kids love them, no matter what the age. It is very easy to customize their use, and the kids love to put them in the little carrying case when they are done for the day. I would absolute buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Liberty1776",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Kids love them!",
      "text": "Vivid colors and super cute teddy bears! Fun to learn math",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Verified purchase",
      "text": "My son loves the idea of different color bears and sort to matching color cup. Good One.",
      "rating": 5.0,
      "verified": true,
      "author": "Kannu",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Cute!",
      "text": "The rainbow counting bears with matching cups has been great for out 2 year old's fine motor. Would recommend to others wanting to strengthen fine motor skills.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy Davis",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "The number of toy bears cannot be reached",
      "text": "This toy bear, the price is a bit high, the number of bears has not reached, unhappy",
      "rating": 2.0,
      "verified": true,
      "author": "Xiu feng lin",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great for educational activities",
      "text": "Great for color sorting, counting, naming and identifying colors, and using fine motor skills with tongs. Kids love participating in activities with these little bears!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina S",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "No for everyone",
      "text": "It is a good product but my kid didn’t like it he just like play with the cups",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Good quality",
      "text": "Good quality, large cups, easy cleanup and it’s own storage!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Prelle",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Just watch them not to put in mouth",
      "text": "I loved it and my kid loved it!!! He’s starting to learn his colors and it’s a big help",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "My kids love these!",
      "text": "My kids love these! The colors are bright and everything is made of durable materials.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Stringfellow",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Daughter loves it",
      "text": "My 2 year old loves sorting and colors. This is perfect. Simple.",
      "rating": 4.0,
      "verified": true,
      "author": "shawn ross",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "It is a perfect sorting toy",
      "text": "My 19 month old granddaughter loves this so much! It is very well made!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly A. Robisky",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Great",
      "text": "Great toy, compact and easy to use, we use ours while eating out to give the toddler some toys to play with. gives us some time to eat without having to get up out of our seats. Kids love counting them or sorting by colors. easy to grab and durable. educational and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "lorraine",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great tool for home learning.",
      "text": "my 2 year old was counting and sorting in no time. Great amount of colors and came with an awesome bag to store everything in.",
      "rating": 5.0,
      "verified": true,
      "author": "marcus hunnicutt",
      "helpful_votes": 0,
      "publication_date": 20201102
    }
  ],
  "product_meta": {
    "title": "KABOOCHY Rainbow Counting Bears with Matching Sorting Cups and Storage Container 68pc Set. Quality Colorful Toy Counters for Kids to Learn Mathematics Games, STEM, Montessori Matching Game",
    "description": "KABOOCHY Rainbow Counting Bears with 6 Matching Sorting Cups, 60 Bear Counters, Tongs and Storage Container",
    "rating": 4.7,
    "feature_bullets": [
      "LEARNING TOY FOR KIDS AGED 2 PLUS – It’s the perfect Game for Toddlers, and children in Pre School, Kindergarten right through to First Graders. Kids will love sorting and counting these cute and colorful bears, or just tossing them into the stackable cups! Great STEM educational math manipulatives and Montessori Learning Toys, and they are suitable for kids aged 2, 3, 4 or even older kids. A must-have for home schooling and a great resource for teachers’ classroom.",
      "FUN & EDUCATIONAL –A fun way to teach your students basic math concepts including addition, subtraction, and even multiplication before they even start school. Using the tweezers to pick up the bears, they can count them, sort them into color groups, match them with their cup and put them into colour patterns. And with their imagination, each bear can have a name for pretend play!",
      "DEVELOPMENT SKILLS – Besides heaps of Guaranteed Fun, your child is also developing early learning skills which is imperative for growing. It helps them develop Numeracy Skills, STEM skills, Problem Solving Skills, Color Recognition, Fine Motor Skills as well as Hand Eye Coordination. It also encourages Imagination, Inspires Creativity and Promotes Self Esteem! They are particularly helpful for children with autism, learning disabilities or special needs, and a great for occupational therapy.",
      "COMPLETE BUNDLE – Our Comprehensive Set includes 60 bear counters, with 10 in each colour (Red, Orange, Yellow, Green, Blue and Purple), 6 Stackable Cups, a pair of Tweezers and also a Clear Plastic Storage Container for you to conveniently store them.",
      "ONLY THE BEST QUALITY – This product is non-toxic, BPA-Free, Lead-Free, contains No Phthalate, so they are safe for your little ones. They are made with hard plastic which are Sturdy and Durable, with Smooth Finished pieces and are easy to grasp. NOTE: The bears are 1.05” tall, so Adult Supervision is required when there are children under the age of 3."
    ],
    "specifications": {
      "Package Dimensions": "8.11 x 4.88 x 4.8 inches",
      "Item Weight": "1.1 pounds",
      "ASIN": "B07GQT35X6",
      "Item model number": "KABCOUNTBEAR",
      "Manufacturer recommended age": "24 months - 8 years",
      "Best Sellers Rank": "#227,282 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars62 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "24 months - 8 years",
      "Manufacturer": "KABOOCHY"
    },
    "categories": [
      "Learning & Education",
      "Toys & Games",
      "Counting & Math Toys"
    ],
    "price": 27.99
  }
}