{
  "website_summaries": [
    {
      "verdict": "More ice means more fun. This cooler offers a greater capacity for ice making and ice storage than most of its competition.",
      "pros": [
        "This ice maker creates clear ice cubes, which is more than just an aesthetic preference",
        "Clear ice cubes melt more slowly than cloudy ones, so your drink will stay colder longer"
      ],
      "cons": [
        "The motion of ice being dumped into the tray can push the tray forward and out of place at times"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice looking unit with tons of flaws.",
      "text": "I really wanted to like this ice maker, but there are too many flaws. The ice bucket is very loose, once the ice drops to the tray, sometimes it'll open tray. One the 2nd and 3rd round of ice, you'll find the ice tray on the floor with all the water overflowing from the machine. Happened 3 times already. 2nd issue is that it automatically turns off by itself. I had to restart the machine once a day, even if I didn't use any ice. It's an additional chore i could live without.",
      "rating": 1.0,
      "verified": true,
      "author": "Cadomium",
      "helpful_votes": 16,
      "publication_date": 20181114
    },
    {
      "title": "Very disappointed.",
      "text": "I gave this three stars due to ease of use, style and ice quality and the assumption that perhaps we received a defective unit. However, we had to stop using it because it leaked terribly. The manufacturer advised to empty all water from the bottom tray when turning the unit off to prevent leaking; but, this did not work for us. It leaked so badly that it shorted out the outlet it was plugged into and also ruined the kitchen cart we had it on. I am currently shopping for a different ice maker.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 10,
      "publication_date": 20190530
    },
    {
      "title": "Cool Compact Ice Machine",
      "text": "Love the clear ice. Not too fond of the beeping tone when the ice is ready or the loudness when the ice drops or the fact that it pushes the drawer slightly open once filled, but I do love the speed, quality of ice, ease of use and cleaning ease! Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Two Step",
      "helpful_votes": 6,
      "publication_date": 20181102
    },
    {
      "title": "Not worth your money",
      "text": "Not really impressed. The first one leaked horribly. The second one leaked as well. Then I glued the drain plug and it’s not leaked since. Calcium build up is horrible and I use filtered water only for my machine. Not worth the hassle for what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Max Pierce",
      "helpful_votes": 5,
      "publication_date": 20181213
    },
    {
      "title": "works like a charm",
      "text": "I could see how some people might have problems with the unit. Mainly from not reading or understanding the ice maker instructions. It does not leak it has a drain plug at the bottom. It does turn itself off that might be a thing but you have to add water at some point",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Bell",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Ice Whenever You Need It",
      "text": "Ice maker is a little heavy if you need to move it each time it is used but, it is well worth it’s weight. I enjoy the fact that I can make clear ice whenever it is needed and I really like the small ice cubes it makes. I live in a apartment and I do not trust the cleanliness of the ice maker. It is easy to clean. I make ice about once a week and I store it in the freezer inside large zip lock bags.",
      "rating": 4.0,
      "verified": true,
      "author": "IEneighbor",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "It leeks water !!!!",
      "text": "So it started leaking water out from under it. I've had to put a towel under it when it's in use. on the top bar where the water drains down to make the ice there's one section that it's sprays out so the water goes into the container where it drops the Ice into. after it's made it get water all over the floor cuz it's dripping out of the holes in the bottom of the drawer. I need to get it Fixed. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley Tarter",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Disappointed",
      "text": "It leaks. If you leave it on it leaks from the bottom. It makes a high pitch noise occasionally. It is loud when it dumps ice. It gets ice stuck in the back part of the drawer. It does make good ice quickly.",
      "rating": 2.0,
      "verified": true,
      "author": "Melody O",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Igloo makes crystal clear in minutes",
      "text": "The Igloo ice maker. Makes crystal clear ice and and takes about 20 to make a full batch The question about Flavor does bot seem relevant it is just frozen water. There is no flavor",
      "rating": 4.0,
      "verified": true,
      "author": "Gary W. Wright",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Excellent product",
      "text": "Absolutely love this. I can have a party all night long and keep the party iced.",
      "rating": 5.0,
      "verified": true,
      "author": "john lathram",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Nice ice maker.",
      "text": "Great ice maker is a bit on the loud side but very productive. Easy to use ice production a bit on the side but can make 5 lbs ice in about three hours",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "nice quiet",
      "text": "I have this at my desk at work and even though it is an office environment with cubes right next to eachother they didnt even know I had it until I pointed it out.",
      "rating": 5.0,
      "verified": true,
      "author": "bo dake",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "This thing sucks",
      "text": "This is very poor design. A month after using, the thing kept freezing up and everything else. Would not even let ice fall or anything. I ended up throwing the damn thing away.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Works wonderfully",
      "text": "This works quite good. Though the biggest grip is until I put a thin board under the front feet it wouldnt make full ice cubes as the water wasnt falling right over the metal. Other wise it has worked wonders and is quite fast though the projected amount of ice can only be made if you keep up with emptying it before it does its full beep.",
      "rating": 4.0,
      "verified": true,
      "author": "The Jack of no trades",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Fast ice machine",
      "text": "This machine make ice faster than I thought and it’s running great. Only one issue is the leak from the ice tray when you pull out to get ice. Just be aware of how long ice been in tray, otherwise it’s fine.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Eck",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Dangersous",
      "text": "Bought this item 6/2019. We follow all manufacturers instructions. There is a \"coating\" in the \"metal\" tray and it is now coming off into the water and in our ice cubes.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "metal fragments in ice after ~6 months",
      "text": "I purchased this machine in July 2019 to use when I have company and the fridge ice machine can't keep up, which only happens one or two weekends a month. It worked well for the first four or five months, then I began noticing metal pieces in the lower water tank. By month 6 there were large metal flakes embedded in the ice it was producing... this machine will be going to the scrap yard.",
      "rating": 1.0,
      "verified": true,
      "author": "Varmit",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Nice",
      "text": "Like the clear cubes, found that I ice harder more by putting in freezer",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Disappointed!",
      "text": "Highly dislike the very long beeping sound. It takes a good amount of time to make a single batch and it comes out in a sheet of ice. I would NOT recommend this product. Very disappointed due to the expectations I had because of the price alone! I got myself one and 2 for gifts. Don't waist your money.",
      "rating": 1.0,
      "verified": true,
      "author": "R.L.B",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Horrible purchase",
      "text": "This item was shipped and does not work when it arrived. It states that it cannot be returned now that it won’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Great machine",
      "text": "Works great takes a little to get used to the ice dropping or the noise when the bin is full. But does the job",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie ",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Non returnable item. And it leaks",
      "text": "This item leaked where the water reservoir meets the base. Do Not buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "stacy m cooper",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Would not make ice",
      "text": "Would not make ice and cannot return item or get refund. Highly unsatisfied and would not recommend!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Brandi D. Anderson",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Worthless Ice maker",
      "text": "Not much good to say, the thing makes one batch of ice and shuts off. Unless you sit in front of it and wait for ice to finish and turn it on again, the best use for this is a boat anchor. Extremely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "George S.",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Poor design",
      "text": "It leaked all over the counter when it shut off at night.",
      "rating": 1.0,
      "verified": true,
      "author": "Don Sheets",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "makes good ice needs a bigger drawer",
      "text": "Makes good ice but drawer is very tiny. Small capacity.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "This ice  maker is VERY LOUD !!!!!!",
      "text": "I wish I had never got it. It is very loud and was told I could not send it back ! makes Ice great just to much loud noise .",
      "rating": 1.0,
      "verified": true,
      "author": "Yvonnise Bulluck",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Its ok I guess",
      "text": "When I first got it I love it set it up same day I got it and cleaned it Then It started leaking Idk where the leak coming from somebody have any any anwers?",
      "rating": 2.0,
      "verified": true,
      "author": "Shaina",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Good ice machine",
      "text": "Is fast. My only regret is that the ice tray isn’t refrigerated so the ice melts quickly if you don’t have a place for it",
      "rating": 5.0,
      "verified": true,
      "author": "Dana C Fournier",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great Ice Machine for the counter",
      "text": "Love everything about this ice machine. Work great and nice nice clear ice cubes.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Hill",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Easy to use ice maker",
      "text": "I've been using this ice maker for almost 6 months and I'm very happy with it. It's really easy to use and makes perfect ice cubes.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Turner",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Faulty product",
      "text": "I used the ice maker at home and it quit working. Before it quit completely, it made the loudest irritating nose. Would not recommend!",
      "rating": 1.0,
      "verified": false,
      "author": "Cynthia White",
      "helpful_votes": 0,
      "publication_date": 20200731
    }
  ],
  "product_meta": {
    "title": "Igloo ICEC33SB 33-Pound Large Capacity Automatic Portable Countertop Clear Ice Cube Maker, Black",
    "description": "Entertain in style with gourmet crystal clear ice cubes! Made in just minutes, these clear cubes not only look impressive, but also keep drinks colder and last longer than traditional ice cubes. The brightly lit LED control panel is lighted with easy-to-read ON/OFF, Ice Full and Add Water indicator lights. Remove the ice basket and water tank to make the occasional cleaning easy. This space-conserving countertop unit requires no plumbing and is perfect for home bars, RVs, small kitchens, dorm rooms and more. Cold Drinks. Warm Smiles. 400-600 Watts.",
    "rating": 3.2,
    "feature_bullets": [
      "Large Ice Making Capacity : Keep the water tank filled and this unit will produce 33 pounds of clear ice cubes in a 24 hour period; enough to keep drinks cold all day long",
      "24 Ice Cubes : Makes 24 square shaped clear ice cubes per cycle",
      "Water Tank Capacity : 3 quarts",
      "Clear Vs. Cloudy Ice Cubes : Clear ice cubes tend to last longer and keep drinks colder than traditional faster melting cloudy white ice cubes",
      "Quick Freezing Ice : Makes 9 small or large cube shaped clear ice cubes in as little as 7 minutes",
      "Control Panel : Simple to understand and illuminated with LED lights, the electronic control panel lets you know when you need to add water, when the ice basket is full and allows you to choose the size of the ice cubes",
      "Automatic Shutoff: Unit will shutoff automatically after 16 hours of continuous use",
      "Removable Ice Basket : Ice basket easily removes to transfer ice cubes to glasses or coolers",
      "Easy View Water Tank: Clear lid and water tank allows for easy viewing of ice cube capacity",
      "Ice Scoop: Included accessory is great for easily filling glasses or coolers"
    ],
    "specifications": {
      "Brand Name": "Igloo",
      "Model Info": "ICEC33SB",
      "Item Weight": "25.1 pounds",
      "Product Dimensions": "11 x 14 x 13.75 inches",
      "Item model number": "ICEC33SB",
      "Is Discontinued By Manufacturer": "No",
      "Capacity": "33 Pounds",
      "Installation Type": "Counter Top",
      "Part Number": "ICEC33SB",
      "Form Factor": "Stand Alone",
      "Color": "Black",
      "Voltage": "120 Volts",
      "Connector Type": "Water Line and Drain",
      "Defrost": "None",
      "Certification": "Not Applicable",
      "Material Type": "Plastic",
      "Included Components": "Ice Maker^Basket^Scoop",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B07GXXT7CG",
      "Customer Reviews": "3.2 out of 5 stars70 ratings3.2 out of 5 stars",
      "Best Sellers Rank": "#1,479 in Appliances",
      "Date First Available": "August 29, 2018"
    },
    "categories": [
      "Appliances",
      "Refrigerators, Freezers & Ice Makers",
      "Ice Makers"
    ],
    "price": ""
  }
}