{
  "website_summaries": [
    {
      "verdict": "This French lavender scented candle packs a powerful calming vibe with 3 wicks, premium essential oils, and an impressive burn time of up to 80 hours.",
      "pros": [
        "Made with natural essential oils, soy wax, and cotton wicks",
        "Both lavender and vanilla are renowned for their calming properties",
        "3 wicks deliver triple the scent",
        "Users rave about the natural aroma",
        "Generous size with an excellent burning time",
        "Well presented and nicely packaged"
      ],
      "cons": [
        "Some wish the scent was stronger"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "If you are seeking relaxation this is the perfect candle for you!",
      "text": "Lavender and Vanilla is a perfect combination for stress, wellness and relaxation. I enjoy lighting this candle at night to wind down and relax or anytime I am feeling stressed I will light the candle. It has such a warming scent that it is immediately calming. To have both of my favorite scents in a candle is a winning combo for me. I will definitely be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Buras",
      "helpful_votes": 18,
      "publication_date": 20181119
    },
    {
      "title": "THE BEST CANDLE EVER!!!",
      "text": "I like others was skeptical about buying a candle online. As soon as I ordered it I received a wonderful thank you note along with burning instructions. Followed them and the candle burns beautifully. The scent is unmatched by any other - I purchased the French Lavender & Vanilla - I am going to reorder another after righting this review - buy and ENJOY!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary McKenney",
      "helpful_votes": 15,
      "publication_date": 20190307
    },
    {
      "title": "Heavenly Scent",
      "text": "I bought two of these for gifts. The packaging, the scent the ingredients of the candle and the price was superb. I may mention I ended up keeping one for myself! Will def order again.",
      "rating": 5.0,
      "verified": true,
      "author": "kathy",
      "helpful_votes": 11,
      "publication_date": 20190116
    },
    {
      "title": "Very relaxing",
      "text": "I love the smell of this candle. Its very relaxing",
      "rating": 5.0,
      "verified": true,
      "author": "Shakydol",
      "helpful_votes": 7,
      "publication_date": 20181213
    },
    {
      "title": "Not what I was hoping for.",
      "text": "Smell is objective. I tolerated it but my boyfriend hated it. He said it smelled like old lady house. It’s warm smelling but doesn’t leave a clean, freshness I was hoping for. It’s more of a pungent lavender smell rather than soft and floral. I do like that it burned evenly and had a long lasting smell. It’s not a cheaply made candle but still, I don’t think it’s worth the price and I won’t be buying it again.",
      "rating": 3.0,
      "verified": true,
      "author": "angelica",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Very Pretty, Wonderful Lavender Smell",
      "text": "I love the scent, sometimes it can be a little powerful, but it’s a wonderful smell! It relaxes me with a nice sweet, lavender scent! Not sure if it’s because I’m using matches, but the middle is getting a dark in color. Not a big deal, but thought it was worth mentioning. Over all I’m very happy with how it arrived, would buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "Kaylee",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Loving the lavender vanilla scent",
      "text": "The scent is almost creamy. My husband would say it's a heavy scent, but I think it is just right. I am following the package instructions about letting the entire tops become liquid, to keep the surface more even for burning.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Gross",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Love the smell",
      "text": "This candle was amazing! I absolutely loved the smell and how quickly it filled my house. I will say i disliked how short it lasted. I followed packaging suggestions to prolong the candle life but it didn’t extend it at all. It lasted me maybe a week but i used it daily so maybe I need to find a larger candle? Absolutely great smell otherwise",
      "rating": 4.0,
      "verified": true,
      "author": "Venessa Barnes",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Not Impressed",
      "text": "I love lavender candles. I was so hopeful on this one that I ordered 2. It is very weak and a disappointment. I do not like to give negative reviews, but I cannot praise this candle for it's scent.",
      "rating": 1.0,
      "verified": true,
      "author": "Tijen",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Disappointed",
      "text": "I liked this candle until one wick wouldn’t even light. Then a second wick went out. So I’m left with a half burned candle that no longer works or looks appealing. Disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "kimberly",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "LOVE",
      "text": "Love love love this scent! Was nervous to buy a candle on here without being able to smell it, but you won’t be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley Hollan",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "WONDERFUL PURE SCENT",
      "text": "Love the smell of the candles throughout my house. It smells clean and burns slowly. The packaging is beautiful and everything was carefully packed so it arrived in excellent condition. Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Smells nicely throughout an entire small home",
      "text": "It supports a 2 bed/2 bath condo and the scent is all throughout the apartment. At times, there is a hint of burning wax versus the candle scent, but overall LOVE IT!!",
      "rating": 5.0,
      "verified": true,
      "author": "SKA",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Doesn’t smell much at all..",
      "text": "Honestly doesn’t seem much at all... Bath and Body candles are soooo much better and 1/2 the price",
      "rating": 2.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Crack in wax",
      "text": "I loved this candle the smell was great and the look was pretty! Only problem was the wax had a big crack through it. I was giving it as a gift to a co worker and didn’t have time to return it :( so I had to give to her anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "shani muldoon",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "I will repurchase",
      "text": "Nice size candle and very fragrance. It smells good. I will be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "April Nixon-Tarkington",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Great candle!",
      "text": "This candle is worth the price. Great smell without being overpowering.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "I AM IN LOVE WITH THIS CANDLE!!!",
      "text": "The smell is ABSOLUTELY INCREDIBLE!!! It’s beautiful and burns nicely!!! It’s definitely an A+++ product!!! I will certainly be re-buying this!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerri W.",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Doesn’t last long",
      "text": "I loved the scent of this candle. It just didn’t last very long",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonShopper727",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Good candle",
      "text": "Smells more like vanilla than lavender but still nice candle.",
      "rating": 4.0,
      "verified": true,
      "author": "Joni ",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "BEAUTIFUL SCENT AND ROMANTIC COLOR",
      "text": "Just lit the wicks and really enjoying the lovely fragrance. Thanks for the additional suggestions re wick length and freezing the candle before use! The price is right compared to past purchases of other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen wunderlich",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Best Candle I Ever Purchased",
      "text": "I love this candle so much! It will make your entire house smell beautiful! The smell is so relaxing. It truly changing your mood. My only complaint is I wish it was bigger. I need more of this great scent! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Maya D",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Nice but not enough quality",
      "text": "It has a nice presentation in a nice box, the container is big, violet color, I did everything that it said in the instructions but It doesn’t work for me. The smell is not strong and the quality is not enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Romina Torres",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Terrible chemical smell",
      "text": "Smells like chemicals. Not at all like lavender or vanilla. I don’t think it’s actually soy wax either.",
      "rating": 1.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Aromatherapy candle",
      "text": "This is so wonderful aromatherapy candle. The scent of lavender and vanilla is a good combination for relaxing. I always light it up when resting for a whole tiring day of work.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Wright",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Not a very strong scented candle",
      "text": "The candle has a very weak scent and must be burning for hours for anything to come out. Kind of defeats the purpose of burning a quick candle",
      "rating": 2.0,
      "verified": true,
      "author": "JT1994",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Relaxing",
      "text": "This is probably my favorite candle scent. It burns evenly and has a lovely smell. Perfect for small rooms that need some relaxation. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Madison Young",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Hard to open",
      "text": "I literally could not get the top off. I had to pry it open with a screwdriver",
      "rating": 1.0,
      "verified": true,
      "author": "Mackenzie",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Exquisite scent",
      "text": "Absolutely exquisite scent. It fills most of the downstairs area. Love it! A bit pricey, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Smells amazing!",
      "text": "Definitely worth the money. Amazing scent and lasted for about a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Jalin",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Perfect candle to keep or gift",
      "text": "Love this candle! Perfect, long-lasting scent. And I love that it’s a family-run business.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Pelkey",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "100 would buy again",
      "text": "This candle smells amazing and it really makes your whole room smell so good",
      "rating": 5.0,
      "verified": true,
      "author": "Dahely",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great Candle",
      "text": "Great smell, just put it in the freezer for an hour so you get a slower burn",
      "rating": 5.0,
      "verified": true,
      "author": "WMEDINA",
      "helpful_votes": 11,
      "publication_date": 20190623
    },
    {
      "title": "Super nice candle - appears dirty after burning",
      "text": "Very nice candle! I really love the scent and it seems to fill the room nicely. Burns well so far. Packaging was super nice and comes with a card for easy gifting. The purple candle jar has a nicer look to it than the more commonly used clear jars. Would definitely purchase again! Edit after burning: the candle has a dirty appearance (last pic). I’m burning this in the same location I burn my other candles and I’ve never had this happen with any other candle.",
      "rating": 4.0,
      "verified": true,
      "author": "Vada",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Beautiful to See, Delicious To Smell",
      "text": "This candle is more than just any candle. Even the jar and packaging are tastefully done. The purchase includes emailed, detailed instruction to maximize the life and quality of use. Following those instructions will ensure a long and very pleasant candle life. The fragrance is fantastic, but not cloying...very relaxing. Great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike S.",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Perfect Service, Great Fragrance!",
      "text": "Purchased this candle and received an email in advance from makers describing how to do the first lighting, trim wicks, etc. Great tips. Arrived on time, packaging was great. Candle itself is in a very pretty purple glass container with a lid that seals well, so that you don't have an overpowering fragrance when you're not burning it. Burned for the recommended 4 hours and really enjoyed the subtle fragrance. Not overpowering, just right. Hoping it lasts for a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Nan Schultz",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "It doesn’t smell all that much.",
      "text": "The packaging was excellent, I don’t think that there could have been a better way to package the candle. My candle did not come damaged at all and the actual package was nice enough to be able to gift. The main problem with the candle is that it doesn’t smell! It would probably take four of these candles to equal the scent of one of those fancy-company candles. It burns cleanly, and it doesn’t tunnel so it is technically a good candle. But again, it doesn’t smell.",
      "rating": 2.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Beautiful candle for gifting or personal use",
      "text": "This is a beautifully packaged candle. Definitely suitable for gift giving. The candle glass is a deep purple and the scent is lovely, although it is a bit too strong for my husband. I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Casarez",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Happy with my purchase!",
      "text": "I bought this candle for my home and so far I really love the scent. It's very relaxing and not overpowering, which is great because I usually get a headache after awhile, but didn't happen with this candle.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Just light and relax",
      "text": "Beautifully packaged. Long lasting candle with not so overwhelming scent.",
      "rating": 5.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Has a good smell",
      "text": "Very pretty candle with a good scent. I would like to try some other scents, too, as I like the presentation of this candle.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth DuBelko",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Nice lightly scented candle",
      "text": "Nice candle however not as aromatic as I would have liked. Pleasant scent, just not very strong. Shipped quick.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Huber",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Relaxing smell . The instructions were helpful !",
      "text": "I love how soft and relaxing this fragrance is It lasted for hours. It’s packaged nicely and The instructions are really helpful",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "No real scent",
      "text": "Even after 30 minutes of burning, I can’t smell the scent",
      "rating": 2.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20190606
    }
  ],
  "product_meta": {
    "title": "T&H French Lavender & Vanilla Candle Aromatherapy Relaxation Handmade Pure Soy Wax 3-Wick 80 Hour Burn 16 Ounce Long Lasting",
    "rating": 4.3,
    "feature_bullets": [
      "💜 INSTANT RELAXATION: Light the three wicks, place the candle next to your bubble bath or sofa and relax. Natural Vanilla and Lavender essential oils will leave you feeling soothed, calm and beautiful.",
      "💜 AROMATHERAPY SPA CANDLES: Transform the energy in your home or office to instant Zen. Relaxing and calming, so that all your stress is gone.",
      "🎁 THE PERFECT GIFT: For Birthday, Wedding, Christmas, Anniversary, Valentines Day or Mothers Day gift. A natural, luxury gift that will lift the spirits and create a positive mood for you and your loved ones.",
      "💜 GREAT FOR BATH AND BODY: Beautiful in the bathroom, living room, dining area or general living space. Take this candle to your next massage, enjoy and relax.",
      "💜 LARGE SCENTED CANDLES: These candles are BIG, Clean, and Green. 80 hour burn time ensures many hours of cozy, homely bliss. Made with natural organic soy wax and essential oils coupled in a handcrafted decorative glass to add ambience and tranquility to your home or office."
    ],
    "specifications": {
      "Product Dimensions": "4.5 x 4.5 x 3.5 inches",
      "Item Weight": "1.7 pounds",
      "Manufacturer": "T&H Wholesalers",
      "ASIN": "B07HB8PM7V",
      "Item model number": "FLVG3W01",
      "Customer Reviews": "4.3 out of 5 stars185 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#23,323 in Health & Household",
      "Is Discontinued By Manufacturer": "No",
      "Scent": "French Lavender & Vanilla",
      "Batteries Required": "No"
    },
    "categories": [
      "Health Care",
      "Aromatherapy",
      "Home & Kitchen",
      "Candles",
      "Health & Household",
      "Alternative Medicine"
    ],
    "price": 18.88
  }
}