{
  "website_summaries": [
    {
      "verdict": "Amazon's slightly upgraded entry-level Fire 7 tablet remains a good value, but you're still better off spending a bit more for the HD 8 instead.",
      "pros": [
        "The Amazon Fire 7 is inexpensive, has a standard headphone jack and houses a microSD card slot expandable up to 512GB",
        "This 2019 edition has an upgraded processor and adds support for hands-free Alexa",
        "Amazon Prime members can access the bevy of free TV shows, movies and games included with their $119 (£79) annual subscription"
      ],
      "cons": [
        "The screen is sub-HD quality",
        "App store doesn't have quite as much variety as Google Play Store",
        "To truly take advantage of what the tablet has to offer, you need an Amazon Prime membership"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 7.0
      },
      "publication_date": 20190618,
      "rating": 7.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Questionable battery life",
      "text": "Good budget tablet but the battery drains continuously when idle at a fast rate (10% daily)",
      "rating": 3.0,
      "verified": true,
      "author": "Tools. Electro. DIY",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "This is not ready for prime time",
      "text": "I am surprised by how bad this product is given the overall decent quality of Amazon products. The screen is unresponsive and freezes. Kindle books I purchased are inaccessible from this device no matter what I do to open them even though they show up on the kindle app. I cannot delete apps that I don’t want even though I am supposed to be able to do so. Too many ads show up and there doesn’t appear to be a reliable way to avoid them.",
      "rating": 1.0,
      "verified": true,
      "author": "Mysecretavatar",
      "helpful_votes": 831,
      "publication_date": 20190611
    },
    {
      "title": "Nice size and weight",
      "text": "I really didn't need a new one but wanted the 32 GB. It works really well so far. Haven't had any problems. The battery doesn't seem to last as long as it says but I have only charged it a couple times since receiving it. Time will tell on that but it does work well. I inserted a 128 GB mini sd card and works great, just like it should. The blue color is really pretty and a little different than the 7th generation I have. The thing I like the most is the 32 GB instead of the 16. Nice upgrade.",
      "rating": 5.0,
      "verified": true,
      "author": "cat101",
      "helpful_votes": 234,
      "publication_date": 20190610
    },
    {
      "title": "worst of the lot",
      "text": "I own every model/series of Kindle and can say this last Fire 7 is the worst - very slow to load - crammed with ads to the point you can hardly use..size is a good midrange and weight is beautiful - now if it only worked well.. this won't get published as Amazon never allows bad press",
      "rating": 1.0,
      "verified": true,
      "author": "mandy",
      "helpful_votes": 150,
      "publication_date": 20190616
    },
    {
      "title": "Get Ready to be Black Mailed",
      "text": "Get ready to pay $15 so your device isn't full of adds and offers. Way to piss off your customers Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Positive Altitude",
      "helpful_votes": 139,
      "publication_date": 20190612
    },
    {
      "title": "Loved the color and that’s it",
      "text": "Battery doesn’t hold a charge- at all. Not impressed that ads pop up on the lock screen and cost $ to remove. Comes with a full screen of factory apps that cannot be deleted. Only works with amazon apps so no chrome cast. Really wished I could have kept around for web and reading but have to return due to battery defect.",
      "rating": 1.0,
      "verified": true,
      "author": "MORNINGSTARR",
      "helpful_votes": 89,
      "publication_date": 20190611
    },
    {
      "title": "DEFECTIVE",
      "text": "I DIDN'T LIKE ANYTHING ABOUT THIS FIRE TABLET. FIRST OF ALL, I HAD THIS DEVICE 1 DAY AND THE VERY NEXT DAY IT WOULDN'T TURN ON. SECONDLY, PIXELS STARTED SHOWING UP, THE DEVICE KEPT SHUTTING OFF. I CALLED CUSTOMER ASSISTANCE 4X AND EACH TIME THE DEVICE GOT WORSE AND WORSE. I WOULDN'T RECOMMEND FOR ANYONE TO BUY THIS FIRE TABLET. I RETURNED THIS PRODUCT AND PURCHASED ANOTHER TABLET THAT HAS RATINGS.",
      "rating": 1.0,
      "verified": true,
      "author": "LL",
      "helpful_votes": 86,
      "publication_date": 20190611
    },
    {
      "title": "Can't get kindle to take my password which I know is correct.",
      "text": "Live chatted with their \"experts\" for over an hour. They had me check the date, time which I told them I couldn't get to. They had me turning off and restarting wi-fi and kindle. the last one gave me instructions to go into Windows. While going from his chat notes to my computer, he typed \": I don't mean to rush you, but we've been idle for 2 minute. \" WOW. So now I am trying to figure it out myself because I wasted over an hour with people who knew no more than me!",
      "rating": 1.0,
      "verified": true,
      "author": "LOLA STEGALL",
      "helpful_votes": 74,
      "publication_date": 20190615
    },
    {
      "title": "Get something better",
      "text": "Don’t waste your money on this. The only good thing about it is the price, but it’s not worth it. I didn’t expect it to be IPad quality, but this is just ridiculous. Here is a list of all the problems I have encountered so far: Built very flimsy. I feel like I am going to break it with normal use. Resolution is awful. Drops WiFi constantly. Lag much? This thing is slow. You have to jump through hoops to get google play on it and their App Store is sub-par. Shall I continue? Just pay the extra and get something better.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 61,
      "publication_date": 20190618
    },
    {
      "title": "new Fire 7 is an improvement",
      "text": "bought this new 2019 version of the Fire 7 for like fifty bucks plus tax etc from here on amazon. upgrading from the Fire 6 HD. really like this Fire 7 tablet. as well as all the built-in amazon stuff on this tablet, was also able to put google play store etc on this tablet -- easy peasy -- just look up how to do it on the internet. if you want a tablet, this is the one to get.",
      "rating": 5.0,
      "verified": true,
      "author": "ruel",
      "helpful_votes": 51,
      "publication_date": 20190611
    },
    {
      "title": "Ads ads ads ads .",
      "text": "I should have done more research. I got this 2019 fire 7 on prime day for $29.99 and thought it would be cool to keep by the bedside for reading books. I did NOT realize it came with ads on the lock screen. The item description is deceptive. It says with “special offers.” I thought that meant it was on sale for prime day lol. Special offers is a play on words. They meant ADS. Special offers = ads!",
      "rating": 1.0,
      "verified": true,
      "author": "RAM",
      "helpful_votes": 45,
      "publication_date": 20190722
    },
    {
      "title": "Not super happy with this purchase. should have kept my previous 7”",
      "text": "If I had not traded in my previous 7” for this one, I would send this back. It works but the battery does not seem to hold up well and I honestly believe my previous Kindle 7” was faster. I like the fire tablets because they read to you and I will purchase one in the future but I think this needs some seriously RAM upgrades, really disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "R & R",
      "helpful_votes": 45,
      "publication_date": 20190616
    },
    {
      "title": "You can't uninstall games, apps or any other BS that THEY WANT IN IT.",
      "text": "It's a sales scam. It's LOADED with amazon sales apps that Can NOT BE UNINSTALLED. -Internal battery SUCKS. It AUTOMATICALLY uploaded my PRIVATE PHOTOS TO THE DAM CLOUD! -I HATE THIS THING. It's a privacy and sales ad scam and it will FOREVER BELONG TO Amazon, no matter what we pay for it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 41,
      "publication_date": 20190619
    },
    {
      "title": "Too many ads!",
      "text": "The new Fire tablet works well overall if you can get past all of the advertisements and Alexa constantly prompting you to buy this and subscribe to that for only $xxx dollars a year! Good sound and video quality, though queuing up a video takes a bit of time. Battery tends to drain fairly quickly. I’ll be switching back to my way overpriced iPad but happy to do so since ever other click doesn’t want me to spend more money. Basically if you want an inexpensive tablet to read, browse online and watch videos this may be the product for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 39,
      "publication_date": 20190613
    },
    {
      "title": "Loaded with Ads.",
      "text": "Truthfully my Kindle Fire Gen. 3 was a better machine. I has a much heavier build, longer battery life and it didnt spam me with ads at every swipe. They have { Amazon} gone over board with their self promotion. I like the location of the buttons and the feel. Screen is sharp, but aps don't load as fast as my Gen. 3....prob. because 0f all the bloatware in the Gen 9. And....And...no other browser except for silk...ugh. Firefox for the win ..is no longer available. Maybe I can re gift this.",
      "rating": 2.0,
      "verified": true,
      "author": "LarrySmola",
      "helpful_votes": 33,
      "publication_date": 20190620
    },
    {
      "title": "Battery makes it not worth it.",
      "text": "Battery dies 1% a minute. Absolutely ridiculous. My old fire 7’s only need to be charged once daily. This one is every couple hours!",
      "rating": 1.0,
      "verified": true,
      "author": "Tracy L Mattingly",
      "helpful_votes": 28,
      "publication_date": 20190715
    },
    {
      "title": "Bad",
      "text": "Feels cheap. It lags. Too much tabs with unnecessary functions. Simple tasks causes delay of a second or more to complete. Returned it. Not recommended. You’re better off buying a Samsung",
      "rating": 1.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 26,
      "publication_date": 20190618
    },
    {
      "title": "Special price comes with too much advertisement",
      "text": "The price was appealing but I was not aware that the special price included so much advertising and that the “included cover was not a case which you would have to purchase. The screen is small, but if you are use to watching videos on a very small screen, then it would be fine. I have an iPad and still might consider a Fire tablet but with a larger screen. I was looking for something smaller than my iPad to travel with.",
      "rating": 1.0,
      "verified": true,
      "author": "RMN505",
      "helpful_votes": 23,
      "publication_date": 20190618
    },
    {
      "title": "Hardly any difference from my older Fire 7 Table!",
      "text": "I actually returned this item as I saw no difference in this new edition versus my older edition. Just thought Newer Edition Fire 7 Tablet would be so much better. Improved and faster etc. And at first I was excited about this New Edition. However, after receiving it and checking it out I found very lacking in any improvements at all. Only change I saw or could determine was that it was built differently from my older Fire 7. My opinion is if your older Fire 7 Tablet is working OK no need to buy this newer edition.",
      "rating": 3.0,
      "verified": true,
      "author": "john f. clifford",
      "helpful_votes": 20,
      "publication_date": 20190627
    },
    {
      "title": "I'd suggest buying the 8 or higher...",
      "text": "So, I bought this on the fly when my daughter accidentally crushed the screen on her Fire 8. It was considerably cheaper and my thought was that I'd just saved a ton of money for just a little smaller screen (think Iphones and the slight differences in each level) Boy was I wrong. These tablets are worlds apart! From smaller screen to significantly decreased battery life and tons of things in between (constantly getting \"stuck\" and having to completely reboot, touch screen not working properly, poor sound quality, etc.) I am highly disappointed. Don't do like I did being cheap, swing the extra for the 8 or higher. You'll be happier in the long run.",
      "rating": 2.0,
      "verified": true,
      "author": "Ms. Tam",
      "helpful_votes": 11,
      "publication_date": 20190716
    },
    {
      "title": "Defective Kindle",
      "text": "I received this yesterday. I charged the battery and started it...no issues. I downloaded everything I needed and suddenly the tablet began to display grids and wouldn't display anything. I restarted it few times and nothing happened. Sending back today.",
      "rating": 1.0,
      "verified": true,
      "author": "Albert",
      "helpful_votes": 15,
      "publication_date": 20190619
    },
    {
      "title": "Don't buy. More issues than worth.  REPLACE THE FIRE 7 TEAM. POOR MARKETING STRATEGIES",
      "text": "DO NOT BUY. Gen 7 has been crippled in so many ways. Amazon app store has nothing my gen5 was able to get. They have removed voice typing FROM ALL KEYBOARDS. Can't get flipboard. Found a way to get playstore on device. Were it not for that i would dump this in a flash. MAKING DEVICE ONLY ABLE TO USE AMAZON APP STORE, WHICH HAS MINIMAL APPS IS A CRIME..this is afterall a Google platform. I HAVE NEVER COMPLAINED ABOUT ANYTHING AMAZON zBut this SUCKS...Did i mention their keyboard sucks too (Sooo many typos to fix)",
      "rating": 1.0,
      "verified": true,
      "author": "MarDin",
      "helpful_votes": 12,
      "publication_date": 20190623
    },
    {
      "title": "Lots of bugs (Updated)",
      "text": "I’ve always been happy with the kindle fire until this new one. I really only use it for reading, and I have been hindered. The WiFi drops in and out. This makes viewing and buying books difficult. My new favorite feature, filtering by read/unread, only shows up half the time. When selecting unread, half don’t show up. I find it hard to believe that the apple kindle app works better than Amazon’s own product. I’ve stuck with Kindle, because I love being able to purchase book right where I’m viewing them. However, I’m rethinking the Kindle. Update: Bugs are starting to be worked out and with some resetting, it is working better. Much like my old kindle.",
      "rating": 3.0,
      "verified": true,
      "author": "Krys",
      "helpful_votes": 15,
      "publication_date": 20190618
    },
    {
      "title": "Just a color Kindle",
      "text": "...and DO NOT send your old Fire in for a refund expecting your credit to apply to your new one, unless you wait for them to process your trade! You'll just lose your credit (like I did.) This is a lame table that lives in a marginal ecosystem (Amazon's) and won't do most of the things a tablet should do. If you don't have a real tablet, are on a budget, and you're looking for a color Kindle -- and I can see why a very few folks might be; there are a few Kindle books that deserve to be read in color -- then this device is for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Potts",
      "helpful_votes": 10,
      "publication_date": 20190712
    },
    {
      "title": "EXCELLENT",
      "text": "YOU CAN DOWNLOAD GOOGLE PLAY. I almost didn't get this but it was on sale for prime week so I was like it's less than $30?? What can I lose. I got it. Obviously it isn't going to come with Google play on it because it's a amazon product. I just simply Googled how to install on Kindle fire. Now I have it on my tablet as you can see on the video. Get this! It's the perfect size. It's perfect for reading my books for college but also play games!",
      "rating": 5.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 9,
      "publication_date": 20190803
    },
    {
      "title": "50 Dollar Paper Weight",
      "text": "50 Dollar Paper Weight: Do your research, I bought to use this tablet to control my wifi connected home products, Phillips Hue, music and smart plugs. As it turns out Amazon Store is the only place to get Apps and they don't have many premium apps or the specific ones I need particularly the Phillips hue compatibility. I don't have time to send back. What a waste. Updated: Amazon called me and offered me a return label and a bunch of excuses. Thanks for nothing, all the money in the world and can't make a good product.",
      "rating": 1.0,
      "verified": true,
      "author": "Goodbedford",
      "helpful_votes": 9,
      "publication_date": 20190626
    },
    {
      "title": "Nice upgrade to the previous model but...",
      "text": "...the battery life is horrible compared to the Kindle Fire 8. A full battery after reading for an hour or two a day will have 54% battery life the next day. No gaming, no movies, no surfing the web. I purchased this solely to read books and because of it's size is easier to carry when traveling. It's the same experience as in reading and purchasing books. If you've used one Kindle, you'll know how to use this Kindle Fire. Other than the battery life, it's a good device.",
      "rating": 4.0,
      "verified": true,
      "author": "Hawkstv",
      "helpful_votes": 8,
      "publication_date": 20190615
    },
    {
      "title": "Buy it already for crying out loud!!!",
      "text": "The new 7\" Tablet has everything I wanted. I upgraded from the last generation of 7\" Tablet and there is a huge difference. I'm very pleased so far and the extra storage is great. I went from 8\"GB internal to 32GB internal and a 128GB memory card and I would be hard pressed to use it all! The processor is markedly faster than the old generation. Amazon hit a home run with this! BTW, I am not being paid in any way, shape, or form. This is just a great Tablet!",
      "rating": 5.0,
      "verified": true,
      "author": "Texantothebone2500",
      "helpful_votes": 10,
      "publication_date": 20190617
    },
    {
      "title": "Only purchase it on sale.",
      "text": "The Fire 7 is just ok...and that's ok. I wish Amazon would be more innovative with this line because I prefer smaller tablets; however, smaller tablets is ubiquitous with cheap tech. I'm baffled why the battery life was scaled back, annoyed with the low-res screen and unhappy with the slippery, plastic build. Despite it's faults, the tablet proves it's worth if purchased on sale as I did. It's light and is the perfect tab to throw around at the gym or at work. This tablet is not worth more than $29.99; however, if you can purchase it on sale then I recommend it.",
      "rating": 3.0,
      "verified": true,
      "author": "LK",
      "helpful_votes": 6,
      "publication_date": 20190621
    },
    {
      "title": "Extremely disappointed.  May never order again.",
      "text": "This is my 4th (maybe 5th) kindle. I bought it for the sole purpose of playing GSN games on it. It’s literally the only thing I use it for. I’ve been using it for a little over a month and it’s already halfway out of memory and it kicks me off the game daily. I’ve had to delete and reload it a number of times. This product is far inferior to the first two I had. The last one wasn’t so great either.",
      "rating": 1.0,
      "verified": true,
      "author": "kimber",
      "helpful_votes": 9,
      "publication_date": 20190704
    },
    {
      "title": "My new fire tablet",
      "text": "I hate the ad display, and wish I had sprung for the extra to not see any them. I purchased solely to be able to set up my Amazon Alexa echo and echo dot, and it did do that. I prefer my old first generation Apple MacBook mini tablet to this. Unfortunately, the os system on it is too old to set up the Amazon echo. The fire tablet is also much smaller than the apple mini.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 9,
      "publication_date": 20190714
    },
    {
      "title": "It’s OK",
      "text": "This is my third Fire. First one just died (I was told I overcharged it). The plug where one charged it had a poor connection on the second one. I have a 13” Fire but I find the 7” more portable for travel. They’ve moved the speaker to the left hand bottom edge, just where one would hold it. I don’t like that because it really is awkward to hold!",
      "rating": 4.0,
      "verified": true,
      "author": "peg",
      "helpful_votes": 6,
      "publication_date": 20190714
    },
    {
      "title": "NOT WORTH A NICKEL!!",
      "text": "This unit is terrible. The operating system is really, really bad. It flashes stuff on the screen and then they go away. The battery goes out with just a few hours of use. Can't adjust the screen brightness easily or the font size without going thru a couple of pages of crap. It's so confusing to use I was looking at books in the website of the local library- found the book I wanted and it sent me to Overdrive where they conned me into buying the boo instead of checking it out. Didn't even know that until I go an email from Amazon saying I had bought a old book for 10 bucks!!!!!!!!!!!!!!!!!!! Kindle Fire is garbage!",
      "rating": 1.0,
      "verified": true,
      "author": "Denny B.",
      "helpful_votes": 4,
      "publication_date": 20200617
    },
    {
      "title": "Tiny Font Size Options - Full of Crapware - all I want is an e-reader - this is not it!",
      "text": "Unlike my Kindle Paperwhite, the FIre 7 has very few font size options, and all are way too small. This lack of large font sizes is enough of an issue to send this back. The other reason to send this back is it is loaded with crapware, and Amazon does not let you delete unwanted apps. I paid extra for \"no special offers,\" but this tablet is loaded with crap. All I want is a reader, one with type big enough to read, with the choice of black or white text/background. Instead, I Amazon sent me something which is difficult to read and difficult to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Colorado Steve",
      "helpful_votes": 5,
      "publication_date": 20191110
    },
    {
      "title": "Kindle “fire” gets REALLY HOT",
      "text": "My daughter has had this for 4 days and when I picked it up to put it away as she was getting ready for bed, the back was VERY, VERY hot. I am very glad she hadn’t been touching it. It was not charging, it was on, but idle. I feel like that should be addressed as a safety concern, seeing as so many of these customers are clearly buying these for children.",
      "rating": 1.0,
      "verified": true,
      "author": "Gavett Burch",
      "helpful_votes": 7,
      "publication_date": 20190704
    },
    {
      "title": "Great For The Price",
      "text": "I received this tablet a few days ago and I can say it’s great for the price. I purchased this strictly for entertainment purposes (Netflix, kindle, youtube, etc.). It’s the perfect size and fits perfectly in my hands. I do wish the charging port and headphone jack were at the bottom of the tablet, instead of the top (as the top of the tablet is crowded with buttons and ports). Video quality is decent, not great, but for $50 I can’t complain. I would recommend this to anyone looking for a smaller, affordable tablet that they can use for video, reading, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor Hise",
      "helpful_votes": 5,
      "publication_date": 20190615
    },
    {
      "title": "Good successor to the original Kindle Fire but beware of lower \"special offers\" price",
      "text": "I got this new Kindle Fire as a replacement for the original Kindle Fire of several years ago, which still works fine but I wanted a faster processor and nicer display. For the price, this new Kindle is great. But I got the offer with the discount of \"special offers\" and I really didn't know what that meant. Then I figured out that it meant I would get ads on my display very often, which I had to click to dismiss and there was no way to turn off. In the end, I ended up paying Amazon an extra $15 plus tax to \"unsubscribe\" from the \"special offers\".",
      "rating": 4.0,
      "verified": true,
      "author": "Jorge A. Pita",
      "helpful_votes": 5,
      "publication_date": 20190718
    },
    {
      "title": "Like ads on your lock screen? This isn't a sale.",
      "text": "There was no clear warning before purchasing that buying this product at sale price meant it would forever have ads on the lock screen. If you want them removed, you have to pay back the $15 discount on the device. This is shady business, tricking customers into thinking they were getting a good deal and then not clearly providing information that there would be ads.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan Amos",
      "helpful_votes": 7,
      "publication_date": 20191201
    },
    {
      "title": "Needs full Android OS",
      "text": "For the most part I Love the new Fire 7 (2019), the only thing I dislike, so far, is Amazon does not use the full Android OS. Because Amazon refuses to use the full Android OS I can not get or use some of my favorite Apps. They are now only available on Google Play, and Amazon does not allow use of Android Apps if they are on Google Play. Apps like Trivago, Amtrack, 7-11 Rewards, MyTuner Radio, or iTranslate just to mention a few I have tried to switch from my old Fire 6 to my new Fire 7 but are no longer available on Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "David P.",
      "helpful_votes": 5,
      "publication_date": 20190615
    },
    {
      "title": "Buy something else!",
      "text": "This tablet is terrible! Seriously, buy something else. I can’t believe that this is the new version. The 1gb of ram is barely enough to run its own operating system standing still. It takes about 2/3 of the ram to sit doing nothing. Anything that you try to do, web browsing, reading, anything even it’s own apps, will over tax your system. I’ve owned other Fire tablets in the past and this one is worse out of the box than those were when I got rid of them.",
      "rating": 1.0,
      "verified": true,
      "author": "Williams_79",
      "helpful_votes": 6,
      "publication_date": 20190914
    },
    {
      "title": "wonderful",
      "text": "I really like that alexa is now hands free that's the main reason I updated my old kindle fire , on my old fire I had to walk over to adjust volume or push a button to talk to alexa but on this new one I can stay where I am and ask alexa to turn up the volume or skip songs",
      "rating": 4.0,
      "verified": true,
      "author": "yavon",
      "helpful_votes": 4,
      "publication_date": 20190611
    },
    {
      "title": "High hopes but ultimately let down",
      "text": "I bought this Kindle to keep at work to use primarily as a music player and to read on my breaks. I was extremely disappointed after about 5 minutes of using the product. The touchscreen was not very responsive and I had to swipe or tap many times to get anything to register. At work I tried to connect my speaker via bluetooth but the it would not work. The bluetooth on the kindle couldn't sync with anything. At this point I reset to the factory settings, boxed it back up and returned.",
      "rating": 1.0,
      "verified": true,
      "author": "LJK",
      "helpful_votes": 4,
      "publication_date": 20190923
    },
    {
      "title": "All New Fire 7",
      "text": "I have been somewhat disappointed by the speed. I expected the unit to respond faster than my previous tablet but I am not seeing it. I basically do not see much of an improvement from my previous unit.",
      "rating": 3.0,
      "verified": true,
      "author": "Don Douds",
      "helpful_votes": 5,
      "publication_date": 20190612
    },
    {
      "title": "Save your money.",
      "text": "The tablet touch screen is very finiky. The battery only lasted three hours, brand new, playing audible from a full charge. That aside, the tablet is ALWAYS pushing crappy apps with the close screen advertising. For the price, there are much more versatile and higher quality tablets out there... I got it as a prime day deal, but 3-10 would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Jc",
      "helpful_votes": 5,
      "publication_date": 20190722
    },
    {
      "title": "Nice and affordable!",
      "text": "Always a fan of the Kindle. This new 2019 Kindle 7 is awesome. The emojis are up to date. Speed is better. Everything about it is better except for 2 things. I don't feel that the battery is any better (that's why I took away one star under the battery life section). I wish the camera was better but it's same old one. An upgrade of the camera would be nice. I'm still very happy with it tho.",
      "rating": 5.0,
      "verified": true,
      "author": "BTX",
      "helpful_votes": 4,
      "publication_date": 20190618
    },
    {
      "title": "Very Slow",
      "text": "I have a fire 7 from way back. Just got the new fire 7. The new one is much slower. I have to swipe many times to get to the main menu. What's with all those Amazon icons. I can't get rid of them. I could on my old fire. Rough time downloading a book from my library. Very quick and easy on my old fire. The battery life is very poor. Much better on my old fire. Very disappointed. Think I go back to my old fire and forget the new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Louis N Fitzpatrick",
      "helpful_votes": 6,
      "publication_date": 20190626
    },
    {
      "title": "Very slow, but you get what you pay for.",
      "text": "I own each size and latest model of the Fire Tablets. I have to say that the 7 and the HD 8-models are just way too slow compared to the HD 10. These are honestly not worth the money until they upgrade these devices with AT LEAST the processor and RAM that the HD 10 has. They definitely need to do some updating/upgrading on internal parts. However, for $29 as an Amazon Prime Member, you get what you pay for. I don't recommend the 7 or HD 8 until some upgrades happen. With this being said, I am hoping for some huge changes on the next model(s)!",
      "rating": 1.0,
      "verified": true,
      "author": "Z",
      "helpful_votes": 3,
      "publication_date": 20190920
    },
    {
      "title": "Good quality",
      "text": "I really like the size as it is easy to handle and read. It is much improved over my older Kindle Fire with all of the apps and conveniences. I use it mostly to read books but it has many more uses. I purchased a case with it and like the fact that it goes to sleep when I close the cover. I haven't actually used the camera that much but was impressed with the fact that it actually has one. I would recommend this tablet!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki Neely",
      "helpful_votes": 4,
      "publication_date": 20190611
    },
    {
      "title": "It's a \"you get what you pay for\" kind of a thing.",
      "text": "Annoying ads that appear every time you turn it on or wake it that have to be dismissed to use the tablet. Many apps you're used to not available: LastPass, for instance (and it's essential for me), and no real choice of browsers: Firefox, Chrome, Opera, Vivaldi, etc are not available. The main reason I got this is to use as an inexpensive way to access my cable channels in the kitchen using Cox cable's Contour app. It will inexplicably stop playing after some minutes, needing to be restarted. It's possible that this is an issue with Contour, but this never happens when using it on my android, iPhone or iPad.",
      "rating": 2.0,
      "verified": true,
      "author": "generic",
      "helpful_votes": 3,
      "publication_date": 20190716
    },
    {
      "title": "Perfect new user tablet",
      "text": "I tried again, wanted to be happy with the All New Fire. Quickly realized it would be returned as has every new release since the HDX. My HDX is on its last leg. Need something comparable. Purchased an Apple product for the first time. I can say finally that the Amazon HDX has been retired, incredibly successful run, couldn’t have asked for more. I wish it was an Amazon tablet that could have replaced it. If you’ve never had a tablet then this All New Fire will be perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Flaim",
      "helpful_votes": 4,
      "publication_date": 20190620
    },
    {
      "title": "Slow. Slow. Slow.",
      "text": "Slow. That's all you need to know. I dont use it for much. Web browsing and ebooks. Pages load slow, app open slow. Wifi is so slow. YMMV but i had the prev gen and sent it back. I should have sent this back. Even the amazon app is slow. Load a search, start strolling through the results and it just stops for 30 sec. No scrolling no response from app or tablet.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190826
    },
    {
      "title": "I admit that I bought it because of the price",
      "text": "Bought late on Prime Day. By the time I got to it, there was a 2 week gap. Played with it a bit. Not thrilled with the closed walls of it all. But, did I mention the price? One notable event, was the battery life. I was surprised by how low the battery level became in such a short time. It will find uses in my life. Was mosDef worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Ruscio",
      "helpful_votes": 3,
      "publication_date": 20190809
    },
    {
      "title": "Battery Drains While Idle",
      "text": "This is my fourth Kindle and until just recently I’ve never had a problem. I don’t know what they’ve done but the battery drains when it’s not in use. Maybe it’s the ads, maybe it’s the WiFi, maybe it’s an app running, whatever it is it’s frustrating. I’m always picking up a dead Kindle. I’m glad it was inexpensive because I’m not keeping it much longer. They’ve ruined a good product in my opinion.",
      "rating": 2.0,
      "verified": true,
      "author": "Bob Pruhs",
      "helpful_votes": 3,
      "publication_date": 20191016
    },
    {
      "title": "Crappy Battery Life, Crappy Tech Support & No e-bay. Other then that it's great!",
      "text": "The battery life runs out much faster than my previous Fire and when I e-mailed customer support for an exchange, they told me to call and tech support will try and fix the battery life by talking to me. They did the same thing with my Alexa Echo Dot because the sound is muffled. I asked for a replacement and was told to call so they can fix the speaker over the phone. Also...if you're an e-bay shopper like me, be ready to be disappointed. Only certain pages on e-bay work. If you want to buy something you have to go to your computer or phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick Manix",
      "helpful_votes": 2,
      "publication_date": 20190714
    },
    {
      "title": "Very very slow.",
      "text": "Takes forever after you hit a button for anything to happen so you are beating on the thing, not knowing that its changed screens and the next thing you know you are looking at things you never supposed humans were able to physically do sexually. Ugh. Doesnt stay charged even overnight. Touch anywhere near the sides and another page jumps out, no way to get back to where you were, forces alexis talking idiot on you, games are too little icons are too little, cant see a thing on it, have changed settings and had husband who is smarter than me say he gives up, I will find someone to give this to.",
      "rating": 3.0,
      "verified": true,
      "author": "Censored Too Often, So Done With Reviews",
      "helpful_votes": 2,
      "publication_date": 20200421
    },
    {
      "title": "Thing is garbage",
      "text": "I'm going to be brutally honest here... This thing is moist garbage,not even fit for a dumpster fire. 1: Bloatware that cannot be Uninstalled or DISABLED. 2: Battery life is nonexistent. 3: This one pisses me off the most. Ads on the lock screen. Are you serious?! I payed money for this product, why must I see ads every time I unlock MY tablet? 4: Without the use of a computer I cannot change the homescreen. 5: Without hunting the internet there is no Google play store. (and is kind of a pain to install if I'm being honest) Honestly just spend your money elsewhere,this is not worth your money.",
      "rating": 1.0,
      "verified": true,
      "author": "David m.",
      "helpful_votes": 3,
      "publication_date": 20191005
    },
    {
      "title": "battery does not perform",
      "text": "I had one a few years ago and ran into a problem with charging the device. I tried various solutions with no success. A few months ago I decided to try a new one. Surely they had improved. But no. Let me say the device itself is fine. My use is fairly basic and it does what I need it to. As long as I can keep it charged! It recharges at a snail's pace and then quickly drains power when used. You may want to try something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Miller",
      "helpful_votes": 3,
      "publication_date": 20190813
    },
    {
      "title": "Not a fully functioning tablet.",
      "text": "Not a fan at all. It will not download DJI Go 4 app, which is the only reason I got this to begin with. However, there are more issues at hand. Firstly, It doesn’t use the Play store, so make sure to research that the Fire tablet can utilize some of your Android favorites. There’s a huge delay in the touch screen response. Lastly, and the most important issue, is that the tablet will display pop-up Ads on the lock screen, home screen, and even while using the Device. So be prepared to see pop-up ads while watching an Ad on the YouTube App. The battery life is average.",
      "rating": 2.0,
      "verified": true,
      "author": "Keith W.",
      "helpful_votes": 4,
      "publication_date": 20190625
    },
    {
      "title": "Disappointed",
      "text": "Pretty terrible battery life. The only reason I got this was because my original Kindle Fire from 2012 doesn't have bluetooth capability. The original has stellar battery life. Can leave it on but sleeping for a month and come back to it and it will wake right up. This one I feel like I have to charge it at least every other day. What happened in the last 8 years Amazon? Shouldn't battery life improve as technology improves? Disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 2,
      "publication_date": 20200517
    },
    {
      "title": "I wish to hear bros the thing but wouldnt!",
      "text": "I can't look at any article, play any game without it spitting me out to back where I started! Again and again, the same thing. I've tried reopening the app but no change! It is a brand new tablet so I don't understand what it could be. It is so frustrating to begin something and suddenly it closes or returns you back to where you were.",
      "rating": 1.0,
      "verified": true,
      "author": "charisse dickinson",
      "helpful_votes": 4,
      "publication_date": 20190705
    },
    {
      "title": "Awful in just about every way",
      "text": "This is probably the tablet they issue in purgatory. It’s laggy, semi responsive, full of ads, and worst of all half it’s battery is used up in standby over 24hr period. It’s like a tablet that’s subpar in every way. Glad I only use this to monitor amazon cloud cams because it doesn’t have apps for any other camera providers. In fact it doesn’t have 99% of the apps in droid or iOS stores. It didn’t even have YouTube until July 2019! It doesn’t even have native apps for their very own blink cam! Update June 2020: Loading a simple webpage which loads in sub-milliseconds on iPad takes 20 seconds on this device. So AWFUL.",
      "rating": 1.0,
      "verified": true,
      "author": "Edih",
      "helpful_votes": 2,
      "publication_date": 20190725
    },
    {
      "title": "Speaker on back.",
      "text": "Really enjoy watching all my shows on this tablet! I still have to download games to see how the RPG are and other arcade games. The only down side is the speaker to the tablet. It’s kinda behind or in the back of the tablet so you don’t get the volume towards you. You need to turn up the volume. Also you might want to get a case for the tablet. Especially if you have kids. The tablet feels kinda fragile if it is drop. So best be safe with a case.",
      "rating": 5.0,
      "verified": true,
      "author": "Edmond Chong",
      "helpful_votes": 2,
      "publication_date": 20191129
    },
    {
      "title": "Good budget tablet, but battery drains at a rapid rate.",
      "text": "It works great so far and so far I have not had any problems. The battery doesn't seem to last as long as it claims, but I've only charged it a couple of times since I received it. Time will tell, but it works well. I inserted a 128GB mini sd card and it works great. The blue color is really pretty and a little different from the seventh generation I have. What I like the most is the 32 GB instead of the 16.",
      "rating": 5.0,
      "verified": true,
      "author": "Haztive Dominicana",
      "helpful_votes": 2,
      "publication_date": 20200928
    },
    {
      "title": "Amazon Fire Tablet",
      "text": "This tablet has amazing picture quality. Its very easy to navigate and use. I dislike I can't get rid of Alexa but with parental controls my kids can't use Alexa. I dislike that you have to pay more to remove the adds. There no YouTube. And I don't like that you can't uninstall certain apps that came with the tablet I also bought an SD card for more space because it fills up quickly. But overall I bought it for my.kids and they enjoy the tablets.",
      "rating": 3.0,
      "verified": true,
      "author": "Persephone",
      "helpful_votes": 2,
      "publication_date": 20200516
    },
    {
      "title": "Super slow to download books",
      "text": "Takes way too long to download books and then some purchases do not show up for 30 minutes. Old Fire works much better. I do not recommend buying this model. I bought this ti read books on.",
      "rating": 1.0,
      "verified": true,
      "author": "janice thompson",
      "helpful_votes": 5,
      "publication_date": 20190629
    },
    {
      "title": "I hate this new Kindle Fire 7",
      "text": "This Kindel Fire 7 is horrible. It randomly throws up some dictionary thing in the middle of the page which will only go away if I close the application and start over. The touch screen does not work about 30% of the time, again have to close and start over. I attempted to find directions somewhere to disable the dictionary thing but cannot find information anywhere. I would return it if I could figure out how to do so.",
      "rating": 1.0,
      "verified": true,
      "author": "Charell Schillo",
      "helpful_votes": 2,
      "publication_date": 20190912
    },
    {
      "title": "not loving this model",
      "text": "I've owned quite a few of the base kindle fire models and generally love them. I bought this new one since my other one is having a hard time charging but this new one, while the color is pretty and it's more lightweight, has issues that have led to me letting it sit and continue using my old one. With a completely clean screen (and after taking off the case to make sure that wasn't the issue) the screen will randomly jump around and zoom in ect while trying to use it. Generally happened while reading fanfiction so using the web browser. It's really frustrating. wasn't a constant issue but happened several times before I gave up using it.",
      "rating": 2.0,
      "verified": true,
      "author": "Archer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "2017 vs 2019",
      "text": "Compared to the 7th gen this tablet is faster, has more storage, charges faster about a half an hour faster, latest fireos which is noticeable making accessories and customs easier with the down sides of fireos that can alternatively be adjusted. Also the speaker is in different location for better sound. Edit: after a few hours the 80% battery went down to 5% as well as the device being warm. Like a laptop that lasts a few hours before needing a charge.",
      "rating": 4.0,
      "verified": true,
      "author": "chanwenjin",
      "helpful_votes": 2,
      "publication_date": 20190611
    },
    {
      "title": "Disappointed and discouraged",
      "text": "I have been the satisfied owner of a Kindle until now. My old one recently died after years of good service. I ordered a new one which was defective on receipt. Did not hold a charge and had a flashing red screen. I exchanged this Kindle for a replacement. I cannot place the charging cord into the unit without difficulty so I do not take the cord out which is very cumbersome. I would not recommend this Kindle. I am very disappointed because I use it every day. When I got approval to return the defective one the tech rep made me feel like she was doing me a favor in approving the exchange. Poor customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Patsy",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Apps are limited",
      "text": "I bought this mainly so that I could read PDF files. Though there are free PDF readers available but they are not Adobe Acrobat and the Adobe reader is not available for install. I could not find a reader that had the PDF bookmark feature. Maybe there are PDF reader apps out there, other than the one from Adobe, that has the bookmark feature but i got tired of looking. This is a less than optimal solution for me. Additionally, the available apps are somewhat limited and the tablet comes with a lot of trash apps installed. I would not recommend this unless you are really really into Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "brewc",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Didn't hold a wifi connection",
      "text": "I wanted a newer kindle, because my older one began losing its wifi connection. Well, this new one did not connect to wifi at all! So, this is the same problem as my older kindle, but at least Amazon accepted return request without any problem since it was brand new. Wonder if Amazon did any kind of quality check before shipping to me.",
      "rating": 1.0,
      "verified": true,
      "author": "C&H",
      "helpful_votes": 4,
      "publication_date": 20190709
    },
    {
      "title": "Ok for the price, but too small.",
      "text": "I bought this tablet because I wanted another just to have around. I would suggest, if you get this, to spend the extra $15 dollars and get it WITHOUT special offers enabled. It's a nightmare with all the pre-installed Amazon bloatware that's on it. This is why my rating is only a 3 star. Yes, you can have the bloatware removed, after paying a fee, but save yourself the time and hassle of having to do this. Also, it is too small. I would also suggest to get the 10\" version, if you're going this direction.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph M. Eckert",
      "helpful_votes": 3,
      "publication_date": 20200403
    },
    {
      "title": "Cheap and not even worth that",
      "text": "I've had a lot of phones, computers and tablets over the years. Out of the box, this one is the worst. You can actually watch the battery drain with just the screen on....nothing running. It is incompatible with the United Airlines app, and the Amazon App store dropped that app for this tablet (works on other Fire tablets). It can't use YouTube TV because it can't get your location. Skype can't connect any calls....constant errors. If you're looking for a color Kindle with terrible battery life and a low price....I've got your tablet right here. If you're looking to do much of anything else at all....buy another tablet. This one is simply terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "MikeM",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Extremely laggy device",
      "text": "Slow wifi connectivity, when my wifi works fine. What I can't get over is how slow and laggy this is. For it being a new generation device it runs like a 5 year old device. So disappointing. I got this for reading and writing, so I don't use it to stream, or play games (and with how slow it os I doubt I would be able to), and yet it lags while navigating its own apps like Amazon store and even on the home screen. And there's ADs on the lockscreen? I shelled out money for this and you put ads on here?! I'm wondering if I should have gone with a kindle and if Google was a better choice.",
      "rating": 3.0,
      "verified": true,
      "author": "JumpDivine",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "NOT MY OLD KINDLE FIRE!",
      "text": "And that is not necessarily a good thing. I will begin by saying I'm not a \"techie\" and I was comfortable with the old Kindle. I don't like the constant ads which pop up and I don't like the \"Home\" screen setup. I don't like the size, and I sure was unhappy about the new cover. My old cover would assure that you could prop up the Kindle and read with just a touch of the screen to turn pages. The new Kindle and cover really don't even stand that well, making me hesitant to use the protective cover to prop the book because it falls over many times. Be aware....new is not always better!",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer Ellen",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "A bit slow",
      "text": "I'm not sure about the battery life because I have 3 other tablets that I use (two are old ones which still have apps that didn't transfer). I use Simple Radio a lot but it won't download on this tablet (it is on my other Fire). Apps are listed but I can't get them to show on the home screen, which they did on my previous 4 Fires. I think this one is harder to understand and it is very slow in switching to my own facebook page. It just seems slower in general. I thought that it would be really fast and zippy. Can't say I'm 100% in love with it!",
      "rating": 4.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Love the smaller size, but text to speech does not work",
      "text": "So happy they are offering a smaller tablet. I listen to books using text to speech function. That way I can listen to the book while walking However, the text to speech does not work. I have tried 3 separate devices, and none of them worked. If you read the forum, other people also having this same problem",
      "rating": 1.0,
      "verified": true,
      "author": "hlr",
      "helpful_votes": 3,
      "publication_date": 20190625
    },
    {
      "title": "Technical Support is Fantastic!",
      "text": "Very shortly after writing a negative Review on this fine product, I received a phone call From Jeremy on the Amazon Tech Support. Jeremy at Tech Support was very sympathetic to my Problem with SD Card compatibility. Turns out it my be a software update that is needed. Problem will be resolved Tomorrow when I can get Internet access. Jeremy is Very Professional and Courteous, as well as Knowledgeable. Jeremy IS the Reason I am staying with Amazon (I was ready to quit doing any and all business with Amazon). Thanks a Billion Jeremy😃. -Iven Rossall Pahrump, Nevada✌",
      "rating": 4.0,
      "verified": true,
      "author": "Iven Rossall",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "seems different from the older 8Gb ver",
      "text": "I upgraded from an older 8Gb ver and the new one seems faster BUT it also seems to treat my sd card differently and doesn't recall my recently used apps after it's been closed like the old 1 did. Overall I'm happy because the larger storage allows the side loading of Google Play with room to spare where the old 1 was quite full afterwards. :-) Edit:After the recent software update (10/2020) the apps are being recalled as before and things seem to be working as normal.The shutting off option has changed a little in the new software(added a screenshot option)and that makes it even nicer!",
      "rating": 4.0,
      "verified": true,
      "author": "Lawrence S",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Tablet Nice but No Synch ability",
      "text": "I discovered I was unable to synch my new tablet with my Paperwhite reader as I could with previous Kindle Fire. The technician said he couldn't do it, and others he talked to couldn't synch either. That's a definite bummer because I like to use both my Kindle Fire and Paperwhite to read the same book. My paperwhite is lighter and easier to use while reading in bed. The Fire I take with me to work in case I need to use the internet, and like to read if I have a chance.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Bartles",
      "helpful_votes": 2,
      "publication_date": 20190814
    },
    {
      "title": "This Upgrade is a Downgrade",
      "text": "I thought an upgrade didn't mean a decrease in functionality. The reduced battery life is really annoying. It does charge faster than my prior Kindle, but the shorter battery life causes me to re-charge more frequently during the day. A faster charge is nice, but doesn't make up for the inconvenience of the lousy battery life. You would think that with advances in technology, particularly in batteries, a new Kindle would at least be able to maintain prior version functionality. The other features are just as good as my prior Kindle so I'm happy with that, but next time I upgrade I doubt it will be another Kindle. Btw, I refuse to use Alexa due to data privacy issues.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy B",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Fire 7 Not too bad...worth the trade in",
      "text": "It's the same functionality except the speaker is on the side instead of the bottom. I had a case for the 5th gen and it fits fine minus the speaker placement but if you have it open it doesn't matter. I noticed the earphone jack is REALLY tight so it takes some effort to get it out. The screen saver is now an ad for a random game which is interactive but only takes a normal swipe up to get past it. It seems to be a little more responsive in games as far as loading and processing. So far no complaints. Four stars just because I don't want to over rate it, I haven't used it that much.",
      "rating": 4.0,
      "verified": true,
      "author": "MATTHEW",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Screen stopped working after 2.5 months",
      "text": "Purchased this as a gift for my mom. She really liked the one I had and appreciated the ease of use. After 2.5 months the screen started to freeze. I reset it to the factory settings, deregistered it...all the things the support for this product advised. It would work for a few minutes only to freeze up again. The last time I attempted to reset it, the screen advised the account had been locked. Sending it back for a replacement. Hopefully it won't be a lemon too!",
      "rating": 2.0,
      "verified": true,
      "author": "C. Williams",
      "helpful_votes": 2,
      "publication_date": 20200315
    },
    {
      "title": "Great buy 😍",
      "text": "Not sure on battery life yet but I bought it for my nephew who lives in the Caribbean who soon turn 2 for him to watch kid shows & play games . They have parental control which is great & they have a screen for adults so your able to switch profiles . You definitely need an amazon account linked to this tablet I had to make one in order for my sister & nephew to use . I would suggest purchasing a screen protector & case for this tablet . They are selling it in stores for $20-30 more & insurance $20 more so this was definitely a great buy .",
      "rating": 5.0,
      "verified": true,
      "author": "Ri",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Not impressed",
      "text": "Saw the deals this season and figured I'd jump on the opportunity to update our Kindles. Should have waited...these newer versions can only do a Max of 24-28 hr in standby and then you need to recharge. The old one (2017 version) could at least do several days. I have yet to see the issue of it reloading my books but it's only been a few days. It is nice that I don't have to wait 2-4 minutes each time I power it up for it to reload/download all my books. Not sure it's worth the sacrifice though in battery....",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "So bad even my child doesn’t want to use it",
      "text": "I am very surprised by how awful this tablet is. I can’t believe the good reviews. I wonder if those people have never used an actual functioning tablet. This thing is so slow. The screen freezes. A lot of apps look weird on it but look fine on our other tablet. The battery life is awful. I started a return but instead of returning it to UPS the way I do most things, I had to print the label and package it myself and just ran out of time. This tablet is so bad that even my 6 year old doesn’t pick it up to play with it. That should tell you everything you need to know.",
      "rating": 1.0,
      "verified": true,
      "author": "robbiegrl",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "The kindle came with a broken power cord",
      "text": "Once I used a charging cable that did not come with the Kindle, it charged right up. The screen is crystal clear. Despite being connected to a high speed wifi system, the Kindle is a bit slow to move from app to app and to start up. The kindle came with a plug that worked, kindle that worked, and a power cord that did not work. I needed to de-register and re-register it several times to see all of my family's profiles. If you don't get it on a super duper deal, look for another tablet. It's not really worth the $50.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Hard to figure out.",
      "text": "When I ordered this device, all I really wanted was a reader, in which to store my e-books and to be able to read them. The Fire 7 is a lot more than that, but most of its other features take more time to figure out that they're worth. I like an illustrated instruction booklet that I can have next to my Fire while I go through the motions of doing this stuff. Having instructions that I have to delete from the screen while I try to recreate them for use is error-filled and frustrating. I guess I'll just read my books and be happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Wayne Grantham",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Memory issues",
      "text": "I have no idea how this thing works. I have a micro SD card in it and there is nothing saved on it. There is nothing in my library, there is nothing in my gallery, I have no music on it. I have virtually NOTHING stored on it and it keeps telling me that I am out of memory. On line help has not resolved the issue. Totally annoying to get \"You have memory issues\" warnings every few minutes while using it. The cord from the power cube is so short you confined to the immediate area of the power cube while recharging.",
      "rating": 1.0,
      "verified": true,
      "author": "Rex A Schildhouse",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Choking on Amazon Apps",
      "text": "I expected a bit of branding and pre-installed Amazon based apps to be part of this fire tablet. However there is an excessive amount of Amazon Apps on the this tablet, none of which can be uninstalled. My main reason for buying this tablet was to read E-books. The price was right and I thought that having a Kindle tablet would be the best way to experience all the books I had bought on Amazon. Sadly, the app feels way more cluttered then the version I had on android. Once this tablet breaks, I will be going back to an android tablet.",
      "rating": 2.0,
      "verified": true,
      "author": "JMW",
      "helpful_votes": 2,
      "publication_date": 20190915
    },
    {
      "title": "Does not work",
      "text": "The first one we ordered didn't work so we sent it back and ordered another one. You are supposed to hold the start button down when it boots up and it will go to the Amazon screen but they were both stuck on the first Android one. We called for assistance and if they make a ticket for help then you can't return the item. You think the item would be checked for quality before it left the factory. We have been purchasing them for our grandchildren but won't bother trying again.",
      "rating": 1.0,
      "verified": true,
      "author": "Catwoman",
      "helpful_votes": 3,
      "publication_date": 20190615
    },
    {
      "title": "Fire 7 with adds might be fixed now.",
      "text": "Within an hour of setting up the device, and logging into my google and amazon accounts, both had an attempted login from a computer in Pakistan. If you are going to buy one, do not get the adds, since Amazon seems to be letting others see your logins. Edit. Had to replace it. The screen had blotches after sitting in my car at 30 degrees Fahrenheit. The new one seems fine. Not sure what the deal was with the old one. Amazon tech support was very interested in this device to make sure everything was secure. I am sure they have taken care of whatever security issue that caused the password problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Trixter",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Yay!!",
      "text": "Perfect so I can keep my phone. My grandson always wanted to play games, so me and my husband would alternate our phones. Now he’s got the tablet so no more killing or battery and missed calls or texts. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 3,
      "publication_date": 20190716
    },
    {
      "title": "THERE ARE MORE FEATURES AVAILABLE ON THE NEW FIRE 7 THAN THE PREVIOUS.",
      "text": "I basically use this model to read my Kindle Electronic books and for the internet when needed. The keyboard is still inferior and hard to use. It makes emailing very difficult so that feature is basically useless as far as I am concerned. Luckily, I have 2 other devices to use when I need to use a keyboard feature. Alexa is now available on this new Fire however I cannot sync it to my Echo Device .",
      "rating": 4.0,
      "verified": true,
      "author": "mehlad",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "This was a replacement and an upgrade",
      "text": "I had a Kindle 7 and loved it for reading and audibles.. I broke it. This Fire 7 tablet takes some adjustments on my part. I am annoyed that Amazon is always advertising on what ever category I'm using. I use Amazon a lot for other things and happy to. I just don't need them trying to guess what I will want to read and/hear or play games, etc. try to sell it to me. Otherwise it is sleek, picture clear, colorful, quick. I would like to turn the volume on audible up a bit more. So far I haven't found anything that does that except to connect to a speaker.",
      "rating": 4.0,
      "verified": true,
      "author": "PhylDav",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Perfect For Children",
      "text": "You get what you pay for. They're cheap, so I didn't expect much. The camera quality isn't great, at all. And they don't have much memory, so if you buy this, I highly suggest getting a memory card. You'll regret it if you don't. They also take forever to charge. However, the battery lasts for quite a while. So it's worth the wait. This is perfect for small children and teenagers. It's lightweight, the quality is crisp and it has some cool features.",
      "rating": 4.0,
      "verified": true,
      "author": "Princess S. Cole",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Great Tablet!!",
      "text": "I have been wanting a tablet for awhile now, but I have not seen one that I liked with the features that I wanted. Imagine my surprise, when I saw this! It fits all my needs and the color I wanted (my favorite color is blue)!! Very easy to use and set up. Took just a few minutes to set up and I was enjoying my new tablet! I mainly use it to read my digital books, but it can do so much more!! Very happy with it and would recommend and buy again if I needed another one!!",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Comes with Ads on Lock Screen",
      "text": "I like amazon products, such as their AA batteries, their wireless mouse and their keyboards and chairs, but these tablets are just horrible. Who would buy a tablet that comes with ads which is saved onto lock screen and eats so tons of data? It's removable only if you pay money to remove it, so dumb, they should have it placed as \"Comes with Ad\" not hidden and show as is.... The tablet only allows amazon type software and ruins the whole point of having a tablet...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Great tablet",
      "text": "It’s the same size as my other Fire tablets, which I’ve been happy using. I mostly play games on it and the size is large enough to see the screen well, yet small enough to avoid hand-cramps. It’s good for watching videos as well. It has a crisp picture and the sound is fine. It has a standard pin jack and works with my headphones. I’m very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol-n-Conway",
      "helpful_votes": 2,
      "publication_date": 20190615
    },
    {
      "title": "A very pleasant surprise!",
      "text": "I'm pleasantly impressed at the quality of the display, the upgradability of the memory, the quickness of performing tasks. The light weight (compared to my old iPad) makes this very practical for reading, and the color display makes reading books which have graphs and illustrations much more pleasurable than trying to read them on my Kindle Touch. My only gripe is that it's proving impossible for me to get documents and music transferred over from my Mac. The suggested iOs app doesn't recognize the Kindle Fire's been connected, thus there can be no transfer. I'll just have to figure out another way, including trying this from my wife's Windows computer. I'm please, very pleased, with this Kindle Fire 7!",
      "rating": 5.0,
      "verified": true,
      "author": "Longrower",
      "helpful_votes": 0,
      "publication_date": 20191222
    }
  ],
  "product_meta": {
    "title": "Fire 7 Tablet (7\" display, 16 GB) - Sage",
    "rating": 4.3,
    "feature_bullets": [
      "7\" IPS display; 16 or 32 GB of internal storage (add up to 512 GB with microSD)",
      "Faster 1.3 GHz quad-core processor",
      "Up to 7 hours of reading, browsing the web, watching video, and listening to music",
      "Hands-free with Alexa, including on/off toggle",
      "1 GB of RAM",
      "2 MP front and rear-facing cameras with 720p HD video recording",
      "Dual-band Wi-Fi",
      "90-day limited warranty",
      "Enjoy millions of movies, TV episodes, songs, books, apps, and games"
    ],
    "categories": [
      "Amazon Devices"
    ],
    "price": 49.99,
    "specifications": {}
  }
}