{
  "website_summaries": [
    {
      "verdict": "Remaining the leader for intensive stylus input, the Microsoft Studio 2 seamlessly melds form and function for professional art and design. But it has a few weaknesses that might be deal breakers for people who need a lot of fast storage or more power.",
      "pros": [
        "The Microsoft Surface Studio 2's combination of a huge, color-accurate display with excellent pressure-sensitive stylus responsiveness and tiltable hinge design still leads in its class",
        "And the updated graphics card delivers notably better performance than the older model"
      ],
      "cons": [
        "The new USB-C connection doesn't support Thunderbolt 3 for fast external storage, daisy chaining or an external GPU",
        "It's also stuck in the past (for this class of system) with a quad-core CPU",
        "The otherwise excellent display doesn't support hardware calibration profiles, just the Microsoft factory-calibration profiles, which don't include Adobe RGB"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20181115,
      "rating": 8.5,
      "source": "cnet"
    },
    {
      "verdict": "Microsoft's Surface Studio 2 is a beautiful, pricey all-in-one desktop for artists, content creators, and professionals wedded to pen input. It packs components peppier than the original's, and a downright stunning screen.",
      "pros": [
        "Elegant all-in-one digital creation solution",
        "Snappy performance",
        "Super-thin, spectacular display that reclines",
        "Accurate touch input for art/design work",
        "USB-C support",
        "Bundled Surface Pen"
      ],
      "cons": [
        "Expensive",
        "CPU could be beefier, considering separated base",
        "Video out via USB-C, not a dedicated port"
      ],
      "aspects": {},
      "publication_date": 20181228,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Unbelievable",
      "text": "This is the most awesome computer I have ever owned. I keep my previous Dell All-in-One as a backup but after looking at the screen of this Microsoft Surface, the Dell looks dark and muddy - I can't even look at it anymore. The monitor resolution is absolutely brilliant! And the screen is huge but super wafer thin. Spending almost 5K is a pretty hefty price tag but it's worth every penny - trust me - you won't be disappointed. I've owned and built desktop computers for as long as I can remember and I've never seen anything like this. I've seen state-of-the-art Apple computers and they don't even come close. What else can I say? It's just astounding!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemarie Ferrara",
      "helpful_votes": 28,
      "publication_date": 20190301
    },
    {
      "title": "Horrible for video editing and motion graphics",
      "text": "I did a lot of research before I bought this and only saw positive reviews. I'm a motion graphic designer and video editor and kept hearing how this was a great computer for creatives. It might be an okay computer for illustrators, but DO NOT BUY THIS IF YOU NEED TO EDIT VIDEOS OR CREATE MOTION GRAPHICS. It is soooooo slow and takes forever to render. A project that would normally take me 3 hours on my 2015 MacBook ended up taking 7 hours because of how slow the computer was to preview/render everything. I will never go back to a PC again. I'm returning this computer and opting to just buy another Mac.",
      "rating": 1.0,
      "verified": true,
      "author": "Robbie Kujath",
      "helpful_votes": 25,
      "publication_date": 20190813
    },
    {
      "title": "Screen is huge.",
      "text": "Love the look...the facial recognition and pin features stopped working for some reason and I’ve only had it for 2 days...maybe a software issue. But the facial recognition feature is awesome and excellent for privacy. Screen feels huge and I have to push it far away from me to take the whole screen while working.",
      "rating": 5.0,
      "verified": true,
      "author": "The Therapy Doctor",
      "helpful_votes": 13,
      "publication_date": 20181209
    },
    {
      "title": "An artist's dream",
      "text": "I mean, it's a massive tablet with pen input. what's not to love? I know no one is making a purchasing decision on a Surface Studio based on my review. All the same, two enthusiastic thumbs up from me. I love this thing, you probably will too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmie Malone",
      "helpful_votes": 3,
      "publication_date": 20200112
    },
    {
      "title": "Best device ever made",
      "text": "I know most people are scared away by the price but if you're looking for a seriously amazing device this is it. I use it for everything from Photoshop to gaming to hours of Excel work. Buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "D. M.",
      "helpful_votes": 2,
      "publication_date": 20190803
    },
    {
      "title": "Nope didn't like it at all.",
      "text": "Nope didn't like it, the box looked like it was sent to me directly from a garbage can, it had all sorts of stain and when I tried to use the computer it didn't start at first and then it kept turning off at me.",
      "rating": 1.0,
      "verified": true,
      "author": "Narendra Mohan Gaur",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "WOW I am so happy! Owing this computer changes the way you see life",
      "text": "So beautiful, potent and playful. I love the Windows Hello feature, it turns on right away after searching for you! You can see two or more windows at the same time and boy are they HUGE. I love drawing on it. Also made my first movie really fast with Animotica which is very easy to use. I had No experience with movie making before. The value for the money is 3 because it is SO expensive! LOVE IT, BUY IT",
      "rating": 5.0,
      "verified": true,
      "author": "Analida Sanint",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Although it is very expensive this is a great machine.",
      "text": "I like the all in one features of this computer. It is fast and works well. I do have a problem with the camera however. It automatically adjusts itself and I cannot get a true-color picture. I had to buy another camera to get a better picture for this computer.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary W. Behling",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Easy to use for an old lady.",
      "text": "The surface studio is just what I wanted. It was easy to get started loading pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "AWESOME",
      "text": "received this morning ... OMG i love the touch screen, i think im gonna throw the keyboard on this one ... LOL trust me ..its amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy D.",
      "helpful_votes": 20,
      "publication_date": 20181126
    },
    {
      "title": "Architectural Ingenious!",
      "text": "The design and the smoothness of the transitions is impeccable. Screw apple, this is the way to go.",
      "rating": 5.0,
      "verified": false,
      "author": "Ericka T.",
      "helpful_votes": 42,
      "publication_date": 20181116
    },
    {
      "title": "Incredible machine",
      "text": "Bought one from the Microsoft store. I've been waiting 2 years for the version 2. I don't regret a bit. This machine is outstanding. The screen is simply awesome ... what a pleasure to work with. Expensive but you only live once.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20181201
    },
    {
      "title": "At the windows store",
      "text": "Was at the windows store, and this happened , see picture",
      "rating": 4.0,
      "verified": false,
      "author": "Erik Ramirez",
      "helpful_votes": 3,
      "publication_date": 20190612
    },
    {
      "title": "Extremely loud fan noise",
      "text": "We had this desktop for a year and been suffering it’s extremely loud fan noise for a year. You will not be able to turn off the fan even with no application running. Obviously, it has serious design issues. Update: Microsoft recently fix the fan issue. Now it’s much better!",
      "rating": 4.0,
      "verified": false,
      "author": "Ting Zhao",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Amazing",
      "text": "I bought this for editing my photos. It's like editing the picture in real life. Amazing.",
      "rating": 5.0,
      "verified": false,
      "author": "Jake Sansing",
      "helpful_votes": 0,
      "publication_date": 20190923
    }
  ],
  "product_meta": {
    "title": "Microsoft Surface Studio 2 (Intel Core i7, 32GB RAM, 1TB) - Newest Version",
    "description": "Size:32 GB RAM, 1 TBDive into brilliant color, blazing graphics, and fast processors that fuel your creativity. Ideas flow when you adjust the stunning 28\" display, working upright at your desktop or down low at your drafting table with intuitive tools designed to ignite your imagination. Windows 10 Professional, LCD. Wireless - Wi-Fi - 802.11ac Wi-Fi wireless networking, IEEE 802.11 a/b/g/n compatible ,Bluetooth Wireless 4.1 technology",
    "rating": 4.3,
    "feature_bullets": [
      "Our most powerful Surface yet with Intel Core i7 processors, discrete NVIDIA GeForce GPU, and SSD storage",
      "The strikingly large 28\" PixelSense Display is a stunning touchscreen with 13.5 million pixels of true-to-life color",
      "Tilt the display weightlessly to work at 20 degrees down in Studio Mode or upright in Desktop Mode",
      "Keep creativity flowing when you draw with the improved Surface Pen and use Surface Dial* for intuitive shortcuts",
      "Runs intensive professional-grade software like SolidWorks,* Adobe Creative Cloud,* and Autodesk.*"
    ],
    "specifications": {
      "Standing screen display size": "28 Inches",
      "Max Screen Resolution": "4500x3000 Pixels",
      "Graphics Coprocessor": "NVIDIA GeForce GTX 1070",
      "Card Description": "Dedicated",
      "Graphics Card Ram Size": "1",
      "Wireless Type": "Bluetooth, 802.11a/b/g/n, 802.11ac",
      "Number of USB 3.0 Ports": "5",
      "Brand": "Microsoft",
      "Series": "NAE-LAK-00001",
      "Item model number": "LAK-00001",
      "Hardware Platform": "Unknown",
      "Operating System": "Windows 10 Pro",
      "Item Weight": "20.9 pounds",
      "Product Dimensions": "21.61 x 25.09 x 8.59 inches",
      "Item Dimensions  LxWxH": "21.61 x 25.09 x 8.59 inches",
      "Processor Brand": "Intel",
      "Processor Count": "4",
      "Computer Memory Type": "Unknown",
      "Flash Memory Size": "1000",
      "Hard Drive Interface": "Serial ATA",
      "Hard Drive Rotational Speed": "1",
      "Voltage": "220 Volts",
      "ASIN": "B07HZ8DD5C",
      "Customer Reviews": "4.3 out of 5 stars43 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#21,356 in Computers & Accessories",
      "Date First Available": "October 2, 2018"
    },
    "categories": [
      "All-in-Ones",
      "Computers & Accessories",
      "Electronics",
      "Desktops",
      "Computers & Tablets"
    ],
    "price": 4199.0
  }
}