{
  "website_summaries": [
    {
      "verdict": "Uses a simple ingredient combination to boost energy and promote weight loss.",
      "pros": [
        "Offers a combination of pure turmeric and alpha lipoic acid to help the body metabolize carbs and fats more effectively",
        "Infused with vitamins B and C to help maintain overall health",
        "Includes some caffeine to boost energy"
      ],
      "cons": [
        "Extra caffeine may be too strong for some people, affecting their sleep"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "They Are Effective But Be Careful",
      "text": "These pills are very effective. They will suppress your appetite, almost to a fault. They have a warning on the side to begin taking one capsule until your tolerance increases. I have experience with Hydroxycut's products so I knew what to expect and was able to begin with the suggested dosage. Their effectiveness for me actually made me have to remember when to eat! These pills also decreased my desire (ability?) to eat so be careful. Very effective & I'd recommend them to someone trying to lose weight. **Side Note** - Another side effect was a significant increase in libido! Have fun!",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle Stroud",
      "helpful_votes": 185,
      "publication_date": 20190112
    },
    {
      "title": "Better than the rest",
      "text": "I wanted to make sure I used this to it's full potential before reviewing and I am 100%into it . Taking this and doing keto I am down a total of 47 lbs ! It also helps with energy - at least for me and that's a giant plus. I saw the most weight loss results with this version of hydroxycut products",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Chavez",
      "helpful_votes": 169,
      "publication_date": 20190127
    },
    {
      "title": "Best weight loss supplement I have tried",
      "text": "The Hydroxycut Ultra Lean is working for me better than any other weight loss supplement I have tried. The supplements don’t make me feel jittery nor do they upset my stomach. I take two pills twice a day and am much better able to stick to my diet plan of eating healthy and keeping my food calories down( not easy for me) at a level where I am happy to see some weight loss.",
      "rating": 5.0,
      "verified": true,
      "author": "Vikki Patterson",
      "helpful_votes": 92,
      "publication_date": 20181114
    },
    {
      "title": "So far so good.",
      "text": "While taking this pill alone will not help with losing a lot of weight (need a decent diet and exercise at least), it does help suppress junk food cravings and I found myself having some more energy without the jitters. Easy to follow instructions. No bad after taste after taking.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Drewes ❤ Product Reviewer",
      "helpful_votes": 75,
      "publication_date": 20181128
    },
    {
      "title": "Leaving energetic",
      "text": "I think I’ve tried just about every “new and improved” fat burner out on the market over the years, and I keep coming back to Hydroxycut products. The Hardcore Ultra lean is like taking the best parts of every product out there and combining them into one combination that makes in impossible to fail. The turmeric curcumin and alpha lipoic acid helps keeps you energetic while loosing inches. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Rajni",
      "helpful_votes": 66,
      "publication_date": 20181116
    },
    {
      "title": "No crash, no jitters",
      "text": "I absolutely love the Hydroxycut ultra lean products! It gives me all day energy without the jitters, or a crash leaving me feeling exhausted mid day. I also have felt a change in inflammation from arthritis in my knee, foot, and hip.",
      "rating": 5.0,
      "verified": true,
      "author": "kylie rice",
      "helpful_votes": 62,
      "publication_date": 20181112
    },
    {
      "title": "Natural ingredients",
      "text": "This stuff is amazing keeps me full of energy. And I love all the natural ingredients in this weight loss pill. Truly way better to use if you want to build lean muscles and keep the body toned. Lost an extra 5 pounds right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Karolina4",
      "helpful_votes": 51,
      "publication_date": 20181029
    },
    {
      "title": "Through 1 bottle, Nothing",
      "text": "I was planning to buy a Curcumin supplement and spotted this. Regular Hydroxycut has worked for me in the past. This did nothing after an entire bottle. No results from the Hydroxycut or the Curcumin in this formula.",
      "rating": 1.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 47,
      "publication_date": 20181217
    },
    {
      "title": "A good buy",
      "text": "I have hit a plateau in my weight loss, and while this hasn't dramatically dropped weight off, it has kept me on an even keel. Even with my holiday indulging, I did not gain one ounce! I also like the little boost of energy this gives me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ravenwolf",
      "helpful_votes": 33,
      "publication_date": 20181128
    },
    {
      "title": "Energy and a few lbs down",
      "text": "I got a great boost of energy from these, I did get some jitters day 1 and 2, but it was not anything untolerable, and didnt stop me from going about my day. I did light exercise while taking hydroxycut ultra lean, and where as i didn't notice drastic numbers dropping off the scale however i did loose 7lbs I did notice looser clothing alos which was a much needed ego booster for myself!",
      "rating": 4.0,
      "verified": true,
      "author": "Jodi Hiester",
      "helpful_votes": 31,
      "publication_date": 20181219
    },
    {
      "title": "Doesn't suppress my appetite and doesn't help me lose weight",
      "text": "What more can I say? I ingested pearlescent, cute, easy-to-swallow capsules full of herbs to see what all the fuss was about. I didn't get sick on it, I guess that's the only positive so far. But as far as making weight loss easier and losing my appetite go, it's a great marketing scheme that made me fork over 30 clams for the always broken promise of an easier way to lose weight. There is no easy way. I won't be trying Lipozene, either, even though it's based on science that the konjac root aids in fat loss. Curcumin, konjac root, if these herbs did what the ads claim we'd all be thin and happy couch potatoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly L. Dolce",
      "helpful_votes": 16,
      "publication_date": 20190208
    },
    {
      "title": "Great product!",
      "text": "This product works, I have noticed a big difference in my weight loss but that is also with excercise and a good diet.",
      "rating": 5.0,
      "verified": true,
      "author": "VIVIAN JIMENEZ",
      "helpful_votes": 18,
      "publication_date": 20190523
    },
    {
      "title": "Spartan Beast Prep Supplement",
      "text": "I used this in combination with a low-carb diet and exercise while preparing for a Spartan Beast. It took the place of my normal caffeine supplement in the morning. I was able to keep up during the day and training and successfully competed in my run. Would definitely try again.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Glasgow",
      "helpful_votes": 11,
      "publication_date": 20181216
    },
    {
      "title": "Easy on the stomach",
      "text": "The Hydroxycut Ultra Lean is working for me better than any other weight loss supplement I have tried. The supplements don’t make me feel jittery nor do they upset my stomach. I take two pills twice a day and am much better able to stick to my diet plan of eating healthy and keeping my food calories down",
      "rating": 5.0,
      "verified": true,
      "author": "T.pelton",
      "helpful_votes": 12,
      "publication_date": 20181129
    },
    {
      "title": "I love Ultra Lean",
      "text": "I could feel a real difference with ultra lean. No jitters and easy on the stomach. It helped me lose the extra weight I just couldn't get off on my own. I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea McClanahan",
      "helpful_votes": 8,
      "publication_date": 20181127
    },
    {
      "title": "Works well",
      "text": "I believe it is working well. My clothes feel loser but I don't weigh myself. I am definitely eating less without feeling hungry.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Pocheki",
      "helpful_votes": 9,
      "publication_date": 20190103
    },
    {
      "title": "Great energy booster",
      "text": "Love this product gives me the energy i need to make it through the day easy to swallow with no after taste the only thing i didn't like was the bottle was bigger than it needed to be",
      "rating": 4.0,
      "verified": true,
      "author": "KHutsell",
      "helpful_votes": 7,
      "publication_date": 20181201
    },
    {
      "title": "Awesome Product, Visible Results",
      "text": "It's not often that you try a new product and it works. I love the Hydroxycut products and this one is the best if them all. You definitely will see results if you use this product as directed.",
      "rating": 5.0,
      "verified": true,
      "author": "Freespaceage",
      "helpful_votes": 9,
      "publication_date": 20181126
    },
    {
      "title": "Aids in Weight Loss",
      "text": "I have been using this product for approximately 3 months now. I was used to taking the Hydroxycut Hardcore Elite prior to trying this product. The Ultra Lean provides a decent amount of energy boosts without any jitters. I feel like this product aids slightly in weight loss and helps sustain and manage that lost weight, which is a good thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelley R",
      "helpful_votes": 8,
      "publication_date": 20190219
    },
    {
      "title": "worst product I've ever tried",
      "text": "Not only did this not work at all, I actually gained a couple of pounds on it despite eating a healthy diet and working out every day. I only took them for about a week, and in that time, it caused me to have the worst, most uncomfortable constipation I've ever experienced, and I wasn't able to \"go\" until after I stopped taking these.",
      "rating": 1.0,
      "verified": true,
      "author": "brandy",
      "helpful_votes": 6,
      "publication_date": 20190206
    },
    {
      "title": "Perfect for that cup of coffee buzz without the coffee",
      "text": "As far as weight loss, I took this for 6 weeks while also dieting and saw zero results. The result I did find was a good 3-4 hour caffeine buzz without having to brew a pot of coffee. Came in handy when my coffee maker was out of commission.",
      "rating": 3.0,
      "verified": true,
      "author": "HoganK",
      "helpful_votes": 5,
      "publication_date": 20190308
    },
    {
      "title": "Fantastic product",
      "text": "I am an active young woman, I already weigh around 100-115. I wanted to lean up, and hopefully be able to control my appetite a bit more. I’ve been using these for about a month and they have worked fantastic. I have energy and I find that I do not bloat too much? I’m always thirsty though, maybe because I find that when I drink more water my body has an easier time digesting things, might just be me though! Anyways I really recommend these, and I’ll be using them for a while!",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 2,
      "publication_date": 20200128
    },
    {
      "title": "Excellent product",
      "text": "I had always trust hydroxycut producs , I started using the ultra lean for a month already and couldn't be happier , I always try to take care of myself and exercise and this game me a push of energy I needed before my morning walk I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabora J.",
      "helpful_votes": 8,
      "publication_date": 20181221
    },
    {
      "title": "no jittery feelings, gives a \"natural\" type energy",
      "text": "I especially like the fact that this diet pill is made with tumeric/cuccumin (& other natural ingredients. If you eat food sensibly & follow some type of exercise such as speed walking or treadmill, cut out carbs sensibly you will lose weight or inches. This particular seller on Amazon has a better price than even Walmart.. Thanks!! I have been using this product for about 6 months & will continue to do so until I meet my goals without any particular concerns that it is harmful to do so (as with many of the other OTC diet pills).",
      "rating": 4.0,
      "verified": true,
      "author": "DMC",
      "helpful_votes": 2,
      "publication_date": 20200420
    },
    {
      "title": "Helps with appetite and extra energy",
      "text": "I’ve just started using this product...I started a diet that worked, but the weight loss slowed down a lot so I bought this to help. So far it has made a difference in my energy and helped me feel less hungry throughout the day. I would try it if you are looking for extra energy and help losing weight or eating less.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan G.",
      "helpful_votes": 5,
      "publication_date": 20190528
    },
    {
      "title": "It works.",
      "text": "I took this product for a week and lost 3 lbs. It curbs your appetite and doesn't make you feel shaky or too hyper. I saw results quickly. Will buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry Morgan",
      "helpful_votes": 5,
      "publication_date": 20190119
    },
    {
      "title": "It works",
      "text": "The Hydrocut Ultra Lean helps to keep me full and has definitely aided in my weight loss. I have also noticed increased energy and I love that because I have struggled with that. I would definitely buy this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "JamieBrock",
      "helpful_votes": 4,
      "publication_date": 20181211
    },
    {
      "title": "Shouldn't have purchased this",
      "text": "Not even 10 minutes after taking I got severe heart burn and needed to burp when I finally did I threw the pill up",
      "rating": 1.0,
      "verified": true,
      "author": "maleka stevenson",
      "helpful_votes": 6,
      "publication_date": 20190305
    },
    {
      "title": "Not a fan made me more hungry!",
      "text": "Not a fan of this. I found it helped me with snacking on between meals however I was ravenous at mealtime. Hard to take that 2nd pill. I may have gained weight on this... Moving on...",
      "rating": 2.0,
      "verified": true,
      "author": "Gianna LaBrocca",
      "helpful_votes": 2,
      "publication_date": 20190325
    },
    {
      "title": "Package was already opened when I got it.",
      "text": "So, I have taken these before and they worked great. My biggest problem and the reason I gave it a low rating was because the packaging that all came in was shipped to me tampered with. The plastice was ripped open. I was lucky that the bottle inside was still sealed, but still. The box and plastic was open which could have led to the bottle being contaminated if the package in anyway was compromised. The sellers should check the packaging before shipping it all out.",
      "rating": 2.0,
      "verified": true,
      "author": "Meimei",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Packaging fail",
      "text": "It's too soon to say whether the product works or not, but I have to say this is the worst example of misleading packaging I've seen. They could have helped the environment and cut down on the cost of the product if they made a bottle that actually fits the 60 capsules.",
      "rating": 3.0,
      "verified": true,
      "author": "sharalen",
      "helpful_votes": 2,
      "publication_date": 20190319
    },
    {
      "title": "Healthy weight loss",
      "text": "Has been wonderful in helping me lose the weight I needed",
      "rating": 4.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 4,
      "publication_date": 20181122
    },
    {
      "title": "Don’t waste your money",
      "text": "This didn’t do anything for me. It didn’t curb my appetite, I didn’t lose a pound, and it didn’t give me more energy. I wanted to try this because even though I eat high protein and high fiber diet, I get really bad cravings and feeling of hunger that are distracting. Also as a side note, I have talked to my doctor about this and there is nothing medically to cause the hunger.",
      "rating": 1.0,
      "verified": true,
      "author": "Lo Wilson",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "The caffeine kept me too awake",
      "text": "Has way too much caffeine in it for me and put me on a horrible sleep schedule. I am going to try again when I start waking up again at 5am to see if that makes a difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Stormy ⚡️",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Did not like",
      "text": "I took the pills per the instructions. I did not like that I was always hungry. Even after I ate, I was still hungry. I don't like that feeling so I just stopped taking them. I also gained 5 lbs because I kept eating. LOL. I would not recommend this product unless you only weigh a 100 lbs and want to gain weight.",
      "rating": 1.0,
      "verified": true,
      "author": "Sandra Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Natural ingredients are GREAT",
      "text": "I received this product a month ago and I'll be honest I wasn't too sure about this mix of natural ingredients, but i'm surprised, i feel great!! The curcumin and tumeric helps keeps you energetic while loosing weight, what more can you ask?Of course you need a diet and an exercise plan to have the perfect combination and get great results.",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne Demata",
      "helpful_votes": 3,
      "publication_date": 20190108
    },
    {
      "title": "Did not work for me.",
      "text": "It just did nothing at all for me. I tried it for A month and I could tell no difference in energy or appetite control or anything. It’s like I took nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "ACarter",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Satisfied",
      "text": "Works great actually although my stomach growls alot but its definitely working!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 2,
      "publication_date": 20190324
    },
    {
      "title": "Amazing Energy",
      "text": "I wake up at the butt crack of dawn every morning to teach Chinese kids online. I take one or two of these before I teach. Then I have amazing silly energy to teach with enthusiasm.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Trelfa",
      "helpful_votes": 2,
      "publication_date": 20190316
    },
    {
      "title": "Best ever!",
      "text": "Oh, man! I have so much energy it's insane. I can only take one pill at a time(two pills a day). I'm not new to supplements or caffeine, but these pills work great. I'm not hungry. No cravings. And I've already lost weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Lala",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Creates energy and increase in body heat",
      "text": "I can feel my body heat rise with this product. No jitters or anything like that. I don’t know that they helped with weight loss, but l was happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Rios",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "It’s ok",
      "text": "It’s ok. I feel the energy boost but no difference in my weight",
      "rating": 3.0,
      "verified": true,
      "author": "Jey84",
      "helpful_votes": 4,
      "publication_date": 20181204
    },
    {
      "title": "Waste of money",
      "text": "I have been using this and have not noticed any difference. Even going to the gym. Not worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "JILL",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Power boost",
      "text": "Honestly I really like this product works great I take it in the morning before breakfast and keeps me full and gives me tons of energy.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian C",
      "helpful_votes": 2,
      "publication_date": 20181221
    },
    {
      "title": "Hydroxycut",
      "text": "This is a good product to use with all of the natural ingredients that are in. Does not make your stomach upset after taking it. The pill size is okay .",
      "rating": 4.0,
      "verified": true,
      "author": "Jesica",
      "helpful_votes": 4,
      "publication_date": 20181212
    },
    {
      "title": "gave me energy",
      "text": "this product gave me lots of energy and didn't leave a nasty taste in my stomach/ mouth. I will purchase again. as far as wright loss my apatite was curved but I didn't notice weight loss.",
      "rating": 4.0,
      "verified": true,
      "author": "vickii",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Best weight loss pills!",
      "text": "First product that actually works for me and does not give me jitters!! I was skeptical before trying but pleasantly surprised and very happy with this product. I know products work differently on everyone but for me these are fantastic!!",
      "rating": 5.0,
      "verified": true,
      "author": "NCVOL",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great boost and appetite suppression",
      "text": "I have been using this Ultra Lean for the past month. I like the natural products. I had no jitters. after taste or upset stomach. It helped to suppress my appetite and gave me a boost of energy to increase my daily exercise",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Nowicki",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "No good",
      "text": "I became so sick after on use. Had to sleep it off for like 4 hours to recover.",
      "rating": 1.0,
      "verified": true,
      "author": "AOrtiz",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "no weight change",
      "text": "don't waste your money, just get up and go for a run instead. or buy 200mg caffeine pills for a fraction of the cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane Doe",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Didn't Work",
      "text": "Even with diet and exercise, this didn't work for me. But not all supplements are for everyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelsey Gerhold",
      "helpful_votes": 3,
      "publication_date": 20190415
    },
    {
      "title": "Expected more",
      "text": "I did not lose any weight or notice any difference in my appetite. Didn’t do much of anything",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer S.",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "NO RECOMMEND.",
      "text": "No weight lost, but a definite INCREASE in anxiety, heart palpitations, and confusion in what was happening in my day. NO weight loss worth the sacrifice of sanity and health. NO RECCOMEND.",
      "rating": 1.0,
      "verified": true,
      "author": "Momma",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Didn't Work for Me",
      "text": "Saw no difference in taking these. No weight loss, no extra energy nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kasey D",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Amazing",
      "text": "By far the best product I’ve used. This helped me with weighloss and with my Plateau I was stuck at.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris jess",
      "helpful_votes": 2,
      "publication_date": 20181229
    },
    {
      "title": "Expires too soon - not good",
      "text": "I ordered this product in 2018 and the bottle that was shipped had a Nov 29, 2020 expiration date which was great. I ordered this product again in mid August 2020, but the bottles shipped expire in less than 3 months on Nov 14, 2020. I’m very unhappy. I can only take 1 capsule per day. Very unhappy.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Fat Burner Supplement - Not Weight Loss in a Bottle",
      "text": "I mean, it's not gonna turn you into a supermodel. You still have to eat right and exercise. Good enough boost of energy, decent thermogeneic, helped a little to create a feeling of fullness.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Lindsay",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "It is easy to take",
      "text": "I love it and I've lost weight it's aided me in the gym with the extra energy boost its given me",
      "rating": 5.0,
      "verified": true,
      "author": "Carol ann Knowles",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "DO NOT WASTE YOUR MONEY.",
      "text": "I took as directed with diet & exercise and they did NOTHING! Not one pound lost",
      "rating": 1.0,
      "verified": true,
      "author": "Cassandra Abt",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Still in early stages, but good so far",
      "text": "So far, no difference in jitters or weight loss, but early in usage.",
      "rating": 5.0,
      "verified": true,
      "author": "Baseballmom326",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Not helpful for me",
      "text": "Didn't make any difference to me at all. Wouldn't recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Placebo Effect??",
      "text": "Don't know if it helps or not. Sometimes upsets the stomach pretty badly.",
      "rating": 3.0,
      "verified": true,
      "author": "Penguins",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "First Impression",
      "text": "Product arrived with the plastic already tearing off, and the container was a lot larger than it needed to be (could have saved some plastic there). The pills are the size of what they would be not too large (see photo with quarter comparison). I haven’t tried this product yet but I’m hoping for the best!",
      "rating": 3.0,
      "verified": true,
      "author": "Talia Shepard",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "GREAT PRODUCT FOR THE PRICE!!",
      "text": "I love this! It provides a great boost of energy to my mornings and curbs my hunger. I feel like Hydroxycut put together an affordable product with a high quality formula. Overall, I just feel great on this product and in 2 weeks of use, I can already see a difference in the mirror! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Neki Fernandez",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "I do not recommend these pills for good weight loss results",
      "text": "I followed a Healthy meal plan and exercised 30 minutes a day and I did not see any results After finishing these pills.",
      "rating": 1.0,
      "verified": true,
      "author": "CheyenneIsaac",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great clean energy and appetite control",
      "text": "The energy off this product was exactly what I was looking for. Not too strong but definitely could feel it. Helped control my appetite and already started losing weight! Will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Chaz J",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "I would definitely purchase again.",
      "text": "It really helps with my appetite, I do not get those cravings late at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Didn’t work",
      "text": "Didn’t do anything for me personally, but everyone’s body is different.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Works great",
      "text": "Product does a good job with suppressing my appetite while providing energy to get through the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Rinkenbaugh",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Good stuff",
      "text": "Not sure about weight loss, but this helps give me energy without making me jittery at all. It also curbs my appetite some. Good stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Lake",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great product",
      "text": "Great product definitely makes you less hungry and you feel results fast .",
      "rating": 5.0,
      "verified": true,
      "author": "Kennedy",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Love",
      "text": "I like these, they help suppress your Appetite and gives you energy",
      "rating": 4.0,
      "verified": true,
      "author": "Jaionnie",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Don’t waste your money...",
      "text": "These did nothing for me, but my boyfriend said they gave him an energy boost.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren Elizabeth Bailey",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Why the price jump?!",
      "text": "Works very very well for my husband and myself...but the price of them nearly doubled from 13$ to 24$...thats nuts..",
      "rating": 5.0,
      "verified": true,
      "author": "Missina",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Multi purposed",
      "text": "I work the graveyard shift. Sometimes coffee just doesn’t carry me thru the night, so I pop one of these. It does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan Dorsett",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Maybe works for someone else",
      "text": "I didn't fell anything taking them. With a diet and exercise didn't lose not even one pound.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindyh11",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "I gained weight",
      "text": "I gained weight on this one. I understand that different things work differently for different people. This one did not work for me",
      "rating": 3.0,
      "verified": true,
      "author": "Terie Gray",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Not impressed",
      "text": "Not impressed. The only thing I notice is I have severe stomachache the days I take it. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Not worth it",
      "text": "This product sucks. You will get headaches after the first pill. You’ll get really sick with this pill. I do not recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Save your money!",
      "text": "Do not waste your money, just exercise and eat right",
      "rating": 1.0,
      "verified": true,
      "author": "Running 4 Eva",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Doesn’t Work!",
      "text": "I saw absolutely no results with this product. Do not waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Olivia43",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Weight loss",
      "text": "It helps with weight loss along with exercise and eating healthy",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley Richardson",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Works Well!",
      "text": "Hydroxycut Ultra Lean works well without leaving you feeling jittery or leaving you with your heart racing like some other weight loss products out there. I have been taking it for a couple weeks now and I love it. I have lost 8 pounds so far, which is exciting! I love that it also contains vitamins and other ingredients and isn't just a straight dose of caffeine like other products. I would recommend it to someone who is looking to lose weight the healthy way.",
      "rating": 5.0,
      "verified": true,
      "author": "JessieJ",
      "helpful_votes": 14,
      "publication_date": 20181118
    },
    {
      "title": "Turmeric included which I really like!",
      "text": "I am not sure about this new Hydroxycut product. I haven't noticed any weight loss, but to be fair I've only taken it a couple weeks. Hopefully I will notice a difference by continuing to take it. As far as energy, I haven't felt a boost of energy like I have with other Hydroxycut products. Time will tell on this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa Ayers",
      "helpful_votes": 9,
      "publication_date": 20181203
    },
    {
      "title": "Not my favorite:(",
      "text": "I’ve tried multiple hydroxycut products in the past, and i have to say this is more on the least favorite side. Yes, I did drop around 5 pounds in the first week so it does work. However, I did not feel like it was working. Since I started this version of Hydroxycut, I’ve been bloating really bad and it does not make me feel good for my own self-image. Would be willing to give it a second shot though.",
      "rating": 4.0,
      "verified": true,
      "author": "paigee",
      "helpful_votes": 5,
      "publication_date": 20181222
    },
    {
      "title": "Didn’t work for me",
      "text": "I’ve had success in the past with hydroxycut products but ended up experiencing hair loss so I stopped using it. I can across this one that has natural ingredients so I decided to give it a try. I’ve taken the entire bottle and did not lose any weight. I actually gained weight. Did not have any extra energy or notice a decrease in appetite. Just didn’t work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephania",
      "helpful_votes": 3,
      "publication_date": 20190127
    },
    {
      "title": "Amazing Product",
      "text": "I started taking this a month ago and I feel great, I have noticed more energy and the inches are coming off. Best I have tried in a long time, no jittery feeling or crash and burning",
      "rating": 5.0,
      "verified": true,
      "author": "aj",
      "helpful_votes": 4,
      "publication_date": 20181108
    },
    {
      "title": "Wonderful Product!",
      "text": "This product helped me achieve great results! My favorite part was the slow build of energy I got after taking it instead of a burst of energy that would make me jittery. I also loved the fact that it contains a compound found naturally in our own bodies to turn sugar into energy! Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Ringbauer",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "Best Hydroxycut in my opnion",
      "text": "I have taken all different kinds of Hydroxycut through the years. This one is my favorite. It does not make me jittery as most other do. I recently started taking a prescription medication that increased my appetite and needed something to curb that. These definitely do. I am not hungry. I take one first thing in the morning, and one at 11am. I have to almost force myself to eat, as nothing even sounds good. And I'm not constantly snacking in between meals like before. I don't see the need to take more than one at a time, as that is doing the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi Mills",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Works if if you put in some efforts",
      "text": "It works but ... Let's be honest, this is not magic pills that will slim you down without putting in any efforts. I lost 2 lbs in a week, but I don't solely rely on this product. I increase my physical activities by 30 mins, and I cut down my calories intake by 300-500 every day. In addition to that, I also drink lots of water and consume high fiber foods. It is a combination of aspect.",
      "rating": 4.0,
      "verified": true,
      "author": "Belle",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Got my hopes up",
      "text": "Was looking forward to this one of the Hydroxycut line.. but wanted to leave an honest review. I have used them many times and have been my go-to brand. And figured I'd give this one a shot.. Sad to say, didn't work much for me at all. Didn't feel awake, didn't suppress appetite, just felt like I wasn't taking anything at all. Sad, but I think I will have to step away from Hydroxycut. Used to be my favorite, only reason for 2 stars, but no so much anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "One a day, or less = perfect!",
      "text": "Though the package says to take two, I find that one daily or just on days I really need help to focus or curb my appetite, really works! No jitters or weird side effects either. I dislike taking products like this that have a bunch of ingredients, but this seems \"safer\" than similar products. Lasts me a long while because I don't take every single day. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Interesting AF",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "These limit cravings",
      "text": "I don't know if they are helping yet. I've not hopped on a scale. I'm using my size in clothing to guage. I'll write a new review if I have good news to add.",
      "rating": 4.0,
      "verified": true,
      "author": "Averil",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Amazing fat 🔥 burner",
      "text": "\" Amazing fat burner! I noticed after three days of using this product that my hunger cravings became significantly minimal. This product gave me good energy which lasted throughout the day with no crash. I have noticed that after two weeks, I have started to lose inches. However this was a supplement to my regular diet and exercise. I would recommend this product to anyone looking to lean that is unable to get over the hump of weight loss.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Copeland",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Pills are large",
      "text": "They didn’t work for me. I’ve used hydroxycut before in the red box. So I figured I tried this one. The appetite was still there. It was like taking a vitamin. May be it’ll work for someone else.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxy Lucas",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Mild, light energy boost",
      "text": "I didn’t feel like I noticed much change with this product. I didn’t lose weight. I may have had slightly more energy. The positive part is I didn’t get jitters or nausea like I have with stronger products. Could be good if you are looking for a slight energy boost in your day.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "No appetite suppression...",
      "text": "Do not waste your money, just but the hardcore or max. This ultra lean is gimmicky and marketed to women I took this for a full week with no changes. No appetite suppression, no extra energy nothing. Mine as well have eaten a sugar cube",
      "rating": 1.0,
      "verified": true,
      "author": "wife,mom,zookeeper",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Love This Product!",
      "text": "I love this product because it doesn't leave me feeling jittery, like a lot of weight loss products do. I also feel like I have more energy, which is always a plus! Would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Evans",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Works awesome",
      "text": "More energy, suppresses appetite in 2 days I have lost 2 lbs",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Shay",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Not for me",
      "text": "Worked the first two days then nothing. That’s what I thought.",
      "rating": 1.0,
      "verified": true,
      "author": "cupcake",
      "helpful_votes": 0,
      "publication_date": 20190217
    }
  ],
  "product_meta": {
    "title": "Hydroxycut Ultra Lean Healthy Weight Loss, Turmeric Curcumin & Alpha Lipoic Acid Supplement, Energy & Metabolism Booster, 60 Pills",
    "description": "Hydroxycut Ultra Lean features an effective ingredient blend called CurcumaSlim, the combination of two ingredients: pure turmeric/curcumin that provides 95% curcuminoids and alpha lipoic acid (ALA), a compound found naturally in the body that helps turn glucose into energy. This scientifically researched weight loss combination, when combined with diet and exercise, supports your healthy weight loss plan. But, the benefits don’t stop there. Every serving of Ultra Lean delivers a powerful metabolism boost from naturally sourced caffeine. Formulated with the antioxidant vitamin C and B vitamins, this supplement is also designed to help to metabolize carbs, proteins and fats.\n\nUNIQUE, SCIENCE BASED INGREDIENT FOR WEIGHT LOSS: CURCUMASLIM\nThe Hydroxycut research and development team have developed this unique, synergistic ingredient combination for weight loss, protected by two U.S. patents: Patent No. US 9,040,576 B1 and No. US 9,770,434 B2. In two 16-week studies, subjects using the key ingredient combination (alpha lipoic acid and curcumin) lost an average of 12.56 lbs. vs. 6.12 lbs. for placebo and 4.84 lbs. vs. 0.87 lbs. for placebo, respectively. All subjects followed a calorie-reduced diet and walking programs.\n\nEFFECTIVE WEIGHT LOSS\nHydroxycut Ultra Lean brings together two key ingredients — pure turmeric/curcumin that provides 95% curcuminoids and alpha lipoic acid (ALA) in an effective, scientifically researched weight loss combination.\n\nNATURALLY SOURCED ENERGY\nNaturally sourced coffee extract is included to provide a clean source of energy, plus a powerful metabolism boost.\n\nDIRECTIONS FOR USE\nTo assess individual tolerance, for the first two days, start with one (1) capsule, taken with a glass of water two (2) times daily, approximately 30 minutes before breakfast and lunch. For days three and beyond, take two (2) capsules twice daily, approximately 30 minutes before breakfast and lunch.",
    "rating": 3.6,
    "feature_bullets": [
      "INNOVATIVE WEIGHT LOSS INGREDIENT COMBINATION- Curcumin is found in turmeric, a traditional spice that’s been used for centuries. The turmeric in Hydroxycut Ultra Lean features turmeric extract standardized to deliver 95% curcuminoids. ALA is a compound that helps turn glucose into energy.",
      "WEIGHT LOSS BACKED BY SCIENCE- Two scientific studies were conducted on CurcumaSlim (the combination of curcumin and ALA) and this research indicates it’s an effective, synergistic weight loss blend",
      "BOOST METABOLISM- A powerful metabolism boost from Green Coffee Bean Extract, a natural source of energy.",
      "IMPORTANT VITAMINS TO SUPPORT OVERALL HEALTH- Formulated with the antioxidant vitamin C and B vitamins, that help with the metabolism of carbs, proteins and fats.",
      "TESTED FOR QUALITY AND PURITY - Fully disclosed ingredients that undergo strict quality control, and is third-party tested and verified to ensure that each bottle meets the highest standards of purity, quality and consistency"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.75 x 2.75 x 5.66 inches; 4.06 Ounces",
      "Item model number": "P35246",
      "Date First Available": "September 7, 2018",
      "Manufacturer": "Iovate Health Sciences Incorporated",
      "ASIN": "B07H5WLZHD",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Vitamins & Dietary Supplements",
      "Supplements",
      "Weight Loss",
      "Health & Household",
      "Fat Burners",
      "Health, Household & Baby Care"
    ],
    "price": 13.54
  }
}