{
  "website_summaries": [
    {
      "verdict": "A powerful, middle-of-the-road model that's large enough for cooks who frequently use a food processor.",
      "pros": [
        "Mid-sized model offers 9-cup work bowl that's suitable for avid cooks",
        "Has a versatile 2-in-1 feed tube",
        "Comes with a set of blades and cutting discs for numerous meal-prep needs",
        "Leak-resistant ring",
        "Simple to twist apart for cleaning"
      ],
      "cons": [
        "Some longevity concerns, as a few food processors quit working unexpectedly with normal use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Garbage",
      "text": "Motor burnt up on the 3rd use. Warranty issues cannot be dealt with by email. Based on the email response I received from their customer service, you must call their support and hang on hold for the next available representative. This company is no longer the same Kitchenaid that made the venerable stand mixer your mother used for 40 years with no issues. This company makes cheap foreign made appliances made of mostly plastic and underspec'd motors. Don't let the price fool you. You are buying expensive junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 32,
      "publication_date": 20190924
    },
    {
      "title": "Don’t waste your money on this food processor",
      "text": "I liked this food processor when I got it but after making only six single pie crusts it stopped working. That’s a lot of money for a product that only worked for 2 weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "Alicia G.",
      "helpful_votes": 21,
      "publication_date": 20190423
    },
    {
      "title": "Pretty Disappointed",
      "text": "Bought this on Dec 2nd for my wife for Christmas and she loved it. It is now March 9th and while she was shredding some cheese this morning it just quit, dead, finished. Guess I should have paid the extra for the insurance because the return deadline was January 31st.",
      "rating": 1.0,
      "verified": true,
      "author": "mike burke",
      "helpful_votes": 19,
      "publication_date": 20190309
    },
    {
      "title": "Not hardy enough",
      "text": "I will be sending this product back. The Shute is very narrow meaning I would have to really cut things small. From what I could find the watts are very low. I was excited to find this but it will not be good for what I need. But a great concept!",
      "rating": 4.0,
      "verified": true,
      "author": "D Fortner",
      "helpful_votes": 11,
      "publication_date": 20181227
    },
    {
      "title": "Well designed multiple functions.",
      "text": "Like the variety of blades. It is a lot of parts to keep on the counter when operating the processor and washing requires much space.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Schmidt",
      "helpful_votes": 7,
      "publication_date": 20190221
    },
    {
      "title": "KitchenAid 9 Cup Food Processor, Silver",
      "text": "LOVE all of my KitchenAid products that I have purchased. This one has two extra blades, stored inside the processor, and it works wonderful for chopping up vegetables for soups.",
      "rating": 5.0,
      "verified": true,
      "author": "Greyhound Gal",
      "helpful_votes": 7,
      "publication_date": 20190115
    },
    {
      "title": "Freak'n Awesome",
      "text": "Love, love, love this new version. Used it over the holidays and it made my holiday baking a snap. I really like how everything fits in one place. The attachment selection is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader - Bear",
      "helpful_votes": 3,
      "publication_date": 20190129
    },
    {
      "title": "Broke after grind cheese--3 months now not working",
      "text": "It was disappointing. Only used a few times and it broke--no longer working. $190 poor buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan C.",
      "helpful_votes": 5,
      "publication_date": 20190505
    },
    {
      "title": "Easy to assemble, disassemble, and clean. Love it",
      "text": "I don’t use it as much as i thought i would but i really like it and cleanup is so easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 5,
      "publication_date": 20181231
    },
    {
      "title": "Full service food processor.",
      "text": "We have never owned a food processor, but we got this after watching cooks use them to make pastry dough. it makes a very light pie dough.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Well worth the investment.",
      "text": "Got this for hubby, I can no longer chop veggies. Cannot stand on my feet long, so he helps me cook. He chops to thick. He loves his new tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi w",
      "helpful_votes": 2,
      "publication_date": 20190226
    },
    {
      "title": "Missing details in the product describtion",
      "text": "This product is not for the European market! It runs on 110Volt",
      "rating": 1.0,
      "verified": true,
      "author": "Joost",
      "helpful_votes": 3,
      "publication_date": 20190106
    },
    {
      "title": "most efficent",
      "text": "I am a Mexican food lover and find this appliance very helpful in prep.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "Not the best",
      "text": "It does not chop fast. Can not put all the ingredients at once. It takes forever to chop/grind. I gave it a couple of tries and I really really don’t like it at all. I wish I can return it but the window of return passed. I bought it in May 14. Used it a month later.",
      "rating": 1.0,
      "verified": true,
      "author": "Aurelie ",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great product!",
      "text": "I love my new food processor. It does everything I need it to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel Lopez",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Arrived in time for Christmas",
      "text": "I am so thankful for the quick arrival of this machine and am looking forward to putting it to work. The colour matches my KitchenAid mixer :)",
      "rating": 5.0,
      "verified": true,
      "author": "Parent with grown children",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Fabulous!",
      "text": "Love this! So easy to store and use. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Revised review",
      "text": "I liked this machine at first. But after less than a year, it has crashed in the course of a very light task -- making breadcrumbs from bread cubes. It's a waste of money. It also doesn't do a good job. I used it for pureeing cooked apples for applesauce and cooked tomatoes for pizza sauce. No matter how long I ran the machine, the texture wasn't smooth. More like apple or tomato vomit.",
      "rating": 1.0,
      "verified": true,
      "author": "Anne L. Watson",
      "helpful_votes": 6,
      "publication_date": 20181230
    },
    {
      "title": "Great for multiple uses but not reversible for lefties",
      "text": "This can do everything you'd expect, and the blades stack neatly inside, decreasing storage space. The lid lifts of with one hand, so that's nice, but the lefties out there must, again, use the wrong hand for everything. Seems it would have been easy to allow this carafe to cradle in the opposite direction, helping lefties use their dominant hand for lifting, but that option doesn't exist in this model.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly M.",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Newly thought-out design for food processors",
      "text": "It's very nice. A different locking mechanism (much easier to use). All the accessories are stored inside the food processor, so they're much less likely to be misplaced and lost. And I think it works really well – of course, I'm just comparing it to our old processor, which wasn't one of the high-end food processors with the standard design.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter W. Shor",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Versatile",
      "text": "I love that it has various thickness cuts for both slices and for grating. I love that it stores in itself. What a machines!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Jay Blaylock",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Best of Food Processors!",
      "text": "What makes this food processor especially good is its cohesiveness, by that I mean everything is stored in the device. No separate bag to keep its chopping parts, and its lid is hinged, which means I don't have to place it on the counter or somewhere else to search for it later. I actually bought this item from Williams Sonoma online, which was considerably cheaper than anywhere else, including Amazon.",
      "rating": 5.0,
      "verified": false,
      "author": "Erol Esen",
      "helpful_votes": 73,
      "publication_date": 20181108
    },
    {
      "title": "No replacement parts available",
      "text": "Lid on my Kitchenaid food processor chipped on the cover's safety tab which must engage perfectly with the bowl to operate. I called Kitchensaid to order a replacement cover and was told they no longer make that part. I searched everywhere on line with no luck. Dont buy Kitchenaid if you need replacement parts after 10 years.",
      "rating": 1.0,
      "verified": false,
      "author": "Barbaloo",
      "helpful_votes": 46,
      "publication_date": 20181112
    },
    {
      "title": "Not very powerful; stopped working after 18 months",
      "text": "2 stars for the smaller footprint and the space saving design of storing blades inside unit. I soon realized this model was quite a bit smaller than my previous 11 cup food processor. It also doesn't have much power, it felt like it was struggling to get through simple jobs. Then, after 18 months of owning, and very minimal use, it stopped working a few seconds into shredding cheese. Completely dead, no lights, no sounds, nothing. Looking at reviews, it looks like many have had this issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Colo mom",
      "helpful_votes": 0,
      "publication_date": 20201116
    },
    {
      "title": "Kitchenaid food processors are not dependable.",
      "text": "What we liked about this food processor was the bowl and blade design and storage. What we didn't like is that the first unit we received stopped working during the warranty period. Kitchenaid replaced that iterm. NOW the replacement unit has quit working too. VERY BAD MOTOR AND ELECTRONIC CONTROL DESIGN.....VERY VERY VERY BAD.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201102
    },
    {
      "title": "Worthless",
      "text": "This thing is not worth the counter space. Garbage. Used mine maybe 4 times and it is dead. Completely dead. I have no idea how it would have handled bread dough or pie crust because hummus killed it.",
      "rating": 1.0,
      "verified": true,
      "author": "susan",
      "helpful_votes": 0,
      "publication_date": 20201213
    },
    {
      "title": "Motor Burned out in less than 1 year",
      "text": "This worked great in the beginning, and then started getting noisy. Today the motor burned out. Why didn't I get a Cuisinart???",
      "rating": 2.0,
      "verified": true,
      "author": "Dave K",
      "helpful_votes": 0,
      "publication_date": 20201117
    },
    {
      "title": "Plastic is brittle and breaks easily",
      "text": "I dropped this on my tile kitchen floor. I expected it to bounce, like my Cuisinart. Instead, the plastic shattered. Avoid at all costs. Mine was out of warranty. And why would I replace the bowl since it breaks this easily?",
      "rating": 1.0,
      "verified": false,
      "author": "K. Kimb",
      "helpful_votes": 20,
      "publication_date": 20181127
    },
    {
      "title": "Extremely Underpowered",
      "text": "This could have been so great. But unfortunately Kitchenaid did not make this powerful enough. I burnt up 2 units making a simple brownie batter. First time I thought I had a defective unit but the second one burnt up also. I loved everything about it except the lack of power. I should have listened to the reviewer that said it had no more power than a mini chopper. Boy were they right. I love all my other Kitchenaid appliances but the just completely missed the bar in this one. Just another cheaply made in China piece of junk.",
      "rating": 1.0,
      "verified": false,
      "author": "REG",
      "helpful_votes": 7,
      "publication_date": 20190526
    },
    {
      "title": "Missing 2 Pieces",
      "text": "First used it for potatoes and an onion to make latkes. Then shredded celery on another day. Food gets stuck above the discs when you’re shredding. It says so on the instructions so I was expecting it to happen. Not a great thing, but it’s still easier than shredding food with a grater. It also wobbles when it’s on High. It was missing the dough hook and the thin disk. We bought it because it had so many attachments, but those two were not there.",
      "rating": 3.0,
      "verified": false,
      "author": "Rook",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "All manufacturers have very different warranty policies",
      "text": "Our KitchenAid food processor worked great until it stopped working. But, this is the very important part of this review. KitchenAid customer service is FANTASTIC. They sent us a new replacement food processor at no cost to us. Prior to this we purchased a Cuisinartfood processor, after six months it stopped working. READ THIS CAREFULLY: To receive warranty service from Cuisinart I had to ship my, very heavy, food processor to them at my cost!!!!",
      "rating": 5.0,
      "verified": false,
      "author": "The Sequoyah Guy",
      "helpful_votes": 3,
      "publication_date": 20190731
    },
    {
      "title": "Well designed, durable components",
      "text": "I grew up with cheaper Cuisinart food processors, and my family went through a few of them. Upon setting this KitchenAid model up, I was quite impressed with the quality of the materials and the design. Parts which are subjected to lots of torque and vibrations are nice and chunky and solid. Blades are well made and sharp. I'm quite pleased with this model, and expect it will hold up to years of use.",
      "rating": 5.0,
      "verified": false,
      "author": "Andrew D. Lossing",
      "helpful_votes": 3,
      "publication_date": 20181216
    },
    {
      "title": "Sturdy and Versatile",
      "text": "This KitchenAid KFP0919BM 9 Cup Food Processor Plus has everything I need for my family food processing and it does the job very well. It has all the attachments I need and the set up is easy and simple. It's also easy and intuitive to operate. The material and construction appear to be strong and sturdy. I recommend it!",
      "rating": 5.0,
      "verified": false,
      "author": "Mat633",
      "helpful_votes": 2,
      "publication_date": 20190601
    }
  ],
  "product_meta": {
    "title": "KitchenAid KFP0919BM 9 Cup Food Processor Plus, Black Matte",
    "description": "Color:Black MatteEasy to Use, Clean and Store. This 9 Cup Food Processor features an innovative design, with a one-click, twist-free bowl assembly and latched lid that is easy to use & clean. Simple Controls with 3 Speed Options - High, Low and Pulse Speeds to handle a variety of ingredients with precision. The easy-press paddles and illuminated LED controls make operation simple. Chop, Puree, Knead, Mix Shred and Slice - Everything from cucumbers to tomatoes, cheeses and more with the simplicity of two discs and one blade. The blade and disc fit inside the bowl to make storage easy.",
    "rating": 4.1,
    "feature_bullets": [
      "Simple Controls with 3 Speed Options - High, Low and Pulse",
      "Chop, Puree, Knead, Mix Shred and Slice",
      "A Variety of Shapes and Sizes - Can be processed in the 2-in-1 feed tube located on the lid. The small pusher features a small oil drizzle opening for emulsifying sauces and dressings.",
      "The easy-press paddles and illuminated LED controls make operation simple.",
      "Includes: (1) 9 cup work bowl, (1) Lid, (1) Multi-purpose blade, (1) Reversible medium slicing/shredding disc, (1) Thick slicing disc"
    ],
    "specifications": {
      "Product Dimensions": "7.9 x 9.7 x 16.8 inches",
      "Item Weight": "9.13 pounds",
      "Manufacturer": "KitchenAid",
      "ASIN": "B07HBHHQ56",
      "Item model number": "KFP0919BM",
      "Customer Reviews": "4.1 out of 5 stars95 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#59,495 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 13, 2018"
    },
    "categories": [
      "Home & Kitchen",
      "Food Processors",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": 179.99
  }
}