{
  "website_summaries": [
    {
      "verdict": "A solid secondary valve that's adequate in the short term, but may not be reliable enough for serious divers.",
      "pros": [
        "Good design",
        "Lightweight and compact, not as bulky as others on the market",
        "Long hose and swivel end allows convenient use from right or left side"
      ],
      "cons": [
        "Does require some added force to breathe through",
        "May start to flood and make noises while in use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I like to occasionally use my alternate for a few minutes ...",
      "text": "I like to occasionally use my alternate for a few minutes while diving to make sure that it works. After less than 20 dives with this thing, it started flooding a bit while breathing making weird noises. Yes, it works, but your alternate air source is for an emergency and having a partially flooded reg could add to the stress/ panic of the out of air diver. Also not the easiest thing to breathe from, does require some force. I wouldn't recommend this to any serious diver.",
      "rating": 3.0,
      "verified": true,
      "author": "Metalhead",
      "helpful_votes": 9,
      "publication_date": 20151001
    },
    {
      "title": "This is good gear. It punches the ticket for an octo",
      "text": "This is good gear. It punches the ticket for an octo, and should do its job, just fine. (It does have a tendency to try to free flow with age, and use... but we all know how to fix that, or( we all damn well should.) I am only giving the 4 stars, because of price... I think it's a little high, for no more than what it does... however... If it has to be used for its intended purpose?... then it worth it's weight in gold. I would, and will buy again, and I would reccomend to a friend who asked. most likely..",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Great for price",
      "text": "The Mares MV Octopus Diving Regulator is exactly as described and works great for it's purpose. It did free flow in my octo clip on my check-out dive, so I just rearranged my clips to place mouthpiece down and was no longer an issue. I bought this for our recent dive trip to Fiji and it worked great - I checked it multiple times during our week stay with 16 total dives going from my reg to alternate. Overall, I love this product and how compact it is. I would definitely recommend and buy again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Not reliable. Leaks air. waste of money",
      "text": "I went diving with this Regulator once. 2nd dive I went to do it was leaking air. had to cancel my dive :(. spend a little more. Mares is crap!",
      "rating": 1.0,
      "verified": true,
      "author": "BARBARA",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great Octo at a great price",
      "text": "Great Octo at a great price, breathes as easy as it should and doesn't free flow on the surface. Economical price, works as expected and long hose makes it great to be able to hand off as a spare. It breathes a little wet, but as a Octo it does everything I would want it to",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Borkland",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "This is pretty much a Dacor regulator",
      "text": "This is pretty much a Dacor regulator. It breathes a lot like my old Dacor Viper. I like it a lot. Sometimes use my Octo instead of my regulator... :)",
      "rating": 5.0,
      "verified": true,
      "author": "Decker",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Good quality and reliable",
      "text": "Reliable and robust. I depend on Mares regulators. This is an easy breathing alternative (secondary) regulator. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JRTLLOYD",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Flimsy valve cover falls off easily",
      "text": "Got two of these for family use. The cap on the exhale valve on both units fell off after the first dive, leaving the valve exposed. Can't get a hold of mares customer service for this matter.",
      "rating": 2.0,
      "verified": true,
      "author": "By the Seller",
      "helpful_votes": 3,
      "publication_date": 20150423
    },
    {
      "title": "Small, light, and works just like it should",
      "text": "Just as it is described. What else would you want? The unit is surpassingly light but does everything you need it to do. Did not jam, or free-flow, even though it was exposed to lots of fine and course sand in the surf during many days of diving in Hawaii.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark S. Lee",
      "helpful_votes": 4,
      "publication_date": 20140626
    },
    {
      "title": "Great Product",
      "text": "Great octo with a much lower profile than the usual round octo's which makes it less bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "TRis",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "very happy with this product & its price",
      "text": "Works flawlessly, very happy with this product & its price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Excellent Octo",
      "text": "Just bought this a second time, this one for my daughter. Highly recommended for its quality and performance.",
      "rating": 5.0,
      "verified": true,
      "author": "John Quigley",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Manual has many languages except ENGLISH!",
      "text": "The quality is excellent but the manual has every language under the sun except english, this is very upsetting",
      "rating": 3.0,
      "verified": true,
      "author": "Lee Johnson",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Great octo",
      "text": "Great for an octo breaths a little wet but great backup",
      "rating": 4.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "Five Stars",
      "text": "Bought this for my girlfriend and she is very happy with the light weight and compact design",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos Alonso",
      "helpful_votes": 2,
      "publication_date": 20140924
    },
    {
      "title": "Great Octo",
      "text": "Love this for the same reasons as the Viper 12S--it's small, light, breathes easily. I am very satisfied with this Octopus.",
      "rating": 5.0,
      "verified": true,
      "author": "RH McElroy",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "Perfect octopus to be able to use for yourself AND ...",
      "text": "Perfect octopus to be able to use for yourself AND by somebody in front of you without twisting it. Just rotate it : AWESOME !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Five Stars",
      "text": "This item works great. Other than the fact that it is octopus, it is a great item.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Iaciofano",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "he was very happy to be breathing",
      "text": "This guy is okay. It breathes when you need it, and that's all that really matters. My dive buddy needed it on my second dive with it, he was very happy to be breathing. On the con side, it bubbles a bit in certain positions. So, you can't just clip it anywhere. The bung that comes with it is a nice idea, but I found it coming loose a few times on my first dive. All and all, I am happy with my purchase. Good price, works as described.",
      "rating": 4.0,
      "verified": true,
      "author": "Todd Campbell",
      "helpful_votes": 0,
      "publication_date": 20150516
    },
    {
      "title": "Perfect. Exactly what i hoped for",
      "text": "Perfect. Exactly what i hoped for. Shipped fast and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve W.",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Excellent Octo",
      "text": "My wife has made two dives with it. She loves it. There have been no free flow problems that some others have reported. A great Octo for any level of recreational diver.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Cooper",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "Broke quickly after 2 dives",
      "text": "Bought this and it broke after 2 uses I have contacted the seller and am waiting to hear back. I will update ASAP",
      "rating": 1.0,
      "verified": true,
      "author": "ktrjcool",
      "helpful_votes": 7,
      "publication_date": 20170410
    },
    {
      "title": "Mares MV Octopus",
      "text": "Fortunately I haven't had to use this yet but I have tried it. It comes with a nice long hose and with the swivel end can be used by your buddy from either left or right very conveniently. Seems like it will be great.",
      "rating": 5.0,
      "verified": true,
      "author": "BH",
      "helpful_votes": 2,
      "publication_date": 20121022
    },
    {
      "title": "terrible.",
      "text": "All you need for an octupus. Do not buy their primary regulator in the design though..terrible.",
      "rating": 4.0,
      "verified": true,
      "author": "Porra Louca",
      "helpful_votes": 0,
      "publication_date": 20150209
    }
  ],
  "product_meta": {
    "title": "Mares MV Octopus Diving Regulator",
    "rating": 3.9,
    "feature_bullets": [
      "Lightweight with a minimalist compact design",
      "Ambidextrous design for ease of use",
      "Reliable 2nd stage downstream demand valve",
      "Durable with superior resistance to abrasion",
      "Low pressure center area for easy breathing"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 2, 2018",
      "Manufacturer": "Mares",
      "ASIN": "B07H1YQBRY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Diving & Snorkeling",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Regulator Accessories",
      "Water Sports"
    ],
    "price": 119.95
  }
}