{
  "website_summaries": [
    {
      "verdict": "A natural option that smooths and primes hair for quick blow drying.",
      "pros": [
        "This gentle spray is nutrient-rich and free of parabens",
        "It detangles while also protecting all hair types from the effects of daily blow-drying",
        "Customers love how it smells"
      ],
      "cons": [
        "Although it can be used on dry hair, it tends to work best on wet hair only"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "You will pay nearly $30 for a half full spray bottle.",
      "text": "Listen to the reviews. Product arrives leaking. You will pay nearly $30 for a half full spray bottle.",
      "rating": 1.0,
      "verified": true,
      "author": "Ostara",
      "helpful_votes": 18,
      "publication_date": 20190219
    },
    {
      "title": "Great stuff crap",
      "text": "Product is great. Works amazing does what it claims and more. One problem is the bottle. It broke the very first time I attempted to use it. Had to pour into another bottle just to use it. Second problem is price point. For the amount you get plus a crap bottle it leaves more to be desired.",
      "rating": 3.0,
      "verified": true,
      "author": "Sumar",
      "helpful_votes": 10,
      "publication_date": 20190721
    },
    {
      "title": "Love....just wish it came in a bigger bottle.",
      "text": "Pros: 1- The smell is delish 2- It really does detangle like a dream 3- Works as a great leave in conditioner treatment Cons 1- Do not really feel like it is a big enough bottle to last for longer than a couple of weeks if I were to use this after every shower 2- Expensive for the size of bottle",
      "rating": 5.0,
      "verified": true,
      "author": "Ray-Ray",
      "helpful_votes": 10,
      "publication_date": 20190325
    },
    {
      "title": "WOW!",
      "text": "I am in love with this detangling primer. I have fine, thin long hair that tends to get dried out and tangled up very easy. My stylist introduced me to this product and I am so happy she did. The smell is divine and it leaves a beautiful shine to my hair and makes it look so healthy. It only takes just a tiny amount for me and I have hair down my back. I’m excited to try their other products.",
      "rating": 5.0,
      "verified": true,
      "author": "BK",
      "helpful_votes": 8,
      "publication_date": 20190703
    },
    {
      "title": "Smells sooooo good",
      "text": "This product smells true to the “Amika” scent so you know your hair is going to smell fabulous. Also made my byalage treated hair really soft and helped with frizz / dryness. I try not to wash my hair often because I have well water and it turns my blonde brassy, despite using purple everything on my hair, so use dry shampoo and was able to restyle easily with a few spritzes of this in my hair. You can over do this product to the point where you may find it a little greasy so definitely use it sparingly. Luckily that’s really all you need. Definitely recommend if you are wanting to splurge a little.",
      "rating": 5.0,
      "verified": true,
      "author": "GaPeach",
      "helpful_votes": 6,
      "publication_date": 20190322
    },
    {
      "title": "Anika Wizard Detangling Primer",
      "text": "I was looking for a spray on hair conditioner for my fine, and color treated hair. So many conditioners flatten my hair style. Used after shampooing, this spray on product utilizes a fine oil mist that does help to de tangle hair. It leaves my hair feeling soft. A little goes a long way, to avoid a flat hair style. I have discovered that I have better control of the amount applied to my hair by spraying it into the palm of my hand and gently applying it to my hair with my fingers. It may work differently for hair with more body. Worth a try.",
      "rating": 4.0,
      "verified": true,
      "author": "Oregonian",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Fabulous Product but Bad SprayBottle",
      "text": "Love this product but bottle is a bit useless. It leaks and wastes so much of the product which ends up being very expensive after most of the product is wasted by leakage and inefficient distribution. Suggest you transfer to better pump and spray bottle, and NEVER pack this bottle in a suitcase and attempt to travel with it. On my third bottle due to leaks which is frustrating given the price. Would suggest they sell it in a regular “refill screw top bottle” which would be better value for money. And we can use our own choice of pump spray. It would also be more eco friendly",
      "rating": 5.0,
      "verified": true,
      "author": "clawless",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Over powering smell",
      "text": "Pro's. - it did help Detangle my hair which was my primary reason for purchase. Cons- smells like cheap perfume and I could hardly fall asleep because the aroma lingered. The next day I noticed that my hair felt extremely dry which is unusual for me. I wI'll not use it again. About my hair, I have long hair and its coarse. Maybe having coarse hair is why the smell lingered or made my hair feel really dry.",
      "rating": 2.0,
      "verified": true,
      "author": "bella",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "LOVE the wizard! but...",
      "text": "The bottle/lid has issues. This arrives leaking EVERY time. This stuff is too expensive to be \"okay\" with whatever portion makes it to your door still in the bottle. There bottles, all three leaked. The second one I returned because it was over half empty. Sure does make the mail smell GREAT though! It also demonstrates this is not oily at all.. while the cardboard box is wet, by the next day it had dried and this left no oily spot on the box.. (yes, a weird way to prove it!)",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "My favorite! Best spray ever!",
      "text": "This is my favorite hair spray! It was recommended to me by my hairdresser and it’s the best product I’ve ever bought! I use it for everything! I spray this in my hair before and after straightening and curling my hair. I spray to get knots out. And I spray just because I love the way it makes my hair smell! I’ve gifted it to family and friends and everyone always loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Fake product",
      "text": "Fake product I loved this product, when I got it from Sephora or from my stylist. It’s one of the best detangling sprays on the market, and does magic for coarse stiff thick hair that in need of shine, defrizz and manageability. It smells divine. You won’t need a perfume. Unfortunately when I ordered same product from Amazon, it smelled different in unpleasant way and did not have even close effects on my hair. I am very disappointed. I paid same price as in Sephora.",
      "rating": 1.0,
      "verified": true,
      "author": "Alina Kuznyak",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "My daily go too",
      "text": "I use this product daily on damp hair prior to blow drying. It doesn't take much...a little goes a long way. I spray each side and the back with a lite mist. Spraying to much can give you the \"oily hair\" look. This product adds just the right amount of shine while protecting my hair from heat caused during blow drying and straightening.",
      "rating": 5.0,
      "verified": true,
      "author": "cassie m.",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Smells nice, and cuts down on drying time.",
      "text": "I've tried a few quick drying sprays and this one actually seems to work. It has cut down my drying time by maybe half. I normally spray some on my hand then spread through my hair. The texture after spraying feels like a silky liquid, so it seems like it's good for coating my hair to protect it from damage too. I have to say I am really enjoying the amika products. They smell really nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "E.M.",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Lid wasn't secure and spilled all over the box..",
      "text": "I would have loved to try the detangling primer, but when it arrived it had spilled in the box and only about a teaspoon was left in the bottle. Please make sure the bottle stop is firmly closed!",
      "rating": 1.0,
      "verified": true,
      "author": "Eyaf",
      "helpful_votes": 5,
      "publication_date": 20190908
    },
    {
      "title": "Cuts blow drying time in half!",
      "text": "I love this spray!! It made my hair soooooo soft and silky. It does not make your hair greasy like some products I have tried. I put it in after a shower and with minutes of spraying it on my hair it is already drying. This product is great and I highly recommend it to anyone who is like me and wants to cut down dry time in the morning",
      "rating": 5.0,
      "verified": true,
      "author": "KIM",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Made my hair healthier  and easy to brush",
      "text": "I used to get the worse tangles in my hair after my shower and would hurt my scalp trying to brush. This has helped so much with the tangles and lowered the time it takes to dry my hair! The only downsize is the bottle is small, wish they had a larger size. I have bought 3 of these bottles in the past 5 months and will continue to use this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica E. Stevens",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Wanna Smell?!?",
      "text": "It was love at first use! My stylist used this in my hair once and after that I HAD to have it! The smell is amazing! I love it so much that I have people smell my hair! I have multiple different shampoos and conditioners this is only one of the lovely shampoo and conditioners that I have. I alternate them, I can see how it might make your hair greasy to use daily... works wonder to through in.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "This is amazing",
      "text": "My hair dresser used this on my hair and I had to have it. The smell is AMAZING! I also love that it makes hair feel soft. It doesn't provide any grease look to your hair. I use this when my hair is wet and then I will use it once during the day just for the smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Leeannssi",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Usually perfect",
      "text": "I love the product however the top of bottle was ont screwed on tightly on all 3 bottles and leaked all through boxing and sealed plastic. First time this happened. I had to unseal the plastic to return with a closed top. I have yet to get product reshipped. Not sure why.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Rochon",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Solid product",
      "text": "I really love the way my hair feels and smells after using this. The effect it has on dry time is also a huge plus! If I could change one thing, I'd just want more product for the money. That said, I haven't found another product that replaces this, and I don't use it every day (though it is really nice for taming hair in winter), so I will be sticking with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Terrible terrible terrible",
      "text": "I’ve purchased this product many times in the past and I am so disappointed this time. It usually has a pleasant smell and makes me hair soft. The smell this time is so bad, I actually get a stomachache because it smells so bad. I’m so upset. I’ve had to re-wash my hair before work and have no product. I fair this has probably been watered down or something. I also had trouble combing through my hair so the formula has changed. Definitely seems like a scam this time.",
      "rating": 5.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "smells divine",
      "text": "The scent of this product is heavenly! It's hard not to overdo it with this, simply because of the smell alone. Careful though, hair will be greasy if you spray too much. I've got long, fine hair and 3-4 sprays seems to be the magic number. My only complaint is that I wish this wasn't so expensive. One bottle lasts me about two months. But I continue to buy it and would recommend it due to the detangling and heat protectant properties.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin Maher",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Would not recommend",
      "text": "Smell not great. Provana pomade and BioSilk smell fantastic and It’s A 10 Leave in conditioner spray is much better quality.",
      "rating": 2.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Worth the price for smooth soft hair",
      "text": "I'm not a beauty product enthusiast and I'm generally pretty cheap but this product has me sold. It's worth the extra money. My hair is smooth and silky. I tried using something else when I ran out and then I went back.",
      "rating": 5.0,
      "verified": true,
      "author": "KmmTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Love it But...",
      "text": "Great product but WAY to expensive for the amount of product you get. I do 2 MAYBE 3 splashes each time because I use it so sparingly. Thinking about mixing with water in order to stretch it more but you get NOTHING for about $25.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Miller",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "The best leave in conditioner you will ever buy!",
      "text": "This is nothing short of amazing. I have tried so many leave in conditioners (name brand and generic) and NOTHING works this good. It gets through tangles with absolute ease. This is the only leave in conditioner I will ever buy from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "This is a Game Changer!!",
      "text": "This is, hands down, the greatest detangler out there. I’ve used so many other products, but none compare to how silky smooth and tangle/free this makes my hair. I spray a little in, and I’m able to effortlessly brush my hair. I recently started using it in my daughter’s hair which is super curly and unruly, and it has changed our lives! No more crying over tangles! I absolutely LOVE this product!",
      "rating": 5.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Scent was too strong",
      "text": "It was suggested by my stylist to purchase this for detangling knots. The product has such an incredibly strong smell that it made my eyes run. I have used other Amika products that had a heavy fragrance but this was too much. It had a chemical smell to it. The product also did not work as indicated on the bottle. I would up having more success with organic coconut oil. Needless to say, back it went.",
      "rating": 1.0,
      "verified": true,
      "author": "jms",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Favorite hair product!",
      "text": "This is my go to hair product that keeps my frizzy hair sleek and smooth. I have bleached blonde hair and have difficulty with tangles and frizz at the ends of my hair. I use this product after I shower when my hair is damp. I absolutely love the smell and my husband tells me all the time that I smell great.",
      "rating": 5.0,
      "verified": true,
      "author": "Tender Tale",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "love this stuff !!",
      "text": "I am subscribed to this product because i love it so much. It doesnt leave your hair greasy or feeling heavy. Its light weight and it provides the protection from heat damage. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah H.",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Misrepresentation of quantity",
      "text": "This was advertised as a 6.25 oz bottle and it’s onky 4oz. That’s a really big difference in a small bottle that cost $25.00",
      "rating": 1.0,
      "verified": true,
      "author": "Mary C.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Love",
      "text": "Percent smell! And I use it a bit differently, I I will use it to de tangle but also at day three of not washing my hair I spray alittle into my hair at night! Just to freshen up and soften!",
      "rating": 5.0,
      "verified": true,
      "author": "Irmi ",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "BAD !!! Damaged !!!",
      "text": "I ordered this before and it was fine. Second time i ordered THE BOTTLE WAS EMPTY !! It was perfectly wrapped but light as a feather ! I want a refund !!",
      "rating": 1.0,
      "verified": true,
      "author": "Nicoleh Pino",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Smells good!",
      "text": "Honestly it smells good, but it is a very light light mist which makes it hard to get into hair with it. Plus it makes my hands feel all greasy. Tbh, it did not really help with detangling at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Grant Gorley",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "This Wizard works magic!",
      "text": "I have thick, coarse, wavy hair that is also frizzy (from frequent highlights). This product works wonders. The smell is very nice, but way too strong. Because of this, i mix it with UNITE Leave-In conditioner, which is also pretty effective and smells wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine E. Miannay",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Nice detangler, but very strong.",
      "text": "This was my first time using Amika's detangler. It works well and I love the scent, but it can be a bit overpowering and I have to turn on the overhead fan in my bathroom. I think it's a good compromise though, since I really do like using this product despite how strong the smell can be.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Leaked in transit.",
      "text": "Works okay but arrived in package and was leaking. It was all wrapped in plastic but still had leaked enough to stain the box.",
      "rating": 3.0,
      "verified": true,
      "author": "Susan F. Moran",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Best Overall Product",
      "text": "I absolutely LOVE this product. It cam recommended by my stylist, and now I refuse to dry or style my hair without it. I have thick , coarse, curly hair and have to be careful with heat and damage and the detangling primer definitely helps with protection as well as smoothing! The smell is also amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "CPARKER",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Worth it!",
      "text": "Amazing product for smoothing out the hair! It smells very nice, almost like a perfume, but fades throughout the day so the smell isn’t overpowering. However, use this spray sparingly since it can look oily if used in excess on certain areas of the hair. Overall, it is worth the price in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariana Zamora",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Fragrance too strong",
      "text": "Fragrance was one of the top ingredients and it was supposed to be less than 1%.",
      "rating": 2.0,
      "verified": true,
      "author": "RBK",
      "helpful_votes": 2,
      "publication_date": 20190321
    },
    {
      "title": "Smells awesome",
      "text": "My hair dresser used this on my hair on my last visit. I went home wishing I had purchase it in the salon from her, I was happy to have found it on amazon! I love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "logan",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Actually detangles",
      "text": "This product is awesome - the only detangler I have used that actually works to help with tangles/knots. I have naturally oily hair and it doesn’t leave any oily residue.",
      "rating": 5.0,
      "verified": true,
      "author": "greenbeank",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Amazing scent great product",
      "text": "I absolutely love Amika products and this is my favorite detangler/ heat primer for my hair. The scent is addictive and amazing. I will continue buying this in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Extremely small for the high price",
      "text": "Extremely small for the high price. Was surprised to see that the bottle itself is less than 5 inches tall and an inch and a half in circumference. Very small for $25",
      "rating": 2.0,
      "verified": true,
      "author": "-=LmS=-",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Does NOT work!",
      "text": "I love my Amika shampoo and conditioner, so I thought I'd try this detangler out because my hair is like a rats nest after I shower. It smells good, and it went on evenly, BUT it did NOTHING for my tangles. I was so disappointed! When I finally got the knots out, I dried it with my hair dryer and I will say, it dried quick. But I bought it for my tangles and it just didn't work. Definitely sending it back. Plus its such a small bottle for $25!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "the smell THE SMELL",
      "text": "The smell is AMAZING and makes me want to buy all the products for that alone, but the detangling aspect of this product and the shine it adds to my hair makes it one of the best products out there!",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "It works!",
      "text": "I was pleasantly surprised that this product works as advertised! My hair tends to get tangled a lot and a little of this and it’s no longer a problem. Definitely worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah M.",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Love this Product",
      "text": "My hair tends to get frizzy in humid weather. I apply this to my hair (mid to end), and then use my Revlon Brush Blow Dryer to dry....Presto - No Frizz and its very soft to the touch.",
      "rating": 5.0,
      "verified": true,
      "author": "mom2-3boys",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Wonderful Fragrance!",
      "text": "I love the way this product smells and it leaves my hair smooth and shiny. I wish it was a bit less expensive so I try to use it sparingly, but I really do feel a difference when compared to drug store products.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "The scent is so amazing",
      "text": "I was a little iffy on buying from Amazon because I thought it would be a knock off but it actually was not , I will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Ang Salaz",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Better than expected",
      "text": "Smells amazing, deep floral scent. That’s not the best part. Using only on half my hair with half a spritz it added immense shine and softness vs other half. I couldn’t wait to use it after the shower so it did make my hair a little greasy at first but then disappeared and added tons of volume. Worth the money and I’m a cheap buyer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "great detangler",
      "text": "not a leave in conditioner but a spray detangler. Got that confused when I first bought but it works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Bunnell",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "This stuff is magic!",
      "text": "I like...no, I. Love. This. Product. I wish it was cheaper and sold in bigger quantities. I use this everyday and I feel like I breeze right through the bottle every month and half to two months...that gets expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Bridget",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Smells nice",
      "text": "I don’t feel like this helps my hair dry any faster but I do like using for the scent and the detangling.",
      "rating": 4.0,
      "verified": true,
      "author": "kayla",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "It smooths and straightens !!",
      "text": "California humidity and naturally curly hair were both making my bad hair days too numerous. This product is totally wonderful and helps me get the smooth, wavy and kinky free look I want!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolynn Davis",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Works",
      "text": "Like the product. It does work. I think it’s a little too costly for the amount you get",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Amazing Hair!",
      "text": "Absolutely love this stuff!! My hair looks and feels amazing! Just light spray and blow dry!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Definitely lives up to its name!!!",
      "text": "The nozzle for the product is cheap and could have been better produced, but everything else about the product inside, even down to the heavenly scent, is magical!",
      "rating": 5.0,
      "verified": true,
      "author": "MADemoiselleHatter102917",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Magic in a bottle and smells AMAZING!",
      "text": "I go through this like crazy. Not only does it leave hair soft, shiny and frizz-free but smelling great.",
      "rating": 5.0,
      "verified": true,
      "author": "Nela",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Best product ever",
      "text": "Love this spray. It does not have a scent, or not one that I notice, which I like. Detangles extremely well. Best product I have found. Great for after the beach or getting out of water.",
      "rating": 5.0,
      "verified": true,
      "author": "nicole",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Works well and Smells good",
      "text": "Love this product definitely needed with extensions. Smells so good as well just avoid your root area",
      "rating": 5.0,
      "verified": true,
      "author": "nikki",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "BEST DETANGLER!",
      "text": "Smells amazing, and helps detangle my THICK hair! Plus it seems like it helps my hair dry faster! Would definitely recommend this stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Maegan Crow",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Works Great Smells Wonderful",
      "text": "My husband loves the smell of this in my hair. Not too heavy. Does a nice job.",
      "rating": 5.0,
      "verified": true,
      "author": "abswheeler",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Amika products are great",
      "text": "I absolutely love this product! The smell is amazing and it definitely helps dry my hair quicker then usual",
      "rating": 5.0,
      "verified": true,
      "author": "JennyRG",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Smell is great",
      "text": "This product does nothing for me but smells so amazing",
      "rating": 3.0,
      "verified": true,
      "author": "Bonita",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Love it",
      "text": "This stuff is amazing. It makes your hair super soft to work with, and smells good too!",
      "rating": 5.0,
      "verified": true,
      "author": "SOPHIA530",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great product.",
      "text": "Love it. Wish it was a little more reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "PRog",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Perfect detangling spray",
      "text": "Recommended by my stylist. I have long hair and this product not only is a perfect detangling spray, the fragrance is fsbulous. It doesnt take much. Woukd highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia Tudisco",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great detangler",
      "text": "I really like the smell plus it's a great detangler not greasy and goes a long wat.",
      "rating": 5.0,
      "verified": true,
      "author": "LORI LEIGHTON",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Use it daily",
      "text": "Love love love the way it makes my hair feel and shine",
      "rating": 5.0,
      "verified": true,
      "author": "Dottie P.",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Go-to Product",
      "text": "My go-to hair product. I have thin blond hair and this doesn't weigh it down, but leaves it looking healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonMLK",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Shiny, healthy protection against heat, very lightweight:)",
      "text": "Excellent help with color and heat. Wonderful smell. Shiny hair. Very disappointing shipping via post office with slightly mashed bottle and wasted product in plastic bag :(",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer Rita",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Works as advertised, I love this stuff.",
      "text": "I love all the products I have used from this product line. Works as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeru",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Great detangler & smell",
      "text": "Absolutely love this product. My hair is very long & thick I spray this in my hair after washing and brushing it out is a breeze. It smells great. Forever I used kenra products but this detangler leave in heat protectant is everything I need in one bottle. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikkie Arellano",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Return issue",
      "text": "I got an email saying that I am going to get charge for a replacement....but I didn't get one. Who can help me with this?",
      "rating": 1.0,
      "verified": true,
      "author": "Rosa Vargas-Paniagua",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Annoyed",
      "text": "Haven’t been able to use it yet cause the sprayer doesn’t work. Disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie Gollop",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "You will like this product and adore the smell",
      "text": "Products are the way to go for your hair to look this nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Trammell",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Poor packaging",
      "text": "This is an amazing product. Amazing did a horrible job with packaging. Spray bottle delivered empty. Box soaked in detangle liquid. Ruined other items in box .",
      "rating": 4.0,
      "verified": true,
      "author": "Jess & Ryan Hanna",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great product, really works",
      "text": "Great product. Couldn't find it in stores, and I realized it could be on amazon. Smells a tad funny due to the coconut but not bad.",
      "rating": 4.0,
      "verified": true,
      "author": "K Less",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "I love the smell!",
      "text": "Amazing smell and does not leave my hair greasy! My hair is super dry and frizzy, I think it moisturizes my hair and make it less frizzy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Love it",
      "text": "I have 9 inch long hair and this has saved me from a lot of pain and time brushing my hair And it smells so good",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Barnhill",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Smells good, not a good detangle spray",
      "text": "This does not detangle as well as other brands. Smells great but definitely not as good as it's a 10 or pureology 21.",
      "rating": 2.0,
      "verified": true,
      "author": "tara",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Must have for long hair(:",
      "text": "Love. Makes the hair super soft. New favorite hair product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lee-Anderson",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "The bottle arrived totally empty!!",
      "text": "The product arrived totally empty. The cap was not on completely, so it could have leaked out but everything was dry. Can’t believe I paid so much for an empty bottle.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Heavenly smell",
      "text": "I purchased this at a salon the first time and have been hooked ever since. Heavenly smell and makes your hair super soft and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Best Ever!!",
      "text": "Best detangler ever!! My daughter and I both have fine, thin hair and this stuff does the trick! A little goes a LONG way!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet D",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Must have!!!",
      "text": "Best detangler ever!!!! My daughter and I are obsessed with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "DFT1029",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Smells great!!",
      "text": "Smells great!! Makes my fine hair feel oily and mild heavy.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly Wickersham",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great detangler!",
      "text": "For the size of the bottle it latest a lot longer than expected. A little goes a long way! Works wonders detangling my hair and leaves it feeling very soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Collins",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Works great smells fantastic!!!",
      "text": "Found this jewel a few months ago, my hair is thankful.. definitely a happy customer!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jelenia Crenshaw",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Amika",
      "text": "Great for super dry hair and for when you get out of the shower. Smells amazing as well",
      "rating": 5.0,
      "verified": true,
      "author": "lindsay",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great product!",
      "text": "Love the smell! Detangles my hair and keeps it soft and smooth",
      "rating": 5.0,
      "verified": true,
      "author": "AER",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Empty bottle",
      "text": "Just received my package today and when I opened it half the bottle was spelt out! Very disappointed! They need to come up with a new method to package it!",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Harper",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Best hair product I have ever used.",
      "text": "It’s kind of expensive, but I’m worth it. I love what it does for my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie V",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Mini sized.",
      "text": "Just got this and haven't tried it yet but it could be the best in the world and I would still give it a 1 star because it is so small for too much money. Feel suckered by buying this. Could almost be put in hotel rooms.",
      "rating": 1.0,
      "verified": true,
      "author": "mr. fantastico",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Sleek straight hair in high humidity!!",
      "text": "This product is a life changer! I live in Florida and the frizz is unstoppable...until now!!!! Smells so anazing and leaves my long naturally wavy hair straight, shiny and frizz free!!!!!!!! FINALLY!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "It works! It really works!",
      "text": "Where has this been my entire life! I have blonde kinky curly hair, hurts to come out tangles, and then I found this! WOW! LIFE CHANGER!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Salsa",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "My favorite hair product",
      "text": "This is a great detangle and really helps my hair to dry quickly. I have long fine hair - this doesn't weigh it down one bit and smells lovely.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen G",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Need To Change Packaging",
      "text": "I have no problem with the product and have purchased it before. However, this time the bottles had been sealed so tightly they had sprayed into the packaging. The bottom of the box was damp with the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Pamela P.",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Ehh...",
      "text": "I have used other products that are cheaper that work better.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh T.",
      "helpful_votes": 0,
      "publication_date": 20190726
    }
  ],
  "product_meta": {
    "title": "amika The Wizard Detangling Primer, 4 Fl Oz",
    "description": "amika Wizard Detangling Primer will not only cut down on blow dry time, but will protect against thermal damage, detangle, nourish, smooth, soften, and add shine. Key Ingredients: Sea buckthorn berry is rich in vitamin C and A, antioxidants and healthy omega fatty acids, including the essential omega-7. Avocado Oil provides nourishment and smoothing from protein, vitamin A, D, E, B6, amino acids, folic acid and minerals. Provitamin B5 promotes and restores hair’s resilience, protects against breakage, reduces split ends, smooths and strengthens. Free of MIT/MCI, formaldehydes, formaldehyde-releasing agents, retinyl palmitate, oxybenzone, coal tar, hydroquinone, triclosan, triclocarban, aluminum, talc, sulfates, parabens, phthalates, gluten, mineral oil, sodium chloride, petrochemicals and artificial colors. Has less than one percent synthetic fragrances. Vegetarian-friendly and cruelty-free. Safe for color-treated, Brazilian-treated and keratin-treated hair. Ingredients are Cyclopentasiloxane, Hippophae Rhamnoides (Sea Buckthorn/Argousier) Seed Oil, Fragrance/Parfum, Persea Gratissima (Avocado/Avocat) Oil, Tocopheryl Acetate, Butylphenyl Methylpropional, Limonene, Hydroxycitronellal, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Citronellol, Coumarin, Geraniol\n\nBRAND STORY\namika was founded by industry OUTSIDERS in Williamsburg, Brooklyn in 2007 and is the antithesis of a typical beauty brand. Instead of purveying unattainable perfection we believe in a totally individual version of beauty.",
    "rating": 4.6,
    "specifications": {
      "Product Dimensions": "12.69 x 9 x 8.38 inches; 4.8 Ounces",
      "Item model number": "AM50.13857",
      "UPC": "815151025556",
      "Manufacturer": "amika",
      "ASIN": "B07H38WX77",
      "Amazon Best Sellers Rank": "#24,510 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Detanglers",
      "Hair Care",
      "Styling Products",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}