{
  "website_summaries": [
    {
      "verdict": "Uses a steel construction in the frame poles that encourages stability, while delivering protection from the sun.",
      "pros": [
        "Frame's six legs consist of heavy duty, powder-coated steel that provides stability and resists rust",
        "Polyethylene fabric in the canopy will block harmful rays of the sun",
        "Large enough to provide protection for a vehicle or to provide shade for those at an outdoor gathering"
      ],
      "cons": [
        "Canopy may not hold up well to high winds and may rip in stormy conditions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome",
      "text": "This last week i've had over 50-60 mph winds with the most rain ever. This canopy has out performed any other canopy by far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 32,
      "publication_date": 20190215
    },
    {
      "title": "Fairly easy to put together",
      "text": "Just received this today and assembled it. The instructions are not real helpful Imosa just have to look at the picture and figure it out yourself but it’s not hard and I think we’re going to really enjoy our shelter. We just had a 30 x 14‘ concrete back porch poured at our house and after looking at them other options we decided to just put this on the porch as shade from the sun. It’s a whole lot cheaper than an installed aluminum awning which costs over $6000 in our area And I completely assembled this all by myself. We believe it is going to suit us just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Funksway",
      "helpful_votes": 22,
      "publication_date": 20190627
    },
    {
      "title": "Great Canopy",
      "text": "I get very high winds with rain at my home, as I live on a hillside, and needed a cover for my dog kennels. The assembly was easy and I anchored the canopy legs to concrete. AWESOME! I highly recommend this canopy for durability, price and easy assembly!",
      "rating": 4.0,
      "verified": true,
      "author": "Kristen v.",
      "helpful_votes": 27,
      "publication_date": 20190325
    },
    {
      "title": "Not good in the sun or wind!",
      "text": "We live in Arizona and with the sun and breezes here, the tarps lasted for 3 months. If you do buy this product, make sure to wrap the peak frame with something that will lessen the friction. This will be the area where the tears start to happen. Also, the fabric DOES NOT hold up to uv rays at all. I can take a piece of the canopy fabric and tear it just as easily as you would tear a piece of printer paper. You want to either stay with metal or find canopy fabric made of nylon, if the canopy is in the sun.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy Walker",
      "helpful_votes": 10,
      "publication_date": 20191018
    },
    {
      "title": "A new wrinkle and even worse quality",
      "text": "Within 4 months EVERY one of the bungee attachment cords stretched out completely leaving the canopy sagging. The first night of strong winds the cords all snapped and the canopy blew into the street and into traffic",
      "rating": 1.0,
      "verified": true,
      "author": "Dbdata",
      "helpful_votes": 6,
      "publication_date": 20190822
    },
    {
      "title": "Good frame but included tarp is not opaque enough",
      "text": "This canopy has a decent frame and is pretty quick to setup. However, the included tarp is partially see through and surprisingly allows a fair amount of sunlight to get to what you are trying to protect. You can feel the heat standing under it and the hood and exposed surfaces of my car are getting hot. It seems to block about 75% of the light and UV but I was hoping for much more. Most tarps I have had in the past are 100% opaque. Since it is so thin it will probably only last one summer.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "This item was packed very well",
      "text": "I like everything about this canopy as I am using it as a carport cover. It was easy to install and works well so far. I would recommend this canopy to anyone. I had one previously , but I like this much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert D.",
      "helpful_votes": 5,
      "publication_date": 20190406
    },
    {
      "title": "Oddly outstanding, but useless hold down stakes, purchase pigtail dog holders for each pole.",
      "text": "I purchased this canopy for my back yard wedding. It worked extremely well and made the wedding look very professional for the price I paid which I think was under $200. I now have it in my driveway using it as a carport and again it looks great, I have the steel not white poles. I have had a similar design fly into the neighbors yard with high winds therefore this time I purchased the large pigtail style dog stakes to hold it in place. The hold down stakes which come with the canopy are useless, buy the large pigtail dogs takes and it will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Grunthaner",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Incredible customer service!!!",
      "text": "While putting up the tent with my wife and daughter, I noticed that one of the poles was misshapen. I contacted the company and within a few days we had a replacement pole. A few months after that, a tropical storm blew through our town with very powerful winds and the whole tent got lifted and thrown across the yard, bending two of the poles. Once again, I emailed the company and within four days there were two replacement poles at our front door. Customer service aside, the tent is a great addition to our backyard deck as it provides us with a large shady space to spend time outside...which we have been doing a lot during the pandemic.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Adam",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Absolutley horrible!",
      "text": "Let me start off by stating that this is NOT A HEAVY DUTY CARPORT. I bought the carport to cover my tractor implements and riding mower. It is absolutely terrible. The frame is no thicker than a soup can. When I opened the box several of the poles were bent. Some the poles wouldn't even connect male to female ends. The tarp that goes over the top is about 6 inches to short. Do yourself a favor and order from a different manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Held up well in 3 days of heavy rain",
      "text": "Good for the price. Seems sturdy and was easy to assemble. The only reason i give it a 4 instead of a 5 is that one of the eyelets for roof was crushed and another was too close to the edge and i suspect it will be the first to fail in the wind. They would probably replace it if i contacted them but i just don't have time to mess with it. Had heavy rain right after i installed it and there was no pooling of water which makes me happy.",
      "rating": 4.0,
      "verified": true,
      "author": "SEAN HILLMAN",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Updated  \"$200 lost not recommended\"",
      "text": "Update: After leaving this feedback the seller contacted me and apologized about what happened and offered the full refund or replacement of the canopy . Very pleased with the solution. Thank you Bought this canopy to get a nice shadow or rain protection and it worked pretty good until the rubber Ball Bungee started to rip and breaking down and I contacted the seller but no response until today to make it worse a few days ago the whole tarp flew away ripping part of the structure too. I would really like to obtain my Refund. (only lasted 4 months )",
      "rating": 4.0,
      "verified": true,
      "author": "Mario H.",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Good product, but...",
      "text": "Had my doubts I’d be keeping it because of the condition of the box when it arrived. Multiple holes in the box due to damage, due to free moving parts in box. But... after doing a parts check, thankfully nothing was missing. I did find a couple of the arms had mild dents due to improper packaging. Assembled quickly with no issues. Was a more durable alternative to one of the quick pop-up shelter, and the price was in line with similar canapys. I would recommend this product for purchase, and would ask the manufacturer to consider strapping the poles togyin the box to avoid them being free moving.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Beware:  tarp will fray from wind and sunlight within a year and a half :(",
      "text": "1. I had to sink the six poles into concrete buckets in order to stabilize the port during wind storms. 2. The tarp ended up tearing and fraying a little over a year from installation. Most of the tearing happened at the grommet points. The fraying from sunlight happened in the middle ;( 3. I'm in the process of trying to purchase another tarp from the company (without the poles). I'll revise this review when/if that happens. 4. \"You get what you pay for.\"",
      "rating": 2.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great Product at a Good Price!",
      "text": "Easy to assemble, sturdy (with the legs in concrete) and lots of shade for the money! I anchored the legs in concrete, burying them about two feet down with 80 lbs. of concrete per leg. This thing is not going anywhere! The cable supports for the roof cross members really add strength. I live in Arizona and will probably need to replace the tarp every year or so due to the intense sunshine / UV rays. Still, for the money, this is a great, low cost option if you want to keep the sun and rain off your stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Worth every penny and held up to high wind gusts!",
      "text": "I have had this for about a year now and I have to admit, I am amazed! I used 12” nails to secure it, but it has been extremely sturdy, yet flexible during winds up to 60 mph gusts at times. I am using it as a temporary carport until I get a more permanent structure under the trees. I now have more time to get that structure, because this has done so well. I was a bit skeptical when I bought it, but no complaints now. I got my money’s worth and it is still doing a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "gadgetguy",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Quite impressed",
      "text": "Well worth the money. While this is the first time I've had anything similar, I think the fabric and metal frame were of good quality. I had this up for about 3 months intending to use it to park my boat under in the middle of summer in Florida. The covering held up fine. The tie-downs holding the fabric to the frame did not hold up so well. I expect they will all fail within 6 months so I'd advise you invest in some plastic tie-straps to hold the fabric to the aluminum frame.",
      "rating": 5.0,
      "verified": true,
      "author": "CLEVE",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Nice design but some of  the hardware is cheap",
      "text": "The tarp is good, the poles look fairly std, the tarp ties are not weathering well after less then 2 months, the cables are rusting in the sleeving, and I replaced the pot metal turn buckles during the first week with SS versions.",
      "rating": 3.0,
      "verified": true,
      "author": "mrp",
      "helpful_votes": 2,
      "publication_date": 20190906
    },
    {
      "title": "Tarp isn't big enough",
      "text": "Maybe it was just me and because I got it when it was cooler out, but the tarp needs about 3 inches in either direction. I'm hoping slowly adding the fasteners will stretch it out... but right now, there's about a 3 or 4 inch gap on two ends of the frame. Other than that, super easy to build, even by yourself. Seems fairly sturdy, although it sways a bit. I've literally only set it up, so I will update if anything significant changes, especially with the winter coming.",
      "rating": 4.0,
      "verified": true,
      "author": "James White",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Exactly what I wanted!",
      "text": "I love this canopy. Easy enough to assemble and used it to shade my back patio. I had the canopy almost 3 months and there was a bad storm, 50 mph winds (not common in this area). Anchored with a couple cinder blocks but it blew my canopy into the trees. Bent the connection points of 6 poles. I was impressed that there was no other damage! I contacted customer service and got a speedy reply. Milka was polite and professional. I was sent replacement poles at no charge. Thank you Quictent and thank you Milka.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Andrew",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Good Value.  Needs Better Tie Downs",
      "text": "This portable carport/sunblock is a good value for the price. The only drawbacks were the \"bit-too-small\" cable stays and holds. The holds came free and needed to be torqued to almost the point of the bolts starting to strip their threads. Also, the nylon line for the srew-in the-ground hold-downs is not nearly strong enough for the job, especially if you want to protect against any wind. You will need to augment their approach to beef things up. But, with those issues solved, I am pleased.",
      "rating": 4.0,
      "verified": true,
      "author": "Viewer",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Make sure to get the sand bags",
      "text": "This is a great tent and it's pretty difficult to go wrong with a tent. I ended up buying this tent over its competitors because of the fabulous customer support reviews. I haven't had to contact CS yet but it's good to know they are there if you need them. One thing to note is that I highly recommend purchasing the sand bags that can velcro to the poles. This will greatly increase the tent's stability. I would almost consider it a must buy, even with the included tie-downs.",
      "rating": 5.0,
      "verified": true,
      "author": "Usernamesarefun",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "BE AWARE !!!",
      "text": "This is how it looks after 3 month use! Very disappointed !!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "PCC",
      "helpful_votes": 5,
      "publication_date": 20190820
    },
    {
      "title": "Customer service and durability.",
      "text": "BUY FEOM THIS SELLER. I love the ease of putting up my canopy. Just follow easy instructions. The best is quick to respond and helful customer service. Ineeded a replaced tarp and they quickly sent me a new one. A year later I needed new bungee balls and they replaced them quickly. I have 2 one is the carport type and the other is a patio type and love both.",
      "rating": 5.0,
      "verified": true,
      "author": "RN",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Works great",
      "text": "A fairly simple and easy setup. I would not say that the materials were new there were some dents and scuff marks on the poles but not too bad. It's simplistic in design and has been getting compliments on it by neighbors and friends. Serves its purpose and now to see how long it will hold up but so far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Mint",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Good company to order from",
      "text": "The bungee cords that came with the tent dry rotted after about three months. So I ordered some heavy duty ones to replace them hopefully they will last longer. But so far the tarp and the frame are holding up good. I also ordered some extra heavy duty steaks for the ground because the ones that came with it were not very sturdy either. UPDATE The company sent me some extra bungee cords and some heavy duty stakes free of charge. Now I can strap it down more securely",
      "rating": 4.0,
      "verified": true,
      "author": "Robin Nichole",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Would not buy or recommend. Horrible cheap hollow metal",
      "text": "Horrible. Would not recommend. Waste of money. Did not even last a little rain storm or smal snow storm. The metal pole is hollow inside and collapsed from a little snow. The whole thing flew off the boat that it’s suppose to cover and all the little straps that attaches the tarp all started deteriorating within 1-2 months. would not recommend at all. Better off going to those Home department stores and get better quality pole and tarp than wasting money on this cheap one",
      "rating": 1.0,
      "verified": true,
      "author": "The bradybunch",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "This is a nice carport canopy, but it is definitely not Heavy Duty.",
      "text": "This was easy to assemble and would be fine to use on a temporary basis for something. I had assembled it and used sturdy strap tie downs that would not pull out of the ground. We had a surprise storm that was very windy and because of the sturdy tie downs, a number of legs and other pieces bent very badly. In all, I needed to replace 16 pieces and to the company's credit, I received the parts in less than a week. No charge. It is a nice canopy, but needs to be used on a temporary basis, say for a party or something and then disassembled. Not strong enough to be a permanent carport.",
      "rating": 4.0,
      "verified": true,
      "author": "Rolfe W. Smith",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Love this canopy.",
      "text": "This was super easy to assemble, light-weight and definitely sturdy for the money. We had a sudden micro-burst mid-January, which upended our canopy over our house into the back yard. Several poles were bent. We contacted customer service, and had a response in hours via email. They were very helpful and sent the replacement parts right away, with no hassle. I would purchase a Quictent again without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Nurseman",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Great item!",
      "text": "We bought this to store our bass boat under. My husband assembled by himself but did saw having two people would have been easier. We have a great fitted cover for our boat but here in Phoenix the sun eats them up quick and it still doesn't keep rain off- have to replace them often. This awning did a great job. The cover lasted about a year baking in our heat and sun (which is better than a normal boat cover) and kept the rain off great. No having to scoop water out after a storm and kept the sun off the boat. Great product and great price! We love this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Patti Keniston",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Nice canopy",
      "text": "Really a nice canopy. Instructions would have been nice... but I figured it out. The only reason for the 4 out of 5 stars is the cables that came with the unit have weak connections. Do not put much stress on them they will pull apart and the way they are made you really cannot reuse them once the cable pulls loose. Its holding up real well thought.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony L Lyle",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "THE best customer service. Period.",
      "text": "When I had issues, I emailed customer service and they got back quickly and were always happy to ship out another part if necessary. Like the others have said, this will never stand up to much of a wind - so you've gotta figure out how to anchor it so it won't blow away. The anchors they include won't do the trick. Otherwise, this is a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Jann Howell",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Frame good and canopy poor",
      "text": "The frame is really good. Wobbles in high winds but stays secure. The canopy material is shredding already and it hasn’t seen the summer sun yet.",
      "rating": 2.0,
      "verified": true,
      "author": "Bonnie P.",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Cheap hardware the rest is nice",
      "text": "All and all I am pleased with the canopy. The instructions were vague and not numbered correctly but I figured it out. The hardware was the main issue I had . Had to go to home depot to get new turn buckles the ones that came were not well made and one kept sliding apart. Once that was handled the rest of it was built very well. Looks like it will last a while.",
      "rating": 4.0,
      "verified": true,
      "author": "brandNV",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Great if you live where there's no snow",
      "text": "Did great in high winds and heavy rain. It held up to a foot of light fluffy snow. However, 4 inches of heavy wet snow collapsed it. The pitch is not steep enough to shed snow. Otherwise great product for price. It has stabilizer cables across width. Would have liked to see cables spanning length as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Cliff",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Happy Customer",
      "text": "I did some \"research\" before purchasing & I think i made the perfect choice. I wanted an outdoor chill space & this worked great! We've had a couple windy days & it held up great! I do intend on cementing the posts down before the real windy weather hits! I am very pleased with it! Need to also add, had a hail storm last night & ol girl held up like a champ!!!",
      "rating": 5.0,
      "verified": true,
      "author": "bernice van winkle",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Perfect Boat Cover",
      "text": "Love our new cover for our boat. Perfect for a floating dock where weight is a big factor. Turned out to be easier to assemble than we first thought. Just wish it was offered in more colors.",
      "rating": 5.0,
      "verified": true,
      "author": "John Lowder",
      "helpful_votes": 4,
      "publication_date": 20190417
    },
    {
      "title": "do not buy this crap",
      "text": "product is poorly made crap. the metal is not weather treated so it rusted keep in mind that's in California weather and in less then a year (which is all i have had it for )the tarp tore all the way from one side to the other at the point of the fold stiching for the rings. there is a reason high mil. like 18 to 20 tarps are more then this whole set up. because its trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Jesse",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Excellent design",
      "text": "Poles lock into each other making assembling much easier and stay wires hold frame nicely in place-excellent design",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah J. Burns, D.V.M.",
      "helpful_votes": 2,
      "publication_date": 20190608
    },
    {
      "title": "Needs better bungee cords",
      "text": "The cover and frame seem to be quality but the bungee fasteners are no good. I installed this several months ago and when I had a gusty day, the majority of the fasteners broke. I had three fasteners on the cover from a different supplier and they were okay.",
      "rating": 2.0,
      "verified": true,
      "author": "JERKEMAN",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Ease of setup",
      "text": "I was surprised how relatively speaking the item shipped and was received by me. The only con I have is it’s difficult to get ahold of them. But when you do. The service is outstanding. Good quality product. Good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Lobo",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Worth The Money",
      "text": "Bought the Quictent HD w/cables for camping along with the trailers awning. Found it to be a quality carport even in strong thunderstorms, I have used it for family picnics along with covering my boat. Setup is easy for my wife and myself. Had one small problem with one set of poles locking together THEIR CUSTOMER SUPPORT 5 STARS !!! had new poles shipped the next day. Great seller and product fast shipping. Neighbor looked at it and ordered one and I will buy another for my sons birthday thanks Robert B. Conn.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Bovi",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Tarp Not Good or ties",
      "text": "Frame is good...Tarp is crap. Several grommets were too close to the edge and pulled out. Also it's a bit small. But it's still worth the price. Update. Bungees only lasted 3 months. Tarp is deteriorating quickly. Frame is holding up great.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Hayton",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Cheap",
      "text": "Cheap quality didn’t last 6 months in Florida weather, first of all it’s very flimsy then the bungee cords just got weak and rotted away along with the tie down strings supplied and not everything was galvanized, I would not recommend this product",
      "rating": 1.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "GREAT product, GREAT value & GREAT customer service!",
      "text": "Ordered this item with some reservation because the price seemed too good to be true. As it turned out, this is one of the best purchases I have made in awhile. We experienced some extremely high winds (hurricane Dorian) and the \"ball bungees\" stretched out and snapped apart. I sent a message to the company and they immediately shipped me replacement ball bungees.... thank you Wendy!",
      "rating": 5.0,
      "verified": true,
      "author": "Snooky",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Easy to install and just the right size",
      "text": "I received the canopy materials in the mail in a few days from the time I ordered and was able to put everything together in about two hours time. The structure is sturdy and keeps unwanted debris and sunlight off my Toyota truck. Excellent purchase. I wish I'd done it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich D.",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Great Value",
      "text": "Overall, awesome. We just needed to add height for our purpose. Steel cable on center broke, but others are holdling. Super easy to assemble for two people. Tarp odor is overwhelming, pipes leave thick powder residue on hands, I needed to put on gloves. I would order it again.",
      "rating": 4.0,
      "verified": true,
      "author": "sara bellum",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Great Product",
      "text": "I've had mine up for over a year now, and it works great. I have had to replace the elastic ball ties, due to UV, but I expected that. I am considering buying another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry J. Newman",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Amazing Customer Service",
      "text": "This product is sturdy and relatively easy to assemble. I contacted the company who sold it to me and received excellent customer service and support, even 5 months after purchase. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "The one I was looking for",
      "text": "All parts and pieces were present in the box. Took about 30 minutes to erect (most of it done by my wife). The canopy fit the frame perfectly. Unlike a cheaper canopy, which we also have, this one is strong, sturdy, and appears to be made to last more than one summer. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wm. A. Lewis",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble - sturdy and stable. Using over a boat -gives good protection. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great cover!",
      "text": "Nothing not to like. Relatively easy to set up. Great value for money. So far w/o the aid of weights it holds up to the afternoon prevailing winds in FL. My Q7 loves the shade it offers and we love how cool car is now when we get into it. 😀",
      "rating": 5.0,
      "verified": true,
      "author": "Raj",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Weather resistance",
      "text": "Loved this product. I use it to protect my car against bird drops and bad weather. In the last 6 months since I installed it, I can only recommend this product! ANd it's worth the money spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Ron book",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Pleased so far!",
      "text": "So far so good! We've had some pretty strong Southern Spring and Summer storms that blew down limbs and trees in our town and this structure stayed put with no damage at all. We did buy longer ground stakes at Lowes for the base when we installed it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Harper",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Very durable",
      "text": "This is perfect and plenty stable for even higher winds. I leave it up all summer at camp. At the ends of last summer my bungee cords needed replaced and they sent me all new no questions asked under the warranty. Love the product and the seller. I have recommended to others for purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Lee",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "This company stands by their product!",
      "text": "The canopy itself has held up through Texas storms. Some bungee ties broke after oxidizing in the elements for a year, but the company came through and sent us replacements!",
      "rating": 5.0,
      "verified": true,
      "author": "Lew&Val",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Great product, very satisfied",
      "text": "This is a great product. We're using it as a car port beside the house. I did purchase a more heavy duty set of anchors, because Florida is prone to hurricanes. But as for the sturdiness of the steel frame, I'm very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "A.Williams.Fam",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great Carport",
      "text": "I purchased this carport in summer of 2019. It's a great product and it has served me well. I park my car under it and it keeps the inside considerably cooler than if I park it outside. However due to the strong sun in Southern California the tarp got worn and tore from some recent winds. I contacted Quictent customer service and they were quick to send me a replacement tarp free of charge. Thank you for the great customer support.",
      "rating": 5.0,
      "verified": true,
      "author": "arthur barsegyan",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Love our carports!!!",
      "text": "This is second one that we bought. Love them both. Still using the first one. Did have some poles break on the first one due to a wind storm. Quictent sent out replacement poles right away. Thank you Quictent.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Jensen",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Fail",
      "text": "UPDATED . After set up and a few months the bungee balls were replace through customer service. They did a great job getting the parts replaced when asked. Failed after 3 months and a snowstorm.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim B.",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Not bad for the money",
      "text": "It’s nice that it’s galvanized and actually ends up being sturdy but the 2 piece bars front to back are the only real weak point. I used some screws in this area that helped",
      "rating": 3.0,
      "verified": true,
      "author": "JASON GARFOLA",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Sturdiness",
      "text": "Put foot steaks in, light wind blew it upside down and 4 of 6 legs bent. Not sturdy",
      "rating": 1.0,
      "verified": true,
      "author": "tobby oliver pruitt",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "very sturdy",
      "text": "We have only put this up once but it seems very sturdy. I was worried about holding up in a wind, but we had a fair amount of wind and the canopy was not even bothered at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn S Everton",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great for temporary use, don't need it all the time, but would not hesitate if i did.",
      "text": "This thing goes with just me in about 20 minutes. Use a socket to drive the anchors in grass, if you have one big enough. I use mine on a drill driver. Been up and down a dozen times for high school functions and it works great. Tarp is heavy duty enough for the hail storm we went through, but I imagine it would photo degrade and rip after time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Good quality, great customer support",
      "text": "I'm happy with the overall quality, and I'm very pleased with the customer support, which has been very responsive when needing to replace parts under warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "PD001",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "I love this product, would purchase again.",
      "text": "Product as I stated in description, easy to put together. I love that I now have shade on my patio. And have since built a sectional couch that sits under this canopy. I love it and I’m very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "If u have a bigger car or truck",
      "text": "Don't buy this if u have a big car or truck. Our car is a Ford edge and bearly makes it in. Very tight for space. I'm glad I'm very small girl or I would not be able to open door to get out of my vehicle. Also there is only an inch and a half from the roof of my car to the top of canopy. Other than the size issues very easy to assemble and very sturdy.",
      "rating": 3.0,
      "verified": true,
      "author": "bmelo",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Good Value",
      "text": "So far so good, I just put it up feels pretty secure as of now. It was easy to put up. Good size, couple of poles had dents already in them hopefully it doesn’t effect the structure of it or give out during windy days.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "SHADE IS GREAT",
      "text": "The item arrived early, which was great. very easy assembly, and quality of product is as described. Feel good about the purchase. My husband added blocks under the post to raise the height and to make it easier to mount to our cement patio. Had it up for a week and so far all it good.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Worth the buy",
      "text": "Good tent very durable it stayed up even with high winds for 2days then I removed it. I wish it had side walls",
      "rating": 5.0,
      "verified": true,
      "author": "denise",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Weak bungee cords",
      "text": "Purchased about 3 months ago. Frame and cover hold up pretty well in the wind. Only problem so far.. half of the bungee/ ball cords that hold cover to frame have broken, the other half aren't too far behind. They can't hold up to Florida weather, dry rotted. I've replaced the broken half with large plastic tie straps. That fixes that. Just a heads up",
      "rating": 3.0,
      "verified": true,
      "author": "Jrgator",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "A good value for the price",
      "text": "Very easy to put together all the parts were there fit very well look pretty sturdy. Are used it to cover my boat on the carport looks like it will do a much better job than the boat cover. I did anchor it with 8 inch cement blocks.",
      "rating": 5.0,
      "verified": true,
      "author": "ed fernandes",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "great value",
      "text": "easy to put up covers my boat well so far hoping it will hold up to the winter around here seems to be stronger but only time will tell held up good to 20+ wind until i see how it holds up to winter can not say if i would buy again but so far very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "lamar ",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Good product, great service",
      "text": "This was easy to assemble, and is a great alternative to more expensive carports. The box arrived damaged and one of the smaller parts was missing. The seller had a replacement part to me within a few days.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "A Quality Product",
      "text": "Bought this product a year ago and liked it. I really like to appreciate their customer service especially Green. She was prompt and followed up till the parts reaches us. As others said, the size of the tarp could be little more to complete. Instruction booklet could be more clear and accurate with the steps. I am happy with the product till now.",
      "rating": 5.0,
      "verified": true,
      "author": "Hitesh D Vibhakar",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Better then harbor freight!!",
      "text": "This thing is sturdy ! I have it tapcomed down to my driveway and two ratchet straps on the front anchoring it down just because the tie downs they give you are not the best. So far we had 60 mph gust and it didn’t even budge! Great quality I’m excited to see how long the tarp last. Right now it’s almost a month old so will see how it does In the Florida sun !",
      "rating": 5.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Nice and easy to assemble.",
      "text": "I am using this over my patio. I like it because it is nice and sturdy. I am glad that I got this.",
      "rating": 5.0,
      "verified": true,
      "author": "shryoung",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Should have  bought this for years ago",
      "text": "Very easy to set up , Great customer service very impressed with the quality. All I can say is it’s worth the money. Thank you Jasmine",
      "rating": 5.0,
      "verified": true,
      "author": "McGee’s Smokehouse",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "tie it down",
      "text": "really good for the money i have had many --have to wait and see how long tarp holds up in florida sun and wind --as long as you secure it well its fine",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Sturdiness",
      "text": "This tent is good choice to buy. Easy to assemble, it takes less that 20minutes for 2 people. Instructions are clear. Vendor is very flexible to work with. I got some parts damaged after a while and they replaced them and very low cost. If I ever need another one I would buy it from them. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan D",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Sturdy and easy to setup",
      "text": "Super easy to setup, took me 30 minutes. Seems really sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jia-chi Samuel Chieh",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "The tie down for the canopy are poor quality",
      "text": "The tie down for the canopy are poor quality only last 1 month",
      "rating": 3.0,
      "verified": true,
      "author": "G4H Grillmaster",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "LOOKS GOOD AND DRY",
      "text": "IT APPEARS THE MATERIAL HAS STRECHED AND IT FLOPS WITH JUST A LITTLE WIND.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Worked for me",
      "text": "So far it has been great. Had it for a couple of months. Have had a couple bad wind and rain storms & it has done great",
      "rating": 5.0,
      "verified": true,
      "author": "SRow5513",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Worth the money.",
      "text": "I live out in the desert and needed some protection for my black SUV. This is totally worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Sahara",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Not Sturdy",
      "text": "Metal pole bent on a windy day. Not sturdy enough. This product was a waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaz O",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Easy to assemble but stake it well",
      "text": "Very easy to assemble. Flipped over once in bad storm and bent poles up. I bent them back in place and set poles in 5 gallon buckets of rocks then tied rope to it. Hope fully that will help.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Love love love",
      "text": "This was way more than I expected for this price. Absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Billie Jo Seid",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Great Tent!!",
      "text": "Used for outdoor birthday party in August and it was perfect size! Sturdy and got the job done!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Nice to Have!",
      "text": "Not to expensive. Pretty sturdy carport. I recommend picking up a few sand bags to hold the tent down in the case it is windy. I bought 4 sand bags ($6 each) at the hardware store and used the string in the kit to tie around the bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Pom F.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Check all parts, make sure they are not damage",
      "text": "Use this for my boat. My biggest complaint is. Damage part that I had to fix or modify to make it work. Didn’t feel like sending it back for a replacement. Or than that I’m hoping it holds up to the high winds.",
      "rating": 3.0,
      "verified": true,
      "author": "Ralph arceo",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "If you buy this keep you wallet out , the bungee’s that hole the tarp on the poles are crap",
      "text": "The bungee’s used to hold the tarp on the poles didn’t last even 60 days. They are cheep and not made for outside.",
      "rating": 3.0,
      "verified": true,
      "author": "roberta macdonald",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Good quality",
      "text": "I bought it mainly for the frame but the cover is actually decent.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Colmus",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Not worth it",
      "text": "Set up was quite easy but not sturdy at all , completely broke and flew even when tied down on a windy day , it wasn’t that windy .",
      "rating": 1.0,
      "verified": true,
      "author": "Cruz",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Need strong men",
      "text": "The only problem is there was a slight tear in the canopy",
      "rating": 5.0,
      "verified": true,
      "author": "Edna Smith",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Perfect!!️",
      "text": "Great product and wonderful customer service. Bought for protecting my new car. Works good, just the perfect height. Would buy again if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "K Silva",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great customer service.",
      "text": "I bought this car port tent back in May and it has been great. Easy to assemble, took about 2 hours and works great. When some of the elastic bands started to break, I contacted their customer support email. Let them know what I needed and had no problems getting more covered by thier lifetime warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Very happy with this purchase.",
      "text": "Very pleased with this purchase. It took us a couple of hours to assemble and it is perfect for protecting our car from the exposed elements.",
      "rating": 5.0,
      "verified": true,
      "author": "steve mei",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Very happy with this product.",
      "text": "This company was great to respond with any questions. My tarp ripped after some strong wind in Oklahoma and they had a new one deliver to me in 2 days!! Overall this is a great product and easy to assemble. I did it by myself in under 2 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie P.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Don’t spend your money",
      "text": "Very bad flipped over and hit my neighbors car now I have to spend even more money to pay for damages",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan solis",
      "helpful_votes": 0,
      "publication_date": 20200406
    }
  ],
  "product_meta": {
    "title": "Quictent 10X20'ft Upgraded Heavy Duty Carport Car Canopy Party Tent with Reinforced Steel Cables-Blue",
    "rating": 4.3,
    "feature_bullets": [
      "✅【WARRANTY】1. Lifetime Free Replacement for Connectors, Pegs, Ropes, Elastic ropes, etc. 2. 1 Year Free Warranty for Covers and Poles. 3. Lifetime 50% OFF Parts Supply exceed normal 1 year warranty.",
      "✅【Upgraded Galvanized Tube】Heavy Duty Rust Resistant galvanised steel framework and metal corner joint makes our carport more durable.",
      "✅【Extra-thick Polyethylene Fabric】Reinforced PE material is Tear-proof, Waterproof and Anti-UV. Industrial grade Cover Fabric for long lasting durability and protection guaranteed.",
      "✅【Reinforced Steel Cables】Extra 3 High strength steel cables to reinforced the entire structure, which makes the whole structure much safer & firm, and prevents structural twisting! and can withstand large external pressures.",
      "✅【Reinforced Package】Reinforced Packaging-Wooden bracket inside, we have especially reinforced our packaging in order to minimize the extent of any possible shipping damage to the goods."
    ],
    "specifications": {
      "Product Dimensions": "120 x 240 x 104.4 inches",
      "Item Weight": "84 pounds",
      "Manufacturer": "QT",
      "ASIN": "B082M8JTLL",
      "Customer Reviews": "4.3 out of 5 stars536 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#7,657 in Patio, Lawn & Garden"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Outdoor Storage",
      "Carports",
      "Garden & Outdoor"
    ],
    "price": 219.99
  }
}