{
  "website_summaries": [
    {
      "verdict": "The overall feedback for the Nike Flex Experience RN 8 has been mixed. The positive points are present and numerous, but the negative elements still made themselves known. Praise is given to the versatility of the silhouette, the lightweight build, the durability of the materials, and the flexibility of the midsole. On the other hand, criticism is afforded to the squeaking noise of the platform and the slip-magnet of an outsole.Fans of road running shoes that are designed for neutral pronation are the ones who are going to enjoy the Flex Experience RN 8.",
      "pros": [
        "People have noted that the lightweight construction of the Nike Flex Experience RN 8 has allowed them to wear it all day",
        "‘Comfortable’ is a word that many have used to describe their overall experience when wearing this Nike running shoe",
        "The versatility of this product is lauded by those who like their footwear to be a mix of functionality and style",
        "Consumers are generally happy with the affordable price of this neutral running shoe",
        "The flexibility has gained praise as it apparently permitted the foot to move naturally through the gait cycle",
        "Most runners have noted that the durability of the components is commendable",
        "the shoe didn’t break down quickly",
        "The cushioning system is praised for being responsive and able to encourage speedy steps"
      ],
      "cons": [
        "According to some testers, the midsole has a tendency to emit an annoying squeaking noise when taking each step",
        "The scant use of rubber on the outsole brought with it a tendency for the shoe to quickly succumb to slipping, several users commented",
        "A few consumers claim that the forefoot section is a bit tight",
        "Some runners have reported cases of the upper quickly separating from the midsole after only a few uses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.8,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Gluey seams and cheap",
      "text": "Lots of glue left all over the seams, really terrible quality. Fabric feels like a really cheap/old car interior rather than actual clothing, very synthetic.",
      "rating": 1.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 49,
      "publication_date": 20190405
    },
    {
      "title": "Great Shoes for Walking",
      "text": "These shoes are so comfortable and great for getting in 10,000 steps a day! I purchased a pair at Kohl's and found I needed a size larger than normal. I ordered another pair on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Edborg",
      "helpful_votes": 30,
      "publication_date": 20190410
    },
    {
      "title": "Great for running",
      "text": "One of the best running shoes I have owned. Very flexible. My feet feels great after a few miles of run and wants to go further. Get a 1/2 size larger than usual.",
      "rating": 5.0,
      "verified": true,
      "author": "darkgray",
      "helpful_votes": 23,
      "publication_date": 20190407
    },
    {
      "title": "They are great!",
      "text": "I love these shoes, they are soooo comfy I’ve bougt like 7 pairs in the past four years. I cannot speak highly enough of them. This review is for NIKE woman’s in season cross trainers TR 4 size 7.5 I’m including that information because it would appear that the seller has switched the product that this review is for. Stay informed my friends!",
      "rating": 5.0,
      "verified": true,
      "author": "Israel M",
      "helpful_votes": 20,
      "publication_date": 20190104
    },
    {
      "title": "The arch support felt a little uncomfortable",
      "text": "I have flat feet and after purchasing a pair of Nike shoes, I assumed it was going to be a piece of cake. They came fast and after trying them on, I felt a little uneasy with the shoes. I wasn't sure if it was a good thing or not because since I don't have any arch support, the shoes felt as if they were pushing up on my feet too much. The arch support in the shoes seem to be too high and it was pushing against my feet with a moderate amount of pressure. I wasn't sure if I could deal with that kind of feeling on my feet so I brought them back",
      "rating": 3.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 11,
      "publication_date": 20190612
    },
    {
      "title": "Great for the Price!",
      "text": "Bought these for my 14 year old son. Size 13. He usually wears a similar style. He has a narrow foot. These are a nice shoe for price. The sole is soft, but a little more dense than the other running shoe he usually buys. Hoping this one last longer.",
      "rating": 5.0,
      "verified": true,
      "author": "JStoner",
      "helpful_votes": 11,
      "publication_date": 20190412
    },
    {
      "title": "great for playing tennis!",
      "text": "I bought this pair last year in July 2019 for my 16 yrs old son to exclusively wear them for tennis. He wore them for his tennis lessons during Summer 2019 then for tennis matches in the Spring 2020, and now for Summer clinic this year, and the shoes is still looking good. Granted that he only worse these for tennis but he had tons of tennis matches in the period of 1 year and there's a lot of feet movements while playing tennis. 5 out of 5 stars. I do recommend these sneakers for either running or for tennis like my son. Hope this was useful... and if it was, please click on the helpful button below. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "DavidsList 📝👍💬✅",
      "helpful_votes": 3,
      "publication_date": 20200722
    },
    {
      "title": "Perfect for running away from your wife",
      "text": "Have these on at all times... You're sitting there, AL bundy style and your wife yells at you. \"Take out the trash you bum, you never do anything, blah blah blah\" .. You realize . Damn she's about to explode... So you start running and let me tell you... Theae things help you get away from that crazy woman. ..",
      "rating": 5.0,
      "verified": true,
      "author": "ss",
      "helpful_votes": 5,
      "publication_date": 20191014
    },
    {
      "title": "Insole moved, beware causes heel blisters",
      "text": "I've had these for about 3 months. When they arrived they seemed ultra light and I questioned the quality of the shoe construction. Recently I've noticed the right shoe insole has moved about 1/8\" over exposing my heel to the sole/side of shoe seam. This has led to a few heel blisters as the seam rubs with every step. The only solution I can find is adding another insole to help cover the area but it seems foolish to have to do so much extra work for a brand new pair of sneakers. Buyer beware the shoe quality is not good. I would not recommend these to anyone I liked.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis Link",
      "helpful_votes": 2,
      "publication_date": 20191202
    },
    {
      "title": "A Little Disappointed in These Nike's",
      "text": "I bought these sneakers to wear on the treadmill, but they don't have the usual support in the right places to use for that purpose. These shoes will probably only be for walking around. They seem so much more cheaply made then the last couple of pair's of Nike running shoes I've gone through. Maybe it's just the Nike Flex Experience model that feels inferior and not the whole Nike line.",
      "rating": 3.0,
      "verified": true,
      "author": "Tony Palm Springs",
      "helpful_votes": 3,
      "publication_date": 20191006
    },
    {
      "title": "Alright, but might have permanently damaged my right foot",
      "text": "I used these shoes for around 8 months as my primary shoes with ocassional running. They are comfortable enough for day-to-day wear, but they are incredibly squeaky on hard floor. I had a friend who also had a pair of these shoes and he had the same experience. This makes it really awkward in quiet hallways and libraries. The tread wore off in a couple months as running shoes usually do for me. They were causing my right foot some pain, and they really hurt my foot after a 7 mile run at the start of quarantine. My ankle now clicks when I extend it and feels kinda sore a lot of the time. I replaced these shoes shortly after.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Great look, great fit, noisy tread",
      "text": "Incredibly comfortable. Good quality. No complaints about the fit or the look. One surprising issue: The tread on the bottom is composed of little dipped circles. When you're walking on a smooth, hard surface like at a grocery store, those little circles act like suction cups and make a squicking noise as you walk. It's pretty annoying and a little embarassing. Overall, I do enjoy wearing the shoes, and I don't regret my purchase. But the tread is an unnecessary annoyance.",
      "rating": 4.0,
      "verified": true,
      "author": "churry",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Love these!",
      "text": "Now these shoes have been my favorite purchase in some time. My son has a large foot for his age that also happens to be wide. I spend so much money on shoes for him, as he blows out the side of every single one. He’s highly active and wears them for about 11 hours a day. These particular Nike’s are not budging this time. Very minimal signs of wear even after a few months. He says they are his most comfortable pair to date. He typically only wears Nike’s so I was surprised to hear that.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "Poor material",
      "text": "Material is so poor. It got ripped in one week. Not worth it",
      "rating": 2.0,
      "verified": true,
      "author": "Neel Patel",
      "helpful_votes": 5,
      "publication_date": 20190816
    },
    {
      "title": "If you require orthotics in your shoe, this one doesn't hurt the top of your foot",
      "text": "This is my second pair of this sneaker brand and model. I have custom orthotics because one leg is marginally shorter than the other. They're a little thicker than the insole that comes with the shoe. In most other brands, the top of my foot hurts when I power walk because of this. This is not so with the the Nike Flex Experience 8. There is a lot of space from top to bottom. These shoes are really light and feel like I'm wearing slippers when I walk. I got 129 miles out of the previous pair. I've walked as much as 12.5 miles under 15 min pace and my feet simply don't hurt in these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "ToddInVA",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "Very noisy",
      "text": "So the shoes themselves were fine, the issue was walking on any type of smooth surface floor, the sole constantly squeaked as if you had wet shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim R.",
      "helpful_votes": 4,
      "publication_date": 20190929
    },
    {
      "title": "Definitely my shoes worked well... just the first few weeks.",
      "text": "How is it possible? Really Nike shoes? I received these shoes at the end of June this year (2020), Three months later they are a mess. Look the photos. I use to use them to running a few days in a week, I have another shoes to running. So one day I use this and another day use the other, but anywhere these shoes work as I expected just a couple of weeks, nothing else. They got broken as you can see.",
      "rating": 1.0,
      "verified": true,
      "author": "Henry Adames 01-51250",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Don’t recommend them. Suction sticky sound that it creates will drive u insane.",
      "text": "I don’t recommend these shoes because as you walk it makes a horrible stick sound on floor. I work in the ER and the show always makes these sound and it’s horrible. I think is the little suction that they have on the bottom",
      "rating": 1.0,
      "verified": true,
      "author": "Dlance",
      "helpful_votes": 2,
      "publication_date": 20200426
    },
    {
      "title": "Very loud when walking on smooth surfaces!",
      "text": "SO LOUD when walking, smooth surfaces so annoying! I hate these shoes when I'm, walking in the store!",
      "rating": 1.0,
      "verified": true,
      "author": "Ben C",
      "helpful_votes": 4,
      "publication_date": 20190808
    },
    {
      "title": "Honestly one of the greatest pair of all around shoes I've ever owned.",
      "text": "I have spent $120+ on the Nike FreeRuns, Lunars, AirMax's, etc... I ordered these for a casual work out, gym, lounging around walking shoe. They have quickly become my favorite pair of shoes in the inventory. Very light, cushion is build for all day following your wife around the mall type walking AS WELL AS getting a couple mile jog before or after work. I wouldn't recommend for the long distance runners who need firm support cushioning. But all around, this shoe is WELL WORTH the price point.",
      "rating": 5.0,
      "verified": true,
      "author": "ecw1105",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Overall happy with my purchase",
      "text": "Very comfortable and light weight. The shoes seem well made for the price point. The only slight flaw to the shoe is the lack of toe room. I went up a half size as I usually do with Nike. The length and width works but I just wish I had a little more space for my toes to move around.",
      "rating": 4.0,
      "verified": true,
      "author": "Mason W",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Hot Hot Hot",
      "text": "Hot, and not in a good way. Seems like feet are wrapped in latex foam inside plastic wrap. My feet get very over- heated wearing these. Also, the heel cup is soft. You cannot just slip your feet into the shoes. You have to pull up on the back of the heel cup or use a shoe horn to get these on otherwise the heel cup will be under you heel and not up around it. That seems like a major design flaw.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Miles",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Very flimsy and break down quick.",
      "text": "The worst Nike shoes I’ve ever owned. Very flimsy which makes them comfortable at first but also makes them quick to break down. I have worn them very little and the seams are coming apart. One strange thing is if you wear anything other than white sock with these shoes, the color bleeds through and stains the upper. Pass on this model.",
      "rating": 1.0,
      "verified": true,
      "author": "jason harshman",
      "helpful_votes": 2,
      "publication_date": 20190803
    },
    {
      "title": "What paid for",
      "text": "I went thru reviews because ordering online is difficult. Look at pic. Order it. Wait so excited for 2 days takes to get. Open package. An like wth? What is this? With this shoe. They stretch. So tight at first. If like tight shoes. Order half size small. Walk weird for week or 2. I got what ordered brand new pair Nike's. That is exactly what ordered. For good price. No glue all over seams. An I wear 9 an half,fit fine. No order size half smaller.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Not holding up in a short time period among other issues",
      "text": "Front sole of shoe coming apart in less then 3 months I don’t like the cloth like material for the uppers on this style shoe don’t hold your foot in place very well and if you ever walk through grass and there’s dew or it gets your feet wet.",
      "rating": 1.0,
      "verified": true,
      "author": "atamazon",
      "helpful_votes": 2,
      "publication_date": 20191001
    },
    {
      "title": "Great shoe as long as you can get the right size.",
      "text": "These are great shoes. I have flat feet and I can walk in there all day and my feet don't hurt! I do recommend getting on a pair at the store first they do appear to be a size smaller than normal. Also make sure you order the right width because they do make this in a wide size. One last note I have multiple pairs and I noticed their sizes can be inconsistent. A size 8.5 and size 9 fit exactly the same.",
      "rating": 5.0,
      "verified": true,
      "author": "War",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Great Shoe",
      "text": "Perfect water shoe but also great for general walking around. I needed a shoe to wear to the beach and this fit the bill. However, I liked the look so well and the it was so comfortable I wear it as a casual gym shoe. Light weight, comfortable and stylish. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "After just a few months many issues",
      "text": "At first the shoes seemed great. But after using them for about 2 months, they developed holes in the tops of each shoe. I do alot of running at the gym, but you would think after 2 months they would hold out. Then on the 3rd month the left shoes inside portion began to collapse making my left foot turn inward and actually cause foot pain. Now they are no good. I can't honestly recommend these for any long term active use after my experiences.",
      "rating": 2.0,
      "verified": true,
      "author": "Markm75",
      "helpful_votes": 2,
      "publication_date": 20190926
    },
    {
      "title": "Comfortable shoe to work out or just walk around.",
      "text": "Vendor was excellent. Just be aware that Nike’s run a little smaller than other shoe brands...seriously I think they ALL do. However, great lightweight shoe. Good for general workouts, running, etc. Not really for something more serious like football or soccer or anything. But for general fitness? You bet! Super comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Coloradofamily",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "extremely comfortable!",
      "text": "These shoes are comfortable and light weight. I have 2 pairs, one for work and one for activities. I got rid of all my other athletic shoes that didn't feel as good.",
      "rating": 5.0,
      "verified": true,
      "author": "springtime",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "It's like running on a cloud!",
      "text": "Love it! Started running couple weeks ago and was having issues with impact hurting my leg muscles. This literally doubled my running distance the day I tried it! (Doubling from 1.5 km to 3 km). I knew I couldn't go wrong =] Hopefully I'll be running 5km in a few more weeks!",
      "rating": 5.0,
      "verified": true,
      "author": "Astrogildo",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Terrible shoe. Stay away.",
      "text": "God what an uncomfortable shoe. Very hard sole and squeeks like crazy on flooring. Everywhere you walk it’s like you have wet sneakers. Terrible shoe. Already replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 3,
      "publication_date": 20190630
    },
    {
      "title": "Great Running Shoes",
      "text": "I've been hooked on Nike Flex's for 5 years now. They last a long time and feel insanely great. It's like running on air. I love the fact they are so so light and yet still offer great support. These particular version are no different. Can't beat the feel and the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Dodd",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great shoe for outdoors",
      "text": "The shoe is extremely comfortable for long walks or running outdoors. If you walk on a wood/tile/marble/etc. floor indoors, the shoes squeak quite a bit. I think it has to do with the design of the sole. Bottom line is probably a better shoe for outdoors or only in the gym. If you are trying to walk quietly down a non-carpeted hall, pick a different shoe. Overall, I would still recommend for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Poor performance low quality",
      "text": "There are serious issue with this pair of shoes. After few days you will start feeling tik tik in your sole. You'll feel pain on your toe when you walk. I bought wide shoe and the shape started changing i couple of days thats why i returened it",
      "rating": 2.0,
      "verified": true,
      "author": "Atif abbas",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Fits well and is comfortable",
      "text": "I really love this shoe, it fits well and is very comfortable, but the material of the shoe can kind of be a flaw, its a cloth like material so if somthing scratches against it itll create a cut like scrape in the material, which happened to me unfortunately.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Faria",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Lasted Two Months (Normal Wear)",
      "text": "These were my son's day-to-day sneakers. He's a normal activity kid, walks a half mile each way to school, no running. They lasted two months before they are falling apart. So he likes them, but for $60, I'd expect sneakers to last more than two months.",
      "rating": 3.0,
      "verified": true,
      "author": "V&R Sanders",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "quite tight across toes+-",
      "text": "sold/labeled as wide/4E, but quite tight across the toes ... fortunately not bought for running ... fabric is cloth-like so was able to easily slit it longitudinally in several places, and under-padding was only loosely glued so able to remove that too ... now loose enough, not water resistant, not likely to last long without further manipulation",
      "rating": 2.0,
      "verified": true,
      "author": "Mikka",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Comfortable for everyday use",
      "text": "I bought these for my husband's birthday and he LOVES them. He even asked for another color pair for our upcoming anniversary. He says they are the most comfortable shoes he's ever had and wears them nearly everyday. He often has back discomfort so my hope was to help alleviate some of that with good shoes. I'll be ordering another pair soon! They ran a bit small but I've learned this about Nike brand so I'll buy another half size or so up.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Miles",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great for the price",
      "text": "It's tough at times to find a decent pair of shoes for wider feet like this, especially under $100. These shoes are comfortable and after they were broken in they fit pretty much perfectly. The material of the shoe feels nice, though the silver reflective strips on the sides detached from that fabric pretty early on and now sit more like ears. That's a mild aesthetic inconvenience and in no way makes this shoe any worse. Definitely worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Tidd",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Perfect men’s gift!",
      "text": "I’m always hesitant on getting my husband shoes because he’s picky but got these for Christmas for him and he loved them! The all black are obviously harder to notice when they get dirty, yet go with anything and everything. They run true to size.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy23",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Perfect pair at a reasonable price",
      "text": "I finally picked out a great gift for my grandson! These Nike shoes are sleek, fit well and are a stylish color I couldn’t find anywhere else -muted red (his favorite color) rather than a bright in-your-face red.",
      "rating": 5.0,
      "verified": true,
      "author": "Stlgrm",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Light and Comfortable",
      "text": "I wanted to try the sneaker after purchasing the running shoe. Note: the sneaker is wider than the running shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Trails Hale",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Buy one size larger!",
      "text": "What I like: very lightweight. Comfortable. Good breathability. Decent arch support. And looks great! What I don't like: It's way too small. Width is OK, but length of shoes is a full size too small. I wear 10.5, bought 11 size...too small. 11.5 fits perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "YouMaybeRightIMaybeCrzy",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Ripped on first wear",
      "text": "The fabric tore on one of the shoes during city walking the first day I wore them. It appears the stitching was too tight on the side and it was bound to tear once put into motion.",
      "rating": 1.0,
      "verified": true,
      "author": "Mitchell Odom",
      "helpful_votes": 2,
      "publication_date": 20190723
    },
    {
      "title": "Great shoe, but squeaky on tile floors",
      "text": "Great shoe. Bought it for work at the hospital. Comfortable and fits well. My only complaint is that the shoe won't stop squeaking/ sticking to the tile floors. Tried everything except for shaving the bottom off the shoe. Makes it a little annoying walking through the hall and in rooms",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler S",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Perfect for my feet, wide and breathable",
      "text": "This is a super comfortable pair of shoes. Perfect for my feet, wide and breathable. My feet is littlte wider than usual, that's why I always have to buy atleast .5 size up than actual size but this one fits to the actual size.",
      "rating": 5.0,
      "verified": true,
      "author": "Random Reader",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great fit for a great price",
      "text": "For the price, I couldn't find a better looking, and better feeling shoe. Very easy to put on, and very comfortable to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Shoes are great...shipping not so much..",
      "text": "I ordered these as a gift for my son, no I didnt check the box asking 'is this a gift'...I assumed it would be inside a box, so it would be fine...i was wrong...🤷‍♀️",
      "rating": 3.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Very comfortable",
      "text": "My son said “they feel as comfortable as a pair of slippers.” Fit seems right for their size. Looks good — was able to wear every day as well as semi-formal events.",
      "rating": 5.0,
      "verified": true,
      "author": "D Darkman",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Disappointing",
      "text": "Tread did not last. Shoes still look brand new, until you look at the smooth bottom. Disappointed, these are really great looking shows & the uppers are well made.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Gray",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Buy one size larger",
      "text": "I had to return the shoes for a larger size. If you're going to purchase Nike shoes I recommend buying one size larger than your normal size.",
      "rating": 5.0,
      "verified": true,
      "author": "Thackery",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Poor craftsmanship",
      "text": "Shoe comes 1/2 size to small, excess glue for the soul on the shoes, the shoe’s fabric is neoprene like material, I was on the fence about buying them to begin with, I took a chance, my gut was right, DON’T order these shoes, Nike did a poor job on this particular shoe!",
      "rating": 2.0,
      "verified": true,
      "author": "Tonya Baker",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Fake product",
      "text": "Product is definetly not authentic Nike. It came slightly damaged already as indicated in first pic. Second shows the patch on the insude tongue ut looks like it was steamed on not sewn, indicative of a fake product. Other than all of that, it looks ok but its about a half size to small. If u buy i recommend a half size larger than normal. All in all it does not get the Smitty Stamp of Approval. 2 out of 5 stars",
      "rating": 3.0,
      "verified": true,
      "author": "David Smith",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Nice kicks",
      "text": "Fabric is really soft. Order the correct size. If you like your shoes tight your toes will bulge on the sides. Otherwise great looking sneakers! I tried some rubber no tie laces and the tongue kept rolling in on the side. Stick with the regular laces!",
      "rating": 4.0,
      "verified": true,
      "author": "Gary Hughes",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "No support and super tight",
      "text": "Very weak support for running. Material tops get soaked instantly from both sweat or puddles. They look cool but I will never buy a sneaker of this style ever again. Also they're pretty tight all the way around and after 6 months they're still tight.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Dry fast, fit great, feel like slippers",
      "text": "Super comfy. Really great all around shoe. I don’t use them for running though. No real arch or cushion. Super great for everything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Labrador",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Comfortable",
      "text": "Bought for my 17 yr. old son. Look sharp and feel comfortable. Anyone can wear them!",
      "rating": 5.0,
      "verified": true,
      "author": "peaceandsocialjustice",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "ANNOYING SQUEAK",
      "text": "STILL HAVE THE SHOES,LIKE NEW. DON'T WEAR THEM. AT WORK ON THE TILE FLOORS ,MAKES ANNOYING SQUEAK NOISE, WISH I WOULD HAVE SENT THEM BACK. ALTHOUGH THE SHOES ARE VERY COMFORTABLE.",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron Holcom",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Like Chinese Water Torture...",
      "text": "Wish I would have read and heeded the warning about squeaking on hard surface indoor flooring. Absolutely true. Learn from my mistakes and stay away.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Rogers",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "The loudest kicks in town but NOT in a good way!",
      "text": "These shoes make noises and are loud. Literally, the soles of the shoes as you walk make a suction sound on all surfaces. Everyone will hear you coming a mile away. Wood floors, tile or pavement...these shoes will sound as if you have attached suction cups on the bottom of your feet. If Spiderman needed a pair of shoes...these are his!",
      "rating": 1.0,
      "verified": true,
      "author": "Alex g",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "poor quality",
      "text": "I purchased this product for my son and less than a month the bottom of the shoe is falling apart!.it's ripping right off the soles. Do not waste your money on this poor quality of a shoe!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Easy return and happy with replacement pair",
      "text": "The first pair that was delivered had a defective insole that was cut short on the right foot. The return process was easy though & the replacement pair came quickly. The second pair fit perfectly and looked good. I bought them for a Texas Tech student for the red and black color scheme for game day. He really liked them.",
      "rating": 4.0,
      "verified": true,
      "author": "kathyL",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Comfortable",
      "text": "Shoes were very comfortable. I wouldn't wear them for running but for everyday wear they are great. Fit was spot on.",
      "rating": 5.0,
      "verified": true,
      "author": "Skrap",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Fit's perfectly and very comfortably but does feel a bit weird.",
      "text": "Fit's perfectly and they look nice and they're holding up well. They do feel a bit cheap though, like a durable cheap.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon M. Chacon",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Comfortable and stylish",
      "text": "Super comfortable, look fantastic and fit perfectly. I have wide, trollish feet and the E wide size makes this fit like a glove.",
      "rating": 5.0,
      "verified": true,
      "author": "GlassKR",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Great sneakers.",
      "text": "These sneakers look great and are super comfortable. Highly recommended! Would love more color options, Nike!",
      "rating": 5.0,
      "verified": true,
      "author": "snott",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Suction cups on bottom make terrible noise when walking on hard surface",
      "text": "tread design has suction cups that when you walk on hardwood, marble, tile or any hard surface it makes a terrible suction cup sound - product defect",
      "rating": 1.0,
      "verified": true,
      "author": "ZX504",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "light and Comfortable",
      "text": "These shoes weigh practically nothing. I can feel air circulating around my feet as I walk. They also look pretty good and are very much the current style. I'm keeping these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Lea",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Nice",
      "text": "Very comfortable shoes. I mainly use the for walking/working or going to the gym and are way easier on my feet than my more casual sneakers. Only ran/sprinted in them once or twice so far but they seem alright for that too.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Most comfortable shoe ever",
      "text": "This is the most comfortable shoe I have ever owned. It feels like you’re barefoot. Provides support and it’s like walking on air",
      "rating": 5.0,
      "verified": true,
      "author": "Xavier Beguiristain",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Like wearing slippers",
      "text": "These are incredibly comfortable shoes. They are almost like wearing slippers. They are quite possibly the most comfortable Nikes I have ever worn. The stretchy, soft material on top envelopes your foot like a pair of slippers. The only thing to keep in mind is they are cut just a tad small. So especially if you plan to wear gel insoles with them, I would suggest going a half size bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "B Diamond",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Good value",
      "text": "If you love Nike - you'll love this shoe. Fits good on folks with Narrow heel - no slipping & sliding.",
      "rating": 5.0,
      "verified": true,
      "author": "JZV",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Just ok",
      "text": "I wouldn't buy these again just because they aren't for long distance runs or walks. Plus they run smaller than usual.",
      "rating": 2.0,
      "verified": true,
      "author": "HJ Chandler",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Christmas Day joy",
      "text": "I purchased this product for my son. He opened them on Christmas Day. He says they are the most comfortable shoes he has. Absolutely loves them. We will definitely be ordering more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Griffin",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great pair, comfortable and lightweight.",
      "text": "Shoes came in the right size, extremely comfortable and lightweight, kinda feels like not wearing anything which in my opinion is a good thing. Not much more to say, impressed with the quality and comfort of the shoe, and the nice design that comes along with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ilai Barel",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Nice wide shoe",
      "text": "I liked that I could these in an extra wide size. The uppers are quite soft and flexible. Comfortable, but not as sturdy as the shoes I typically wear.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris R.",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Best Shoes",
      "text": "As a person that wears a lot of athletic shoes, these are some of the best shoes I have purchased. Extremely comfortable, very well ventilated, and supportive. I would recommend these shoes to anybody. I would buy them again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Perkins",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Comfortable, all day",
      "text": "Fit perfect true to size. Comfortable for working out cardio and weight training. Able to wear as an all day shoe also. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Defective insoles",
      "text": "The insoles were cut one size smaller so it feels terrible inside I order a second pair and same problem... I had to buy insoles",
      "rating": 3.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Light as Air",
      "text": "Very, very light and flexible. But the size is right and the shoe works great for light, low intensity cardio.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan G.",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "My preferred running shoe",
      "text": "This is now my third pair in a row to use for running. The other two were great. I just am following the \"600 mile\" rule for running shoes. Afterward they become gym shoes and eventually yard/knock around shoes. They are comfortable and they do last. Very light weight with a comfortable and supportive sole.",
      "rating": 5.0,
      "verified": true,
      "author": "Majin Bam",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Worth the spend",
      "text": "Extremely comfortable for running and a must buy, if you’re considering this. I use this for gym purpose and I am happy with fit, comfort and what not.",
      "rating": 5.0,
      "verified": true,
      "author": "Avinash",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Sizing seems at least half-size smaller than normal",
      "text": "Tight fit, compared to previous purchases of same style shoe. I wonder if Nike has changed their sizing in manufacturing process.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Hutchins",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "love this shoe",
      "text": "I am typically an 11, but this size 11 is tight. Great looking shoe though.......",
      "rating": 5.0,
      "verified": true,
      "author": "brian childs",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Nice for the price",
      "text": "Good padding particularly in the ball of the foot area. Felt small and warm on the first wearing, but that was a one-time experience. Otherwise, these shoes fit great and breathe well.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great shoes!",
      "text": "The color is so fun, yet no too wild. They are extremely comfortable as you would expect from Nike. They also seem very durable and well designed!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe D",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Cheap Quality - Nike Imitation?",
      "text": "Worst shoes ever. They lasted 6 months before tearing at the front and sides. I own 5 pairs of Nikes for the gym so this pair would be worn about 1-2 times a week. I wouldn't use them outdoors and yet they still didn't last? Ugh, never again will I buy Nikes on Amazon. I'm thinking they're a cheap knock off since my other Nikes have held up longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Mendoza",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Not really good for flat feet",
      "text": "Look great. Spacious, but I can feel the mid part of the shoe poking into my foot. Tried insoles, but they didn't help and it was still pretty noticeable. Sending back :(",
      "rating": 3.0,
      "verified": true,
      "author": "Mike S",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "OKAY!",
      "text": "THE GOOD: -good color THE BAD: -uncomfortable -poor quality -loud THE BOTTOM LINE: The quality of these shoes is really bad. The stuff is so cheap. The color is really nice though. But the shoes are not very much comfortable. But they are too noisy on smooth surface. I personally would never buy them again.",
      "rating": 2.0,
      "verified": true,
      "author": "Ejazulhaq Yasini",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Versetile",
      "text": "These shoes are great for working out, running, traveling, and biking. However, they never stop squeaking.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Fits perfect!",
      "text": "Super comfortable shoes! will probably buy another when these go out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Lightest shoe ever.",
      "text": "Best shoe ever. These are the most comfortable shoe ever made. They are so light you barely remember that they’re on your feet.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Sheehan",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Look and feel great but make a squeak on marble",
      "text": "The shoes feel very good and I like the look a lot however, the hexagonal pattern on the sole of the shoe causes it to squeak and make a loud noise whenever you walk on marble surfaces. Even after using them for a couple of months they still make the noise. However these are running shoes and are meant to be used outdoors so you get what you ask for.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Practice, Comfortable, and Durable Shoe",
      "text": "Love these shoes. Simple and clean design. Super easy to clean if you just throw them in the wash. I've had them for about a year now and the quality has held up.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Calixto",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Not worth the money and wait !!",
      "text": "My first experience buying shoes online turns sore after all the excitement and extra wait . Shoes reached me in about double the time promised , I have been wearing Nike shoes from last 25 years and these are the flattest shoe with almost no cushion.. so I am not even sure if these are original Nike shoes..",
      "rating": 1.0,
      "verified": true,
      "author": "Jitendra Sharma",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Comfortable Fit and Great for Walking",
      "text": "I really like the fit and comfort of the Nike shoe, I actually have two pairs, one for walking and treadmill running and one for just casual wear. Very happy with the purchase and will buy again as these wear out over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Quality!",
      "text": "I’m just going to give them 5 stars. I’m not the one wearing them, but my fiancé says they’re very comfortable. He wanted them so he’s have something a bit more breath-able for golfing this summer. I think the fabric quality feels and looks great. And he says they fit true to size. So I think they’re a win!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethenny",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Comfortable and seems very durable....",
      "text": "My 12-year old son and I chose this shoe for his basic school shoe. He was always tearing holes in the traditional mesh body trainers with his daily wear, so we chose this shoe on a recommendation that it would be much more durable. Fingers crossed it works! So far he loves the shoe - super comfortable and easy to wear!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie Jullienne ",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Lightweight and breathable",
      "text": "Breathable and Definitely not a heavy shoe which is what i was looking for",
      "rating": 5.0,
      "verified": true,
      "author": "Mom",
      "helpful_votes": 0,
      "publication_date": 20200312
    }
  ],
  "product_meta": {
    "title": "Nike Men's Flex Experience Rn 8 Track & Field Shoes, Multicolour (Gunsmoke/University Red/Vast Grey 000), 6 UK",
    "description": "Sneakers Nike Nike flex experience RN 8 AJ5900-003.",
    "rating": 4,
    "feature_bullets": [
      "Outer Material: Synthetic",
      "Inner Material: Manmade",
      "Sole: EVA",
      "Closure: Lace-Up",
      "Shoe Width: Medium"
    ],
    "specifications": {
      "Package Dimensions": "41.2 x 26.4 x 17.2 cm; 243.81 Grams",
      "Date First Available": "25 April 2019",
      "Manufacturer": "Nike",
      "ASIN": "B07H84PGM1",
      "Item model number": "AJ5900",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Track & Field Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 51.11
  }
}