{
  "website_summaries": [
    {
      "verdict": "This durable model’s pull-out drawers are a fantastic way to entertain and save space when the party’s over, and with so many styles available, it’s easy to find one you’ll appreciate.",
      "pros": [
        "Available in multiple shapes",
        "Includes a pair of built-in drawers for storing 4 serving utensils and additional snacks",
        "Bamboo construction",
        "Nonslip pads on underside"
      ],
      "cons": [
        "A little on the small side"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cheese Board. Charcuterie Board. It is very nice!!",
      "text": "We had a special birthday in our family. You know, one of those which end in \"0\"! I decided to try my hand at putting together a Charcuterie Board, Cheese Tray, Nibbles for the food table. This Bamboo Board was certainly the centerpiece of my table. What I liked---the indent on two of the corners to hold small bowls for mustard or mayo, the indents around the sides for crackers, etc. But my favorite part was the slide-out drawer with four utensils compatible with the theme. I thought the table looked nice. I learned a lot! And I am very glad I added this piece to my entertaining collection!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 17,
      "publication_date": 20180829
    },
    {
      "title": "Good idea, needs quality control",
      "text": "I like the product, it is functional and pretty. However, it isn't polished, and you run the risk of getting splinters every time you open the drawer, or touch the edges. Also, the two ceramic bowls are fragile, and the edges break off quickly. We have now had the product for less than three months, and it has cracked in two. This is most likely because I washed it after using it. Either way, the product has now fallen apart, and its two ceramic bowls have chipped. No heavy usage, just some happy hour snacks, but no longer useable. A good idea, but poorly executed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bethesda Shopper",
      "helpful_votes": 8,
      "publication_date": 20181029
    },
    {
      "title": "great quality and love that everything is intact",
      "text": "bought it as a bridal shower gift and even had it engraved. great quality and love that everything is intact. got so many compliments that i'll be ordering a couple for my own house.",
      "rating": 5.0,
      "verified": true,
      "author": "Addis Mom",
      "helpful_votes": 8,
      "publication_date": 20171019
    },
    {
      "title": "Satisfaction guaranteed.",
      "text": "I bought this as a gift for my aunt. When I go to her house, she always serves cheese and crackers with different cheese dips, etc. so I figured this would be perfect. I saw her open it, and it looks great! Have not used it yet, but I’m sure she is looking forward to it. The seller/company seems to really care about their product and your satisfaction with it. I received a few follow up emails asking about how I liked the product and how to properly use and wash the board. They really want you to be happy with it! I would definitely recommend this particular brand/seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190716
    },
    {
      "title": "Really nice classy gift",
      "text": "It’s a really nice board. Good bamboo quality like it says. It comes with two small round sauce bawls, and it has a separate draw with cheese knives. I like how it has nice tray sides so you can stack crackers, cheese or whatever you like neatly, which was the whole purpose of me buying it. It definitely looks classy for parties or any events. I might by another one for my self. And yes, it is worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Maya L.",
      "helpful_votes": 4,
      "publication_date": 20181029
    },
    {
      "title": "Great Housewarming Gift",
      "text": "Amazon has a zillion cheese boards to sift through and it is worth your time to hunt. So many variations. This one was exactly what I needed and a good price. Well built, packed well so curved dishes and board arrived in perfect condition. Great house warming gift for a dear friend!",
      "rating": 5.0,
      "verified": true,
      "author": "R.Kimmel",
      "helpful_votes": 4,
      "publication_date": 20181123
    },
    {
      "title": "A Cheese Board with awesome looks, sturdy, good size and great value!",
      "text": "This Cheese Board was exactly what we were looking to purchase. We will use this cheese board for small cheese, grapes, & wine parties in our home for house guests and friends. It attractive, just the correct size for us and very durable. It’s everything we expected from info on Amazon. We love ours!",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin L. Willis",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Beautiful Board but Packaging could be better",
      "text": "When I received the box it looked like someone had opened the entire thing, put it back together, and used packing tape to seal it up again. Wouldn't be something I'd want to turn over as a gift with the way it looks. Opening the box, everything was in a plastic wrap. It appears that the entire bamboo board and ceramic dishes are there, however at this time I don't want to open the shrink wrap because we are in the process of moving. From what I can see of the board it looks very nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Jsimpson9813",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Made in China quality",
      "text": "So, it looks nice when you pull it out of the box, but the chalk board doesn't fit into the allotted space--totally mismatched. Ruined my holiday entertaining plans, because who wants cheap junk on show with guests? Nothing worse than paying a premium price for Made in China quality. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Victoria Thomas",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "High quality - multifunctional - excellent gift to yourself or others!",
      "text": "This cheese board is the answer to one of my big entertaining problems - I never had the proper place to put crackers when I served cheese. This piece is ingenious. I also never need to worry about lost little cheese knifes in the kitchen drawer again! Classic bamboo, looks like wood, cleans easily. Quality, heavy piece. We put cheeses and grapes on top, crackers on three sides, pepperoni slices on the fourth side and mustards in the dishes. It's just perfect. Would strongly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Selective buyer",
      "helpful_votes": 3,
      "publication_date": 20171030
    },
    {
      "title": "Looking for an affordable, adorable cheese board, look no further.",
      "text": "I received my board in one day! I entertained the next day and recieved many compliments. I bought the one with the heart shaped bowls. It's adorable, functional and the drawer/knives are so very helpful. The board itself is good quality. I'm very pleased with this purchase. I plan on buying 2 more for holiday gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Scar Larson",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "B-day Gift for Wife",
      "text": "She loves it! We do a lot of entertaining and we were missing something that was functional with the spread but also aesthetically pleasing. It’s a cool conversation piece as well.",
      "rating": 5.0,
      "verified": true,
      "author": "rob",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Perfect!!",
      "text": "This is my first official cheeseboard as an adult and I love it. I’ve used it for two Thanksgiving parties now, it’s the perfect size and I LOVE the hidden utensil drawer. I had many compliments on it and can’t believe how affordable it was. As a side note, I remember the picture showing an engraving, but mine came blank, which was fine with me either way.",
      "rating": 5.0,
      "verified": true,
      "author": "chasema",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great Engagement Party Gift!",
      "text": "Our family members love entertaining with this and I think it made a really smart gift option instead of getting something that's just going to sit around collecting dust. I might even get one for us!",
      "rating": 5.0,
      "verified": true,
      "author": "alliecat",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Great product",
      "text": "I returned my item as the slate piece did not fit, but I also changed my mind. Otherwise it was an adorable serving dish!",
      "rating": 5.0,
      "verified": true,
      "author": "K Pratt",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Very clever and useful.",
      "text": "The cheese board is very nice due to the built in accessories and the slide out drawer. If I were to make one improvement, I would have one of the cracker slots rounded and one square; there are more square crackers than round ones. Board looks good and always gets a nice comment about it's functionality.",
      "rating": 4.0,
      "verified": true,
      "author": "Confidential",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Great gift idea",
      "text": "Alot heavier than I was expecting, but it is a great idea for anyone who loves wine and cheese, or hosts alot of gatherings/parties.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Chic and convenient!",
      "text": "I love that this cheese platter tucks the utensils inside the board! It makes it so easy to move the platter from place to place during a party and you always have all the \"pieces\" with you. :-) Great looking too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Great looking and quality cheese/cracker board",
      "text": "Gave as a gift and well worth the price. Good quality and loved the pull out sections and the included utensils.",
      "rating": 5.0,
      "verified": true,
      "author": "Nanette",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Beautiful item",
      "text": "This was a gift for my daughter and she loves it. The pullout drawer with the stored utensils is a great space saving idea. Lovely gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Chemau",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Well made",
      "text": "Bought this as a gift but may keep it myself. Well made with lots of room for displaying various items. Fast delivery. I received it a few days sooner than expected. Will definitely purchase again if I need another housewarming gift.",
      "rating": 5.0,
      "verified": true,
      "author": "glipp",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Received many compliments!",
      "text": "I am very pleased with my tray! I like the size, the organized trays for crackers and the place for containers in the corners. It cleaned up nicely. I will use my own containers for the corners as these are small. I got many compliments the first time I used.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Great product!",
      "text": "i bought this for a anniversary gift for my husband and it is great!! Good quality, and perfect with the little ramekins for jam or nuts. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Great Cheese Board",
      "text": "I had my first Wine and Cheese Party last Saturday, and thought hey, let me buy a Cheese Board. I was truly pleased with the cheese board that I purchased and would definitely recommend the board. I will probably get another one in the near future so that I can have a larger assortment of cheeses displayed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "I am happy for the set of bamboo",
      "text": "I am happy for the set of bamboo, is a great and elegant product. I got for my daughter wedding. I recommend highly",
      "rating": 5.0,
      "verified": true,
      "author": "Adela R.",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Great gift idea!",
      "text": "I bought this as a gift for my daughter for Christmas, she absolutely loves it. It’s nice and sturdy, and the cheese knives can be stored in their own little drawer. This cheeseboard does it all, overall, it’s a solid investment for your entertaining needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Very nice quality...lovely gift!",
      "text": "Very nice large solid well made cheese board...my mother in law loves it!...proud to give at Xmas!",
      "rating": 5.0,
      "verified": true,
      "author": "GoMom6",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Great sized cheeseboard",
      "text": "The cheeseboard is a great size for multiple cheeses and crackers to be displayed. I love that the knives/serving tools are in the attached drawer. The board was very easy to clean. I’d definitely purchase this as a gift in the future",
      "rating": 5.0,
      "verified": true,
      "author": "Dbake",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Great gift",
      "text": "I got this for my daughter because she entertains a lot and loves to make a board with meat, cheese, fruit, nuts, etc. The 4 stars was only because it would have been better if it was a little bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "missmiss92065",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Great gift!",
      "text": "I bought this for a house warming gift. I haven’t given it to them yet but It looks great and I am thinking of getting myself one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "LOVE this product!",
      "text": "I bought this as a gift to myself, I LOVE it!",
      "rating": 5.0,
      "verified": true,
      "author": "Knarans",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Sturdy, good solid weight",
      "text": "This was more than expected, very sturdy. As described but better! Totally got my money worth.",
      "rating": 5.0,
      "verified": true,
      "author": "Mystiquemm225 ",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "It’s sturdy",
      "text": "Love it. It’s great to receive friends in your house!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181105
    },
    {
      "title": "Looks great.",
      "text": "This is a gift. I am very pleased with the quality. I am sure the couple that is getting it will be over joyed.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ratajczak",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Makes for a great gift !",
      "text": "I bought this gift for a friends birthday and she was absolutely pleased! Board was intact and packaging was sturdy. Do not let the outside of the box fool you, inside is a quality item definitely considering getting one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Perfect for a house-warming gift",
      "text": "Perfect for a spread, and I love the hidden utensils! The dishes are smaller than I expected, but they are a perfect size for dips. It's very nice looking, as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Farlie",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Great product at a great price!",
      "text": "This was a gift for a friend. She absolutely loved it. Great product and great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Total Package",
      "helpful_votes": 2,
      "publication_date": 20180926
    },
    {
      "title": "Wonderful Gift",
      "text": "My mother-in-law LOVES it. It is well made and looks wonderful. Recommend highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dia K",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Great product! Fast shipping!",
      "text": "Awesome product! Got it the same day I ordered it! Very nice quality, highly recommend! The picture was a wonderful charcuterie tray my wife whipped up last night for a party.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Seery",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "My mom absolutely loved it, said it was good quality and enjoyed ...",
      "text": "Bought this as a gift for Mother’s Day. My mom absolutely loved it, said it was good quality and enjoyed the drawer to put the serving utensils in.",
      "rating": 5.0,
      "verified": true,
      "author": "Danni Marsh",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Very unique and beautiful.",
      "text": "Got this cheeseboard as a gift at Christmas and loved it so much purchased one for a shower gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "She was very happy and excited",
      "text": "This was given to a family member for a bridal shower gift. She was very happy and excited, she does a lot of entertaining. Even the rest of the guests thought it was really neat and had asked me where I found it. Needless to say it was a hit.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Great Gift",
      "text": "I purchased this for a gift as a family member expressed love for one I have. It looks great! Great quality, great price! I really think she will love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Cute charcuterie board!",
      "text": "This is a perfectly sized charcuterie board for a small dinner party or book club. I love the little pull outs too. It gives it a special look.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "The implement drawer is a nice way to keep them handy",
      "text": "We bought it as a wedding gift for a 2nd marriage with well established home. The implement drawer is a nice way to keep them handy. It was sent direct, and as yet, have not heard back from the couple.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "It will make a great gift & someday I may even get one for myself",
      "text": "It is much bigger than I imagined which is great & I love the ramekins that come with it!!! It looks just lovely & I will be giving it as a wedding shower present. I would recommend it to anyone. It came very quickly after I ordered it.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Beautiful!",
      "text": "Bought this as a VDay gift for my boyfriend! It looks absolutely beautiful and I’m excited to gift it to him. It’s reasonably priced and perfect for any charcuterie lover!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Solis",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Worked great for a party with friends!",
      "text": "I've only used this for one get together with friends, but I would recommend it based on that. Love the little pullout drawer for knives. I would recommend purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Goodness",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Great quality cutting board",
      "text": "I buy various bamboo cutting boards from different suppliers for my business. These are the only boards as of yet that I've ordered that are of great quality at an affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "This and That Solutions",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Hope she'll love it.",
      "text": "One of the bowls was chipped. I contacted the seller & it was replaced promptly. This is going to be a house warming/Christmas hostess gift. Hope she'll love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Stanton",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Cracker wells also a great improvement over other serving boards",
      "text": "Tonight was my first opportunity to entertain since I made this purchase. All of my guests were very impressed. The two ceramic cups were a profound benefit over charcuterie boards that do not have anything similar. Cracker wells also a great improvement over other serving boards. If the board was just three or four inches wider it would seem less crowded. Tight fit to serve Brie, Pate, and 2 cheeses. Absolutely very happy with the purchase. Super happy I purchased two to give one as a Christmas gift to my sister who is a professional caterer. She will love it",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Anthony",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "I don't even like cheese :)",
      "text": "I love pretending to be fancy with this cheese board when I host. Looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Soanie LaPaix",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Great appetizer display for cheeses and more.",
      "text": "I love everything about this product. I am able to mix and match so many different items and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Loved It!",
      "text": "I bought this as a hostess gift She loved it! She really liked the drawer for the utensils I think I will buy one for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Arrived without any problems and is exactly as described",
      "text": "Received the cutting board and it arrived as expected,no problems with packing. I am looking forward to using it soon. It would make a lovely gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Rockies325",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Great Housewarming gift!",
      "text": "Good quality will hold up well to the test of time of handled with normal care.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Mom loved it!",
      "text": "My mom loved this serving patter. It was in great condition when It arrived. The knives could be a little better quality, but the defiantly get the job done!",
      "rating": 5.0,
      "verified": true,
      "author": "jessie keschl",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "It’s a little heavy but beautiful to gift",
      "text": "It’s the perfect gift for my sister who loves to host people at her house. She loves cheese and wine so I knew she would appreciate the utensils it comes with!",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Great gift !",
      "text": "Great ! I gave as a Christmas gift to my host family and they loved ! It’s really beautiful, good size and bowls were well protected! They tried in same day that I gave to them .",
      "rating": 5.0,
      "verified": true,
      "author": "camila inacio ",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Great gift idea!",
      "text": "Bought this as a gift for my mom and she loved it! Loved the hidden drawers with the utensils!",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "bought as a gift",
      "text": "I bought it as a gift and they love it. It arrived on time no problems. There's really not much else I can say about it since I personally have not used it.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa s",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Nice board",
      "text": "I loved this board! Unfortunately it was smaller than expected so I had to return.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee07",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "My niece brought this beautiful cheeseboard out with a lovely cheese /fruit display",
      "text": "My niece brought this beautiful cheeseboard out with a lovely cheese /fruit display. I liked it so much I bought myself and my daughter one. It’s solidly made with a “secret” drawer to keep all the utensils in and a grooved out area for crackers to fit in without sliding around.. the perfect size to make a light snack or appetizer for a crowd. I would definitely recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Day",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Great deal all around",
      "text": "I bought this as a gift dor my sisters birthday and she loved it. Its durable and looks great and it's the perfect size. Will be buying myself one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Dharmendra Sharma",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Excellent cheeseboard!",
      "text": "I was very pleased with the cheeseboard. It arrived on time and in perfect condition. It was the perfect size, nice design and has great features. I highly recommend this company and cheeseboard!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon R.",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Super cute and can’t wait to give it to my ...",
      "text": "Super cute and can’t wait to give it to my mom for mother’s day! The email that came behind the purchase was very good customer service. I will let you know if there are any issues!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Happy with my purchase...",
      "text": "Very nice looking cheese board with cutlery set. Just used it at a party and received many compliments on the cheese display. Good size and seems well made. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan O'Brien",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Very nice quality and would order again!!!",
      "text": "This cheese board is a Christmas gift but I opened it to check it out before wrapping and think it will be a big hit! The serving tools are stored in a sliding drawer in the board itself and has a really nice look. The board itself is good quality and love the two little bowls built into it. Plus it shipped quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Watt",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "The perfect gift",
      "text": "Bought this as a mother's day present , it was the perfect gift. Reasonably priced , easy to use to serve or as a cutting board. Be careful not to put the utensils in the dishwasher!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Great Gift",
      "text": "Given as a gift for my sister who loves to entertain. Perfect with the knives included.",
      "rating": 5.0,
      "verified": true,
      "author": "JD's Oma",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "This is a nice quality product",
      "text": "This is a nice quality product! Ordered it for a wedding gift and my niece and husband and they loved it! I almost didn't send it to them because I loved it too!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia Biagini",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Slate board does not fit into the wood board",
      "text": "Slate board does not fit into the wood board. Ridiculously.",
      "rating": 1.0,
      "verified": true,
      "author": "Vlad",
      "helpful_votes": 2,
      "publication_date": 20181120
    },
    {
      "title": "Low quality - gave as a gift was embarassed",
      "text": "bought this because it looked like it would be an awesome gift. When the person opened it, I was embarrassed. the quality was really low and the wood was separating.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "It's a very nice board, with a drawer for knives that come with it, makes a very nice gift!",
      "text": "It was a gift for my daughter's birthday. I don't think she has used it yet, she liked it. I thought it was very, durable, would buy again for another gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Durability",
      "text": "I bought this as a gift for my sister, she loved it. It’s perfect for wine night",
      "rating": 5.0,
      "verified": true,
      "author": "Vaneen Marsden",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Good quality and would recommend",
      "text": "Board is exactly as described. Good quality and would recommend. The only thing I wish is that the surface space was larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Csbuck",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Perfect",
      "text": "Ice set and just what I wanted for a gift for a friend who has done so much for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Theresa Mahecha",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "No box just bubble wrap",
      "text": "Great product so far surface Holds up but disappointed in shipping and giving as a gift because it came in no box just bubble wrap. So person receiving had no idea what it was.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin M.",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Incredible product",
      "text": "Love this cheese board! Came as described and the drawer works as it stated. I was excited when I found this item for such a good price too. Excited to use when hosting the next party!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Jaime",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Perfect gift!",
      "text": "Got this as a christmas present for my father. It came in great condition, can’t wait to gift it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Low Quality",
      "text": "Very flimsy. The board arrived snapped in half with chips around the edges. Thanks to amazon amazing customer service I was refunded, but won’t buy again. The slate board comes off and cracks very easily.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "The ramekins are great for mixed nuts too",
      "text": "I ordered this as a gift for my mother, as she entertains frequently. She loves it! Prior, she was putting out two trays for a meat and cheese platter, and she's thrilled she only has to use this now. The ramekins are great for mixed nuts too. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Love this product!",
      "text": "I bought this gift as a housewarming gift for a friend and it was perfect!! I highly recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "tiana",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "but I am sure they will be very pleased with them",
      "text": "The cheese boards are very pleasing to the eye. I bought them as gifts so once I hear back from the recipients I will pass on their opinions, but I am sure they will be very pleased with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra L. Kaelber",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Perfect",
      "text": "I love it, very strong and a great gift for my family!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Lawrence",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Great Item!",
      "text": "Fantastic! The utensils are a great idea as are the two small bowels. Would have bought again, but the price went up $20.00 Back to Overstock.",
      "rating": 5.0,
      "verified": true,
      "author": "Les Marinko",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Cheese board",
      "text": "I bought this for a house warming gift.The design is perfect and the quality excellant.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary McNeil",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Its Awesome -Exceed Expectation",
      "text": "I bought it for my wife and its exceed my expectation. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Irfan",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Great quality",
      "text": "Very good quality and perfect 5 year anniversary supplement gift.",
      "rating": 5.0,
      "verified": true,
      "author": "joshio herrera",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "It looks good but won't be used until November",
      "text": "I received the board. It looks good but won't be used until November. So far I'm pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Renate Hodges",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Five Stars",
      "text": "Prompt service and concern for customer satisfaction. Lovely, quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "... this as a gift for a friend and she LOVED it! Since receiving it she has used it ...",
      "text": "Got this as a gift for a friend and she LOVED it! Since receiving it she has used it a few times for gatherings and gets rave reviews from her quests. This is a great gift! Tempted to get one for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "ETS",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "The Packing",
      "text": "I really like it when I opened up the package. It is actually what I thought it was going to be. Thank you I am waiting to use it for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Bellamy",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "High Quality",
      "text": "Great high-quality product. The board itself is perfect size, sturdy and the overall construction of it is great. Cutlery is also nice and for the price this is a great set. Stores nicely as everything is contained with-in board. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Nic J Gowanlock",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "This cheese board is so wonderful! It is well made and incredibly useful",
      "text": "This cheese board is so wonderful! It is well made and incredibly useful. I've used it twice since I received it and it always gets comments on the shnazzy knife drawer. Well made. Love the indents for crackers and the ramekins for dips or nuts.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa J.S. Pedersen",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "great value",
      "text": "bought as a gift for a friend - was great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Sibyl Cherian",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Well made and extremely functional.",
      "text": "The cheese board is fantastic!!! My wife loves it! We recently entertained a group of friends and everyone was asking where we purchased the board from. The cheese slicing tools are great and the workmanship on the board is done to perfection. It is a very well made product that should last for many years, if not for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Great design with an area for crackers and bowls for ...",
      "text": "Great design with an area for crackers and bowls for dips, etc. Love the pull-out tray with cheese and meat implements!! Would highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DC Adams",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Buy it",
      "text": "Amazing product, fast shipping, great quality!!! It realy is an amazing item get yours when you can",
      "rating": 5.0,
      "verified": true,
      "author": "Starlord198991",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Three Stars",
      "text": "Product is good, but, too heavy to use it made for.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180104
    }
  ],
  "product_meta": {
    "title": "iBambooMart Slate Cheese Board Set w/Cutlery Set, 2 Bowl, Soap Stone Chalk, Bamboo Charcuterie Platter Wood Board, Perfect gift for Christmas, Mom, Mothers, Women, Men Housewarming, Wedding, Birthday",
    "rating": 4.6,
    "feature_bullets": [
      "ORGANIC BAMBOO cheese board includes slideout drawer with various slicing, spreading & serving knives set, it elegantly designed two round slot, which keeps the ramekin securely in place. two white 1.85\"h ceramic bowl additionally gives extra features to serve sauces, nuts, olives and condiments. it has drip premium grooves that hold crackers, breads, dried meats and chips.",
      "DRAWER Seamlessly pull out from the cheeseboard, it has slotted drawer storage block with accessories holder which is simply stunning and perfect to hold serving utensils and spreaders inside.stainless-steel blades comes with easy grip bamboo handle. it's non-slippery pads prevent from moving the charcuterie boards while opening the drawer or cutting cheese",
      "ALL-NATURAL, ECO-FRIENDLY each of our modern wooden organic cheese boards and serving fork, tools are crafted with food safe, 100% quality bamboo. this makes them better for every food prep need from slicing cheese, chopping fruit, serve up appetizers,snack or making bread. it also works great as cheese plate set or wooden cheese serving set and can be used in any travel to the beach for a picnic. use the wide blade knife for thinly cutting hard cheese like asiago or parmesan.",
      "BETTER FOOD PRESENTATION: our handmade bamboo wood cheese boards and knife set has conveniently edged kit for presenting crackers and breads. elegant grain finish and warm bambu color make it simply amazing. we happy to offer lifetime warranty if you do not love this product for any reason we will refund you your entire purchase. also be sure to pick up our large slate cheese cutting board set with knives set.",
      "FANCY GIFT ideas for client, men, wife, wedding couple, engagement, friendship, mommy, mother's day, teacher husband, dad, father's day, bridal shower, groom, hostess, son, daughter, housewarming gifts for new home, birthday presents, anniversary, entertaining, thanksgiving, christmas holiday gifts. it's awesome presentation piece for family gatherings, wine parties & more. it surely go beyond your expectations. it's very practical, beautiful, useful & complete cheese party essentials tray."
    ],
    "specifications": {
      "Product Dimensions": "12.99 x 12.99 x 1.42 inches",
      "Item Weight": "2.99 pounds",
      "Manufacturer": "iBambooMart",
      "ASIN": "B07HFFRLCL",
      "Item model number": "SLATE CHEESE BOARD",
      "Customer Reviews": "4.6 out of 5 stars438 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#124,403 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 6, 2017"
    },
    "categories": [
      "Serving Utensils",
      "Home & Kitchen",
      "Flatware",
      "Cheese Servers",
      "Dining & Entertaining",
      "Kitchen & Dining"
    ],
    "price": 39.99
  }
}