{
  "website_summaries": [
    {
      "verdict": "This large e-reader can be comfortably held in your left or right hand and has intuitive controls.",
      "pros": [
        "The 20-cm e-ink screen is crisp and easy on the eyes with its adjustable backlight",
        "Customers love the unusual design, which makes this e-reader comfortable for one-handed use",
        "Features 8GB of storage and a fully waterproof design"
      ],
      "cons": [
        "The built-in memory is not expandable",
        "High price tag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "DO NOT BUY FROM TRIPLENET PRICING INC",
      "text": "DO NOT BUY FROM TRIPLENET PRICING INC, i have dead pixel on my kobo screen, TRIPLENET PRICING INC didn't answer to my massages, amazon didnt do any thing about that , DO NOT BUY FROM TRIPLENET PRICING INC.",
      "rating": 1.0,
      "verified": true,
      "author": "Meni Edri",
      "helpful_votes": 15,
      "publication_date": 20191101
    },
    {
      "title": "A good product for reading",
      "text": "My first e-reader ever purchased. Amazing light weight and perfect screen size for reading. Response time is quite slow which makes highlighting difficult to control. I hope Kobo will add more built in Chinese input method in later OS release like pinyin or cangjie for looking up Chinese book from the store. The current zhuyin CN input method is not common in region outside Taiwan. But these has little to impact reading experience so I still find it a good product for reading. Quite a lot of people like to read comic books because of the big monitor, true but I just find the saturation is too low to make a good contrast in the lines and shades.",
      "rating": 4.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 4,
      "publication_date": 20190718
    },
    {
      "title": "Kobo Forma froze!",
      "text": "I started out enjoying the kobo forma ereader. It is a nice size and easy to use. I though that the on/off switch was difficult to push though. I was very disappointed when the kobo screen simply froze. It would not charge, turn off...there was nothing that I could do to unfreeze it. It happened during the 30 day return period so I sent it back. I was reluctant to try another as I was disappointed in the overall quality. I just bought a refurbished kindle oasis. I receive it in a few days. I am hoping this will work better.",
      "rating": 2.0,
      "verified": true,
      "author": "Tessa",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Opened box shown to be not \"Brand New\"",
      "text": "This product is amazing as I've seen reviews on it and am excited to use it, however the way it was delivered to me shows that it was not in fact brand new but was already opened and sloppily put together in the box.Thankfully everything was there but I do not like the company advertising it as \"Brand New\" when it clearly wasn't,.You are better off find another seller.",
      "rating": 2.0,
      "verified": true,
      "author": "marco cardenas",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Kobo is a great reader.",
      "text": "I love this reader. Now I can read all of my Sony books.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Camille Mcnamara",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Kobo forma",
      "text": "Nice big screen but comparing with the kindle with bluetooth capable. It's price",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Kindle vs kobo",
      "text": "If kindle is available in 8 inch size , I will happy swap it . Kindle is much more user friendly. E books are definitely much cheaper on kindle.",
      "rating": 5.0,
      "verified": true,
      "author": "vemuru sudhakar prasad",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "the best ereader",
      "text": "works perfect, you can read perfect, is the best reader",
      "rating": 5.0,
      "verified": true,
      "author": "An jungran",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "TL;DR I am in love, except for one glitch",
      "text": "Pros: * Very light. * Great size. * Comfortable to hold. * The back is rubbery plastic (less \"premium\" than a Kindle Oasis) but it actually feels great, and it probably helps with weight. * Reads standard formats (EPUB, PDF) directly. Cons / suggestions: * I'm not sure if it's only my device, but there is a bit of fairly noticeable unevenness in the lighting, on the edge where the handle/buttons are. * If you disable showing your current book on the \"sleeping\" screen, it would be great to have some \"stock\" images (as on Kindle). * Sleeves are little hard to find so far (and the slightly unusual dimension ratio makes standard tablet sleeves not a good fit).",
      "rating": 4.0,
      "verified": false,
      "author": "Manu C.",
      "helpful_votes": 23,
      "publication_date": 20181118
    },
    {
      "title": "Major Software Glitch",
      "text": "There is a software malfunction that it will get to about 85% battery and then suddenly drain out to 1% - Kobo did replace mine and now the second one does it. They've been aware of this and are unable to fix it, yet continue to sell this product. Unfortunately I've been a customer for years ( up until now a happy one) so all my ebooks are Kobo. Save yourself a headache and buy a Kindle.",
      "rating": 1.0,
      "verified": false,
      "author": "Julia E",
      "helpful_votes": 8,
      "publication_date": 20190316
    },
    {
      "title": "Best ereader I have ever owned period",
      "text": "I did not buy this through Amazon but through Kobo. I have own the Oasis, Oasis2, Voyage etc. but the FORMA is light, great screen, adjusting light for no blue light exposure. 8 inch screen. It has Overdrive so I can borrow directly from my library and Pocket for articles. Best ereader I have ever owned period",
      "rating": 5.0,
      "verified": false,
      "author": "ngcpeeper",
      "helpful_votes": 4,
      "publication_date": 20190408
    },
    {
      "title": "The Kindle Killer !",
      "text": "So So happy with my kobo Forma! It's everything I wanted my kindle oasis to be ! It doesn't feel akward in the hand like the kindle oasis. The shape of it is so much better it even feels lighter when holding! Lots more space and the customization options are cool (wish there were more)",
      "rating": 5.0,
      "verified": false,
      "author": "MelsReviews",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "Frustrating to use due to tilt sensors",
      "text": "It’s a solid eReader but I can’t give it more than two stars for one INCREDIBLY frustrating flaw. It’s orientation sensor is very inconsistent and any small movement while reading can cause it to change orientation. Even after locking orientation in portrait mode, any slight tilt while reading can cause it to flip the screen upside down. So I either have to hold it PERFECTLY still the entire time or get interrupted every few minutes with a bout of frantic waving to get the screen back to its correct orientation. It’s such a simple software patch. Just disable screen rotation completely. I’d stay away from this product.",
      "rating": 2.0,
      "verified": false,
      "author": "Dion C",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Converted to Kobo",
      "text": "I was looking for a device like the Oasis, I tried later version of this Kindle model (10th) and it was too slippery and made me press the page-turning buttons by accident. The Kobo Forma is amazing. Easier to use than a kindle invites reading with the progress statistics and the screensaver is the cover of the current book. Holding it is very comfortable. The price here a lot higher than on the Kobo website, buy it from kobo.com. Excellent device.",
      "rating": 5.0,
      "verified": false,
      "author": "Jorge Roque",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Landscape view locks and too big for jeans back pocket",
      "text": "My Kobo Aura One screen died after 2.5 yrs. I liked the product a lot but decided to try the Forma. A big mistake. The major problem is screen orientation and freezing in landscape mode. I tried landscape a few times and the last time I couldn't get back to portrait and couldn't even get to Home. After a week of remaining frozen I am returning the Forma to Walmart and ordering the Aura One Limited Edition from Kobo. I also don't like that it won't fit in the back pocket of my jeans. The Aura One did.",
      "rating": 2.0,
      "verified": false,
      "author": "T Reynolds",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "The best ereader by far!",
      "text": "As of June 2019, all issues are resolved and this is absolutely the best, largest and most responsive ereader out there. Fantastic lighting, light weight, large size and screen rotation are amazing. Don't hesitate!",
      "rating": 5.0,
      "verified": false,
      "author": "Glenn MacKenzie",
      "helpful_votes": 0,
      "publication_date": 20190623
    }
  ],
  "product_meta": {
    "title": "Kobo Forma",
    "description": "Our largest, most lightweight screen meets our newest innovative design resulting in the utmost in reading comfort. Kobo Forma is where the future of reading takes shape. Our most comfortable eReader yet with ergonomic, lightweight, on-hand design 8.0 HD Carta E Ink touchscreen is our largest screen, delivering a print-quality reading experience Page-turn buttons and landscape reading mode ComfortLight PRO reduces blue-light exposure for more comfortable nighttime reading Waterproof with HZO Protection Borrow public library books with built-in Overdrive Store up to 6,000 eBooks with 8GB of memory Get weeks of battery life on a single charge. Meets requirements of IPX8 rating. Waterproof for up to 60 minutes in up to 2 metres of water. Dependent on library participation, available through most public libraries in North America, United Kingdom, Australia and New Zealand. eBook availability will vary based on library. Dependent on individual usage",
    "rating": 4.1,
    "feature_bullets": [
      "Brand New in box. The product ships with all relevant accessories"
    ],
    "specifications": {
      "Product Dimensions": "3.35 x 6.97 x 6.3 inches",
      "Item Weight": "6.9 ounces",
      "Manufacturer": "Kobo",
      "ASIN": "B07J5BXRWM",
      "Item model number": "N782-KU-BK-K-EP",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.1 out of 5 stars209 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#94,991 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 29, 2018"
    },
    "categories": [
      "eBook Readers & Accessories",
      "Electronics",
      "eBook Readers"
    ],
    "price": ""
  }
}