{
  "website_summaries": [
    {
      "verdict": "The Pulse with Noonlight is ideal for civilian users because of its range, accuracy, and stopping power.",
      "pros": [
        "Connects to an app that notifies law enforcement after deployment",
        "Ideal 15-foot range for self-defense.Target is immobilized for at least 30 seconds",
        "GPS provides location of deployment",
        "Battery power is monitored constantly",
        "Built-in laser for accuracy"
      ],
      "cons": [
        "Package may not contain a sticky holster",
        "Battery life is limited and replacement packs are expensive"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Taser Taser Taser!!",
      "text": "Seems like a great product. Bought one for the wife. Compact size and easy to conceal. Tested the noonlight feature. After pulling the trigger on the taser my wife received a text message within 5 seconds and then a call with in 10 seconds. Great piece of mind just hope she never has to use it!",
      "rating": 5.0,
      "verified": true,
      "author": "John W Harrison",
      "helpful_votes": 49,
      "publication_date": 20190203
    },
    {
      "title": "Excellent piece. Great functionality.",
      "text": "Excellent piece of equipment! Zaps some sense into the perp each and every time!",
      "rating": 5.0,
      "verified": true,
      "author": "LPO158",
      "helpful_votes": 14,
      "publication_date": 20190429
    },
    {
      "title": "i like it",
      "text": "super easy to use for a man or a woman, and a great choice instead of a fire arm, the laser and light work well, seems like something that could save your life without taking another persons.",
      "rating": 5.0,
      "verified": true,
      "author": "Don C.",
      "helpful_votes": 10,
      "publication_date": 20190709
    },
    {
      "title": "I feel safe",
      "text": "My wife Maggie is more than happy with her new Taser Pulse I bought her so I'm feeling happy for her!!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 11,
      "publication_date": 20190514
    },
    {
      "title": "Lacks truth in advertising.",
      "text": "Disappointed as there was no sticky holster with the Taser Pulse I received.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark H",
      "helpful_votes": 6,
      "publication_date": 20181031
    },
    {
      "title": "Nice product",
      "text": "Nice product just wished the noonlight was free with it but it’s a month fee app. You can still use the taser without it but I got it to have the police call in case. Still very nice light and was easy to get it together and easy to use..",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Good for civilian use",
      "text": "A good Taser, A bit pricey, Safety position should be labeled for the NOVICE, Nice weight & good grip.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron E.",
      "helpful_votes": 2,
      "publication_date": 20191031
    },
    {
      "title": "Useful",
      "text": "A must have for personal safety from a civilian point of view.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191112
    },
    {
      "title": "Nice equipment",
      "text": "Very nice self defense tool. Easy to use no problems so far",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Howery",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Battery doesn’t last 2 years as they say.",
      "text": "It’s been 9 months since I bought it and the battery no longer works I’ve never even used it once.",
      "rating": 5.0,
      "verified": true,
      "author": "Aj",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "There junk and tazer doesn’t stand behind them.",
      "text": "Quit working after the close for return date. Is not three months old. I thought taxer stood behind there products. Retired police officer and carried a tazer for years never had a problem but I guess the civilian tazer is junk. And they don’t stand behind them. Gives Amazon a black eye for selling junk.",
      "rating": 1.0,
      "verified": true,
      "author": "John Brown",
      "helpful_votes": 11,
      "publication_date": 20200317
    },
    {
      "title": "Flawed Battery Compartment",
      "text": "There is a gap were the battery is trying to escape, considering lives depend on this I would not recommend it with the flawed battery compartment. That is with the battery compartment fully on.",
      "rating": 1.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 10,
      "publication_date": 20191210
    },
    {
      "title": "Easy to learn how to use.",
      "text": "Easy to learn how to use, minor difficulties figuring out how to remove cartridges from both the gun and the cartridge casings. YouTube videos help. Got the holster to have it strapped to my waistband for easy access.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "The blue one was much cheaper but functionally the same.",
      "text": "The blue one was much cheaper. My wife likes having it in the house when I’m away.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris B.",
      "helpful_votes": 3,
      "publication_date": 20191217
    },
    {
      "title": "Is it a toy. Is it tiny...... Yes",
      "text": "Looks and feels like a toy not sure who would look at it and say huh but great product non the less will do the job",
      "rating": 2.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20201117
    },
    {
      "title": "Battery life is pathetic",
      "text": "I bought one of these for myself and one for the wife. They are supposed to be good for so many uses and so many years of shelf life. After owning ours for 6 months and never having deployed them, both had dead battery packs. Bought replacement battery packs (at $40/ea) and they were dead within 6 months as well. This would be a great system if it was reliable.",
      "rating": 1.0,
      "verified": false,
      "author": "Johnny in Texas",
      "helpful_votes": 20,
      "publication_date": 20190807
    },
    {
      "title": "Really?",
      "text": "It looks like a gun and might get you shot. The civilian models have poor durability. Sufficient probe spread for a reasonable chance of incapacitation occurs at 8 to 15 feet. It is can be difficult to justify the use of potentially deadly force when the threat is 8 feet away. Also, they can hit their head when falling or they might have a heart problem.",
      "rating": 1.0,
      "verified": false,
      "author": "Paul F.",
      "helpful_votes": 6,
      "publication_date": 20190718
    },
    {
      "title": "Flawed battery and marginal customer service by Axon",
      "text": "Overall a nice unit...but there’s a flaw in the battery pak design and pigtail length. Had to return the unit to Taser after about a month due to battery failures. New batteries draining or indicating drained after two days with no usage. Taser was unable to replicate the issue. If you call, they only assist by phone if you are a law enforcement agency. Otherwise, you are transferred to the “consumer” department and in my experience, the phone is not answered....be prepared to send an email back and forth.",
      "rating": 2.0,
      "verified": false,
      "author": "Red Zone",
      "helpful_votes": 3,
      "publication_date": 20200420
    }
  ],
  "product_meta": {
    "title": "Taser Pulse + Self-Defense Tool with Noonlight Mobile Integration, Black",
    "description": "The TASER Pulse+ brings safety in today's connected world.\n\nUsing the same less-lethal technology as law enforcement, the Pulse+ integrates with your mobile phone via the Noonlight mobile app to contact emergency dispatch when fired. No fumbling for the phone or freezing up in fear. Pull the trigger and help is on the way. \nWeighing in at just 8 ounces, this high-tech, intuitively-designed device is revolutionizing the self-defense market. You're fast-paced and connected. Your self-defense tool should be too. \n\n- Comfortable to carry and use – Shaved safeties and angled sights make the Pulse ergonomic to carry and draw\n- Fast on target – Built-in LASER helps you aim quickly\n- Effective up close – Contact stun capabilities help at close range or in the event of a missed shot\n- Easy to maintain – The battery indicator ensures you know your tool will work when you need it. The Pulse+ uses easy-to-replace CR123 batteries, which are carried by many retail stores.\n- Legal to own, legal to carry – No license needed in most states",
    "rating": 4.6,
    "feature_bullets": [
      "TASER SELF-DEFENSE X NOONLIGHT MOBILE INTEGRATION: Noonlight dispatches law enforcement to the user’s location immediately if the trigger is pulled, using real-time GPS tracking provided through the Noonlight mobile application",
      "STAY CONNECTED: As long as the Pulse+ device is within range of your mobile phone, it will be connected - even if the safety is in the on position",
      "OPTIMIZED SELF-DEFENSE RANGE – 15-foot shooting distance, ideal for most defensive situations",
      "POWERFUL PROTECTION ENSURES A SAFE ESCAPE: 30-second muscular override gives you time to get away, and we'll replace your taser device free of charge. read more about our safe escape product replacement guarantee",
      "EASY TO MAINTAIN: the battery indicator ensures you know your tool will work when you need it. The Pulse+ uses easy-to-replace CR123 batteries, which are carried by many retail stores",
      "Mobile Requirements:iOS app supports iOS 8+ and Android app supports API level 19+ (Android 4.4 KitKat)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "8.11 x 7.8 x 2.48 inches; 8 Ounces",
      "Item model number": "39064",
      "Department": "Unisex-adult",
      "Batteries": "2 CR123A batteries required. (included)",
      "Date First Available": "January 3, 2017",
      "Manufacturer": "Axon Enterprises",
      "ASIN": "B07JQ2DW97",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Personal Defense Equipment",
      "Sports & Fitness",
      "Tactical & Personal Defense",
      "Stun Guns",
      "Hunting & Fishing"
    ],
    "price": ""
  }
}