{
  "website_summaries": [
    {
      "verdict": "This feature-packed gap organizer is bound to appeal to tech-junkies, but the fact that it's designed to fit the passenger seat might be a deal breaker for some.",
      "pros": [
        "Dual USB charging ports and 2 lighter sockets take care of smart devices and electronics",
        "Features an LED car battery voltage monitor",
        "Storage portion has enough space for phones, wallets, and cards",
        "PU leather coupled with red stitching is an attractive finish"
      ],
      "cons": [
        "Only comes with 1 organizer",
        "Made specifically for the passenger seat",
        "Might not be stable if your console is lower than your seats"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I threw it away",
      "text": "I didnt even bother trying to return it. its made of hard plastic, no padding, scrapes against your fine wood dash, takes up way too much room. honestly dont waste your money. I used it for literally less than 4 hours and got so mad I smashed it in the parking lot and then threw it away. Not a good sign when it causes actual rage..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20190320
    },
    {
      "title": "This is a very fun item. In the light it charges from it's ...",
      "text": "This is a very fun item. In the light it charges from it's solar cell. At night when there has been any vibration it will start blinking in random patterns. It automatically shuts off after 2 minutes of no vibrations. I put this on the back of my bicycle. I don't think the police in the USA would like it on a car or truck since it could be distracting to other drivers. On my bicycle it works good bt keep moving a little or it shuts off and someone behind may not see you. I like it to take 5 minutes or 10 before shutting back down.",
      "rating": 4.0,
      "verified": true,
      "author": "James D. Stack",
      "helpful_votes": 3,
      "publication_date": 20180416
    },
    {
      "title": "Organizer with dual chargers",
      "text": "It fits great in between the drivers seat. It's not intrusive and the dual chargers help so much. The small container works great to hold things such as change or keys.",
      "rating": 5.0,
      "verified": true,
      "author": "Ebony",
      "helpful_votes": 5,
      "publication_date": 20181221
    },
    {
      "title": "Measure, measure, measure",
      "text": "Don't go by the pictures. Measure the length, shorter than it looked. The part that goes between the seats barely came below the seat line & so the entire thing tips and slides out. Maybe because it does not fit as shown the wiring sticks out & looks terrible. I returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "scubaesp",
      "helpful_votes": 2,
      "publication_date": 20190613
    },
    {
      "title": "Cheap, unreliable, not worth it",
      "text": "I had this installed on my MB C300 for 3 months. when i inspected it after that time, the leather wrapping has come off (maybe because of too much heat), and the cigarette lighter connector has rusted. I just threw it in the dumpster",
      "rating": 1.0,
      "verified": true,
      "author": "Nunz",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Almost perfect.",
      "text": "Everything worked as described. But the part that extends down between seat and console needs to be longer. First time I used it, it slid out onto passenger floor. I got it wedged on better and stayed during 2nd drive. But I still love it. So nice to have 2 USB and 2 cigarette lighter style outlets and to be able to turn them on and off with the 2 switches next to the outlets. Also nice to have the narrow slot so you don't lose cards in the bottom of the larger storage slot.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Nice concept cheaply made",
      "text": "The material around the plastic is glued and not glued well. It's separating from sitting in a hot car. The slots are difficult to get things out of because they are so thin. If a credit card of pen falls in you have to dump it out to get it back - which fell between my seats which is why I bought this to prevent that. :)",
      "rating": 2.0,
      "verified": true,
      "author": "M. R.",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Good product",
      "text": "The interspaces would have been better served bye some kind of soft lining. You know everybody that buys this is putting their phone in and the design of this is inherently making the phone screen rub against hard plastic. Other than that the thing is great",
      "rating": 4.0,
      "verified": true,
      "author": "spazzychalk",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Cheap Quality",
      "text": "I returned this item. The look looks nice, but when you receive it you can tell that it is made out of poor quality. It's a hard plastic that will scratch your seat after some wear and tear. I wasn't satisfied with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Lvnlocs4life",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "It's durable and easy to clean.",
      "text": "Excellent doesn't take that much room the storage is excellent but charging is easier than you can believe excellent will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Nelson",
      "helpful_votes": 3,
      "publication_date": 20181216
    },
    {
      "title": "My ebrake is kind of in the way",
      "text": "It works well if put on the passenger side as my ebrake is right where it sits on the driver side. Besides that it works really well! Only downside is if your phone has a case, it wont fit in the spot it shows on the picture because its too bulky",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan White",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Zero durability",
      "text": "Had it for about 6 months when the faux leather wrapping came off. It also is not switchable on/off at the base level only at the two outlet level so if it is plugged into an always on socket it will always be using power even if the two switched outlets are off.",
      "rating": 2.0,
      "verified": true,
      "author": "RLopez",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Hard cased seat filler with chargers",
      "text": "Gift for my mom, she has been wanting one in this style, hard cased seat organizer. It doesnt slide around, or clasp like the previous one she had been using. 2 charging , and 2 usb charging ports with on/off switchs that light up. Not sure why you'd need an on/off switch, nice light up screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Snow Queen of Tech",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "PERFECT !!!!!!",
      "text": "I have a Softail Breakout and this bag fits perfectly above the headlight. It gives the front end a bolder look because it sits nicely on the forks. The length was perfect because it does not stick out wider than the forks....looks like it came with the bike....NICE BAG, GREAT PRICE !!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CARLOS J.",
      "helpful_votes": 2,
      "publication_date": 20161210
    },
    {
      "title": "This thing works and fits great",
      "text": "Zero complaints! This this is awesome to get more plugs and storage for your car and takes up minimal and unused space.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Too small",
      "text": "Disappointed in this item . Too small for the driver side . Does not cover the full length of the seat . Still leaves a big gap in between the seats in the console . Move it to the passenger side it works there . I would return this item I just don’t have the time to deal with it . Like the idea like the design but just poured execution . And the pictures are very deceiving buyer beware .",
      "rating": 2.0,
      "verified": true,
      "author": "joe martins",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Swipe left",
      "text": "Cheap garbage. The “leather” starts to peel off the plastic housing almost immediately. One redeeming quality, charges an iPhone XSMax fairly quickly.",
      "rating": 1.0,
      "verified": true,
      "author": "LURO",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Work's great.",
      "text": "I like how it went into seat. holds phone wallet nicely out of the was with quick access. Helps to hide alot of wires too. better.",
      "rating": 4.0,
      "verified": true,
      "author": "pattywagon",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "It didn’t work for me, but might work for you",
      "text": "Descent quality however, it doesn’t stay in place and only fits on the passenger side. Perhaps it will work better with a different model car, mine is a 2012 VW Passat.",
      "rating": 3.0,
      "verified": true,
      "author": "Dori Estes",
      "helpful_votes": 2,
      "publication_date": 20190205
    },
    {
      "title": "In a Suburban the product needs to be at least two inches longer",
      "text": "I would like to see this product two inches longer",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse mendietta",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Interfers with hand brake",
      "text": "The product is sturdy but it interfers with my hand brake . I am not impressed at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Perfect!!!!!!",
      "text": "When I ordered this I kind of second-guess that after I ordered it but once I got it I was tickled to death it keeps everything in this phone charger the tablet charge my iPod charge all in the car ready to go and it keeps it all with nice little spot I love it",
      "rating": 5.0,
      "verified": true,
      "author": "misty shepphard",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Good",
      "text": "It is a very good auxiliar tool, but in my case don't fit in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Mauricio De Fat Gazel",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Nice extension for storage",
      "text": "So far works well with car. Like the extra space it provides to store stuff. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ds",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "FALLING APART!",
      "text": "THE HEAT IN MY CAR IS CAUSING THE BOARDER TO PEAL OFF....NOT HAPPY!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Mercedes Mckinnon",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Bulky",
      "text": "Does not fit all cars. Would not fit my Jeep SUV.",
      "rating": 1.0,
      "verified": true,
      "author": "nikkib",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Love it!",
      "text": "I got this for my car and loved it so much that I ordered another one for my son!",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Nugent",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Not what i expected",
      "text": "The ribbing around it fell off after some time in my car. Its ok, i won't by it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa M. Figueroa",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Construction is poor the product works good",
      "text": "The cover around the base did not hold up it was just glued on and it came apart really easy. What I like was your able to charge several devices at one time",
      "rating": 1.0,
      "verified": true,
      "author": "HERTICENE DAVIS",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "They should be built into cars/trucks.",
      "text": "Love the switch on the USB port. So clever. Just what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael P. Tomancik",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Only partially functional.",
      "text": "The voltage display doesnt work, the on off switches don't work. At least the 2 USB ports work. It does fit in between my seat and console in a BMW X5. I do like the pockets for my ipod and phone.",
      "rating": 2.0,
      "verified": true,
      "author": "david arnold ",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Don't waste your money!",
      "text": "Power wire shorts out if closed on. Leather fabric separated from plastic within a week of use. Very cheap product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Great add on for my car",
      "text": "Item is great, only lacks something to keep it in place. Anyone that has found a solution to this please let me know.. i still havent found one lol",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Ok as long as you know what u need out of it",
      "text": "Charges fast but its kinda bulky and gets in the way of fastening the seatbelt.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Clark",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "good product,but not for every one.",
      "text": "did not like having on passager side ,and item is a little small.",
      "rating": 3.0,
      "verified": true,
      "author": "ramwing",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Very convenient",
      "text": "Fits well between the front seat and glove box in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Takes up too much seat space",
      "text": "We returned this. The unit was too wide, taking up too much seat space.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven  Buckel",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Ok",
      "text": "Was stiff, didn’t sit down in crease like wanted, but works",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Five Stars",
      "text": "Good quality Leather, sturdy and holds alot for a small bag.. !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Dombroski",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Pretty large. Straps too short for large forks so ...",
      "text": "Decent bag. Pretty large. Straps too short for large forks so mounted to luggage rack.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Dummy",
      "helpful_votes": 3,
      "publication_date": 20160815
    }
  ],
  "product_meta": {
    "title": "AUTOLOVER Car Seat Gap Filler, C15 Premium PU Leather Car Seat Side Pocket Organizer Car Seat Storage Organize with 2 USB Chargers and 2 Lighters",
    "rating": 3.9,
    "feature_bullets": [
      "【Fit for Most Cars】 The Car Seat Pocket Organizer fits car seat gap space between 1-2 inch (2.0-5.0cm). As long as you have suitable space between the seat and console, they will work perfectly. They just slid between seat and center console. BEFORE BUYING, PLEASE MEASURE THE THE DISTANCE BETWEEN YOUR SEAT AND CONSOLE TO MAKE SURE THIS CAR SEAT POCKET BETTER FIT YOUR CAR.",
      "【Premium design】 This Car Seat Pocket Adopts the high-quality ABS and PU leather material, non-toxic, odorless, and eco-friendly. Plus, you can store your daily small items orderly with its larger capacity. such as smartphones, wallet, cigarette, keys, hand cream, coins, gloves, credit cards, documents, pens maps, sunglasses, etc. Get your small parts well organized and easy to abtain when driving.",
      "【Dual USB Charging Ports & Dual Car Lighters】Provides 2 USB charging ports(5V/2.1A) and 2 car lighters with independent switch control, meaning the car's original cigarette lighter socket can be split into 2 sockets to power 2 devices simultaneously (maximum 80W power output),like the hand-held electric fan, tablet, cell phone, and other low-power devices, rather convenient.",
      "【Real-time voltage monitor】Digital LED display shows the car battery voltage. You can know the real-time car condition intuitively and clearly through the color of digital. Orange data show voltage is lower than the normal value. Blue data show voltage is normal. Red data show voltage is higher.When the car battery voltage is abnormal, the LED screen will flash and prompt you.",
      "【Intelligent protection】The built-in intelligent master-control chip provides short-circuit protection, overcharge protection, over-voltage protection, and over-temperature protection to better protect your car and your safety. Our Car Seat Gap Filler come with a one-year professional warranty and 60 days money-back guarantee! If in any case you are not 100% satisfied with your purchase, please do not hesitate to contact us right away and our customer service team will be at hand to work on any"
    ],
    "specifications": {
      "Manufacturer": "AUTOLOVER",
      "Brand": "AUTOLOVER",
      "Item Weight": "1.32 pounds",
      "Package Dimensions": "11.26 x 5.98 x 3.78 inches",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "299495301-HSX-US",
      "ASIN": "B07J41FG5F",
      "Customer Reviews": "3.9 out of 5 stars153 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#346,789 in Automotive",
      "Date First Available": "October 7, 2018"
    },
    "categories": [
      "Accessories",
      "Interior Accessories",
      "Automotive Parts & Accessories",
      "Seat Covers & Accessories",
      "Automotive"
    ],
    "price": ""
  }
}