{
  "website_summaries": [
    {
      "verdict": "The simplicity, long-lasting battery, and perfectly safe design of the Junior make it the perfect way to introduce 3D printing to young creators.",
      "pros": [
        "No external heated parts",
        "safe for kids age 6+",
        "Rechargeable",
        "Long battery life",
        "Comfortable ergonomic grip",
        "Extremely simple to operate",
        "Includes 3 filament colors"
      ],
      "cons": [
        "Older kids will prefer a more advanced 3D printing pen"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fun tech tool!",
      "text": "My 10 year old son absolutely loved this and received it as a Christmas gift. It is easy to use and very fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Mburkell0602 ",
      "helpful_votes": 17,
      "publication_date": 20181225
    },
    {
      "title": "Pen and provided filament incompatible.",
      "text": "Our product is not working, we fed in the included filament and its stuck in the cylinder inside, it won't go forward or backward. Maybe the filaments fault and not thr pen, but the filament is stuck way or another and the pen will not work if there is no feed. We tried to take apart via the directions. My daughter had the pen for older kids with no problems so this goes back and we will get a new one of the other style.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 7,
      "publication_date": 20191229
    },
    {
      "title": "Great, artistic fun",
      "text": "A good size for little hands, works well and is super fun. A great way to entertain and encourage your little artist or engineer.",
      "rating": 5.0,
      "verified": true,
      "author": "selket16",
      "helpful_votes": 14,
      "publication_date": 20181213
    },
    {
      "title": "It worked only for 2 months",
      "text": "I bought the pen for my 9 years old daughter. It was working good in first month, but first the battery got problem and took too long for charging and less time kept the charge and finally the filament which was the same brand stuck in it and after only 2 months of use stopped working. I don't recommend this pen and it's waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190722
    },
    {
      "title": "Good quality for a good price",
      "text": "Very well made. Easy to use and heats quickly. Fun and fits well in my kids hand. Great quality for the price. Good toy for creative minds.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Kuykendall",
      "helpful_votes": 15,
      "publication_date": 20181207
    },
    {
      "title": "Awesome 3D pen for the price!",
      "text": "Great 3D pen for the price! My 11 year old thought it was awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "AZ Shopper",
      "helpful_votes": 8,
      "publication_date": 20181221
    },
    {
      "title": "TRASH",
      "text": "This is the 3rd 3D pen we have tried and it is by far the worst. The first two were different brands that broke with two days of receiving, but we were able to get a couple hours of use from each before those died. THIS PEN is worse: we were able to get it to charge fully, but it wouldn’t feed the filament, which means we got exactly ZERO minutes of use. It has been returned. My poor kid still doesn’t have a 3D pen, which is all he wanted for his birthday! Are they ANY on the market that will last longer than zero to two days?!",
      "rating": 1.0,
      "verified": true,
      "author": "K.",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Disappointed in its performance.",
      "text": "I bought this as a gift for a family member. We put the exact filament that it came with into the pen and it wouldn’t even get hot enough to push out the filament. It just got stuck in the pen and plugged up the end of it. Ended up throwing it away. I wouldn’t get another one",
      "rating": 1.0,
      "verified": true,
      "author": "Chase Vines",
      "helpful_votes": 2,
      "publication_date": 20200225
    },
    {
      "title": "Must have!!!",
      "text": "Finally got to use this to fix my husband's glasses. The arm broke off and this little thing is a gem! Got it for my son since it lower temp, but I may have to keep it and just let him use it. This is a must have for repairs around the house. I'm sure my son will have fun with it too. This was super easy to operate, the instructions were clear and easy to understand. Definitely recommend buying this!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Crawn",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great 3d Pen!",
      "text": "This came in time for my 6 years old Birthday! Super easy to use for him. Im happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Holmes",
      "helpful_votes": 3,
      "publication_date": 20200102
    },
    {
      "title": "Good first 3D pen",
      "text": "Good option for a first 3D pen. Drawing is definitely a learning curve &, requires skill and practice but, it burns and comes out even & comes with quite a bit of filament. It has easy to operate buttons but requires a plug in block for the usb.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin B.",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Save your money - product and customer service not great!",
      "text": "This pen would be great if it worked. Used the right filament (theirs) followed the directions from the manufacturer when the item stopped working and it still doesnt work. Asked the manufacturer to send a new one under the warranty and dealing with customer service is brutal. Been three weeks since I started this process and its still not resolved. Save your money or buy from someone else who has pride in their product and a willingness to help their customers.",
      "rating": 1.0,
      "verified": true,
      "author": "Be-ezy",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great for beginners",
      "text": "Our 11yo loves it. He's already made a come things with it. Great for beginners. When the top is hot to melt the plastic to create, it not exactly to hot tip touch which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Chandra",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "DID NOT WORK OUT OF THE BOX.",
      "text": "What a piece of crap. Opened The Christmas present today with my super excited 9 year. We charged it and read the instruction manual together. The thing never worked. The green light light up and it just made a whirring sound and the filament NEVER came out of the pen. Amazon refunded the money, but the letdown from my kid can’t be refunded. What a waste. Don’t count of this one if you’re giving it for a gift...",
      "rating": 1.0,
      "verified": true,
      "author": "Allison E Watkins",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "if you want to be exact with creations don't buy this product.",
      "text": "it is a good value for the money but is difficult to to make exact things. if you want it to look perfect than you should not buy it, but if you are buying it for a child than it is defiantly with it. my son loves to mess around with it and make cool things with it. but I would recommend only between ages 6-14 because bound those ages would like it as much as a kid would in my opinion. but overall it was a fun toy and good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Leo Aluise",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great product",
      "text": "My second purchase from MYNT3D. I got this lower powered one for my grandson. Great quality! Easy to use and good to promote creativity.",
      "rating": 5.0,
      "verified": true,
      "author": "mark woeppel",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Broke within the first five minutes of using it",
      "text": "It fed the first color through fine, we switched colors and now it won’t feed anything through. It also won’t turn on the light just flickers. Haven’t had time to contact seller yet , I will keep you posted on how they react.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 2,
      "publication_date": 20191230
    },
    {
      "title": "Broke twice",
      "text": "This worked for about a couple hours. Was really fun to use until it got clogged and stopped working. I returned it and got another one for my daughter thinking it was just a glitch but the same thing happened with the second one. It’s too bad because it was fun for the couple hours that it worked. Oh",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Zeoli",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Do not recommend.",
      "text": "When the device isn’t jammed it produces thin plastic strings that just clump into a mess. I would not recommend - save yourself the frustration. You will spend more time taking the device apart to unclog than your child gets to use it. I wondered why there was a page in the directions that talked about how to take nozzle apart without any context. Learned fast why the instructions existed.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd K",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great for a creative kid.",
      "text": "Great little toy for my boy. He likes creating stories and drawing and this toy is a fun tone for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Dieterle",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Broke in 2 minutes of use :/",
      "text": "Might have been a fluke. I saw some good reviews and was super excited to have my niece try this. It worked for about 30 seconds, and then stopped working. After an hour of troubleshooting, we gave up. I would saw take this review with a grain of salt. It might have been a faulty model. But nonetheless, if you can potentially save yourself the hassle, and get a higher quality pen, I'd recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "beth stuart",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "decent",
      "text": "Good but it broke and we had to return it",
      "rating": 3.0,
      "verified": true,
      "author": "tiffany",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Cloggs",
      "text": "So disappointed in product. Worked for less than 15 minutes. Used the filament that came with it, and it clogged in minutes. Tried to unclog and couldn’t get it. However, sent back and got a different version, not the junior. And the new version works good",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Edwards",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Never worked as expected",
      "text": "This 3D never worked quite right. It would randomly shut off during use. Also it doesn't hold a charge for very long at all. I bought this for my daughter for Christmas, now it is May and she can no longer use it because the battery will not hold a charge. Other than all the problems the pin was safe to use. It didn't get to hot nor was the filament.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda M",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Did not work out of the box.",
      "text": "Hello, I am a school librarian and run a Makerspace for the past 4 years. I have used 4 different 3-d pens and this pen did not work out of the box. We have bought several other products from this company without a problem. The filament does not pass through the extruder.",
      "rating": 1.0,
      "verified": true,
      "author": "Felix Soto",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Brand new and doesnt work",
      "text": "Purchased as a Christmas gift for my granddaughter. After charging overnight and following instructions we never could get it to work. I believe the heating element isnt working but never was able to confirm with a representative because no one answered the phone. Luckily the amazon representative issued a full refund. Unfortunately, my granddaughter is super bummed....she was looking forward to trying it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara K Leland",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Broke within 5 minutes",
      "text": "The pen broke within 5 minutes. Amazon refunded me and I returned this. It's a cool concept, but the product is unfortunately junk.",
      "rating": 1.0,
      "verified": true,
      "author": "matt nelson",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Disappointing",
      "text": "The product is of mild value. My granddaughter is 7 and has experience with a 3D printer and found the pen to be fairly easy to use. The products she created were easily accomplished but not great quality. She quickly lost interest. I would not recommend this pen to others.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great, kid-friendly product!",
      "text": "My four and seven year old girls find this pen easy to use. I find it safe, simple and a great value. When purchasing filament be sure to buy the right kind! Low temperature filament is required. Read the directions before purchasing more filament.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle G.",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Only Works for A Little Bit",
      "text": "The pen did not fit any other plastic, of the indicated size, except what was shipped with it. So my son was loving it then unable to use it. Once we were able to get the specific brand sent to us, when used, it jammed the pen. Now it’s useless 👎🏽😟",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Broke first use, I couldn’t fix it!",
      "text": "It worked for about one minute then stopped! I tried many different ways to get it to start again, but nothing! I purchased this 5 months ago so I am sure I can’t return it now. I had a very disappointed little boy when it wouldn’t work!",
      "rating": 1.0,
      "verified": true,
      "author": "GSLover",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Bad product and bad service",
      "text": "This produce does not work at all and hard to use. I got this item for my daughter. After one day, the ink does not come out. I returned it and waiting for the replacement. But I still have not received the new one. It has been a month now. I think I should call amazon to get an update status or request a refund",
      "rating": 1.0,
      "verified": true,
      "author": "kim Ha Trieu",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Wast of money",
      "text": "I got this pen for my 7 year old for Christmas. The pen worked fine untill the filament ran out witch was in one day. We order new filament but realized the tip is clogged, we took the pen apart to clean it and try and unclog it with a sewing needle but still cant get it unclogged and it wont work. Spent to much money all for a disappointed kid.",
      "rating": 1.0,
      "verified": true,
      "author": "Savannah rioux",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Not worth the money",
      "text": "Very disappointed that my daughter only got to use this a couple times and it broke. The color seemed to be jammed and would no longer come out. She used it twice and didn’t even get to complete her project.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan B",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Buy the black one instead",
      "text": "Had to return for a different type. Wouldn't work after first couple uses.",
      "rating": 3.0,
      "verified": true,
      "author": "SilverSunflower",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Fun, Quality Product",
      "text": "My kids have loved playing with this! It works well, is sturdy and fun. I would buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Brent Schow",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Very disappointed",
      "text": "Pen stopped working after first use. When we reloaded with second color it stopped working and the color thread wouldn’t feed through the tip of the pen.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim Fedt",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Doesn't work",
      "text": "I put the filament in and it worked for like 5 minutes. When I changed the filament nothing would come out anymore. It just seemed to chew the filament up and not melt it. Waste of Money. I immediately packed it up and sent it back",
      "rating": 1.0,
      "verified": true,
      "author": "Olindo P.",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Look for another 3d pen",
      "text": "It works great for the first few days then the tip gets gummed up. Plastic starts coming out the sides of the tip. Had to send it back.",
      "rating": 1.0,
      "verified": true,
      "author": "CRT",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Enjoyable for any age!",
      "text": "A gift for my grandson. He was very pleased to receive. Also ordered extra feed for pen",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Grandson loved this.",
      "text": "Grandson is very creative and was excited to use this.",
      "rating": 5.0,
      "verified": true,
      "author": "John C. Roberts",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Not worth it",
      "text": "Terrible. Got jammed in one use and stopped working. A waste of $60.",
      "rating": 1.0,
      "verified": true,
      "author": "vanessa",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Disappointed",
      "text": "It got clogged/stuck with first filament (ordered 2 of them) Disappointing for the kids-could not get them to work afterwards",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Craft for kid",
      "text": "Kid love these we even them for project for home schooling",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Kids loved them",
      "text": "These were a gift that got rave reviews from the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "B.M.PATTERSON",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Useless! Don't buy!!!!",
      "text": "We purchased them as Christmas presents for our boys and both clogged in less then 10 mins. The pens were useless, plus I returned them back to the buyer & I still haven't recieved my refund. It's been more then 2 weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Worked for less then 10 seconds",
      "text": "Follow the exact instructions for set up, once charged and first filament inserted it literally worked for 10 seconds then nothing else would come through almost like it’s jammed.",
      "rating": 1.0,
      "verified": true,
      "author": "Wren",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Did Not Work!!!",
      "text": "The pen did not work. Put the filament in and nothing happened. Getting a refund ASAP!",
      "rating": 1.0,
      "verified": true,
      "author": "Janet & Corey Eaton",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Crap product",
      "text": "Worked one time, clogged up, haven’t used since because you can’t get plastic out.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy ",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Trash",
      "text": "Item immediately stopped up and wouldn't work. dont waste your money",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly Strong",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Not that good",
      "text": "Bought this for my son. He was able to use it a few days but then started to overheat.",
      "rating": 2.0,
      "verified": true,
      "author": "SRJ",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Perfect gift",
      "text": "Bought this as a Christmas gift for my little cousin and I know he’ll love it! I can’t wait to see what he makes :)",
      "rating": 5.0,
      "verified": true,
      "author": "caguiar",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "The item doesn’t work!",
      "text": "I ordered this product as a Christmas Gift for my son and it doesn’t work. It say that the red light will turn green in order to use it and 20 minutes later the light is still red.",
      "rating": 1.0,
      "verified": true,
      "author": "cristina",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Broke first time used.",
      "text": "The tip got clogged and broke first time we used it. Ridiculous. Would like to have a replacement sent.",
      "rating": 1.0,
      "verified": true,
      "author": "Willaim C Hayden Jr",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Hard to use",
      "text": "I got this for my year old. Its is kinda hard to use. the button that feeds the string through gets stuck some times.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica Terrell",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Sucks",
      "text": "Worked for couple hours, kids loved it. Then it's almost like the filament got stuck and started barely moving threw the tip.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Poorly made",
      "text": "This was the second pen I got like this and neither one worked for more than a day.",
      "rating": 1.0,
      "verified": true,
      "author": "BigKen64",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Would not recommend",
      "text": "This was our second one ordered as the first one didn’t work. Well, this one doesn’t work either. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Perfect for 7 year old.",
      "text": "Great gift idea for my 7 year old son for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Do not buy!",
      "text": "Overly priced for what comes and it does not even work at all. False description.",
      "rating": 1.0,
      "verified": true,
      "author": "Asma",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great buy",
      "text": "I got this for my kid for the holidays. He loves it! Great price and toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Mordy H",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "This pen does not work!!!",
      "text": "I have purchased two of these. Neither one of them worked!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "The first color got stuck",
      "text": "It was a waste of money! Pen did not work like it was supposed to.",
      "rating": 1.0,
      "verified": true,
      "author": "Alicia Lucero",
      "helpful_votes": 0,
      "publication_date": 20200207
    }
  ],
  "product_meta": {
    "title": "MYNT3D Junior 3D Pen for Kids, Uses Eco-Friendly Low Temperature 1.75mm PCL Plastic (NOT Compatible with ABS/PLA)",
    "description": "Introducing the MYNT3D Junior, finally a safe low temperature 3D pen suitable for younger kids. Watch their imagination come alive in the form of PCL plastic. Can be used with any 1. 75mm PCL, however it is strongly recommended to use MYNT3D brand, as our PCL goes through a stringent quality assurance process, is free from impurities, and has a stable melting temperature tuned to the Junior 3D pen.",
    "rating": 3.4,
    "feature_bullets": [
      "Designed specifically for kids, with easy to grasp ergonomic design and low temperature nozzle that wont burn young hands",
      "Watch your young artists, architects or builders imagination grow off the paper in 3D",
      "Battery powered, charges with Micro USB (note: AC adapter not included) works with 1.75mm PCL filament (not compatible with ABS or PLA)",
      "Includes 3D pen, user manual, 3 rolls of MYNT3D PCL plastic, starter stencils and USB cable",
      "Your purchase is protected by a 1 year limited warranty that covers defects in manufacture"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.8 x 5 x 2.4 inches; 8.78 Ounces",
      "Item model number": "MP030-OG",
      "Date First Available": "November 1, 2018",
      "Manufacturer": "MYNT3D",
      "ASIN": "B07K42CTMM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "850751007069"
    },
    "categories": [
      "Industrial & Scientific",
      "3D Printing Pens",
      "Additive Manufacturing Products"
    ],
    "price": 39.99
  }
}