{
  "website_summaries": [
    {
      "verdict": "Lightweight boots that are easy to get on and off and offer all-day comfort.",
      "pros": [
        "Foam cushioning helps keep the weight down",
        "Molded foot bed keeps feet comfortable all day",
        "Single BOA closure system allows you to put them on and take them off in a hurry",
        "Lined with microfleece for extra warmth"
      ],
      "cons": [
        "May be too soft for intermediate or advanced snowboarders"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great fitting boot and easy to use!",
      "text": "I originally purchased a 10 because that is what I normally wear for a shoe but the 10.5 fit way better. This is an amazing boot for it's price and the BOA tightening strap makes it easy to snug up the boot!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20181220
    },
    {
      "title": "Believe it... they are all that and a bowl of grits",
      "text": "Dope dope dope dope dope dope dope... super light ... warm .. supportive... and the BOA system works great ... i wouldnt wear thick wool socks however the inner boot is very form fitting ... get some nice compression socks they are thin and keep you plenty warm ... also lace these puppies up tight and wear them around house for a few hours before your 1st use to break them in properly",
      "rating": 5.0,
      "verified": true,
      "author": "derek black",
      "helpful_votes": 3,
      "publication_date": 20190602
    },
    {
      "title": "Nice quality, runs small compared to other boots",
      "text": "Saw a great deal on these and decided to try them. My wife has a pair and loves them. They are very clearly a good quality boot. Generally I wear a size 11 sneaker, and size 10 Ride snowboard boots, but these were to small in a size 10.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan Frappier",
      "helpful_votes": 2,
      "publication_date": 20190305
    },
    {
      "title": "Great value and look good",
      "text": "Great for the price. Very lightweight and feet did not hurt the day after. They seem to be wide at the toes and a little short. I did order a size 11 and normally wear 10.5. I think they would fit a little bit better if I molded the inserts. I am very pleased with them.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Comfortable",
      "text": "I got these for my son . He works at a ski resort so he need a pair of boots he could wear all day and snowboard when he got breaks.. he loves them. he said they were super comfortable to wear all day",
      "rating": 4.0,
      "verified": true,
      "author": "Vegas Baby!!",
      "helpful_votes": 2,
      "publication_date": 20190318
    },
    {
      "title": "feel super good so far",
      "text": "had an older pair of 32s (lace up) - while those were the first boots to relieve me of the pain I felt after snowboarding, these boots feel so much comfier so far (still need to hit the mountain) - easier to get into (don't have to jam my heel in so hard), and the Boa tightening makes life so much easier (friends used to have to wait for me while I struggled to get old pair on and worked on tightening laces). And these look better as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Husband loves these! Used at Mount Snow!",
      "text": "Fit my husband perfectly. He’s a size 10.5/11 usually depending on what brand. Brand new just as described! Came in a brand new box and circular crank works perfectly to tighten up the boots. Amazing value & money well spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Bella",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Men Size 8.5 reg and had to half size up to 9",
      "text": "First ordered a size 8.5 because I thought I would be lucky (its what I wear in most shoes) BUT had to return for a half size up. Return process was easy and received the money quickly. Ordered the 9s and they fit great! toes are just slightly toughing the front but when they break in, I'm sure they'll be perfect to shred the gnar gnar. Can't wait to get on the mountain to try these out!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Powell",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Good boots. Not needed. Still no refund. No reason why.",
      "text": "I bought these for my son for his birthday. Seemed like good boots. A bit more money than his old ones. He said the boots he has \"still fit, and are broken in good.\"(I think his feet have finally stopped growing). I started a return. Took them to the Amazon location, scanned them in. January 10th. It is now January 26th. Still no refund, and no contact from Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Fits ok",
      "text": "Boots are great, fitting my be a little short by 1/2 number",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Warm, sturdy, and easy to adjust",
      "text": "These boots have been awesome so far. They fit well and they're extremely warm yet lightweight. No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Awesome deal",
      "text": "I got these boots for my BF and he absolutely loves them. He said they are extremely comfortable and he loves the way they look.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Satisfied",
      "text": "Use this boot for a snowboarding trip to Lake Tahoe, fit well, true to size, I am a size 10 in a regular shoe, did not do the heat molding interior. Shield the ice and snow well, no problems with leakage. Recommend, I am a intermediate snowboarder with 20 years",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Mendoza",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "A good choice",
      "text": "It's hard to be objective as those are my first boots for snowboarding. Quality is great. After a couple of intense days of riding they look like new. My girlfriend was using pair of ThirtyTwo boots for 7 years and they still in great condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgii",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Great Boots! Horrible Delivery Experience",
      "text": "Boots are great and my Brother loves them. The delivery was 4 days late from the guaranteed delivery date. Boots are awesome though!",
      "rating": 2.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Good but just go a size up",
      "text": "Too small so be sure to get an extra size up !",
      "rating": 3.0,
      "verified": true,
      "author": "Juan Torres",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Amazing Quality",
      "text": "I always love ThirtyTwo products and these do not disappoint! Best boots I've ever worn and would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Bk",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Soft beginner",
      "text": "Im a boot fitter and this boot is 199.95 at stores and u get wayy better customer service, this boot is an entry level single boa boot. Which means its soft and very playful good for beginners or park riders who dont like laces.",
      "rating": 2.0,
      "verified": false,
      "author": "Justin",
      "helpful_votes": 5,
      "publication_date": 20190123
    }
  ],
  "product_meta": {
    "title": "THIRTY TWO 32 STW BOA Snowboard Boots Mens",
    "description": "Dial in your perfect fit with STW BOA. Great for first time riders or intermediates aspiring to get to the next level. Constructed with the same Overmold Technology found on the TM2 the STW will last all winter long. With an Evolution Foam Outsole and Comfort Fit Liner your feet will be thanking you after a long day of riding. \n\n * 1:1 Lasting \n * Boa Coiler Lacing System\n * Evolution Foam Outsole\n * 3D Molded Tongue\n * Overmold\n * Integrated Internal Lacing\n * Independent Eyestay\n * Grip & Rip Heel Hold\n * Flex: 3/10\n * Fit: Comfort",
    "rating": 4.4,
    "feature_bullets": [
      "Textile and Synthetic",
      "Comfort fit liner",
      "Boa coiler lacing system",
      "Evolution foam outsole",
      "3D molded tongue",
      "Overmold protection"
    ],
    "specifications": {
      "Product Dimensions": "1 x 1 x 1 inches; 1.94 Pounds",
      "Item model number": "8105000324",
      "Department": "Mens",
      "Date First Available": "December 1, 2014",
      "Manufacturer": "Thirty Two",
      "ASIN": "B07K2XKPXN",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Winter Sports",
      "Men",
      "Boots",
      "Snowboarding",
      "Outdoor Recreation",
      "Sports & Outdoors"
    ],
    "price": 199.95
  }
}