{
  "website_summaries": [
    {
      "verdict": "A few minor quirks aside, you won't find a better planer in this price range, making it the best value for your money.",
      "pros": [
        "Stands out for its precise cuts and long-lasting durability"
      ],
      "cons": [
        "The outfeed table lid is placed in a suboptimal position"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I really have been impressed by this planer, I ...",
      "text": "I really have been impressed by this planer, I own a woodworking company. [...] and I use it for most of my furniture. I have used a Delta before, and also a craftsman, and while the Delta edged this one in quality by a little, the performance was the same. The Craftsman could not even compare to this machine, oh and a tip, feed your boards into the machine at an angle, they will be straight every time.",
      "rating": 5.0,
      "verified": true,
      "author": "charlie jordan",
      "helpful_votes": 205,
      "publication_date": 20161216
    },
    {
      "title": "Fantastic purchase, and even more fantastic in action !!",
      "text": "What can i say- I just started a small business, and some of it involves sanding, a lot... so i bought this... let me tell you.. this is the best little beast, will plane just about any type of wood short of petrified. It was a breeze to set up, and even easier to operate, is shaved off a total of 8 hrs per day of sanding- now it give me more time to start on other task for my business.. I would highly recommend this to anyone wanting to make their wood look professionally done.",
      "rating": 5.0,
      "verified": true,
      "author": "sybot",
      "helpful_votes": 18,
      "publication_date": 20171006
    },
    {
      "title": "Very glad I opted for WEN over more expensive brands.",
      "text": "I just finished up ~600bd/ft of 12\" width pine. The planer performed as expected. I had the best results going around .1\" per pass. I had some snipe, but it was easily controlled by angling the board slightly. The wood finished easily with one pass of 120 grit and one pass of 220 grit. I did not have significant tearout issues. I'm still using the original blades, but I'll probably go ahead and pro-actively replace them before my next project. It's a ton of extra work to start with rough cut lumber, but I saved a ton of money doing it myself and I was able to use some really nice local wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Kranyec",
      "helpful_votes": 4,
      "publication_date": 20170809
    },
    {
      "title": "Very nice planer",
      "text": "I have used this planer now several times now. It works great! Leaves my wood a smooth as I can expect, and has some nice features as well. The price is right compared to other brands. I would recommend for the hobbyist woodworker. Not really sure how well it would hold up if used for commercial work, but I think it would do ok. It seems to be durable enough that it could handle being bounced around in a truck a little bit, as long as it had some protection for it, wasn't being bounced around a lot, or in an abusive manner. I really like using mine in my wood shop.",
      "rating": 4.0,
      "verified": true,
      "author": "Father",
      "helpful_votes": 3,
      "publication_date": 20190109
    },
    {
      "title": "Buy. Extra. Blades.",
      "text": "This planer is fine for a beginning/weekend woodworker. Overall the quality of the planer itself is not bad. It's simple to use and well constructed , but the blades are just garbage. Run one plank through with a small knot in it and then you have to open it up and flip the ( two sided ) blade, one more little knot and you're done planing for the day... Yes, you can clean up the rises with a hand planer but that kinda defeats the purpose. Still worth the price I paid here, I guess. Would be much happier with it if they made blades that can take a little abuse.",
      "rating": 3.0,
      "verified": true,
      "author": "Snipey McCarbine",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "I'm happy. It's worth the price.",
      "text": "I know it's not a $2,300 thickness planer but I have used this poor thing pretty hard. I'm working on a stack of rough sawn oak and it chews up good Diablo saw blades (table saw and chop saw) pretty darned quick but so far this seems to be holding up. It's fairly portable. It can be picked up and moved here and there if you don't have a big woodshop. The drive that pulls the material thru the saw can struggle here and there so if your planing inconsistent or rough material like rough-sawn it's best to work the material long THEN cut it to length from the most consistent portion.",
      "rating": 4.0,
      "verified": true,
      "author": "Troglodyte",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great for the Price",
      "text": "Excellent product for the price. A bit of work to get the table adjusted, but after that it works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "John Frohock",
      "helpful_votes": 8,
      "publication_date": 20160629
    },
    {
      "title": "Works well, but had some wear and tear out of the box.",
      "text": "The very first board I planed had some high stripes that seemed odd for a brand new machine. Usually that occurs when a blade has hit a hard object like a rock or a nail. I took the blade guard off and found some nicks on the cutter head. The front of the unit was also scratched up a bit. There was some tape residue on the top, where there had been no tape. I'm not convinced this was a brand new machine, but I really needed to use it today. Other than that it works nicely and has plenty of power for a full-width piece of mahogany.",
      "rating": 3.0,
      "verified": true,
      "author": "Criznach",
      "helpful_votes": 4,
      "publication_date": 20180615
    },
    {
      "title": "Works well, but good luck replacing blades.",
      "text": "This planer could be so good, but there is one huge problem. I needed to replace the blades (or at least reverse them) and the screws were so right (possibly seized) on one of the blades covers that 4 of the screws got stripped. Now I fear they are forever stuck. I've tried various methods to remove stripped screws but because they are so tight none of the methods work. Now I'm stuck with a bad blade. So disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "John G",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "A good tool at a good price",
      "text": "It's not a DeWalt, it's not a Milwaukee, and it doesn't have a spiral head. But it works very well. Leaves a very nice finish. Blades are easy to change. Have run about 150 boards through it, and couldn't be happier. Already had to change blades twice, because of unseen nails, but it's a forgiving machine. If you're a hobbyist and not a professional carpenter, you can't beat this machine for the money. Granite bed works as advertised. Not a perfect machine, but tough to beat at this price.",
      "rating": 4.0,
      "verified": true,
      "author": "Darken",
      "helpful_votes": 3,
      "publication_date": 20180617
    },
    {
      "title": "Awesome!",
      "text": "You cannot get a better planer for the price. I reviewed several models before buying this on. I planed numerous black oak boards and they came out great with no issues. I was amassed at how smooth the boards turn out. Very little sanding required.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher K Gonzalez",
      "helpful_votes": 2,
      "publication_date": 20181121
    },
    {
      "title": "Nice planer for the money!",
      "text": "I just got this and I only planed one board so far so I cannot speak to longevity but so far so good. I was a little nervous getting a lower price point but I really don’t do enough to justify a higher end planer. I read a lot of the reviews and most seemed happy so I gave it a shot. I am happy I did. This is a nice planer for the money. I put a 9 inch wide piece of cherry wood through it and it cleaned it up nicely. I will update after I have used it more.",
      "rating": 5.0,
      "verified": true,
      "author": "bford",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Good home workshop planer",
      "text": "Nice planer for a home workshop. Just finished a table made of cherry, black walnut and birds-eye maple. No issues planing sawmill cut 5/4 x 9\"w x 9-10 feet long boards. Snipe is an issue if used without infeed/outfeed support rollers. Other than that the surface was smooth and ready to finish sand with 220 grit. Set up was simple. A bit of adjustment on the tables and ready to go.",
      "rating": 4.0,
      "verified": true,
      "author": "CatDog",
      "helpful_votes": 4,
      "publication_date": 20180322
    },
    {
      "title": "A planer made up of weak internal parts.",
      "text": "WEN 12 1/2\" planer is NOT a good unit. I have gone through 2 in the last moth woith lesx than 4 hours on each planing maple. The first one had a broken drive sprocket. The replacement broke its feed wheel gear box. Avoid this and spend your money on one that is trued and true.",
      "rating": 1.0,
      "verified": true,
      "author": "Deidre",
      "helpful_votes": 9,
      "publication_date": 20180224
    },
    {
      "title": "Love it. Ready to rock right out of the ...",
      "text": "Love it. Ready to rock right out of the box. Im no expert but it seems to do a good job. Wear ear plugs and have someone come check on you because you'll get started with this machine and you wont want to stop. Very Very loud and Im sure my neighbors hate me now. :)",
      "rating": 5.0,
      "verified": true,
      "author": "FleekNerd",
      "helpful_votes": 2,
      "publication_date": 20171028
    },
    {
      "title": "I like. Works good. I’ll keep it.",
      "text": "Have used the planer now on several projects. So far...so good. Good speed, good cutting and when used with a strong shop vac/chip collector, little clean up. Some things I’ve learned; 1. Makes lot of chips. Check vac/chip collector often. 2. As others have said, feeding board stock with grain flow Provides better surface finish. 3. Good board stock support, beyond the feed & exit table supports, reduces snipe considerably, especially for long stock. My one star reduction is for the feed and exit table design and adjustments. Could be better. Otherwise a good machice for my shop dust projects. I will keep it.",
      "rating": 4.0,
      "verified": true,
      "author": "Herbert Sizemore",
      "helpful_votes": 2,
      "publication_date": 20180513
    },
    {
      "title": "Bad motor",
      "text": "Used three times and the motor blew out. Called the company about the warranty and they sent a replacement. The replacement arrived and it was a used one from 2019 which didn’t work at all. Now I have to call Wen again. Bad motor in this unit and ridiculous behavior from the company.",
      "rating": 1.0,
      "verified": true,
      "author": "justacustomer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Broken after 6 months",
      "text": "I purchased this product and it broke twice in the first 6 months of ownership. I was able to replace a part and fix the first issue but the second one wasn’t fixable by me. Spend the extra money on a higher quality product. I wish I had. I would have saved money in the long run",
      "rating": 1.0,
      "verified": true,
      "author": "Curtis Dahl",
      "helpful_votes": 4,
      "publication_date": 20180926
    },
    {
      "title": "Excellent Performance",
      "text": "I use it all the time. I like doing woodworking projects, but didn’t want to pay for milled wood. No learning curve on getting the hang of using it. So far, I’ve been please with all my Wen products. I’d never heard of Wen before, but decided to take a chance on them. This planer looks to be the same one that Rockler sells for quite a bit more money. Compare them and see what I mean. It works very well. I like that I can use pretty thick stock and still get good results.",
      "rating": 5.0,
      "verified": true,
      "author": "Samiha Qureshi",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Pleasantly surprised by this workhorse!",
      "text": "This thing runs like a champ! I’m in the process of making some butcher block counter tops for our kitchen remodel. I started with 10 boards, all 10 inches wide, 8 foot long and 2 inches thick. I used a mixture of eastern maple, cherry, and walnut. I was able to rotate the thickness handle 1⁄2 then for the maple and cherry, but only a 1⁄4 turn on the walnut, but for the price it’s worth the few extra passes.",
      "rating": 5.0,
      "verified": true,
      "author": "Saucy",
      "helpful_votes": 3,
      "publication_date": 20180409
    },
    {
      "title": "junk, you get what you pay for with the cheapest one on the market.",
      "text": "no power, shuts down when doing almost every pass even if i have brand new blades and am taking off almost nothing. its made by the same company that manufactures Bauer from harbor freight. id just buy one from their if i had known up front. that way i get a warranty that i dont have to call or mail anything out to use. the fold down tables are way to short. none of the hardware had lock tite on it so it all vibrates itself apart. this is the third Wen product i own and its the third one i cant stand i should have bought the Dewalt 13\". dont waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 9,
      "publication_date": 20180118
    },
    {
      "title": "Very good quality product",
      "text": "Setting of cutting depth is very precise than I expected. Also folding extention of front and back are pretty much the same height in factory setting no need to adjust when you open the box. This thickness planer is my first purchase of Wen product. I think quality level of Wen products are well enough for the price compare to the other name brand. I think Wen product are under rated among any other company's product on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "yasacop",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "the blades are very easy to swap out",
      "text": "I've used this for several months now, and it performs at least as well--at least for smaller stock--as well as my industrial planer. further, the blades are very easy to swap out. I would buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul R.",
      "helpful_votes": 81,
      "publication_date": 20170113
    },
    {
      "title": "Didn’t even make it out of the box...",
      "text": "Upon attempting to lift it out of the box it came in, I heard a “pop”. It turns out the handles are built into the “Right cap” (as the diagram calls it.). The only thing holding the handles and consequently the entire right side of the planer together are two tiny screws and one of them sheared off the threads it was held on by. It didn’t even survive being unpacked. It’s my fault though for trying to go the cheap route. Lesson learned...",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "Great planer",
      "text": "I bought this as an entry level thickness planer but have no plans to upgrade it any time soon. I’ve put about 2 hours of use on it so far. The blades are starting to get a few chips but I’ve been putting some pretty knotty stuf through it. Monkey Fart.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Pretty good planer",
      "text": "I'm not sure why others have had issues with the planer, blades seems to be pretty good and work decently against dry black walnut. Sniping isn't to bad if you set up right planing 5' boards without a table is a bit hard to prevent sniping, but I'll have that fixed once my garage is setup. overall decent planer easy to clean, light, and accurate. my only gripe is the scale being plexiglass/acrylic/plastic is it gets dirty fast and gets hard to read. I have the 2018 model.",
      "rating": 4.0,
      "verified": true,
      "author": "Cortney Haines",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "For a very hobby based woodworker",
      "text": "Unfortunately this planer stopped working within 20 days for me. I feel the feed rate is too fast for just a double razor planer. This creates chip out and the machine seems to bog down when you’re feeding in any wider hard wood. Anytime I ran maple or oak through it, I definitely noticed the machine struggling and sure enough it didn’t last over 3 weeks. Left strange black residue on the top face of the board as well. Good price but not for people that work hard wood regularly.",
      "rating": 2.0,
      "verified": true,
      "author": "Wenying Xu",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Made my table! Plus more",
      "text": "Sometimes you get what you pay for, and sometimes you get great quality at a lower price! This planer has worked out great for me, it is somewhat dummy proof too. Such as you cannot set it to cut more than it is able to with one pass, you simply won't be able to push it through until you raise it a little, it won't jam because of this!",
      "rating": 5.0,
      "verified": true,
      "author": "Fling",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "I think this is a very good planer for the money and DIY'er",
      "text": "This is my first benchtop planer. I adjusted the tables to try to eliminate snipe; however there is still snipe on occasions but not always. I am not sure how but one of my blades got a minor chip in it. Luckily these are 2 sided blades so I was able to remove and flip the blade. I think this is a very good planer for the money and DIY'er. It did what I needed it to do and with a little sanding the boards turned out perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "K-Mac",
      "helpful_votes": 2,
      "publication_date": 20180108
    },
    {
      "title": "Not great power on in-feed (board frequently get stuck and have ...",
      "text": "I'm a novice woodworker and this is the first thickness planer I've owned (or used). It seems okay. Not great power on in-feed (board frequently get stuck and have to be pushed through; and I'm doing thin passes). Some tear-out, especially on soft woods (which might be normal). It just doesn't seem to operate with the same power I've seen when watching high-end planers. Haven't tried it on hardwood yet, but plan to in the near future. Overall, I'm satisfied because it came in handy for a project, but I have been eyeing other planers now, kinda wishing I'd bought a better one. It seems like I do that a lot with tools! :)",
      "rating": 3.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 2,
      "publication_date": 20180228
    },
    {
      "title": "Great for the price",
      "text": "Great for the price...came with a damaged side piece and the manufacturer replaced it quickly and easily.... I must've fed a staple through it and the blades leave some ruts all the time now..... I question the hardness of the blades but accept is my fault. The Dewalt i used to have was accidentally fed a staple or two but never chippef the blade. I'll be looking for replacement blades soon enough, for now i just steer clear of the troubled spot. Other than that...i love it",
      "rating": 4.0,
      "verified": true,
      "author": "Moosepuck",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Love it",
      "text": "Fantastic for the money! wish it had a depth stop but that's ok, I just use a caliper to assure same thickness on boards.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian L.",
      "helpful_votes": 2,
      "publication_date": 20181211
    },
    {
      "title": "Love it!",
      "text": "Works great, as some other comments suggest occasional snipe. But it is not that bad and can easily be sanded or you just need to use a leader board. I think the same company makes these for Delta too, the blades are the same.",
      "rating": 5.0,
      "verified": true,
      "author": "FTodd1",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Good Planer",
      "text": "So far it is working fine, my only complaint is the planed off wood dust gets clogged up in the collector easily. Have to keep cleaning it out. Going to try hooking up my shop vac to it and see if that keeps it cleaned out.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob N.",
      "helpful_votes": 2,
      "publication_date": 20170605
    },
    {
      "title": "Five Stars",
      "text": "Great product for the money. I use it almost daily. It won't let you down. Update: I have been using this product for over a year. Still working great. I have replaced the blades with ease a few weeks back as I had knicked the previous ones. All in all if this one was to ever break, I would buy this same model as a replacement. This is one of the backbones of my shop. If I had to have one complaint, it would be that when planning wide boards it can become clogged if trying to take off too much.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Morris",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "I use mostly Mesquite which is a hard wood and it works great. Read the instructions there is good information on ...",
      "text": "I just received this and of course instantly put it to work. I use mostly Mesquite which is a hard wood and it works great. Read the instructions there is good information on how to use this and DON'T stand in front of the infeed table! I had a split in a piece and it broke going through and shot the part back at me at 600 mph. The one thing that annoys me is they claim it has granite tables and that is absolutely false, they are nothing more that powdercoated steel.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry M.",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Got a deal on the equipment and glad I bought it",
      "text": "Got a deal on the equipment and glad I bought it. The granite work top is a plus. It did an amazing job on cleaning up some of the old wood I had laying around. It turned them into practically new boards I didn't know existed under all that crud. I've been coming up with new projects just so I can use it. Overall, great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "stkyrce",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Works well",
      "text": "Works well for hobby craft, not large-scale production. I built 4'-5' ramps to help with skyping. The ramps helped then sanded much to clean up skyping. Still, I am happy with the results. It would cost hundreds more get the results you might imagine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "So far so good, this thing chews through wood like butter",
      "text": "So far so good, this thing chews through wood like butter. i did a 6x4 rough cut cedar beam that was painted about 50 years ago. This makes stuff smooth to the point where you dont need to sand. It even went trough a nail i forgot to take out, yea i have a notch in my blade now but it didnt seize or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "casey m.",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "6550? 6552? DeWalt?",
      "text": "I debated mightily as to which planer to select and finally chose this Wen 6550. I have no regrets at all. It finishes smoothly and my shop vac is easily louder that the planer. My recommendation for the casual user... the Wen 6550. You’ll be happy with your selection.",
      "rating": 5.0,
      "verified": true,
      "author": "Mena",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "... to get the replacement but amazon made things right like always. The planer works great",
      "text": "The first one that I received was broken and it took over a week to get the replacement but amazon made things right like always. The planer works great. I love the infeed and outfeed tables. It's better than my harbor freight model and cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Boards come out to perfect thickness.",
      "text": "Out of the box, I needed no adjustment. The tables were properly aligned. Using a jointer to get a flat side and this to plan my boards, I'm in square wood heaven! If you want flat boards, get a jointer. If you want boards the same thickness, get this planer.",
      "rating": 5.0,
      "verified": true,
      "author": "KennyNashville",
      "helpful_votes": 2,
      "publication_date": 20180613
    },
    {
      "title": "good manchine",
      "text": "works well dose the job great price prefect for my home work shop",
      "rating": 5.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Works great. My first job has been planing roughcut poplar",
      "text": "Works great. My first job has been planing roughcut poplar. With good technique I can avoid sniping with just a slight lift at the planed end as it finishes. I am very happy with the quality and sturdiness. I could not justify a Dewalt at twice the price. No regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Never owned one",
      "text": "Fast shipping/delivery. I’ve never owned one before but out of the box is sturdy and granite table is nice. In/out feed tables are not as nice and adjustment screws are tricky but nothing that can’t be worked with. Planes really nice for price. Well built so far from what can be seen after running 6 2x4 stud board through it. Would of been nice to have had a indicator for how much was being cut off but again for money is very nice. Time will tell how it holds up. Will write additional review later on down the road. But would recommend to buy this",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. Ross",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "I think I got a lemon",
      "text": "I think I got a lemon Has weird electoral short when plugged in. You can feel electricity when it is plugged in. Seems to work OK, planing in small increments works best",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Awesome",
      "text": "Why would you not as this to your shop? It’s perfect for small to medium jobs and makes all the difference in the world when you need to make wood projects shine through.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "It is very easy to work wit and does a great job.",
      "text": "I like the ease of plaining the cedar I use. This plainer does a wonderful job. The only thing I found about this plainer is that I did not like, is that I did not order it sooner. I am very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Bunting",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Not impressed.",
      "text": "Maybe I’m an idiot and need to adjust something, but out of the box, these are my results.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad Johnson",
      "helpful_votes": 3,
      "publication_date": 20180927
    },
    {
      "title": "Great product for the money...really does the job well.",
      "text": "Excellent product. Value is great. Wouldn't use for a professional shop but for home projects, you can't get any better for the price. I have planed 200 cedar fence boards to make a fascia for my basement and several large pieces of lumber like 2x8's and 6x8's to reclaim them and use for structures. Easy to rotate blades when they get dull. I am very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Very happy with my purchase",
      "text": "Amazing right out of the box. I adjusted the infeed and outfeed tables and my result was no snipe. Took very little time to setup. I didn't attach the dust port and wont until I get my collection system installed. I am more than pleased thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "jason Lever",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Solid materials and construction for an entry level surface planer ...",
      "text": "Solid materials and construction for an entry level surface planer. Granite floor plate smooth snag free. once set up and with proper operation I've had no snipe issues. A definite buy recommendation for your first planer.",
      "rating": 4.0,
      "verified": true,
      "author": "David Bixby",
      "helpful_votes": 3,
      "publication_date": 20170405
    },
    {
      "title": "Problem with qautlity control.",
      "text": "The first planner I sent back it had a notch/bend in the blade housing that was scracting a line down each board I ran through it. Amazon sent me another on this one also had the same notch/bend but not as bad. This time I just took a flat file to it and fixed it. The planner works as intended. For being cheaper than harbor freight model it is put together more strudy other than the defect I have ran into.",
      "rating": 3.0,
      "verified": true,
      "author": "jordan ham",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Get the 13\" model. Check the blades!",
      "text": "Good planer. It did come with some Chips in the paint and was making lines in a 12\" plank, probably caused by a chipped blade. Seems like the higher model with three blades is the way to go for a few dollars more.",
      "rating": 4.0,
      "verified": true,
      "author": "Taws6909",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Awesome product. I lost count of how many boards ...",
      "text": "Awesome product. I lost count of how many boards I have ran through this little machine and it runs as good as the day I bought it. Don't wast your money on the expensive name brand models, I have had this for several months and use it daily with no problems at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan G.",
      "helpful_votes": 3,
      "publication_date": 20171225
    },
    {
      "title": "Amazing!",
      "text": "Love this tool, I used this to plane down a couple of hundred old cedar fence boards and it worked perfect. I would definitely recommend for anyone looking for a great planer at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Gross",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Used Planner to plain 70 year old oak boards.",
      "text": "I used the planner to plain 70 year old oak boards off of an old garage to make 2 sliding barn doors and also added the same boards to a wall. Used Danish natural oil on the boards. I couldn't have asked for a better planner.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Broke",
      "text": "Worked great, until the second time I used it. Then a chain for one of the rollers broke.",
      "rating": 1.0,
      "verified": true,
      "author": "James Buchanan",
      "helpful_votes": 3,
      "publication_date": 20180907
    },
    {
      "title": "This is a great planer. Very well made and works perfectly",
      "text": "This is a great planer. Very well made and works perfectly. I do woodworking projects and found this to to everything the more expensive planers do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Robinson",
      "helpful_votes": 2,
      "publication_date": 20160915
    },
    {
      "title": "Great Machine",
      "text": "This machine works great and was sold a a much lower price than it's name brand competitors. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrissy",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Great value for a planer!",
      "text": "I have used this planer for a few months now, and I have been very happy with it. I think it is a very affordable option that compares with other benchtop thickness planers that can range in the $300-$500 range. Like any planer, you'll have to take measures to avoid snipe, but I think that for the money, this planer is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew K",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Great product. Great customer service.",
      "text": "Had it less than a year and used very minimally. Now it makes loud clanking noise when it turns on. Sounds unsafe so I will not use. Hoping manufacturer will replace or make right. Update: called manufacturer and they are sending part I need at no cost. Very helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "This thing works nice I rip a lot of pine to 2 inches ...",
      "text": "This thing works nice I rip a lot of pine to 2 inches and now I rip it a tiny bit big and run them though on edge no more saw marks",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Bergeron",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Love It",
      "text": "Very easy to use and precise with measurements. My husband is a professional contractor and loves this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina B.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Best price for this particular planer",
      "text": "This unit is available under several different brand name. The WEN was the best price and best warranty when I purchased. It even beat harbor freight with a 20% coupon, and their warranty is only 90 days, not a full year like this WEN.",
      "rating": 5.0,
      "verified": true,
      "author": "BigHairyNScary",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Great planer",
      "text": "Have used it to make Christmas presents. Love the solid construction. Ordered the replacement blades. Having fun",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Waltz",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Works really well and seems to work best on harder woods I've found that soft maple clogs ...",
      "text": "Works really well and seems to work best on harder woods I've found that soft maple clogs the ejection port because of the larger shavings. Hardwood just feeds right through with no issues and in both cases of hardwood or medium density wood the finished product is smooth with very little fine sanding needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Boejas",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Buy a brand name with a good warranty.",
      "text": "I had this product for about 1 year before it broke. Planed only 4 boards on it. Not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "ktazmo",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Must have tool.",
      "text": "Works great saves me a lot of time on planning custom thickness.",
      "rating": 5.0,
      "verified": true,
      "author": "James Tinker",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "It's not good if you need to use it everyday",
      "text": "This planer was great the first few cuts I have replaced blades 3 times and the rollers one time and it did not fix it I would not recommend buying this I wish I could cause all my wenn products are great but this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Sonya S.",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great planer for the price",
      "text": "Works great for the price and has good build quality. Performance numbers really match up to most other thickness planers of this size, but costs a bit less. I noticed a ridge developed after adjusting the thickness down, but a second pass cleaned it right up. It isn't as loud as I expected, but I'd still advise hearing protection while using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Smith",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Works great",
      "text": "Works great. Durable. Easy to find replacement blades at hardware stores. Delta blades are the same.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Smitherton",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Happy so far",
      "text": "Ran several board feet of cherry through this to give it a try out after assembly. Seems to work OK as long as you don’t get too carried anyway with what you’re hogging off. Easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "JRB.SRQ",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Overall Good Product",
      "text": "Redid my decks by planning and restaining them. Product does the job well, my 2 complaints.... first the height adjust likes to change wile cutting, I had to place a bungee on the turn screws to keep the adjustment from changing wile cutting. Second, the blades only lasted for maybe 4-5 boards then you have to flip, sharpen or change them. Front deck was about 16 16' boards and I killed the set that came with it. Was able to get 2-3 sharpenings before they get to short.",
      "rating": 4.0,
      "verified": true,
      "author": "george",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Great tool",
      "text": "This is one great plainer. I’ve had a dewalt that I paid a whole lot more fire and this plainer does just as good with a much better price. You won’t be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Buy it.",
      "text": "Cuts true / cuts quick / makes loud manly noises and leaved with an Paul Bunyan size pile of shavings.",
      "rating": 5.0,
      "verified": true,
      "author": "Strabley",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Great planer!!!",
      "text": "This is an amazing tool! Has plenty of power to take off 1/16” of oak per pass whith no issue! Tremendous precision and very sturdy. It seems like it’ll be a great tool for use 3-5 times per week.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian T.",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "Can’t go wrong for the money",
      "text": "Planned a lot of barn wood. Then a bearing went bad on the feed roller. Put quality bearing and haven’t had a problem since",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Four Stars",
      "text": "Works fine. Snipe is a bit bad though. Haven't measured it, but it is visibly noticeable.",
      "rating": 4.0,
      "verified": true,
      "author": "John S James Jr",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "Shipped fast",
      "text": "This is a great machine claims the boards wonderfully after my Mill",
      "rating": 5.0,
      "verified": true,
      "author": "Brent",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Motor burned out within a month",
      "text": "Motor burned out with a month of use. Not made for regular use",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin Sikel",
      "helpful_votes": 2,
      "publication_date": 20180705
    },
    {
      "title": "Work great .",
      "text": "I love my new tool work rigt out of the box. It had some scratches but nothing worry about. I usd it to plane some red mahogany wood work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "I love this thing.",
      "text": "Comes almost completely assembled, great value for your money. There are some sniping issues at the start of the feed that might be fixable by adjusting the feed table but since I finish with a good sanding it’s been no big deal for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin S Prietz",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "What a bargain!!!!",
      "text": "What a bargain. Has been used constantly since I bought it. It doesn't amazing job for the price you can't beat it. If I would have bought a more expensive one I probably wouldn't have been as happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson Sepulveda",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "All good",
      "text": "I have run a lot of footage through this machine and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Easy to use",
      "text": "Pleasantly surprised. Easy to use, produces smooth surfaces, best bang for the buck. I am very satisfied. Packaging was great, packed in styrofoam all around in double thick cardboard. Delivered on time as promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven K.",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "See my Review on Youtube",
      "text": "It works as expected. It's easily portable and make smooth cuts. For the price it's a good tool. Criticism: the measuring gauge is hard to read and a part ( a chain guard) was not installed from the factory and just put in the box. The missing guard does not affect functionality.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Arrived damaged.",
      "text": "Item works as intended but arrived damaged. The clear depth gauge is cracked and broken. It also has one quarter size dent on the front.",
      "rating": 2.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Works great for a woodworking hobbist.",
      "text": "WEN planer does the job!! Works great for planning the reclaimed wood I use for my projects. Pallets, old lumber and even of course new stock. Just be smart and only take off a very small amount on each pass!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike F. from Alabama",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Awesome I had some aged wormy chestnut wood and being ...",
      "text": "Awesome I had some aged wormy chestnut wood and being able to finely control gave me absolutely gave me some beautiful wood. Easy to use but you will need a vacuum or dust collector.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald W. Jenkins",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Great power tool.",
      "text": "Can’t beat this planer for the price. I’ve completed 6,edge grain, hardwood cutting boards. Blades still sharp.",
      "rating": 4.0,
      "verified": true,
      "author": "bill richardson",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great quality for price",
      "text": "Surprisingly good quality planer. Been using this since feb just about weekly and has given me no problems. Replacing blades was very easy. In my experience if I don’t hook it up to shop vac it will clog very easily. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "letsgofishin",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Indispensable",
      "text": "The more I use this machine the more I adore it. With it, I have been able to joint (with a sled) and flatten what would otherwise be garbage pallet wood into useable pieces. The planer is indispensable and has opened up new avenues for my woodworking ventures.",
      "rating": 5.0,
      "verified": true,
      "author": "DrNigelRamses",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Worth every penny!",
      "text": "This planer is awesome! My only complaint it’s where the depth gage is mounted. It get covered with sawdust really fast and makes it hard to read.",
      "rating": 5.0,
      "verified": true,
      "author": "mannmade78",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Looking for you first planer?",
      "text": "My first planer. Works perfectly and is great for the non-perfessional or hobbyist.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Ed",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Super",
      "text": "Does the job quite nicely. I am paneling my old RV with fence pickets and this planes them down with not effort at all.",
      "rating": 5.0,
      "verified": true,
      "author": "TheBlindLady",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Five Stars",
      "text": "used this a lot original blades last longer than expected",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett B.",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Faulty",
      "text": "Bolt on vertical crank snapped while trying to plane. I have never dealt with a more fragile piece of equipment in my life. Do not buy . I will avoid company from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "love it and the price was great.",
      "text": "for the durability and quality of planing you couldn't ask for better and the price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Junior King",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Excellent thickness planer",
      "text": "Powerful, easy to adjust, great dust collection and a very reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "K Loughman",
      "helpful_votes": 0,
      "publication_date": 20190706
    }
  ],
  "product_meta": {
    "title": "WEN 6550T 15 Amp 12.5 in. Corded Benchtop Thickness Planer",
    "description": "Model name:2019 ModelRemember when you brought those old jagged boards back to life? The WEN 12.5-inch Benchtop Thickness Planer with Granite Table repurposes rough and worn wood to give it an exceptionally smooth finish. The powerful 15-amp motor combined with our two-blade cutting system provides over 17,000 cuts per minute at a 26 feet per minute feed rate. Plane boards up to 12.5 inches wide and 6 inches thick with ease. The smooth granite table never warps and provides precise support to wood passing through the machine. Combine that with the heavy duty base for a sturdy planer that does not walk or wobble during operation. The handy depth adjustment knob varies each pass to take off anywhere from 0 to 3/32 of an inch. The fan-assisted dust port removes chips and sawdust from the workpiece and blasts them out of the way. This package also includes two high carbon steel double-edged blades (SK5) along with height-adjustable infeed and outfeed tables that limit snipe while providing extra support to your workpiece during planing. Easily mount the planer to a work surface or stand using the predrilled base holes. Repurpose old wood or make a set of boards flush with the WEN 12.5-inch Benchtop Thickness Planer. And because it’s a WEN product, the WEN Thickness Planer comes backed by a nationwide network of skilled service technicians, a helpful customer support line and a two-year warranty. Remember when your planer could handle even the hardest of woods? Remember WEN.",
    "rating": 4.4,
    "feature_bullets": [
      "Granite table provides a sturdy non-marring surface for wood to smoothly travel over",
      "Plane boards up to 6 inches thick and 12.5 inches wide",
      "15A motor generates 17,000 cuts per minute at a 26 feet per minute feed rate",
      "Adjust depth to plane off anywhere from 0 to 3/32 of an inch with each pass",
      "Fan-assisted dust port removes sawdust from workpiece"
    ],
    "specifications": {
      "Manufacturer": "WEN",
      "Part Number": "6550T",
      "Item Weight": "70 pounds",
      "Product Dimensions": "23.5 x 24 x 19 inches",
      "Item model number": "6550T",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Included Components": "Thickness Planer",
      "Batteries Required?": "No",
      "ASIN": "B07KKY27KL",
      "Customer Reviews": "4.4 out of 5 stars577 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#37,158 in Tools & Home Improvement",
      "Date First Available": "November 15, 2018"
    },
    "categories": [
      "Planers",
      "Power Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Benchtop Planers"
    ],
    "price": 288.88
  }
}