{
  "website_summaries": [
    {
      "verdict": "Complete button mapping options, a comfortable ergonomic design, and a wide range of customization accessories make this an excellent option for dedicated PlayStation 4 fans.",
      "pros": [
        "Compatible with both PlayStation 4 and PC",
        "Easily swap analog stick and D-Pad locations",
        "Two customizable spare buttons under controller",
        "Handy companion app for full configuration options",
        "Play wired or wireless"
      ],
      "cons": [
        "This high-end PS4 controller is also an expensive one",
        "Only available in a single red or black color"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Left stick already faulty...",
      "text": "I loved everything about this controller except the D-Pad is trash. Unfortunately I have to return it already because the left stick keeps going out randomly. I expected more from Astro.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan J. Weatherhead",
      "helpful_votes": 98,
      "publication_date": 20190406
    },
    {
      "title": "Buyer beware",
      "text": "The drivers won’t install on pc and despite every possible work around i can think of the controller wont work on pc. Ps4 it works fine but I bought it with the intention of mostly pc gaming im going to return this bc it clearly is to early in this new controllers life cycle to have these issues. They advertise plug and play but after it took the first plug in it asked for a reboot of the pc and hasn’t worked since.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 45,
      "publication_date": 20190330
    },
    {
      "title": "The good and the bad",
      "text": "This controller has pro’s and cons Pro: Nice rubber material (non slip) Easy to move the buttons around Comes with sturdy pouch for the controller Easy to customize your controller settings on pc Via wired mode buttons are very responsive and have a good solid feel to them Cons : No battery indicator when on PS4 dashboard Controller is bigger then DualShock 4 ( not good for small hands) Disconnected once in first game via wireless mode Cable for wired mode is not long Update right out of the box (easy to install though) The price Sometimes you hear a click sound when moving the analog sticks",
      "rating": 4.0,
      "verified": true,
      "author": "Fashion Queen",
      "helpful_votes": 35,
      "publication_date": 20190404
    },
    {
      "title": "It's worth your money. I would buy this over the Vantage.",
      "text": "Coming from someone who has played Call of Duty since Black Ops & who has played with both the Scuf Vantage & the C40. This is the better controller by far. It took me about a month to get use to my Scuf Vantage as with the C40 it took me a couple of hours. The build quality is really nice with the whole controller wrapped in a rubberized material making it feel good in your hands. The sticks are smoother than the Vantage. You're getting what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 9,
      "publication_date": 20190409
    },
    {
      "title": "Severe Left Stick Defect shows up after a few months on usage",
      "text": "At first I loved this controller. Everything about it was great and I didn't mind the fact the the PS button could not turn on the Playstation. Minor inconvenience. Unfortunately, the real issue has revealed itself a few months down the line, and it's a deal breaker: the left stick will stop responding overtime to the point where your game character will either stutter or simply stop moving while pushing forward. No amount of calibration or software reset resolves this issue. It appears to be hardware related. They should figure this out, get a hardware revision out, and do a recall to replace the left stick for those who already bought the controller.",
      "rating": 1.0,
      "verified": true,
      "author": "J.",
      "helpful_votes": 5,
      "publication_date": 20191008
    },
    {
      "title": "Broken after 30 minutes",
      "text": "Feels amazing, however after updating it through my pc. I hooked it to my ps4 and it crashed, It wont turn on and even if I try to reset it or try a different power cable, it wont turn on.. Broken after 30 min of unboxing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190404
    },
    {
      "title": "Thumbstick Drift. Astro does not care.",
      "text": "So I decided to write a review. Had this product a few months and the left thumb stick goes out. Seems to be a continued problem with these controllers. Went to order a new one from Astro and now on back order because they are out of stock. Apparently even after you order one the controller still won’t work. Was hoping this would be better than a scuf but I’ll be switching back after this horrible fiasco. Sorry Astro you lost a customer. I will be buying products that are actually good from now on. I will never recommend Astro products again.",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler Little",
      "helpful_votes": 3,
      "publication_date": 20190902
    },
    {
      "title": "Good controller just really buggy.",
      "text": "It’s so buggy, the control sticks lose calibration, if you push down on them. It’s good for a while then your movement speed slows down at different axises. Maybe mine was just defective. Wondering if anybody else had this type of issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Khisraw Ariasaif",
      "helpful_votes": 7,
      "publication_date": 20190405
    },
    {
      "title": "Get software update as soon as you get it,it will help",
      "text": "Amazing product,easy to setup no issues love the feeling of the controller it's awesome a bit pricey but I think it's worth it",
      "rating": 5.0,
      "verified": true,
      "author": "Luistar51",
      "helpful_votes": 8,
      "publication_date": 20190330
    },
    {
      "title": "L3 and R3 when pressed down it stays like that",
      "text": "When the remote works it is by far the best remote in the market but I have to return it three times already and get a replacement because the left stick keeps going out randomly and L1 just stop functioning properly. Even when I swap the stick out it is not long before it goes bad again. All I'm trying to do is run and heal on call of duty by pressing down on L3 & L1 I expected more from Astro.. update June 29th, my REPLACEMENT HAS BEEN IN PROCESS FOR OVER 2 MONTHS NOW WITH NO UPDATE ON WHEN WILL I GET A NEW CONTROLLER.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin R./Alondra R.",
      "helpful_votes": 3,
      "publication_date": 20190422
    },
    {
      "title": "Overrated product",
      "text": "Came in dysfunctional, my aim would move in game without me moving the sticks. The sticks are also awful and the controller has a cheap soft touch that makes your hand sweat. Bumpers are super hard to access. Case zipper is really bad and was almost impossible to open when I got the controller. And two modules were missing from the case. You know Astro isn’t serious about controllers when the controller box says “select” for a button that is called “options”!! Proof there is probably not a PS4 gamer in their team, which is why this pad is more an Xbox controller). Will return.",
      "rating": 1.0,
      "verified": true,
      "author": "Tomasclerk21",
      "helpful_votes": 5,
      "publication_date": 20190412
    },
    {
      "title": "Terrible controller messed up on me twice already.",
      "text": "Definitely not worth $200. There are elite controller that are worthy $150 and have a lot more useful functions other than 2 back paddles and changing out the position of the dpad and analog stick when you want to. And that isn’t even the worse part, this controller has messed up on me twice the first one was the left dpad button would not work at all, after returning it and getting a new one it was working fine but fast forward 2 months later the controller already has stick drift... something that isn’t suppose to do until after a year supposedly what was said on the video Astro released. Do not buy this it is not worth $200",
      "rating": 1.0,
      "verified": true,
      "author": "Marvin Espino",
      "helpful_votes": 2,
      "publication_date": 20190707
    },
    {
      "title": "Great controller but issue with thumbstick drift",
      "text": "I mainly play Destiny and Destiny 2 on PS4 and I have had many issues with the thumbstick drift due to how the sprinting mechanic works. I have followed all of the solutions of resetting the deadzones, adjusting deadzones, and even swapping out the thumbstick units with new ones and they only resolve the problem for a short time and then it comes back. It is a shame since the controller otherwise seems very good quality and is very comfortable. I am keeping it incase I ever figure out a solution but currently am just using the regular PS4 controller with the newly released playstation paddle attachment.",
      "rating": 3.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "An Elite Controller!!",
      "text": "Very Satisfied with the ASTRO Gaming C40 TR Controller. Feels amazing in my hands. The analog sticks feel super buttery smooth. It comes with a high quality case. I dont have any complaints about the controller or price. You get what you pay for. This controller, hands down, is the best in the market. It will not disappoint you. If you got the money just go for it.",
      "rating": 5.0,
      "verified": true,
      "author": "George Rivera",
      "helpful_votes": 4,
      "publication_date": 20190402
    },
    {
      "title": "Waste of Money. Do NOT recommend. :(",
      "text": "This controller was great for about a 2 weeks. The sticks now drift all over the place, making me nauseous af as I have to constantly try to stabilize myself to fight the sway. I tried all recommended methods to correct/improve to no avail. Such a waste of money. Thank f@uck Sony is putting out the add on to the plain old ps4 controller. I refuse to spend more money on new sticks for them to be messed up in a few days. Needless to say, I am beyond disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "L. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "So close to being what I wanted.",
      "text": "Please add functionality to map menu, settings and touch pad. Those are buttons as well and to convert from a ps4 controller to this I need full control. I can map those on my ps4 controller why not this? I'm tempted to return it until it's ready for market as it seems they were quick to release without looking into all the feedback. Mapping only via cable is crappy as well, and using the button on back is confusing and a pain. Why can't I edit and save wirelessly? Seems like adding wireless function but literally nothing to do with it outside the connection is absurd. Really making it hard for me to love this controller. So much potential.",
      "rating": 3.0,
      "verified": true,
      "author": "TYSON",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Defective Thumbsticks",
      "text": "Sad to say I will be returning this controller today. After trying EVERYTHING to fix my c40 thumbstick feedback problems, I give up. Tried... 1.hard recallibrations & fast 2.new astro thumbsticks 3. New BBC thumbsticks 4. Switching positions of modules Nothing worked. The controller thumbstick feedback is defective check your software and get familiar with the sticks section and you'll see what I mean. Had L3 & feedback issues wich is way too big of a problem to overlook (specially in comp gaming)",
      "rating": 1.0,
      "verified": true,
      "author": "Rene Cisneros",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Buyer's Beware",
      "text": "I had to go through 2 of these. Having multiple issues with it from multiple disconnections to the wireless dongle when usijg wirelessly, to the stick drift issues, and finally just out right not even turning on anymore without any response to a charge. I actually really like the feel of the controller itself, which is why it's such a shame that it has to have all these issues. For a $200 controller, I expect quality not only on the look and feel, but functionality. I wanna give this another try and maybe I can give a positive review. 3rd time's a charm, so here it goes.",
      "rating": 1.0,
      "verified": true,
      "author": "OMGulay27",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great controller. If you have the coin and are looking for top of the line, then buy this.",
      "text": "I’ve had this controller for a whopping 3 days. I primarily game FPS (rainbow 6 siege to be exact). In the last 2 nights I’ve seen my gameplay and accuracy increase. I remapped my left lean and right lean to the back buttons therefore I don’t have to press down on the R3/L3. What a huge difference! The trigger stops are amazing. It’s also has a good feeling to it. You can this this controller is premium. Now this is my first “professional” controller. I only wished I bought it sooner. The controller is a little on the heavy side but when you’re one shot head sniping I don’t mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Absolutely amazing and Amazing Customer Support",
      "text": "I would give this 5 stars but after only a few months i have had drifting issues. other than that its amazing, you can map every button customize all the sensitivities, brightness, volume and vibration intensity from the C40 TR Configuration app. I will update as I deal with customer service on the replacement or fixing of the controller. Updated: The Astro customer support is super amazing and helpful they sent me replacement parts for free and when it still didn't work they had me send the controller to them for free and sent me a brand new one back and it works perfectingly. Will buy again from them when their next gen controllers come out for the new consoles",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Orton",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Controllers great brand new, be prepared for stick drift",
      "text": "My first controller with paddles initially loved it but found it doesn't turn on my PlayStation by pressing the PS button and there's also other ways to program the controller without a computer. 3 months in I've got major stuck drift and plugging into the computer and resetting it doesn't remove it like YouTubers claim.",
      "rating": 3.0,
      "verified": true,
      "author": "austin carpenter",
      "helpful_votes": 3,
      "publication_date": 20190719
    },
    {
      "title": "X button is “squishy” after only 3 months of occasional use",
      "text": "At first I loved this controller but now I noticed that the X button is semi squishy. If I press it fairly quickly, I get the feedback of the button that lets you know that it “pressed”, however if I press it in a relaxed manner, it never gives that haptic type feedback of the button “clicking” when you press it like the other three. Unfortunately, its one of the few buttons that cannot be replaced. With as expensive as this product is, I’d expect it to last longer. I’ve had many original controllers over a year and never experienced any of this issue.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Moore",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "The controller would not even start up on pc or ps4",
      "text": "I do not like how all the videos said that this would start right up, how it was the easiest thing to set up and all that crap. Well, I have been trying to get my controller to even light up and it won't even turn on so I'm packaging it up and sending it back and hopefully they will send me one that actually works. But other than that I will say that the swappable buttons worked very well with no issues and that the controller itself has a very nice feel to it and all around a good controller just Astro, please send me a good controller this time. Thank you, I hope this was helpful to someone",
      "rating": 3.0,
      "verified": true,
      "author": "David Williamson",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Great controller, if you're willing to pay",
      "text": "This is a great controller, on-par with with the other top elite controllers out there. Customizeable, easy to use software, feels great in the hand, etc. The issue is the price. You can get three or four regular dualshock controllers for the price of one of these. If you really want an elite controller that works with PC or PS$, this is one I would recommend if you're willing to pay the money. But for most people, this is overkill and way to expensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Phillip",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Slippery",
      "text": "The controller is nice, it fits the hands well but has 2 flaws that are quite annoying. 1. It is slippery, like super slippery. The top and the bottoms are both a cool looking and feeling smooth finish but they are slippery as all get out and it is super easy to drop. Would have been much better if they has a grip friendly finish applied. 2. The joystick tops do not fit the control freak adjustable add-ons. This should have been planned for.",
      "rating": 2.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Stick drift issues controller doesn't turn on at all",
      "text": "DO NOT BUY DO NOT BUY DO NOT BUY!!! YOU HAVE BEEN WARNED!!! You can't turn on ps4 with this controller and it doesn't let you know the battery is about to die, it just shuts off. If ur in the middle of a game good luck! EDIT: CONTROLLERS LEFT ANALOG STICK IS NOT RESPONDING! I DONT EVEN PLAY ALOT STICK DRIFT AFTER A MONTH OF NORMAL USE AND REPLACEMENT SEND OUT EVERY MONTH BECAUSE THEY SUCK!!!! MY CONTROLLER NOW DOES NOT TURN ON AT ALL LIKE IF ITS BRICKED! $200 DOWN THE TOILET DO NOT BUY !!!!!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Hector",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "The sticks just don't last.",
      "text": "So starting out I loved this controller! It fit very nicely in my hands and felt like a solid controller, way better than the scuff I had despite only having 2 bottom bottons. After 3 months of use both the control sticks are getting pretty big dead ones, so much so that I have been forced to go back to a normal ps4 controller. I can't justify spending another 50 dollars to replace the sticks just to get another couple of months use then possibly having to replace them again.",
      "rating": 1.0,
      "verified": true,
      "author": "reviewer",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "If you like replacing the analog sticks every now and then (two or more months)",
      "text": "Think it'd be a generous rating since I've gone through three controllers since it came out. All having the same issue, stick drifts on their own after a couple (two or more months) needed to be sent back to Amazon then thee third replacement from Astro themselves from faulty products from the same batch Amazon had. For the price, you'd think it'd be solid for a year. Tldr; Not worth the price, until they fix or put more quality components. Other than that it's a pretty solid controller. Disappointed in the life span.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrian Amadour",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Very Reliable (for shooters etc. Not fighters)",
      "text": "The only problem I've had with the C40 so far is the dpad being a little too big. Since usually I play fighting games, I find that smaller dpads help a lot with buffering special moves. Not to mention it's about the size of an Xbox controller dpad (which is notorious for being bad for fighters), you may drop a lot of combos even if you have big thumbs. But for other games, it works perfectly. All in all it's a solid controller, I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony  Brooks",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "these are horrible",
      "text": "this is the worst money grab ever this controller is litterally the worst controller ever made with a license from sony the stick are loose sometimes the buttons malfunction and the triggers are mushy so those trigger stops they added are pointless maybe its that its a xbox controller for playstation but the only reason you should think about getting this controller is if you are transitioning from xbox to ps4 otherwhise look at battlebeaver",
      "rating": 2.0,
      "verified": true,
      "author": "Eli Radin",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Started to chip after a long time of usage",
      "text": "Solid controller Buttons responses are amazing. Software button layout customizing are bit lacking on which game you are playing. Overall, this was the best controller on the market at the time . I would consider purchasing another one if this one decided to stop working. But I would do Abit of research since there are other controllers to choose from now.",
      "rating": 5.0,
      "verified": true,
      "author": "D.I.Y ",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Almost 5 stars",
      "text": "controller is great very responsive would give 5 stars if the most important thing on the controller wasn’t such crap a friend of mine is having same problem Use it on my pc and PS4 joysticks I’ll say are trash not even a month in use and already have drifting problems that the reset button in the software doesn’t fix , maybe they can design a better module or joystick or give you extra sticks ! For the price of the controller you think they would ! ordered pro tension joysticks see if this helps the problem otherwise they can have this item back",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "C40 TR not worth it won’t let me sprint in call of duty",
      "text": "It’s ridiculous to pay for a $200 controller and it have any sort of minor problems but it definitely does. I’ve only used it on call of duty but that’s enough for me because everytime I try to sprint it’ll just stop me every 2 seconds or every 4 seconds I can’t consistently keep sprinting and it’s an absolute joke and I’ve reset it, updated it, switched the analog stick with the d-pad and nothing works. Don’t waste your money it is was a great controller before this started happening but now it’s just a joke",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Great feel, ghost inputs.",
      "text": "This controller feels *amazing* to hold (even for a long time) but that's the only premium thing about it. It suffers from frequent ghost inputs (despite calibration) that hold the analog stick or button inputs too long. PC software is barebones and doesn't offer calibration configuration or battery information. This is one of the most expensive \"afterthought\" products by a company that I've ever purchased which is really disappointing because there's real potential with this one in an under-served premium controller market. The underside buttons and optional USB wired connectivity this controller has are not worth its issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Watch out for the joysticks",
      "text": "Controller feels great, love the extra paddles on the bottom. The software allows for fast and easy configuration changes. My only concern is the left stick seems to be malfunctioning, started out very smooth and fluid, but after about 30 hrs it has developed a noticeable grind in it's inner workings. After some research I have learned that the sticks are the Achilles's heel. So do your research if you're looking, I have located an aftermarket fix for the stick issue and am waiting for it to be delivered. For the price I am disappointed at the quick failure but I can live with it if the aftermarket parts perform as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "Anonimus",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Not worth $200",
      "text": "super disappointed as I always used astro headsets. But I like my scuf impact controller and 4ps pro way better. The shape is more comfortable and it made my gameplay better.",
      "rating": 1.0,
      "verified": true,
      "author": "ElyassileM",
      "helpful_votes": 3,
      "publication_date": 20190422
    },
    {
      "title": "My favorite controller",
      "text": "It feels sturdy, button configuration is easy, I know some complain about it not being able to turn on the console from the controller, but I do not think it is a big issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Dyna85",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Look elsewhere for a better controller than this inferior brand made in China!",
      "text": "I purchased this brand in September 2019. After 3 months the right thumb stick wore out and drift started interfering with game play. Even the C40 TR software couldn't help. Now 6 months later drift started again and when I connected it to my computer to adjust the sticks the computer didn't recognize the controller. Contacted Tech support again and surprisingly I was told my WARRANTY has expired! 7 months of owning this controller and it is no longer under warranty? WTF, this is what companies like ASTRO do to customers when their inferior products fail! Six month warranty for a $200.00 controller? Proof to me ASTRO knows their quality is substandard. Don't buy one folks, its not worth $200.",
      "rating": 1.0,
      "verified": true,
      "author": "jeb",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "After 1yr 2months R1 Trigger Broke",
      "text": "Im an old school L1/R1 shooter. My R1 button broke around May 18, 2020 (Used since April 1-2, 2019.) My best guess is that the amount of leverage placed on top of the button finally gave out and broke the plastic inside. The d-pad and s-pad colors have faded. Joysticks are Not tension-able. Replaced R3 once cause of horrible stick drift (i usually play with max sensitivity CoD 20 and is exponentially noticeable. The software helped but eventually needed replacement.) I would not buy or recommend for a L1/R1 shooter but did enjoy the time.",
      "rating": 3.0,
      "verified": true,
      "author": "Ppl-say",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Bricked itself in a week.  No thanks.",
      "text": "Bricked in literally a week. It was plugged into my PC in wired mode. Worked well for a week. Didn't play on my PC for 3 or 4 days when I came back it wouldn't turn on. Contacted support, did what they said, tried to charge it but it was still bricked. Sorry but if I should have turned it off (it was in wired mode?) and a few days of inactivity caused it to brick itself I don't want another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Some set backs but a nice controller",
      "text": "It really is a very nice controller and has mappable buttons, swappable toggles. But sad you need a USB port for a transmitter. It also doesn't just start the PlayStation by hitting the psn button. And there's no battery meter like factory controllers. For the money I was hoping it worked just like a 50 dollar psn controller, it doesn't.",
      "rating": 4.0,
      "verified": true,
      "author": "markus knows",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Best controller EVER",
      "text": "This was a amazing early Father’s Day for my husband and he absolutely loved this was the controller that he was talking about for a long time so I surprised him with it and plus we have 4 boys and they love it too so I will recommend it to anyone I should of let my husband right the review it would have been very detailed and way better than mine",
      "rating": 5.0,
      "verified": true,
      "author": "Tangelita Johnson",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Buy it ! Better than my Scuf",
      "text": "I love this controller, I was missing R1,L1 first few games just the size difference I’m guessing. Download the software & adjust all your sensitivities !!! Makes a world of difference",
      "rating": 5.0,
      "verified": true,
      "author": "C.Pate",
      "helpful_votes": 2,
      "publication_date": 20190424
    },
    {
      "title": "It’s a no for me. Tension modules replaced four times in one year.",
      "text": "I love and I hate this controller. The controller feels great in my hands. I love the fact that you can map the buttons and love the back paddles. I absolutely hate the fact that the tension modules break so easily. I have replaced them 4 times in one year. They are $29 each so do the math. For a $200 controller this is absolutely ridiculous. Love the controller otherwise but I just cannot give it more than two stars for the reasons mentioned. Maybe if the price included a reasonable amount of free tension modules I would recommend and reconsider my review.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrey De Risio",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Terrible joysticks",
      "text": "This controller plays and feels amazing with a huge flaw towards their thumb sticks. They start to drift on their own or they begin to have issues after a good while. Out of two controllers I tried both of them went bad. I will be switching to another brand of pro controller.",
      "rating": 2.0,
      "verified": true,
      "author": "shoppingsavy",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "not a thin, small controller.",
      "text": "this an excellent well made controller that I already had to send back to the company because it would not hold a battery charge after a week. I had problems with their wireless headphones like that as well. Props to Astro for replacing it, though it took about three weeks to get back to me. its shape is like a xbox elite controller so if you don't like those, you're out of luck. Astro, you should try to make a slimmer controller that doesn't fatigue the hands.",
      "rating": 3.0,
      "verified": true,
      "author": "John C. Pine",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Poor quality",
      "text": "Switched from Scuf. Just better all around. Build quality, button feel, grip, size, paddles, etc. Only drawbacks are PS button does not power on system and wireless requires USB fob. Update - after owning from launch - there’s an issue with the control sticks module. They glitch out causing issues with movement in games causing things like sprinting to constantly cancel in FPS games. Astro replaced the modules and sent a whole new controller. After a few weeks of play, the new modules and new controller had the same issue.",
      "rating": 3.0,
      "verified": true,
      "author": "DAN",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Thank you for ruining my experience!!!",
      "text": "I would have given it a 5 star if it wasnt for the horrible faulty stick drifting or even not responding to \"up/forward\" input at all. I'm very disappointed in the controller I've been wanting since the very first time I seen it. Thank you for ruining my experience, also I haven't connected it to my PC yet to update the firmware, but seriously straight out the box and it's this messed up? I really want my money back because it's really no telling how much it's really screwed.",
      "rating": 3.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "I will not recommend this controller to Hardcore gamers.",
      "text": "The controller is very unreliable and filled with input lag on wireless and wired connection whether on pc or ps4. Also though the stick drift recalibration button is a nice feature, expect it to not work within in seconds of calibration. I have 3 of these controllers and they all experience extreme stick drift. I'd buy another controller or wait till they come out with a more refined version as Astro has done in the past. I love my A50 and A40 but Astro has dropped the ball on their first foray into competitive Gaming Controllers.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexi",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Built with attention to detail",
      "text": "Premium price for a premium controller. The second I held this controller, I did NOT want to ever put it down. Feels fantastic in the hand, weighty but not uncomfortably so. SOLID build quality. Response of the sticks feels more fluid than a DS4. Stick tension does NOT feel too loose, feels like the sweet spot of loose and tight. Buttons on the back may take some learning but once you get the muscle memory down, it feels second nature. The ergonomics feel so natural. Very nice controller. Would absolutely recommend to even the most serious, competitive PS4 player. ~15 hours in and no sign of stick drift. Will update if anything comes up.",
      "rating": 5.0,
      "verified": true,
      "author": "M.G.",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Physical stick drifting problem",
      "text": "I have been using this controller for Three months now. It was the best controller I have ever used. However, after 3 months the stick starts to drift so bad that I can’t even go straight with my character in a shooting game. There is a software solution to reset the drifting but unfortunately this doesn’t solve the drift I had. Once I reset, the same drift comes again. When I checked online I found that a lot of people are having the same physical stick problem. The only solution I have now is to buy another one! Unfortunately this is a very expensive controller that lasts for 3 months only.",
      "rating": 1.0,
      "verified": true,
      "author": "Haitham",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great quality, but lose connection!",
      "text": "The grip and quality of the controller is really good, I like the custom controls and the software. The Controller loses connection in the middle of the game it is annoying!!! I tried updating all firmwares nothing made it better. Also the range is limited, make sure there is no wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Clément G.",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Beware of stick drift",
      "text": "Is a great controller. build quality is second to none. Only issue I've had and been having is the drift on the sticks. They replaces it once with no problem but now are telling me to try all this things that are not working. It's your call. I just switched to scuff.",
      "rating": 3.0,
      "verified": true,
      "author": "kilted thrower",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Best ever",
      "text": "I have 2 scuff controllers, i enjoyed them but the left joystick has failed on both. Sending them back for repair basically paid for half of this controller. I will never by another controller other than the Astro. I was so impressed with the case and packaging, by far the best controller I've ever had and i highly recommend it for anyone who can get it. The ability to buy the joy and replace it yourself is priceless for a gamer. Astro outdid themselves on the construction of it, feels so well balanced in your hands even though it might feel heavy just picking it up. If this review had 20 stars i would give it all 20.",
      "rating": 5.0,
      "verified": true,
      "author": "kirk",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "It's great but not GREAT great..",
      "text": "I love it but at the same time for the price it should of really had 4 mappable buttons on the back I like the customization but I find myself pressing the back buttons on accident all the time.. it feels great I just wish it had 4 mappable buttons ..",
      "rating": 4.0,
      "verified": true,
      "author": "Macacktinglingbreh",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Battery life doesn't seem to last very long...",
      "text": "This controller is really great. I love the buttons on the back and the durability of it. The buttons are really responsive. I love that it came with a case to put it in. Gripes I have with it: If I want to update the controller on my computer, I cannot use my Corsair mouse and keyboard I have because something in the software interferes with it, and I have to unplug them and use a different mouse just to be able to update it. Also, it doesn't seem like the battery lasts very long even though I charge it up.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt Lopez",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Love it!",
      "text": "My favorite controller so far for ps4. Everything works as it should and it has a ton of extra options for the professional or more serious gamers. Trigger stops are awesome and the best rear paddles on the market. Swap a part out if it goes bad instead of buying a new controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Seeley",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Well made",
      "text": "I had been looking for this controller for a while now. Even on Black Friday for , better price. But no luck. ;( until I found it on amazon. A used ☝️. It is in good condition and thanks to my reward and gift. I was able to buy it at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "PATRICIO A",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Expect this thing to die on you repeatedly.",
      "text": "Pros: The controller feels great. Like the customization and the overall sound quality when using with a headset. Cons: I have had 2 controllers die on me with no reason. Used for approximately 20 hours and it died while plugged into my PC. Got the replacement and it lasted approximately 20 hours of gameplay and died again while being plugged into my PC. I have had no power hits and am using a Titanium power supply so it is very clean power. I love/hate this controller.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Has its flaws, expensive, but a really nice controller",
      "text": "Very nice controller. Sticks act up a lot. I've only used the ps4 dual shock so it's nice to have the paddles and the trigger stops. In hindsight, I could've replaced my ps4 controller 4 times and gotten a strike pack for the same price. You can buy new stick modules at $20 each, and they aren't in stock when I check astro website. The program to map the remote is very simple to use .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Not worth the $200",
      "text": "The controller with only a month of use started to have a little stick drift, now it has insane stick drift. Went through all the videos Astro recommends for fixing this issue but still have the same problem. I play only at nights when I get from work 3-4 hours daily, wouldn't like to see how long would the controller last with a hardcore gamer that's plays all day.",
      "rating": 2.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Poor QC on Astros part.",
      "text": "Is a solid product besides the sticks, they're extremely loose and very floppy. it helps that the software is there to constantly reset the zero on the sticks, but the issue is also that you have to constantly reset the sticks back to zero because the stick drift will come out of nowhere all the time. I've used mine for about six and a half months and it just died on me, this apparently not a uncommon issue with this controller. It will die and they will be no way to charge it again no matter what I have tried it will not charge. Overall it is not worth $200 whatsoever.",
      "rating": 2.0,
      "verified": true,
      "author": "Isayah",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Not worth $200",
      "text": "I bought this day one due to the quality headsets they produce. Same can't be said for the controller. You can't turn on the ps4 with the controller. My left joystick had big dead zones and astro sent me a new one for free. That one also has huge dead zones over time. If you look it up in reviews and forums, the left joystick specifically is a known problem. I can probably get another joystick sent to me for free but why bother when the official ps4 bottom trigger attachment is coming out at the end of January for $29.",
      "rating": 2.0,
      "verified": true,
      "author": "Tuan Nguyen",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Works",
      "text": "Works well however takes about 15 minutes to set up. Must download software to laptop to sync with remote. Feels just like Xbox controller. Maintains good connection via synced Bluetooth, feels quality in hands. I gave it 4 stars due to the set up process taking time. Not a plug and play.",
      "rating": 4.0,
      "verified": true,
      "author": "Pro Makeup Artist4Life",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Triggers to light",
      "text": "It's an okay controller but to be honest I rather play with my Scuf infinite Controller. The C40 triggers are so light just barely pulling the trigger makes your character stop running in a FPS type game and it doesn't feel too good in my hands. Also a scuf controller and the c40 are around the same price depending how you Speck out your scuff. Me personally I don't think the C40 can out perform or perform as good as a scuf controller.",
      "rating": 2.0,
      "verified": true,
      "author": "zachary",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "10 out of 10 stuff killer",
      "text": "This is a great controller make sure you download the software and update it and if you move any of the analog sticks around hold the button on the back until it vibrates to reset the analog sticks so you do not have any stick drifting seen stick drift in the comments if you have any they have a reset button just for that smh you will love this controller only thin I didnt like is it didnt come with the extra d pad",
      "rating": 5.0,
      "verified": true,
      "author": "Damian",
      "helpful_votes": 2,
      "publication_date": 20190412
    },
    {
      "title": "very nice controller",
      "text": "over the past 2 year i have gotten the best of the best high end ps4 controllers as i love to have paddles on the back. any way i picked this one up and im in love with it. very high quality . would buy again in a hart beat. well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Excellent controller",
      "text": "I was using regular PS4 controllers and this feels better in my hands. It's as meaty as an xbox controller and heavier. They heavy part makes it feels less flimsy than a regular controller. I had someone recommend it, that also owns scuff and prefers this over them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Don’t buy if you don’t want stick stick",
      "text": "very disappointed in the fact that a $200 dollar controller has this issue. I bought this controller on feb 25 and started getting stick drift on my left analog stick like crazy! It’s unplayable at this point. I take care of my things, keep it in its case when not using it and make sure it’s always clean, but apparently it wasn’t enough. Looked up on YouTube on how to fix this problem and there are hundreds of videos of other people with this issue. I can’t even return it for a replacement because my return period ended in March. Super lame!",
      "rating": 1.0,
      "verified": true,
      "author": "Jose Martinez",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Wait! Read this first",
      "text": "Amazing controller... but the stick modules wear out too fast which isn’t surprising because they have created a nice secondary market with stick modules replacements. Second, the aim assist does not feel as strong as regular dual shocks. Third, sticks are on the lighter side for tension. (Some people like more tension) Fourth, only two extra buttons. (Many other have 4) Overall, it’s the most comfortable controller out there and uniquely customizable. I can’t say to steer clear but I also wouldn’t recommend this to anyone without serious cash to drop.",
      "rating": 3.0,
      "verified": true,
      "author": "Console god ",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "DONT THINK ABOUT IT AND SEE YOU AT CHECKOUT , you wont regret it",
      "text": "BEAST MODE!!!!! If you’re serious about gaming , then this is the controller for you. If you’re not , its still offers superior comfort and quality for casual gamers. This controller is modular and has a LOOOONG life. Replacement parts are easy to install if you accidentally rage quit and throw it against the tv.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Perhaps my favorite controller ever",
      "text": "I am a huge fan of the Xbox Elite controller, but most of the time I only really need two paddles and this is the most comfortable implementation I have seen, and I think the shape is subtly better than the Elite. My only negative is that I wish it would warn you before the battery dies, but I always keep another charged controller handy as a backup for that emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Sylvain",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Night and day over Scuf",
      "text": "Went through 3 Scuf controllers in 2 years due to cheap design. This Astro is smooth and solid. Stick drag yes, adjust it and it's fine, take the time to update it and map it the way you want it. This is not a plug and play, read the directions. Totally blows away my $300 custom Scuf controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon L.",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Early adopters beware",
      "text": "Controller feels great. Comfortable to hold for big hands. buttons feel sturdy and snap well. unfortunately, i hate there is no indication for battery health either on the controller or on the ps4. i died several times during sessions because the controller died. and it takes a good minute for the controller to come back online. especially when you are in the moment, getting the controller to reconnect can be ultimately frustrating. you cant just easily move the controller into the wired position and it works. could be fixed with a software update at some point, but i dont know when or if that will happen. so im returning to purchase something that has the integration.",
      "rating": 3.0,
      "verified": true,
      "author": "Blake Willis",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Believe all the bad reviews, this thing is a turd.",
      "text": "I read the bad reviews but figured I'd still give this thing a try. Day one trigger issues and I don't really like the layout. You can get a super deluxe Scuf controller for the same price, or save some money and get a more basic Scuf controller that still outperforms this thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Bender Bending Unit #22 Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Warning Bad Analogs",
      "text": "This product in its functionality is great, but I’ve only had this controller for a few months and both of the analogs sticks are not working 100% already. For a 200$ controller this should not be happening and I can see why they only put a 6 month warranty as it seems Astro knew that their product had some defects in the testing phase",
      "rating": 3.0,
      "verified": true,
      "author": "Mason Van Doorn",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "ALWAYS QUALITY OVER CONVINCE.",
      "text": "A PS4 player's Xbox one's hybrid, great for third-first-forth person point of view at any given time. Biggest plus, I had a stick go wonky-Astro quickly responded-EVEN THO I BOUGHT IT ON AMAZON! To register my warranty add it to my account send me a replacement stick with free shipping. Why didn't I contact Amazon my product return date was over, thank God for Astro customer service. In addition, a top quality Percision instrument, my slightest movement whilest ADS was never more on POINT than when using this controller.",
      "rating": 5.0,
      "verified": true,
      "author": "S.O.T.B",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "A strong gaming controller, especially if you have large hands.",
      "text": "This controller is a huge improvement over the standard Dualshock 4. With the larger build and the heavier weight, it is more balanced for gaming. The controller itself is not overly complicated to customize and adjustments can be done easily bu connecting it to a PC. The only negative issue I have is one of my analog sticks feels rough to move, kind of like its scraping against itself, which in the long run can be really annoying. I do plan on ordering a replacement stick though. Overall fantastic product, excluding the analog stick issue. Hopefully they will improve quality of them in the future so this wont ever be an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "LordSeph14",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Expensive, but great quality",
      "text": "Great controller. It has a nice quality feel to it, and is much heavier than the PS4 controller. Suited well for larger hands. The extra bottom buttons feel much better than others like the Elite Xbox controller. I had to tweak one analog stick to get the drift to stop, unfortunately, but great overall besides that....oh and the ridiculous price.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew MacGray",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Do Not Buy This Controller!!",
      "text": "DO NOT BUY THIS CONTROLLER!!!!!! This controller is absolute garbage!!! I bought one and after a week the joy sticks got all messed up and were sticking. I returned it and they sent me a new one. I had the new for no longer than 1 week again, and the joysticks did the same thing!! This time i switched them out cleaned them and update the software on the controller and everything! And still the joy sticks are constantly messing up! Come to find out this specific controller is notorious for the joysticks having to be constantly replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "It could be amazing, but it isn't lasting.",
      "text": "I've been using this controller for just about 8 months. The face button paint mostly rubbed off in the first 2 months, I've had to replace 2 analog sticks, and now my R1 button is extremely faulty. If I hold it in, it rapid presses randomly and will not stay pressed. There doesn't seem to be any easy way to open the main shell of the controller (not the face plate) for cleaning purposes. 2 stars because I love everything else about the controller, but it just isn't lasting very well.",
      "rating": 2.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "The Elite controller for PS4",
      "text": "This controller is great. The solid build and weight of the controller really make you feel like you have something high-end in your hands. The modular design is great for people who like either Xbox or PS4 thumb stick style. The only complaint I have is when the controller battery is low there is no indication on screen like the regular one. Also in the menu you can’t see the amount of battery you have left either. It’s really the only frustrating thing I’ve encountered with this controller and I’ve had if for a few months now.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Carter",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "dualshock4 controllers are more reliable than these",
      "text": "This is a RIP off hundreds of dollars to get stick drift, and ghost inputs to the point it's like my controller got hacked and someone else is playing my game. And under 3 months even with a warranty what would be the point, wish I could a refund I'll send this pos back in box and all. Better off just buying regular dualshock4 controllers at least you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan M",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Stick drift is awful, and so is customer service. DO NOT BUY.",
      "text": "Awful stick drift after less than a months use. I tried writing for warranty replacement but Astro is beating around the bush, saying i have to wait over 6 weeks to get a replacement stick module sent to me, which will probably fail in a month so I dont get the point of waiting. Warranty service is ASTROCIOUS.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Not Worth the Money",
      "text": "Controller is nice in theory but the analog issue will ruin your entire experience. Not worth 200 dollars at all i rather get a scuff.",
      "rating": 2.0,
      "verified": true,
      "author": "jermonia burrell",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Broken right out of the box.",
      "text": "When I received the product, the control sticks moved on their own will without me touching them and I couldn’t control my console. I did roughly two hours worth of trouble shooting to no avail and I had to send it back to get a refund. After all the trouble and cost this controller had me go through I didn’t even want another one and just wanted a refund and to go back to my standard PS4 controller. You may have a different experience but I don’t recommend this controller based on my experience.",
      "rating": 1.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Mind of it’s own , but it’s really good lol",
      "text": "Great controller , comfortable ( I have big hands ) It kinda bugs out every now and then tho .. I noticed that the c40 reviews online say the same ... I’ve thought this controller was broken about 3 times now lol but when I try it after not using it for a day it works just fine ..",
      "rating": 5.0,
      "verified": true,
      "author": "AndrewTalamantes",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Mixed feels",
      "text": "I was looking forward to this pad but the trigger seems super sensitive when tilting the controller toward me and scrolls the menus even after updating the driver. Looks great feels great but the function is my concern.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe Musashi",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Analog sticks do not hold up well!",
      "text": "I bought this controller to up my online gaming performance without adding mods. I can tell you that this controller does have excellent response. My issue with it is that the analog sticks will begin moving on there own when not being pressed. I have adjusted the sensitivity and tried again with no improvement. I have replaced the sticks twice and both times the sticks started out perfect and within a short period they are drifting. Astro needs to make an adjustment to the springs in the thumb sticks.",
      "rating": 3.0,
      "verified": true,
      "author": "donald e clark",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Disappointed",
      "text": "Would not recommend this product have had it since April and so far I’ve needed to buy two modules. If your looking for a simple controller keep looking. Unfortunately this controller has a lot of stick drift issues that can only be fixed by resetting or changing the modules. Don’t get me wrong the controller is built solid the buttons feel nice but just constant issues. I love my Astro headset but this controller just didn’t do it for me. Don’t go into this product thinking it won’t happen to “me” because I thought the same thing.",
      "rating": 2.0,
      "verified": true,
      "author": "Joseph Garrafa",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Pricey.....but soooooo worth it!!",
      "text": "This controller is expensive but worth every penny. Build quality is amazing and the controller has a great weight feel to it. Do yourself a solid and buy this bad boy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Harper",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Highest quality controller out there.",
      "text": "I've tried all the high priced controllers.Scuff, Razer, Nacon. This is the best and easiest to upgrade and reconfigure. Support is great too. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikee",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "USB splitter doesn't work well with this controller",
      "text": "If you have one available USB port and are using a USB splitter! The Bluetooth receiver doesn't work on a USB splitter. If you want to use wireless mode you have to have it connected directly to a ps4. The wired mode does work on a USB splitter and works with a USB headset but only in this mode. You can use wireless mode for the controller if it's connected directly to the ps4. If you connect the Bluetooth receiver to a USB splitter you can only play 1 ft away from it.",
      "rating": 2.0,
      "verified": true,
      "author": "Byron S.",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Quality user friendly design.",
      "text": "I have owned a scuff and honestly prefer this controller. Solid build simple to remap paddles, trigger stops very easy to turn on and off. It is heavier and larger but those are both pluses for me as the avg PS4 controller is small in my hands. It would be perfect if I could turn my PS4 on with it but I’m sure an update will come out soon through firmware.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Stick drift JUNK controller",
      "text": "Went through 2 sets of stick neither lasted more than 2 weeks shouldnt have these problems with a $200 controller frustrated so much I stopped playing at all not worth the hastle!!!! At least the regular ps controllers last a year or more with heavy game play.....",
      "rating": 1.0,
      "verified": true,
      "author": "chester flanigan",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Meh",
      "text": "Not a very good deal for the money. I wanted to like the controller, but ........",
      "rating": 3.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "This controller and parts have issues - disappointing",
      "text": "This controller’s button broke after a few weeks. Bought a replacement which lasted only a month. Got those parts and it’s incredibly difficult to install. At this point the controller is unusable and it was a lot of money wasted. Very disappointing since it was highly recommended and frustrating as it can’t be returned or replaced.",
      "rating": 1.0,
      "verified": true,
      "author": "pmac",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Must have IMO",
      "text": "Absolutely worth the price, so what if it can't turn on your PS4 not a big deal. The fact your able to replace everything with ease makes it worth it alone. The shape is a bit fatter than my scuf impact but still comfortable. Kontrol freaks don't fit but the domed long stick is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Super fast customization!",
      "text": "I play fps A LOT I got some stick drift after 3 months I don't have a laptop to adjust the settings on the remote so it was hard to find a fix but once I did it's 100 times better than the original ps4 remote less hand cramps and faster reaction times for those critical moments in a gun fight.",
      "rating": 4.0,
      "verified": true,
      "author": "timo",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Save your money.",
      "text": "For the price I feel like there shouldn't de any issues with drifting... Ever! Unfortunately this controller has major issues with drifting. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "H. D. B.",
      "helpful_votes": 0,
      "publication_date": 20200816
    }
  ],
  "product_meta": {
    "title": "ASTRO Gaming C40 Tr Controller - PlayStation 4",
    "description": "The Astro C40 TR Controller is a fully customizable, high-quality pro controller built for the serious gamer. Durable and serviceable, the C40 TR Controller features swappable, replaceable analog stick and D-Pad modules as well as remappable rear buttons, allowing for multiple configurations and increased speed and accuracy for any playstyle and any genre. Seamless performance in wired or wireless modes with high-fidelity wireless audio. Free software to create and share custom controller profiles. With up to 12+ hours of battery life, the C40 TR Controller is made to outlast your game.\n\n- Connect your controller to your computer using the included USB Cable or USB Wireless Transmitter\n- Make sure your controller is in Wired mode if connecting via USB Cable, or in Wireless mode if connecting using the USB Wireless Transmitter.\n\n- After you remove the faceplate and swap in the new module, please re-calibrate the controller again to avoid stick drift, unintended activations, or unresponsive modules. To re-calibrate, make sure the faceplate is secured correctly back on, then hold the program button on the back of the controller, let it vibrate once then don’t touch it for about 20-30 seconds. When re-calibration is complete the controller will vibrate again with the LED light blinking white twice. For more details please watch the video in the image gallery above on this product detail page",
    "rating": 3.7,
    "feature_bullets": [
      "Ready for any environment, the TR line of ASTRO Gaming products deliver Premium design and performance for every type of Gamer",
      "Optimum rear button layout for superior ergonomics improves Precision during Critical moments. Mappability streamlines the Controller for any genre and playstyle while improving response time",
      "Quickly and easily swap the analog stick or d-pad modules for consistently sharp performance. Setup the Controller in either offset or parallel configurations",
      "Quickly and easily activate the trigger stops, which adjusts the throw of your triggers, to allow hair-trigger performance in most FPS titles",
      "The C40 TR Controller delivers high fidelity game sound and voice chat in wired and wireless mode via the 3.5mm jack. Compatible with any gaming Headset"
    ],
    "specifications": {
      "ASIN": "B07KF1FB1F",
      "Release date": "March 27, 2019",
      "Customer Reviews": "3.7 out of 5 stars967 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#6,708 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "17.72 x 5.91 x 11.81 inches; 10.88 Ounces",
      "Binding": "Video Game",
      "Item model number": "940-000184",
      "Item Weight": "10.9 ounces",
      "Manufacturer": "ASTRO Gaming",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Date First Available": "November 15, 2018"
    },
    "categories": [
      "Controllers",
      "PlayStation 4",
      "Accessories",
      "Video Games",
      "Gamepads & Standard Controllers"
    ],
    "price": ""
  }
}