{
  "website_summaries": [
    {
      "verdict": "The Adidas Freak Carbon Low offers a lot of value for its low price. Players just love the cleat’s overall comfort and performance on the gridiron. The cleat’s low-top style allows players to move freely while the Razorframe plate keeps them stable. So, if you are looking for a fast and fashionable cleat that won’t break the bank, the Freak Carbon Low should definitely be on your radar.",
      "pros": [
        "These Adidas football cleats fit great, several users comment",
        "Like the Adizero 8.0, most owners just love how comfortable the Adidas Freak Carbon Low feels on their feet",
        "These low-top football cleats perform very well on the field, many players report",
        "The Freak Carbon Low has excellent traction, some report",
        "Several buyers are pleased with the cleat’s low-top style",
        "A good number of owners are commenting that these football cleats are quite affordable",
        "The cleat’s value for money is comparable to the Nike Vapor Untouchable 3 Speed"
      ],
      "cons": [
        "A wearer complains that these football cleats are quite snug at the forefoot",
        "According to one buyer, these cleats are slightly heavier than the previous iteration"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Tight fit.",
      "text": "I returned the item as it was way too small. Also the shoe is vary narrow. I’ve decided to try a different model of the same brand as the narrowness of the shoe is not comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 3,
      "publication_date": 20191103
    },
    {
      "title": "Fit is not right - too small and narrow",
      "text": "Bought these for my son for football. He wears a 7.5 - 8 sneaker mens. We bought the size 8 and he couldn't even get his foot into the sneaker. I wear a womans 7 and I tried them on and the fit length-wise but boy they too tight. Went out and had to buy a new pair - different brand and same size, the fit was just right. I don't recommend to buy these online, you need to try them on to make sure the width is okay",
      "rating": 1.0,
      "verified": true,
      "author": "Dylan's Mom",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Not bad, but really narrow",
      "text": "Obsurdly narrow. Cleats themselves are well designed, bite into grass and dirt well, but not sure how long they will last, showed more wear than I would have expected after 1 use.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "Absolutely amazing",
      "text": "Absolutely beautiful quality and styling. I bought them for my husband who is stationed in Afghanistan. They have a pick up soccer league on base. His favorite team is Chelsea he is going to love them",
      "rating": 5.0,
      "verified": true,
      "author": "CRSeiler 29485",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Very nice cleats",
      "text": "These cleats look awesome in person. My son loves them and he really likes the way they feel compared to the Nike's he previously wore.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim R.",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Football",
      "text": "Got these for my son for the football season, which has not got started bc of CV19!!!!... But he did use them at a four day football camp. He said they felt really good.",
      "rating": 5.0,
      "verified": true,
      "author": "James G. Cook",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Best Receiver Cleats!",
      "text": "Super light weight and flexible. Can’t wait for the new season of football to start.",
      "rating": 5.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Son loves them",
      "text": "My son plays football in high school he he loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "91side",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Runs little small",
      "text": "Usually wear 9.5 in adidas got them they are a little small should have got a 10",
      "rating": 5.0,
      "verified": true,
      "author": "alex christian",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Narrow and stiff",
      "text": "After reading reviews, ordered half size bigger and still really narrow. My son does not have wide feet. Shoe is very stiff and he could literally stand on his toes and the shoe did not bend.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheyene A Hoshino",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Good shoe, just runs a little small",
      "text": "So far so good, just a little small, get a 1/2 size larger.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Abajian",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great purchase!",
      "text": "We bought these for my son for football. He says they’re “lit” and they fit perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Very nice looking shoe, but runs small.",
      "text": "Very nice looking shoe and my teen loved them, but ran a size small and he said were tight in the toe area. Did not have a size up so they had to be returned.",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Very stiff and tight, not for people with a wider foot",
      "text": "Shoe felt like it was molded from on piece of plastic does not bend or move at all. Ordered a size 10 fit like a 9, very narrow and tight like a ballet slipper.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Not worth it",
      "text": "These cleats dig into my sons feet. He said they feel as though a knife is cutting him.",
      "rating": 1.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Just so so",
      "text": "These cleats look really nice but I found them to be uncomfortable & difficult to run in.",
      "rating": 2.0,
      "verified": true,
      "author": "Wesley",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "That the product comes 2 degrees less than what order",
      "text": "The very shock is very loud I'm so disappointed I want a refund full thanks",
      "rating": 1.0,
      "verified": true,
      "author": "yosef ben porat",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Satisfied",
      "text": "Shoes were shipped quickly and fit as expected. These cleats are sharp!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki Soma",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Fast shipping good quality",
      "text": "My son will love these but they are a Christmas gift",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn M Lamb",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Good cleats. Although they run very small",
      "text": "Very good cleats for a receiver. Dig in the ground well but they run a little small. Would recommend a half size up or you’re gonna deal with blisters on your heels",
      "rating": 4.0,
      "verified": false,
      "author": "Matt Leboeuf",
      "helpful_votes": 0,
      "publication_date": 20200520
    }
  ],
  "product_meta": {
    "title": "adidas Men's Freak Carbon Low Football Shoe",
    "description": "Adidas Genuine Products. By adidas. Adidas Sports Shoes with Studs",
    "rating": 4.1,
    "feature_bullets": [
      "Lightweight cleats built for agility and speed",
      "Regular fit",
      "Outer Material: Textile,Synthetic",
      "Sole: Synthetic",
      "Closure: Lace-Up",
      "Shoe Width: M",
      "Synthetic upper for durability",
      "Tongue pull for easy on and off",
      "Cleated outsole for traction"
    ],
    "specifications": {
      "Product Dimensions": "12.7 x 12.7 x 1.78 cm; 1.11 Kilograms",
      "Date First Available": "22 Aug. 2018",
      "Manufacturer": "adidas",
      "ASIN": "B07DNYS6M3",
      "Item model number": "EE7120",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Football Boots",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 145.54
  }
}