{
  "website_summaries": [
    {
      "verdict": "Emerica continues to break barriers in comfort and innovation with Collin Provost’s third signature pro model. The footbeds in Emerica’s Provider kicks give exceptional comfort care of the brand’s new high memory PU insoles that adjust to the feet.The clean styling can switch from smart to casual depending on need, which means you can ride these shoes in the park on your way home as you rocked them in the office. The board feel, grip, and durability of these are all standard Emerica.",
      "pros": [
        "Emerica Provider shoes provide outstanding comfort, according to several reviewers",
        "Many skateboarders said that the low-top sneakers are very durable and in fact, much sturdier than the Wino G6 model",
        "Plenty of users commended the “amazing” insoles of The Provider model by Emerica which adjust to the shape of the feet and keep feet locked in",
        "The style of these skate shoes got praises from a lot of purchasers who stated the design “looks almost too nice to eff up.”",
        "A good number of people found Emerica Provider sneakers to have a nice flick and to be excellent skate shoes overall",
        "The shoes provide excellent grip and board feel, a handful of consumers remarked",
        "The kicks are obviously of high quality based on materials used and the construction itself, some buyers noted"
      ],
      "cons": [
        "Some Emerica Provider reviewers wished for more colorways to drop soon as the choice is limited"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 6.6,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Way too tight",
      "text": "The shoe size is correct, however my foot does not fit in it with the sole in the shoe. I don’t have large/wide feet and am pretty disappointed that I cannot wear these with a sole. Otherwise, they are super cute and the color is spot on.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "shoes ripped within <1 month of use",
      "text": "See photo. After <1 month of light wear, the material on the right shoe ripped at the base of the tongue. This is a nice looking shoe and the insole felt good, but what does it matter when the material cannot hold up? I returned it. I am extremely hesitant about buying any Emerica shoes going forward. We have other options.",
      "rating": 1.0,
      "verified": true,
      "author": "S.K.",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Comfy and simple shoe",
      "text": "I absolutely love these shoes. I loved them so much I bought 2 more pairs because of the comfort and how much they fit perfectly. Took some time to break them in, but feels so great and the comfort when I walk around casually. I would recommend them 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Sobility",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Fits too tight. Brown ones aren’t brown.",
      "text": "It fits too tight. The only way I can wear them is to take out the sole. The color is not as it looks in pictures. It’s more green. Not brown as it was suppose to be. Despite the two problems they are nice shoes. Only suggestion if you have wide feet get a half size bigger. These shoes are made for people with skinny feet.",
      "rating": 2.0,
      "verified": true,
      "author": "Hue Badal",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Get’em while you can...",
      "text": "Great shoe! I size in between a 10 and 10 1/2 and ordered the 10 1/2 and it’s perfect. My wildest dreams came true once I stepped into these kicks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Not wide.",
      "text": "Not very wide and 11.5 is like a 12.5.prepare for feet pain.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "The best !",
      "text": "It is such a steezy shoe, I can wear these shoes for just about everything. Very unique insole that keeps your feet sturdy and prevents it from slipping around. I got the shoe price for a steal and I can not complain. I can't wait to skate these!",
      "rating": 5.0,
      "verified": true,
      "author": "Ark Pharoah",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Needs leather cleaner",
      "text": "Got salt stains on the first day. Leather stains very easily. Product should come with leather cleaner",
      "rating": 1.0,
      "verified": true,
      "author": "Eduardo Garcia",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Nice shoes but not durable",
      "text": "Fit great, felt nice, but wore out in a month.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan S. Boddy",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Comfortable sole",
      "text": "Such a comfortable insole, like walking on air. Nice fit, very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Appelbaum",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Big Improvement Over the Provost Slim",
      "text": "The new G6 plus insole on these things is great. Nice and squishy, while still thin enough in the forefoot to give you good boardfeel. The textured portions of the insole hold your foot in place nicely. Laces are high on the shoe, basically only on the very top of the foot, which helps protect them from breakage. If you're into vulc shoes, this is the Emerica model I'd recommend most right now. It's a bit of a step up from the Wino G6. Just a simple, good-looking shoe. No big stupid logos. Checks all my boxes: comfy, grippy, durable, and skates well.",
      "rating": 5.0,
      "verified": false,
      "author": "Abraham",
      "helpful_votes": 2,
      "publication_date": 20191204
    }
  ],
  "product_meta": {
    "title": "Emerica Men's Provider Skate Shoe",
    "description": "The provider is a double weapped, low profile vulcanized shoe, designed for skateboarding. For the first time ever, wear Introducing our G6 plus drop-in footbed.",
    "rating": 3.9,
    "feature_bullets": [
      "Split heel collar",
      "G6 plus drop in footbed",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Heel Anchor System",
      "Thermic weld toe"
    ],
    "specifications": {
      "Date First Available": "1 Jan. 2020",
      "Manufacturer": "Emerica",
      "ASIN": "B07KRZKV7H",
      "Item model number": "6102000127",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Technical Skateboarding Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 27.72
  }
}