{
  "website_summaries": [
    {
      "verdict": "If you need to blanket your business with a speedy Wi-Fi network for employees and guests alike, and this pricy option is worth a look.",
      "pros": [
        "Dual wireless bands provide a secure Wi-Fi connection",
        "Business-protecting security features",
        "Control network via companion app",
        "Simple installation"
      ],
      "cons": [
        "Such an impressive Wi-Fi speed comes with a high price tag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Terrible support",
      "text": "I previously purchased a LAPAC1750 (without the \"C\") and had a good experience with it. When I wanted to buy another one, Amazon said there are no more, so I bought this model instead, assuming it would be even better. However, this product (the LAPAC1750C) is terrible because it doesn't work and tech support tells me they can't support it on a Saturday (like their \"home\" products) because it is a \"business\" product, which is supported only Monday through Friday. So the fact that I am trying to set it up for a house on a Saturday because I have to work Monday through Friday is completely lost on them. What a stupid policy. I will likely return the device.",
      "rating": 1.0,
      "verified": true,
      "author": "Jago",
      "helpful_votes": 14,
      "publication_date": 20190629
    },
    {
      "title": "Half-baked replacement for small business WAPs",
      "text": "Need to use RADIUS for WPA2-Enterprise? You'll have to abandon cloud setup and configure units directly through their admin UIs. Not sure whether that means you also lose monitoring, but that definitely means no cloud-based reconfiguration or intervention when there are problems. Also unknown how that affects client roaming and handoff. Guest captive portal is buggy and disconnects users long before timeouts should be triggered. No es bueno.",
      "rating": 3.0,
      "verified": true,
      "author": "Accounting IT",
      "helpful_votes": 5,
      "publication_date": 20181229
    },
    {
      "title": "Very helpful for wifi management",
      "text": "I use this at home because my routers always had some wifi dropping issue. Turns out that using an AP helps keep high number of devices well managed with no drops. Even though this is advertised for small business use, I strongly recommend it for medium to large home use. Definitely if you have 20 devices or so around home.",
      "rating": 5.0,
      "verified": true,
      "author": "Phenomenon007",
      "helpful_votes": 5,
      "publication_date": 20190206
    },
    {
      "title": "Works great when....",
      "text": "Arrived in timely manner. Cloud activation,which is what is recommended out of the box, did not work, had to use local PC access set-up. 2 hours with tech support and no resolution. Works great with local control, when communicating with cloud AP would de-activate WiFi radios and show online when it was offline. So standalone without Cloud control or access has nice coverage and operation. Will update should they get cloud service to work.",
      "rating": 4.0,
      "verified": true,
      "author": "AGR",
      "helpful_votes": 2,
      "publication_date": 20181214
    },
    {
      "title": "Replacement Access point",
      "text": "Replacement for older unit, needed the dual band to support a nest product. Installed a Smoke/CO detector in my shop/man cave in a restored barn. Needed the nest product because I was not always in building and had wood burner being used at times. I liked the fact that it was POE since I have video cameras using POE in and outside building and made install easy. I like the Linksys Business products, Have the Linksys LAPAC2600C AC2600 installed in my home, wanted to stay with similar Access Points.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Strong Signal",
      "text": "Excellent product! It was really easy to install and set up. This access point allows me and my family to maintain a full bar signal throughout our entire house.",
      "rating": 5.0,
      "verified": true,
      "author": "Freddie",
      "helpful_votes": 4,
      "publication_date": 20190730
    },
    {
      "title": "Great Features be Sure you have Stable Power",
      "text": "First one wouldn’t update the Firmware Second one did update the Firmware but I had some problems until I used the adapter to power it. At this point I have to blame the power source I was using. No problems since, but I’ve had the replacement less than a week so more time is needed. In any event, you won’t find an AP with better features than this one has.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Perfect for a wide area access",
      "text": "Arrived very fast and in perfect shape. Easy to replace my old AP with this new one. New unit covers a wider area and has network monitoring software added. Unit used the same mounts and color LED lights as the old one. Was a very easy replacement project.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Recommended AC2600",
      "text": "Love the manageability and speed. I installed in my home and works great",
      "rating": 5.0,
      "verified": true,
      "author": "Camilo Gutierrez",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Working excellent",
      "text": "I really wanted a stand-alone access point and I like the Linksys interface for APs and switches. Configured and installed this. it has been working perfect for 40 days. Multiple SSIDs with VLANs worked well. No issues. I am not using the cloud functionality.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Works.  Very powerful.",
      "text": "I use this entry point on my rental properties and never have complaints about problems with the wifi. It was easy to set up and I can manage it remotely (BIG PLUS!). Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "W. J. Schmidt II",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Lacks in performance",
      "text": "I want to set this up as wireless AP. First thing is directions aren't clear enough what to do. I get help from linksys support and set it up. The access point cannot connect 15 feet away from the router and when the access point is right next to the router it only gets 17mbs down 3 up. My speed is 100+mbs down. This production claims up to 1200 speed it can process. Returning product this was a waist of time.",
      "rating": 1.0,
      "verified": true,
      "author": "Verified customer",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great WiFi coverage",
      "text": "Purchased this item to add WiFi to our gym and Fellowship hall. It works wonderful. Great coverage!",
      "rating": 5.0,
      "verified": true,
      "author": "JCook2274",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Good value",
      "text": "While many other WAP are much more expensive, this Linksys unit does a great job for the price range. We installed a few around our warehouse and the coverage is great around all of the tall racks and our connection seems to be solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great small business access point",
      "text": "Product was a little pricey, but works great for our small business. Arrived on-time and in great condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Easy install right here!",
      "text": "Easy to install, program, and comes with all the extras!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Landry",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "provides service as prescribed",
      "text": "Setting up the access point was easy and provided the access I required.",
      "rating": 5.0,
      "verified": true,
      "author": "dlchilders45",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "This is a commercial quality unit that is easy to install and manage.",
      "text": "I purchased this to replace an access point from another manufacturer that needed rebooting every few days for reasons nobody has been able to figure out. I always have good words to say about Linksys and this is no exception. I have a business network that incorporates VPNs, VLANs, trunking and multiple subnets. This fit right into my infrastructure with minimal configuration - which should be appreciated by anyone who has ever had to deal with incompatible VLAN implementations. I was up and running with 4 SSIDs in 10 minutes. The hardest part was mounting the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "William R. Dowling",
      "helpful_votes": 0,
      "publication_date": 20201103
    },
    {
      "title": "Remotely Accessable Wifi Router",
      "text": "This product , labelled as access point AP (a 802.11 terminology), is also known as wireless router to most people. The plus point is it allows remote access from anywhere. I use the speedtest app and the wifi speed is comparable to my other 802.11ac wireless router. The caveat is this only has 1 ethernet port and the size is significant larger than a typical wifi 802.11 access point. So be aware of these before considering a purchase!",
      "rating": 4.0,
      "verified": false,
      "author": "A. O.",
      "helpful_votes": 3,
      "publication_date": 20181023
    },
    {
      "title": "Went back to Orbi but this is more affordable",
      "text": "Okay, so here is the deal...this is a very affordable price point which rather skews the overall perception (favorably) since it costs about a quarter of what my current Orbi small business system does....on the other hand, I found this less than impressive when compared to the Orbi. In my case, since I already own both, I returned to the Orbi. First, this mandates cloud set-up which sounds good but it less than impressive in action. I like the 5 year free access point but ultimately I'm not paying for the other so that more or less negates the point. Overall this is less powerful and less user friendly but also less expensive.",
      "rating": 4.0,
      "verified": false,
      "author": "AnAmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Easily accessing the cloud with this product.",
      "text": "One of the things which was not in order was that the connection to the Ethernet was limited to one connection which meant that you would need to use a separate line. Also, the recommendation was to mount on the ceiling or wall. Very cumbersome to say the least. Also, you would need a spliter to divide the cable so that you could get to the cloud and use the hard line at the computer. We set this up to use with others in our realm who are on the cloud and it worked very well. You need to have others who have the same access for you to use this properly rather than as a single user.",
      "rating": 5.0,
      "verified": false,
      "author": "Clark Isaacs",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Outstanding Wireless AP",
      "text": "The device is GREAT!!!! It was easy and simple to install. I wired it for PoE and used the Linksys PoE Injectors. These are rather lite weight and easily attach to ceiling tiles. The Management App is also easy to setup and configure for their domain. It is really easy to cluster these together so that your wi-fi devices never lose signal and don’t have to worry about roaming between APs.",
      "rating": 5.0,
      "verified": false,
      "author": "ACE",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Linksys Business AC1200 WiFi Cloud Managed Access Point is an effective Wi-Fi router access point",
      "text": "Linksys Business AC1200 WiFi Cloud Managed Access Point is an effective Wi-Fi router access point. It covers a wide area and is convenient to use. Remote access is widespread and easy to get up and working. Getting it installed will take some effort. The downside is the access point should be installed on the ceiling or way up on a wall and that was inconvenient and cumbersome. And the access point itself is rather large and obvious physically. Once you get it installed, however, it works well. It is well-priced and it does the job for multiple users.",
      "rating": 4.0,
      "verified": false,
      "author": "Resips",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Great For Large Enterprises, Or People Who Really Want Great Coverage...",
      "text": "I bought this for my home and it covers the whole house and some of the yard. That's really good compared to several others I have used. I work in IT, so I'm bound to have some things that others might think are excessive... However, if you're a big company, then this will also work well for you. Up to 5 SSIDs so you can have multiple networks, and great features. My only complaint is the lack of PoE. But I didn't think that was enough to knock it down a star.",
      "rating": 5.0,
      "verified": false,
      "author": "B. McCarthy",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Works fine for a non-tech person",
      "text": "We have another similar wireless model from this company, and now this one for our new space. Works fine, is as described. The think I like best is this: \"Cloud Manager lets you remotely manage multiple networks, access points and clients from one centralized and easy-to-use dashboard that's accessible anytime, from any device. \" Good product.",
      "rating": 4.0,
      "verified": false,
      "author": "Catherine Todd",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Easy to setup Access Point",
      "text": "The setup GUI is easy to follow and this AP has a lot of options to control its functions. We added the LINKSYS AC1200 to our system of Cisco WAP551 APs. We did not use the Cloud Manager but set it up for local control. The download and upload speed test of AC1200 is about the same as the WAP551. This AP is easy to install, just remember the connections face the ceiling.",
      "rating": 4.0,
      "verified": false,
      "author": "Rivendell",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Works Well",
      "text": "Once installed this worked well. the unit itself is rather large and requires placement on a wall or ceiling and an ethernet connection. Not the easiest or the most attractive. However, it works well. I think it is best in a business larger than mine or a warehouse type setting. It is too much for just home use. Affordable option.",
      "rating": 4.0,
      "verified": false,
      "author": "Antigone Walsh",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Fast, easy to install access point.",
      "text": "This access point was easy to install and has good range. You can program up to 5 SSIDs for each band and it can be programmed locally or through a Linksys cloud account. Includes AP, power supply, a patch cable and mounting hardware to mount to a wall or ceiling. It also has a status light to tell you if it is active and has any clients connected.",
      "rating": 5.0,
      "verified": false,
      "author": "The Toolman",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "High Speed & Steady WiFi",
      "text": "This WiFi Cloud Access Point is very handy for extending your WiFi to remote areas of your home. I use this one in the sunroom where normally a fireplace blocks much of the signal. Now anyone can use that area with a laptop, tablet, iphone, etc. The signal is always steady.",
      "rating": 5.0,
      "verified": false,
      "author": "Perfect Moment",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Painless network access for a busy office",
      "text": "I loved how easy this was to set up in our co-working space and there was a HUGE difference in how we were able to effectively compute and get things done. This makes connections more steady, accessible and headache-free at a tremendous price!",
      "rating": 5.0,
      "verified": false,
      "author": "NaughtiLiterati",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Fast to set up, easy to use.",
      "text": "Designed for business use, this is a wireless router that has some great management tools for monitoring use and usage via the cloud from any location. Set up was simple, it it has performed reliably for streaming video content.",
      "rating": 4.0,
      "verified": false,
      "author": "Maine Writer",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Great for extending a home network",
      "text": "This has worked really well for keeping everything connected. I have a smaller house, but was having issues with my signal out to my garage, as well as having devices drop, since I have about 25 devices on the network at any given time. Setup was pretty easy, and I was able to get it online within about 5 minutes. Since it's come online, my connectivity is totally solid in my garage, and there are no more teenagers screeching because their FaceTime call dropped.",
      "rating": 5.0,
      "verified": false,
      "author": "B. Anderson",
      "helpful_votes": 0,
      "publication_date": 20190725
    }
  ],
  "product_meta": {
    "title": "Linksys Business AC2600 WiFi Cloud Managed Access Point with Remote Centralized Management & Real-Time Insights On Network Activity, 802.11AC, Poe (LAPAC2600C)",
    "description": "Model:AC2600The Linksys business LAPAC2600C cloud wireless access point delivers wireless data transfer rates of up to 2.53 Gbps and includes* Linksys cloud Manager, our web-based Wi-Fi network management solution. Cloud Manager lets you remotely manage Multiple networks, access points and clients from one centralized and easy-to-use dashboard that's accessible anytime, from any device. Cloud Manager will alert you to any network problems. You can access it from any computer, tablet or mobile phone and easily get real time statistics on the health of your network. The Linksys LAPAC2600C can be set to adopt the configuration of other access points and can be pre-configured before it is turned on for rapid deployment. * a 5-year Linksys cloud Manager license is included at no additional cost. When it expires, you can choose to purchase the license for an additional five years.",
    "rating": 4.5,
    "feature_bullets": [
      "Wireless Data transfer rates of up to 2.53 Gaps (Dual-Band, AC2600 AC wave 2)*",
      "Poe+ compatible, wall or ceiling mountable",
      "Browser-based, remote management with one centralized, easy-to-use dashboard",
      "Includes Linksys cloud Manager for 5 years at no additional cost",
      "Zero-touch provisioning (configuration) for rapid deployment with real-time alerts and statistics on network health and performance"
    ],
    "specifications": {
      "Wireless Type": "802.11ac",
      "Number of USB 2.0 Ports": "1",
      "Brand": "Linksys",
      "Item model number": "LAPAC2600C",
      "Item Weight": "1.87 pounds",
      "Product Dimensions": "9.33 x 9.57 x 1.72 inches",
      "Item Dimensions  LxWxH": "9.33 x 9.57 x 1.72 inches",
      "Color": "White",
      "Manufacturer": "Linksys",
      "ASIN": "B07L75Z94F",
      "Date First Available": "December 18, 2017",
      "Customer Reviews": "4.5 out of 5 stars82 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#192 in Computer Networking Wireless Access Points"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Wireless Access Points",
      "Networking Products"
    ],
    "price": ""
  }
}