{
  "website_summaries": [
    {
      "verdict": "A budget-priced wireless headset mic that offers more functionality than you might imagine at this low cost.",
      "pros": [
        "Comes with a boom microphone, noise-canceling technology, and a compact charger",
        "This lightweight model can pair with up to two Bluetooth devices at once so you can enjoy music when you are not on a call"
      ],
      "cons": [
        "Reconnecting after the signal has dropped can be a bit more difficult than expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Comfortable and easy to use",
      "text": "Title says trucker headset, but I use this when working from home. Comfortable and easy to set up and use.",
      "rating": 5.0,
      "verified": true,
      "author": "KanahaK",
      "helpful_votes": 131,
      "publication_date": 20190419
    },
    {
      "title": "Great for the price",
      "text": "Great for the price. They are lightweight and you can spend a lot more money for the same quality. I am on the third day and it is holding a charge, also very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 130,
      "publication_date": 20190424
    },
    {
      "title": "Excellent sound quality",
      "text": "The headset is lightweight and very comfortable to wear, you get used to it on your head very easily. Sound quality is excellent on both sides of the call. I could hear them and they could hear me equally the same crystal clear. I used it on skype and still perfect sound. I was especially happy with the charging stand not only does it charge but can also just store the headphone safely rather than placing it on the desk or drawer. Lastly, battery life is another strong point as it lasted a few days for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Leon",
      "helpful_votes": 133,
      "publication_date": 20190319
    },
    {
      "title": "If you use phone to much these is not trucker bluetooth",
      "text": "This is not trucker bluetooth. I don't like it. When I call someone is voice cutting.my Ears pain I give one star because look nice",
      "rating": 1.0,
      "verified": true,
      "author": "Lakhwinder singh",
      "helpful_votes": 89,
      "publication_date": 20190313
    },
    {
      "title": "Great value",
      "text": "Bought this to use at work since we are going phoneless and will only have skype phone going forward. Works great, no issues with hearing or connectivity and super light and comfy to wear. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie L",
      "helpful_votes": 130,
      "publication_date": 20190430
    },
    {
      "title": "No static like other Bluetooth headsets",
      "text": "Connectivity and sound quality very good, no static on the line like I get from other Bluetooth headsets. The size fits my head well after placing it on max size increase",
      "rating": 5.0,
      "verified": true,
      "author": "Sammany Chea",
      "helpful_votes": 131,
      "publication_date": 20190414
    },
    {
      "title": "On time as advertised...",
      "text": "Simple to pair with iPhone... Works just fine for my purposes...",
      "rating": 5.0,
      "verified": true,
      "author": "William S. Hood",
      "helpful_votes": 126,
      "publication_date": 20190228
    },
    {
      "title": "freedon to move around",
      "text": "a bit early to review since i just got the headset two days ago and today is my first day at work, but so far it is doing all it is advertised to do. I got this solely for the ability to leave my desk and still be available to take a call. Being able to move around is key to me since i will need that ability in two months after a knee surgery to help in recuperation.",
      "rating": 4.0,
      "verified": true,
      "author": "rickster568",
      "helpful_votes": 131,
      "publication_date": 20190413
    },
    {
      "title": "comfortable and does not cause discomfort",
      "text": "very cool stuff! my husband is a truck driver, and he spends a lot of time on the road. We tried different versions of the headset (wired-headphones with a microphone; wireless headphones; a speaker), but still it was very hard to hear - there was always some noise or echo. With these headphones, I finally hear it !!! And he hears me. and they are also very light and hardly felt",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 118,
      "publication_date": 20190206
    },
    {
      "title": "Highly recommend",
      "text": "I love this thing. Easily connects to your smart phone. The head band adjust to fit perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy O’Pry-Foley",
      "helpful_votes": 113,
      "publication_date": 20190130
    },
    {
      "title": "Excellent purchase!",
      "text": "The sound, feel, and comfort level is amazing. I have it plugged into the side of my work desktop computer and it charges all day. The handy docking station is great!!",
      "rating": 5.0,
      "verified": true,
      "author": "John R",
      "helpful_votes": 112,
      "publication_date": 20190404
    },
    {
      "title": "Love this new headset!",
      "text": "This comfortable headset is so convenient. It makes it super easy to multitask while working. I don’t have to stop every few seconds and wrestle with my cell phone, with a click of a button I’m able to take all my calls. Also user friendly for the less tech savvy and easy to connect.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Hardy",
      "helpful_votes": 115,
      "publication_date": 20190205
    },
    {
      "title": "Great Headset",
      "text": "Very happy with this headset. Works great! I like the stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 113,
      "publication_date": 20190222
    },
    {
      "title": "Just works!",
      "text": "I've been using wired headsets for awhile now. I've tried and shitcanned most of them. I work remotely, and this headset you'll have to pry out of my cold, dead hands. Paired with my Samsung Galaxy 8, this headset is the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "James D Anderson",
      "helpful_votes": 119,
      "publication_date": 20190501
    },
    {
      "title": "Very good quality!",
      "text": "Headset works well. Reasonable call quality, I use in a home office so I cannot comment on noise isolation but people have been able to hear me clearly. I have the headset paired with a Mac and have used the headset with Skype, Zoom and Somersetting successfully. The headset is comfortable to use for long periods of time and the charging stand is solid and of a nice weight so it doesn't fall over when the headset is connected.",
      "rating": 5.0,
      "verified": true,
      "author": "LADET jacky",
      "helpful_votes": 110,
      "publication_date": 20190516
    },
    {
      "title": "Well thought of bluetooth headset",
      "text": "Fits well with my head frame and very comfortable to use.I always video call my family in the Philippines and they have all the chicken noise and all the noise there is. This has noise reduction function which works so well and I love the most. Headphone is light and battery life lasts long. Definitely would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Aiko",
      "helpful_votes": 112,
      "publication_date": 20190527
    },
    {
      "title": "Nice headphones",
      "text": "I use this for work especially when I’m on the road Traveling and on the phone a lot. It connects to my laptop via Bluetooth and works great! And the wireless connection is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Antoine",
      "helpful_votes": 85,
      "publication_date": 20190519
    },
    {
      "title": "Mom loved hers, so I bought myself one",
      "text": "So handy to just pick it up from its cradle when at home especially when I have to make a call where I’ll be on hold for long periods. A great reason to use over a single ear works great when you have to keep tabs on other goings on at the same time. Since adding this headset to my daily use, I save my earbuds for outside the home. In my situation, it allows good balance in keeping everything charged. This one fits me a tad better and has quality sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 120,
      "publication_date": 20190401
    },
    {
      "title": "Works great",
      "text": "It works as advertised. The only issue I have that it hurts my ear after using it for several hours. I would not recommend it for long running meetings.",
      "rating": 4.0,
      "verified": true,
      "author": "Rudy P",
      "helpful_votes": 86,
      "publication_date": 20190221
    },
    {
      "title": "Easy setup with Win 10 PC but where’s the mute?",
      "text": "Easy Bluetooth setup with my Windows 10 PC and with both Zoom and Skype. The clarity is good. I did some testing in Skype and the sound from my microphone is good but I’m unable to mute myself by pushing the boom straight up, as advertised. Mute is a critical feature for me and a main reason I bought this headset. How do I get the mute to work?",
      "rating": 3.0,
      "verified": true,
      "author": "Aratay",
      "helpful_votes": 17,
      "publication_date": 20190422
    },
    {
      "title": "Perfect for standing while teaching",
      "text": "So excited to have a one ear Bluetooth headset. I teach online classes and I can hear myself and my students so much better with one ear headphones. I am so excited to have the Bluetooth capability so I can stand and move around while teaching and not get tangled in the cord.",
      "rating": 5.0,
      "verified": true,
      "author": "SJD",
      "helpful_votes": 100,
      "publication_date": 20190520
    },
    {
      "title": "Works well up to a point.",
      "text": "Pro: 1) Fits well 2) Easy to link to phone 3) Price is reasonable. 4) Works much better than computer audio for Zoom or Skype calls 5) Listeners have no problem understanding me 6) The charging stand is great. Cons: 1) The quality of the audio amplifier circuitry is sub-par. This is an inexpensive unit - it works well in most cases. However, if the speaker has a low pitched voice and speaks loudly, this headset will turn their voice into a disturbing fuzzy blur -- where words may be difficult to make out. I probably would have returned this unit if my return window hadn't passed.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie K",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "This is a game changer for handling calls at home during this coronavirus debacle",
      "text": "I am using this with a thinkpad laptop. It synced up easy. I had to fool around with the selection in setup, as I keep my wired headphones connected as a backup. Using with slack, skype and team calls. No problems. Walk around the house and get a cup of coffee or let the cat in while in a long meeting. Too soon to tell about the battery life. Such freedom while lock inside! Also note: my iphone bluetooth does not detect this headset. I have a bluefit for the iphone. This bluefit wireless headset is not detected by the laptop blue tooth. Other than the charging mechanism, they are identical physical headset with obviously different signals. Whatever :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Sisson",
      "helpful_votes": 71,
      "publication_date": 20200402
    },
    {
      "title": "don't waste your money",
      "text": "Was happy with the headset when I first got it but after about 6 months it wouldn't hold a charge. Couldn't find my warranty info so I finally tracked down that Wilful brand is made by Yamay. Sent them an email about my problem and never heard from them. Just tried to access the Yamay website and received a fatal error message. Couldn't access warranty via Amazon and was referred to manufacturer webstie. Don't buy Wilful or Yamay brands, you'll be disappointed if you have a problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Karmalitta",
      "helpful_votes": 2,
      "publication_date": 20190929
    },
    {
      "title": "Clear sound bluetooth headset",
      "text": "I like this product because of the \"MUTE\" feature during a phone call. Just swivel the mic stem upwards and the device will beep every 15 secs reminding you its still muted. No bluetooth headset I own allows you to reject a call, click over on a call, or keep the orignal call active during a 3-way call until I purchased this headset. I use it mainly for talking being its a mono headset, but the quality sound for playing music is fine. Doesn't take long to charge, provides extended hours of talk time when used at full charge. The only complaint I have is the band doesn't adjust to the size of your head. Overall a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "TheGPak",
      "helpful_votes": 2,
      "publication_date": 20200605
    },
    {
      "title": "wanted to like these, for working from home",
      "text": "unfortunately the main feature i was attracted to was the flip-up mike mute function, which did not work on a PC (windows 10). plus, even if it did work, you would need two hands to flip it up due to the mike pivot being so stiff. To add injury to insult, this headset pulled out my hair every time they moved! (i have very short hair). On the bright side, sound was decent, although a bit noisy.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Decent for the money but not compatible with Skype",
      "text": "Faced with paying over $100 for another headset, I decided to give this one a try. I used Skype for Business/Lync, and immediately discovered you can't answer or end calls by pressing the button on the headset. Instead Windows interprets it as mute/unmute, or play/pause. I contacted the seller and they verified this was a problem. For voice, the sound quality is very good. For music, it's pretty bad.. not that I'd use it for music but I tried it. Beware the first charge cycle will run down very quickly, but after that the battery seems to be holding as expected. I instead paired it with my cell phone and it works as it should.",
      "rating": 4.0,
      "verified": true,
      "author": "Kiran Otter",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Works Well for 6 Hour Conference Calls",
      "text": "Wireless connection easy to make over Bluetooth to my MacBook Pro. I also bought a second one for my wife and it paired with no issues to her Windows 10 laptop. Sound in the ear is good, speaking was a little choppy but re-pairing the headset to the computer seemed to fix it. Headset is comfortable for a few hours, though through 6 hour meetings it can be a little bothersome so I swap the earpiece to the other ear periodically. Swing arm mic is great and easy to change from left ear to right ear and back. Battery life is great, 6+ hours in a conference call with no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Works great in my house",
      "text": "I have long-talking friends. This headset allows me to chat and iron, house clean, go from room to room without interference. Just have to keep my cell phone in my pocket. If you leave phone in a room and go elsewhere, the connection starts to fade and gets staticky. So keep your cell with you. It is paired with my iPhone X.",
      "rating": 5.0,
      "verified": true,
      "author": "beach9JONES",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Not a friendly device to set up.",
      "text": "DANG!!!! I had the hardest time getting this device to pair with my laptop for me yo use for meeting and taking calls. What they don’t do, is to provide you with the blue tooth device name:, (BH-M9S). provide you with instructions. All the while I was searching for willful as the device name. Long story short; you have to Press and hold the MFB ( the button on the side). to turn off the M91 then press and hold the MFB 6 seconds to enter into pairing mode blue and red LED flashes alternately. WOWED!!!!!",
      "rating": 3.0,
      "verified": true,
      "author": "white",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Grandma can hear me again!",
      "text": "I bought theee to talk with my 95 year old grandmother. She is very hard of hearing so any background noise on my end (especially while I’m driving) makes it impossible for her to understand me and impossible for us to talk. I’ve tried so many headsets and I even wired up a car radio in a wooden box for her so she could put it on hands free and turn it way up. So when I inboxed these and called her, she said it sounds like I’m sitting right next to her! Hooray! I love talking to my grandmother!",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "SAFTEY RISK",
      "text": "Headset battery gets VERY HOT, VERY HOT to the touch after only minutes on the charger. This should be viewed as a safety risk! Imagine if the headset battery exploded right beside your head!! Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Hunter O.",
      "helpful_votes": 3,
      "publication_date": 20191110
    },
    {
      "title": "Not good at all",
      "text": "Lasted only 2 months. Poorly Chinese made .No noise cancellation.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Salah",
      "helpful_votes": 3,
      "publication_date": 20200317
    },
    {
      "title": "Great headset. Till it wasn't....  Daily use. Long battery life.",
      "text": "UPDATED - After about a year of daily use, the metal headband came loose and disconnected from the structure. A few pieces of plastic broke off which may have caused the assembly to lose the 'clamp' pressure on the head band inside of the assembly. Technically, the headset is a great value in terms of noise canceling, bluetooth distance, and sound quality. I'm just disappointed the headband just broke. I have used this for several months and love it. It works so well, I have started taking it out of my office to the car for drives as well.",
      "rating": 2.0,
      "verified": true,
      "author": "DarCob",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Unable to pair with my work labtop",
      "text": "I have a dell windows 10 laptop that I use for work. I purchased these headphones so that I can be more active while taking phone calls. Unfortunately I believe my work has blocked the Bluetooth pairing capability so I was unable to use these headphones. The arrived on time and look exactly as pictured.",
      "rating": 5.0,
      "verified": true,
      "author": "marierose88",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Well worth the price",
      "text": "Very happy with this device. I have tried two other headsets, the first clipped around my ear and was uncomfortable. It quit charging after a few months. The second was the \"ear bud\" necklace type,. also uncomfortable and the quality of speech was less than desirable. This unit is comfortable compared to the others and performs beautifully. In addition, the docking station is so much better than having to plug in the cord type charging sets.",
      "rating": 5.0,
      "verified": true,
      "author": "augie",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Perfect for work",
      "text": "Since COVID -19 we have been working from home - o ordered this head set because I worked in a call center - I am now wearing this headset 8 hours a day , 7 days a week - it’s perfect ! One hiccup - instructions say if you lift up the microphone it mutes the call ..... it doesn’t work lol - I thought I was muted and I wasn’t . Besides that it’s perfect .",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica M.",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Truck driver, tow operator, dispatcher",
      "text": "This is the headset that we needed. Husband was always hard to hear wearing the neck Bluetooth headset, and the ones that fit in the ear were just to small for his big hands so came across this and we have a WINNER. I bought me one for dispatching and love it. Window down, driving, radio on can still hear clients on the other end and they can hear me. Charge it about once a week if not longer and use it everyday. Anywhere from 10-18 hrs. Battery life is amazing",
      "rating": 5.0,
      "verified": true,
      "author": "MelTaf",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Gave it to my wife",
      "text": "I originally bought this to use it with my Windows 8 laptop, but for some reason it didnt pair with it (neither did other Bluetooth headsets). So i ended giving it to my wife to use with her cell phone in the house while being handful. Sound quality is ok, not sure about battery life since we always have it docked so it's always fully charged when used. Bit skeptical on the durability of the ear cushions since it seems to squeeze in the the docking space, so will have to see how long it will last.",
      "rating": 4.0,
      "verified": true,
      "author": "Rami",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Easy to connect, clear sound",
      "text": "Got this to use while providing telehealth during COVID and it has worked out very nicely. It was easy to connect to my windows computer via bluetooth and the sound quality is great. Easy to charge through USB between calls or overnight with included doc or cable. I was afraid it wouldn't be very comfortable to wear all day since I'm used to earbuds but I actually don't really notice it at all. I think it was definitely worth the price for the convenience.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Callers Say it Sounds Like You're in a Tunnel",
      "text": "I bought this headset to use as a volunteer with a call center. I had no problems hearing others, but when I spoke to them, they said it sounded like I was in a tunnel and was static-filled. It was also not seamless between 2 devices. I returned this headset. I bought another headset from ICOMTOFIT that is less bulky for $39.99. People can hear me clearly, it has much better quality and connection between 2 devices, and I can wear it all day without charging.",
      "rating": 3.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great headset for the price.",
      "text": "I use this for customer service at home work so I needed a great Bluetooth headset. This is a great headset and price. The only thing I would say is the cushion for ear to be maybe a little bigger and softer but it is still comfortable. I have used this head set while on zoom, Skype, Mac computer, windows laptop and my IPhone. Connects quickly no interference and I can walk around my house and other rooms in my house without loosing connection or clarity and I do have a 2300 square foot home. I love my head set and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Lots of background noise",
      "text": "I purchased this product in order to attend conference calls. The sound overall is strong however the microphone seems to pick up EVERY little bit of background noise no matter how minor. I am needing to constantly mute and unmute the line in order to not distract others on the same call. This product is promoted as being \"noise cancelling\" however I am not having the same experience. I also cannot find any settings or directions on how to adjust this if it is possible. I may need to return this as I am not able to use it. If there is something that I am doing wrong someone please let me know.",
      "rating": 3.0,
      "verified": true,
      "author": "Chad444",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Excellent Sound Quality",
      "text": "I've been using this for Teams meetings lately and is much more comfortable compared with the over-the-ear headphones I was using previously. Zero issues with laptop or Android phone connectivity, clear audio and great noise-canceling properties. I like the charging base that's included - it's compact, delivers a solid magnetic connection with the headset and has a good weight to it, no chance of tipping over or sliding around. I have yet to experience low battery so is certainly exceeding my needs for the numerous conference calls I've been attending lately. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle C.",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Reasonably good product, very good value.",
      "text": "Good but not outstanding product. Sign quality is good and everyone seems to hear me just fine. Only two drawbacks. I have a larger head and the fit is a little tight so it could be more comfortable. You have to line it up just right to seat it in the charger. The cushion on the earpiece softens the feel of placing it in the charger. There's no click or snap to know that it's seated properly and when the microphone is vertical it is hard to see the led light indicate it's charging. Other than that, this is a good product that is priced MUCH better than other headsets on Amazon.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Sanger",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Not a good product",
      "text": "First, this was advertised as working with iPhone and iPad. The mic does NOT work with either. I called for tech support . After 30-45 minutes, the tech decided to send me a replacement. Same issue. the bluetooth mic does not seem to work with iOS devices. I decided I would just use it with my computer. The sound quality is so terrible, I only lasted about 15 minutes with the headset on and I had to shut it off.",
      "rating": 1.0,
      "verified": true,
      "author": "JNB",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Flaky Bluetooth connection if used with Microsoft Teams",
      "text": "I tried using this With Microsoft Teams. One feature that was very important to me is the charging base. But whenever I would put the headset into the charging base, it would cause Microsoft Teams to freeze, the Bluetooth disconnected, etc. When it worked, it worked well; very light sound was ok. When it went sideways, it really went sideways. Maybe this would be good if only paired with a cell phone, but it didn't work well with my computer.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Very nice product, happy about the purchase",
      "text": "I enjoy this device. Very easy to connect and I don’t see any difficulties after the connection. Few of my other head phones I tried before used to get disconnected quiet often, But this works very well. I was in call for more than 6 hours after having it charged for an hour, battery did not go down. Simply amazing. It's not that weight and not disturbing my head. Very nice head set while working. I would recommend it strongly to anyone looking for work head phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Karthikeyan S.",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Hesitant at first",
      "text": "I was hesitant at first to buy a product name that I didn't recognize, but the site description sold me on it. I am very satisfied with this headpiece. I can use it with my laptop and also I can use it with my cell phone (one at a time of course). It is comfortable on my head. I love that it is wireless and I can walk around the house with it and be hands free to do other things.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane P.",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great hands free, with charging base",
      "text": "This is a great headset / mic combo. I have used many different, wired and wireless and the base set this apart from the rest. I simply rest it in the charging base and a magnet holds it in place to charge, ready for my next call. Battery life is very good for a device that is this light weight. Its padding is very comfortable on the ear. Cant beat the price. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Grilli",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "comfortable, reversible, reasonable",
      "text": "I tried many headsets and have been very unhappy and returned several. I need one that does not noise cancel, do not keep reading if that is what you need. Because it only covers one ear, it can't be noise canceling - but comfortable? very. Incredible that I can use it with my hearing aids without feedback and while they don't say so in the materials, it is reversible. So for three-hour classes on Zoom, when my ear gets tired, I just switch sides and pivot the microphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Haz2RavG",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Awesome headset",
      "text": "When I talk to people, they are unable to tell when I switch from my phone to the the headset and the sound on my end is perfect. Sometimes I move away and forget to bring my phone while talking, and I'm halfway through the office before the signal starts to cut out. It has an impressive range. I'm using it for my cell phone and for the computer at the same time. I not keep it on the charger when when it's not in use, but i left it for 3 days without charging and start to use it after my break, battery was alive. I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Boris Egorov",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great, if it were to work uninterrupted",
      "text": "The headset quality seems good, and holds its charge, but I have been having major issues with the bluetooth connection just dropping midstream. I asked the supplier, and they just said - 'try repairing'... which did not work. Unfortunately for work calls or driving that is too much risk to have the call ping pong back from home to headset. Do not recommend",
      "rating": 2.0,
      "verified": true,
      "author": "Scott Morrow",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Good headset for the price, a bit tight, but sound is great.",
      "text": "(Hubby Review) As a truck driver it's easy to use. Connects fast and is loud enough to drown out background noise. Only downfall I have is the headband part is tight enough to leave marks, but it does stay in place. Wife picked it out because it was a lot like the old headset I had for years that was discontinued. It's also not big and bulky. Just little tight.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Joy",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Noise canceling is amazing!",
      "text": "I have to give this headset 5 stars because it is the only one we can stand for my husband to use when he calls us from the road. I will say it didn’t take too long for him to break it, which he patched up with tape, but the noise cancelling is far superior to any other headset we’ve gotten him, and we’ve tried a few. Big trucks are VERY noisy but this mic makes his ride sound as quiet as a library. Will buy again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Shelby",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Connectivity issues. Uncomfortable",
      "text": "Purchased almost a year ago. Not bad for the price. Have had persistent connectivity issues with Bluetooth from the get go but this was bearable until recently. I teach an online class via Zoom and having to connect and reconnect my headset every few minutes is very disruptive to say the least. I keep it on the charging base when not in use so it’s probably not a battery issue. Perhaps it’s really not built to last for more than a year. My favorite Logitech lasted years but those are no longer available :-( It’s also not very comfortable. The free side tends to hurt my head after awhile. Wish there was more padding there.",
      "rating": 3.0,
      "verified": true,
      "author": "Techie Wannabe",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Very nice and clear!",
      "text": "I used to have another headset which finally took a dive. This headset worked very well, and the sound was pretty good on both ends. I had someone else in my house use them so I could hear what it sounded like for the mic, as well as listening with the headset. Great, especially for the price! I've only just received it, so I can't speak to battery life just yet.",
      "rating": 5.0,
      "verified": true,
      "author": "I am what I am",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "meets my needs- very happy so far",
      "text": "For the price, I'm happy. I've been working from a home office teaching zoom classes and my students have heard me cleary. I pair this with my MacBook air and haven't had an issue. I find the headset comfortable for my 40 minute classes and charge the headset between classes. It meets my needs nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey R.",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "High quality, impressive features",
      "text": "This headset is very comfortable, sleek and compact! The Mic seems very responsive and comes in handy for controlling devices such as your tv with simple commands. It even connects to two devices at once, which can be very handy. And the noise cancelling feature really helps when you have a lot of background noise, like the kids or pets. I have been doing a lot of \"Zoom\" meetings, and this headset has really worked well and sounds good on the other end. You can charge by plugging directly in to the headset, or by docking it on the dock it comes with. I'm impressed with the overall quality of its function and workmanship.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Tindal",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great headset",
      "text": "If you are working from home and need a bluetooth headset that will pair to either your phone or compter, this one works great. Note that the band is a little pinch-y if you have a big head like I do, and the metal appears to be spring steel as you can't make it looser. But, for the price, you can't beat it.",
      "rating": 4.0,
      "verified": true,
      "author": "Quin",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Best headset after trying numerous devices",
      "text": "I tried several bluetooth devices b4 ordering this set. My 91 yr old aunt could finally hear me clearly!! The clarity and noise reduction is great. The charge held for a couple of days at first then stopped holding the charge. The company followed up with me b4 I wrote a public review 😀 (kuddos) and I told them my issue. They are sending me a replacement! Free of charge! Great customer service!",
      "rating": 4.0,
      "verified": true,
      "author": "Whaever",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Worked great then ...",
      "text": "I an using the headset in my office and not in a vehicle. The Pros Great charging base Headset is comfortable The cons Worked perfect for about 3 weeks and then people starting hearing static in the background I was hoping this was the solution to my headset needs but alas no.",
      "rating": 3.0,
      "verified": true,
      "author": "Scubadave",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Do not recommend, it hurts!",
      "text": "First, it REALLY hurts my ear! There is beeping that I cannot figure out and to use with computer and phone you have to reconnect each time. Start your day on a skype call... connect... use phone... connect... end day.. start with phone.. connect... took me awhile to figure that one out!",
      "rating": 2.0,
      "verified": true,
      "author": "AN2010",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Great Product",
      "text": "I bought this for work as my company got rid of desk phones and went to VOIP software. Overall, this works well. It is comfortable and doesn't squeeze my head. The voice quality is decent for a headset. Callers say my voice sounds \"tinny\" at times; however, it is much better quality sound than the over-the-ear earpiece the company provided. The battery lasts through a 9 hour day, and charges in less than 2 hours. Very satisfied with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Nice headset, excellent value",
      "text": "Got this Bluetooth headset as part of my new improvised work from home setup. It is a nice headset. Battery life is good, sou d quality is good, noise cancellation is good. Value is great. I've had better headsets before, but they have cost 2x-5x what this one did. This is hard to beat for the money, and is an excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Moore",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Not just for working from home",
      "text": "I have a 6 month old baby and it's very difficult to hold my phone and in ear devices hurt my ears. This was easy to pair with my Samsung phone and it doesn't get in the way when I'm holding my baby. It's lightweight and battery lasts for days. It's also great to be able to walk around and talk on the phone with it in another room",
      "rating": 5.0,
      "verified": true,
      "author": "Tima",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Just what I need!  Easy to use/ great audio quality.",
      "text": "Great for work from home job. Easy to use/ great audio quality. Not overly complicated with button instructions clear in packaged instruction booklet. I haven't tested the battery life. I put it in the cradle to recharge when I leave the desk area - It has not lost a call at all!",
      "rating": 5.0,
      "verified": true,
      "author": "MJM in Richmond VA",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Great quality",
      "text": "I’ve used these for both work and for talking on the phone with family. They work great!! Noise cancellation is awesome. I was able to multitask effectively with no complaints from anyone on the other end and it was clear and crisp audio on my end. Instructions are relatively easy to understand. The volume buttons are easy to find and use. I would definitely recommend this product. Also, the headset is super comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim K",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Super long battery life and clear noise cancelling",
      "text": "Exceptional battery life with superior noise cancelling. I drive an 18-wheeler and have used headsets for many years. These beat headsets that have cost me 5 times as much. Great noice cancelling. Clear sound. Extra long charge life. Highlyy recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "DarkLycan",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Signal issues",
      "text": "Work great in some areas but not others. Something in the walls blocks the signal and I had to move my PC because the monitors were also blocking the signal which is odd since my other bluetooth devices don't have that issue. I have to stay in the same room but it works well.",
      "rating": 4.0,
      "verified": true,
      "author": "Mom with kids",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Mostly good",
      "text": "I only returned these because people on the other end had a hard time hearing me. They were comfortable and the sound was great on my end. But since I got them for conference calls for working from home I need people to be able to hear me. Back to the Apple corded earbuds...",
      "rating": 4.0,
      "verified": true,
      "author": "Alicia L.",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Improve video conference experience.",
      "text": "I use different devices for video conferencing. I wanted to be sure of hearing and being heard in every conference I hosted after a quick sure set up. The Trucker Bluetooth device has done the job. Since the device is intended for one ear, the sound is not perfect. However, I can hear clearly and move without restraint. Also the back ground noise is decreased.",
      "rating": 5.0,
      "verified": true,
      "author": "KenNoSen",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "value for money",
      "text": "This bluetooth headset with charging stand is great. Sound quality is excellent and the microphone quality is great. Everyone is surprised by how good my voice sounds in office meetings. The only downside is the range. It can't get beyond 10ft open space. This is a great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "KP1981",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Light weight. Good battery.",
      "text": "Great value for cost! I wear it for 8 hours a day and the battery life is good. The headset is very light weight and fits my XXL head very well. The charger has a nice magnetic base to it. The range covers the whole first floor of my house.",
      "rating": 5.0,
      "verified": true,
      "author": "The_Kerchners",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "TROUBLE WITH BLUETOOTH CONNECTION",
      "text": "This product does not maintain a working bluetooth connection. It must be re-pair before every use.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan Allen",
      "helpful_votes": 3,
      "publication_date": 20200508
    },
    {
      "title": "This is a GREAT wireless headset!",
      "text": "I just got these and was not sure how they would work. I was tired of cords, having to take my headset off to walk away from my desk and put it back on to answer a phone or be in a virtual meeting. Set up was a breeze, the sound for me and phone/conference callers is sharp and clear. One parent even asked about what mic I was using! I do not yet know about battery life but they were delivered charged and ready to be productive. If you are looking for wireless head set at a reasonable price, I can recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "DND",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Comfortable and light-weight headset..",
      "text": "I really like my new headsets. They are really light in weight and looks fancy as well. It comes with a sturdy charging station which I really like about this product. Long-lasting battery. It covers only one ear but I can hear clearly and it is padded which makes it comfortable to wear the whole day. The headband is comfortable as well. It fits perfectly. Easy to pair with my phone via Bluetooth. 100% I would recommend to everyone at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruchi",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Very Uncomfortable",
      "text": "The earpiece cushion becomes very uncomfortable after a couple hours and I have to swap it back and forth between ears during the work day. The mic doesn't work very well unless you talk loudly. The boom isn't flexible at all, so I can't adjust it closer.",
      "rating": 3.0,
      "verified": true,
      "author": "J Summers",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Exceeded ky expectations!",
      "text": "This headset exceeded my expectations. I tested this out for music (using Google play) and works well! Volume buttons easy to use, and easy to switch right into a call when I get one. The mute function is also nice on this, you flip the mouthpiece up and it mutes for you. Just as easy, flips down and unmutes. This also doesn't have the annoying delays most other headsets I have tried have, so this is a huge plus for me on conference calls.",
      "rating": 5.0,
      "verified": true,
      "author": "Haruhi",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Good fit and great sound",
      "text": "Great for use on computer for all con/call apps, i.e. Skype, Teams, Zoom. Definitely good quality sound. even provides good connection if internet slows audio quality. Have not run out of battery yet. Keep in cradle to charge overnight.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon - Seattle",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Disappointing sound, uncomfortable",
      "text": "I was disappointed with this headset. It was a bit uncomfortable to wear - pinched a bit. Sound was mediocre. Callers could hear me OK, though. I didn't keep it long enough to assess the battery life. I returned the item.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "The Correct Choice is Right Hear***",
      "text": "Love this Blue tooth headset.. Very comfortable light weight on on head. I am15years call center Debt collecter , having a headset is priority for long daily use. Using this \"Willful\" Bluetooth Headset makes job better for having the tools to get job done right! Thanks Willful🙋‍♂️",
      "rating": 5.0,
      "verified": true,
      "author": "lbraz",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Unreliable",
      "text": "I use it for Skype calls on the job. I often have to turn off and back on my computer's bluetooth to get it to work right. It gets in a mode where the other party can hear me, but I can't hear them. The other problem is that the other party complains that my voice gets highly \"digitized\" at random times. These times seem to have nothing to do with how close I am to the host computer. When working well, I'm actually impressed with the range.",
      "rating": 3.0,
      "verified": true,
      "author": "Alan S Geist",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Audio crackles and cuts out constantly",
      "text": "I bought this headset to use at work for taking calls through an online phone system. It worked for about two months, and then the problems started. The audio cuts out constantly, and it's always garbled and crackly. Of course the problems started after it was too late to return it. I'd advise against this headset, look for something that works better. The only positive thing I can say for it is that the battery life was actually decent.",
      "rating": 1.0,
      "verified": true,
      "author": "Mouse",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Great sound",
      "text": "After a while of using them, i can say they are pretty good. The sound its good, no problems pairing like others. Love the charger stand, just set them there after use and they dont get damaged. Charges fast and last long. Good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Carla p.",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Works well and doesn't slide off",
      "text": "I used it for gaming. Has clear sound, long battery life , super easy to charge, it doesn't slide off like my old head set and I could walk across my house and still be clearly heard",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Edmonds",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Excellent product, excellent price!",
      "text": "I purchased this for my husband. He's a truck driver for United Dairy and loves it. The sound quality is very good. It's easy for him to talk to me while he's driving or delivering. Sounds as good as the expensive blue parrot.",
      "rating": 5.0,
      "verified": true,
      "author": "cruegirl1",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Best decision to buy these headphones",
      "text": "Trucker bluetooth headset is an Amazing product. Perfect for callers looking to focus on calls and minimize distractions. Great noise cancelation. Anything your ears hear in the room are not transmitted. Those landscapers might annoy you, but thankfully not your clients. Build quality is great and Range is beyond exceptional. I can walk to other rooms 50ft away and answer calls through series of walls & floors. Sometimes I take calls outside! Its made me mobile while improving the quality of my calls and boosting productivity with free hands.",
      "rating": 5.0,
      "verified": true,
      "author": "SudMa",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Very Useful and very cheap",
      "text": "I bought this headset for my daughter so she could use it for school. I bought it so it would not cover both of her ear thinking this will be much better to take care of her ear. And i did not made a mistake it was a quality buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "get what you pay for",
      "text": "this headset is basically junk. the sound quality is horrible and it is very uncomfortable to wear. the only reason i didn't give it a one star is that it actually was easy to get working and use.",
      "rating": 2.0,
      "verified": true,
      "author": "Ben W",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great Buy",
      "text": "I purchased Willfull mono wireless headset. What a great wireless headset, It is well worth the price. The headset comes with a small charger base and after placing the headset of charger it took less than 1hour for a full charge. The headset itself is light in weight, I forgot I had it on my head such a comfortable fit. The talk time is unbelievable I was on the phone for at least 2hours clear reception, travel throughout my home. Another great feature you can be Bluetooth two devices, you can listen to music while waiting for a call. I like it",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Moore-Dudley",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great Product",
      "text": "I use this headset for working from home and it is terrific. I feel like the clients I talk to are in the same room with me. Easy Blue Tooth Function. The Charger is terrific with the magnet that draws the headset in. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "pam west",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Excellent product and worth the money so much that if it does break, you'll buy it again",
      "text": "I loved it. It's great for its purpose. It cancels out background notice extremely well. I used it while riding down the road with my windows down and it still worked better than just my phone speaker. Its only downside is the volume is a little low ut loud enough for you to hear. The charger is awesome and it maintains a charge for a great deal of time. Its comfortable but could stand to be a little tighter but that's a matter of individual opinion. I would by it again before I buy a more expensive model because this one works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven B.",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Crystal clear sound",
      "text": "Great product... Long lasting talk time... Sound quality is crystal clear. Fast charging... A great work from home product. A wonderful value. Very easy to set up and use. I highly recommend this headset. Very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "T. M. Kenney",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Works OK.",
      "text": "For the price, it's OK. The bar metal headband is not very comfortable. Sound quality is tolerable, but certainly not the best sound quality that I have experience - you can generally hear a conversation, though it seems a little muffled at times.",
      "rating": 3.0,
      "verified": true,
      "author": "Alan Wilson",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Great quality sound",
      "text": "Very honest thought this would just be a fill in for my blue parrot. Well blew me away good quality clear and no static at all.works like top of the line. Very light and just unbelievable sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Driver",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Frustrated.",
      "text": "Bought SPECIFICALLY for use with computer for meetings. Waste of money to use with Windows 10 computer. Works great with phone. Going to try a few more “fix” ideas to get it to work then request to return it if can’t get connected. Ad is misleading about compatibility with new computers.",
      "rating": 2.0,
      "verified": true,
      "author": "misty",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Disappointed in overall use",
      "text": "Worked fine at first, but have switched back to my air pods as have been told I sound staticky and can’t be easily heard. Uncomfortable on the ear as doesn’t sit flat on it. Overall not as good as other reviews made it sound",
      "rating": 2.0,
      "verified": true,
      "author": "William C. Ehmke",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Good quality headset",
      "text": "I have used the headset for about 6 months for work purposes 8 hours a day, call quality is great, connectivity is great, and overall they are fairly comfortable. Battery is always sufficient. I would recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Gildein",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Excellent product!",
      "text": "I went through four Bluetooth headsets and no one could hear me very well on the other end while driving. I was about to give up on Bluetooth altogether until I decided to buy this set. Absolutely perfect. People can always hear me even when it’s noisy And I can always hear them very clearly. Funny how these were the least expensive of them all. Five stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Simpson",
      "helpful_votes": 0,
      "publication_date": 20191108
    }
  ],
  "product_meta": {
    "title": "Trucker Bluetooth Headset,Willful Wireless Headset with Microphone,Charging Station,Noise Cancelling Hands Free Phone Headset for Truck Driver Call Center Office PC Skype",
    "rating": 4.1,
    "feature_bullets": [
      "★【 Noise Cancelling Bluetooth Headset】- The boom microphone enabled the newest noise cancelling tech,can pick up your voice exactly and block the noise from the surround.Willful M9A can ensure crystal-clear conversations even in noisy environment",
      "★【 Wireless Headset with Mute Function 】- When you want to block your voice during the chat, just rotate the boom mic upward to be parallel to the head band.",
      "★【 Lightweight & Comfortable Cordless Headset 】- Skin-friendly soft earpad and flexible headband,can ensure you focus on your talk with comfortable wearing experience",
      "★【 Multipoint Phone Headset 】- Pair with any bluetooth-enabled device,and can connect with 2 devices at one time.The headset can support music enjoying and voice control",
      "★【 Multipoint Phone Headset 】- Pair with any bluetooth-enabled device,and can connect with 2 devices at one time.The headset can support music enjoying and voice control"
    ],
    "specifications": {
      "Package Dimensions": "7.24 x 6.93 x 2.2 inches",
      "Item Weight": "14.9 ounces",
      "ASIN": "B07L4THGR1",
      "Item model number": "Willful - Black",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.1 out of 5 stars969 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#9 in Telephone Headsets",
      "Is Discontinued By Manufacturer": "No",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "Bluetooth",
      "Additional Features": "Wireless, Microphone, Noise-Canceling, Android",
      "Other display features": "Wireless",
      "Colour": "Clear",
      "Manufacturer": "Willful",
      "Date First Available": "September 4, 2018"
    },
    "categories": [
      "Accessories & Supplies",
      "Headsets",
      "Electronics",
      "Telephone Accessories",
      "All Departments"
    ],
    "price": 33.99
  }
}