{
  "website_summaries": [
    {
      "verdict": "This doesn’t get hot in the heat of the sun and the breathable material stays warm in the winter.",
      "pros": [
        "The installation is straight forward and it fits tightly on 15-inch steering wheels without slipping",
        "The microfiber leather material has a thick comfortable grip regardless of the weather or the temperature",
        "It is both soft and durable"
      ],
      "cons": [
        "Some people reported cracking in the material from it being folded and compressed too tightly during shipping"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Looks beautiful, but not easy to install.",
      "text": "It has given new life to my old steering wheel and looks beautiful. To be honest, it looks like it’s from the factory. The only downside was installation. It took every ounce of my strength to get this to stretch over my steering wheel. I was literally hanging off of it to get it to reach the bottom. It’s still a little crooked, but I haven’t got the energy to do it again! 🤣 Highly recommended, just make sure you’re ready to put some sweat equity into installing it if you have a larger steering wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Amour",
      "helpful_votes": 25,
      "publication_date": 20191203
    },
    {
      "title": "An Absolute Must Have!!",
      "text": "Wow, wow, wow!! This thing is perfect!! Amazing quality, great material and looks amazing. My driving has been greatly improved in the overall quality of my comfortability. I took a road trip shortly after I got it and boy did I notice the difference this made. I absolutely recommend it, you will love it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan M. Saucedo",
      "helpful_votes": 8,
      "publication_date": 20190306
    },
    {
      "title": "Great So Far",
      "text": "I have used this for a couple of months now and I love it. It fit perfect in my 2002 toyota 4 runner and looks great. Seems to be really durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Enrique",
      "helpful_votes": 6,
      "publication_date": 20190316
    },
    {
      "title": "Love this product! Could help peeps w Arthritis.",
      "text": "Another favorite buy. I thought it was going to be challenging to putting on but not at all. I was proud of myself. I love the thickness and here is why. In the early am my hands are usually swollen and fingers don't bend well. I have arthritis. This cover is thick that allows me to have a better grib and is soft. Is durable and easy to clean. I got the one in red and honestly, is really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190422
    },
    {
      "title": "so far so good",
      "text": "My wheel was weather worn and looked bad and felt rough to handle. I decided on the cover because it appeared to match the color of my interior the closest online and indeed it was a good match. Getting it pulled over the existing wheel was tight but once in-place I know its not going to be slipping while I driving even in hot weather. I can't attest to the durability because i haven't have the item very long but it I assume its going to last me the life of the vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hahn",
      "helpful_votes": 2,
      "publication_date": 20191122
    },
    {
      "title": "Money Well Spent!",
      "text": "By the end of my last long road trip my fingers felt sore touching the steering wheel. This new wheel cover fits beautifully, looks wonderful and stylish, and makes the wheel larger and much easier to grip. Much more gentle on my fingers as well. I wish I'd bought this months ago. It was sort of like having a new car for the first several days after I put it on! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "rbrett",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "Very nice steering wheel cover",
      "text": "This is a wonderful steering wheel cover! It’s very good quality. It is well-made and will last a very long time. It feels like leather! It takes a little bit of muscle to get on, but it’s pretty easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin ",
      "helpful_votes": 3,
      "publication_date": 20200107
    },
    {
      "title": "Has me covered!",
      "text": "Great looking, and appears quire durable, we'll see in time. Red stitching looks amazing in my red truck, almost as if it was an original install from the factory. Very comfortable in my hands, doesn't slip like others I've had.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 3,
      "publication_date": 20190702
    },
    {
      "title": "Soft but keeps leaking a smell",
      "text": "I would have loved this except for the fact that it keeps leaking some kind of chemical smell! The leather is soft and feels very comfortable to grip but for whatever reason it keeps leaking some kind of tannic smell. I'm not sure it's from the production or what not but if it wasnt for the smell I would have given it 5 stars. It was great on the first day but as the days got hotter it did start to get sticky and began to emit the smell. Perhaps you need to add another protective coating on top which kind of defeats the purpose of a steering wheel cover.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan T.",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Good Fit and Feel",
      "text": "The steering wheel cover is substantial and well made. It feels great when driving. It is difficult to put on, but that is because it has to be very tight to fit so well. The only thing I recommend is making sure the seam of the cover is aligned with the \"seam\" on your steering wheel. Once it is on it is difficult to \"slide\" to position it. I had to take mine off once to properly align it. I liked it enough that I immediately bought a second one for my other car. Great product at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "John Lynn",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Hard to install.",
      "text": "I got this for my husband GL450 due to his steering wheel was getting wore off. I almost gave up on installing as I had to pull and stretch it with all my strength and finally got it on. Once it on, there's no way you can adjust it so make sure you line it the way you want before you can get it on and also you will find your steering wheel is much thicker then your normal feel of your wheel. And \"yes\", as others have mention. The thread/stitching won't last as I already see ripping but for the price can't complaint and it serve it job of my purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Cc214",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "High quality steering wheel cover",
      "text": "Well made steering wheel cover. Does not have the cheap plastic feel. Good value for the price. The gray cover matched the gray interior in my Nissan Frontier perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 2,
      "publication_date": 20200303
    },
    {
      "title": "Works Great!",
      "text": "Just bought a used truck and needed to cover the steering wheel. This one works great. Remember, they are not easy to put on but you must believe. Make sure that you have a 15\" diameter steering wheel. If you do, IT WILL FIT. DON'T GIVE UP. You may need to employ a little leverage ( I use a screwdriver but be careful not to poke the leather).",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy321",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Love it!",
      "text": "I bought this is the black color and I love it. It is kind of hard to install (it took two people to put it on), but I love the look of it and it covers the wear that is on my steering wheel which is why I bought it. It did take a little getting used too since it made my wheel thicker, but I adjusted to the change easily. I'm curious to see how it will do during the winter and if my wheel will be as cold when I get in my car in the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan M.",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Fits perfectly. A real upgrade.",
      "text": "Just bought a used Chevy traverse and the steering wheel on it felt uncomfortably thin. I have never been one for steering wheel covers but for a comfort upgrade purchased this item. Could not be happier. Color matches perfectly to the interior of the car and the wheel now feels firmer in your grip and much more relaxing to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Tate",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "My car looks so much better!",
      "text": "At first I thought I had to return it because it seemed low quality and it was a bit hard to put on but with a little patience and following the instructions exactly I was able to put it on and so glad I was patient....because it made a world of difference! My steering wheel looks sleek and makes the interior look so much nicer and newer ...not cheap looking. The quality is great and very comfortable. It grips on to the wheel tightly and it looks like it’ll last a long time by the way it’s sewn and the material itself. Worth buying I’m so happy I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Lennie M-T",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "High Quality, Perfect Fit!!",
      "text": "You won't be disappointed in the appearance or quality. I ordered two, one beige and one gray, and both look great. Now as for fitting them on the steering wheel, well, now that can be a struggle if you're older like me (79); it was helpful for my wife to pull it down as I got the top started and held it in place. Once these are on, and they're definitely snug, you can forget about them ever loosening; can't imagine it.",
      "rating": 5.0,
      "verified": true,
      "author": "AdoptAPet",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "It's alright",
      "text": "It okay. I will have to update my review after driving the next few days. Be patient putting the cover on. I almost thought I bought one too small.",
      "rating": 4.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 2,
      "publication_date": 20200714
    },
    {
      "title": "Easy to install",
      "text": "I really like it. I just put it on my rav4 2011. It feels nice and snug. I am almost 50 and have very little strength in my hands due to the kind of work that I have done most of my life, but this steering wheel was easy to put on and looks like it is going to stay there. I really do recommend this one if you are in the market. I am glad that I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Fit, finish, and quality are great!",
      "text": "Product came folded but as seen in the photos had absolutely no effect on fit and finish. Some reviews complained about difficulty of installation but I had no issues whatsoever. I do recommend starting from the bottom of the wheel. This was installed over the factory black leather of my Acura TL and now I can hop in my car and drive without the pain of the New Mexico sun baking my steering wheel because the texture of the cover lets it dissipate heat. The \"grippiness\" of the cover is great also. I would definitely purchase again if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Vic Can",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "A great steering wheel cover for the price",
      "text": "I usually write pros and cons for an item but this is another one that has no cons. I wrote this review immediately because I was so impressed with how well it went on, how well it fit, and the feel of it. It looks great in my truck. most vehicles have some black accent and this will match great whether it's a very dark gray accent or a shiny black accent this cover will still match.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward B",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Nice looking cover",
      "text": "Very nice wheel cover that looks great on my suv. The Good. Looks,ease of installation,materials seem like they will last. The Bad. Stitching at the bottom of the cover near the seam had missed thread loops. The diameter of the cover is a little thicker than I would like,minor point. This would be 5 stars except for the two items noted. Too soon to comment on durability.",
      "rating": 4.0,
      "verified": true,
      "author": "GBad",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "it fit audi q3 2017",
      "text": "its nice and thick but it doesn't fully enclose the steering wheel and leave about 1/2 gap i would say, the wheel feel good not bad and it give some warmth when you driving in colder winter days, its fit audi q3 2017",
      "rating": 4.0,
      "verified": true,
      "author": "Stevienix",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Idk",
      "text": "I like the product. It’s not sexy but it covers my original steering wheel. I have problem with the Shipping though. The delivery man left the package right after the walking gate, next to the garage door and mentioned that it is a safe place to leave the package. Anyone could have picked it up and went home with it. It should not be like that. Next time u can’t get through the gate, don’t throw the package up from the walk and leave wherever u think. Just because it is inside the gate doesn’t mean it’s safe. I live in an apartment complex. This is not ok.",
      "rating": 3.0,
      "verified": true,
      "author": "avi",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Awesome!!",
      "text": "I'm really HAPPY with this purchase. My steering wheel has been getting really hot in 115 degree temps so I wanted to try this. Wow! It feels luxurious, was fairly easy to install (it fits tight) and once it was on, my whole car felt like a luxury SUV. A +++++ 5 stars from me on this one!",
      "rating": 5.0,
      "verified": true,
      "author": "TJROX",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Not the best quality.",
      "text": "I received item and installed on steering wheel but I noticed many of the seems were already broken. It was a pain in the a$$ to put on so I am leaving it on. Hope it will last :/",
      "rating": 1.0,
      "verified": true,
      "author": "Jeni",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Perfect Match",
      "text": "This was a perfect Match. I purchased the beige steering wheel for my 2011 CLS550 Mercedes, it was a perfect match. Installation was not bad ONLY because I read reviews. I put the steering wheel cover on the dashboard inside my car on a 80 plus degrees day and closed the door, after an hour or two the cover was warm and easily to put on, took be all of 5 minutes to put on.",
      "rating": 5.0,
      "verified": true,
      "author": "Eloise",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Pretty impressed with the fit and feel!",
      "text": "Pretty impressed with the fit and feel for my Chevy Silver 1500. The red stitching looks and feels great against the dark contrast of the dark steering wheel. Nice tight fit with no sliding. Not overly bully and gives a nice secure feeling on my hands for a nice solid grip. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck M",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Looks good, feels great.",
      "text": "Nice grip, not too soft. Comfortable feel, no hard stitching. Beige won't get hot in the summer sun. Rock hard steering wheels get cold in the winter, I expect his cover won't feel too cold and will warm up easy. It feels like something that leather cleaner will clean. When I trade in the car I expect to keep this cover.",
      "rating": 5.0,
      "verified": true,
      "author": "KLMD",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Fine for the price",
      "text": "For the price it’s a decent cover and I would buy again. However, after six months it has some cracks in the material and some of the stitching has needed to be trimmed and burned with a lighter (repeatedly). Make no mistake about it being real leather—it clearly is not (I’m an armature leathercrafter and the difference is fairly obvious).",
      "rating": 3.0,
      "verified": true,
      "author": "Julie Carlson",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Packaging issues",
      "text": "I wanted to like this product, and the quality seemed ok, BUT the way the company packages it leads to permanent creases in the product. I am particular with my car, so I would be starting at those creases constantly had I kept this product. The company ruins what may be a good product so they can save money on a cardboard box. There are far better steering wheel covers out there, so keep searching.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Fits my 2006 Ford Expedition",
      "text": "2006 Ford Expedition Eddie Bauer The OEM leather steering wheel had been peeling for years. This was so easy to install I should have done it a long time ago. I read other reviews that said to put the whole thing between the dash and the wheel, then pull the top over and work it around to the bottom. Installed in about 2 minutes, left it on the dash all afternoon to loosen it up first.",
      "rating": 5.0,
      "verified": true,
      "author": "Firefox",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Impossible to Put on Steering Wheel",
      "text": "This was a very stiff steering wheel cover, which made it impossible to put on my steering wheel. It wasn't large or stretchy enough, and I have a standard-sized steering wheel. Don't bother buying unless you have a really strong person to put it on for you. I tried for about 15 minutes and gave up.",
      "rating": 1.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 2,
      "publication_date": 20191011
    },
    {
      "title": "Good to go",
      "text": "This went on relatively easily and I was really surprised by how nice it looked and it also felt great holding the wheel. It’s only been on for about a month or so now (October 2019) so I can’t say how well it holds up over the long term, but my initial impression is very pleased. If I think to update this in the future I’ll try to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "SF1911A1",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Exceptional Fit & Feel",
      "text": "This steering wheel cover is really exceptional looking, great feel & grip and a good fit. It was a bit challenging for me to install (it's snug) but once it was in place I found that it to be a secure fit. It looks like a high-end automotive product. No slipping. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ActiveShopperGal",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Good fit and feel",
      "text": "Went on relatively easy, though I did hit it with a blow-dryer before to work the kinks out. Fits like a glove, feels great like supple leather, color isn't an exact match for our 2006 Sienna but close enough that I don't mind. Overall great buy, time will tell WRT durability.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Oz",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Well padded, attractive",
      "text": "A virtual match for my Audi A7's brown dash color, which is set against tan seats. Comfortable, makes the wheel rim larger which is better for my hands. Surface scrapes off as easily as others--it is NOT solid leather but surfaced in a leather veneer.",
      "rating": 4.0,
      "verified": true,
      "author": "RBY",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Nothing microfiber about it",
      "text": "Not a single bit of microfiber exists in this cover. Its a regular leather steering wheel cover through and through. When I bought it i thought that the darker part was a microfiber cloth type material between the leather but i was dead wrong. Otherwise its an okay purchase, couldnt be bothered returning it so I still use it if that says anything about the overall quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Alan Otte",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Happy with it",
      "text": "If you buy this wheel cover, warm up the cover before you attempt to put it on. I threw mine on the hood of the car on a sunny day this summer. Even so, it took me some time to get it on the wheel. It's was a tight fit, which is a good thing in a steering wheel cover, in my opinion. Otherwise, it looks great! Comfort wise, I found the seams from the pattern on the cover bothersome at first, but don't notice it too much now. All in all, I'm happy I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Eastgirl",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Better quality than I've found in stores",
      "text": "Bought this for my mint-condition 2010 Malibu. Older car so has the slightly-bigger steering wheel. Was a little challenging to get on the wheel but it's a great snug fit. Makes the wheel a little fatter, which I find makes it easier to grip and steer. And, it was a great value for the money. Wish I would have bought this years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "CMHDAN",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "I had to use wire ties to hold it in place.",
      "text": "The steering wheel on the 2017 Ram Pickup is thick on its own. By adding this cover to it makes it almost as thick as my wrist. I have Arithus in my hands so it may take a bit to get use to it. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "MoParMan450",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "wheel cover",
      "text": "It is a bit thick so takes a while to heat up with a heated steering wheel but it does. That thickness is a little much on the steering wheel as well. It's good quality and will definitely do what i need to save the leather steering wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Feel good, fits nice, doesn't slip",
      "text": "Line up the seam at the bottom first then get half of it on the wheel from there, then pull tight and stretch to get on the rest of the wheel. Feels good and doesn't slip. Definitely looks better than my deteriorating oem Steering wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Burn",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Great steering wheel cover!",
      "text": "My husband put this on our car and we absolutely love it! It is nice and soft and very comfortable to hold while driving. It is also easy to install which is always a plus.We recommended this to our kids for their cars.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ward",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "So Far So Good",
      "text": "I've been using this for a few weeks now, and so far I don't have any complaints. It was very easy to install (less than a minute), and has made driving easier for me. My steering wheel tends to be slippery, so the extra grip has been a tremendous benefit. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Easy to install - works great",
      "text": "After reading the other reviews, we left it out in the hot garage for a day. It stretched just enough so we could slip it on within less than a minute. Love the feel and grip. Looks great. Arrived as promised. Good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "K.C.",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Nice cover",
      "text": "This has been such a nice cover for the steering wheel in our car. My husband struggled to put it on at first because it was cold but he let it sit in the car in the sun for a day and was about to put it on easily after it had warmed up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Love this cover. Nice feel and looks great!",
      "text": "I had a steering wheel cover that was shot. I looked and looked until I found exactly what I wanted. Very nice product and was super easy to put on! Be sure to measure across your steering wheel to bet the right size. Found the color I wanted too! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Birdie",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Good Quality Wheel Cover",
      "text": "Very comfortable. Much better than covers sold in stores. Had bought a cover from an auto parts store and it didn't last a year. It began to peel apart after about 3 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Duncan",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "It's  very hard to install",
      "text": "I couldn't get it to fit. So, I returned it on August 11th, now you say you can't find the order, check all of my orders with amazon for the last 6 months and you will find it. I found the order on my computer.Please hurry as I was told it had to return by august 27th, which I did.",
      "rating": 1.0,
      "verified": true,
      "author": "annabananaAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "holding up very well",
      "text": "after a couple months im still very happy with it. it was a little too poofy at first, after about three days it settled in and is perfectly comfortable. i drive many different cars each day for my job, and i hate most of their steering wheel covers. this one is thin enough that you don't notice it and the grip is not sticky. its easy to put on and i have not seen any issues with craftsmanship. have already recommended this to my coworkers.",
      "rating": 5.0,
      "verified": true,
      "author": "Zipporah S",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Nice steering wheel cover",
      "text": "This fit the worn steering wheel in my 03 excursion. Looks nice and is a good tight fit. Took some effort to get it on but to me that's better than having one that loose and doesn't hug the wheel tight.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanksta",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "It is comfortable !!",
      "text": "Bought a 5 series BMW a year ago. What ever they shined up the steering wheel with would streak my shorts every time I got into my car.. This took care of the problem and feels comfortable to boot.. Durability lol how would I know it is too new..",
      "rating": 4.0,
      "verified": true,
      "author": "Michael J. Marleau",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "easy to install and comfortable fit",
      "text": "product was as described, at first i wasn't certain it would fit but after unpacking the cover and leaving it over night to loosen up it went on easily the next morning. It is comfortable to hold. The black steering wheel gets hot in the sun so this is cooler to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "victor heymann",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Love the style!",
      "text": "Super comfortable on your hands while driving and looks classy. I was worried it might look cheap but after reading many reviews I am happy I chose this cover. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "malibu",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Nice, very nice.",
      "text": "My husband is real picky about things for his car, but I got this one right. He loves it, fits great, right color.",
      "rating": 5.0,
      "verified": true,
      "author": "A. George",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "feels so much better than a bare wheel",
      "text": "My VW Jetta ,09 color even matches this wheel. feels amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Love The Feel & Look",
      "text": "It looks great! Installing it was difficult. I had to have my husband and son help at the same time to stretch it over my steering wheel. But I would buy it again. Love the feel & look.",
      "rating": 5.0,
      "verified": true,
      "author": "Csparks",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Easy to install",
      "text": "Super easy to install..didn't have to heat up, although I did let it sit near the radiator overnight. It is cushy and makes the steering wheel of my Kona less slippery. Looks sharp too",
      "rating": 4.0,
      "verified": true,
      "author": "jake",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Great product, read reviews!",
      "text": "I would highly suggest leaving the cover in the sun to warm up before trying to put it on. I left it in the sun for 2 hours and it was easy as heck to put on, no need for muscles or a man lol. Made by steering wheel thicker, no slippage, wasn't hot to touch in the sun which also a plus. I have a 95 Grand Cherokee and it fits like a glove. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree Marti",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Nice cover",
      "text": "It was perfect for what I was wanting. Very hard to put on, even after leaving it in the sun to heat up. But over all a nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim R.",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great product",
      "text": "I live in AZ. I have tried many of these. I do use fitted windshield and side window reflectors too. The most recent was silicone and got really hot. This one has stayed cool so far. It hasn't moved and closely matched the F150.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Z",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "You can't go wrong!",
      "text": "Wow! This cover is so comfortable! It was a bit of a \"stretch\" to put on, but that may indicate that it won't stretch out of shape? Love it so far. Just what I needed and wanted. Color is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Good Quality",
      "text": "I am pleased with this sterling wheel cover. I got mine in brown, it is leather with a rich look and comfortable. I drive a lincoln mkc and it looks really nice. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Maldora Harper",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Safe Comfort And beauty guaranteed",
      "text": "My hubby loves this and was not a fan of wheel covers, but I insisted for when I drive. His steering wheel was so slippery. He now agrees that the comfort and safety is a positive one and the attractive color looks factory installed.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Strumlak",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Comfy cover",
      "text": "Even though my steering wheel has a nice thin leather cover, this microfiber cover adds a layer that is comfortable to grasp and makes steering and handling a bit better. It was very easy to install and looks terrific. It is composed of very durable material and nicely put together. It came 1 day after ordering as promised. The cover was carefully packed by the supplier and I am pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken P",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Nice add on",
      "text": "A great way to take a old steering wheel and freshen it up. I live in a cold climate and it helps, my steering wheel use to be cold in the winter not any more",
      "rating": 5.0,
      "verified": true,
      "author": "stanley B",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Hard to put on but a great product",
      "text": "I got this for our old truck. It works great, and gives a very comfortable grip. It’s a bit hard to put on—takes a fair bit of grip strength. We’ve used it for about 4 months now and it seems very durable thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "pumagirl",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "I love it! It's like a new car.",
      "text": "My steering wheel was discolored and starting to tear. This wasn't the easiest thing to get on, but by jimminy I did it! It's not real cushiony, but I didn't want some kind of memory foam. It has just enough cushion to feel comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Very comfortable",
      "text": "I bought this for a 2020 Chevy Tahoe LT with a Cocoa/Dune interior. I really like the feel of this steering wheel cover. I was worried about the ridges, but they are not a problem and add to the grippiness (if that is a word). the matches very well to my interior. Align the cover so the wide parts of the design are at 10:00 and 2:00.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel D. Ptaszynski",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "This cover looks & feels perfect",
      "text": "This cover is really wonderful. I have a 2006 Toyota Corolla & my steering wheel was starting to flake & crumble. This cover looks & feels perfect. It matches my gray interior perfectly! Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Toni I",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "GREAT Steering Wheel Cover",
      "text": "One of the best I've owned. It fits without gapping in places like some do. It's understated and matte enough that you don't really even know it's there. Great grip and hugs the steering wheel without slipping around. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather L. Hendricks",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "As advertised",
      "text": "Just got this. Can't say definitely that it is durable, because it's new, but I can say the quality is great for the price, and it goes on very easily. Can't go wrong with this one as a steering wheel cover that should last you quite a few years, by the look of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Snyderdf",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Yes this is the cover you need.",
      "text": "I have issues with hand pain and this cover makes driving so much more comfortable. It's stylish and durable. I had to get someone else to install it but that was the only downside to this.",
      "rating": 5.0,
      "verified": true,
      "author": "Q",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Nice just on the thicker side",
      "text": "It is very nice and good quality just a bit thick to wrap your hands around. Installation was super easy. Start from the top then go to one side then the opposite side and then finish it off by pulling it over the bottom",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Better than expected!!!",
      "text": "Better than expected. I have a 2019 QX60, and I wanted something to put over my steering wheel for protection that didn’t look totally out of place. This cover was perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great replacement",
      "text": "Installed this on a Toyota Sienna. Feels great and was a good price. The old steering wheel was cracked and gross. Looks really nice again and the beige matched my interior. Fits snug. No slipping.",
      "rating": 5.0,
      "verified": true,
      "author": "GingerInKC",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Great",
      "text": "Good quality product! Looks very nice with my Toyota Camry grey interior. Comfy on the hands. Satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Z.",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Love this cover",
      "text": "Used on my 2008 Ford SEL Edge and it fit perfect. My car is tan and gray inside and I purchased the gray color, it looks great. Love the soft feel and very easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "MNS88",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Not bad",
      "text": "Comfortable in using, but a little thread comes out in a several places",
      "rating": 4.0,
      "verified": true,
      "author": "Kseniia Drozzhina",
      "helpful_votes": 2,
      "publication_date": 20190803
    },
    {
      "title": "Doesn't fit",
      "text": "I had this for my 07 Prius, after posting a question about if it fits or not, but it doesn't, it's obviously bigger than the wheel..",
      "rating": 1.0,
      "verified": true,
      "author": "Akram Ahmed",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Great Cover!",
      "text": "Really happy with this cover. It was so hard to get on, but once on it looks great! Set aside some time to get this baby on as it is TIGHT!",
      "rating": 5.0,
      "verified": true,
      "author": "KathyK",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Comfortable and functional.",
      "text": "Takes a little muscle to install. Comfortable grip and won't shift. Will protect steering wheel from further wear and tear and if car is new will keep wheel new. Matches well with interior.",
      "rating": 5.0,
      "verified": true,
      "author": "Calvin Cheung",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Great!!",
      "text": "Just purchased this product recently. It was a beast to get on, but I guess that is to be expected if its going to fit properly. The product has a good texture and I haven't had any slippage while steering. It fits the steering wheel very snugly and is not loose at all, which is something I was worried about. Product has exceeded my expectations!",
      "rating": 5.0,
      "verified": true,
      "author": "Blaine the Mono",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Impressed",
      "text": "I’m super impressed and content with this product. I needed a cover for my old trail blazer wheel and I’m so happy I made this purchase. DEFINITELY RECOMMEND",
      "rating": 5.0,
      "verified": true,
      "author": "Loli",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Looks good, appears good quality, feels bulky.",
      "text": "Looks good, but it's a bit thick so it feels bulkier than what I'm used to. But maybe I'll get used to it. Fits well with my 2011 Mitsubishi Lancer GTS, didn't have to pry too much to install. Came folded so you can see creases even after a full daybafter unwrapping.",
      "rating": 4.0,
      "verified": true,
      "author": "Vincent Ma",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "It feels like rubber",
      "text": "Don't hope it's a leather feel, I won't use it on my Cadillac as planned. I'll put it on my old p/u truck instead.",
      "rating": 3.0,
      "verified": true,
      "author": "J D.",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Feels nice",
      "text": "Came folded in half which was ridiculous. Installed as expected not as advertised. But feels great on the hands",
      "rating": 4.0,
      "verified": true,
      "author": "LauraH",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Not for all cars/Steering wheels",
      "text": "This is not a leather cover. Further on my Chrysler 300 it does not ‘conform its fit ‘ to the steering wheel leaving ‘wrinkles’ Where the fit is improper",
      "rating": 3.0,
      "verified": true,
      "author": "All American Lawyer ",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Luxury Steering Wheel Cover",
      "text": "I have received compliments on this steering wheel cover because it looks so luxurious and expensive. I have had it for over 2 months and has held up nicely; no signs of wear and tear!",
      "rating": 5.0,
      "verified": true,
      "author": "eliza",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Must have!",
      "text": "The steering wheel cover came folded up in its package so I was worried it would have obvious creases when I put it on. Installation was a little difficult and required extra strength but thats expected. My steering wheel is now super comfortable and I’m obsessed with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Padilla",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "A little loose",
      "text": "It’s a little loose on my steering wheel and it’s quite thick to grip but better than not having one at the moment",
      "rating": 4.0,
      "verified": true,
      "author": "Francisco I.",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Looks beautiful and easy to install!",
      "text": "It was easy to install and the fit is tight with no slipping at all. It fits exceptionally well for my Lexus RX300. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Nara",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Works as it should.",
      "text": "This is a high quality steering wheel cover , it’s nice and snug and easy to put on.",
      "rating": 5.0,
      "verified": true,
      "author": "Dre Jefferson",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Worth every penny",
      "text": "It covered up the split on my wheel. Very easy to install. Nice and tight so not difficult to drive with",
      "rating": 5.0,
      "verified": true,
      "author": "Corinne Cruz",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Awesome",
      "text": "Wow!! Easy to put on and the feel of it is AMAZING. Just like having a whole new staring wheel. Glad I made this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "peanutflats ",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "A good product for the money.",
      "text": "This was a nice addition to the steering wheel of my 2002 Toyota RAV4 4. It was easy to install and it's very comfortable to my hand, I can't speak on durability, but so far so good.. The price wasn't bad either, it gave my vehicle a \"facelift\" and I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Function",
      "text": "A little hard to get on. Nice fit once it's on though. Nice feel appears to be durable.",
      "rating": 5.0,
      "verified": true,
      "author": "ghostreader",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Easy to put on. Comfortable for driving and doesn't get too hot.",
      "text": "This is great. Easy to put on. Soft to the touch and doesn't get too hot like our steering wheels sometimes tend to do in Florida. So glad I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great product",
      "text": "Bought this for my husband for Christmas for his Silverado. Fits great and durable. He loves it! Got 5 stars for best wife present LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Fleming",
      "helpful_votes": 0,
      "publication_date": 20191230
    }
  ],
  "product_meta": {
    "title": "Ylife Microfiber Leather Car Steering Wheel Cover, Universal 15 inch Breathable Anti Slip Auto Steering Wheel Covers (Black)",
    "rating": 4.7,
    "feature_bullets": [
      "【DURABLE MICROFIBER LEATHER】- This car steering wheel cover is made of smooth and durable microfiber leather with breathable anti slip function,bring you a great touch and feel.",
      "【UNIVERSAL FIT】- Suitable for all middle-size steering wheels with diameter 14 1/2 inch to 15 inch(37cm to 39cm).",
      "【EXCELLENT SEWING】- The microfiber leather and viscose with the delicacy sewing technology makes the steering cover hide your tired looking existing car steering wheel, protecting it from further wear and tear.",
      "【PERFECT DECOR FOR YOUR CAR】- Upgrade your vehicle instantly with this simple and generous looking, luxury leather steering wheel wrap and put some fashion style in your ride.",
      "【EASY TO INSTALL】- Because of the ductility material, Any adult can easy install this steering wheel cover, no tools required. This premium product is an excellent gift choice for anyone close to you on example their birthday, Christmas or any other suitable occasion."
    ],
    "specifications": {
      "Manufacturer": "Ylife",
      "Brand": "Ylife",
      "Item Weight": "1.45 pounds",
      "Package Dimensions": "9.7 x 5.2 x 2.6 inches",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "AB-122",
      "ASIN": "B07LD3KT85",
      "Customer Reviews": "4.7 out of 5 stars970 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#1,367 in Automotive",
      "Date First Available": "March 24, 2019"
    },
    "categories": [
      "Interior Accessories",
      "Steering Accessories",
      "Automotive Parts & Accessories",
      "Steering Wheels & Accessories",
      "Automotive"
    ],
    "price": 17.99
  }
}