{
  "website_summaries": [
    {
      "verdict": "Contains all of the latest components to deliver computing speed, as well as a huge 17-inch display.",
      "pros": [
        "One of the most powerful laptops you can buy off the shelf",
        "Includes an 8th generation Intel i7 processor",
        "The 512 GB solid state drive has greater reliability and data access speed than other options",
        "Battery life up to 19 hours"
      ],
      "cons": [
        "Speaker quality could be better for a model in this price range"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "great machine!",
      "text": "What a great laptop! I put 32GB RAM (total 40GB RAM), 1TB + 2TB SSD disk space in and now have perfect machine for my coding on the go. Hacker's dream. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "MILAN VOTAVA",
      "helpful_votes": 34,
      "publication_date": 20190417
    },
    {
      "title": "Lightweight, excellent display.",
      "text": "I essentially wanted a Mac Book that wasn't made by apple. Great design, excellent display, & long battery life. That is exactly what this product is. The only major con I'd say is the SSD isn't NVMe, which at $1700, that's kinda bs.",
      "rating": 5.0,
      "verified": true,
      "author": "Fallen Shinigami",
      "helpful_votes": 37,
      "publication_date": 20190131
    },
    {
      "title": "OK Notebook - Thunderbolt 3 is a Fraud - Docks with Nothing",
      "text": "I've had this thing 6 months now. It's great if you only need a notebook computer. I bought it for the Thunderbolt 3 interface, expecting I'd be able to buy a dock and use it at home with dual monitors. I spend several hundred dollars on a Thunderbolt 3 compatible docks, nothing sees this notebook. I tried asking LGs customer support, they just came back and told me they can't tell me what's wrong with my dock. I recommend do not buy this. Yes it light, yes its screen looks good. It can't do what my old heavy HP notebook and dock could do. Total disappointment. I just don't have time to mess with this endlessly. DON'T BUY ONE",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce L Torelli",
      "helpful_votes": 8,
      "publication_date": 20191103
    },
    {
      "title": "Good screen.",
      "text": "I think the most appealing part to me is the 17 inch 16:10 screen. But the chassis is not as rigid as expected. I understand it is to reduce the weight, but I would prefer it to be stronger.",
      "rating": 4.0,
      "verified": true,
      "author": "Yutong Xie",
      "helpful_votes": 14,
      "publication_date": 20190216
    },
    {
      "title": "works perfect",
      "text": "I have no complaints but if you use it to play music/video the speakers are not that great. If you use it in a bright room or outdoors the screen is very reflective and hard to see. Excellent battery life. Very speedy. It's light weight but feels sturdy. I got it because I like the big screen yet it's light enough to carry easily. No touch screen but that's not important to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave in NH",
      "helpful_votes": 8,
      "publication_date": 20191007
    },
    {
      "title": "Nice laptop and a coerced \"donation\" to Micro$oft",
      "text": "Seems like very nice hardware, it is remarkably lightweight and the screen is very nice. Keyboard is so-so... not bad for a laptop. Touchpad is excellent. Wireless chip is excellent. It comes with Windows installed whether you like it or not (thanks a lot, LG). I do not appreciate being forced to donate money to Microsoft in order to buy a nice laptop. This is the nicest laptop hardware I have ever owned, and now that it has Debian on it, I'm sure it will be quite useful. So I give 5 stars for the hardware, and -4 stars for forcing the user into a license for garbage software.",
      "rating": 1.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 9,
      "publication_date": 20190922
    },
    {
      "title": "Extremely long battery life and light weight, powerful office application response (EXCEL, ACCESS)",
      "text": "i was first worry about 256G SSD performance since some critical comments found before purchase decision. Actual experience shows no need to worry about it. Fast enough. I test my Samsung SSD, no significant performance enhancement, but battery life dropped dramatically. I switch back.. Happy to buy this sexy machine. Highly recommanded. Well done, LG~~",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Lin",
      "helpful_votes": 9,
      "publication_date": 20191107
    },
    {
      "title": "Amazing Laptop",
      "text": "Ya, it's a little pricey, but worth it! I was having issues setting up 3 HDMI monitors - every laptop I tried gave me issues. The Gram powers them effortlessly, and the 17\" screen gives me 4 monitors and no lag. This think is fast too! Boots up in seconds, and weights nothing. My recommendation? Spend the little extra cash now, you won't be disappointed later.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20190728
    },
    {
      "title": "Keep looking, this one is not worth the money.",
      "text": "I do not like this laptop and do not feel its worth 1300.00 and i wish I had never purchased it. It feels cheap, and I dont find that it is fast at all. I purchased it as a machine to use with my photography as the color was supposed to be so rich. Not. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Angelsing",
      "helpful_votes": 6,
      "publication_date": 20191124
    },
    {
      "title": "Very nice laptop",
      "text": "Works well. Light and portable. Battery life very good, No touch screen but never use on other desktops/laptops. Fingerprint recognition very good for logging on. Very easy to upgrade. Upgraded ram - took out 8 GB card and added 32 GB (Adamanta 32GB (1x32GB) Laptop Memory Upgrade M471A4G43MB1-CTD DDR4 2666Mhz PC4-21300 SODIMM 2Rx8 CL19 1.2v RAM DRAM) . Added a 1 TB Samsung SSD (Samsung 970 EVO Plus SSD 1TB - M.2 NVMe Interface Internal Solid State Drive with V-NAND Technology (MZ-V7S1T0B/AM)",
      "rating": 5.0,
      "verified": true,
      "author": "DrD",
      "helpful_votes": 5,
      "publication_date": 20200102
    },
    {
      "title": "Veyr Thin/Light, Fairly Easy to Setup and Connect to Internet",
      "text": "The \"manual\" is equivalent to a couple of typed pages, and there was precious little additional data available on the LG web site. In fact, our unit hung-up once or twice simply running nothing but initial operating system updates. We had to turn off and reboot - never something you want to do in the middle of updates. I also beleive these were the LG driver updates that caused the freeze-ups. Almost zero hardware data included if you want to add memory or another SSD. It seems you are \"on your own\" for these type efforts. Otherwise, no complaints about how it looks, runs programs, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 5,
      "publication_date": 20190320
    },
    {
      "title": "THIS IS A LAPTOP FOR PROGRAMMERS",
      "text": "If you are a programmer who wants a bigger screen, above-average keyboard, insane battery life, top-notch portability, GET THIS ONE! Only downside is the numpad which I rarely use. Removing numpad and make keyboard bigger would be great. Otherwise, this is a productivity powerhouse",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20191107
    },
    {
      "title": "It's so light I keep thinking it's a cardboard model",
      "text": "This laptop is so light that everyone who picks it up gasps in surprise. It feels like it can't possibly be real. But the screen is huge and beautiful, it's very zippy, and the sound volume is decent. My family has started watching movies on it in front of the fire rather than go in the other room to watch the big TV.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20190216
    },
    {
      "title": "Super light and a great screen.",
      "text": "My only complaint is I wish the keyboard was larger since there is plenty of space for it. Some of the keys are squished together causing me to constantly hit the - button instead if backspace. The number pad also feels a little squished, but I’ve been using it okay. The large display and light weight are perfect of photo editing and programming.",
      "rating": 5.0,
      "verified": true,
      "author": "MJH",
      "helpful_votes": 3,
      "publication_date": 20190604
    },
    {
      "title": "Computer very slow and often does not work at all.",
      "text": "In the first 2 months, I had to take in for repair 4 times because the computer was running so slow and often would not even load a page. My computer person was not able to find the problem. I reset my Modem several times with no results. I have had to return it to LG for repair but that process will take almost 6 weeks. I would definitely not recommend getting this computer.",
      "rating": 1.0,
      "verified": true,
      "author": "S Bryden",
      "helpful_votes": 2,
      "publication_date": 20200220
    },
    {
      "title": "Showed off my screen to all my anime friends",
      "text": "I love this laptop! It's big but at the same time it's super lightweight! The screen is phenomenal, so amazing that I whipped out demon slayer on crunchyroll, and friends (all on different occasions, the anime just really makes you appreciate the quality!) The only downside is that it doesn't like to run Lightroom + photoshop very well, and when I try to play sims it also overheats. I bought a cooling pad, but otherwise I have no complaints on this computer! Am a huge fan of the fingerprint sensor as the power button!",
      "rating": 5.0,
      "verified": true,
      "author": "Jupiter Marie",
      "helpful_votes": 2,
      "publication_date": 20200305
    },
    {
      "title": "I'm Happy!",
      "text": "(I didn't rate touch screen because I don't use it.) So far, this laptop has been a dream. I have been carefully setting it up and transferring files - no problems. Battery life is excellent. Screen images are beautiful and finally I have a laptop I am willing to use with my crafting software. My favorite new game is to just hand my Gram to someone and say, \"Here, hold this.\" Universally, the response has been two seconds of silence, eyes light up, and they all say, \"Oh, Wow!\"",
      "rating": 5.0,
      "verified": true,
      "author": "J. Davis",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Very Nice",
      "text": "This thing is great. Large screen, very light & lighted keyboard. The only thing negative things are. Does not accept standard SD card. making my Cannon camera almost useless. Will accept micro SD card. So I have to use an adapter in my camera. The other thing is, not a touch screen. That may not be that bad. The screen stays clean.",
      "rating": 4.0,
      "verified": true,
      "author": "charles lozano",
      "helpful_votes": 2,
      "publication_date": 20190708
    },
    {
      "title": "Lemon",
      "text": "Stuck at lg loading screen on brand new product. continuous loop of restarting / blue screen error page.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190710
    },
    {
      "title": "Best portable machine for light work",
      "text": "I wanted something I can carry with me that is actually large enough to enable me to work as I typically do with my large monitor. And at 17\" 2560x1600 with a weight of about 3 lbs, this is it! I can have open everything I need in the screen space, and the screen is large enough I can actually read it! Love this laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean M.",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Love It!",
      "text": "I am not sure why some of the reviews said this was slow to boot?? Mine takes exactly 6 seconds from the time I got the power switch until I'm at the desktop screen and ready to go to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Robinson",
      "helpful_votes": 3,
      "publication_date": 20191127
    },
    {
      "title": "Lightweight✓ Beautiful✓ FAST✓",
      "text": "I know I'm a random person you have never met.... But seriously consider this option in your search! Note: you definitely DO NOT get 19 hours battery life. Closer to 10",
      "rating": 5.0,
      "verified": true,
      "author": "Preston",
      "helpful_votes": 5,
      "publication_date": 20190225
    },
    {
      "title": "Excellent laptop",
      "text": "Bought this for the wife,after having a great experience with my daughters 13\" LG Gram. Super light, tough enough for a college student and great performance. Worth the extra money if packability and long lasting are critical.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick J. Rogers",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Terrific",
      "text": "Huge, ridiculously lightweight, speedy, great display, love this laptop Update: Have had this laptop a couple of months. This is my favorite laptop ever. Display is great, performance is great, Lightweight, I use it for everything -- I just grab it without a charger and go around the house. I even prefer it to my Kindle Fire for reading books. Battery has ridiculously long life.",
      "rating": 5.0,
      "verified": true,
      "author": "Conrad",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Very nice laptop.",
      "text": "Seems overly flexible, would it stand up to abuse? Works great, very light weight, fantastic battery life, very clear screen visible from different angles, fingerprint reader works fine, using it with a wireless mouse and external keyboard, but onboard stuff works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill F",
      "helpful_votes": 2,
      "publication_date": 20191029
    },
    {
      "title": "Fast, light and meets all my needs.",
      "text": "This is my second LG gram. Love it. Glad they went up to 16 GB memory. Fast, light weight and meets all my needs. A desktop replacement from my perspective.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J. Mcnamara",
      "helpful_votes": 2,
      "publication_date": 20191125
    },
    {
      "title": "Solid performer, slim and light",
      "text": "Best of all worlds for desktop and large monitor replacement. It’s fast, lightweight and slim; everything works as it should. When not in use, it folds flat to leave thing’s uncluttered, and packs nicely into any briefcase. Speakers work well. I’ve been buying Lenovo’s for years with some mixed results lately and took Consumer Reports advice on this one. I couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "DAPO",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "A very pleasurable experience.",
      "text": "Fast shipping. The laptop came in the original package, with seals intact, the laptop is huge yet extremely light. Keyboard layout and the texture of the laptop will take a few days to get used to, but I am extremely satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Junseo Kim",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Can't believe how light this laptop is",
      "text": "After half a year of use, I am still impressed by the light weight of this laptop. All features work great. I didn't like that F1 key was mapped to the LG app, which i accidentally open sometimes.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20191024
    },
    {
      "title": "Very light and very fast.",
      "text": "The LG Gram is almost a light as my iPad Pro, but bigger. Probably less than half the weight of my previous lap top. The SSD makes is start almost instantly, and the screen is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Gilbert",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Large but light.",
      "text": "Large screen, light weight very portable are the reasons I gave 5 stars. It would be perfect if it had a touch screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Francis",
      "helpful_votes": 5,
      "publication_date": 20190313
    },
    {
      "title": "Exceptional Product: Way better than DELL!!",
      "text": "Wow, what a wonderful product for a wonderful price. It is light, light, light. Great display. Super BIG screen. Plus, it is FAST. Buying this on Amazon was a much better experience versus Dell. I have spent 000s w/ Dell, but I must say, I am glad I switched. Hopefully Amazon will feature very powerful desktops in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam A. Guerrero",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Great for real work!",
      "text": "Love the big screen in a small, light package. Shame they shifted the keyboard to the side for the 2020 version! I hate that. I upgraded the SSD to a Samsung to, which was surprisingly easy. ThrottleStop improved CPU performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Cohen",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "Great laptop with big screen.",
      "text": "Trackpad works much better than previous models. Fingerprint unlock is super convenient. A little bit heavier and sturdier than previous year models.",
      "rating": 5.0,
      "verified": true,
      "author": "SouthernComfort",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Great so far",
      "text": "Very happy with this laptop. I bought it after coming from a Macbook Pro 17 that I have had for 8 years and had kept going with a 512gb ssd and 8gb of ram. This laptop is a great replacement daily driver for that. The lightness and flex was a bit disconcerting the first day but think it is fine. I am confident that the laptop is durable enough. The screen is great.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Fletcher",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "battery good but not what it states",
      "text": "Battery not what it states. 9 hours avg. 10-11 hours at best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190928
    },
    {
      "title": "Stop Your Research - Just Buy This Amazing Laptop",
      "text": "I can't get enough of this laptop. My kids are jealous as it is lighter than their MacBook Air. The battery life is fantastic (at least for now) especially for a 17\" screen size. Easily 75% lighter than my last 17\" and the overall profile is SO much better. Buy this unit....do not pass GO....do not collect $200...just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "ST1983",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "extremely light weight. high quality. replaced my dell with this.",
      "text": "I went from a XPS 15inch 4k screen to this LG 17inch. Even though this isn't 4k i notice no difference in screen quality. No overheating issues. The fan doesn't even kick in when playing minecraft. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ZTalk",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Sleek, fast, and lightweight.",
      "text": "I bought this laptop about ten months ago, and so far I haven't had any major issues with the product. Compared to the other laptops I have owned, this one is by far the fastest and most lightweight. It does everything I need it to do, including classwork and running a few video games. The only issue I have, if anything, is that the computer is way more than I need, so if you don't need anything fancy, I would go with something a little cheaper. Otherwise, a pretty fantastic product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony J.",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Loud Touch Pad",
      "text": "This computer is fantastic, except the touch pad is so loud each time I click it, which is often, and it is driving me crazy. My other lap top computers did not have this loud of a touch pad. I would not buy this computer again for this reason alone because it is so annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "This is one terrible computer laptop",
      "text": "I hate this laptop it is cheap junk and doesn't work very fast.. it is so slow just trying to give you access to your pictures.. Don't buy this piece of Junk",
      "rating": 1.0,
      "verified": true,
      "author": "Chuck b",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Brilliant and runs Linux superbly",
      "text": "This is hands-down the best laptop I've ever owned. I run Linux on it and everything about it is perfect: out of hibernation, fast, amazing battery life, lovely glossy screen. Beats the pants off Macbooks. It's so stupidly light as well, so is no strain on the back. If you're thinking about getting this, stop thinking and get buying.",
      "rating": 5.0,
      "verified": true,
      "author": "DiBosco",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great laptop",
      "text": "This thing is so crazy light that I routinely ask people to pick it up, as they are blown away! Fantastic battery life. Horsepower is great. The only downside is that there is no touchscreen.",
      "rating": 5.0,
      "verified": true,
      "author": "Centeno1",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "One of the best laptop",
      "text": "Responsive, amazing battery life. Wonderful machine, you would love the 2K screen with wonderful color although it may not be the best when compared to MacBook Pro. Light to carry. I shall use the machine all day around without a charger. But do not take the words that it would last 19 hours. For ordinary use with best performance, I think 8 hours is fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Lee",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "The Battery Life Goes On Forever!",
      "text": "Light, easy to carry and the battery lasts a very long time. I concur to 19.5 hours of battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "#1 E-shopper",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "I didn't get the touch screen, although I wish I did now!",
      "text": "This machine is FAST!!! Boots in less than 10 seconds, from power button pressed on, to full, workable desktop. It's my dream machine! Looks great and keyboard feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Always Grateful",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Super lightweight, slim, perfect screen",
      "text": "It's lighter than you expect, thinner than you expect and the picture quality is stunning. Can't get enough of it :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "Love it!",
      "text": "So light weight its great! Got tired of carrying a very heavy 17 in laptop. This one is great to have to carry every day. Would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Not as advertised",
      "text": "I purchased a Windows 10 Pro and received and Windows 10 home. Cost me an extra $99 to upgrade to Pro. Laptop is great! LG gram is is very nice. Just wish I received what was advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Jones",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great laptop",
      "text": "This is the best laptop I have ever worked with. I have been using it for over a year now and it is a joy to work with. Great screen, large keyboard, very fast and quiet, with battery life that goes to 10 hours easily. I actually keep it at 80% charge to prolong battery life and never miss the juice while on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Branislav Vasilijevic",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Great deal",
      "text": "It’s been a great laptop so far ! It’s great to be so light and have a 17 inch screen",
      "rating": 5.0,
      "verified": true,
      "author": "rob lake",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Do not snooze on LG laptop",
      "text": "Solid laptop. Super lightweight and quick. It uses msata and nvme m.2 style ssd drives.",
      "rating": 5.0,
      "verified": true,
      "author": "Vaughan Smith",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "perfect size and weight",
      "text": "I absolutely love this laptop's light weight, screen size, and battery life. Great buy for anyone wanting a bigger sized screen but still needs to lug it around.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Mason",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "extremely lite weight",
      "text": "Great laptop, extremely lite weight, superfast start up! One of the best laptops I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Scanty22",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Wow.  Love the display",
      "text": "Home laptop for couch surfing. Huge screen. Lightweight. Long battery life. Reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich B",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Tech",
      "text": "This has been a great addition to our tech library.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber Shannon",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "great laptop",
      "text": "I like everything about my new LG laptop. Nothing that needs improvement from my needs as a home/office system that I carry back and forth everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "skipsdad",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Product doesnt match the item.",
      "text": "Said 500mb ssd harddrive, got 256mb instead. Already returned. The link came str8 from consumer reports which was the strangest part.",
      "rating": 1.0,
      "verified": true,
      "author": "Semper Fidelis",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Don't buy.",
      "text": "Very disappointing. Bought this machine after researching it on Consumer Reports.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Helms",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great laptop, but received 250GB instead of 512GB which I ordered.",
      "text": "I love this laptop, however I received the 250GB model and not the 512GB model that I ordered.",
      "rating": 2.0,
      "verified": true,
      "author": "RassHack",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Good item",
      "text": "Love that it is so thin and light. Everything runs quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "MAI",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Great laptop",
      "text": "Very light, large screen, I'm very satisfied with this laptop",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Ultra portable for a 17 inch laptop.",
      "text": "Excellent build quality & a joy to use. Amazing battery life. Just wish I could work out how to get a back slash when the keyboard is set to UK!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Talbot",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Really light and Powerful",
      "text": "What a great laptop computer. Really light....probably the lightest laptop I have owned. Great for taking to and from the office and for travel. Not a superstar gaming laptop but a great home or office workhorse. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Light, big, fast",
      "text": "Very light, fast laptop. Cannot feel that the ssd is not Nvme so I'm not considering an upgrade. The battery is very good. Keyboard could be better",
      "rating": 5.0,
      "verified": true,
      "author": "Tomer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Super light and fast",
      "text": "I highly recommend LG gram Laptop. Its super fast. It takes only about 15 seconds to start. It is also super light.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "The product is good, but seller feedback is good.",
      "text": "Good goods received well. I wish you a thriving business.",
      "rating": 5.0,
      "verified": true,
      "author": "jungil",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "light as afeather",
      "text": "Very light for travel.I love the large screen for my old eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Lightest 17\" around",
      "text": "I have never been disappointed by LG Gram. It is the lightest 17\" ever",
      "rating": 5.0,
      "verified": true,
      "author": "chiweicheng",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Largest screen with the lightest weight - unlike any other laptop I have ever owned",
      "text": "This computer is incredible. It has an enormous screen but is so light it has become my primary laptop. The battery life is also outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "It is an EST laptop",
      "text": "It is the lightest, brightest and fastest laptop I have ever own. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "DAN M.",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Its all good.",
      "text": "So far not complaints. Its fast, light and easy to use and carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl Gretz",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "No regret to buy LG GRAM",
      "text": "Amazing light weight and super long battery life. Performance is great and screen is lovely.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Chang",
      "helpful_votes": 0,
      "publication_date": 20200209
    }
  ],
  "product_meta": {
    "title": "LG gram Thin and Light Laptop - 17\" (2560 x 1600) IPS Display, Intel 8th Gen Core i7, 16GB RAM, 512GB SSD, up to 19.5 Hour Battery, Thunderbolt 3 - 17Z990-R.AAS8U1 (2019), Dark Silver",
    "description": "Capacity:512GB SSDDeliver necessary portability with uncompromising features on the new LG gram 17Z990. It has a huge 17 inch WQXGA (2560x1600) 16: 10 IPS display, while still slim and light enough to take anywhere. At under three pounds and delivering almost 20 hours of battery life, this LG gram is great to carry around for a long day of work. The 17Z990 also impresses with an 8th gen Intel Core i7 processor, 16GB RAM, a 512GB solid state Drive, and USB Type C connectivity.",
    "rating": 4.4,
    "feature_bullets": [
      "17 Inch WQXGA (2560 x 1600) resolution 16: 10 IPS display",
      "Intel 8th Generation Intel Core i7 8565u Processor",
      "Windows home 10",
      "Thunderbolt 3",
      "16GB RAM, 512GB SSD",
      "Mil std 810g durability standard",
      "72Wh Lithium battery up to 19. 5 hours Battery Life (mobile mark 2014 standard)"
    ],
    "specifications": {
      "Standing screen display size": "17 Inches",
      "Screen Resolution": "2560 x 1600",
      "Max Screen Resolution": "2560 x 1600 Pixels",
      "Memory Speed": "2400 MHz",
      "Graphics Coprocessor": "Intel HD Graphics 610",
      "Chipset Brand": "Intel",
      "Card Description": "Integrated",
      "Graphics Card Ram Size": "16 GB",
      "Number of USB 3.0 Ports": "4",
      "Average Battery Life (in hours)": "5 Hours",
      "Brand": "LG",
      "Series": "LG gram",
      "Item model number": "17Z990-R.AAS8U1",
      "Hardware Platform": "PC",
      "Operating System": "Windows 10 Home",
      "Item Weight": "2.95 pounds",
      "Product Dimensions": "15 x 10.5 x 0.7 inches",
      "Item Dimensions  LxWxH": "15 x 10.5 x 0.7 inches",
      "Color": "Dark Silver",
      "Processor Brand": "Intel",
      "Processor Count": "4",
      "Computer Memory Type": "SDRAM",
      "Flash Memory Size": "512",
      "Hard Drive Interface": "Solid State",
      "Hard Drive Rotational Speed": "1",
      "Power Source": "Battery Powered",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B07MNDYX9Z",
      "Customer Reviews": "4.4 out of 5 stars209 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#14,842 in Computers & Accessories",
      "Date First Available": "December 12, 2018"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": 1392.99
  }
}