{
  "website_summaries": [
    {
      "verdict": "Chaco footwear developers seem to have made another smash hit in the Z/1 Classic. They have managed to craft a great-fitting gear with adamantine durability, outstanding stability and awe-inspiring level of comfort. However, the strappy hiker has its fair share of issues, quite possibly the most disappointing of which is its alleged weightiness. To sum up, the Chaco Z/1 Classic—despite a few flaws—delivers a satisfactory performance.",
      "pros": [
        "A bunch of product testers gave the Chaco Z/1 Classic a perfect rating in the stability metric",
        "They liked its solid platform",
        "Its excellent durability impressed numerous wearers",
        "A considerable percentage of brand loyalists hailed the Z/1 Classic as an immensely comfortable hiking footgear",
        "Many owners got a great fit in their Z/1 Classic sandals",
        "This Chaco gear received a ton of praise from a few reviewers thanks to its amazingly reliable arch support",
        "A professional shoe blogger applauded the sandal’s versatility",
        "Several individuals called this strappy footwear a wise and reasonable investment",
        "Some experts raved about the grippy outsole of this multi-sport sandal from Chaco"
      ],
      "cons": [
        "Footwear critics shunned the hulking weight of these Chaco Z/1 Classic sandals",
        "Its break-in period could be shorter, according to a handful of users",
        "A couple of testers found the Z/1 Classic’s straps too complicated to configure"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Female wearing male sandal - I LOVE THIS SANDAL",
      "text": "I have a wide/thick foot...and have a difficult time finding female sandals that work for me. I ordered this pair of male chacos and am in love. They are a little long...compared to the photos I've seen of others. It doesn't bother me at all. I LOVE THESE SHOES. There was maybe two days of break-in period where my feet were just more weary at the end of the day...but no pain. On the fourth day I had these I spent the entire day in them walking all over Pompeii. They were perfect...and have been my go-to footwear all summer. I even have the \"Z tanline.\" =)",
      "rating": 5.0,
      "verified": true,
      "author": "Suzi Hansborough",
      "helpful_votes": 13,
      "publication_date": 20170928
    },
    {
      "title": "Heard great things but I hate them.",
      "text": "So I've worn these three times and absolutely despise them. Never dream of wearing them to the beach or on the trail. If sand or rocks get kicked up (which is impossible to avoid) they get stuck between your foot and the sole and the straps make it so you can't get the debris out without taking the whole sandal off. So your options are take your sandal off and restrap every 3 minutes or get absurd blisters. Even without debris I get lots of rubbing and blisters all over. These belong in the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Weber",
      "helpful_votes": 2,
      "publication_date": 20200518
    },
    {
      "title": "Superb Quality Sandal!",
      "text": "Wow! These are the strongest, most durable, and well-made sandals I've ever owned! For those, like me, with a big-toe bunion, the sandal straps do NOT irritate or press on the bunion! That's why I purchased two pairs in case they re-design them. I may be wearing them daily forever as I am retired and live in the Sonoran Desert. Super comfortable, easy to put on and remove, and just a pleasure to wear! I cannot say enough great things about my Chaco sandals! Best footwear purchase I ever made to save my feet, and like walking on a cloud!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen D. Weiss",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Chacos are the best",
      "text": "About 8 years ago I bought my first pair of Chacos, back when they used the Vibram soles. I hiked the mountains, bushwacked to remote fishing spots and generally wore them until the soles fell off. I tried the recent styles with the toe loop, but they just didn't feel right. I'm so glad Chaco is keeping this classic style available. As soon as I put these on they felt perfect, like an old friend, my feet just immediately felt at home. I have my doubts these will last 8 years, but as much as I abuse them I'm confident they'll serve me well.",
      "rating": 5.0,
      "verified": true,
      "author": "fisheswithflies",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Still the best",
      "text": "Long ago I had a pair of Tivas when they first came out. When that pair wore out, I replaced them. They were no longer strong, just stylish. Switched to Cahacos. I have been using them for many years. Excellent for walking, walking in water, on decks of boats. One pair lasted for many years of daily hard use cruising on my sailboat in the tropics. Don't change the classic in any way, please Chacos.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Great adventure sandal",
      "text": "great sandals for getting out and about or even moderate hiking. This is my first pair of chacos and it took me a little while to get them set up with the straps comfortably but now after a few months I have walked in them several miles and found them to be quite comfortable. If you splash the rue a river the straps stay wet for a little bit but drive fairly quickly compared to a keen or similar sandal with more layers. Honestly I just love the pizza slices compared to any of the other designs but the build quality has won me over to the chacos",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Perfect sandals for large, wide, flat feet!",
      "text": "I have large, wide, flat feet and its very challenging to find sandals that can work for me. Chaco is perfect though. I've had a couple in the past, too. Its outstanding because you can adjust the straps to fit your foot (even big x-wide feet) and it comfortable to wear all day long. I love them. My last pair was around 110 and worth it). This one here on Amazon was half that cost and the same high quality, perfect sandal. A+ experience all the way!",
      "rating": 5.0,
      "verified": true,
      "author": "Power Walker",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Since Chaco sold off to Wolverine, quality has dropped.",
      "text": "I've been wearing Chaco sandals for a long time. After Chaco was sold to Wolverine, the quality went way down. I own both pre and post Wolverine takeover Chacos. The new Wolverine version have spongier foot beds, don't have Vibram soles anymore and weigh less than the same model from pre-Wolverine days. Too bad, I really loved the durability and ruggedness of real Chaco sandals. Buyer beware; they're not the same as that pair you've owned for 10+ years.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "On and Off road shoes!",
      "text": "These are fantastic. My husband has lots of issues with fit in outdoor shoes. He has a wide & tall (boxy) foot. These are the first ever pair of sandals he has LOVED. They seem to address his issues with knee and hip pain. He can go further with greater comfort with the sandals. Thanks Chacos!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CMe",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Replacement Pair",
      "text": "My son loves these ! He had his first pair stolen 3 days after I purchased them . They were packed in an extra suitcase that I filled with brand new clothes I bought him when he came to visit last July. The entire suitcase went missing between Atlanta and Albuquerque. He was most heartbroken about these . So I sent him a new pair from Amazon and he loves them ! They fit well and are really in trend now . I ordered his normal size .",
      "rating": 5.0,
      "verified": true,
      "author": "Denice M.",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "SND group sent me a bad sandal",
      "text": "These are great sandals which I have worn for years. Unfortunately, I was sent one sandal which was not sewn properly and thus the heel loop sits too low. Also unfortunately, the defect was not immediately visually observable- it looked OK until one scrutinized it and measure it. Because I did not immediately ID the defect, I had already thrown out the box they were shipped to me in. If SND group sees this and fixes my problem, I will change my rating",
      "rating": 1.0,
      "verified": true,
      "author": "D. Folk",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Love my Chacos",
      "text": "ReChaco will not repair or replace sandals that they deem are too old. I thought they would if the sole failed, but no. At any rate, I had great usage from my old pair and hope to wear these out also. To me, they are the perfect footwear around water.",
      "rating": 5.0,
      "verified": true,
      "author": "William H.",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "No surprises",
      "text": "Not my first pair. I wear men’s regular because women’s are too narrow for me even in wide. These are the exact product described and are exactly like every other pair I’ve ever had for under $100, so not a bad deal at all. The shoes had fallen out of the shoe box upon delivery which might matter to some people I guess.",
      "rating": 5.0,
      "verified": true,
      "author": "Lillisaur",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "So good",
      "text": "I still have chaco’s from 20 years ago that I use for working around the house/yard. Amazing. The new ones are just as good. These things are built to last. I have bad feet problems and can barely wear shoes without much pain. chaco’s are the best answer for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunking",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Nice rugged sandals",
      "text": "These sandals are durable and well made. Don't need to do n and undo straps. They run through the whole sandal, all you need to do is loosen and tighten straps to adjust. Used them on an 1hr long light hike. Only downside is they they are a little heavy, but comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "odb",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Comfortable right out of the box",
      "text": "Super vibrant colors. My 13 year old son loves these. He said they're super comfortable. He used them right out of the box to hike in 100 degree weather and had no issues with breaking them in.",
      "rating": 5.0,
      "verified": true,
      "author": "Callie Knox",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Uniquely good sandal for hiking",
      "text": "If you've not worn Chaco's (like me) be sure to spend time adjusting the straps. They slide under the footbed for fine adjustments to tailor fit to your foot. Good arch support - wish it was a bit higher like Birkenstock's but better than most. On the heavy side but should last",
      "rating": 4.0,
      "verified": true,
      "author": "David Roth",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Uncomfortable on first two walks.",
      "text": "Friction from the top of the Heel Riser strap cuts into my right foot under the fibula. Tightening the straps helped a bit but need to wait for my foot to heal before trying tagain. Unlike another leading brand these take some getting used to and hoping they break in over time.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric S",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Best Sandals Ever!",
      "text": "I love the Chaco brand and have even tried others but this was a great deal and the craftsmanship is amazing. I have foot issues and find the arch support is very helpful. Awesome purchase and they are great for hiking or getting in and out of the water kayaking. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Pseudoscholar",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Great product",
      "text": "Bought these for the first time, for my son. He covered at least 5 miles a day with no troubles.",
      "rating": 5.0,
      "verified": true,
      "author": "J. DIAL",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "All-in-one strap design doesn't allow customized tightening/fit",
      "text": "The straps are all connected through the sandal. It's a cool design, but the action of walking lifts up on the top foot strap which cinches the toe strap and makes them uncomfortable, to the point that my toes were starting to turn blue. It's shame because the sandals seem to be of very good quality otherwise, but I like my toe strap to be little looser than this design allows.",
      "rating": 2.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Too Bulky",
      "text": "Wasn't impressed. These things were much to thick and bulky for my taste. I'm not looking for a barefoot sandal but wanted something a little flexible and less like a wide board under my feet.",
      "rating": 3.0,
      "verified": true,
      "author": "Ben L",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "It saved my trip",
      "text": "I have high arch and developed last minute foot pains before a big trip to Southeast Asia. These were the only footwear that are waterproof (needed for Southeast Asia rainy climate) and supported my feet well. They broke in easily (about a week), and practically saved my trip. Without these, I would not have been able to do the amount of walking I needed during the trip. Thank You, Chaco!!!",
      "rating": 5.0,
      "verified": true,
      "author": "BHN",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "My son loves them.",
      "text": "My husband thought they were too clunky, so I gave them to my son who loves them!! Arrived quickly. Good service.",
      "rating": 5.0,
      "verified": true,
      "author": "Libertina",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Best ever...",
      "text": "I have used these for years while working at a canoe rental joint and hiking the AT and elsewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Amazing quality",
      "text": "The wide fits me perfectly and the ach support are perfect for my high arch. Best activity sandals ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Ducky",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "A GREAT comfortable, durable sandal!",
      "text": "This is my second pair of Z1 sandals. I wore the first pair out after 8 years of walking miles in them. Easily the most comfortable sandals I've ever owned. Take the time to adjust the straps for the fit that works for you. I like mine a little loose; my wife likes hers snug. Trim any excess length from the end of the straps, melt the ends to avoid raveling, and enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Stu",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Great deal and I love the funky patterns",
      "text": "I bought these chacos for my boyfriend and he absolutely loves them! After breaking them in these are his favorite shoes. He also gets so many compliments on there being pizza on them! Definitely not Chacos that you see everyday! I would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "My favorite shoe hands down!",
      "text": "Not just my favorite sandal, this is my favorite shoe. Durable and comfortable, these are my go to hiking footwear. 5/5 no question!",
      "rating": 5.0,
      "verified": true,
      "author": "Phil G",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Durable wear",
      "text": "This is my replacement for my Chacos I wore out after 10 years! I finally broke down and I can't be happier. Super support and feel, as were my old ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Best pair of shoes I own",
      "text": "Chaco's have become my go to shoe. They are the most comfortable shoe I have ever owned and I highly recommend. I really like that the straps can adjust to fit your foot and they are not like filp-flops - the stay on your feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "These are by far, my favorite sandal, ever",
      "text": "These are the best outdoor/active lifestyle sandals. Great for hiking, they don't slip, you can even do casual trail running in them. Perfect for water, I've climbed slippery waterfalls in them, they have great traction. Perfect for wide feet",
      "rating": 5.0,
      "verified": true,
      "author": "christNhart",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "It is a Chaco, the very best",
      "text": "Had an older Chaco that I have had for over 10 years so decided to get a new one that looks better. In my opinion it is the best sandal you can buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "It's Chacos -- doesn't get much better!",
      "text": "I love 'em -- I've had one other pair - lasted 3+ years without issue. These are great sandals -- single strap design hugs your feet. I tromp and stomp everywhere in them -- wash n go",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Maybe not Vibram outsole?",
      "text": "My last pair of Chacos wore through the outsole in less than two years. They're the most comfortable shoes I've ever owned, but I'm disappointed in that. I heard the outsole wasn't actually made by Vibram anymore. Is this true? Regardless, I love my new pair, and will be a life-long fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody Lee Laun",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great shoe at a fantastic price",
      "text": "I love my Chacos. I wore through my last pair (after 8 years and more than 3000 miles of walking in them) and was simply looking to replace them. I was surprised to find these so cheap but they were authentic and fit just as expected. They’re my dependable go-to summer shoe for everything from lounging to hiking.",
      "rating": 5.0,
      "verified": true,
      "author": "CS Johnson",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Check your size....",
      "text": "I usually wear a size 11 in Nikes. But for these, I had to get a size 9W.",
      "rating": 4.0,
      "verified": true,
      "author": "B or K Wilson",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "❤️ Chacos",
      "text": "Been wearing chacos for over 10 years. Bought this pizza patter for my 12 year old who wears men’s sizes. Such practical comfortable shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah H.",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "not as wide as I hoped",
      "text": "The sandals are of quality construction though a bit heavy as a casual shoe. I was quite disappointed in the fact that wide is only slightly bigger than a medium width. I am normally an dd width in 11 1/2- 12 these were so small I could not even slip my foot through the straps at the toe. I would recommend these highly if you are a more standard width or just a little wide. As I said quality was high and price was reasonable.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "9 Men’s Sneaker = M8 Chacos",
      "text": "Fits well. Use my standard US9 to M8 Chaco conversion for get correct shoe size.",
      "rating": 5.0,
      "verified": true,
      "author": "corey",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Best Sandals Around",
      "text": "Best Sandal out there! Rugged yet comfortable, made for sand, water or everyday wear. Great support and comfortable! Would highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "Jana Haven",
      "helpful_votes": 2,
      "publication_date": 20170627
    },
    {
      "title": "Wear them all the time!",
      "text": "Bought for my grandson who also has a solid black pair that he wears with black socks all year long because they are so comfortable. He likes the pizza chaco's for summer. So fun to wear and so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley J. Glinski",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "These are by far very comfortable! I hate that I've missed out on these ...",
      "text": "My feet are really wide. I have never really been able to wear any kind sandal before. I was hesitant to order these because I thought I would end up returning, boy was I wrong. These are by far very comfortable! I hate that I've missed out on these for so long. I was able to adjust to fit my feet perfectly. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Straps Allow for a Custom Fit",
      "text": "Very comfortable. Seems really durable. I have large bunions (thanks, Dad), and the straps on the Z1 can be adjusted to not bind them. Very happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kschles",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "Chacos til I die.",
      "text": "A good friend of mine gifted me my first pair of Chacos and after a few years they needed to be replaced. The first pair was a 12, but they were a little too long so I went with 11 this time. I have wide feet and probably should have gone with a 11-wide, but they are still extremely comfortable and I highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Drew Coble",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Best purchase for vacation",
      "text": "I got this for my dad for vacation, and he wore them to the beach. They didn’t hurt his feet, and well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Christa",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "They are ok. Husband decided to keep them and ...",
      "text": "They are ok. Husband decided to keep them and try them out. He did get several blisters from the cloth rubbing regardless how much he tried to adjust the strap.",
      "rating": 3.0,
      "verified": true,
      "author": "Gennifer Mallard",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "good for active lifestyle, a little big",
      "text": "The sandal itself is very comfortable and I'm glad I bought it. My only issue is that it was a bit long (I wear a 9 1/2 and the bought the 9) and the straps were long as well (the tightening strap drags on the ground). They don't fall off or move around despite them being a little too large which is nice. Would buy an 8 if I bought another pair.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam Smerdel",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "super comfortable",
      "text": "I owned a pair of Z2 since 2003. The plastic was wearing out and so I bought a new pair, Z1, and the fit great.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Drake",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Best shoe ever!",
      "text": "Best shoes ever! Need the extra width and couldn’t find the wide options in store. So glad I ordered the wide. They are the most comfortable shoe ever. Have walked close to 500 miles since I have had them and wear them everywhere. Form the store to the trials the best shoe I have bought. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachery",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Rad color",
      "text": "These fit perfectly and are extremely well made. Precisely what is expected from a pair of Chaco's.",
      "rating": 5.0,
      "verified": true,
      "author": "Likes nice things",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Good, sturdy heavy soles. Super convenient",
      "text": "They only have whole numbers for sizes so if you’re in between go down on the number. They are great as chacos are known to be. If you’re over 25 though go fot the cloud ones rather than the originals. The sole might feel heavy and rigid after a long day.",
      "rating": 4.0,
      "verified": true,
      "author": "N Lemon",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Good buy",
      "text": "Work well for a day at the river or beach. They’re comfortable for long walks.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Campuzano",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Perfect gift for the husband",
      "text": "I bought these for my husband for his birthday. They were a hit! He usually wears 9.5, but I went with a 9 after reading reviews (because these only come in whole sizes) and they fit perfect. He has worn them a couple times around the lake and outdoorsy things. Straps were easy to adjust, too. Glad I purchased! They came super fast too!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Cloutier",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Strap too long",
      "text": "The end of the strap is entirely too long. Drags on the ground when pulled tight. I have had 3 pairs of these. First was perfect. Next 2 were much longer.",
      "rating": 4.0,
      "verified": true,
      "author": "SAF",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "A product that knows it audience",
      "text": "Daily wear during the warm months in Wisconsin...dependable, long-wearing, stylish and a sandal that has satisfied my needs for comfortable outdoor wear for over 30 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Jugenheimer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Overall Killer Sandal",
      "text": "High quality of material, and I find these comfortable for upwards of 5 hours. Only downside is that the foot bed can get a bit stinky and slimy.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Hill",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "I can’t give a better rating as the size I purchased was not the ...",
      "text": "From what I hear about the brand has all been positive. I can’t give a better rating as the size I purchased was not the size in the box. First time this has happened to me, so I will be trying again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "GREAT QUALITY",
      "text": "I bought these shoes for my fiance to wear for when we go to the beach and hiking...he wears them everywhere! Major support and the quality is superb. He loves pizza, so the cute design is fun, and he's 53!",
      "rating": 5.0,
      "verified": true,
      "author": "Karyn Lyn ",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "The best ever!",
      "text": "This is my second pair. The first pair is 20 years old and going strong. These have been, for me, the best footwear in every respect I’ve ever owned. Fit, finish, durable, absolutely perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Chacos til I die",
      "text": "Perfect set of dad sandles. Throw on a pair of white tube socks with these baddies for the most comfortable walking experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Like having your feet cemented in stone",
      "text": "How can anyone wear these hunks!? My hiking boots are lighter. Switched back to Tevas very happy. More zero-droppish as well.",
      "rating": 1.0,
      "verified": true,
      "author": "AG_Tex",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "My previous bear was size 11 and they seem to be just a tad bit too small but the straps that ran through the soul were very tight which I liked. I just ordered another pair size 12",
      "text": "I have own Chacos before and I have an 11 and a half foot. My previous bear was size 11 and they seem to be just a tad bit too small but the straps that ran through the soul were very tight which I liked. I just ordered another pair size 12. They seem to be large for my foot and the straps are not tight the brothers of Soul you have to strap hem up constantly and the tag is so long it feels like I have a tail.",
      "rating": 2.0,
      "verified": true,
      "author": "Dallas Reed",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Much larger",
      "text": "The sizing of this sandal is way off!! My son wears a 12.5. They don't have half sizes so I ordered 12w. They are huge!! I missed the deadline to return because of the pandemic so now I am stuck with them !!!",
      "rating": 1.0,
      "verified": true,
      "author": "PM",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "6 Stars!!",
      "text": "Absolutely love! Comfortable, cute and hella durable. Got me through rocky, uneven and muddy portages with ease. Great grip when walking on slippery/submerged rocks.",
      "rating": 5.0,
      "verified": true,
      "author": "whitney j.",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Tight strap, adjust it, read instructions",
      "text": "Could not get my foot through the strap because I didn’t read the instructions, my fault",
      "rating": 5.0,
      "verified": true,
      "author": "Jim from Pa.",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Too small, too heavy",
      "text": "Very small, not comfortable, and VERY heavy. Too bad I bought them.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Petruschka",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Good Price",
      "text": "Chacos fit very well and I saved several dollars by ordering online and got the color that I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Chism",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Great quality for price",
      "text": "These fit my husband perfectly and were such a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Isabella P.",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Good sandals",
      "text": "Great shoes. Fits as expected and way cheaper to buy them on Amazon than in stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Camelle Wilson",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Best sandal",
      "text": "Best sandal. Yes it is expensive, but they last for years!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Perfect",
      "text": "My second pair, after my first pair wore out from 5 years of constant use. I have worn all kinds of sandals for many, many years (including several custom-made leather pairs), this is simply the best. Oh, and great for kayaking or water wear, too.",
      "rating": 5.0,
      "verified": true,
      "author": "D. DeNoon",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Comfortable",
      "text": "I love the footbed in these chacos. They are my primary footwear",
      "rating": 5.0,
      "verified": true,
      "author": "Ottosmash",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Purple sandals.",
      "text": "These are great. They are purple - you need to know that.",
      "rating": 3.0,
      "verified": true,
      "author": "DR. T",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Five Stars",
      "text": "Bought these for my son, who loves them. Size true to fit. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi H",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Shipped WRONG item or not as shown in picture",
      "text": "This what we received....it has a pattern and is not solid like shown in the picture. Who is checking that the right products are being shipped?",
      "rating": 2.0,
      "verified": true,
      "author": "kiki",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Comfortable",
      "text": "You can wear these Chacos all day and never tire of them.",
      "rating": 5.0,
      "verified": true,
      "author": "James R.",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great Sandal",
      "text": "This is my 2nd pair of Z1's and I love the way they feel, look, and last. I can wear them in the river then rinse them and wear them to dinner!!!",
      "rating": 5.0,
      "verified": true,
      "author": "alan russ",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Just get them",
      "text": "Fully as expected. Not a cheap sandal but good craftsmanship, comfort, function, and style.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Novotny",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "I love these sandals",
      "text": "I mostly hate footwear. These are the exception, and I'm on at least my 3rd pair. I will actually put them on *because* my feet hurt and these sandals make it better.",
      "rating": 5.0,
      "verified": true,
      "author": "bicycledad",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "I bought for Christmas but the return window was before then.",
      "text": "The sandal is too stiff to bend when walking and the heal gets pinched where the strap is attached",
      "rating": 1.0,
      "verified": true,
      "author": "Terry Meloche",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Great sandals",
      "text": "They fit great and can be worn all day comfortably",
      "rating": 5.0,
      "verified": true,
      "author": "A. Morrison",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Don’t buy these!",
      "text": "Very disappointed with these chacos! Ran a size too big and straps aren’t adjustable so I returned them!",
      "rating": 1.0,
      "verified": true,
      "author": "Trinae",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Awesome sandals",
      "text": "I love the Adjustable feature, very comfortable. I can truly run with them without fear of tripping or losing any of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Amazing shoes!",
      "text": "Bought a pair for my sister-in-law two yrs ago she still wears them. very durable. Just bought this pair for my brother and he loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa H Graham",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Durable, all terrain sandal.",
      "text": "Excellent sandal for outdoor use - land and water. A bit heavy.",
      "rating": 4.0,
      "verified": true,
      "author": "NavyDavey",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Hard and thick sole and heavy",
      "text": "Bought these for my nephew , size 11 was a little to big and they are super hard and heavy , he is a lifeguard bat a big water park and the straps rubbed blisters on his feet.",
      "rating": 2.0,
      "verified": true,
      "author": "amy",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "They work !",
      "text": "It fits and does exactly what they are supposed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Defective shoe",
      "text": "The strap on one shoe is not adjustable. Perhaps it got glued when they were attaching the soles.",
      "rating": 1.0,
      "verified": true,
      "author": "Donald B. Kent",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Summer fun",
      "text": "For a 250lb guy that loves to not wear shoes in the summer, but is very active these are the bees knees.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason P Larson",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Worth it 💯",
      "text": "I thought it was going to be to big but it was just right",
      "rating": 5.0,
      "verified": true,
      "author": "Raul",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "-Style with toe loop fits perfectly. This open style ...",
      "text": "-Style with toe loop fits perfectly. This open style cuts into my son's foot. He only wore them once.",
      "rating": 2.0,
      "verified": true,
      "author": "Robyn Unger",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Custom Fit",
      "text": "My feet are different shapes and even a bit on size due to a major break. The custom straps and overall are super comfortable. My Tevas have no real use now.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian L. Moss",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "You should have bought these a long time ago",
      "text": "No more boyish flipping and flopping. No more sweaty slipping and sliding. I have worn these multiple times for full days of events at church. Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "JWilliams",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Great Sandals!",
      "text": "I like the design, did not disappoint. The straps are adjustable to fit your foot perfectly, although it takes a little bit of patience adjusting them.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "He loves it!",
      "text": "My husband ‘s second Chaco! They last long and beautifully made!",
      "rating": 5.0,
      "verified": true,
      "author": "Celina Mitchell",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Durables",
      "text": "I bought here chacos like a lots pares , they are so good resistable in the rainforest Amazon jungle !! But so much espexive for us for jungle people !!",
      "rating": 5.0,
      "verified": true,
      "author": "Clever grefa",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Underside of straps is rough.",
      "text": "Underside of straps is rough but seems to be getting smoother.",
      "rating": 3.0,
      "verified": true,
      "author": "Everett Hobson",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Run large but great sandal.",
      "text": "My son ordered these. Really likes them but usually wears a 13 and he had to go to 11.",
      "rating": 4.0,
      "verified": true,
      "author": "Leesa",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Good protective sandal.",
      "text": "These shoes were recommended by my foot surgeon as stable shoes to wear as my foot heals from surgery several months ago. I can wear them a few hours each day, but then have to go back to my Brooks athletic shoes. Hopefully in time I will be able to wear the Chaco's more.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Sullivan",
      "helpful_votes": 0,
      "publication_date": 20170814
    }
  ],
  "product_meta": {
    "title": "Chaco Men’s Z1 Classic",
    "description": "Streamlined and dependable since 1989, our Classic series is comprised of only 8 component parts, making for the simple, timeless sandal design that made our name. Every pair comes standard with adjustable straps that custom-fits to your foot, plus our podiatrist-certified LUVSEAT PU footbed for all-day comfort and support. Now featuring ChacoGrip rubber for our best performing Classic outsole to date. Experience our Classic Sandal like never before.",
    "rating": 4.5,
    "feature_bullets": [
      "Polyester jacquard webbing upper wraps around the foot and through the midsole for a customized fit adjustable and durable high-tensile webbing heel risers injection-molded ladder lock buckle",
      "Luvseat PU midsole vegan-friendly construction",
      "Outer Material: polyester",
      "Sole: Rubber",
      "Closure: Buckle",
      "Heel Type: Flat",
      "Shoe Width: medium mens_us",
      "Non-marking ChacoGrip rubber compound 3.5 mm lug depth",
      "closure_type: Buckle"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "30.48 x 15.24 x 12.7 cm; 771.11 Grams",
      "Date First Available": "20 Jan. 2016",
      "Manufacturer": "Chaco",
      "ASIN": "B084HZ4TRZ",
      "Item model number": "J106161",
      "Department": "Men's"
    },
    "categories": [
      "Shoes",
      "Sandals",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 104.22
  }
}