{
  "website_summaries": [
    {
      "verdict": "Six layers of protection from UV, rain, wind, dirt, and dust, yet the inner cotton layer won’t scratch.",
      "pros": [
        "This is a universal-size truck cover that will fit any truck up to 20.5 feet",
        "Adjustable buckles and straps keep it in place in wind",
        "Use it to protect your truck in all seasons"
      ],
      "cons": [
        "Some complaints about zipper jams and breaks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Mixed feelings on this product",
      "text": "It has torn pretty easily after sitting in the sun just from wind? I'm not sure what caused it to rip. I like the way it has clips To hold it on the car. No need for strings or hooks. Mixed feelings on this product. I may try it again.",
      "rating": 3.0,
      "verified": true,
      "author": "sal",
      "helpful_votes": 5,
      "publication_date": 20190924
    },
    {
      "title": "I recommend this cover for Tacoma’s",
      "text": "I’ve used it a few times right before a monsoon storm hit the valley of the sun and I was able to get it on in a hurry and tied down to weather the storm. No leaks and kept my newly washed truck clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Brendan P. O'connor",
      "helpful_votes": 6,
      "publication_date": 20191007
    },
    {
      "title": "This was a surprise how good it fit",
      "text": "I was surprised, at how nice this cover was, lightweight and easy to put on. Silver color is light repelling and the zipper is good for easy access. We used this on my Bmw 325 I that sits in the sun and is not our daily driver works great would buy again for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeSmith",
      "helpful_votes": 9,
      "publication_date": 20190520
    },
    {
      "title": "Protects against weather, fits well, mostly survived high winds",
      "text": "I used this cover for nearly 5 months with no issues until we had some 50 mph winds. The cover remained intact except for tear at the middle strap seam. It fit my new Ram 1500 well, and never leaked even through the rainiest of weather. The tear is not surprising given the strain a 50 mph wind would place on the straps. TONBUX promptly replaced the cover under warranty at no cost. Very satisfied and will purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "andhum",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Ripped Easy",
      "text": "It did well for a while. I left for deployment for 7 months and it was fine. This time I left for two weeks and came back and it was ripped all the way down the middle. Not the best quality I guess. The reflection does well for keeping the sun off the vehicle though. Didn’t have a chance to test it in other weather because I’m in Southern California. It’s kind of upsetting that it didn’t even last a year.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "good quality but...",
      "text": "Quality is good but got completely destroyed by the wind. Cover was ripped from one end to the other front to back. Securing straps were not strong enough and came loose.",
      "rating": 3.0,
      "verified": true,
      "author": "coconut cliff",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "So far so good",
      "text": "This car cover is protecting my car from bird feces and everything else. I love that it has the side zipper on it. It stayed on while it's been quiet windy but I still don't know if it will stay on when it gets really windy and the gust is 20+. Overall I'm happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Reishi",
      "helpful_votes": 22,
      "publication_date": 20190518
    },
    {
      "title": "Waterproof.",
      "text": "This is my second one. First one the high winds shredded it up. Too bad they don't make one too withstand the CA High Winds.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Kohl",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Poor fit",
      "text": "This was supposed to fit my 2005 Chevy 2500 crew cab (It doesn’t it’s way to small barely goes halfway over the wheel ) so tight it it looks like it was shrink wrapped ☹️Poor fit!",
      "rating": 1.0,
      "verified": true,
      "author": "jv",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "PERFECT FIT",
      "text": "BOUGHT FOR SON IN LAWS NEW TRUCK AND IT FITS PERFECT AND IT IS AS ADVERTISED THANKS!!!",
      "rating": 5.0,
      "verified": true,
      "author": "jeffrey",
      "helpful_votes": 41,
      "publication_date": 20190914
    },
    {
      "title": "2020 F150 s cab no fit!",
      "text": "This does not fit a F150 super crew . Fits front well but narrows at rear and doesn't fit well at rear window.",
      "rating": 2.0,
      "verified": true,
      "author": "Chester Rider",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Very nice cover.",
      "text": "Easy to use and fit a 2011 Dodge Ram Laramie edition with no problems. Only thing I would recommend is a tag saying \"Front\" and \"Back. Luckily I got it right the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Horrible Broken buckle and Torn in less than a day",
      "text": "The first day installing this the middle buckle broke without even pulling it that tight, then the second day having a little wind blowing caused the seem where the strap is stiched to the cover tear across this thing sucks it's really cheaply built and definitely not worth 100$",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick M.",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Cover Your Car",
      "text": "Great car cover! Well made and easy to use! Price is right! Quick on time delivery!",
      "rating": 5.0,
      "verified": true,
      "author": "MPMC",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Higher price for low quality",
      "text": "Not tight enough wind gets under it and flips it off the vehicle, straps broken from high winds....didn’t even last me a full winter In S.W. Michigan...",
      "rating": 1.0,
      "verified": true,
      "author": "Levi Exposito",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Worth it",
      "text": "Pretty solid and strong. Covered my subi perfectly. One issue is hard to fold it back. LoL.",
      "rating": 5.0,
      "verified": true,
      "author": "Geno",
      "helpful_votes": 30,
      "publication_date": 20191202
    },
    {
      "title": "The most important to know is that i can get it on amazon!!!😊👍🤙",
      "text": "😃Very Happy with this item,i did use it on my 2019 F-150 Super-Crue,i will definitely buy again.😊👍🍹🍾🎻🎺🎸🎷",
      "rating": 5.0,
      "verified": true,
      "author": "Monje",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Good cover but not fully waterproof",
      "text": "Covers truck well but water gets in through the seams, so not truly waterproof.",
      "rating": 4.0,
      "verified": true,
      "author": "Ian Carmody",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great value for your money",
      "text": "Perfect size for a Chevy Silverado truck. I am happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex ",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "very lite weight material",
      "text": "very lite weight material. Didn't look like it would withstand very strong winds. just had one made from same material come apart in strong wind. Tore at the bottom seam. Looks to be waterproof but didn't try it on truck. Returned",
      "rating": 2.0,
      "verified": true,
      "author": "tom lamb",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Don’t buy this product",
      "text": "I bought this cover back in May 2020 and it tore in 2 places when I try and take it off! It only lasted 4 months??? I don’t recommend this product!!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Gray Ankle Booties",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Snug fitting",
      "text": "Love it wish it was 21 ft, snug fit for our mega cab",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Hanners",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Good product",
      "text": "Covered a seldom used truck, great product IF you are not going to take cover on and off frequently",
      "rating": 5.0,
      "verified": true,
      "author": "Taxman 2019",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Good cover",
      "text": "Still using to cover the 1994 f-140 502. Great cover",
      "rating": 5.0,
      "verified": true,
      "author": "Clint Hardison",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "It fits well",
      "text": "This cover fits my car perfectly and very easy to use. I bought this to prevent my car directly occupant from sun, it doesn’t frustrate me, cause it protects my car to some extent. In the meanwhile, it always keep my car cleaned.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 35,
      "publication_date": 20191212
    },
    {
      "title": "Awesome product!!!",
      "text": "Awesome product. Also, price can not compare with others. Love it. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Shields",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Became brittle and ripped in less than 8 months",
      "text": "I bought this is cover in late August and it’s dry rotted already. Rips easily. Bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "Teresa R",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Protection  you want and need",
      "text": "Easy to put on SUV, and to take off, perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Nessa",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Good product",
      "text": "Good for winter and summer time. Also on windy days! I bought it for my 2001 Celica and a 2011 Camry fits like a glove on both cars.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 45,
      "publication_date": 20200113
    },
    {
      "title": "it looks great!",
      "text": "it fits nice, with exception with the antenna... had to make a hole :/",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Lamadrid",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great product.",
      "text": "Excellent quality, easy to install and remove. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Bernal",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Cheap zipper.  Better off without it.",
      "text": "I liked the straps that hold the cover down. But the zippers are very poor quality. When I zipped it together, one zipper jumped the track. No way to reattach it. No zipper starting pin. I’m gonna send this one back.",
      "rating": 1.0,
      "verified": true,
      "author": "Vivian Hardin",
      "helpful_votes": 5,
      "publication_date": 20190424
    },
    {
      "title": "Tie down is different than others, having to go around bottom. Gets dirty quick",
      "text": "Love that it is waterproof but hate the strapping system. Why a strap in the middle? To crawl under you truck to hook it up?",
      "rating": 5.0,
      "verified": true,
      "author": "J M.",
      "helpful_votes": 3,
      "publication_date": 20190824
    },
    {
      "title": "Works well",
      "text": "Works well sort of a pain totakeoffand put back on, but this was expected",
      "rating": 5.0,
      "verified": true,
      "author": "Caryl Kuykendall",
      "helpful_votes": 0,
      "publication_date": 20200101
    }
  ],
  "product_meta": {
    "title": "TONBUX Truck Cover 6 Layers - Waterproof All Weather Car Covers with Cotton Protection for Auto Vehicle Indoor Outdoor for Pickup Truck Fits up to 246''",
    "rating": 4.2,
    "feature_bullets": [
      "✔【Premium Material】: Made of 6 layers high-density and breathable materials, Protective coating+PE+Aluminium film+PE+EVA+Cotton, PE&EVA is 100% waterproof and dustproof, aluminium foil is sunproof and anti-UV, cotton protect vehicle paint. Much more durable than most similar products out there",
      "✔【All Weather Protection】: All weather truck car covers can effectively protect your vehicle from harmful UV rays, dirt, dust, snow, frost, industrial pollutants and bird droppings. Its soft cotton lining protect your car from scratch, perfect for indoor and outdoor use",
      "✔【Anti-strong Wind Design】: Adjustable straps and buckles at the bottom to protect your truck cover from blowing off in windy days. Elastic hem at the bottom to keep the cover securely on your truck. Double stitched seams for adding durability",
      "✔【20.5'Universal Fit】: TONBUX truck cover will fit almost all the trucks up to 20.5'long (Dimensions: 20.5'L x 6.6'W x 5.7'H). \"Inverted-V\"design makes this cover a universal fit! Please send your truck model to before purchasing and We will help you to confirm the cover is suitable for your truck",
      "✔【What You Get】 - A set of TONBUX professional car cover. We offer a FREE REPLACEMENT POLICY and 1-YEARS MONEY BACK GUARANTEE. And every car cover we ships out undergoes strict quality checks, totally no worries for you"
    ],
    "specifications": {
      "Manufacturer": "TONBUX",
      "Brand": "TONBUX",
      "Item Weight": "9.53 pounds",
      "Product Dimensions": "246 x 79.9 x 68.8 inches",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "AMZB",
      "ASIN": "B07MDJ8XYN",
      "Customer Reviews": "4.2 out of 5 stars112 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#310,017 in Automotive",
      "Date First Available": "December 27, 2018"
    },
    "categories": [
      "Full Car Covers",
      "Automotive Parts & Accessories",
      "Covers",
      "Automotive",
      "Exterior Accessories"
    ],
    "price": 79.99
  }
}