{
  "website_summaries": [
    {
      "verdict": "Members of the hiking community who wish to cover trail miles in an amazingly lightweight hiking boot might find one in the Zion Mid Waterproof. Those who are in great need of something immensely comfortable, supportive, and grippy might also get what they are looking for in this product. That said, the shoe is probably not the best choice when it comes to breathability. To sum up, the Zion Mid Waterproof is yet another incredible Merrell offering whose set of competencies inspires hikers to go further",
      "pros": [
        "Numerous customers find their Merrell Zion Mid Waterproof hiking boots unbelievably lightweight",
        "In terms of comfort, this footgear is exemplary, according to almost everyone who has purchased it",
        "Based on a decent number of reviews, this astonishing Merrell hiking boot has a super-sticky outsole",
        "The Zion Mid Waterproof has an excellent support system, say several of those who have bought it",
        "Some users compare the fit of this over-the-ankle hiking shoe to that of a sneaker"
      ],
      "cons": [
        "This boot-type hiker from Merrell is not very breathable, less than a handful of testers claim",
        "An owner finds the Zion Mid Waterproof’s default footbed too thin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Needed for completion of Colorado Trail through hike.",
      "text": "The pair fit really well with ordering a 1/2 size larger than my shoe size. I possibly could have gone a full size greater , but this feels right-on. I have only worn them on a 4-mile hike, so a thorough review is not available. They are lighter than my previous Merrell boots but give adequate ankle support (mid-height). There was no rubbing in this pair & walk was cushioned well. I will post any significant changes that may appear with extended use. The pair will be used on my summer Colorado Trail hike.",
      "rating": 5.0,
      "verified": true,
      "author": "paul.m.harrer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "comfortable but...",
      "text": "comfortable, my size was a bit tight compared to my others shoes. but not tight enough to be uncomfortable. durability.... first night camping, an ember I guess fell on my shoe. now I have an 1/8 of inch burnt hole on my shoe tongue. I'm just glad it wasn't any bigger. my two cents.",
      "rating": 3.0,
      "verified": true,
      "author": "msn8tr",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Size runs really small on these boots.",
      "text": "This boot was recommended by Popular Mechanics, I wear a 9 1/2, ordered a 10 and could barely get my foot in the boot. Plan on reordering size 11, hope that one fits.",
      "rating": 1.0,
      "verified": true,
      "author": "J.R.Lewis",
      "helpful_votes": 3,
      "publication_date": 20191215
    },
    {
      "title": "Very light weight with excellent support",
      "text": "This hiking shoe is surprisingly light. It has excellent ankle support for a mid hiking shoe. The sole is also quite firm which gives the shoe a steady feel. Only caution is my feet are very narrow, and the shoe is snug on them, so I would expect wider feet to need the wider version.",
      "rating": 5.0,
      "verified": true,
      "author": "moviefan",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Comfortable",
      "text": "These are some of the most comfortable shoes I’ve worn. They seem to have the support I wanted but don’t wear in an oily or greasy environment as they are slick. So far they are not slippery in a natural environment.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Comfortable Hiking Boot",
      "text": "Very comfortable hiking boot. Did a 12 mile hike on my first go with these and didnt have one complaint. You may want to go a half size up if you plan on wearing thick socks. Also wore them in the snow and they are warm and waterproof",
      "rating": 5.0,
      "verified": true,
      "author": "David Bautista",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "actually waterproof",
      "text": "14 miles in the wet wet wet Tongass National Park. End of the trip: Bone Dry inside. Can't say enough good things about these boots. Well done Merrell.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great Boots",
      "text": "No break in needed super comfy. Merrell never disappoints. I usually am a trail glove wearer daily but I wanted a waterproof boot that looked good for every day use in winter when it snows, these were perfect even though they aren’t minimalist is my only complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Zellm",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great look and performance but lack of durability is getting worse",
      "text": "I’ve worn Merrell’s for the past 10 years. I love how they come out of the box feeling great on your feet. However, the past few years I’ve seen a decline in the durability in the shoes which have just fallen apart where a dump truck rolling over them couldn’t phase them 10 years ago.",
      "rating": 3.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Very comfortable",
      "text": "This boot/shoe is hard to identify because it fits like a very comfortable shoe but is definitely built solidly like a boot. I've only gone on short hikes so far, but I look forward to longer hikes and really breaking these things in.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Winn",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Not typical Merrill quality",
      "text": "These appeared cheaply made and the fit is narrow and small.",
      "rating": 3.0,
      "verified": true,
      "author": "KGaudet",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Ready to go.",
      "text": "Feels like a sneaker, snug like a boot, very comfortable, does not seem to need any breaking in period.",
      "rating": 4.0,
      "verified": true,
      "author": "Phillip D.",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "wow",
      "text": "very nice shoes, tough and rugged. you have to size up a from half to one size bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "marlo araneta",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Glad i went 1/2 size up",
      "text": "People recommended going half size up. Glad I did. Normally 11, went 11.5 and they are perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Magnani",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Bummer",
      "text": "Way too small. I wear an 11. The ball of the foot was super tight and toes felt squished. I have wider feet however salomons fit perfect in regular sizes...... all in all felt way too small. Bummer. Gonna stick with salomon",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Great boots",
      "text": "They look good and are comfortable. I wore them for three days in a row with no discomfort issues that sometimes come from new shoes. I noticed that I slipped a little on smooth or polished concrete that is wet. They are fine on wet, textured concrete or asphalt.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "comfortable",
      "text": "got them cause i like the low version of the zion. but after a while the backs would always slip off my heels when walking up a hill. so i went with the mids and that issue is covered. also for mids they feel just as light as the lows",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan H.",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great work boots",
      "text": "The straps on the side broke after being caught on a Boulder first day. Material seems durable and I use the for landscaping.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Poor quality",
      "text": "I have worn these boots for about 1 month. The ends are starting to come detached. I would not recommend if you plan on long term use.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Farmer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Should have gotten these a long time ago...",
      "text": "Great hiking boot! Light, durable AND waterproof..a little pricey, but well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great looks, but doesn’t fit!",
      "text": "This shoe looks great, but doesn’t not feel great. The toe area is too narrow for my toes. I wear a 9.5, so I ordered a size 10 and that was still tight. I’d say ordering a whole size bigger is safe.",
      "rating": 2.0,
      "verified": true,
      "author": "Oz",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Waterproof, comfy & warm",
      "text": "Really comfy, warm and fully waterproof. I walk across water logged fields every day with my dog's, these boots are my best friend! Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201124
    },
    {
      "title": "Comfortable so far.",
      "text": "Half size up was accurate. I normally wear a 11.5 US, and the 12 fits nicely. Comfortable around the house. If they break in like my old Merrells, they'll work just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Moify",
      "helpful_votes": 0,
      "publication_date": 20201106
    },
    {
      "title": "Excellent comfort, solidly waterproof for a hiker",
      "text": "I wear these every day for work. I needed something that was largely waterproof (which meant some of the ultra-light competitor boots were off the list) and this fulfilled my requirements perfectly. They run slightly small. In most boots, I wear a 13W and, in this, I got a 14 which is perfect. They are far more comfortable with a springiness in the sole that I was pleasantly surprised by.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl R. Hannah",
      "helpful_votes": 0,
      "publication_date": 20201121
    },
    {
      "title": "Great basic boot",
      "text": "Very warm and comfortable. Sturdy like a boot, but feels like a sneaker, though more rugged. Look forward to some long hikes! Also would be a good everyday shoe for those so inclined. Very pleased so far!",
      "rating": 5.0,
      "verified": true,
      "author": "therealfootball",
      "helpful_votes": 0,
      "publication_date": 20201115
    },
    {
      "title": "Mens size 11",
      "text": "I usually wear size 11 and this size 11 fit great. My foot is not \"b\" width but is on the narrow side \"D\" width and these fit great. I am 175 lb man, 5' 10\" tall.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201112
    },
    {
      "title": "Cant go wrong with a pair of Merrell's",
      "text": "Ive been wearing Merrell's for over 10 years. Working in a shop i tear boots up. But my Merrells last for years!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff R",
      "helpful_votes": 0,
      "publication_date": 20201216
    },
    {
      "title": "worst shoe ever. don't buy if you want shoes that last you",
      "text": "was super excited about these. they look and feel great at first. only after a few months, the stitching on the sides of the shoes are completely ripped off, they get stuck to anything and therefore rip easily. fast forward a month or two and now the sitching on the soles are coming off, leaving a giant hole in my shoe and exposing my feet. Completely disappointed, terrible design",
      "rating": 1.0,
      "verified": false,
      "author": "octavio estrada",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Side straps broke after one use",
      "text": "Bought to replace some Colombia’s that fell apart as well. After one use, the side straps on the right shoe came out of the bottom. I’m 5’11” 235 with flat feet and I pronate. So I’m very tough on shoes. But still, for the price, these should hold up more than 1 use. They were comfortable, but don’t bother with them.",
      "rating": 3.0,
      "verified": false,
      "author": "Caleb  Adams",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Buy them now.",
      "text": "These boots are super comfortable. Very nice feel. I had to size up a half size. The lace guard thing in the right boot has broken and the company has offered to send a new pair if I cut the tongues off of my current pair and send them a picture. I couldn’t bring myself to destroy my boots like that.",
      "rating": 5.0,
      "verified": false,
      "author": "ScubaSteve ",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Glue",
      "text": "Fist day using boots, right side boot began making noise towards the front end when walking. Place my hand inside and saw front end was not glue.",
      "rating": 3.0,
      "verified": false,
      "author": "Angel Soto",
      "helpful_votes": 0,
      "publication_date": 20191003
    }
  ],
  "product_meta": {
    "title": "Merrell mens J16885-8.0 Zion Mid Waterproof",
    "description": "Women's Merrell, Zion Mid Waterproof Hiking Shoe. This hiker offers support and stability along with great looks and waterproof protection.Waterproof full grain leather and mesh upper Breathable mesh lining Lace up closure with metal eyelets and webbing loops for a secure fit Bellows tongue to keep out debris Protective rubber toe cap Kinetic Fit BASE removable contoured insole and compression molded EVA midsole for flexible support Lightweight FlexPlate makes these hikers extra sturdy Vibram Megagrip outsole with 5mm lugs",
    "rating": 4.4,
    "feature_bullets": [
      "Outer Material: Leather",
      "Closure: Lace-Up",
      "Heel Type: Block Heel",
      "Shoe Width: M"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "25.4 x 38.1 x 15.24 cm; 1.02 Kilograms",
      "Date First Available": "3 April 2019",
      "Manufacturer": "MERRELL",
      "ASIN": "B07W4ZY9L8",
      "Item model number": "J16885-8.0",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Trekking & Hiking Footwear",
      "Shoes & Bags"
    ],
    "price": 353.19
  }
}