{
  "website_summaries": [
    {
      "verdict": "Waterproof with a rechargeable battery, this powerful tool gently buffs away dry, tough skin.",
      "pros": [
        "Choose between coarse or fine filing",
        "Head rotates for ease of use",
        "Recharges via a USB cable",
        "Far more effective than a pumice stone"
      ],
      "cons": [
        "It's not always effective at eliminating tough calluses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works really well.",
      "text": "This is a good product and works as described. It really helped smooth my feet in just a few minutes. Also, the charge held between uses; I went 7 to 10 days between uses.",
      "rating": 5.0,
      "verified": true,
      "author": "KuriousK",
      "helpful_votes": 8,
      "publication_date": 20190828
    },
    {
      "title": "It Works!",
      "text": "It is super easy to use! It has two heads - one course and one fine - I had no idea - great product. I think they thought of everything. I have used it a few times and what a difference! My feet are finally smooth and they are not too chafed or sore. I couldn't believe how much it helped. I can do touch up in between and it's easy to use. I would highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 3,
      "publication_date": 20191108
    },
    {
      "title": "Disappointed....",
      "text": "I’ve had this for 2 months and used maybe 8 or 9 times. It worked great at first, but suddenly stopped working. It is fully charged, so I don’t know what’s wrong with it. Don’t waste your money.",
      "rating": 2.0,
      "verified": true,
      "author": "TKK",
      "helpful_votes": 2,
      "publication_date": 20200414
    },
    {
      "title": "Bye Bye Expensive Pedicures!",
      "text": "This is an awesome product! No one reinvented the wheel when they created this tool, but for some reason it took a while to rebrand and make it work for feet! The hand is a great size, easy to hold and grip to. It have multiple settings which is nice. And, the most important part: IT WORKS REALLY WELL!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Ferguson",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Awesome product.",
      "text": "This is exactly what i needed and it works great!!",
      "rating": 5.0,
      "verified": true,
      "author": "mscott137",
      "helpful_votes": 3,
      "publication_date": 20190811
    },
    {
      "title": "Great product.",
      "text": "Excellent quality product. I’ve had several of these and like this one best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Love this product!",
      "text": "This product is easy to use and works great! I may never need to pay to have a pedicure again!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Perfect for the job!",
      "text": "Wow! Perfect for the job it needs to do. Quality materials and exelllent built quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Hendrik Botes",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Great.",
      "text": "Excellent. If you put lotion on right after scrubbing it looks like a shop pedicure. Liked so much I ordered one for daughter and daughter in law for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "mjteacher",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Can see result after three uses.",
      "text": "I have been using this product for a short time but I’m already seeing results. I’m using it only once a week, as my feet are not in terrible shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Zara",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Works great!",
      "text": "I bought this because my (quarantined) feet couldn’t get to a salon. It’s awesome! Not the same as getting a pedicure, but it was super easy to use and clean. And made my feet smooth again.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Jones",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Faulty item",
      "text": "This item does not work, no power, could just b a faulty item that got by inspection. Now I am past the window on returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert H.",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Best buy!",
      "text": "My greatest purchase for my feet ever! My feet are so smooth. Thank you for an amazing product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190721
    },
    {
      "title": "It worth it",
      "text": "It really gets rid of dry skins in little tim.",
      "rating": 5.0,
      "verified": true,
      "author": "fm",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Very good Pedicure tool",
      "text": "The VIVA Pedicure Tool does an excellent job on soothing your feet",
      "rating": 5.0,
      "verified": true,
      "author": "R. Haynes",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Wow this is a GREAT instrument",
      "text": "I’m really happy with this purchase! Scrubbing by soles in a shower is pretty annoying and not much effective. But this instrument really does all the work! The fact that it’s automatic and rechargeable makes it so easy. On the last pic I included how much skin got off my feel in a few seconds 😄 really happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "hrustal",
      "helpful_votes": 7,
      "publication_date": 20190921
    },
    {
      "title": "Was a little disappointed",
      "text": "Maybe I'm doing this all wrong! I was so excited to get this because I was tired of battery changing. Just didn't live up to my expectations. Literally takes hours for full charge and does not hold the charge very long. I usually do mine and my husband feet consecutively but it loses power too quickly. Too long in between charges. If you have unlimited/unrestricted schedule or time OR if it could be used while plugged in, it works as well as any other. It's just not that special, but performs ok.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Better than a pedicure!",
      "text": "I love this product so much! It's easy to use and really does the job. My feet were very dry and the skin thick for lack of pedicure due to quarantine for over 2 months... I use this product followed by Aveeno Repairing Cica Foot mask and wow, I don't think my feet have ever been this smooth!",
      "rating": 5.0,
      "verified": true,
      "author": "Isabelle ",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Needs better battery",
      "text": "Works good! But it needs a better internal battery, and 31 days after receiving it, it died and it will not turn back on, batteries overheated... I would not be able to recommend this product to anyone",
      "rating": 2.0,
      "verified": true,
      "author": "Jorge Escobar",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "It’s ok",
      "text": "For me this is the same of all on the market. No difference from any other. It’s works well but not good for cracked heels or very dry skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Rosangela Fretwell",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Wow! Incredible!",
      "text": "Absolutely wonderful. My feet have never been softer! It's easy to use and takes less than 5 minutes for both feet. This is an amazing price for such a wonderful gadget! A must buy if you want smooth soft feet with no calluses.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Works Well",
      "text": "This does a much better job than other brands I've tried. They were much more expensive and didn't last long.",
      "rating": 5.0,
      "verified": true,
      "author": "LUVDVM",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Good machine 👍🏼",
      "text": "I Really like this machine 👍🏼My feet is very soft.",
      "rating": 5.0,
      "verified": true,
      "author": "CeliaG",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Not as strong as I thought it would be",
      "text": "I'm a small business owner so from the time i get up until I lay down at night I'm on my feet constantly as many people are these days and because of that my feet don't always look the best. The heels get dry and I saw the pedi egg and the idea of using it grosses me out but this seemed like a great alternative and I have to say I was a little disappointed in it and I feel like it does a better job fresh out of the shower so your skin can soften a little before use. It's not as good as getting a pedicure but it gets them a little softer.",
      "rating": 3.0,
      "verified": false,
      "author": "Kimber Rosee",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "A Sigh of Relief for Dry Feet!",
      "text": "This came well packaged in good condition. It is a very easy, straight forward tool for smoothing rough feet. Mine were winter, dry rough and this is perfect! I like the two head options of a course first go over and a smooth polishing finisher one. So, far I have not had any issues with the products function both mechanically and result wise. Appears to be made of decent quality materials and I expect it will last awhile.",
      "rating": 5.0,
      "verified": false,
      "author": "Iamme Whoru",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Works great on my dry heels",
      "text": "I mainly use this on my heels because they get crusty and so dry looking. First I soak my feet and after I dry them, I use the course head to remove the rough skin. This works very quickly and it's easy to maneuver around my feet. Then I use the finer head to smooth my heels. This is so much faster, easier and cost effective than going in to get my feet done professionally.",
      "rating": 5.0,
      "verified": false,
      "author": "Kitty",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "love that it's rechargeable!",
      "text": "No more batteries! YAY!!! I hated going through so many batteries with my last pedi-roller. It seems like every time I turned around, I was putting new batteries in the thing! Now all I have to do is plug it in, and I get many hours of callus busting joy! The fine head on me is useless. The coarse file head is definitely my go to head. It works like a charm to help rid my poor feet of their excessive calluses.",
      "rating": 5.0,
      "verified": false,
      "author": "CMac -Amazon Addict!",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Electric Pedi Tool",
      "text": "My feet are happy to have the Spa Sciences VIVA Professional Electronic Foot Smoothing Pedi Tool. It works amazingly. There is a course head you use first and then a fine head to finish and polish your feet. My feet look like I just came from getting a pedicure. There are two speed settings and it is rechargeable! I am so happy with this and highly recommend!",
      "rating": 5.0,
      "verified": false,
      "author": "❤AMommy👩‍👧‍👦",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Good for smooth heels",
      "text": "This rechargeable pedicure tool is quite awesome. It comes with a course and fine attachment. Both attachments work great on dry skin on your heels. Very easy to charge and use within minutes. Also included is a small brush to keep the attachments clean. Works well and made my heels smooth and free of dry cracks.",
      "rating": 4.0,
      "verified": false,
      "author": "Tracybeth",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "I have used these devices for years",
      "text": "From the first time they arrived on the market, I got one and then updated as the tool was upgraded. This is the newest one I have and it works great. I am very happy with this one. I just hope when it comes time to get new heads, they will be available.",
      "rating": 4.0,
      "verified": false,
      "author": "CoCo's Mom",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Making my heels smooth again",
      "text": "Works great. My feet haven't felt this smooth in a while (they got rather rough during this last pregnancy). Twice a week and the moisturizing afterwards has made them feel almost silky soft again. Instructions are easy to follow.",
      "rating": 5.0,
      "verified": false,
      "author": "Dinosaurs and Mermaids, mom of both",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "im impressed.",
      "text": "I am thoroughly impressed with how well this works! I did not expect this to work as well as it did. I did not use it after the shower, which is when I think it would work best. I used it on my dry heels and it shaved the calluses off perfectly!",
      "rating": 5.0,
      "verified": false,
      "author": "Paigii",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Great product",
      "text": "I am very satisfied with this product. It did exactly what I wanted it to do.",
      "rating": 5.0,
      "verified": false,
      "author": "K Family Reviewers",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "It didn’t last!",
      "text": "I enjoyed using it while it was working, it slows down when it needs to be charged but one day it just abruptly stopped although it was fully charged.",
      "rating": 2.0,
      "verified": false,
      "author": "RMC",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Surprisingly, works quite well",
      "text": "I’ve tried some other foot tools and have usually been disappointed as they do not work as promised. This one does. Very easy to use and has clear directions.",
      "rating": 5.0,
      "verified": true,
      "author": "ECA",
      "helpful_votes": 0,
      "publication_date": 20201101
    },
    {
      "title": "Super effective in a short time.  Wow!",
      "text": "Just one use makes a big difference. You can see in the picture how bad my heel was when I started, and how good my foot looked after just one use. It doesn’t hurt to use, but after a while, you do get the sense that you’re rubbing away a lot of skin. I wimped out of going even further with it, but I can see that this thing is an incredibly powerful tool, since this wiped away years of neglect of my callouses in just a few minutes. With regular use, I can imagine that my feet will actually look nice in sandals! Who knew? I’m very happy with this easy-to-use, powerful product.",
      "rating": 5.0,
      "verified": false,
      "author": "unitydienes",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Works good.",
      "text": "In this time of the year my feet get super dry... bad! This machine helps me between my pedis. It is not super strong and definitely I need more than 1 time use to keep them smooth. It does not get hot, and does not make a lot of noise. The battery life is pretty good. It comes with 2 interchangeable heads. Light weight and small, easy for carrying it around in your bag when traveling and to use it. You don’t end with a sored hand after using it. Good. Like it.",
      "rating": 4.0,
      "verified": false,
      "author": "Constanza Vargas",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Easy to use, works okay.",
      "text": "This intrigued me because my heels are usually cracked and dry with super thick calluses. I find that this does smooth the heel a bit, but not as much as I was hoping that it would. It works best after soaking as the skin comes off with less effort on the motor which does tend to lose oomph as I go. The downside to shaving your heels when the skin is moist is that the skin sticks in the grinding stone more than it does with dry skin and it takes more effort to clean the stone before putting it away. 3.5 stars",
      "rating": 4.0,
      "verified": false,
      "author": "Nerdy Narwhal",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Makes grating and buffing calluses easier and faster.",
      "text": "This Spa Sciences VIVA Foot Smoothing System works well on my son's dry, callused feet. He would typically use a pumise bar and rub it manually. This was a great find as it makes things so much easier for him, at a much quicker pace too. The rotating head does all the work as it spins, and all you have to do it place it against the area you choose to grate or buff. It's painless and he says it's actually quite satisfying. This is a great tool that does the job. Totally worth it.",
      "rating": 5.0,
      "verified": false,
      "author": "Kailey",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "LOVE LOVE LOVE",
      "text": "I absolutely love this electronic pedicure tool! It is super easy to use and works so well. It is easy to charge and small enough to take with you when you travel. The different heads are easy to change (they just click on and off). And best of all, it really makes your feet feel nice by removing the rough spots in seconds! This is now my go-to tool when doing an at-home pedicure. Worth every penny!",
      "rating": 5.0,
      "verified": false,
      "author": "Jen C.",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Silky Soft Feet",
      "text": "Fast, gentle feeling, but very effective at removing my dry patches and calluses. Forget filing your feet with a pumice or manual file. When you use this right after you shower it works wonders. It leaves my feet super soft and I feel like I have a new pair of soles, that’s how effective it is! If you want soft refreshing feet, don’t think twice and get yourself one!",
      "rating": 4.0,
      "verified": false,
      "author": "Tanya Lu",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Worked great",
      "text": "I was looking for something to use in between pedicures and this electric file is perfect. It came with a little charge which was great since I couldn't wait to test this. It has two settings and glides easily over head heal. I was able to buff off my cracked heals in no time. It also for very comfortable in my hand.",
      "rating": 5.0,
      "verified": false,
      "author": "Paige Turner",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Gets feet smooth quick and without pain",
      "text": "Omg this thing works amazingly! It’s so pretty! It doesn’t hurt but gets the dead skin off your feet comfortably.",
      "rating": 5.0,
      "verified": false,
      "author": "Nola Viva ",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Awesome",
      "text": "Lucky me, my children think it’s a privilege to use this on me. It does such a great job. Love it.",
      "rating": 5.0,
      "verified": false,
      "author": "Oceania",
      "helpful_votes": 0,
      "publication_date": 20200118
    }
  ],
  "product_meta": {
    "title": "Spa Sciences VIVA Most Powerful Pedicure Tool Available-Professional Electronic Foot Smoothing Pedi Tool for Removing Hard, Dry, Cracked Skin/Calluses on Feet, Rechargeable-2 Treatment Heads Included",
    "rating": 4.5,
    "feature_bullets": [
      "TREAT FEET – Remove dry, rough, callused areas, and get smooth, soft skin with VIVA, a doctor recommended buff system. Getting perfect, healthy feet doesn’t require a grate scrub, it just requires a great machine.",
      "2-IN-1 SET – Do what no pumice bar can with both a coarse and a fine file/smoothing head in this kit. This allows for quick, easy, and pain free exfoliating as well as a pro polish experience.",
      "360 DEGREE TREATMENT – The rotating head does all the work of dead, cracked skin removal, and the cord-free range of motion means you can exfoliate with the sleek ergonomic handle design at exactly the angles you need.",
      "100% CUSTOMER SATISFACTION GUARANTEE: Put your worries aside! If you don't like the Spa Sciences VIVA pedi system for any reason, you can just take advantage of our 4 month guarantee! We will replace it or give you your money back for any reason. NO QUESTIONS ASKED! Email customerservice@spasciences.com. There’s a reason why Spa Sciences is in every major US retailer; we are the only brand offering prestige beauty tools under $25.",
      "PODIATRIST RECOMMENDED – This 100% waterproof skin smoothing technology has been clinically tested and recommended by doctors for smoother, healthier skin as well as reducing foot pain and itching."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.5 x 3.9 x 2.6 inches; 9.59 Ounces",
      "Batteries": "1 Unknown batteries required. (included)",
      "UPC": "860021001192",
      "Manufacturer": "Spa Sciences",
      "ASIN": "B07MTNTXQK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tools & Accessories",
      "Beauty & Personal Care",
      "Foot, Hand & Nail Care"
    ],
    "price": 24.0
  }
}