{
  "website_summaries": [
    {
      "verdict": "Keds reinvented their classic silhouette to yield an elevated kind of footwear, figuratively and literally. The Double Decker displays 1\" midsole with an easy to slip design that suits the on-the-go wearers.The thicker sole adds distinctive coolness while remaining comfortable and versatile. This shoe is a surefire hit for practical buyers who want to remain distinctively stylish and comfortable without breaking their pockets.",
      "pros": [
        "The Keds Double Decker has an affordable price point",
        "Buyers can choose from the multiple colorways available in the market",
        "This shoe is considered very comfortable by the majority of the reviewers",
        "Most of them highly recommended the Double Decker to their peers",
        "Many liked the breathable materials of the Keds Double Decker",
        "The lightness of this kick has been praised many times by the wearers",
        "This shoe is considered stylish by many buyers",
        "Many buyers enjoyed the easy to wear feature of this sneaker",
        "This pair runs true to size",
        "Few buyers liked that this versatile design can easily go well with almost any casual ensemble"
      ],
      "cons": [
        "Some frustrated reviewers disclosed that this shoe runs tad narrow",
        "Few shared that the Keds Double Decker runs tad stiff that needs a more extended break-in period",
        "The arch support is considered unsatisfactory by few wearers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.7,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "These shoes are thin and run very small-one whole shoe size down from the standard sizes for women",
      "text": "I read a review that said these shoes run small. So I ordered this shoe in size 9.5 women's. I actually wear a women's size 9. When the shoes arrived and I tried them on, they were still a size too small. Because of the stretchy material I can make them work. But I am not completely satisfied with my order. I think I am going to take a break from amazon for awhile. lbvs",
      "rating": 2.0,
      "verified": true,
      "author": "Rosalind Misher",
      "helpful_votes": 4,
      "publication_date": 20190820
    },
    {
      "title": "Keds double decker",
      "text": "Doctor said to wear shoes with a higher sole. I wear Keds all the time. Never realized the double decker had such a thicker sole. So glad I ordered them. Cushiony and comfy. Seem to help with balance, too. 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Kulp",
      "helpful_votes": 4,
      "publication_date": 20191230
    },
    {
      "title": "too narrow and toe area not high enough",
      "text": "Really like the look of this shoe but it was too narrow from sole to top of toe area and was too narrow in the width, unlike other size 10 mediums I have.",
      "rating": 3.0,
      "verified": true,
      "author": "eclectic me",
      "helpful_votes": 2,
      "publication_date": 20200122
    },
    {
      "title": "White Slip On Flats",
      "text": "This is an update from my last review. The shoe runs small, so I had to order a 9W which fits great 👍. Thank you. But the box it came in was damaged badly. I checked the shoes & they were fine, but this box is horrible. I like to keep my boxes & my shoes back in them to keep them from getting dirty/dusty, but this box will definitely be in the recycle bin...",
      "rating": 5.0,
      "verified": true,
      "author": "LaTonya R Beckom",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Feels Good On my Feet!",
      "text": "I love these shoes. I have wide, flat feet. I do a ton of walking. These feel great and my feet do not hurt after walking. Still a little tight but nothing I can't live with as they just need to be worn a few more times. Overall, Great shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan L. Nicholson",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Helps with my knee pain.",
      "text": "Absolutely wonderful. I have a knee problem so these foam inner soles are perfect to reduce shock to my knee. May not be right for everyone but for me they are perfect. Again for me size is right on target.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Richardson",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Shoe too narrow",
      "text": "This pair of shoes is too narrow for my mother's feet - she's never had a pair of medium width shoes be to narrow. Unfortunately, due to COVID-19 circumstances, I was not able to retrieve the shoes back from her in time to return them.",
      "rating": 2.0,
      "verified": true,
      "author": "MJP",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Too tight",
      "text": "Great looking but way too narrow. I have several pairs of KED sneakers and ordered the same size I usually do, but this pair of sneakers were way too narrow and tight. They are really nice looking though.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucille Delli Carpini",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Great Shoe",
      "text": "Other then being on the narrow side if you don’t order the wide they are a great shoe for everyday use",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Good shoes!",
      "text": "Love these shoes. They are very comfortable. True to size. They can be a little tight at first, but after wearing them a couple days they form to my feet and fit perfectly. I have multiple pairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly L",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "awful",
      "text": "I would give 0 stars if I could dont buy I ordered a 8.5 I couldn't even get my foot in",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie K.",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Slip on Keds",
      "text": "Comfy but a little large, need socks! Bought wide because I have bunions! Kind of hot in summer but need alternative to sandals.",
      "rating": 4.0,
      "verified": true,
      "author": "Flower Girl",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Very happy",
      "text": "Very happy with these! For well! Like the double decker part!",
      "rating": 5.0,
      "verified": true,
      "author": "KL",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Love these sneakers.",
      "text": "I have been wearing sneakers for casual wear for years. Like these for the added support they provide my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Cut Waaaay Too Small",
      "text": "I have worn a size 8 medium my entire life. All my shoes are this size. These Keds I could not even get my toes in the toe area. Felt like a size 5 narrow! Second pair of Keds with same issue 😕 very disappointing. Love styles but they just don't fit.",
      "rating": 2.0,
      "verified": true,
      "author": "Estie Newman",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Didn't work out",
      "text": "They were uncomfortable, did not fit right. But they are cute.",
      "rating": 3.0,
      "verified": true,
      "author": "kristy",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Really good looking shoe.",
      "text": "I loved this shoe but it was just too big for me. I need narrow.",
      "rating": 5.0,
      "verified": true,
      "author": "connie mcadams",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "My Go-To Spring & Summer Shoe",
      "text": "I love this shoe! It is my Go-To shoe for Spring & Summer. They are true to size. I wear an 8W... that's what I ordered... and they fit perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniece B.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Couldn’t even get my foot in",
      "text": "Felt like Cinderella’s step sister, couldn’t even remotely get my foot in. This is my size pretty much always. 8 W they were nice looking just couldn’t even try them on though.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy Vieira",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Good shoe",
      "text": "Love this shoe, does fit a little tight so I suggest order a half size up.",
      "rating": 4.0,
      "verified": true,
      "author": "Tanya",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Very comfortable!",
      "text": "I am on my feet all day and these Keds are so comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Most comfortable shoes ever!",
      "text": "I bought these shoes for my Disney/ Universal trip. They are very comfortable and I wear them all the time now!",
      "rating": 5.0,
      "verified": true,
      "author": "SUSAN BACA",
      "helpful_votes": 0,
      "publication_date": 20201203
    },
    {
      "title": "Runs extra small",
      "text": "Way too small to even get a portion of my foot in. I ordered a 7, which is the size I wear. Disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Carolyn Dymond",
      "helpful_votes": 0,
      "publication_date": 20201217
    },
    {
      "title": "Unwearable!",
      "text": "These shoes are unwearable! When I put them on I could not fit my heel into them.",
      "rating": 1.0,
      "verified": false,
      "author": "Hilary",
      "helpful_votes": 0,
      "publication_date": 20200916
    }
  ],
  "product_meta": {
    "title": "Keds Women's Double Decker Canvas Sneaker",
    "description": "A slip-on sneaker with a major following. The bestselling Double Decker is a crowd favorite for a number of reasons: it’s super flattering on the foot (much more so than other sneaker brands’ slip-ons), it has cushiony wear-all-day-every-day insoles, and it’s an effortless outfit maker.",
    "rating": 4.2,
    "feature_bullets": [
      "Canvas upper Slip on style sneaker Feminine last Dream Foam footbed Rubber outsole Care instructions: spot wash, air dry only",
      "Outer Material: Canvas",
      "Inner Material: Canvas",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Heel Type: no-heel",
      "Shoe Width: Medium womens_us"
    ],
    "specifications": {
      "Date First Available": "28 Aug. 2020",
      "Manufacturer": "Keds",
      "ASIN": "B08GXTLB87",
      "Item model number": "WF61020",
      "Department": "Women's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 98.19
  }
}