{
  "website_summaries": [
    {
      "verdict": "The smallest iPad is also one of the most fun to use—it’s an ideal compromise between larger iPads and your smartphone.",
      "pros": [
        "It’s fast, has a speedy CPU, and it’s much easier to carry around",
        "The A12 Bionic chip makes it peppy, and the 10-hour battery life make it a truly all-day tablet"
      ],
      "cons": [
        "The built-in cameras are adequate for video conferencing, but aren’t great for photography"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Keep taking the tablet.",
      "text": "Before purchasing this tablet, I researched the options available. My unique buying point was portablity and power with enough oomf to tackle most tasks without difficulty. Some reviewers had a more tangential viewpoint placing screen size as the most desirable item In their objectives thus ruling out this little but powerful beauty from their list. More fool them I say, because as a somewhat silver surfer this really is the bees knees. There is no aspect of this pint sized machine I am unhappy with ( and that includes the bezel spread around the edges). First Apple product I have bought and consider it to be great value for money.",
      "rating": 5.0,
      "verified": true,
      "author": "MR DOUGLAS MCINROY",
      "helpful_votes": 180,
      "publication_date": 20190406
    },
    {
      "title": "Excellent quality looks fantastic highly recommended",
      "text": "Been using for about 6 weeks I have the 256gb version couldn’t be happier had no problems at all. Excellent in every aspect. Much better than my old laptop. I’m 56 years old and use this to keep in touch with the world. I have heart problems so don’t get out much. Prefer the smaller size cause easier to carry around. Excellent picture quality & sounds good too. Does more than my laptop ever did. Love my music so signed up to a few sights found Amazon the best in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Searle",
      "helpful_votes": 91,
      "publication_date": 20190529
    },
    {
      "title": "Lovely Device",
      "text": "At first glance I wasn't sure if this new mini iPad 5 was an improvement but on testing it I found it to be excellent. It is very fast and the retina screen quality is very good, colours natural. The quality of photos taken with this is very good. The overall use is excellent and satisfactory. Being small is very useful which makes it easy to carry around in a handbag for holidays, leisure etc. I have no regrets in purchasing this item. Maureen",
      "rating": 5.0,
      "verified": true,
      "author": "mo",
      "helpful_votes": 61,
      "publication_date": 20190506
    },
    {
      "title": "Excellent upgrade from old iPad mini",
      "text": "Bought as an upgrade from a 1st generation iPad mini where many apps had stopped working correctly due to lack of upgrades available. Thinner & lighter with subtle app usage upgrades. Very happy so far. Excellent same day delivery from Amazon & was £10 cheaper than Apple store.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorna H",
      "helpful_votes": 54,
      "publication_date": 20190512
    },
    {
      "title": "Love mine so much",
      "text": "I LOVE MY IPAD MINI 5 I am using it right now to write this review. Wonderful with the Apple Pencil. My eyes aren’t great (understatement), so I wondered if I would have trouble with the size. However, although this mini is small, compact and light, the screen doesn’t seem that much smaller than my old iPad 3. One of the best things that I have bought for a long time. Very, very happy with it. It’s my little friend that goes with me everywhere (unlike my chunky brick of the iPad 3, which was a real pain to lug about)",
      "rating": 5.0,
      "verified": true,
      "author": "furrytabbykitty",
      "helpful_votes": 28,
      "publication_date": 20190815
    },
    {
      "title": "Fantastic, easy to set up and does everything more quickly",
      "text": "Downloading audible books and the Archers is so much faster with my new iPad mini. The screen resolution is much clearer too. I am so glad I upgraded from my older model.",
      "rating": 5.0,
      "verified": true,
      "author": "Felicity Wills",
      "helpful_votes": 31,
      "publication_date": 20190523
    },
    {
      "title": "Handy machine, great power, easy to use.",
      "text": "Great little machine. This is my second, my first machine is now six years old and still working well, hope this one lasts as long. I prefer this small size which is handy when out and about. Good value. Would have preferred facs recognition, the same as the I phone X.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 25,
      "publication_date": 20190618
    },
    {
      "title": "It’s not just the storage that’s bigger",
      "text": "The storage is amazing and the speed is so much better than my old one . One downside to my purchase was trying to find a cover for it that fits ..........would you believe this iPad is about one millimetre bigger all round and doesn’t fit in a normal iPad cover...........very cheeky.",
      "rating": 5.0,
      "verified": true,
      "author": "Crabbit",
      "helpful_votes": 13,
      "publication_date": 20190916
    },
    {
      "title": "Perfect!!! In every which way.",
      "text": "There is NOTHING to dislike about this little beauty. And EVERYTHING to praise and fall in love with. Bought it to replace an older IPad with a bigger screen... which was far too heavy to cart around (travelling). This one is lightweight... speedy to use... ~it’s literally the best item I’ve ever spent money on. Especially if you go by “cost per use”.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Jeavons",
      "helpful_votes": 10,
      "publication_date": 20190728
    },
    {
      "title": "Really good tablet computer. Easy to set up - does it itself! Great to use. compact. powerful",
      "text": "Having had an iPad mini for the past 6 years, it needed replacing, so I bought this up to date one & it is absolutely great for the money. I use it every day, it's powerful, reliable, you can do most things on it that you could on a big computer & I'm very happy with it so far. It fits well into my handbag too. I find that the new iPad's are able to install all your data automatically & its so very easy to do all by wireless or bluetooth or magic or something...",
      "rating": 5.0,
      "verified": true,
      "author": "Janey Smith",
      "helpful_votes": 7,
      "publication_date": 20190822
    },
    {
      "title": "A good updated model",
      "text": "Wow, what a difference from my earlier mini iPad. Although expensive, just what I wanted as a replacement for my earlier model with the well known and immoral inbuilt redundancy of Apple products. Happy with it, very easy to set up and better by a league; just a touch sad about the inbuilt redundancy which did not accept current apps.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20190801
    },
    {
      "title": "Dust under screen (Poor quality control)",
      "text": "My Ipad mini has a very tiny speck of dust under the screen. Amazon offered me replacement but I don't want the hassle of sending it back. Initially I was a bit bothered since I have purchased this for £475 but then the dust particle is so tiny and in the corner of the screen (I could live with that)",
      "rating": 3.0,
      "verified": true,
      "author": "Arvind",
      "helpful_votes": 8,
      "publication_date": 20190905
    },
    {
      "title": "WORTHWHILE UPGRADE",
      "text": "I felt it was time to upgrade my iPad Mini 2, even though it was still functioning flawlessly. The new model (v5) is quite a bit faster with a bigger memory, an improved camera, screen and other new bits and pieces of course. So far I'm very pleased with it and if it performs as well as the old model I'll be very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "akagaryjc",
      "helpful_votes": 7,
      "publication_date": 20190922
    },
    {
      "title": "Failed systems for repair",
      "text": "The screen sensitivity failed I was unable to use the centre of the screen, I sent it back for repair following the instructions to include all accessories (charger) and packed it in original box. I have just received it back and it seems to be working fine. But packed in a thinner box without charger. Contacted Ingram Micro who were unable or unwilling to help and suggested I contact Amazon direct. I will update this review if and when Amazon respond.",
      "rating": 4.0,
      "verified": true,
      "author": "lakeathome",
      "helpful_votes": 4,
      "publication_date": 20200716
    },
    {
      "title": "Has all the features of previous models plus extras.",
      "text": "This model is so different from my old iPad mini. It took a great deal of ‘playing around’ with it to find out how to do things. Once mastered it is brilliant but it did take a while. A tutorial would be beneficial!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 6,
      "publication_date": 20191116
    },
    {
      "title": "Convenience and excellent performance",
      "text": "This is best size for me to entertain and work. The 7.9 inch sounds not much bigger than 6.5 inch phone but it’s actually more than twice the size of my phone. I can easily take it out in my pocket and works with only one hand. A12 performance well and fast, much better than my previous iPad 2018. Very worth for me.",
      "rating": 5.0,
      "verified": true,
      "author": "SHEN",
      "helpful_votes": 4,
      "publication_date": 20200615
    },
    {
      "title": "Poor quality control",
      "text": "Poor quality control, the home button is not centered, looks really cheap and it was a hustle to return.",
      "rating": 1.0,
      "verified": true,
      "author": "zhangjiajie",
      "helpful_votes": 9,
      "publication_date": 20190510
    },
    {
      "title": "Great iPad",
      "text": "Bought from Amazon as I had vouchers and there is a slight discount compared to Apple. Product was delivered quickly and it’s set up and being used within an hour of receiving it. It’s an Apple iPad Mini (G5) and does what you would expect. I opted for the Mini because I find the larger ones too heavy and my hands are quite small!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs O",
      "helpful_votes": 5,
      "publication_date": 20190802
    },
    {
      "title": "Great compact tablet",
      "text": "What isn’t there to like. Have upgraded from a mini 4 purely to increase storage capacity. I always take my iPad on holiday, fits into a handbag and large enough to watch films etc and store photographs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 4,
      "publication_date": 20200113
    },
    {
      "title": "Neat, fast, quality.",
      "text": "As with all Apple items, it’s expensive and you can buy something else cheaper but iPads have stood the test of time and since it was time to replace my old one this fell nicely. Light, thin and fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Allymac",
      "helpful_votes": 6,
      "publication_date": 20190616
    },
    {
      "title": "Apple quality, item exactly what I wanted and exactly as described.",
      "text": "I have not used this iPad mini 5 yet. It arrived next day via Amazon Prime, so purchase was quick and easy, and I got the exact model I wanted as the advertisement was very clear. After looking through many adverts, and customers comments, I was pleased to find this one at a good price, 2019 model, A12 chip, 64gb.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise H.",
      "helpful_votes": 5,
      "publication_date": 20190826
    },
    {
      "title": "Beautifully Packaged - Quality Item",
      "text": "Not something I have every used, I bought this for a friend as a gift - it is the most beautifully packaged item I have ever seen. Gleaming white box with just one image of the IPad side on - just lovely. The Ipad looked lovely too, extremely good quality product. It seemed very easy to set up - they used their Iphone to set it up and transfer all their data across. She was up and running with it in 30 mins. Small enough to go in a handbag. Very pleased with the purchase and my friend was delighted.",
      "rating": 5.0,
      "verified": true,
      "author": "JAC",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Genuine",
      "text": "Happy with my new iPad. During my lockdown I was concerned my older iPad mini might conk out on me and I’d be lost. this one is even lighter and speedier easy to set up even for a74 year old female. Very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Rita W",
      "helpful_votes": 3,
      "publication_date": 20200528
    },
    {
      "title": "Disgusted",
      "text": "Will not hold a charge for more than 1 hour",
      "rating": 1.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 7,
      "publication_date": 20191120
    },
    {
      "title": "A Replacement",
      "text": "I bought this to replace a 7 year old iPad mini which, although it still worked, was very slow and the operating system wouldn’t sustain new or upgraded apps. As usual, the iPad is easy to work and I easily transferred my data from one tablet to the other. My only issue is a personal one in that I don’t like the layout of some of the apps in comparison to before but I’m behind the times because I’ve been using very old apps. Apple products are always dearer and I could have gotten a tablet at a much cheaper price but I like the range of apps and how easy it is to use.",
      "rating": 5.0,
      "verified": true,
      "author": "G Paterson",
      "helpful_votes": 2,
      "publication_date": 20200730
    },
    {
      "title": "Great",
      "text": "Great item, what more can I say except I wish they were not so expensive",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 5,
      "publication_date": 20191004
    },
    {
      "title": "Worst ipad wifi ever",
      "text": "Got this to replace and ageing ipad air. And it's rubbish, wifi drops out approximately every 30 mins, drops out whilst watching YouTube, Netflix. It doesn't disconnect but the signal speed drops to less than 1mb and then you get the buffering. Absolutely no issue with old air pad. Same connection and same location. If you have tried contacting apple about an intermittent fault.. good luck. They blame everything else (weather, time of day) except the product. Never again, worst purchase from apple ever.",
      "rating": 2.0,
      "verified": true,
      "author": "Liam M",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Quick, and good battery",
      "text": "Very quick, good battery life, lm sure it’s very good but as an old git I find the change from Android awkward. I miss the back button and the browser seems to always have loads of things open, no doubt I will learn in time",
      "rating": 4.0,
      "verified": true,
      "author": "Old hand ",
      "helpful_votes": 4,
      "publication_date": 20190623
    },
    {
      "title": "1",
      "text": "Virtually the same as the mini 4 in my opinion, save your money and buy the previous model",
      "rating": 5.0,
      "verified": true,
      "author": "5P1K3",
      "helpful_votes": 4,
      "publication_date": 20190806
    },
    {
      "title": "It’s a iPad mini .",
      "text": "I bought this to replace my 2013 iPad which had basically breathed its last. Not a lot to to say really. It’s an iPad mini that is quick and allows me to use applications and surf the web. Bit like the 2013 one, before they withdrew all support in 2016/17? Oh and it’s about £100 pounds more than the last although there is twice as much storage, which probably means it’s the same price as the 2013 one had I opted for the 64 Gb version over the standard 32! Result!",
      "rating": 5.0,
      "verified": true,
      "author": "Derek the Horse",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Fantastic tablet",
      "text": "A really amazing piece of technology, great screen and very easy to use. A real leap forward from an earlier iPad which it replaced.",
      "rating": 5.0,
      "verified": true,
      "author": "CMEdinburgh",
      "helpful_votes": 3,
      "publication_date": 20190815
    },
    {
      "title": "Brill iPad- check the cell.",
      "text": "The iPad mini - brill! I bought the cellular one, but, the cellular/phone wouldn’t connect without specific codes! It seemed to be a locked cellular!!!!! Buyer beware!?",
      "rating": 4.0,
      "verified": true,
      "author": "buyer",
      "helpful_votes": 2,
      "publication_date": 20200302
    },
    {
      "title": "Excellent product all round",
      "text": "This was a present for my 8 year old son who love it. It is the perfect size for him, not too small or big and ideal for on the go. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Jaye",
      "helpful_votes": 5,
      "publication_date": 20190526
    },
    {
      "title": "Love it",
      "text": "Finally a new iPad mini model that lets you use Apple Pencil.",
      "rating": 5.0,
      "verified": true,
      "author": "ALH",
      "helpful_votes": 4,
      "publication_date": 20190615
    },
    {
      "title": "Easily the best tablet Money  can buy.",
      "text": "Convinced myself for years that I didn’t need one, then bought one for my wife and found out how useful it was over what I already had so bought one for myself. There simply isn’t another tablet that comes near the iPad in what you can use it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Soar",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Arrived on time",
      "text": "Nice little iPad. Much like my old mini but more sophisticated. Old one no longer being updated, that is why I had to purchase a new one. Cross with it when it scrubbed my old Gmail, prior to November 2019.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "a great upgrade from the first generation model.",
      "text": "Bought for my mum after she had a first generation iPad for some years, she seems to enjoy this new one - there were rumours of a 6th generation one coming out but decided to go for this one, recommend a cover to protect it.",
      "rating": 3.0,
      "verified": true,
      "author": "Mathew Palser",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "New ipad mini.......",
      "text": "No dislikes. Bought to replace my previous ipad which I gave to my granddaughters to help with their home schooling!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer Jim S.",
      "helpful_votes": 2,
      "publication_date": 20200702
    },
    {
      "title": "Great little companion.",
      "text": "Love it, having replaced my iPad Air 2 this was a big decision to go smaller which on reflection I wish I had stayed with the bigger iPad, but this is very easy to handle it’s not as heavy, but now I’m struggling to see the smaller print, as not everything can be enlarged.",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer flossy",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Love it",
      "text": "So much better than my old one. The battery lasts a lot longer, the picture quality is excellent and it’s lighter than the older models. I prefer the size of the mini.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise Ward",
      "helpful_votes": 2,
      "publication_date": 20190910
    },
    {
      "title": "Quality product and service.",
      "text": "I bought this iPad to use with my drone. Perfect display for this. There are plenty of reviews for the version 4 but this has a better processor and brighter screen, I have the 10 inch and 12 inch pro but these are too big to use with my drone controller. Usual Apple quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Chadwick",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "No buffering yet",
      "text": "This replaced my previous mini iPad version 2 which I have had for several years, still works but freezes at times when watching videos, I find this one a lot better hasn’t freezed yet but early days, pictures are very clear and sharp and sound is good, I have it in a Zlorop case.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Cross",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Useful but pricey",
      "text": "Yes it's great of course but far too expensive !",
      "rating": 4.0,
      "verified": true,
      "author": "Jo Mac",
      "helpful_votes": 4,
      "publication_date": 20190714
    },
    {
      "title": "Mini marvel",
      "text": "This is my 3rd IPad mini & they never disappoint. Ideal for my back pack because of its compact size. An ideal holiday companion also, for sending emails & surfing the net. This latest mini is a very capable machine, able to multi task with ease. Very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Robson",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Lovely to use.",
      "text": "This is a lovely iPad. Easy to handle with great features. I added a leather case which makes the experience even better. highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Vic",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "The best iPad for reading",
      "text": "I have the larger model but the mini is the best for reading most books on. The larger model is better for video and web browsing. So know your priorities - or get both!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Longer lasting charge.",
      "text": "Super easy to transfer all my stuff from my old iPad to new one. Not a lot of difference from my old one as far as I can tell but the battery lasts much longer. It also seems to take better pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Dynamite Dina",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Good Apple quality product.",
      "text": "This purchase was to replace my wife’s first iPad which served her well. It was so old it couldn’t take any more software updates. Apple hold you over a barrel with a lot of the ancillary stuff but you can’t beat the quality and ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Roberts",
      "helpful_votes": 0,
      "publication_date": 20201025
    },
    {
      "title": "Small light easy to use. Screen definition good.",
      "text": "Screen quality excellent. Photos good definition. Easy to use. Price seemed a bit high but it is the latest version.",
      "rating": 4.0,
      "verified": true,
      "author": "Cas",
      "helpful_votes": 2,
      "publication_date": 20190831
    },
    {
      "title": "I would give up my mobile rather than give up my iPad.",
      "text": "This is the second iPad I’ve had, I only upgraded because I couldn’t get BBC Sounds on my previous model. I travel on cruises frequently and it’s comforting to be able to keep in touch with my family plus I have music, photos and kindle to take with me.",
      "rating": 5.0,
      "verified": true,
      "author": "S J Mockford",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "It’s Apple.  No more to be said",
      "text": "Its Apple... it works, it’s slick, it’s faultless, it’s reliable. Yo ou get what you pay for",
      "rating": 5.0,
      "verified": true,
      "author": "Tony da Cool",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Fast safe delivery . Great product . Cheaper than on Apple store .",
      "text": "Brilliant !! Good safe delivery and the usual excellent Apple product . Cost less than on Apple store !",
      "rating": 5.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Fantastic, love it",
      "text": "Exactly what I was hoping for, only better. I paired it with a sleeve inside of a case to retain its lightness when using. Great as a reader, web browser and, unexpectedly, game machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Franck Horlaville",
      "helpful_votes": 2,
      "publication_date": 20190907
    },
    {
      "title": "It's and iPad Mini",
      "text": "It's an iPad Mini. Not a lot else to say. This is possibly a little faster than the four.",
      "rating": 5.0,
      "verified": true,
      "author": "jerree",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "Ipad",
      "text": "Needed to upgrade from 2nd edition which was unable to access IOS upgrades. Meets all my needs now",
      "rating": 5.0,
      "verified": true,
      "author": "M M McMullin",
      "helpful_votes": 2,
      "publication_date": 20200817
    },
    {
      "title": "Powerful little beast",
      "text": "Great little device. The iPad mini 5 is speedy, super lightweight, portable and with a great laminated display. Definitely recommend for browsing the internet and media consumption.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Worth all the money",
      "text": "An excellent product. Fits neatly into coat pocket and can be linked to iPhone to use away from home.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. James Doull",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "I’d be lost without this during lockdown",
      "text": "This was a replacement had to get used to new configuration",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs C.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Unsurprisingly perfect",
      "text": "It’s an iPad. You know what you’re getting. Really lovely for watching films on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "Lozza",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Tip Top iPad Mini",
      "text": "Amazingly fast, still learning all the feature. The Book Store iPad Mini Guide is about 500 pages, serious reading.",
      "rating": 5.0,
      "verified": true,
      "author": "John Nixon",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Cheaper than Apple",
      "text": "A shame they haven't really updated the Mini very much in recent years as it's the ideal size for a tablet IMO. Cheaper than buying direct from Apple",
      "rating": 5.0,
      "verified": true,
      "author": "jon m",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Amazing product",
      "text": "Delivered few days before expected. Quality is amazing. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "TattPep",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Great iPad",
      "text": "I love my new iPad could have (3) yrs cover as Apple do this",
      "rating": 5.0,
      "verified": true,
      "author": "helen",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Happy wife, happy life.",
      "text": "Bought this for the wifes birthday and she loves it. So much better than her ipad mini 2, anti glare is really good too and a nice size to fit in one hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam_1688",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great replacement for my old I-pad.",
      "text": "I would have liked to buy 2 1 for me and 1 for my wife but had to wait a while to purchase a second one. Exactly what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Senior",
      "helpful_votes": 2,
      "publication_date": 20200114
    },
    {
      "title": "Great deal!",
      "text": "Replacing old iPad mini, cannot fault the new one, loving extra storage and the new apps pages, numbers etc.",
      "rating": 5.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Mini iPad",
      "text": "Even I can use it without any help from the children!",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs Claire Bruce",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Pricey replacement for Amazon Fire",
      "text": "It was expensive BUT is SO much better than my Amazon Fire which it replaces. To be fair it cost 7 times as much but it is fast and easy to use and you don't have to wait and wait for things to load",
      "rating": 5.0,
      "verified": true,
      "author": "mwaters",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Excellent I pad",
      "text": "After having a I pad for 5 years. I brought the I pad mini to make it easier to transport in handbag.. Also photos are great and it's easy to handle. Very pleased with my I-pad mini",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Kavanagh",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Damaged",
      "text": "Little hairline crack on the screen when it came but after all the hassle getting it and considering it was late for my daughters bday i couldnt return it",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "IPads rule",
      "text": "Bit of a learning curve from my old iPad, but love the changes, getting there now!",
      "rating": 5.0,
      "verified": true,
      "author": "Harriet",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Impressive",
      "text": "Very impressed with this iPad easy to use with many new features.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwendoline Cartwright",
      "helpful_votes": 2,
      "publication_date": 20191020
    },
    {
      "title": "iPad Mini",
      "text": "I replaced my Mini 1, and I just love the Mini 5",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Excellent product fantastic service",
      "text": "Needed a new tablet urgently, delighted when it around. Even more delighted with the service. Ordered one day arrived the next.",
      "rating": 5.0,
      "verified": true,
      "author": "mrs",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "easy and fast",
      "text": "This is my second ipad and its brilliant. Very fast with a huge amount of storage for pics and music",
      "rating": 5.0,
      "verified": true,
      "author": "Nans101",
      "helpful_votes": 2,
      "publication_date": 20191017
    },
    {
      "title": "Simply the best tablet on the market",
      "text": "Simply the best tablet on the market. Amazon provided a very competitive price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Barry",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "I pad mimi 19",
      "text": "Bought to replace my old pad. Love it, as an older person found it easy to change over, much faster and more memory . Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "great piece of kit !!",
      "text": "You cannot beat an apple device. I also have Kindle? But it is very heavy !!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "for me, it’s  functions had’nt changed much since my last one.",
      "text": "It was good to see it was just like my previous I-pad.. I am not the most tech-savvy person but so far, so good..",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi Groome",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Its small and light weight",
      "text": "I use the iPad mini for reading, and find it ideal.Its not heavy and small enough to carry in a handbag.Its perfect for my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191121
    },
    {
      "title": "Simple, fast and can be used anywhere.",
      "text": "A much faster device than my old one. Really compact and lightweight. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Gill Snook",
      "helpful_votes": 2,
      "publication_date": 20190816
    },
    {
      "title": "Evcellent product",
      "text": "Got this to use with my drone the quality is outstanding",
      "rating": 5.0,
      "verified": true,
      "author": "Graham Baldwin",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Quality",
      "text": "This is my second one had my previous iPad for eight years great size for my small hands 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Patty Tarnawskyj",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "ARRIVED DAMAGED!",
      "text": "The Ipad is damaged. I don't know if it works as I have not turned it on. I suspect this is a refurbished item as rhe packaging looked brand new but the item inside was faulty. Returning it immediately for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Tas",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Not good.",
      "text": "Locked its self with in 5mins of opening and set it up.Need to go to apple shop.",
      "rating": 3.0,
      "verified": true,
      "author": "Dusters",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Well worth it.",
      "text": "As recommended by a friend and I love it. Easy to use for my course work and picture quality is fab. Well worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Alitrub",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Happy mother",
      "text": "Brought as a present to replace iPad mini 1 Mother loves how quick it is and is very happy. No more waiting hours to load her stuff",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Apple have maintained their quality in this latest iPad",
      "text": "I used this to replace an iPad 2 that was running out of space. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "PhilB",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Very Pleased!",
      "text": "I buy IPads because they are so easy to set up, they link with IPhones and are reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy Wright",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Fantastic 👍",
      "text": "Finally traded in my old mini 2, the difference is chalk and cheese... love the new Mini 5",
      "rating": 5.0,
      "verified": true,
      "author": "roger williams",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Just an iPad",
      "text": "It’s an iPad it’s pretty self explanatory it’s just does what any iPad would do",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Skinner",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "very well made 100%",
      "text": "well made and easy to use nice bright display,, long battery life,",
      "rating": 5.0,
      "verified": true,
      "author": "Mark  R Slater",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Apple of my eye",
      "text": "Like all Apple products works straight from the box.So easy to set up",
      "rating": 5.0,
      "verified": true,
      "author": "Mr G.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "A*",
      "text": "bought for my husbands birthday- arrived on time - well packed- husband well pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great mini iPas!",
      "text": "Had to update to this new model but am very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Careful with money",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Excellent iPad",
      "text": "I am new to the 'i' range and find this item easy to use and has so many useful features.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "As expected",
      "text": "Super easy set-up, great design and usability. We use it as POS (point of sale) in a training facility. Exactly what I needed!",
      "rating": 5.0,
      "verified": true,
      "author": "IsaOlsson",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Reliable Apple",
      "text": "I bought this mini iPad to replace an existing one so knew I wouldn’t be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Caz",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Plug in follow instructions set up within minutes",
      "text": "No suppresses when you by an apple - great product easy to set up and use",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "No complaints",
      "text": "Great iPad does everything I wanted an at a good price",
      "rating": 5.0,
      "verified": true,
      "author": "Miss F. H. Stanton",
      "helpful_votes": 0,
      "publication_date": 20191230
    }
  ],
  "product_meta": {
    "price": "",
    "specifications": {}
  }
}