{
  "website_summaries": [
    {
      "verdict": "Shades that stretch over the outside of your car windows to provide shade.",
      "pros": [
        "Fits most car windows, stretching to a length of 23.6 inches to 45.28 inches",
        "Provides a double layer of mesh for extra sun protection",
        "You can still roll your windows down with the shades on, so they can also serve as a bug shield"
      ],
      "cons": [
        "Some had trouble with fit and they need to be removed when raining"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Looks like I probably have a busted out window.",
      "text": "While, this does work great for blocking the sun for my kiddo, it does not fit well on my Hyundai Elantra at all. Very loose, makes an awful sound flapping in the wind, and my son is able to pull on it from his car seat. I also have to say how embarrassing it is that I have been asked several times what happened to my window because the appearance is so awful that it looks like I must have a busted out window.",
      "rating": 2.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 18,
      "publication_date": 20190507
    },
    {
      "title": "Keeps the kids cool and shaded",
      "text": "Seems to work fine on my Lexus. Keeps the backseat much cooler. The visibility isn’t as clear in my blind spot, but I just do a double take before changing lanes, etc. also a little excess on this particular window, but that’s just aesthetics. Our last shade lasted about two years. Hoping this will last even longer.",
      "rating": 4.0,
      "verified": true,
      "author": "AllisonMK",
      "helpful_votes": 18,
      "publication_date": 20190528
    },
    {
      "title": "Great product",
      "text": "This is the third different window shade I’ve tried and I’ll be sticking with this style. The pull down shades fall off the window, can’t put window down, don’t cover the whole window. The stick shades don’t cover the whole window, can’t put window down. These cover the ENTIRE window, can put window the whole way down, don’t fall off. They look a little goofy flopping in the wind but I would rather protect my baby’s eyes",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 17,
      "publication_date": 20190612
    },
    {
      "title": "Comfortable grandchildren!!",
      "text": "As a new grandma, this is exactly what I needed for my Toyota Camry. I can roll the windows down and the kids are still protected from the sun! I tried the stick on shades and they didn’t allow me to roll down the windiw. The Peyou car shade is perfect for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris S",
      "helpful_votes": 13,
      "publication_date": 20190401
    },
    {
      "title": "Loose fit, blocks vision",
      "text": "What a bunch of trash. The video for this product showed it fitting tightly around the window and form fitting, but these covers are LOOSE. They wind up with lines from the fabric flowing that make it difficult to see out the window, and make half of the drivers side back window into a blind spot. Trying to see out the passenger back window is not much better. I'm really very unimpressed, I was excited to try these out because my car gets so hot in the summer time, but I'll be returning these immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryant E Quist",
      "helpful_votes": 8,
      "publication_date": 20190607
    },
    {
      "title": "Do not buy",
      "text": "I don’t know how this have a 4.0 rating. I was so excited when this arrived and my disappointment kicked in right when I saw the product. I told myself “maybe it will be better when I put it on the car!” Wrong. It looks like a giant, ugly, trash bag. Don’t buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "BookTea",
      "helpful_votes": 5,
      "publication_date": 20190702
    },
    {
      "title": "Blind spot!!!",
      "text": "Got them for the backseat windows so my kids could have their windows down and still block the sun from their eyes. I’m leaving the one on that is on the passenger side but had to remove the one on the drivers side. I thought I was going to get an accident! It causes a major blind spot and makes it impossible to see when trying to merger left.",
      "rating": 1.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 4,
      "publication_date": 20200622
    },
    {
      "title": "Works great, recommend it",
      "text": "UPDATE: Photos added to show fit, when secured with a hair tie, to prevent the shade from being loose/baggy. Easy to use and helps keep the kiddos much cooler. Great for kids with sensory processing issues or sensitivity to the sun. They do fit a little loose, but that is to be expected. Gathering the material and securing it with a rubber band or hair tie works perfectly. Checking the driver's side blind spot is a little bit of a challenge, due to the darkened view, but no issues with passenger side. Definitely recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Seiple",
      "helpful_votes": 14,
      "publication_date": 20190710
    },
    {
      "title": "Pretty Decent Overall",
      "text": "These are pretty decent overall.. Couple of call outs: 1) If you knot up the inside (because it's too large for your car), then the sun will definitely shine through the bottom portion as it takes both layers (inner & outer) to block the sun. 2) You best remember to take these off your windows if there’s any rain or even a small drizzle.. It will soak your car. 3) Good luck trying to see oncoming traffic if you're trying to merge!!! It's very hard ro see three the 2 layers..",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "10 stars! Great product at a great price!",
      "text": "10 stars for the redesign! If you have a newer car that has sleeker doors (I have the 2018 Hyundai Elantra), this will work great! I bought two 2-packs so we could cover all 4 windows when we parked during our cross-country summer trip through the southern states where it was HOT. When we were driving, I kept the back two on to keep our stuff in the back from getting direct sunlight. The fit was great, I do believe it helped keep the temperature down, and the flapping didn't make much noise when we were driving (I bought ones before that were HORRIBLY noisy). I would absolutely recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Garrett",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Returned",
      "text": "It did not fit the windows on my Ford Escape. Was baggy and did not have any “suction” to stay put. We returned ours.",
      "rating": 1.0,
      "verified": true,
      "author": "Whitney",
      "helpful_votes": 6,
      "publication_date": 20190520
    },
    {
      "title": "Great for car napping.",
      "text": "We will be relocating soon to a new state ane realized that we'd be better off sleeping in the car than paying for an overpriced hotel room, especially since it'll only be for a few hours. Upon realizing that it would be hot in the car without any air conditioner and we don't want to be invaded by bugs, this seemed like the perfect solution. We can rest with the windows open while keeping light and bugs out of the car",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Morningstar",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Not full coverage!",
      "text": "I was disappointed when trying these on my Honda Pilot rear windows. They do not cover all the way down. The coverage stops about 2 inches short! I guess these were not meant for SUV's !? Just don't see how they can state that they fit 95% of vehicles of they don't fit small SUV's.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Sambolin",
      "helpful_votes": 3,
      "publication_date": 20190529
    },
    {
      "title": "Doesn't last in Arizona",
      "text": "Purchased in the end of April 2019 by the beginning of June 2019 they were already falling apart and loosing color. the first part of our summer didn't get above 95 so it wasn't super hot. Do not waste you money on these!",
      "rating": 1.0,
      "verified": true,
      "author": "B. Bray",
      "helpful_votes": 3,
      "publication_date": 20190709
    },
    {
      "title": "Works Great!",
      "text": "I bought these for when my grandson visited us here in Florida. I have a Rav4 and they were easy to put on and take off. It did help keep his car seat from being extremely hot from this Florida sunshine. I ended up taking the one off on the back driver side. I wasn't able to see very well out that window. Other than that I really liked them.",
      "rating": 5.0,
      "verified": true,
      "author": "Butterfly",
      "helpful_votes": 2,
      "publication_date": 20190509
    },
    {
      "title": "Great for sun protectant, bad to see in your blind spot when driving.",
      "text": "We bought this to use on my daughters side of the car to protect her from the sun. It works great. But I can't see out the window when looking in the blind spot. That's the only downfall. It worries me a bit so we don't use it often or unless I have someone else in the car with me who can see sitting in the back that its clear to switch lanes.",
      "rating": 2.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "NOT FOR MINI VANS",
      "text": "The picture clearly shows a mini van with the screen on it. It in NO WAY SHAPE OR FORM fits a back mini van door! You can’t even use them on the front doors because of the mirrors. I use my mini van to camp in sometimes and even when the car is not moving these can’t be used. I even tried to cut up one of them to go over the support and would reinforce the edges and put on snaps but they don’t come all the way down the door anyway like the picture shows. Plenty of gap to let the bugs come right in.",
      "rating": 1.0,
      "verified": true,
      "author": "Alicia Neagle",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Keeps car so much cooler & bugs out",
      "text": "They are awesome for when my car is parked at work. They fit perfect on my 20 Subaru WRX STI. Roll the windows down & they keep the bugs out & also allows the breeze to flow through keeping my car cooler. Driving they are also awesome to allow the breeze to flow through. No need to use the AC, unless it’s a really humid hot day.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary F",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Read carefully and Double check required measurements",
      "text": "Unfortunately this 2019 UPDATED version of product didn’t fit my vehicle - after taking proper measurements based on example, my window fell within the range of min and max or at least based on how it showed to do the measurements. It was too small and does stretch but I didn’t want to further extend it because it would eventually tear. 2004 Jeep Grand Cherokee",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190630
    },
    {
      "title": "Dont stay on Chevrolet 2 door Silverado",
      "text": "This is great shade want stay on my window thow . So I had to get strong velcro with plastic teeth . It worked but I am military and have to show my I d at gate so I was haveing to undo it a lot and it created a hole in 2 weeks. I dont have electric windows so does not do me any good on other window . I would by this brand agin if thit has a zipper for fast good and I'd showing. And velcro I get.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Easy and effective",
      "text": "Works really well and easy to take on and off, I was pleasantly surprised. It fits better on one of our cars than the other, just due to the shape of the window, but it is what it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Nordstrom",
      "helpful_votes": 3,
      "publication_date": 20190628
    },
    {
      "title": "Game changer! I’ll buy these for anyone I know having a baby!!",
      "text": "Amazing! Fits perfect on the rear windows of my 2016 Dodge Journey Crossroad SUV. I tried two different suction cup pull-down shades that failed. They just don’t make that kind large enough for big windows and the suction cups were coming off a lot. This slip on shade covers the entire window and provides the perfect amount of shade/sun protection. I can still see out the window while driving. This is a genius invention! Being able to roll down the windows but maintaining the shade and protection from debris is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Txcinnamongirl",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Good option for keeping sun off kids/toddlers",
      "text": "It's a little loose on my windows but I just pulled it down below my window some to make it more snug. The bad thing is that it's difficult to see out of the window, especially at night. It does a good job of keeping the sun off of my daughter though which is why I got it. We put one on my car and one on my husband's. I remove it when my daughter isn't in the car. Much cheaper than tinting the windows!",
      "rating": 5.0,
      "verified": true,
      "author": "Neytira",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Everyone teases me, but I'll take it for the complaining I don't have to listen to anymore!",
      "text": "They may look a little silly, but my child is constantly overdramatic about sun being in her eyes or face. The little suction ones don't cut it for us, and these are far better than hanging a towel or blanket in the window. I love the full coverage. They work so well! Easy to slide on and off. Love that you can roll the windows down! And they still block the sun! Woo! So, tease away about my weird self done tint attempt friends. My 4 year old hasn't complained about sun in her eyes once since I put them on a month and a half ago. God Bless America!",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Creer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Stretchy and adequate sunlight blocking protection when parked.",
      "text": "I bought this simply to block the sun when I'm sitting in my vehicle's driver's side during lunch break. The sun is always shining right into the window and I can't park anywhere else. How it fits depends on the shape of your door frame. For me, I have to stretch it over the inside door handle and shut the door on it or it will slide up. What makes this more convenient than the sunshades that stick on the windows is that I can have the window down while this is over the whole door frame.",
      "rating": 4.0,
      "verified": true,
      "author": "Tronozon",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "easy shade - wish it was a tighter weave to block out sun",
      "text": "This product was easy to slide over the car window. However, I wish the elastic hem was more snug. Also, it doesn't block as much sun as preferred. If the windows were tinted to begin with in addition to using the sun shade, then you'd be in good shaped. My car is not tinted and looking at my daughter in the back seat, it looked like the sun was always in her face.",
      "rating": 3.0,
      "verified": true,
      "author": "Elliot H. ",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Length is no way 23 inches.",
      "text": "No way does this shade have the dimensions listed. See pictures for reference. This is on a 2019 Ford F-150.",
      "rating": 1.0,
      "verified": true,
      "author": "Krammit",
      "helpful_votes": 5,
      "publication_date": 20190630
    },
    {
      "title": "Amazing must have",
      "text": "By far the most amazing product. This is the second time I’ve had to buy it unfortunately I have a two-year-old who likes to rip things. it took him quite a while as the material is phenomenal but after a while of him pulling and stretching and I mean months he was able to do it but I am buying the product again because I believe in it and it’s amazing. It is by far the best shade for my kids that I have ever purchased. You will not be upset with this purchase and it is worth every penny and more.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Fits 2019 Crosstrek",
      "text": "Bought these for camping in the car and they did not disappoint. They fit my Subaru Crosstrek *almost* perfectly. The very slight slack isn't bothersome - even when driving at 80+ mph, I didn't notice any vibrating except during a gust of crosswind. Absolutely worked for my purposes. Drove 1800 miles with them installed and didn't notice any tearing, so I think they will last several long trips as long as I'm careful not to stab the corner of the door through the mesh.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily F",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Not Impressed",
      "text": "I was eager to give this a try, so I opened the box and I took out the covers, I scanned the QR code and watched the tutorial video. I put the cover over the window and it did not go all the way down. It looks like a mid drift. I tried stretching it some more and nope. It did not cover the whole window. I believe I got a small size.. Meh, I wasn’t too impressed. Every time I open the door it shrinks up a little bit and I have to tug it down and close the door so it could be snug.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicolette Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great product for those traveling in the sun",
      "text": "This is my second purchase of this item. I bought this set for my mother who just moved to Sierra Vista AZ. What a great community! Anyway, this is a must have item for anyone who travels in the sun. I love it because it allows my wife and dog to stay shaded. We only have one set on our vehicle but we transfer it to what ever side will face the sun. We will be moving in a few years to Thailand and my wife wants to bring multiple pairs there so we have them on all our vehicles.... Try it....",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Does Not work",
      "text": "I bought these product for my car to protect my daughter from the sun, so it wouldn't as strong on her. It wasn't easy to install it was confusing. Also it was too big for my window. In the description it had mention you could roll window down and it would still be there but its nothing but a bunch of lies. I would not recommend it to anyone and I wouldn't buy it again. I actually went to the store and bought a different pair of window shade for the car and they work much better, easy to install, and it was much cheaper. Will not buy again. Very dissatisfied.",
      "rating": 1.0,
      "verified": true,
      "author": "Maria J",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "easy to install but fade super quick",
      "text": "I've had these on my vehicle for almost 3 months now, they do provide pretty good sun protection so that's a plus. The part that is outside the car faded after about a month so I'm hoping they don't start breaking down, but I also leave them on my vehicle all the time. They also help with keeping bugs out if you have the windows down. For the price I'd say it was a great buy and I'd recommend them. I'd also recommended rotating them every couple days so maybe they won't fade as quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "TessV84",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Tends to slip up if the bottom of the window is wider than the top.",
      "text": "These are great for shading the little ones in the back seat. My only complaint is they tend to slide up on the window frame, which is wider at the bottom than the top. When they do, they wrinkle in the middle and make it hard to see out the window, creating a blind spot. I worked them under the trim at the bottom of the window on my wide’s car, and they work great. I don’t have any trim on mine, so they don’t work well on it.",
      "rating": 4.0,
      "verified": true,
      "author": "sergeant285",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Super easy!",
      "text": "The sun shades were perfect for my car camping! Literally you slide them over your window in 2 seconds, the material was thicker than I had anticipated and I think I’ll be getting a lot of use out of them for camping in my Subaru Outback. They kept the bugs out and allowed fresh air in. They unfortunately also allowed in the rooster down the road with his crowing at about 5:30 in the morning! But that is not the fault of the product. Super product for camping. I don’t have small children riding in the back of my car so I can’t speak to that use. I would certainly purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Zeke",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Works pretty well, Easy to install.",
      "text": "Very easy to install and I like the fact that I can open my window with it installed. I have this on a 2017 Chevy Bolt. This wouldn't work on my Tesla Model 3 since it is a frameless window. however which I already knew. It blocks a good deal of direct sunlight which in the past has bothered my son. We ended up putting up one of those suction cup screens that he would rip off or would fall off if we ever rolled the windows down. This fixes all the annoyances of those other shades.",
      "rating": 4.0,
      "verified": true,
      "author": "Hai",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Functional",
      "text": "Great item. Fit on my Equinox back window just fine. Used with window down a bit and did great. The only thing is they are super dark so to glance back over left shoulder to check lane for cars you can't see anything.....need to use mirror.",
      "rating": 4.0,
      "verified": true,
      "author": "Mclege",
      "helpful_votes": 2,
      "publication_date": 20190624
    },
    {
      "title": "Wish I had found these years ago!",
      "text": "I was skeptical when purchasing...but these have made summer so much easier! My dogs are usually in the car with me, but protecting them from glare & heat while driving was a constant battle. These shades work beautifully, pull on in seconds, & stay put. They are so easy to carry with, I'm now never without year-round. Buy a few sets... everyone in my family wanted these shades!",
      "rating": 5.0,
      "verified": true,
      "author": "TAugust",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Awesome product",
      "text": "Easy to install. I use these very often. Come with a bag to store the shades when not in use. I keep it in the car and when I take the kids for a ride, I simply slide these over the rear windows. They work great and even though they have snagged a couple of times on my car's window frame, they sleeves have not torn or run. Very happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose L. Garcia",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Second brand I ordered. The better brand",
      "text": "I ordered another brand and they came with a hole ripped in one of the shades, so I ordered this brand as a replacement. None of the brands are recognizable to me so I’m just guessing and hoping that they will work. It arrived a day early and will definitely meet my needs! The material feels like a better quality than my last purchase, thicker softer and stretchier.",
      "rating": 5.0,
      "verified": true,
      "author": "sngglebnny",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "These are awesome!",
      "text": "Note: I havent driven with them on. I live 120 miles away from my qork and commute 3 days a week. This means I sleep in my car while I'm working. I work night shift and sleep during the day. These fit me rear windows perfectly and keep the sun out and allow the breeze in while maintaining some level of privacy. These have been thw perfect addition to my camp kit!!",
      "rating": 5.0,
      "verified": true,
      "author": "Snowfoxrox",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "XL my butt",
      "text": "XL... yeah, right. Didn’t fit my Kia Sorento windows. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Kate Haruch",
      "helpful_votes": 3,
      "publication_date": 20190708
    },
    {
      "title": "does it fit",
      "text": "I got the biggest one they sell and seemed measurements were right. But it was little small. However I was putting it on a ford econo van which has larger windows? anyway, if you buy I would buy larger to be sure. You can a;ways leave excess out. It was a very quality item and I loved the storing nylon bag, throw it under seat untill needed. Slept in my van on beach, needed ventilation. worked well",
      "rating": 4.0,
      "verified": true,
      "author": "chuck h",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice quality, durable, true to description",
      "text": "These for my Subaru Forester perfectly. They keep my back seat cooler, more importantly my son's carseat. I love that I can still roll the window down if needed. Seems like high quality mesh that I hope will last a while. My car is mostly sitting outside is southwestern sun but also resides in the garage when not at work. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Manda May",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Well made and great size",
      "text": "I’ve used these for almost a week and so far so good. It fits my 2015 Subaru Outback like a glove (not to tight that it’ll rip, and not baggy that it will flap around in the wind). We tried it with and without them on and it does give more shade. Also, you can still see through it (unlike my other ones), so no blind spots.",
      "rating": 5.0,
      "verified": true,
      "author": "CareNotDude",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Worked and Fit great!",
      "text": "Bought this for road trips to help block additional sun for my son. Tints are already on the window, but this was added blocking without the blackout. Purchased for a 2020 Hyundai Santa Fe. Fit perfect on the rear door. No moving, no flapping, not oversized. PERFECT. Would definitely recommend more for a SUV than a car.",
      "rating": 4.0,
      "verified": true,
      "author": "Cin",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Love-ish",
      "text": "This really works well! I just don’t like how it looks on the outside of the car and when traveling on the highway it does make slight noise. We now just us it when we park in the sun. It helps keep the backseat cooler than it would have been without it. So we put it up in seconds and then take it down when we drive.",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon Surran",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Good, but a few things to note.",
      "text": "It’s important to note that These will not work/fit as intended unless your doors have frames around your windows. My Subaru Forester has frameless windows, so these shades don’t fit tightly and also render the windows inoperable when on. However, they do keep my car significantly cooler as well as keeping my daughter’s car seat cooler, which is a huge plus. My daughter also can’t take them off, unlike the static cling type.",
      "rating": 3.0,
      "verified": true,
      "author": "Wumpshire",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Will buy again",
      "text": "Love these, only last about one year just fyi. Great sun protection though! Have a midsize SUV and it fits the back door windows. Hit right at the bottom of the glass not all the way down to the window seal.",
      "rating": 5.0,
      "verified": true,
      "author": "KayMo",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Peyou Window Shade",
      "text": "This is a great product and super easy to install. Fit very well in my Toyota corolla windows and protects the kids well from blaring TN sun. It does get bunched up once in a while but I just pull it down before I start driving to make sure it does not block my view. Much much better than those suction/static sun shades that my kids would just pull off and then scream because sun was hitting their face.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Do it! These are great",
      "text": "Like what?! These look so great on my CR-V. My toddler hated how the sun was always in his face. I have dealt with pull downs, suctions and stickers. No thanks! These are so easy to slip on and don't mess up my window. Not to mention, my toddler can't pull them down or off. I love these so much, I shared them on my social media. And I can still put my window down and not worry about my little one throwing anything out or anything getting in. These are a life changer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Simple and easy.",
      "text": "Extremely effective and easy to install. It doesn’t interfere with window use and blocks air from blasting in when wife open. Beware that it blocks a ton of which can make it difficult to see your child in the back, especially when wearing sunglasses, and does limit your vision out that window when driving. Will update on longevity of the item as we take it off when not in use to limit its exposure to the sun.",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Loved these. Highly recommend.",
      "text": "Love these. I got my windows tinted and they don’t block the sun as good as these did. Loved that you could roll the windows down with these and not worry about removing to do so. Blocked some of the wind for the kids. Am considering purchasing again to go over the tinting because they did so well. We drive a Nissan Altima and they were a one size fits all and fit nicely on ours.",
      "rating": 5.0,
      "verified": true,
      "author": "Allysa B.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "easy to install, fits well, does the job",
      "text": "Had mine for about a month. Fits my 2008 Prius well, super easy to install in like 5 seconds, going strong after a month so far. Comes with two so I have a spare which I doubt I will ever need as this one look like it will last longer than my car. Nice packaging, good price, still allows my kid to open his window which is better than the suction cup ones.",
      "rating": 5.0,
      "verified": true,
      "author": "slow runner",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Perfect",
      "text": "My dog gets motion sick in the car so these go on the side windows and then I pull the screen up on the back window. Do you need help tremendously. It also helps to put the air-conditioning on freeze me out and a prescription doesn’t hurt either but he’s covering the windows definitely help",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Andrews",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Worth it for us",
      "text": "These fit my 2016 Toyota Corolla well and are 100% worth it for me to keep my 6 month old cool and shaded. I've been using them for a little over a month and one of them has developed some small holes and there has been one occasion when the rain created a fog between the mesh and the window and I couldn't see out of them at all. Now I try to remember to take them off if it is storming out.",
      "rating": 4.0,
      "verified": true,
      "author": "Lora Levisee",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Perfectly Perfect",
      "text": "My passenger windows are tinted so I bought these for use on my driver's windows. On my 2019 Yukon they just fit. I have to fold the sideview mirrors in or they would not fit. I don't drive with them on. The vehicle sits quite a bit. I use these to help keep the heat out and for UV protection.",
      "rating": 5.0,
      "verified": true,
      "author": "startagl",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great shade",
      "text": "Used these shades for our road trips to central California and it can get pretty hot out there. It fit our Honda Accord Sport windows just right. Thickness was great. Just wish one side would be lighter than the other. You do have to get use to driving with the shades on. Especially when changing lanes and you're depending on your side view mirrors, instead of looking over your shoulder.",
      "rating": 5.0,
      "verified": true,
      "author": "Pogi G",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Easy and smart",
      "text": "This is the perfect idea. It fits literally any car and keeps kids from throwing things out the window but offers good sun protection from bright rays. Takes literally a second to put on and take off. I keep it in the side pocket and only use it when the baby is in the car. Looks like its easy to wash but I haven't had to yet. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "NoRegerts",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Ok",
      "text": "This is good for a quick fix, but the sun comes in where it doesn’t cover in the back window. The door covers are super easy but it’s kind of a pain to remember to put them on and take them off all the time. And the suction cups are not so great but it hasn’t fallen off. And it’s very hard to see out of the windows at night with these on.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Cataldo",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great sun protection and easy install",
      "text": "Love this because we can still put the window down and up without worrying about taking the shade off. Its very dark so you get very good sun protection. It can slip off sometimes we just make sure to pull it down and close the door so it stays put when its acting up. It can make it a little hard to see out that specific window but you can still see you just have to make sure you look better for safety",
      "rating": 5.0,
      "verified": true,
      "author": "Amber gottfried",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "What you see is what you get! Shades+ affordable",
      "text": "Product looks, fits exactly as described. I've ordered SEVERAL and This one hands down fits, but ACTUALLY shades! Also allows for airflow . Can use this with windows rolled DOWN which was an issue with ALL the others I bought Seller also made sure to reach out to make sure I was satisfied. DEFINITELY worth buying!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "I love it",
      "text": "I love this. I don’t use it as a shade. My rear window won’t roll up so I’m using this as a cover until I can afford to fix my window. If someone wanted to they could easily have access to my car but so far so good, no one has taken anything. It is a pretty good disguise instead of having the window rolled all the way down so exposed.",
      "rating": 5.0,
      "verified": true,
      "author": "Landa",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Size discrepancy",
      "text": "I took note of measurement information before ordering, of a max width of 44.9\" and max height of 25.6\", which clearly isn't how it fits. Pretty disappointed that the height doesnt fit over the full window as I purchased more for a bug screen with the added bonus of sun protection. Installation is the easiest- just slide it over and make sure the square corner of the shade is on the square edge of the door. Passenger side shade doesn't add much of a blind spot, but the driver side one does because of the angle.",
      "rating": 4.0,
      "verified": true,
      "author": "Miss Coach K",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Rear view window in the way",
      "text": "I’m sure these would’ve worked great on my rear windows but what is needed is this for the driver side window. I could not use this on the driver side window because my rearview mirror window got in the way of this going down and around my car window. I had to send it back. Very disappointing because I really wanted this to work.",
      "rating": 3.0,
      "verified": true,
      "author": "Top10amazonpurchasesjunkie",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Great sun shades for those that like to roll down the windows",
      "text": "These are super easy to install and I love them because they can be used with the windows down. Also, they keep the bugs out when the windows are down, meaning I​ can leave the windows cracked all the time without worrying about the bugs and flies getting in the car. They do not block the sun as well as I would like, but they do a fair enough job.",
      "rating": 4.0,
      "verified": true,
      "author": "Destinea Ancar",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Better than the suction cup ones!",
      "text": "they go on easy keeps it shaded in back and even if it rains my car seems to be doing a good job keeping it sealed. if anything it gets alittle damp around the edges ut drys fast... i love them fit my kia perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "CFlerlage",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "They kept us cool driving through the desert",
      "text": "We used these for our 6 hour drive to fishing trip. Most of the drive is through the desert. My toddler daughter and i were sitting in the back seat and they kept us very cool. The only thing was that they are a bit hard to see out of. So when our driver looked over her shoulder to switch lanes, she had a hard time seeing through them.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "It doesn't fit the window",
      "text": "It doesn't go to the bottom of the window. Not happy with it.",
      "rating": 1.0,
      "verified": true,
      "author": "penny s gorringe",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Not quite large enough for a small CRV",
      "text": "Not quite big enough for a Honda CRV, but almost covered the whole window. Otherwise it worked well and served its purpose for sunscreen protection.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20190629
    },
    {
      "title": "Great product just wish y'all made front window shades",
      "text": "I love this brand of shades. Have tried 2 others since I purchased these and no one can provide this quality of a product it seems. Just wished they made front ones. That's what I've been buying and they are cheaply made not like this product. Outstanding! Oh and it keeps my baby cool and out of the sun.",
      "rating": 4.0,
      "verified": true,
      "author": "Naomi",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Size up for Trucks (F-150)",
      "text": "A little saggy or just a tad too short. We have a Mazda CX5 or a Ford F150. Sag occurs on the CX5 and the just too short occurs on the F150 (PICTURE included) size up if you have a bigger windowed vehicle. The sun shade is perfect thou. We shall see what happens when it rains thou. I feel like the fabric could be a little tighter and still accommodate the same range of windows. But it does the job way better than the roll up Suction ones you can buy from the store",
      "rating": 4.0,
      "verified": true,
      "author": "The Meltons",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "These are a GEM!",
      "text": "These are a gem!!! I purchased these for my god daughter, the back seat always tends to be hot for her and after installing these I have no issues! It keeps the back seat of the car to a minimum temperature where it will not bother the littles ones and it’s not so hot! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "kimberlee",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Fits Mazda 3 Sedan",
      "text": "Easy to install and filters sunlight without totally blocking the view and you still have the ability to roll down the window. My kiddo with ASD approved of this shade. Material is also good, stretchy and thick, it seems like it can last for a significan amount of time.",
      "rating": 5.0,
      "verified": true,
      "author": "MonkeysMomma",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Does what it advertises",
      "text": "Fits a Toyota Tacoma, Honda CR-V and Subaru crosstrek no problem. Blocks out the sun well but does make it a bit difficult to see out that window especially when it’s a bit lose and wrinkles (on the crosstrek). Super easy to install though and I love that you can roll down the window and it still protects against bugs and sun",
      "rating": 4.0,
      "verified": true,
      "author": "Bemused",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Easy install, affordable",
      "text": "Slides over my door fine. A little saggy but I ordered the biggest one which was my mistake. I use it to cover the drivers side and passenger side front windows while parked at work in the sun for long hours. Seems to work just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "adam Fearon",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Best 18 bucks!",
      "text": "I love these, (though I wish there were more color options). They are quick to put up and take down, there is no fussing with folding it up because of the pleats, and they are small and light weight enough to move between cars without any fuss. These are made with light weight fabric stitched along the edges with magnets within the top boarder attach it to the edge of the metal car frame. There is also a magnet at the bottom of one side to prevent the curtain from getting sucked out as you close the door, this is a very well thought out and designed curtain!",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel Kim",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Wish I bought it sooner!",
      "text": "I had a different shade on the window so that the sun wasn't beaming in and hitting our little one in the face, but if you tried to roll down the window at all it made it pretty much useless. This shade fits perfectly, my little one loves the feeling of the breeze when you roll the window down, and the best part is no matter what he isn't squinting because the sun is beaming through his window. Definitely a good buy",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle T",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Works great for camping.",
      "text": "We bought a set for the rear windows to use while camping, and it worked so well for us that we purchased a second set for the front windows. We liked that we could choose the size and style that we needed. It has a tight weave so any breeze is somewhat subdued. We are able to keep the windows lowered, allowing for some cooling and privacy while keeping the bugs out.",
      "rating": 5.0,
      "verified": true,
      "author": "cruzin susan",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Works on my Prius and Hyundai",
      "text": "I drive 7000 miles per month in my 2007 Prius. The door holds it well, but not all vehicles will. Have had it for a few weeks now and has held up to hours of 80mph driving with the window down. Zero tears/frays as of checking this morning. You can feel the difference in heat on your face when sitting with and without this shade. I was skeptical, but for the price it's pretty great. I currently have 2 of these and am happy with the purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Blacked out back.",
      "text": "I put both in the back because why the heck not. Boy does it look dark back there. Blocks out the sun very well. Wish it was just a tad bigger. Car I have is a Chevy Equinox 2018.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Very happy with these!",
      "text": "These are fantastic! Slip over the door, close the door and BAM ~ Done! Windows can still be down, the thing is locked in place by the door being closed. Great quality too. Fits my 2017 Nissan Sentra very well, actually a little big but Im OK with that since we will use on a truck as well!",
      "rating": 5.0,
      "verified": true,
      "author": "EvilAngel",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Better than those suction ones that goes on the windows",
      "text": "I initially bought one that stick to the car window but those ones do not cover the whole window so when the sun is at certain angles, the sun still pokes through. These ones fit over the whole window so not only does it prevent the sun from coming though, it also allows me to roll down the windows! which is amazing because I sometimes forget that the suction ones are on the windows and roll down my windows accidentally which renders them useless.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Amazing",
      "text": "Bought for my Mother who has a sun allergy so she can use when riding in cars that don't have tinted windows. Very easy to use and definitely worth the price. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "just so so",
      "text": "i saw the reviewed this one is good ,so i buy it ,i try to use it but i feel it is not useful,but not too bad,just so so",
      "rating": 3.0,
      "verified": true,
      "author": "li",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "No bugs in my car?  SOLD!",
      "text": "My son and I car camped last summer and these were easy to install and use. It was great for letting in air during the evening, but not the bugs. If you car camp or want to try it...these are a great investment for not a lot of money. Well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Love Kingsbury",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "These are genius - New style is bigger!!! Yay!",
      "text": "I love these. Bc my kids can’t pull them off while I’m driving and I can open the window if needed. *Update bc over time they fade, so we bought a new set. I don’t know if they’re bigger or what, but they fit my Kia Telluride perfectly! I wish I could give more stars",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Good price",
      "text": "I love this product it fits my car windows well however I’m not sure if it’s still doing it’s job since the outer cover is completely gone from black to grey and I’ve only had it for a couple months.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Perez",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great product",
      "text": "Dislike the Discoloring of the product. Although it is still strong and serving the purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Citygbonnie",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great product",
      "text": "It's super easy to put over our doors and go. We can open the windows still with ease. The only con I'd have to say is, if left on for a long period of time, the black will fade to gray from the sun. But, it still works and I'll be getting more soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Kandi",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Only 2 pieces!!",
      "text": "I feel like it's false advertisement. It says \"2 packs\" a pack means its a group/set so i really thought i would be getting 2 sets which is 2 for front and 2 for back. I got 2 pieces!! 🙄🙄 It does work with the heat and sunlight but most likely will return it once i find one with 2 sets.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristine Faye",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Efficient",
      "text": "Great product so far. Definitely helped block the sun for my baby and it is very convenient that I can roll down the window with it on. Easy to install. Just looks a little weird on my car but it’s worth it",
      "rating": 5.0,
      "verified": true,
      "author": "P. Tim",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Good sun shade and big screen.",
      "text": "These are very handy to block the sun or use as big screens when car-camping. They look pretty sturdy and didn’t rip after my three-week camping trip. So, I will recommend this to other campers.",
      "rating": 4.0,
      "verified": true,
      "author": "BFD Club",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "I accidentally ordered the wrong damn size...",
      "text": "Well i got them the quality is there but apparently there where sizes one for suv type back door and one for sedan i have a suv but got the sedan part cause of amazon vehicle memory didn’t think i would have to change the size myself or that there even where sizes lol don’t make the same mistake i did and get the right ones",
      "rating": 5.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "great for road trips",
      "text": "These are super easy to install-they fit over our rear windows of our 2019 4runner with no problem. Love how kids can roll window down even with these on. They come off easily too. The only downside is that it's almost impossible to see the blind spot on driver's side when changing lanes.",
      "rating": 4.0,
      "verified": true,
      "author": "Tecateconquest",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Just bad",
      "text": "They have us vs them pictures in their listing. The ones I received are similar to the ones they are comparing theirs to. One is so large it can be pulled down and fit over the entire door. While the other is only slightly bigger fit. Either way they are loose and look terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Moses",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Works well",
      "text": "Giving it 4 stars only because it’s a little hard to see out of our Honda Fit with this on the drivers side. Passenger side is perfect and it works on both sides of our civic. I love that it slips right over and I can still roll down the window for a breeze.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Langley",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Good quality, works well. Best solution to sun shading for babies that I have found yet!",
      "text": "Seems like a good quality product so far. Fit perfectly and keeps the sun out of my babies eyes. I have been using it for a few weeks now and I really like this product it seems durable. Will update in a few months to see how it holds up to Texas weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Ally",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "There too big for my windows, but...",
      "text": "So I do really like these, but they're far too big for my windows in my Niro, so much so that I had to grab a few inches worth and tie them if to be able to see out of them to drive. I remember being very confused about the differences in the sizes offered, still confused.",
      "rating": 3.0,
      "verified": true,
      "author": "Meggy Magoo",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Great easy to install shade with slight noise problem",
      "text": "Fits well and easy to install. My only complaint is there is a slight flapping noise when driving at high speeds. Shades the babies well but doesn't affect rolling down the windows. Would recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Alex Humpherys",
      "helpful_votes": 0,
      "publication_date": 20200707
    }
  ],
  "product_meta": {
    "title": "PEYOU Universal Rear Side Baby Car Window Sun Shades,【2020 Upgrade Version】 Breathable Mesh Car Sun Shade－Fit for 95% Cars－Protect Kids Pet from The Sun－Cover Full Window－Travel E-Book－2 PCS",
    "rating": 4.2,
    "feature_bullets": [
      "【2020 UPGRADE SUNSHADE & FIT MOST OF CARS/SUVS】★★According to CUSTOMER FEEDBACK in 2018/2017 and MOST MARKETING RESEARCH, we have UPDATED our sunshades size and meterial, better elasticity, wider applicability, which fits for 95% cars windows, suitable Length: 27.5\"(Min) - 43.3\"(Max), Height: 16.5\"(Min) - 18.9\"(Max) .(Not suitable for frameless or sliding window.) ★★An E-book featuring 10 creative road trip games for kids and STORAGE BAG as gifts.",
      "【YOU CAN STILL ROLL DOWN THE WINDOWS】: Mesh car window sun shade, on the exterior of the door frame, you can still roll down the windows.",
      "【PROTECT YOUR KIDS PETS FROM SUNBURN】: PEYOU Car Rear Window Sun Shade, reduces heat, and prevents your children pets or other passengers who sit on the back of the car seats from getting burned or overheated.",
      "【EASY TO INSTALL AND REMOVE】: The flexible, stretchy mesh just slip over the open car door to install. Not annoying suction cups, fastening tabs or fiddly sticking. When not in use can be easily folded and kept in any car storage compartment.",
      "【UNIQUE DOUBLE LAYER DESIGN & 100% COVER REAR WINDOWS】: Double mesh layer Sunshades and 100% coverage enables your window to be opened. At the same time it also reduces more heat in car."
    ],
    "specifications": {
      "Manufacturer": "PEYOU",
      "Brand": "PEYOU",
      "Item Weight": "8 ounces",
      "Package Dimensions": "5.5 x 5.4 x 2.3 inches",
      "Manufacturer Part Number": "PE113-0026-01-001",
      "Vehicle Service Type": "Passenger Car",
      "ASIN": "B07NZSDB5M",
      "Customer Reviews": "4.2 out of 5 stars1,396 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#24,805 in Automotive",
      "Date First Available": "February 20, 2019"
    },
    "categories": [
      "Interior Accessories",
      "Automotive Parts & Accessories",
      "Side Window Sunshades",
      "Sun Protection",
      "Sunshades",
      "Automotive"
    ],
    "price": ""
  }
}