{
  "website_summaries": [
    {
      "verdict": "If you know a unicorn lover who also longs to have their very own pet to care for, this interactive toy covers 2 major wishes in one.",
      "pros": [
        "Vet-themed set allows kids to actively nurse Rainglow back to health using the included \"medical tools.\"",
        "2 modes let users alternate between caring for a \"sick\" unicorn and simply enjoying an interactive petting session",
        "A generous variety of sounds, motion combinations, and facial expressions keep kids guessing"
      ],
      "cons": [
        "Requires batteries",
        "Certain movements can cause audible mechanical sounds"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stopped working in less than a day",
      "text": "Would rate this one star but my daughter loves it very much. The reason for the 3 star rating is that ours stopped working in less than a day. At first I had thought the batteries needed to be replaced, but after replacing them with fresh ones, the unicorn never moved. The only thing that happens when you switch it on is the eyes and mouth stay closed shut and there is a musical chime. I can also hear what seems to be the motor struggling to get things going, but it just never moves. I had to order a replacement and will have to swap the broken when my daughter doesnt notice.",
      "rating": 3.0,
      "verified": true,
      "author": "Kris R.",
      "helpful_votes": 8,
      "publication_date": 20191117
    },
    {
      "title": "M. Recio",
      "text": "Just another toy for the kids to play with 1x and then never play with it again, but hey it’s cute and they just “GOTTA HAVE IT” ...",
      "rating": 5.0,
      "verified": true,
      "author": "Mercedes Recio",
      "helpful_votes": 8,
      "publication_date": 20190929
    },
    {
      "title": "Love this set!",
      "text": "We absolutely love this one! It’s so interactive and fun, but also teaches your kids about caring for someone/something else. My daughter loves to make her unicorn feel better. A lot of stuff to do with this one, and the unicorn is really interactive and responsive.",
      "rating": 5.0,
      "verified": true,
      "author": "Abc123",
      "helpful_votes": 4,
      "publication_date": 20191119
    },
    {
      "title": "So cute!!!",
      "text": "love this little baby unicorn! gave to my daughter for her 5th birthday and she a adores him",
      "rating": 5.0,
      "verified": true,
      "author": "Abel G Arocha",
      "helpful_votes": 6,
      "publication_date": 20191108
    },
    {
      "title": "Cute toy, love the interactive quality!",
      "text": "Gave to my 6 year old for her birthday. She LOVES this thing. It's fun to interact with by touching its head, nose, and back, or by touching toys to it. I love that it has a \"happy playful\" mode and a \"sick mode\" so she can decide how she wants it to interact. Seems sturdy enough. More than I would typically spend on a kids' toy, but she's super happy with it even weeks later.",
      "rating": 5.0,
      "verified": true,
      "author": "Titus",
      "helpful_votes": 2,
      "publication_date": 20191206
    },
    {
      "title": "Christmas toy game-changer",
      "text": "I got this toy for my God daughter and halfway through opening presents coming out of the second hour of the toys that they were unwrapping she open this up and her eyes were wide open in astonishment. My other niece who is about the same age as her saw the unicorn toy and thought my goddaughter had open up her presents yet she had gotten another cuddle bear and after that all hell broke loose both kids were screaming over this unicorn so bad of advice if you’re going to get this for a child make sure there’s not one of the same age who will also like unicorns that are just the shiny and pretty! Merry Christmas y’all!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Loveable!",
      "text": "I don't know who loves this toy more, my daughter or her mom! This Little Rainglow Unicorn was an instant hit! From the moment my daughter unboxed it! Mommy fell in love with it too! They put it to sleep and it snores! Put the bottle in its mouth and it sounds like a baby! Closes and opens its eyes so cute! This is my daughter's best gift this Christmas, even beat the Barbie Dream House!",
      "rating": 5.0,
      "verified": true,
      "author": "Carlo Verdi",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Batteries run out fast and now toy no longer works after one month. VERY DISSAPOINTED",
      "text": "My daughter loved it, however the batteries run out very quickly. Now shes had it a month and the thing stopped working. Very dissapointed for a toy i paid $50 for.",
      "rating": 2.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 2,
      "publication_date": 20191125
    },
    {
      "title": "Perfect unique gift for girls who just love unicorns",
      "text": "Great toy! I was delighted by how fun this is for our little girl. Very interactive, you can hear a heart beat, feed the uncikrn put bandaid on boo-boos and it has a response for all of that. This was a perfect option for little girls who love unicorns versus the standard puppy/kitten vet kits. Also purchased as a gift for another girl after our daughter got for Christmas and she loves it just as well.",
      "rating": 5.0,
      "verified": true,
      "author": "amber",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "cute but thought i got it as lighting deal for $40 NOW regualr $ 30??",
      "text": "It seems to be a nice toy, but I bought it in October thinking WOW a lighting deal for $39.99 so I hurried to buy for my niece for Christmas, she loves unicorns!!! THOUGHT I got a good deal BUT NOW ITS ONLY $30.00 REGULAR PRICE. makes me wonder how good of a toy it really is since the price cut. I feel not so excited thinking I got a LIGHTING DEAL. Should of waited for this price",
      "rating": 3.0,
      "verified": true,
      "author": "mcquay5",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Awesome toy, keeps kids busy for hours!",
      "text": "My 5 year old absolutely loves this adorable unicorn! I’ve never seen her play so long with one toy. She loves helping it feel better. My almost 2 year old loves it as well! He likes giving it the bottle and thermometer. Very well made, everything is quality about this set, no cheap plastic. I feel like it will last for a long time. Such a sweet and fun toy that all kids will enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Unicorns are real.",
      "text": "My granddaughter wanted a real unicorn for Christmas. This was a wonderful way to fulfill that wish. She went crazy for this. She four and just adores the unicorn. It was her favorite toy. The best toy is the one the child adores and will play with and my granddaughter plays with this for hours. Score one for grandma.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Fountain",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Fun initially",
      "text": "Product seems to have some glitches, unicorn doesn’t always respond to “treatments” and can be hard to turn on. My four year old enjoys it, but it isn’t a favorite go-to toy like I thought it would be. My daughter likes the pieces that Come with it and uses them with other toys too.",
      "rating": 4.0,
      "verified": true,
      "author": "Jackie G",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Meh",
      "text": "Got this for my daughter who loves animals & wants to be a vet. Seemed perfect. She hardly seems to play with this & it stays in her room. Wasn't too sure about this item based on the picture of the facial expression on the unicorn but the reviews got me. Expensive lesson learned.",
      "rating": 4.0,
      "verified": true,
      "author": "Cindee L",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Soft and fun to heal when sick",
      "text": "Way better than I was expecting. Super cuddley. My 7 year old loves this toy and likes to get the light up unicorn horn back to green so feeling better again when in the “sick” mode. The face movements and talking are really good and not creepy.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Anderson",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Who opened this up? - stopped working!",
      "text": "Its what my daughter wanted. But upon arrival it was in a plastic bag and the packaging was all ripped apart and open. All the “vet set pieces” were loose. UPDATE: I should have bought it from Walmart or something —-batteries changed but it is no longer working. Terrible purchase for such a exciting Christmas gift.",
      "rating": 1.0,
      "verified": true,
      "author": "MZimm",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Huge disappointment",
      "text": "Our child got it as a Christmas present. It has worked a month and now will not turn on move or anyting. We have tried changing the battery several times. Try different settings as well. It will not work and we've only had it a month. I tried to get into contact with both of manufacture and the seller without any luck. Our 3yr old is crushed.",
      "rating": 1.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "GREAT GIFT!!",
      "text": "This was a gift for my 1st grader niece that became her instant love!! It is a great gift for a little girl that might still like imaginary play (like playing dr or vet) and is into those girly unicorns. She even sleeps with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carly R.",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Makes ama good gift",
      "text": "My daughter opened this as part of her xmas gifts.. She loved it. It was the first one she wanted to open. It is a good little plushie that interacts. It gets repetitive but she liked it so i guess its okay for a toddler.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackssand",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great gift for five year old girl!",
      "text": "This was such an AMAZING Christmas present. Very interactive. She was able to play doctor with her unicorn while interacting with it. You can make it better by turning the unicorn horn a different shade. The heart beats and there are other sounds too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "five year old loved this",
      "text": "purchased as a gift for a precious five year old that loves unicorns and pets in general. loves to play vet and nurse her stuffed animals...so win win she loved this gift and that was a gift for me..",
      "rating": 5.0,
      "verified": true,
      "author": "bookworm 2",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Delightfully Surprised",
      "text": "My kindergartener wanted this so much. I finally gave in and let her use her own gift card to purchase it. I was delightfully surprised with the product. Works well, totally cute and it fascinates multiple ages. My daughter drags it everywhere. Worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanley",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "You get what you pay for",
      "text": "Some of the “medications” are a bit difficult for my 2-year-old to “administer.” I saw the age recommendation; I just don’t think it’d hold her attention when she’s 3 or above. It’s a simple product, and does a good job otherwise. No problems with quality, or shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "DonkeyBelly",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Fun Pretend Play For All Ages!",
      "text": "I purchased this for my 7 year old grand daughter for Christmas after she eyed it in the store. She loves all things unicorn & pretend play. My 5 year old & 2 1/2 year old grandsons liked it too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "She loves it",
      "text": "This beauty has cost me my sanity. She calls it her baby unicorn. She feeds it. She takes it everywhere. She hides it in her school bag when it is time for school. She absolutely adores this thing. Best buy for the last year.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Dont waste ur money.",
      "text": "So i got this for my daughter and it turns on and whines for 3 sec and then it goes back off it doesnt interact with any of the vet tools because it shuts off after 3 secs what a waste of money for it not to do what its supposed to",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Expectations exceeded!!",
      "text": "My best purchase this Christmas season. This little unicorn has lifelike mannerisms that steal your heart. It puts the caring into the traditional child's doctor kit. The child must care for the unicorn by giving medicine and shots. If done correctly the unicorn horn goes from red to blue. The animal purrs when petted and snores quietly when sleeping. It bats its eyes at your like it is looking right at you. So adorable. An amazing toy for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "RaS",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Love, keep healthily, teaches",
      "text": "Loved it all, bag for accessories would have been great.",
      "rating": 5.0,
      "verified": true,
      "author": "Omie",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Kids love it",
      "text": "So at first seems like it’d be for a younger child however my daughters 10 and I got this for her for Christmas and she hasn’t stopped playing with her.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly willey",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Make sure to replace all four batteries~!",
      "text": "My daughter just got to experience the \"try me\" mode, then she thought her unicorn had died but turns out we weren't replacing all four batteries :) So much fun but doesn't really do that much. Soft enough to cuddle!",
      "rating": 4.0,
      "verified": true,
      "author": "erin",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Very interactive",
      "text": "Was happy to find this for half the price as the store we saw it in initially. Arrived next day and before Christmas. My daughter is obsessed with it.",
      "rating": 5.0,
      "verified": true,
      "author": "CMRS123",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Kiddos love it",
      "text": "To me it is corney, but most importantly, to my daughter, she loves it. She is 7 and wants to be a veterinarian. Well, a sick unicorn always needs a vet in training.",
      "rating": 5.0,
      "verified": true,
      "author": "Martini81",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "So cute!",
      "text": "So cute! Beautiful eyes that open and close in a way that makes me think fondly of a Husky I used to have. Its motor is a bit loud, but it’s easily overlooked because of the cute!!! My daughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. A. Taylor",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good toy",
      "text": "I'm going to be honest.... this is a really weird looking unicorn. I'm not sure how my daughter really feels about it, but she does play with it often. The accessories are cute and the unicorn itself seems to be a really good quality toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra H",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Fun interactive toy",
      "text": "We picked this up on a flash deal. My daughter absolutely loves it and loves to play vet with the unicorn and her other stuffed friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy D",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Doesn't seem to work properly.",
      "text": "Guess I bought a dud. The toy lit up and made sounds for the first few hours after giving it to my daughter for her 5th birthday. By the next it would work sometimes if I turned it on and off. Replaced the batteries with new ones and it worked for about an hour after that. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "TheGuilty1",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Cute, but definitely for a household with no small children.",
      "text": "Cute, fun, and it was pretty reasonable when I purchased this toy (30$). My daughter LOVED it, but her 2 yo brother got a hold of it and broke it 🙄 that is all, because we had it for a week. Lol",
      "rating": 3.0,
      "verified": true,
      "author": "RHKarteus",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Daughter loves it!",
      "text": "My daughyer loved it. I got it for a great price during Black Friday and i am bery happy with how much my daughter plays with her unicorn.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth ruiz",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "So-So",
      "text": "It’s fun, but it doesn’t sit up. The way it’s made, the weight is off balance. It is awkward. The toys functions are fun, but it’s not very easy to use because of the above mentioned issues. I would still probably buy it again, but the price point is a little high for what it is.",
      "rating": 3.0,
      "verified": true,
      "author": "April Rau",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Works as described",
      "text": "My kiddo was excited for this. Works as described and just as creepy as I imagined it would be.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily D.",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "So fun!",
      "text": "My six year old daughter loves this toy! Fun interactions that keep her imagination going! Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Foster",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Love it",
      "text": "Purchased for my 3 year olds birthday she has not put it down and has been sleeping with it she absolutely loves it! It’s super cute and she loves feeding it ! Great price compared to other places",
      "rating": 5.0,
      "verified": true,
      "author": "Ncarico",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Watch out for price!",
      "text": "Haven't gifted, yet, as it was purchased as a Christmas gift, but COMPLETELY disappointed to see the price plummet 25%ish, ($40 to $30,) of the price I paid in October. The 2 star rating is because the toy looks it will be nice, but evidently the value leaves more to be desired..",
      "rating": 2.0,
      "verified": true,
      "author": "Maggie McColpin",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great for kids.",
      "text": "I got this toy for an 8 year old girl, she loves this unicorn toy . She can feed,give it medicine and it has emotions when the unicorn wants something. Great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "K pet person",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Exciting Toy for my Granddaughter",
      "text": "My grand-daughter was very excited to receive this toy. It was a definite hit.",
      "rating": 4.0,
      "verified": true,
      "author": "Joann Temple",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Perfect gift for any little kid that loves playing doctor and unicorns",
      "text": "Got two of these for gifts. I was unsure at first because of some reviews, but ours works great. It's very soft, moves, talks and lights up. Amazon is also way cheaper for this than in any store I've noticed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Fabulous Expression changes. Well made",
      "text": "My 6 year old daughter said I love it. The sweetest facial expressions. We'll be ordering more for gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Blondebabydoeshair",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Cute",
      "text": "All that matters to me is my 3 & 5 year old granddaughters love these. Cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfa0362",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great gift",
      "text": "Perfect gift for my little one. She hasn’t put it down in days. Great quality and works very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "rebekah",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Young doctor",
      "text": "My granddaughter loves unicorns and now she can care for her own!",
      "rating": 5.0,
      "verified": true,
      "author": "James O. Piebes",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Cute",
      "text": "Really cute and fun. My daughter loves making her feel better.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Great gift",
      "text": "My 4 year old granddaughter loved it. Cute and interactive unicorn",
      "rating": 5.0,
      "verified": true,
      "author": "LeeAnn",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Unicorn Vet",
      "text": "My daughter is obsessed with unicorns so I bought it without her asking for one and she loves it!! If your child likes unicorns this is a great product to buy. You will not be disappointed and neither will your child.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Skinner",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Adorable!",
      "text": "Super cute!! I bought it for my 5 year old daughter for Christmas and she ABSOLUTELY loves it! You can switch the unicorn to happy or healthy and when my daughter isn't playing with it she turns it off and sleeps with it at night. Definitely worth the buy if you know a child that loves unicorns!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good product, little pricey though",
      "text": "The head isn't soft, but it does move, so it makes sense. Our daughter loves the thing. Named it Sparkles and play with him daily.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank Douthitt",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Makes funny noises",
      "text": "It was a little odd. I was there for two days after my granddaughter opened this. She liked it, and we’ll see for how long.",
      "rating": 3.0,
      "verified": true,
      "author": "Patticake",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Adorable!",
      "text": "I think I fell in love with this unicorn just as much as all 3 of our children have! The sounds don't annoy me like I thought they would - they're actually really cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Perfect gift",
      "text": "Huge hit at a birthday party! She loved it and couldn’t wait to play with it",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Shipped on time",
      "text": "As expected, the toy was a nice Christmas gift. My daughter enjoyed it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lavonne Harrison",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Made Christmas so fun.",
      "text": "This item is great. My granddaughter fell in love with Rainglow. It is a wonderful present for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne Clifton",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Broken after 1 day",
      "text": "Stopped working after a day of playing with it. You can hear the motor or something trying to work but the unicorn does not move. We changed the batteries thinking that was why and nothing helped. We are so sad a disappointed my daughter really liked this toy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Better then expected",
      "text": "Such a delight. Daughter who is 3 loves loves this. It’s clever and cozy. Makes noise but is not annoying.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah S.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Adorable",
      "text": "My daughter just loves this! She has a bed for it and everything it wakes up and she rocks it back to sleep just the cutest",
      "rating": 5.0,
      "verified": true,
      "author": "Chrys",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great gift",
      "text": "Got for my niece for her birthday. She loved it. Even had the adults playing with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany Turman",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Excellent gift",
      "text": "This was a birthday gift for our 5 year old. She loved it! I was impressed with how easy it was to play with and how snuggly the unicorn was. I’m the past, animatronic animals are often heavy and hard even if the fur is soft. This is a very well made toy.",
      "rating": 5.0,
      "verified": true,
      "author": "PreschoolMama",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Save your money",
      "text": "My daughter loved it for about 5 minutes. It looks more like a sock puppet than a unicorn. Just saying.",
      "rating": 3.0,
      "verified": true,
      "author": "Cassandra Clement",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "She'll love it.",
      "text": "Funny looking little creature but my 4yr old daughter loved it so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Beto&Rayos",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Its ok but too pricey",
      "text": "Really cute toy but doesnt worth the money, for the toy that only makes a few noises, sucks on the bottle, blinks lights 50 something $$ was too much. It didnt keep my daughters attention for too long.",
      "rating": 3.0,
      "verified": true,
      "author": "Chad Deaton",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Beautiful and well made!",
      "text": "My daughter received this on her 5th birthday, which is also Christmas, and she ADORED it! It seems to be made really well. I would purchase this as a gift for a friend as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "My daughter loves this",
      "text": "Ordered this for my daughter for her birthday and she loves it even I enjoy playing with it with her she loves pretending to be a doctor and this little unicorn makes her playing even more exciting ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley lynn",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Greta Gift!",
      "text": "Bought it for my 4year old goddaughter and she Loved it !!",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandra",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Beautiful unicorn",
      "text": "Sent this gift to my 3 year old granddaughter for Easter. She loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Hogeveen",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Best present ever",
      "text": "Present received squeals of joy from 6-year old granddaughter. Best present ever. She has not put it down and takes it everywhere. Keeps her occupied while caring for the unicorn, and is also cuddly enough that she wants to hold it all the time. Wonderful product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great gift for age 4-6",
      "text": "Our 4 year old niece loved it and her 6 year old sister wanted it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Caligirrrrl",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Pathetically Awesome Toy",
      "text": "What’s better than adopting a dying unicorn and nursing it back to health. My 1.5 year old daughter loves it. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Super cute.",
      "text": "This Was a last minute Christmas splurge that we have loved. This uni orb is adorable. Love the sick mode and healthy mode.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Macmurphy",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Cute but, creepy",
      "text": "It is cute but honestly a little creepy. The noise it makes sounds like a child making a pony noise.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Uncle of the year!!!",
      "text": "My niece sleeps and goes everywhere with her unicorn.. She loves it. Got here on time as stated and on time for her bday. Thanks a million. Made me uncle of the year!!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Didn't work",
      "text": "Product not working and my daughter already opened with excitement but led to a disappointment",
      "rating": 3.0,
      "verified": true,
      "author": "Uma Chitbahal",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Stopped working after 3 months...",
      "text": "It was cute at first but it stopped working after only 3 months. It was well taken care of and only used a handful of times before it stopped working. Replaced the 4 batteries and it still does not work.. Daughter is very disappointed..",
      "rating": 2.0,
      "verified": true,
      "author": "Karrie Smith",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Cheaply made",
      "text": "Cheap. Batteries do not fit right, so the toy glitches or doesn't work at all?!",
      "rating": 3.0,
      "verified": true,
      "author": "Elisha W.",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Perfect for toddler!!",
      "text": "This was one of my three year olds favorite Xmas gifts!!! Gave one to her BFF for her bday and she loves hers as well!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Haynes",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Disappointed",
      "text": "I bought This back in September for a Christmas gift for my Granddaughter. She opened it a few days ago, and it does not work. We’ve tried 3 sets of batteries and nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly T.",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "5 year old loves",
      "text": "I bought for my 5 year old daughter. She loves it. So far everything works and has been durable",
      "rating": 5.0,
      "verified": true,
      "author": "Mike J",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "A live snuggly unicorn",
      "text": "The cutest unicorn we have! (And we have several.) Snuggle worthy, impresses all ages. Great gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Armo Fam",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "1 ⭐️",
      "text": "Barely does Anything and the bottle doesn't fit in mouth to feed. Kids lost interest in it quick. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber Lynn",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Not a good product",
      "text": "Sometimes the unicorn won’t work because it has a short in it from the time we opened the box",
      "rating": 2.0,
      "verified": true,
      "author": "golfer85",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "So realistic!",
      "text": "My daughter loves this toy, it’s so realistic! Money well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Schyleur",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Perfect gift.",
      "text": "My granddaughter loved this item and I was very happy with it quality. The order was placed and delivery was very quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Helpful Gram",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Daughter loves her unicorn!!",
      "text": "Bought for my 4 year old daughter for Christmas. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Zero star to the product and 5 stars to amazon customer service",
      "text": "I got this toy for my daughter for Christmas and after a week of gently use the you started malfunctioning. We unfortunately had to return it. Five stars to amazon customer service",
      "rating": 1.0,
      "verified": true,
      "author": "Acelina Ducey",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great item for kids",
      "text": "My 5 year old daughter absolutely loved this item and it does a lot for the money. She is so intrigued by it and enjoys playing with and caring for her unicorn.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hughes",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Big hit",
      "text": "5 year old adores it. She wanted to sleep with it, but the horn kept poking her in the eye.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Campbell",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Best toy ever",
      "text": "Amazing my daughter loves it She makes her sneeze and plays with her My daughter also takes her everywhere When she has a cold She helps her heal😎😎😎",
      "rating": 5.0,
      "verified": true,
      "author": "A.Z.",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Does not hold child's attention as long as other toys. Not very cute.",
      "text": "The unicorn is cute. 8-year-old girl who loves unicorns, pets, and vet stuff did not play with it very long. She still loves playing with her hatchimal, but not this electric toy.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabe P.",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Great Fun for Five Year Olds",
      "text": "Bought for Granddaughter and she loved it. Bought another for other Granddaughter and she loved it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Colby",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Quit Working in One Day",
      "text": "Didn’t work the second time my daughter picked it up to play with it. I changed the batteries but it still won’t do anything. Now I have a very upset little girl.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Carlton",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Nice idea If it worked (I’ve had 2 faulty)",
      "text": "This is a terrible product. We have bought 2. The first never worked, the second broke a month later (when I can no longer return it). My daughter is really upset as this was a Christmas present.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Cook",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Perfect faux pet",
      "text": "This was my 5 year old grand daughter's favorite Christmas present. She kept it in her arms all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana22",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Fun gift",
      "text": "My 5 year old daughter thought this was a great gift - so cute and realistic",
      "rating": 5.0,
      "verified": true,
      "author": "Chris A. Perkins",
      "helpful_votes": 0,
      "publication_date": 20200117
    }
  ],
  "product_meta": {
    "title": "Little Live Pets Rainglow Unicorn Vet Set - Interactive Pet Unicorn, Multicolor",
    "description": "Rainglow the unicorn loves to share mystical adventures with you but sometimes she can feel unwell and needs Your help. With your magical Vet set you can treat rainglow and make her better so that she is a happy and healthy Unicorn again! As you treat rainglow you can see the expression on her face change and her horn glows to show you she is feeling well again! The rainglow Unicorn Vet set comes with many (5) magical accessories to help treat your special patient. Listen with the sparkle scope to hear her heart beat in tune with her horn. Use the thermometer to take her temperature and hear her Sigh! Apply the dream cream to her leg to make her feel better! Wrap The magic bandage around her leg! Feed rainglow magical UNI drops to make her happy and healthy. \nrainglow has two ways to play!\n- rainbow mode: your unicorn is healthy, happy and playful>- magical Vet mode: your unicorn is unwell. Use your magical Vet set to treat her and make her better! Rainglow is so interactive with over 40 sounds and reactions! She even comes with her own \"get well\" Certificate!",
    "rating": 4.6,
    "feature_bullets": [
      "Rainglow is your magical pet unicorn who can sometimes feel unwell. Use rainglow's magical vet set to make her feel better!",
      "See rainglow's expression change on her face as you treat her and make her feel better!",
      "Rainglow's magical unicorn horn lights up and magically changes as she gets better!",
      "The rainglow unicorn vet set includes 5 magical accessories to make your unicorn better!",
      "Rainglow has two modes of play - rainbow mode when your unicorn is happy and healthy. Magical vet mode - treat her to make her feel better!",
      "Rainglow is so interactive! With over 40 sounds and reaction!"
    ],
    "specifications": {
      "Product Dimensions": "8 x 17 x 11.5 inches",
      "Item Weight": "2.3 pounds",
      "ASIN": "B07NSS34SF",
      "Item model number": "28863",
      "Manufacturer recommended age": "5 - 15 years",
      "Batteries": "4 AAA batteries required.",
      "Best Sellers Rank": "#31,166 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars1,137 ratings4.6 out of 5 stars",
      "Release date": "July 25, 2019",
      "Mfg Recommended age": "5 - 15 years",
      "Manufacturer": "Moose Toys LLC"
    },
    "categories": [
      "Toys & Games",
      "Stuffed Animals & Plush Toys"
    ],
    "price": ""
  }
}