{
  "website_summaries": [
    {
      "verdict": "This lightweight handheld toy vacuum closely resembles Black & Decker’s actual Dustbuster, while its lifelike sounds and fun “dust-collecting” action are sure to entertain.",
      "pros": [
        "Button operation makes Styrofoam “dust particles” dance about inside the transparent vacuum",
        "Realistic vacuum sounds",
        "Modeled after the real vacuum",
        "Includes 3 AA batteries"
      ],
      "cons": [
        "No actual vacuum suction"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It doesn’t suck (Literally)",
      "text": "I thought it would actually work! My daughter is wanting to use my vacuum and I wanted to find one she could use too! I guess pretend clean up will have to work for now.",
      "rating": 1.0,
      "verified": true,
      "author": "AmandaElizabeth777",
      "helpful_votes": 25,
      "publication_date": 20191203
    },
    {
      "title": "Any kid who loves to play pretend, will love",
      "text": "This was so darn cute. I bought for my son who loves the vacuum. We call it Mr. Zoomy. Now he has his own to play with, when mom and dad vacuum. It's seems to be good quality, even makes noises like a real vacuum. Does not actually suck anything up, just a pretend toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Alleycat",
      "helpful_votes": 4,
      "publication_date": 20191227
    },
    {
      "title": "So cute",
      "text": "Our toddlers love to use the real mini-vac, but it's still heavy for them and is rather dirty. This allows them \"clean\" alongside me or just carry it around for fun. The sound is a moderate volume, I don't find it too loud or annoying. I'm glad it doesn't actually suck anything up because then it would be just as dirty as the real thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Alana",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Mommy's helper",
      "text": "My 2 y/o son loves to vacuum (or bacuum as he calls it) and this was a great little toy I got to distract him during a long car ride. It came in handy SEVERAL times. It has little foam balls towards the tip of it to give the illusion it's picking up dust and dirt. Cute toy. Simple. Makes a vacuum noise when you push the button, foam balls will move about and that's the gist.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan Bent",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "A mixed experience with a cute toy.",
      "text": "My 18-month-old grandson was trying to haul around that real thing before Santa brought him this. He loves it. I didn’t love that I clearly received a returned model with the battery power all gone (while paying for a new one) necessitating a tiny screwdriver search and new batteries. An “A” experience for the Tiny; a “C-“ one for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Minneapolis listener",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Perfect for a vacuum loving toddler!",
      "text": "My toddler is obsessed with cleaning tools 😂 He loves to follow me around with the broom and the hand vac. A few weeks ago, we purchased him a wonderful broom/mop set which he loves! But he still insisted on carrying around the large hand vac, which is heavy for him - he drops it a lot. I found this and it solved our problems! This has been one of our very best purchases! Now if it would only pick up real crumbs, I’d be able to eat those bon-bons that have been waiting for me! 😂",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Perfect toddler toy",
      "text": "So my 2 year old grandson is obsessed with vacuums of every shape and size... I got this for our house and he carries it around all the time. I did put a piece of painters tape over the speaker to quiet the toy which did the trick of making it “adult-friendly” lol",
      "rating": 5.0,
      "verified": true,
      "author": "GranburyAR",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Didn't work properly",
      "text": "Toy came defective, the motor on the inside doesn't turn so it doesn't move the little pieces on the inside around when you turn it on. However, my toddler had already seen it and would not let me take it back so we did not return.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathleen King",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Wish it suctioned",
      "text": "This is a cute little toy for a little one who loves to help “clean” around the house. It would be amazing if there was even just a smidge if suction. Kind of like the kids dyson vacuum. That’s why 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "mix2grey",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Fun toy! No suction.",
      "text": "Very funny that Amazon put suction power as a review field — this is a toy!! It’s a great one, at that. Even has little pellets inside that make it look like it works. The kid is besides himself.",
      "rating": 5.0,
      "verified": true,
      "author": "Quantum Anjel",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Kid Loves It",
      "text": "Our toddler loves to \"help\" clean at night, but we didn't want him throwing around our expensive vacuum cleaner, and this toy was the perfect Indiana Jones switch. He grabs every night when he gets done eating and \"cleans\" up his mess.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan Rose",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Very cute for a baby/toddler",
      "text": "Very cute for 12-18 month old. Only thing to note is the small beads only move when the button is held down. If the child pushes the button for the noise to start they may get upset the beads stop moving but the noise stays on.",
      "rating": 4.0,
      "verified": true,
      "author": "BusyBee",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Toddler son loves it",
      "text": "I bought this because my son was constantly trying to turn in the real Dustbuster we have. He loves this! He sits with it in his lap, and likes to watch the things swirl in the end. It doesn’t actually suck, it’s just for looks/sounds.",
      "rating": 4.0,
      "verified": true,
      "author": "Jodi M.",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great!",
      "text": "Ready to use out of the box. My 2 year old loves vacuums and loves this. It even handles him dropping it on the hard floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Too loud",
      "text": "My son loves it but man is it loud! I recommend putting tape over over the noise to make it less obnoxious",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsey Honor",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "My Kid loves his",
      "text": "Cute toy. My kid is obsessed with all things vacuuming lol. He likes it but don’t expect it to do much besides make a cute noise",
      "rating": 4.0,
      "verified": true,
      "author": "Krista Garrigus",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "great toy for pretend cleaning",
      "text": "My 2 year old grandson is fascinated by vacuums. He has the toy Dyson stick vacuum, and the Dustbuster was a perfect addition. He uses it constantly. We'll see if he enjoys actually cleaning when he 's older!",
      "rating": 5.0,
      "verified": true,
      "author": "Joni Baloney",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "3 year old approved",
      "text": "My 3 year old got this for his birthday. He is obsessed with cleaning. He absolutely loves this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda C.",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "just like the real one",
      "text": "i have the real one and my toddler was always taking it. the toy looks just like the real one. it is so cute and can take a beating",
      "rating": 5.0,
      "verified": true,
      "author": "Ninny",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "It's the one..as described",
      "text": "So adorable exactly as described and pictured already working straight out the box",
      "rating": 5.0,
      "verified": true,
      "author": "Chan",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "It's ok",
      "text": "It's totally cute I'm fine my grandson wasn't even like interested",
      "rating": 5.0,
      "verified": true,
      "author": "BonitaMe",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Not real enough to impress my one year old.",
      "text": "My one year old was not impressed with this at all. But we bought her the real version and she loves it.",
      "rating": 1.0,
      "verified": true,
      "author": "Candice Bryant ",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Just a super cute toy",
      "text": "This doesn't actually sucj anything up, it's just a toy but my almost 3 year old loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Cam",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Next in line  for the job.",
      "text": "Baby just loves to. Clean like mom and dad.1 yr old.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Doesn't Suck",
      "text": "Great for pretend play. Got this for my 3 year old nephew after watching him struggle to carry a real hand vac. He loves it. He realizes it doesn't have any suction, but enjoys it nonetheless.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonShopperMD",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "cute child toy",
      "text": "My grandson loves to play with my dustbuster and wears out the battery. This will be perfect for him on his birthday! He will be soooo excited!",
      "rating": 5.0,
      "verified": true,
      "author": "David Beach",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "I wanna be a child again, awesome TOY!",
      "text": "It's the perfect fake/toy dust buster except.....the one yr old I purchased for still won't play with it and goes after the real thing. Hahaha. Now I just let him use mine after I clean it of course. Can't win for trying.",
      "rating": 5.0,
      "verified": true,
      "author": "Freeyah Freedom",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Wonderful fake toy that looks real!",
      "text": "My son loves this little dust buster! Looks real too!",
      "rating": 5.0,
      "verified": true,
      "author": "jfetz",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Safe for kids!",
      "text": "My niece love it! Very safe for kids, no electricity or plug!",
      "rating": 5.0,
      "verified": true,
      "author": "Primavera",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "It’s just a toy",
      "text": "This is literally a toy no suction at all only makes noise",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Not Great",
      "text": "Received one that appears to have been used. Batteries came already in it, but it will not turn on. Not impressed. Should have listened to other reviewers with the same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen D.",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Wish it was more realistic",
      "text": "Doesn't do much besides make noise. Not really any suction at all. My 2 year old still liked it but bores him after a few minutes of play.",
      "rating": 3.0,
      "verified": true,
      "author": "Leanne Butler",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great little toy",
      "text": "Durable and life like. Nice replica of actual dust buster.",
      "rating": 5.0,
      "verified": true,
      "author": "J Star",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "For the mini cleaners of the land",
      "text": "Great for the little one that wants to help out while you clean the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Great little pretend va",
      "text": "Little one loves her little vacuum and it’s especially nice that it looks like the real thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Such a cute toy!",
      "text": "Got this for my son who is obsessed with our dust buster/vacuum.. I couldn't find a toy version that I liked until this one.. he absolutely loves it! Perfect size!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina B.",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Great!",
      "text": "I bought this for my nanny baby and he loves it. It was a great toy and not very heavy so he can carry it around. He is only 1. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Melber",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "So fun!",
      "text": "When your little one wants to clean just like mom or dad",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Fun but loud",
      "text": "It’s a little loud and scared my 2 year old granddaughter at first.",
      "rating": 4.0,
      "verified": true,
      "author": "Ouida Bartley",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "VERY EASY TO BREAK..AND LOUD",
      "text": "First of all...kids toys should NOT be this loud..secondly, my 5 year old broke it in less then an hour just \"vacuuming\"",
      "rating": 2.0,
      "verified": true,
      "author": "Ethan Slongwhite",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Just like the real thing!",
      "text": "Perfect for my 16 month old son who loves the real Dustbuster!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Great gift!",
      "text": "My son loves this! He goes around the house trying to vacuum the floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyndsay Bumbalough",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Great for children who love to clean!",
      "text": "My 21-month-old son loves when I clean and vacuum. He has the toy Dyson that he loves and uses while I vacuum. But he is also obsessed with my small handheld vacuum cleaner when I use it. I ordered this toy and it’s adorable! It is very high quality and the small beads swirling inside makes him think he’s really cleaning. I highly recommend this toy for children who like to clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Kainan + Novalee’s Mom",
      "helpful_votes": 6,
      "publication_date": 20191013
    }
  ],
  "product_meta": {
    "title": "BLACK+DECKER Dustbuster Junior Toy Handheld Vacuum Cleaner with Realistic Action & Sound! Pretend Role Play Toy for Kids with Whirling Beads & Batteries Included [Amazon Exclusive]",
    "description": "The BLACK+DECKER line of pre-school toys offers a complete, and authentic role play experience with countless hours of imaginative play for kids ages three and up. Modeled after the modern styling of the iconic dustbuster from BLACK+DECKER, this toy version includes realistic features that both boys and girls will enjoy. Just like the real dustbuster, once you press the button on the handle The action starts! Watch the beads whirl around inside the transparent housing while authentic sounds are played through the speaker. Kids will have fun pretending to clean up little messes around the house just like mom and dad do. With it's simple function and authentic features, the dustbuster Junior is a fun way for kids to enjoy a role play cleaning experience. The dustbuster Junior also includes batteries, so kids can start enjoying its realistic features right away. 2019 is the 40th anniversary of the original dustbuster so it's a great time for kids to get introduced to this iconic item in toy form. Available exclusively on Amazon, This authentic toy version of the BLACK+DECKER dustbuster is a great way for kids to role play cleaning up around their home, Just like they see adults do.",
    "rating": 4.5,
    "feature_bullets": [
      "Authentic role play cleaning fun for kids",
      "Realistic action and sound",
      "Press the button to trigger the sound and make the beads whirl around",
      "Modeled after a modern version of the iconic DUSTBUSTER from BLACK+DECKER",
      "Includes the 3 “AA” batteries required for use",
      "Suggested for kids ages 3+"
    ],
    "specifications": {
      "Product Dimensions": "11 x 4 x 6.5 inches",
      "Item Weight": "15.1 ounces",
      "ASIN": "B07P1GBK93",
      "Item model number": "95129",
      "Manufacturer recommended age": "36 months - 6 years",
      "Best Sellers Rank": "#14,987 in Toys & Games",
      "Customer Reviews": "4.5 out of 5 stars395 ratings4.5 out of 5 stars",
      "Release date": "August 20, 2019",
      "Mfg Recommended age": "36 months - 6 years",
      "Manufacturer": "Jakks"
    },
    "categories": [
      "Dress Up & Pretend Play",
      "Pretend Play",
      "Toys & Games",
      "Housekeeping"
    ],
    "price": 14.99
  }
}