{
  "website_summaries": [
    {
      "verdict": "A large indoor and outdoor evaporative cooler that is designed to work in spaces up to 322 square feet.",
      "pros": [
        "This evaporative cooler features a 7.9-gallon reservoir tank, a timer, and 3 different speed settings",
        "The multipurpose unit can be used as a fan, an air cooler, or an air purifier and the sturdy build helps reduce operating noise"
      ],
      "cons": [
        "The included ice packs only provide about 25 minutes of cooling"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Light and convenient",
      "text": "I got the air conditioner two days after I placed my order. It was lighter than I thought, which is much better than the big heavy ac I used to have. The instructions are clear. I tried it out without water and it worked great, very powerful. With the wheels, I can move it anywhere I need. I really enjoy this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheng'er Dai",
      "helpful_votes": 27,
      "publication_date": 20190531
    },
    {
      "title": "Great for the living room or bedroom",
      "text": "Works great, but there is smell with new equipment. I'm sure it will fade with time. Little tough to roll over carpet or rugs but not a big deal",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190715
    },
    {
      "title": "Components not properly installed",
      "text": "Relay hanging down from top blocking fan rotation. Apparently not completely finished prior to shipping!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190610
    },
    {
      "title": "Works well for us.",
      "text": "These coolers work well. We have 2 in our fellowship hall for church in Hawaii. No AC and it cooks in the hall. This drops the temp and adds a cooler breeze, more so than a regular fan. We make large ice blocks and place them on the top-really helps to drop the temp even more. I wish I could get 4 more.",
      "rating": 5.0,
      "verified": true,
      "author": "Coastiewife",
      "helpful_votes": 3,
      "publication_date": 20190823
    },
    {
      "title": "Good product and responsive customer service",
      "text": "The screws to attach wheels were not included. Contacted seller who replied promptly and took care of the problem. This product has made such a difference in making it more comfortable to get through a very warm summer.",
      "rating": 4.0,
      "verified": true,
      "author": "CMiller",
      "helpful_votes": 5,
      "publication_date": 20190722
    },
    {
      "title": "Stinky",
      "text": "Once you open up the box you will smell a very strong smell that will not go away. It will stink up your entire room! Also, I didn’t think it worked too well with cold air..I returned mostly due to strong smell",
      "rating": 1.0,
      "verified": true,
      "author": "Lada",
      "helpful_votes": 3,
      "publication_date": 20190805
    },
    {
      "title": "It did not even work had to get a refund",
      "text": "i got this product 2 times first time it worked fine for about 4 months then stopped ,the seller was great send me a replacement right a way, that worked for about the same time and stopped.I bought the 2nd unit which did not even start. I got the refund from amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Functional and cools you down",
      "text": "It was easy to figure out and it really cools things down. The fan levels are a little high so would not be good in a small room. I have not tried it outside yet but better then an air conditioner due to it being moist air.",
      "rating": 4.0,
      "verified": true,
      "author": "Terra",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "If looking for an air conditioning unit, this just doesn't fit the billing.",
      "text": "It was supposed to provide cool air. The instructions were less than favorable. The manusl gave instructions to other machines more than the one I had. It provides some cool air, but has a distinct smell to it, and does not cool garage even a little bit.",
      "rating": 2.0,
      "verified": true,
      "author": "Joey Moch",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Outdoor wonder",
      "text": "The product was excellent for my daughter’s backyard party and it worked wonderfully!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Not made in America & remote has mispelled words, in addition to it malfunctioning periodically",
      "text": "This thing create mold if you don't have enough ventilation and light",
      "rating": 2.0,
      "verified": true,
      "author": "Dawson Creek gang",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "DUOLANG 2059 CFM",
      "text": "this is a very good indoor ac unit. very easy to use and very efficient",
      "rating": 5.0,
      "verified": true,
      "author": "United Trading Co.",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Very poor quality",
      "text": "I bought this exact same model. The manual instructions that came with it were useless. And the button controls on the top of the unit never worked correctly. I was only able to get them to work by accident. After daily use for two months it quit working entirely. It now sits in my garage waiting to be picked up and sent to the dump. Worthless. Gotally worthless.",
      "rating": 1.0,
      "verified": false,
      "author": "Nash",
      "helpful_votes": 0,
      "publication_date": 20200302
    }
  ],
  "product_meta": {
    "title": "DUOLANG 2059 CFM Outdoor Indoor Portable Evaporative Cooler Swamp Cooler with Tower Fan & Air Conditioner &Humidifier&Blower for 323 Square Foot, DL-C3500",
    "rating": 4,
    "feature_bullets": [
      "【Best for hot & dry climates】 Where the air humidity is low like Southwestern, Midwest of the United States, outdoor/indoor evaporative cooler brings the temperature down through water evaporation and adds moisture to the dry air.【This product is not for sale in California】",
      "【Multi-function 】 It can be used as a fan ,air conditioner, air humidifier, or air purifier in office, home , garage, backyard, deck, patio/ BBQ areas, factory, restaurant, warehouse. It is recommended to use it in a ventilated room, the effect will be better!",
      "【 Energy Saving & Healthy Air Circulator】 It is cost-effective which is only 120W/H. Cooling areas 322.9 sq. ft with 2059 CFM air flow. It saves your electricity bills and does no harm to the environment. It blows out cold air through water evaporation which feels really refreshing, instead of circulating warm air like a regular fan.",
      "【Safe and convenient】 3 speeds settings ,7.9 gallons water tank, it is not necessary to add water frequently. Cold air can be sprayed continuously for several hours to keep the body cool at night for a good sleep. Easy to move with wheels,Washable dust filter, Low water alarm, Honeycomb cooling pads on 3 sides for better cooling performance .",
      "【Recyclable Ice Crystals and Warranty】 Please put the blue ice crystals in freezer for 3-5 hours before using and leave them in the ice tray. The ice crystals can be recycled and have better cooling performance than ice. We have a one-year warranty return policy. If you have any questions, please contact us in time. So please rest assured to buy!"
    ],
    "specifications": {
      "Product Dimensions": "18.9 x 14.2 x 36.6 inches",
      "Item Weight": "28.6 pounds",
      "Manufacturer": "DUOLANG",
      "ASIN": "B07SQJHK94",
      "Customer Reviews": "4.0 out of 5 stars39 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#481,826 in Home & Kitchen",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Appliances",
      "Air Conditioners",
      "Portable",
      "Heating, Cooling & Air Quality"
    ],
    "price": 285.0
  }
}