{
  "website_summaries": [
    {
      "verdict": "Crafted with excellent stability features, the Mizuno Wave Horizon 4 is specifically designed for runners and athletes who overpronate. It offers a high level of cushioning and support, which are necessary to help minimize the impact of overpronation. It is an everyday running shoe that is also suitable for workouts and casual wear.",
      "pros": [
        "The majority of the users love the comfort that the Mizuno Wave Horizon 4 provides",
        "A lot of runners are happy with the overall quality of the shoe",
        "It is supportive, according to many buyers",
        "Numerous wearers describe the shoe as fast and lightweight",
        "The Wave Horizon 4 offers excellent protection against impact, some purchasers observe",
        "This shoe offers a strong level of orthopedic support, a few consumers claim"
      ],
      "cons": [
        "A couple of testers mention that the Wave Horizon 4 felt a bit tight",
        "The shoe is expensive, said a reviewer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.1,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not the Paradox or Alchemy",
      "text": "I am a seasoned runner and overpronator that requires a motion control/stability shoe. I have been a Mizuno loyalist for nearly 20 years, however I found the Horizon shoe to be extremely uncomfortable. Unlike the Paradox, or Alchemy, I endured excruciating pain with the Horizon on the outer edges/regions of both feet. This occurred with stock Mizuno insoles, Sole Dean Karnaze orthotics, and Vionic Active orthotics over a trial of several weeks. The pain felt as though a heated knife were cutting the outer edges of feet. I would not recommend these shoes or would caution prospective buyers to first try them on in person.",
      "rating": 1.0,
      "verified": true,
      "author": "Cougar6",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Improvement from Wave Inspire",
      "text": "I’ve been on Wave Inspires for the last 10 years. Switched to Horizons this time around. Just got back from my first run and I’d say they feel like a 40% improvement. Love the foam wave. Shoes are lighter, cushier, breathe better, and still seem to support me well as I have some pronation issues. Inspiring to run more, oddly.",
      "rating": 5.0,
      "verified": true,
      "author": "sssssssnake",
      "helpful_votes": 2,
      "publication_date": 20200504
    },
    {
      "title": "Just the right support",
      "text": "When I run my knees like a little support-- and my heels like a fairly cushioned pad. This shoe fits the bill, especially for 10K and longer. Looks great, well built, very rugged, should last plenty of miles. And it doesn't feel like it's got too much support-- just enough. My three runs have been very comfortable-- and my feet have been happy. I do wish it were a little bit lighter in weight and cooler. FYI-- I'm usually a men's 8.5 regular in New Balance and Brooks, but in Mizuno I need to go up half a size to a 9. At 9 regular this shoe fits me perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "H. James Gilmore",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "decent sneaker",
      "text": "I bought Mizuno Wave Paradox sneakers for years and LOVED them. When Mizuno discontinued the Paradox I decided to try the Horizon. It is slightly heavier than the Paradox, and does not seem as well ventilated - my feet feel hotter in this sneaker. It is still a Mizuno, so it fits well, is comfortable, and controls my pronation. Next time I will get the Inspire (and save some money).",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph R. Granto",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Great stability shoe",
      "text": "I used to wear Mizuno Wave Inspire and switched to the Horizon. It’s a lighter shoe with the same stability and support as the inspire. The “wave” style in the horizon is constructed of foam instead of a harder plastic plate. The result is a lighter and more cushioned version of inspire.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Good shoes, comfy",
      "text": "Shoes ran a bit small for me. Good comfort and doesn't have that newer upper that most shoes do which is a bonus for me. They feel more stable. My first go with this brand. I'll update the more I run in them!",
      "rating": 3.0,
      "verified": true,
      "author": "Rockstages",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Makes you want to run!",
      "text": "Excellent shoe all around. Really like the cushion and support it provides, and I have a little bit of a heavy foot. Breathes great. Feels like your floating. I can tell it was made really well and should last me a while. I was a little concerned about the price prior to purchasing but it’s definitely money well spent! It’s a very comfortable shoe. As lame as it may sound, this shoe will make you want to run once it’s on your feet. Great job Mizuno!",
      "rating": 5.0,
      "verified": true,
      "author": "Phenolope",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Great to soften impact",
      "text": "Great stability and they do soften impact. Loving them so far",
      "rating": 5.0,
      "verified": true,
      "author": "SteveB",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Not reliable or made well",
      "text": "Would not recommend. Within 2 Months the sole came unglued from the shoe. Used about 10 times, all treadmill running",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas DeMaria",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Running on clouds",
      "text": "Mizuno is always a luxury run. Lots of cushioning and comfort",
      "rating": 5.0,
      "verified": true,
      "author": "Tomas Valencia",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "too small",
      "text": "I really wanted to like these. The construction and cushion was great but they were noticeably smaller than previous shoes I've had from Mizuno. I'm glad there were free returns.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201110
    },
    {
      "title": "Impressive",
      "text": "The best thing I like about these shoes is that they are light and comfortable, yet supportive at the same time. I expected a very stable running shoe for this price but am impressed with the comfort. My shoe size varies between a 10 1/2 and 11 and these are just a little bit short in the toe area, not enough to not be able to wear them; I will just use thinner socks. So if you’re between sizes like me, I would size up 1/2 of a size.",
      "rating": 5.0,
      "verified": false,
      "author": "LMG",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Super comfortable.  Good looks.",
      "text": "High marks for this running shoe - Mizuno Men’s Wave Horizon 4 Road Running Shoe - Navy Blazer-Silver. This shoe has tons of cushioning, good heel support, and a substantial toe box. A good shoe for heel strikers. The heel feels locked in and at the same time the toes have room to spread. The grids on this shoe are good - not too thick and clunky and not too thin. The color on this shoe is a deep navy with striking turquoise accents in the mesh. The silver in the Navy Blazer-Silver option is just the logo. Fit is to size.",
      "rating": 5.0,
      "verified": false,
      "author": "W. Frazier",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Great shoes, comfortable & stable",
      "text": "I switched to Mizuno from On a few years back and never regretted it. Previously owned 3 pairs of Wave Inspires, the new Horizon 4 doesn’t disappoint. I like the stability and the slightly lower heel. They are light, very comfortable and my custom orthotics fit well (flat feet).",
      "rating": 5.0,
      "verified": false,
      "author": "Jeff O",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great cushioning and softness",
      "text": "The most pronounced feature of this running shoe is called foam Wave. There is a softness, cushioning and stability that is very comfortable and natural for the running. The shoe is lightweight and porous and is advertized as making you feel like you're floating when you run. Pretty accurate description.",
      "rating": 4.0,
      "verified": false,
      "author": "A. Koren",
      "helpful_votes": 0,
      "publication_date": 20200322
    }
  ],
  "product_meta": {
    "title": "Mizuno Men's Wave Horizon 4 Road Running Shoe",
    "description": "Why run when you can float? Xpop pu foam and Mizuno foam Wave deliver a one-of-a-kind cushioning combination that feels like you're floating. Unrivaled stability and a secure fit Keep you fully supported throughout your run. Experience what it's like to float without ever leaving the ground.",
    "rating": 5,
    "feature_bullets": [
      "Pop PU foam and Mizuno foam Wave for the softest feel in a stable shoe",
      "Unrivaled stability and secure fit Keep you fully supported throughout your run",
      "Sole: Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Lightweight engineered mesh for breathability and lightweight feel",
      "Maximum cushioning sockliner",
      "X10 outersole for increased durability"
    ],
    "specifications": {
      "Date First Available": "24 Mar. 2020",
      "Manufacturer": "Mizuno",
      "ASIN": "B086B19VGW",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 249.41
  }
}