{
  "website_summaries": [
    {
      "verdict": "The 6th version of the Nike Downshifter gained the favor of a lot of neutral runners and shoe enthusiasts. They stated that they felt contented and secured when trying it on the pavement. For many of them, the underfoot cushioning felt reliable and consistent, as did the upper cover system. There were some who didn’t enjoy this version, but that didn’t stop the Downshifter 6 from getting such prominence.",
      "pros": [
        "A runner wrote that the mesh material used in the Nike Downshifter 6 had a bit of stretch to it, basically allowing their feet to feel unrestricted even when the material is hugging it",
        "Testers noted that the padding in the upper unit granted the dimensions of their feet with some cushioning during the running sessions",
        "The testers appreciated the inclusion of a molded insole, which gave contoured support to the foot-pad and the arch",
        "The underfoot cushioning was commended by many because of its soft and responsive nature",
        "This shoe didn’t feel heavy and it didn’t feel too lightweight, according to some runners",
        "for them, it had an adequate weight that’s agreeable for many activities",
        "The Downshifter 6 looked visually appealing to a lot of those who tried it",
        "‘Comfortable’ was a word many runners used to describe this shoe, as well as their time wearing it",
        "Based on a number of comments, this shoe was lauded for its affordable price",
        "The flat laces of this model gained recognition because they didn’t unravel easily"
      ],
      "cons": [
        "Some of the testers felt that the Downshifter 6 was a bit large for their feet",
        "The toe box was a bit narrow for a few runners",
        "they wrote that it tended to clump their toes together uncomfortably",
        "The tongue was a bit lumpy and irritating to the skin, a tester complained"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.0,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Left me questioning....",
      "text": "These are cute & good but im honestly not too sure on they’re authenticity. There was no logo on the inside of the shoe at all so that left me with a lot of questions. Other than that they are nice shoes & durable & seem like Nike’s in every other aspect. Idk if i would’ve paid as much for knock offs though 🤷🏻‍♀️",
      "rating": 3.0,
      "verified": true,
      "author": "KILLV KYKY 👽🖖🏽",
      "helpful_votes": 5,
      "publication_date": 20191126
    },
    {
      "title": "Very comfortable",
      "text": "My son has wide feet. It's hard finding him comfortable shoes. He said these shoes were very comfortable. The look slick as well. Good deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Elissa",
      "helpful_votes": 3,
      "publication_date": 20190830
    },
    {
      "title": "Comfortable and perfect fit!",
      "text": "I purchased these for my adult son who is autistic, so comfort is EVERYTHING! He loved them the minute he put them on. There was no \"adjustment\" period where he had to get used to them. We always appreciate that!",
      "rating": 5.0,
      "verified": true,
      "author": "D. E. ",
      "helpful_votes": 2,
      "publication_date": 20200330
    },
    {
      "title": "New Favorite Shoe",
      "text": "Have become my husband's new favorite shoe. Found this style at the store, but they didn't have his size, so found them here on Amazon. He loves the color and the fit, he's begging me to order more pairs for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 3,
      "publication_date": 20191028
    },
    {
      "title": "Nikes yes",
      "text": "My son s feet are constantly growing hes 11yrs old wearing a sz 9 and every thing has to be nike..he loves them",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20200120
    },
    {
      "title": "Too narrow for wide foot",
      "text": "Nice looking shoe. Unfortunately it is too narrow so I will have to return. My husband has a very large and wide foot. I won’t be able to do it until after the holidays so I hope this will be ok.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim L. Archer",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great at first, now not so much (2 months)",
      "text": "I’ve had these shoes just over two months, cared for meticulously. They already “squeak” when I walk (no moisture) and the fabric inside on the top near the toes already ripped on one. They were great for about a month. The second month not so much.",
      "rating": 2.0,
      "verified": true,
      "author": "Edwin R.",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Extremely comfortable, even for inflexible “bad” feet",
      "text": "My husband is a former athlete and has ruined his feet - this particular type of Nike shoe is one of the only ones that is always comfortable for him - the downshifter. He now has 4 or 5 pairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Farina",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great running shoe",
      "text": "Super comfortable and one of the best running shoes I’ve purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Regular Reviewer",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Light weight, Comfortable shoe.",
      "text": "Wife picked them out. Pleasantly surprised with style, fit and comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric S. Potts",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Excellent sneakers",
      "text": "Use them all the time. They look great and are excellent sneakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Good price, good looking",
      "text": "Love the downshifter. Very comfortable. Love the look of them. Unfortunately I only wear to the gym and not to run. I do not think these would make good running shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Nice shoes",
      "text": "Very narrow shoe. They run a little on the smaller side. Looks nice though.",
      "rating": 4.0,
      "verified": true,
      "author": "KristyPalomino",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Good product",
      "text": "Your basic Nike running shoe. Fits as expected. No complaints",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "No Regrets",
      "text": "I bought this for my son for Christmas and he loves it. He says it’s very comfortable and fits well. I’ve been thinking of getting one for myself too. This was a buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Solid workout shoe but low durability",
      "text": "Nice looking and light weight, but unfortunately begins to develop rips and tears pretty quickly typical of low cost Nike shoes",
      "rating": 3.0,
      "verified": true,
      "author": "Pragmatic ",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great gift",
      "text": "They were a gift for my good friend and he liked how they fit and how they looked.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Eccher",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "This one is a winner!",
      "text": "Very nice shoe great fit Awesome color combination. The shoe is light but very well constructed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Perfect fit and very comfy",
      "text": "The shoe fit my guy well he absolutely loved them",
      "rating": 5.0,
      "verified": true,
      "author": "Sept2868",
      "helpful_votes": 0,
      "publication_date": 20200214
    }
  ],
  "product_meta": {
    "title": "Nike Men's Downshifter 9 Running Shoes",
    "description": "The Nike Downshifter 9 with lightweight mesh upper provides breathable comfort. On the heel and in the metatarsal area, the closed mesh provides structured support for sprints. The flex grooves under the foot adapt to the movement, while the continuous foam softly cushions every step.",
    "rating": 1,
    "feature_bullets": [
      "Outer Material: Cotton",
      "Closure: Lace-Up",
      "Shoe Width: Medium"
    ],
    "specifications": {
      "Date First Available": "8 April 2019",
      "Manufacturer": "Nike",
      "ASIN": "B07VM8XM9Z",
      "Item model number": "AQ7481",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Road Running Shoes",
      "Running Shoes",
      "Shoes & Bags"
    ],
    "price": 71.16
  }
}