{
  "website_summaries": [
    {
      "verdict": "Women rave about how well these shoe stretchers work and love the pretty design and affordable price.",
      "pros": [
        "Designed specifically for women's smaller shoes sizes",
        "2-way stretchers",
        "Comes in attractive pink color with heart-shaped hooks",
        "Includes 10 spot relief plugs",
        "Size options from women's 5 1/2 to 10"
      ],
      "cons": [
        "Not many size options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Where Are The Directions!!",
      "text": "It would have been better to have directions in putting these together for first time owners of shoe stretchers. Even so they were easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Weddleton",
      "helpful_votes": 16,
      "publication_date": 20190702
    },
    {
      "title": "XYH 2 in one Shoe stretcher works great",
      "text": "I bought this set to stretch out two new pairs of flats. After watching a video how to use, the stretcher worked great. I 1st stretched the length. The shoe was a size 10 and I maxed out the stretcher. Left in for 5 days. Tried the shoe on & stretched out the toe area for 2 days. Didn’t use any stretching spray. The shoes now fit perfect. Just broken in. Careful not to over stretch. Easy enough to check the fit every 24 hrs. Next are my heeled shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 15,
      "publication_date": 20190709
    },
    {
      "title": "Works",
      "text": "Best. Took me a few days I was not using them correctly. Read the direction it helps. I bought a pair of shoes that felt snug in the store. I thought they would stretch a little after wearing. They did not stretch at all. Used the stretcher and it is working. This is a rather firm shoe and I have to redo it a couple times and I left the stretcher for several days. I know it seem like a lot but I am saving a wonderful pair of shoes. I love the strecthers. But you must have patience.",
      "rating": 5.0,
      "verified": true,
      "author": "eyeofthebeholder",
      "helpful_votes": 11,
      "publication_date": 20190930
    },
    {
      "title": "I’m so excited",
      "text": "I’m so thrilled with this product. I sprained my foot months ago and felt like I’d never wear cute shots again. I tried it first on a pair of heels and then I danced around my dressing room in them. This photo shows a new pair of flats. I have a sister pare I did before these and they feel amazing. I used the black plastic extension bump wear my sprain hurts and it works magic.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Hodgman",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "It helps to apply some heat to your shoes with it.",
      "text": "This worked great for stretching my leather slip on shoes. It was real tight on the top of my foot. So I used it, put it in my front load dryer with shoe platform, turned it on high for 15 minutes, and it stretched nicely. Or I guess you could use a hair dryer. But my dryer worked perfectly for this.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue R.",
      "helpful_votes": 10,
      "publication_date": 20200506
    },
    {
      "title": "Does The Job",
      "text": "I am very happy with the XYH 2 in 1 Shoe Stretcher Women,Upgrade 2nd generation..... It is easy to use and does a great job stretching shoes and my ankle boots.It is good quality and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Christi",
      "helpful_votes": 10,
      "publication_date": 20191009
    },
    {
      "title": "Great Products",
      "text": "Product is very well made and worth much more than I paid. It is easy to use and works very well on flat shoes for widening the area near the ball of my foot. It will fit any lower boots or shoes. It did a great job in loosening up the toes of my sneakers.It comes with plugs which can be used to form slight pockets which can ease pressure on any tight spots. One can use no plug or any number.The shoe stretchers are also super-sturdy.I think I'll have this for many, many years.I recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Becker",
      "helpful_votes": 10,
      "publication_date": 20191122
    },
    {
      "title": "Heels or Flats",
      "text": "I like that this shoe stretcher kit can be used for either heels or flats. It was well packed. The instructions are on a little business card and could be easier to read if provided in another way. I can’t speak to how it works because I haven’t used it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia P.",
      "helpful_votes": 10,
      "publication_date": 20190710
    },
    {
      "title": "No instructions.",
      "text": "OK so it seems like all the parts are here, I wouldn't know because there are no instructions or manual so I'm gonna have to figure it out how to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Ivette Rosas",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "nice shoe stretcher",
      "text": "I very like this product,It has been amazing for me, the front of the my heels were just a little too tight on my feet, I was able to stretch them out just enough for it to be comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Z",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Great Value",
      "text": "Great stretcher, just as good as the wood ones, and even better! Super easy to use. I accidentally stretched too far and it clicked out of sync...the Wood ones would’ve pretty much been toast, but I was able to easily fix the and now they work perfect again!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Tucker",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "No assembly instructions",
      "text": "There is NO instructions with this device and it is not terribly obvious how to put it together to make it work properly.",
      "rating": 2.0,
      "verified": true,
      "author": "Trusagi",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Works great but Needs instructions",
      "text": "Works great; however, this absolutely needs instructions on how to assemble the product itself. It also should come with a bag of some sort to store everything in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "It's okay",
      "text": "The product is okay. What is the thing on the top for? I don't understand it.",
      "rating": 3.0,
      "verified": true,
      "author": "Miss McKenzie",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Not what I expected.",
      "text": "Kind of disappointed. Too fragile and expensive for the light construction it has.",
      "rating": 2.0,
      "verified": true,
      "author": "Cliente de Amazon",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Easy to use, and it works",
      "text": "Easy to set up and worked like a charm, very satisfied with my purchase, thought I was going to have to try to sell my shoes as I couldn’t return them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess A.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "No instructions for assembly, but fairly easy to figure out.",
      "text": "This product works well but there were no instructions for assembly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Love this",
      "text": "Best 20 bucks I ever spent. Does exactly what it is supposed to. Comes with extra parts. Very satisfied with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "angeleyes",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "NO INSTRUCTIONS AND MISSING PIECES",
      "text": "Does not come with instructions and pieces are missing ... you think I’m a magician and I can magically put this together without instructions smh ❗️❗️",
      "rating": 1.0,
      "verified": true,
      "author": "Syndi Gettys",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "BUYER BEWARE",
      "text": "These so called shoe stretchers arrived with *no* product box, assembly/ use instructions, or packing list!",
      "rating": 1.0,
      "verified": true,
      "author": "Sara Aldys Bossen",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Should come with instruction manual",
      "text": "It should come with instruction manual! Very confusing to use.",
      "rating": 3.0,
      "verified": true,
      "author": "Vicki Lujan",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Lacking in the details",
      "text": "Had no dust bag and no instructions. Had to guess what went where and read reviews and look at pictures to use them.",
      "rating": 3.0,
      "verified": true,
      "author": "Jill Godzilevsky",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Real deal",
      "text": "Love it, works great on all shoes. I don't really like the add on sides because they don't fit heels as good as flats but it works",
      "rating": 4.0,
      "verified": true,
      "author": "Cassie S.",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Missing items",
      "text": "Didn’t include all of the pieces. The package was supposed to have 4 included it only came with 3.",
      "rating": 1.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Ease of use",
      "text": "Great product used to stretch my daughters high heal shoes worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Very good",
      "text": "Very very good product!!! Saved a lot of my shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Anderson Studebaker",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Easy to assemble!",
      "text": "Easy to assemble, need directions for how to use on shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Damien",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Terrible Product",
      "text": "This product is awful ... it arrives with at least 10 pieces and no directions. I didn’t order to try to guess how to put it together... it gets Zero stars... None",
      "rating": 1.0,
      "verified": true,
      "author": "Debra Freeman",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "INSTRUCTIONS ARE ESSENTIAL",
      "text": "I'm dissatisfied with this product because I dont know how to use it. There are NO instructions. I plan to use it for my shoes but right now the box is sitting there since I have no clue on how to use this product properly or how to assemble parts for this product to be useful.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruby G.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Needs to come with instructions.",
      "text": "There are no instructions as to how to assemble this so I may never get to use them . Very frustrated. Many little bags of components!",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne Canuck",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "No instructions! Big disappointment.",
      "text": "This item doesn’t come with any instructions and at least 20 parts. As someone who has never used shoe stretchers, I have no idea how to use this without instructions. It’s a shame I have to return it because I will find other shoe stretchers to buy, but ones WITH instructions.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelby M Via",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Do not waste your money!",
      "text": "Horrible! Does not fit any shoe! Not as described. Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "CaliGirl",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "NO INSTRUCTIONS & NO TOOLS TO ASSEMBLE!👎🏽",
      "text": "Wanted to use these but NO INSTRUCTIONS OR TOOLS INCLUDED! Adversary’s instructions would accompany these pink shoehorns. Misleading!",
      "rating": 1.0,
      "verified": true,
      "author": "tdmd23",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Disappointing!",
      "text": "Completely confusing! A jumble of plastic parts with absolutely no instructions. This is no way yo deliver a. Item. I will return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Chanaral",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "No instructions",
      "text": "There weren't any instructions on how to put it together.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacqueline Ramsey",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "No Instructions",
      "text": "It would be nice if there were some instructions. I don’t know how to put it together",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Sainer",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Convenient, user-friendly.",
      "text": "Easy to put together. Easy to use. Stretches shoes as advertised. Worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Brown",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "trying to find out if they fit in dansko clogs",
      "text": "I am interested in buying this product , but I am trying to find out if it works on danskos , does anyone know ? dansko xp",
      "rating": 5.0,
      "verified": false,
      "author": "Lindasue",
      "helpful_votes": 0,
      "publication_date": 20200229
    }
  ],
  "product_meta": {
    "title": "XYH Shoe Stretcher Upgrade 2nd Generation Shoe Stretchers Adjustment Width and Length for Women.",
    "description": "PRODUCT DETAILS\n * Package Dimensions :13.8 x 5.3 x 4.9 inches; 3.2 Pounds\n * Department :Womens\n * Date First Available :May 10, 2019\n * ASIN :B07RP6CJYZ\n\n * Amazon Best Sellers Rank: #50,172 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement)  *  #94 inShoe & Boot Trees \n    *  #109 inSafety Footwear \n   \n   \n\n * Customer Reviews:3.9 out of 5 stars126 ratings",
    "rating": 3.9,
    "feature_bullets": [
      "[Professional Design]: Stretch your Shoes into the Perfect Fit for your foot with 2 Pair shoe stretcher for women, Bringing better benefits and health to women. include shoe stretcher women size 5-10, high heel shoe stretcher women size 4-11. (Please watch the video for installation.)",
      "[Save space and Money]: 2 in 1 shoe stretcher buying 2 products is equivalent to buying 2 products, don't need to spend more money and time to buy 2 sets products, And also save space for the family definitely good value for money!",
      "[Premium Materials]: Made from tough ABS polyurethane plastic and premium steel shaft, the shoe stretchers are extremely solid. Different from the flimsy wood shoe stretchers, XYH shoe stretcher won’t crack, chip or break. it has a long service time. Smooth surface is not hurt shoes, Non-toxic, without smell, a more environmentally-friendly choice.",
      "[Universal Usage]: Don't work in boots Can be used on flats, pumps, wedges, loafers, oxfords, pointed toe, slippers, sneakers, high heel shoe and so on. (DO NOT overstretch your shoes!).",
      "[Warranty and Best Gifts]: We provide 90 day warranty time, if you have any question please contact us, We will find problems and solve problems in time. Shoe expanders are an ideal gift Best choice for your family or friends for Birthday, Thanksgiving Day, Christmas Day, Mother Day."
    ],
    "specifications": {
      "Package Dimensions": "13.8 x 5.3 x 4.9 inches; 3.2 Pounds",
      "Department": "Womens",
      "Date First Available": "May 10, 2019",
      "ASIN": "B07RP6CJYZ"
    },
    "categories": [
      "Personal Protective Equipment",
      "Clothing, Shoes & Jewelry",
      "Tools & Home Improvement",
      "Safety Footwear",
      "Safety & Security"
    ],
    "price": 29.98
  }
}