{
  "website_summaries": [
    {
      "verdict": "DC Shoes breaks the mold, slashes down chunks of weight from its earlier designs, and comes up with the low-top DC Anvil TX, a textile version in a completely toned down appearance. The modified look has a narrow fit which can cause discomfort for broad footed wearers if not obtained at a bigger size. The use of a breathable textile on the upper keeps the load to barely minimal. Its vulcanized sole composition accommodates the use of inserts to achieve a more cushioned feeling inside the shoe.",
      "pros": [
        "Many users mentioned that the low-top DC Anvil TX is supportive even after long hours walking on it",
        "One reviewer who used this sneaker for 9-hour job shifts emphasized that it kept his feet comfortable and well ventilated",
        "A good number of users said it has broken in nicely after about a week of use",
        "A couple of reviewers vouched that this sneaker lasted them for a year",
        "Several consumers marveled at the various colors and styles available",
        "The canvas upper offers a comfortable covering for the feet projecting a glove-like fit, as stated by many reviewers",
        "The elastic band under the tongue does not put pressure on the instep, described by a sneaker user",
        "It felt roomy in the toe box as mentioned by a few buyers",
        "A loyal DC fan bought three pairs of the DC Anvil TX as its design is appropriate for many outfits",
        "A large sum of reviewers said this is their favorite sneaker which can be used for work and leisure activities",
        "Few reviewers were pleased as it allowed them to replace the insole with orthotics",
        "Several reviewers mentioned that the Pill Pattern rubber outsole is moderately grippy"
      ],
      "cons": [
        "Standard DC shoes have a wide width, but this shoe felt a bit narrow and tight according to several users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.9,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "I'm very disappointed in these DC shoes. They seems to be knock offs and not real DC!!",
      "text": "I bought these about 4 months ago and they stated to fall apart shortly after. I have bought several DC shoes and bought theses same DC shoes from another place about 4yrs ago witch lasted a couple years to where these didn't even last 4 months. DC shoes should last much longer then they did for the price I paid. Very disappointed..",
      "rating": 1.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 7,
      "publication_date": 20190919
    },
    {
      "title": "Nice looking, great quality!",
      "text": "NICE looking shoes! Love them and when I wear them, All the ladies want my phone number! No, not really, but the shoes do look good. Excellent quality. The fit is very close to being \"true to size\". If anything, just a touch small vs my Vans or Converse sneakers. I wear an 11 in those others, I am doing ok with these DC in the 11 I ordered, but next time will order 11.5. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 7,
      "publication_date": 20180726
    },
    {
      "title": "Cool shoes",
      "text": "I love the look and feel of these shoes. BUT... they do run slightly small. I wear a 9.5 in most shoe brands but these were slightly snug. After a few weeks they did break in a bit and are more comfortable but still feel a little tight. They look similar to Vans low-tops, but better in my opinion. Also, i like to wear bootcut jeans and some shoes allow the pants to hit the ground in the back. These shoes protrude slightly in the tongue/lace area which pushes the paint opening slightly forward and keeps my pants from touching the ground at the back of my shoe. Buy some! But consider getting them a 1/2 size larger.",
      "rating": 4.0,
      "verified": true,
      "author": "zed",
      "helpful_votes": 4,
      "publication_date": 20180110
    },
    {
      "title": "More arch support than other dc shoes",
      "text": "Well i am used to dc shoes being fairly flat bottomed. I have a messed up tendon in my right foot which leaves a lump in my arch (only medical solution is to cut it out and lose mobility) I need shoes with little or no arch support to avoid pain of pressure on this point. DC shoes have always been great but these feel like there is a golf ball in the arch. They look great and fit great otherwise and for most everyone else they would be fine I am sure.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20190721
    },
    {
      "title": "These are unwearable",
      "text": "They’re good looking shoes but on the right shoe there is a very uncomfortable lump in the center of the ball of my foot. I’ve purchased multiple shoe inserts and it’s so bad that I can feel it through all of them. I came to see if I can talk to the seller because these shoes are unwearable but I can’t even do that so 1* review it is as I have a pair of blatantly unwearable shoes with no resolution. Shame as I’ve been a big supporter of DC shoes for easily 15 years now but likely won’t buy them again",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Candelario",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great for the price",
      "text": "So it has been less than a week I believe so far but they have held up great so far. I can usually only enjoy skater shoes for some reason, but these are great. I've already taken 2-3 hour walks in these a couple times and they're really comfy to walk around in. Edit: So it's been a few months and I still really like these shoes. I still go for long walks in them. These do not feel like \"cheap\" shoes. In fact they are better than a lot of more expensive shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jahonay",
      "helpful_votes": 8,
      "publication_date": 20160221
    },
    {
      "title": "Nice shoe, tight as heck",
      "text": "I dont have duck feet. I dont even have big feet... I fit a 8.5 but I buy 9s. This shoe was so tight and crushing my mid-foot that I felt the crushing feeling an hour taking my feet out when they were only in the shoe for 5 minutes. Nice looking shoe though, shame it was so darn tight and not labeled as 'for tiny women feet'.",
      "rating": 2.0,
      "verified": true,
      "author": "IncredibleHat",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Good quality shoe!",
      "text": "It's a good thing I bought these for my 7th grader with a growing foot! He wears a Vans size 8, so I thought I'd get an 8.5, and they are quite big for him. I think it's because they are wide. I was really hoping they would be, because my son has a wide foot. He says they're comfortable though, and he'll be in them in no time. The quality of these shoes are great! For the price, you get a very sturdy, well made shoe. DC is a company that my two sons have been wearing for years, and they never have lessened in quality over the years.",
      "rating": 5.0,
      "verified": true,
      "author": "La Niece DeBois",
      "helpful_votes": 2,
      "publication_date": 20180115
    },
    {
      "title": "Excellent daily wear sneaks",
      "text": "These shoes are excellent for daily wear. I'm not skating them because they look too nice. I'll tear apart my Vans Chukka Lows for that. -Great price -Classic look -Lightweight -Size 12 is a good width for my slightly wide feet -Break in quickly Update: I thought the ridiculous arch support would flatten out after awhile but it hasn't at all. I don't have flat feet but I'm also not a ballerina. Negative: -Too much arch support",
      "rating": 4.0,
      "verified": true,
      "author": "mkultra",
      "helpful_votes": 6,
      "publication_date": 20160318
    },
    {
      "title": "Love them!",
      "text": "Really happy with this purchase. For someone who has big feet this was Right on point when it came to fitting right. The color was amazing and felt great to walk around in. The only down side to me was the shoe laces were small and I just have to buy some new ones for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Bernal",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Not exactly what I expected",
      "text": "I tried these shoes on at Shoe Carnival and fell in love. Come to find they were almost $15 less from Amazon, so I made sure that I was buying the exact same item. When they arrived, they look and fit basically the same. However, the ones I found in-store were made of actual canvas material, whereas the ones from Amazon are more of a soft brushed fabric. I hope they hold up the same as the canvas DCs that I love. Also, don't be confused by the \"leather\" in the description... these shoes are fabric and rubber.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 3,
      "publication_date": 20160928
    },
    {
      "title": "Good for short skate trips, not so good for long work days.",
      "text": "Good shoes. Not great for my use case, but once I added insoles with decent arch support they quickly became a favorite for commuting. I bought them because I don't like wearing flashy sneakers or running shoes at work, but I spend too much time on my feet to wear dress shoes. These were nice because they're a subtle, all black, comfy shoe. They started off ok, but the inside went soft after two weeks of heavy use (I walk 3-5 miles/day). Got a pair of insoles though, and after that they held together for like 3-4 months, which isn't bad for me. Good grip on a board though, just not what I wanted them for.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason Nichols",
      "helpful_votes": 3,
      "publication_date": 20160609
    },
    {
      "title": "these don't last",
      "text": "I've had these for about 2 months and use them moderately (about 30 minutes a day). They already have a hole in the sole, it looks like the sole is extremely thin and wears down very quickly. I will not be buying this brand again and would not recommend them. Pay more and get a better quality shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "AMG",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Good sturdy shoe!",
      "text": "As far as breathing they don't do so well with keeping my feel cool like most other DCs but my feet arent in a pool of seeat either. But I must say I'm glad that they run big because having a size 14 foot and then being able to buy a shoe that isn't a basketball shoe is great!",
      "rating": 4.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "All the right parts assembled by the wrong foreigners.",
      "text": "I'm impressed! A 20 something that actively burns the hide off car tires hasn't had a blowout yet. Maybe manufacturing does make progress I'll add more in 6 months after the visit to the podiatrist. He likes them, wears them constantly, and is still tying the laces. It's a good thing, so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Sally June",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "DC Men's Anvil TX Skate Shoe, Navy/Gum, 10 M US",
      "text": "I bought these to wear as my daily shoes and as they break in they are starting to become comfortable. I like that there are less patches of material and design on these hopefully meaning less places for stitching and seams to fail. I like my shoes on the snug side and normally wear 10 to 10.5, I got these in 10 and they are almost perfect after wearing them for a couple weeks and getting them broken in. The right shoe was a little tight around pinky toe but that has started to relax finally. The provided laces are just barely long enough if you plan on lacing up to the top hole.",
      "rating": 4.0,
      "verified": true,
      "author": "goodymon22",
      "helpful_votes": 3,
      "publication_date": 20161111
    },
    {
      "title": "DC Shoes",
      "text": "These are fantastic! I'm an 11 1/2 - 12 depending on the shoe. Got these in a 12. From day 1 the heel felt very comfortable. The toe/ball of my foot area started off a little tight but I figured it would loosen up after a few days because there seems to be a good amount of cushion down there. It did loosen up and I've been wearing them everyday for a couple weeks now. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike H",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Great looking and comfortable",
      "text": "These are great shoes. I've purchased two pairs in different colors. For me, shoes not only have to feel comfortable but they have to look nice with what you typically wear, be it jeans, shorts, shirts, etc. These fit the bill and can work with a variety of different socks. Once my current pair starts getting old and ratty, I may just buy another pair of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Windham",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Odd coloring and skinny for DCs",
      "text": "Heads up. The color is more of a faded sea-form green with a khaki inseam panel. They look weird with khaki or gray pants. They have a pretty skinny fit for DCs. I prefer a wider skate style shoe and these just feel like chucks.",
      "rating": 2.0,
      "verified": true,
      "author": "DG",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Nice but not for wide feet",
      "text": "Nice quality shoes but I had to return them because they aren’t wide enough for my 13yo’s feet. His feet are wide, but not to the extreme. We tried both a men’s 11 - his normal size - and a men’s 12, but both were too narrow and he didn’t think they’d comfortably stretch enough based on his experience with wearing other similar styles in other brands.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Way too small!!!!",
      "text": "I bought these shoes for vacation. Tried them on as I was packing to leave and they were way too small! I bought them a size larger in case I wanted to add insoles and they are very small even without adding the extra insoles. Now I'm past my return date and I have a tight pair of shoes I will probably never wear.",
      "rating": 2.0,
      "verified": true,
      "author": "Brett S.",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Better than DC website to order from",
      "text": "Exactly as described and easier to return if needed than shopping directly through the brand name website. Amazon had stock of some styles and sizes that the brand name website was sold out of.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Sticky sole and who doesn't like a sticky sole?",
      "text": "I wear a 9... ordered a 9 1/2 and too tight. Sent them back and ordered a 10 (!). GREAT FIT! A nice cushioned bed but not too much. Sticky sole and who doesn't like a sticky sole? All the seams were spot on and although the heal seemed tall, I don't even feel it. I'd buy again if/when these wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "BeemerPilot",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Narrower than expected!",
      "text": "It isn't a very wide shoe so if you have narrow feet, you would be Great with this shoe. I have wide feet but they still fit me great with thin socks... Amazing color... Comfortable...",
      "rating": 5.0,
      "verified": true,
      "author": "Arthurton George",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Husband approved",
      "text": "I purchased these shoes for my husband who is picky about his clothing, but in a good way as he likes quality and these shoes passed the test. They have felt-like deep black areas that will keep their color nicely and look great with shorts or pants.",
      "rating": 5.0,
      "verified": true,
      "author": "KAT VON",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Hubby loves",
      "text": "Bought these for my husband, he loved his old DCs but they were on their last legs after about 6 years of constant wear. He loves these new ones. However they are always running out of the large sizes here and I wish they would consider wide sizes!",
      "rating": 5.0,
      "verified": true,
      "author": "R. McCartney",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Not comfy",
      "text": "Bought these for my husband and he said they're not the most comfortable shoe to wear for long periods of time but, feel like they will last him awhile.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber S.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "\" UNABLE TO WEAR COMFORTABLE \"",
      "text": "This shoe looks great, but would not accommodate my meta tarsal , too tight across the bridge of my foot, I even order a 1/2 size larger, no help, so unless DC will come with wider widths ? There will be no purchase, Thanks.",
      "rating": 1.0,
      "verified": true,
      "author": "TOPENDRIDER",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Wears out quickly",
      "text": "Like DC shoes and have worn them for years, but these shoes got holes in the top fabric from regular use rather quickly. Cheap materials maybe? A bit disappointing...",
      "rating": 3.0,
      "verified": true,
      "author": "Dk",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Great shoes!",
      "text": "Love this shoe! I bought the size 6.5 first, but it was too tight and amazon was kind enough to exchange it for a 7. Now, the fit is perfect! Very pleased with these sneakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Petite Pomme De Terre",
      "helpful_votes": 2,
      "publication_date": 20180317
    },
    {
      "title": "Hopefully once I wear them in a little they'll fit better, and I may update this review later if ...",
      "text": "Not only are these too long, they are also too narrow, resulting in a very odd, ill fitting, uncomfortable shoe. Hopefully once I wear them in a little they'll fit better, and I may update this review later if this is the case, however as of now these shoes are a solid 2 out of 5. EDIT 10/17/15: Been wearing these off and on for a couple days, and the left seems much better, while the right... wow. I can't wear this shoe for longer than ~10 minutes before my toes start to go numb from the narrowness.",
      "rating": 2.0,
      "verified": true,
      "author": "ATC",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Fake?",
      "text": "They look right but they feel oddly hard and plastic like. I have worn DCs for about 15ish years and I usually love them. These just feel fake. Super uncomfortable. 2nd pair I've bought from amazon and both have been very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Anna Moses-Bentley",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Look nice but way too small and narrow",
      "text": "Shoes look nice but come way too small and narrow. Do yourself a favor and order atleast 1 full size larger... maybe even 2 sizes larger. In general the shoes are very narrow as well.",
      "rating": 2.0,
      "verified": true,
      "author": "SuperBuyer",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Shoes were actually like a mint green color",
      "text": "Got the wrong color shoe in a box labeled taupe. Shoes were actually like a mint green color. Ordered a replacement thinking the box was mislabeled but the 2nd pair was also green. Move along...these are not the shoes you are looking for. Stock photo vs what I actually got.",
      "rating": 1.0,
      "verified": true,
      "author": "Aimee",
      "helpful_votes": 2,
      "publication_date": 20180122
    },
    {
      "title": "They fit perfectly and they're very comfortable for him",
      "text": "I got these for my husband and he loves them. They fit perfectly and they're very comfortable for him. He's calling them his \"nice\" shoes. Cracks me up since they're just sneakers, but understandable since they are very nice for sneakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Lingo",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "I wish I could still find this shoe",
      "text": "I love these shoes, they were perfect for me for years. I have owned 4 pairs and now that my last pair is dying, I can not find any more. Guess I will have to find a new pair of shoes to latch onto. Should have bought ten pairs when I realized I had the perfect shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "If you like DC's you'll like these",
      "text": "I wear a size 12 US mens shoe. I have very wide feet, and am restricted to wearing skater shoes primarily as they are the widest cut. I typically fit DC's like a glove, the last pair i had was a rasta color medium rise style. These are a tad tight around the toe box, but I am wearing them in and I think once I get some mileage on them they'll be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Fit is off",
      "text": "I hate to give products a one star, but I wish I had read the reviews before purchasing. The shoe looks great, but like a bunch of other reviewers have noted, the fit is too narrow. Going to have to return, because they’re very uncomfortable, especially on my right foot. I wear a size 14, so unfortunately they don’t have any larger sizes for me to try out.",
      "rating": 1.0,
      "verified": true,
      "author": "Greggers",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Pretty Neat",
      "text": "Simple yet stylish. Feels pretty good to walk in. I'll occasionally see a few screw ups in the assembly of the shoe, but their barely noticeable.This is more a personal taste, but I feel they don't need as many DC logos on it as they have. outside material is't exactly uncomfortable, but I wouldn't say it's uncomfortable either, so don't buy these with rigorous activity in mind.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "More canvas like than expected-less soft shoe material",
      "text": "These were a little too stiff and the material seems too “plastic” like, almost canvas. Maybe for durability? I was expecting a softer feel and more flexible movement.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa P",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Buy buy buy!",
      "text": "Got these for my husband and they are his favorite pair.! Fits perfect super comfortable real DCs. Can’t wait for seller to restock to order again. Price is cheaper than anywhere else!",
      "rating": 5.0,
      "verified": true,
      "author": "Breeanna Eicher",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "DC shoes.",
      "text": "Left foot fits fine, right foot real tight, These DC shoes either fit right or they don't, I have had this problem with this brand even though I do like many of the shoes they do make and have a few pairs, it becomes a fitting issues until I find the right fit in this brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Space Girl",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Great casual shoes.",
      "text": "Fast shipping, true to size. Comfortable. Affordable as well. My husband wanted some Casual shoes since his other pair had finally ran their course, and he didn’t want to spend and arm and a leg. He really liked these.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Trash",
      "text": "Don't buy these if you actually skate. They will be shredded after a few kickflips",
      "rating": 1.0,
      "verified": true,
      "author": "K Pierce",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "I did like the style and the color of these shoes but ...",
      "text": "I did like the style and the color of these shoes but they where way too big and I am a size 10 and these where at least a size 10 and a half maybe bigger. so my advice if your a 10 like me order the 9.5. I wear alot of DC shoes and these where disappointing to me because of the Big size Difference.",
      "rating": 3.0,
      "verified": true,
      "author": "wwefan1981",
      "helpful_votes": 2,
      "publication_date": 20160426
    },
    {
      "title": "Good shoe if you don't plan on skating",
      "text": "I'm kind of torn on this review. As just a normal shoe, honestly it's pretty great. Fits perfectly, really comfortable. As a skate shoe, you really do get what you pay for. Lasted me 5 days before the side of the shoe had 2 massive holes in it, and the laces wore down and snapped. If you're not doing flip tricks it might last you longer, but the material just doesn't hold up.",
      "rating": 3.0,
      "verified": true,
      "author": "jack",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "they are cute",
      "text": "i like them and they go with every outfit, but the get dirty quick. if your like me then note, im cleaning them 3x a day",
      "rating": 3.0,
      "verified": true,
      "author": "Bryan Deemer",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "The shoes are excellent, they are just a bit snug",
      "text": "The shoes are excellent, they are just a bit snug, a half size bigger would have been better, but thats Internet shoe shopping for you. But the shoes themselves are excellent and I can still wear them so I'll be good once they've broken in more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Love these!",
      "text": "Fit perfectly and very comfortable. I use them for both walking and skateboarding.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole P",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Looks good",
      "text": "Perfect fit as size 7.5 I love the look an feel! Not the comfiest but will do for a few outings",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua G.",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Classic style and great look (beige) for all around wear",
      "text": "I love DC shoes and find them really comfortable for my feet. Now that I'm a little older and a father, my wife has to approve my footwear. When I mentioned I wanted a pair of DCs she originally did not approve, but when she saw the beige DC Anvil TX shoes she approved. Amazon's price was awesome and the shoes arrived on time, well packaged. Love the fit and feel of these - remind me of DC Mantecas.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "As expected. Would buy again",
      "text": "Not sure why but after a while the white souls get really dark. Only in specific spots. Im not sure if its from the pedals from my car or something else, as i live in state with near 0 rain so mud and such is never an issue. To clean it i have to spend 20 or so minutes every month with a sponge and soap and buff out the dark spots. Other than that little part great shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Andriy",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Unusual tear",
      "text": "The top, or canvas part of the shoe is starting to tear in a way that hasn't happened with any other pair of shoes that I've owned. From the picture you can see the bottom is still in good condition so it's not like I've used these shoes an awful lot.",
      "rating": 2.0,
      "verified": true,
      "author": "andy",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Good style",
      "text": "Style is great. Not much comfort but I bought them more for style anyways and at a discount of 35 bucks so I'm very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "bennylog",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Great looking DC shoes!",
      "text": "Love these shoes so much that I rarely wear them because I don't want to get the dirty lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Daneyon B.",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Shoes are way to small",
      "text": "Shoes are way to small my other pair of dc's are 11 1/2 and all the reveiws said to buy a half size bigger so i got 12s still way to small ordered a size 13's we'll see how those fit. Other than the size shoes look great.",
      "rating": 3.0,
      "verified": true,
      "author": "Shane D",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Coolness",
      "text": "These are pretty comfortable and didn't require a break-in period. They seem pretty durable. The two-tone color has an almost-retro look about it. Pretty slick shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "zed",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "I've only been skating with them for a few days and I don't think they will last as long as a suade shoe but they work pretty we",
      "text": "I know I said they are small but they fit me perfectly. usually DC shoes are slightly wider in the toes but these are perfectly snug. so they were slightly smaller than expected. not a problem. I've only been skating with them for a few days and I don't think they will last as long as a suade shoe but they work pretty well for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Erik Johnson",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Perfect fit",
      "text": "Shoe fits exactly like I expected. Great quality great price.",
      "rating": 5.0,
      "verified": true,
      "author": "PILAR ERDMANN",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Beware used product !!",
      "text": "Beware!!! I received used shoes. Dirt n treads obviously worn before outside",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Miller",
      "helpful_votes": 2,
      "publication_date": 20180531
    },
    {
      "title": "Nice buy",
      "text": "Great looking shoes! A little snug but fit for the most part.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Better than vans.",
      "text": "Son loves this shoes. He skates a lot and got a small hole, which isn't as bad as vans which would've been shredded by now.",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Nice inexpensive shoe for bmx/mtb",
      "text": "Nice inexpensive shoe for bmx/mtb. Laces up tight and sole is grippy. You do need to remove the \"sole fabric\" by either rubbing your foot on concrete or sanding it. After that nice and grippy.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Jokisch",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "My favorite pair of shoes for wide feet",
      "text": "I wear a 14 wide in most shoes. These fit me perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Not for wide feet",
      "text": "i usually get DC and they fit my feet fine. these ones were a bit tight and couldn't wear them. otherwise its a great shoe",
      "rating": 3.0,
      "verified": true,
      "author": "cnaber",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Comfortable Shoe",
      "text": "I bought these shoes for my boyfriend for Christmas. I really like the style and how they look on him. He says that they are really comfortable and he likes how they look as well. We work together and he's in a warehouse all day and standing, and he says they are very comfortable for work.",
      "rating": 5.0,
      "verified": true,
      "author": "Lina Navarro",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "I want more.",
      "text": "Fell apart faster than I'd like. However, I have worn them every day for 7 months. Still my favorite color combo and design",
      "rating": 4.0,
      "verified": true,
      "author": "Scotty V.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Four Stars",
      "text": "These shoes fit well and are comfortable. I plan on wearing them when I ride my bike. :update so the white rubber started separating from the sole after 7 months. I didn't think I was too hard on these I just ride my bike with them.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph Watson",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "they fit.",
      "text": "good shoes, bought them to get dirty and destroyed at work so its hard to comment on how well they hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Lacking quality",
      "text": "I bought these in July, and not even 3 months later, I have a hole in the heel that exposes the sole. I wear them daily, but I have a desk job, so there is not a lot of heavy wear and tear. Couldn't imagine them holding up if someone was using them to skate.",
      "rating": 2.0,
      "verified": true,
      "author": "AzRockDad",
      "helpful_votes": 2,
      "publication_date": 20151009
    },
    {
      "title": "A little tight vs other brands",
      "text": "I normally wear a 12, got a 12... probably should have gotten a 13.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Ordinary pair of sneakers.",
      "text": "It's an ok pair of tennis shoes or skater shoes. Nothing to say bad but nothing really great or exceptional. Just ordinary sneakers.",
      "rating": 4.0,
      "verified": true,
      "author": "Randell Sygal",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great shoes",
      "text": "Great quality very nice model .....I recommend it very much",
      "rating": 5.0,
      "verified": true,
      "author": "Tyron's",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "My go to pair",
      "text": "These are my favorite shoes now. They match well with any outfit and fit comfortable and stay fairly clean easy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Great shoe!",
      "text": "Most comfortable shoes I have ever owned. Fit just right if you have a wide foot. Have much more arch support than you would expect. Great shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor underdahl",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Very nice shoes",
      "text": "I've had these shoes for about 2 months now and they are amazing. When I first got them they were a bit small but once I broke them in they fit just fine. I wear them everyday to school and around town, they are very comfortable. The tongue of the shoe is held down with elastic so I can just shove the shoelaces inside and not have to worry about tying them. They are some the most comfortable and stylish shoes I've owned, I get compliments on them daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Soooo nice! my husband is super picky and has a ...",
      "text": "Soooo nice! my husband is super picky and has a hard time finding shoes that he likes so these were a great find! They're a little lighter grey, but it's better than what's pictured!",
      "rating": 5.0,
      "verified": true,
      "author": "T M.",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Cool volors and quality was still exelent",
      "text": "9 & 1/2 shoes came too small. I really didn't want to deal with the return process though. So I gave them to my nephew.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "He proclaimed that he \"felt cooler and better about himself\" when wearing them",
      "text": "Gave these to my husband as a gift. He proclaimed that he \"felt cooler and better about himself\" when wearing them. They look great! Too bad he wore them in the mud a day after he got them and they are now stained :( Will have to buy another pair if I can't clean them good enough. They are worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Stone1216",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "Great Shoe but fits 1/2 size too small",
      "text": "This is a great looking shoe - I get lots of compliments on it and it feels reasonably comfortable, but the fit is absolutely too small. I ordered a 10 just as I do all my shoes, but I would definitely need a 10.5 in this shoe... maybe even an 11. I highly recommend for the style, but I'd recommend ordering a 1/2 size larger for better fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Chardo",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Lasts about a year for this student. Ut worth the price I paid",
      "text": "Nice shoes for the price. This is my third pair. Im only giving three stars because they wear put a little faster than id like but over all worth the cost",
      "rating": 4.0,
      "verified": true,
      "author": "C. S. Bastian",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Great shoe",
      "text": "Really like these shoes! Great look and works great for mountain biking",
      "rating": 4.0,
      "verified": true,
      "author": "Michael D. Taylor",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "I love dc",
      "text": "I love DC shoes. Still haven't had a problem yet. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Burrz",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Old DC was better quality",
      "text": "It's not one star but we'll see as time goes. It's been just over a month of wearing them with maybe 4 miles worth of walking in them and the rivet that the lace goes through has already separated. Kind of annoying and my old DC's were awesome I had them for 7 years. I guess quality changed with time. Also since I bought them the price dropped 13$...",
      "rating": 2.0,
      "verified": true,
      "author": "mimi_babe_",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "Size 14 Miracle Shoe",
      "text": "I'm not into name brands, but DC sneakers fit my son's size 14 feet better than any other shoe we've ever gotten. Thank goodness there are always sales on Amazon, or we'd never be able to afford them either. Very happy customer! Thank you!! Just please stop using UPS for delivery, they are a nightmare. I always have to fight for my own packages.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "It's a solid shoe. Compare to Vans Chukka Low for fit and style.",
      "text": "I was surprised--I have large (size 14), somewhat wide feet, but this shoe fit exactly like I hoped it would. It compares to my Vans Chukka Low shoes I was wearing prior in terms of fit and style.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Rice",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Very comfortable and good looking shoe",
      "text": "Very comfortable and look great in person. The are maybe just a hair too small, but unfortunately, they aren't available in 13.5. Hopefully, once they break in a bit they will fit perfectly. I walk ~5mi/day at work, and they're comfortable all day long.",
      "rating": 4.0,
      "verified": true,
      "author": "Charlie Foxtrot",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Shoes run very narrow",
      "text": "Seems like a quality shoe,i ordered what i normally ware 8 1/2 medium,this show was so narrow i could barely get into them,very tight and uncomfortable,had to return them",
      "rating": 3.0,
      "verified": true,
      "author": "RickieDean",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Comfortable shoes.",
      "text": "This is my 3rd pair of DC shoes over the last few years and I am just as satisfied with them as I was the 1st 2 pairs. They are very comfortable and well made. These are shoes other brands would charge twice as much for.",
      "rating": 5.0,
      "verified": true,
      "author": "UltraViolence",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Husband likes it",
      "text": "Bought as a gift for husband says it fits good and has great color. Also noted that it's comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazona",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "DC shoes are my absolute favorite and this type of design/model are among the best ...",
      "text": "DC shoes are my absolute favorite and this type of design/model are among the best I've bought from the brand. The shoes fit perfectly and look great. In the past I've bought similar shoes but the shoelaces would always untie themselves even from just moderate amounts of walking. This isn't the case with this pair. I can go a full day without any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Tan Dao",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Great look and feel, just warm",
      "text": "Love the look and feel. Just be ready to deal with warm feet as these have no ventilation. I did go to a thinner sock and it was a bit better.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl Marquez",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Awesome",
      "text": "My husband loved these. They fit him perfectly and they looked nice. The only bad thing is that they wear out pretty quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber Benfield",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "They look so good and are so comfy",
      "text": "I wear a women's US 8-9. And I ordered a men's 8 and these fit perfectly. They look so good and are so comfy! Definitely my favorite new pair of shoes!",
      "rating": 5.0,
      "verified": true,
      "author": "Tosh",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Iffy",
      "text": "The color was lighter than the picture and the one shoe is tighter that the other,",
      "rating": 3.0,
      "verified": true,
      "author": "Babushka710",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Good affordable shoes",
      "text": "Got these for my boyfriend and he loves them. He wears them pretty much every day. He's had them for close to a year and the soles are starting to deteriorate so I'm replacing them, but they held up pretty well considering the amount of wear they got!",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Good shoe for a great price.",
      "text": "Bought these shoes for my son. Very reasonable priced, they fit well, and he likes them. DC shoes always last us until they grow out of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Cisne",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Comfortable and stylish.",
      "text": "These are seriously comfortable shoes. I will buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "freakfly",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Well worth the price.",
      "text": "These are NICE. The canvas is sturdy yet breathable enough for summer. Pair these kicks with a pair of fat laces and you're good to go. Glad I got them",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "My favorite shoes ever!",
      "text": "These are by far the best shoes I've owned! So comfortable, even while working at a job where you're on your feet all day. Will be ordering more similar!",
      "rating": 5.0,
      "verified": true,
      "author": "Kylee324",
      "helpful_votes": 0,
      "publication_date": 20180821
    }
  ],
  "product_meta": {
    "title": "DC Men's Anvil Tx Skate Shoe",
    "description": "Special features include: mesh lining with vent holes for breathability and vulcanized construction",
    "rating": 3.9,
    "feature_bullets": [
      "Abrasion resistant sticky rubber outsole",
      "DC's Trademarked \"pill pattern\" Tread",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium"
    ],
    "specifications": {
      "Date First Available": "15 May 2019",
      "Manufacturer": "DC",
      "ASIN": "B07RWF3D2R",
      "Item model number": "320040",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Technical Skateboarding Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 60.34
  }
}