{
  "website_summaries": [
    {
      "verdict": "Despite some quirks, this repeller offers some nice capabilities and covers a reasonably large area for a single unit.",
      "pros": [
        "A single plug-in unit that covers up to 1,200 square feet",
        "Offers three settings for controlling minor to major infestations",
        "Indicator lights of different colors help you identify the appropriate setting",
        "Can control insects, spiders, and rodents"
      ],
      "cons": [
        "Emits a faint but high-pitched sound that is annoying to consumers with sensitive ears and some dogs",
        "Won't control all pests"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "SCAM!!! IT DOESN'T WORK!!!",
      "text": "Simply put, you are paying for a device that will simply waste energy on making noise and flash a light. It doesn't work as I saw a mouse running next to it with no effect!!! But why so many good reviews? I cannot be right? Few days after I purchased two of these, I received 2 \"coupons\" for a $25 gift card in exchange for a good review/rating. Check out attached photo. All these good reviews are simply bought!!! BE AWARE! DON'T BUY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Greg G",
      "helpful_votes": 38,
      "publication_date": 20200311
    },
    {
      "title": "Changed from Unbeliever to a Believer",
      "text": "WORKS GREAT. At least for me, I got rats, mice and racoons living under my shed, and due to water-damage to the floor, the ate a hole right into the inside of my shed. But I plugged one the Neatmaster Ultrasonic Pest Repeller into an outlet and I could see and hear the little critters moving. They did not like it. I of course did not like the fact that there were enough that I could see and hear them but they've moved on. I unplug the things every other month or so and leave them out for a while so nobody gets used to the sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Byron Anderson",
      "helpful_votes": 76,
      "publication_date": 20200120
    },
    {
      "title": "No more bugs",
      "text": "Say good buy to bugs. I was having cockroaches in the kitchen tried everything everyone told me from borax,, gels like Maxforce, Advion etc etc nothing worked. Cleaning everything before using just to think I had roches in the kitchen the cleanest place you should have at home but thanks to Ultrasonic Pest are peleles. NO MORE BUGS. Finally gone, give it 2 weeks they’ll be gone for good.",
      "rating": 5.0,
      "verified": true,
      "author": "veronica",
      "helpful_votes": 74,
      "publication_date": 20191028
    },
    {
      "title": "MINUS STARTS, This corrects roaches, not avoids.",
      "text": "This does not work as it is described. Or even worse, because it made completely opposite effect that corrects roaches. I bought this to avoid from roaches. But One morning I found there is a big roach just between this and wall and after I removed this, some small roaches appeared from other caps and inside of this. What a incredible result!!",
      "rating": 1.0,
      "verified": true,
      "author": "Hiro",
      "helpful_votes": 9,
      "publication_date": 20191012
    },
    {
      "title": "Worthless, bugs are visible in the device surrounding",
      "text": "Installed in the garage, it's a two car garage, not a very big one, put the device on the highest setting with audible pulse, it says keep it for few weeks to see the effect, after over 4 weeks (Return period expired for prime) still it doesn't show any results, insects & bugs do roam around the device closely and doesn't seems get bothered with it's sound or energy... I get pest control every 3 months from last 5 years, so I don't have pests roaming around like untreated home, thought this will eliminate what few you see sometimes, but don't bother ordering this, I feel like I got scammed by this product NOT Recommended !!!",
      "rating": 1.0,
      "verified": true,
      "author": "aziz huda",
      "helpful_votes": 6,
      "publication_date": 20191112
    },
    {
      "title": "Doesn’t work work.",
      "text": "Honestly I don’t know why this get so many good reviews. I have been using this since December . It is time to write a review cuz I always want to give time for it to work. I got two of the device I decide to turn on the strong “red” hope it will get ripped off mouse mice faster but it has been almost two months nothing help. It still run around. Too bad I can not return . The glue even better at least I can get one.",
      "rating": 1.0,
      "verified": true,
      "author": "Vicky",
      "helpful_votes": 3,
      "publication_date": 20200208
    },
    {
      "title": "Won't buy again",
      "text": "I bought this to replace another brand that worked great for years but I wanted an \"updated\" unit. I WISH I HADN'T. If I hadn't thrown the boxes away I would definitely return all of them. The mouse goes right by it as if it's not plugged in. It's on the blue light so I would think it would have been more effective. On top of having to move furniture to use the unit. Plugging the unit in the bottom outlet rendered the top top one useless because of how big the unit is. Totally going back to my original company. Completely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 2,
      "publication_date": 20200413
    },
    {
      "title": "Doesn’t Work Well, if at All",
      "text": "DOESN’T WORK well, if at all. We still have the same amount of pest problems as we did before we purchased. On the high mode, you can hear the ringing going so we can’t even use that setting in our home.",
      "rating": 1.0,
      "verified": true,
      "author": "MMHZR",
      "helpful_votes": 4,
      "publication_date": 20200213
    },
    {
      "title": "Didn’t work for me",
      "text": "I got this with really high hopes. I have a very small greenhouse and I try to start my plants from seeds. I placed this in my greenhouse on high for 4 days and even placed it directly on top of my seeds and the mice paid no attention to it at all as they dug up and ate all the seeds. It is going back. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "BezNez",
      "helpful_votes": 3,
      "publication_date": 20200319
    },
    {
      "title": "Biggest waste of money",
      "text": "I bought this hoping to help resolve a roach problem in my appartment. I bought it nearly 6 months ago desperate to try anything. The roaches only got worse. Today while cleaning my kitchen I unplugged it. They were literally breeding on the back of the device between the device and outlet. Absolute waste of money. Going back to borax and raid!",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna Chavez",
      "helpful_votes": 3,
      "publication_date": 20200223
    },
    {
      "title": "Doesn’t work...Not sure what everyone else is talking about...",
      "text": "I’m not sure if this thing broke or if it doesn’t work or both... I’ve owned my unit for less than 6 weeks and have come to find the same pesky bugs that I’ve been trying to shoe away still making their way into the small bedroom I have my device set up in. See the picture attached, as you’ll be able to see one of these bugs sitting on top of a laundry basket not even 3 feet away from the device. What a waste of money...",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Cornell",
      "helpful_votes": 3,
      "publication_date": 20191117
    },
    {
      "title": "Happy I haven’t seen any pests...",
      "text": "I recently had a Scorpion in my home along with other small pests. I lost my mind when I saw the scorpion so I immediately went on Amazon to search for pest control devices. Came across the neatmaster and decided to try it. I have a small 1 bedroom apt so I put this by the front door. Decided to get a 2nd one for the bedroom. So far I haven’t seen any critters!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "ApachStar",
      "helpful_votes": 69,
      "publication_date": 20191208
    },
    {
      "title": "Best product for mice on the market",
      "text": "Tried every type of thing to get rid of mice. Organic, homemade, moth balls, and on and on. This is the only thing that got rid of the mice. I was skeptical myself, but trust me this is the absolute best product on the market. I didn't have the couple weeks of heightened activity either. I love right next to a farm and this worked so I can't imagine a situation where it wouldn't. We would have four or so mice a week before this. Down to literally zero.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 63,
      "publication_date": 20200414
    },
    {
      "title": "Don't waste your money!",
      "text": "I bought this device 9 months ago and it has been totally useless as an insect repellent. The device is set on the highest setting yet it has no effect on kitchen ants that are less than 4 feet from the device. I have had to resort to ant traps. My home is a small 2-bedroom of less than 1000 square feet. The Neatmaster product has done nothing to impact occasional spiders that show up in the home. Just last night, I had a large spider run across my forearm. This is what prompted me to write this review after giving the device 9 months to perform as advertised. Again, don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce K.",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "This seems to work",
      "text": "I think this is a good product. We had some issues with bugs in our basement and we have had an exterminator come out, but they were still around and once we put this down there, after a week it seemed like they were going away. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 69,
      "publication_date": 20191029
    },
    {
      "title": "Garbage!",
      "text": "Piece of junk that doesn't work. The sellers even offer you money back if you leave a good comment that I suspect is how it has such a high ratings. I've had this a few weeks now and nothing has left. Still had flies and roaches. After bombing and spraying I got rid of them. This does not work!",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 2,
      "publication_date": 20200219
    },
    {
      "title": "I did not believe at first",
      "text": "So I bought this product very hesitantly thinking that it will never work, cleaned my garage where I have spider issue and then decided to plug it in and give it a shot. It has 3 modes for low, med, high. Anyway long story short I plug this in thinking that it would never work. it has been a month now and my garage is still super clean barely any spiders or critters. I am so happy that i did not have to use any chemicals. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Foz",
      "helpful_votes": 67,
      "publication_date": 20191020
    },
    {
      "title": "I am a believer",
      "text": "I will admit, I was skeptical of this sort of pest repellant. I am a solid believer now. I installed these in our attic in hopes to repel a red squirrel. Not only did the squirrel not come back, but we found wasps vacating too.. Wasps were always nesting in our attic too and making using the swimming pool a challenge as they like the water too. They too are gone. The only issue is if the power goes out, the unit resorts to it's low power base setting. Since it was in the attic, we had it set to max.",
      "rating": 5.0,
      "verified": true,
      "author": "Briggska",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Good product.",
      "text": "So far this is working great. I keep it on the middle setting in my carport where my washer and dryer are. We are new to the south and the giant roaches here are awful and freaky. So far this is keeping them away. Since plugging it in I have not seen one roach. It does not seem to bother my dogs or cats when they go outside. I can't turn it on the red setting as it bothers me, but Its okay because blue setting is working perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Munson",
      "helpful_votes": 67,
      "publication_date": 20191012
    },
    {
      "title": "This is a very effective pest repellent",
      "text": "I decided to take the time to test it in my attic and outside my house in the patio area. Surprisingly, even on the medium setting outside, this device is able to protect the area from small critters. I had some mice visit the area and make themselves at home. After using this device, it's been clear ever since. The same goes for my attic area. I'm glad I gave this thing a try and would recommend it to anyone looking for an effective way to get rid off the small pests.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Dabrowski",
      "helpful_votes": 60,
      "publication_date": 20200506
    },
    {
      "title": "IT DOESN'T WORK AT ALL...",
      "text": "They feel comfortable enough to climb up on this... even after i turned this on for like a month. I guess this doesn't do any...",
      "rating": 1.0,
      "verified": true,
      "author": "Margaux",
      "helpful_votes": 2,
      "publication_date": 20200428
    },
    {
      "title": "Virtually no more infestation!",
      "text": "This product is great! Had a horrible infestation problem when I moved into my apartment, sadly. Had been fighting insects for 3-5 months! After purchasing this it the level of infestation went from 10 to 1. I say 1 because every now and again I see a baby or a small water bug insect trying to find it's way out. Ultimately there are virtually no more insects! I plan on purchasing another plug in the future from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 61,
      "publication_date": 20200228
    },
    {
      "title": "Works well!",
      "text": "one problem to live in an old apartment is that many bugs will sneak in your living spaces. I hate to squash them but don’t want to deal with them either. The repeller is a great way to make them go away. It has been working well so far... I have not seen spiders, ants for couple weeks while roaches have started disappearing from the view.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheng-chieh Chang",
      "helpful_votes": 61,
      "publication_date": 20191130
    },
    {
      "title": "Very happy to say that this works",
      "text": "So far, so good. We had a fairly significant waterbug issue (from neighboring apartments) and I put one downstairs and one upstairs on the blue setting. Within a day or so, ALL bugs were out of our apartment. I maybe have seen one or two small roaches now in the last several months. I am SUPER satisfied with my purchase and highly recommend. We will see how things go once summer rolls around. Keep in mind that this takes up a whole outlet. I got an extension cord for more plugs.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrienne",
      "helpful_votes": 60,
      "publication_date": 20200221
    },
    {
      "title": "Just plain doesn't work and is made with poor quality",
      "text": "I use this on my porch. I can sit right next to it to where I hear the high pitch noise and mosquitoes still eat me alive. I have tried all 3 settings. Also note that the button that controls the 3 settings stopped working right. Now when it's the light is off it's on and when it's blue or purple it's off. Just a lousy product that is not worth buying imho.",
      "rating": 1.0,
      "verified": true,
      "author": "KV Trout",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Unsure about long term effectiveness",
      "text": "Easy to put in place, though I'm questioning its long term effectiveness. After putting on, within a day I didn't see a cockroach for weeks (after seeing them daily), lately though I am seeing them frequently again. Do pests grow tolerant?",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Hit or miss",
      "text": "I don't know but this thing damn there nearly killed my little chihuahua! My dog kept gnawing at things to include her skin like she was irritated. I couldn't figure it for days. She started to get weak and my and I was scared! What helped was the fact I read a review that someone said the same thing happened to her dog and I yelled at my husband to unplug it and sure enough she stopped smh so scary! Buuuut the mice wasn't seen for awhile during sooo...",
      "rating": 2.0,
      "verified": true,
      "author": "Lucinda Noel",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Very effective and easy to use pest control",
      "text": "I bought a different model of this product a few years ago and it was very effective in keeping rodents from my neighbors shed from coming into my yard. When a family member who lives out in the country began to have rodent infestation in their house, I ordered 5 of these to help them. Within a few days there were no more signs of the unwelcome varmints! Humane way to rid your home and property of unwanted guests.",
      "rating": 5.0,
      "verified": true,
      "author": "MJA",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Does not work for me",
      "text": "I still see droppings on my patio after using this product for 7 months. I placed this beside my outdoor grill but I still see droppings around it. Now, I have to toss out my grill.",
      "rating": 1.0,
      "verified": true,
      "author": "beefsteak",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "What a joke!!!!",
      "text": "After reading reviews on various different repellent products, I chose this. What a disappointment! I understand the mouse activity may increase when first installed, but many months later, I am still dealing! The \"middle\" setting even quit working for some unapparent reason. Just stick to the traps, this thing is junk!",
      "rating": 1.0,
      "verified": true,
      "author": "LAUREN",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Don't buy!",
      "text": "Had flies and plugged this in, the flies never even noticed. Made sure it was on \"high\" i could hear the sound coming from it but I began wondering if it was for me n not the flies! Worst product I've bought online EVER!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "this should be a 1 star.",
      "text": "this is not a roach repellent. I mean it even has the word \"roach\" on it so u can't say it isn't advertise for that. I wont be surprised if this product doesn't update and they just sell it under a new seller because this technology hasn't changed much over the years as i could tell.",
      "rating": 2.0,
      "verified": true,
      "author": "Notaged",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Doesn't work",
      "text": "I have been using this product for two weeks now, and I haven't see any difference in pest/rodent activity in my apartment.",
      "rating": 1.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20191022
    },
    {
      "title": "Works...doesnt keep 100% bugs away but reduces them greatly.",
      "text": "Had my hesitations... but was not let down. I would count swarms of 15 to 20 mosquitos by our front door making impossible to go in without having several flying in. After plugging unit into outlet on front porch by door...I only saw 2 mosquitos at most.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey K Stewart",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "DOES NOT WORK!",
      "text": "I had purchased a different brand of devices and still had a mouse issue. So I bought this one because it had better ratings and it cost as much as the others where I got devices. Well, I still have a mouse problem. It didn't do anything. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Delaine",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "It really works!",
      "text": "We had a bad roach problem in our kitchen. After having this sound machine installed for a week it got so much better! Super easy to install and operate and it has three different settings depending on the severity of your problem. Used in tandem with an ecofriendly spray (roaches hate peppermint oil) and Combat traps, plus regular cleaning with vinegar spray, but it wasn't until the sound machine was added to the mix that we really saw a noticeable difference. It drove them out of the walls and out of our lives!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather O'Brien",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Detour pest",
      "text": "Piercing sound on high. Is working . First had squirrels in my attic. They moved out. Now moved out to the garage. Remember to lower sound if you have visiting pets.",
      "rating": 5.0,
      "verified": true,
      "author": "louise sylvester",
      "helpful_votes": 61,
      "publication_date": 20200223
    },
    {
      "title": "Not effective at all",
      "text": "It looks very futuristic and intimidating, but it is useless. Pests and flies are very \"comfortable\" next to this device as if it doesn't exist. Waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Monty S. Benhaim",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "This does not work",
      "text": "At first it did work or I didn't see any rodent for a while and recently they have move back now. Maybe they are immune to the beeping sound. The picture is accurate on the site so there is no need to upload any picture of my own.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam K.",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Doing its job NO MORE MICE!",
      "text": "I had a few mouse issues early this fall, bought from a friend's recommendation. Plugged it into the outlet nearest to the door and my mice troubles have disappeared. I have a small Yorkie dog that was never bothered by the sound like other repellers I have heard of. LIke I said its, Doing its job NO MORE MICE!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Hill",
      "helpful_votes": 60,
      "publication_date": 20191114
    },
    {
      "title": "Bug deterrent Product",
      "text": "I am unable to tell if this is working as we speak , because the bugs are currently out.this time of year. I will add to the review as we come more into the season if its working or not. adding to the original review product is working exceptional at this time seeing is believing no more misquotes on my front door screen I am pleased. I will order another.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "It works for spiders!",
      "text": "I live in an area known for ants and spiders. After traveling for over a week, it was not unusual to come home to find spiders and webs in almost every room. I bought one of these over a month ago, And there literally are no spiders anywhere! I plan to get a few more to add in closets and upstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillienp",
      "helpful_votes": 60,
      "publication_date": 20200214
    },
    {
      "title": "doesn't work at all",
      "text": "This is junk. Doesn't work at all. Return was easy enough... but not sure why anyone would make such a bad product.",
      "rating": 1.0,
      "verified": true,
      "author": "pink fluffy slipper world",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Too big, takes over outlets",
      "text": "This product has 3 levels, nothing, somewhat useful and annoyingly loud. What I hate about it is that the design wont allow you to plug something else in the outlet next to where this one is plugged, it is too big. Save yourself some time and look for a more compact brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Garym95",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Works",
      "text": "Haven't seen any bugs since plugging this in about a month ago, usually would see maybe one a week or so before using this. So It must be doing its job good.i use on the low setting, if high setting is turned on everyone can hear a loud annoying noise, so low setting is good for us",
      "rating": 5.0,
      "verified": true,
      "author": "amber",
      "helpful_votes": 60,
      "publication_date": 20200209
    },
    {
      "title": "Worked faster than thought",
      "text": "So far so good I had lots of spiders and centipedes before I received this product after almost 2 months of use I have yet to see any spiders or centipedes. Quick inboxing and installing. I can move it around the house and unlike other plug pest repellers it's very quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Markus collier",
      "helpful_votes": 60,
      "publication_date": 20200220
    },
    {
      "title": "Blocks the whole outlet.",
      "text": "I was offered $25 to leave a 5 star review and I might have done that except the design of this device blocks off the second outlet so you can’t plug anything next to it. I’ll let you know if I see any mice...",
      "rating": 3.0,
      "verified": true,
      "author": "EmailBenn",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Roaches ..you won't find them anymore",
      "text": "I liked the product ultrasonic neat master repeller,I bought it to get rid of roaches And it worked excellent, now I don't see any roaches in our living room It works great,I'm so relieved,because I have baby at home and I feel safe now. When u start using it ,you will know significant difference, I do use when I'm away from the house!worth buying",
      "rating": 5.0,
      "verified": true,
      "author": "victor",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Device isn’t worth your money",
      "text": "I’m sad to say this repellant isn’t what it was cracked up to be. I’ve had it plugged in for weeks and the device had no affect on the mice in the tiniest bit. Old school wooden snap traps are the best way to be rid of the rodents trespassing in your house.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Tysdal",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Great for working in garage",
      "text": "I use this for working in my garage using epoxy. Living in FL there's always something flying so when I have the garage door up and even when i'm just in there, I turn on the pest repeller and I'm glad it does what it says. I literally saw 1 mosquito; it flew it and nose dived to the floor. Not sure if it's the sounds but this works and i'm extremely glad to have it. I am so afraid of bugs and this keeps them out of the garage while i'm in there.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Critters in your farm equipment",
      "text": "Bought a cheap version of this type of pest repeller and it appears to work in keeping the mice out of my tractor cab thus reducing their damage to the wires and seat. Decided to upgrade and see if the fury critters go elsewhere for the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "wchapin",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Crap",
      "text": "Yes it’s easy to use and easy to install but does it work. Nope it doesn’t.",
      "rating": 1.0,
      "verified": true,
      "author": "Fancyface",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Did not work even when it was close to rat entry",
      "text": "I bought this because it had the most positive reviews out of all the similar products. It did absolutely nothing to help keep the rats out of my attic. I tried every setting and it did nothing. The worst thing is that I have a very open attic and placed it 50 ft from the point of rat entry. Ultimately bought a essential oil diffuser and mint oil to drive them out before sealing the hole.",
      "rating": 1.0,
      "verified": true,
      "author": "Benjamin Wellhoefer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Not an immediate solution",
      "text": "This product is pretty much as described. Its effects are not seen when installed but you will have to leave it running for a few days before you see any true gains in pest relief. Takes quite some time to start working and im still not even sure that its gotten rid of all bugs but there has definitely been a reduction in mosquitoes.",
      "rating": 3.0,
      "verified": true,
      "author": "moors88",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Looks cool and works well",
      "text": "So far in the winter I have not seen too many extra bugs in my basement. The true test will come in the spring when I the creatures wake up. The black look is very sleek.",
      "rating": 5.0,
      "verified": true,
      "author": "David W",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great results a problem easily solved. I’m happy.",
      "text": "I purchased the repeller when I was having an issue with spiders. After having it for 3 months I have to say I’m very happy. A friend told me she had gotten it for her mother for pests with good results. I only hoped it would work that well for me. I was skeptical but the concept made sense to me. I plug it in each night and it’s a simple as that. No annoying my two kitties either!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Love it!!!",
      "text": "I am so thankful for this product! Every few months I would purchase ant/roach traps from the store. They never worked. I came across the ultasonic pest repeller and decided to give it a try. Was not trying to keep my hopes up, but this awesome little gizmo has been a blessing! Works so perfectly in my house! I am so happy I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Works ok for mosquitos",
      "text": "Bought this to combat Texas mosquitos while sitting on the porch. I really think they are just confused and agitated. I hear them as they whiz past me. I’ve been bitten once since I plugged it in. Medium setting",
      "rating": 4.0,
      "verified": true,
      "author": "darrel foster",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "We plug them in on the outside four of them they seem to work great.",
      "text": "See my almost drove is crazy until we got these. We have had four of them plugged in and they seem to be working great. We were going broke buying sticky traps.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Don't worst your money",
      "text": "This product doesn't work at all the bugs stayed near the plug in and not run away as describe.",
      "rating": 1.0,
      "verified": true,
      "author": "Andre",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Did not repel lizards",
      "text": "Does not work - I saw lizards walking up to this thing and exploring it, instead of being \"repelled\" by it. They were quite at peace and chose to stay near this unit - I tried the three settings and none of the settings changed this behavior.",
      "rating": 1.0,
      "verified": true,
      "author": "SD",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Works fantastically",
      "text": "Easy to use just plug in and set on your desired setting. I've had a pest problem for a few months in my basement, mostly ants and spiders. installed the Repeller and within a week I noticed no more insects. I have mine set on the blue setting and it has been keeping my basement clear. Only con i can say is that the red setting has an audible high pitch noise that can be heard but the blue setting has been just fine for my situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Didn’t make any difference",
      "text": "I live on a ranch and every year when we harvest hay we get mice. I was hopeful this would help but it didn’t make any difference at all.",
      "rating": 1.0,
      "verified": true,
      "author": "V. Nix",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Best product for the money.",
      "text": "I purchased this for outside my backdoor to keep bugs and lizards away from my deck. So far I see a big improvement. A lot less activity. I recommend buying this especially if you live in Florida.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Rapp",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Waste of money",
      "text": "Might as well be snake oil. After 3 months of use my roach problem is worse than ever. I was curious to see what was on the inside and there is only an ied light and a noise maker.",
      "rating": 1.0,
      "verified": true,
      "author": "DAVID WEBSTER",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Easy to use.",
      "text": "It's easy to use. You just plug it right in and it starts right away. There's 3 modes and yes the most extreme one is audible by humans. It's good, I have been a decrease in pests in a couple of days. So overall very easy and efficient so far to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Rudra",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Pest free",
      "text": "Great product to have a pest free area. Installed on patio and have already seen a reduction of pests. Will be ordering more for around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Rose",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Doesn't work",
      "text": "I have not seen this work at all. I have tried it even on the highest setting and it didn't do anything. Still buying roach bait just to be keep them away.",
      "rating": 1.0,
      "verified": true,
      "author": "Bethany Benning",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Stopped working",
      "text": "Seemed to work well until it failed. Now it's trash unfortunately.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazoncustomer",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Yuck mice",
      "text": "I had mice... I bought two because I knew it'd be bad. Out of the three options-blue, green, and, red- I had to use red which makes noise to keep nice away. Still I can see the remains of mice but MUCH LESS frequently. I don't stay at my place much any longer, but not to be used as the only reset to get rid of them. I feel like a cat is the only option for me now.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Wall",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Got rid of Mosquitoes",
      "text": "I was having trouble with tiny mosquitoes biting me. I purchased this unit and I haven't had any problems with the mosquitoes since.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Marquesen",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Works immediately",
      "text": "My nextdoor neighbors were getting some work done and in unpacking their hoarded garage, my house was subject to the whims of roaches and rats. I put glue traps up where I saw them hide to, but they were too smart for that. I bought these pest repellents and within 24-hours i caught a roach on a glue trap, and i have yet to see a single mouse or mouse dropping. Totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Greene",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Does not work on mice.",
      "text": "I purchased this product to control mice. I still saw droppings in the room where it was on the HIGH setting. I purchased glue traps and caught a mouse on the floor about 3 inches away from this Ultrasonic device. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "theresa spross",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Great thing!",
      "text": "Got this in Hope that it would help finally solve our mouse occurrence. After setting trap after trap in our basement I broke down to give it a try. Much to my husbands surprise it had been working for months. I follow the suggestions and change up the frequency randomly to make sure it is doing its job. Would reccomend product!@",
      "rating": 5.0,
      "verified": true,
      "author": "julie",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Not recommended",
      "text": "Over all I notice that within a couple of days I was getting a lot of headaches , which is weird because I don’t suffer from headaches ever , As soon as I disconnect it my headaches stopped !! My dog was also acting weird , I think it was overwhelming her . Sorry but I don’t recommend this at all , and I still had the pest problem while it was connected",
      "rating": 2.0,
      "verified": true,
      "author": "Yesse",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Mouse problem gone....",
      "text": "Bought this for my 2100 sq ft shop after expending several glue traps. Within a week I wasnt getting anymore mice in my traps! Couldn’t be happier. I leave it plugged in 24/7 for peace of mind...",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy B. Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Did not work",
      "text": "Don’t waste your money. Had no effect at all on the rodent activity on my home. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Very Pleased!!",
      "text": "So far so GREAT!! I have not seen any \"friends\" since installing this!! Plan on ordering a few more for other areas in my home!!",
      "rating": 5.0,
      "verified": true,
      "author": "Momfinglet1",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Not really work after few months!",
      "text": "When it new, it working, than after few months, now I found it is not working again, I don't know what happen,",
      "rating": 3.0,
      "verified": true,
      "author": "Hoiman YIP",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Well Worth the Investment.",
      "text": "After a few days of using one in every portion of the house, the bugs were disappearing. Whatever bugs that remained were exterminated.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Sumler",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great Product",
      "text": "I live on pasture land and very near a hay barn which means field mice up to the house any time it's mowed. Water bugs are also bad with a small pond on the property. Also haven't seen a spider since it was plugged in! This pest repeller has been great! We have it plugged in by the back door next to the garage and it seems to help there as well! Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy Smith",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Waste of a product more like a scam",
      "text": "This thing sucks it does not work don’t waste your money on it. I got one it literally does nothing i still see flies and insects if you put it on its highest setting all it does is annoy your ears not even my dog reacts to it. Don’t buy waste of money ! You’ll be better if you buy a regular sticky tape trap.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy castillo",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Doesn’t work",
      "text": "Don’t buy this thing does not work. Got it at full capacity and does nothing but give me a headache. Doesn’t work with any of the bugs",
      "rating": 1.0,
      "verified": true,
      "author": "John m",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "It actually works!",
      "text": "I put this in my kitchen where I had seen roaches. Very shortly after we found that the roaches were staying away. Really relieved to have this!",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Don’t buy",
      "text": "It’s easy to install but do not work. A nice still came into our garage this repeller did not help nor work at ALL!! I will not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Brown",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Did nothing for me",
      "text": "I bought this item to try to combat a German cockroach problem in my apartment, decided to go with this because of the good reviews. I’ll tell you this product did nothing for me, always kept on the moderate infestation legs because the red severe one made an awful audible noise. Took the device out of the wall to find tons of roach droppings all along the outlet, what a joke!",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Phillips",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Really cool features!!!",
      "text": "Really great product; and i love how it has different settings for the intensity !!! that makes a huge difference; buut not entirely sure about rodents...",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel M",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Works for Me!",
      "text": "I have seen no more mice since plugging this in! It is a lifesaver because I was ready to pack up and move. I have it on the blue setting now. I kept it on the red for the first 2 days but the high pitch was repelling me (lol). Blue works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica M.",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "takes time to show effect",
      "text": "device takes 1 week to show any type of effect on mice. u have to wait for that time. kind of expensive, but is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Itachi 🐉",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Works!",
      "text": "This really seems to work! Haven’t seen a mouse or any dropping since putting this in our garage.",
      "rating": 5.0,
      "verified": true,
      "author": "lg9*ck45",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Don't buy this product!",
      "text": "This product does not work but the lights are cute or whatever! Save your money! Even after 5 weeks it still did nothing!😡",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "They don’t work at all",
      "text": "They don’t work. Spiders and bugs all around the three that I have plugged in",
      "rating": 1.0,
      "verified": true,
      "author": "M Family",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "This is a must have",
      "text": "This thing works really well. Before I had this, I would always find crickets in my room no matter what I would do. I’ve had this plugged into my wall where they would mostly come from and I see one or two on the rare occasion",
      "rating": 4.0,
      "verified": true,
      "author": "Shania",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Just plug it in.",
      "text": "Easy to use, appears to be working, setting it to high is very audible.",
      "rating": 5.0,
      "verified": true,
      "author": "Roberto Reyna",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Don’t waste your money",
      "text": "Had absolutely no effect on the mice and was installed in an outlet directly next to where they have been known to congregate and enter the home. Waste of money .",
      "rating": 1.0,
      "verified": true,
      "author": "Click",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Does not work at all",
      "text": "Bought this to repel crickets in my basement but ended up getting more bugs around this machine. Returned and called pest control.",
      "rating": 1.0,
      "verified": true,
      "author": "xymz",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Best rodent repeller on the market.",
      "text": "I really like this neatmaster repeller. I ordered this one , a max movie and a shoo master. Design is way better. Also has three settings where the others only had one. The highest setting you can audibly hear so I know it's strong. Have not seen or heard from any mice. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Not as expectd",
      "text": "Wanted something to use to discourage mice. Mice don't care.",
      "rating": 2.0,
      "verified": true,
      "author": "sbsnfrd",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Works for small spaces. Did not work for my purposes.",
      "text": "Works great for smaller spaces. Better than other toxic solutions specially if you have small kids.",
      "rating": 3.0,
      "verified": true,
      "author": "MBonifacio",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "So far works great",
      "text": "I have not seen any mice so far, happy with this pest re-peller,",
      "rating": 5.0,
      "verified": true,
      "author": "Harry A. Jones Jr.",
      "helpful_votes": 0,
      "publication_date": 20191024
    }
  ],
  "product_meta": {
    "title": "Neatmaster Ultrasonic Pest Repeller Electronic Plug in Reject Mosquito Mice Roach Spider Ants Bugs and More Home Animal No Kill Indoor and Outdoor, Black",
    "rating": 3.4,
    "feature_bullets": [
      "Driving out pests FROM YOUR home: Neat master ultrasonic Pest reject uses state of bionic wave, electromagnetic wave and ultrasonic wave technology to drive pests away, which drive pests out of your home for good. Mice, rats, spiders, roaches, mosquitoes, ants, snakes, rats; none are immune to our pest control ultrasonic Repellent and completely leave after a few short weeks of use",
      "Easy to use: simply plug our Neat master pest Repelled plug in the outlet, pest reject ultrasonic Repelled works when you notice the Green light is on, which is used for minor pest infestation; adjust to purple light mode If you have middle pest infestation, turning on Red mode If you have terrible pests infestation",
      "Large coverage area: Neat master ultrasonic Pest control is effective for an area up to 8001200 Square feet. Please note that ultrasonic waves can’t travel through walls. Though our unit works very well, but we recommend placing our pest defender ultrasonic in every room !",
      "Non-toxic and : forget the harmful chemicals, poisons, and traps typically used in households and by insect control technicians. Our pest reject ultrasonic Repelled is 100% safe and effective. Naturally drives pests out without killing them. No need to clean up dead insects and pests. Our cockroach Killer creates an uncomfortable environment for pests so they simply leave.",
      "LIFETIME ASSURANCE : Our ultrasonic spider repellent and mice repellent ultrasonic is backed by our Lifetime because we want to help you get rid of those pests and we offer a money back if you don't see results within 4 weeks. Typical results can take 3-4 weeks depending on the amount of infestation. Also perfect replacement for mouse traps, mouse repellent, mice repelled indoor, roach repellent, ant killer, rodent killer.",
      "power source type: Air Powered"
    ],
    "specifications": {
      "Product Dimensions": "6 x 8 x 12 inches",
      "Item Weight": "3.98 ounces",
      "Manufacturer": "Neatmaster",
      "ASIN": "B07SGD72PX",
      "Item model number": "Ultrasonic Pest Repeller Electronic Plug",
      "Customer Reviews": "3.4 out of 5 stars1,110 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "#49,412 in Patio, Lawn & Garden"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Repellents",
      "Pest Control",
      "Garden & Outdoor"
    ],
    "price": ""
  }
}