{
  "website_summaries": [
    {
      "verdict": "Proudly showcasing everything that made the original great, this remastered sports game has cute toy-like visual style, a host of new areas to master, and the option for players to truly challenge themselves via custom-made dungeons.",
      "pros": [
        "Charming remake of the 1993 Game Boy classic",
        "All-new Chamber Dungeon mode for custom dungeon creation",
        "Super Mario monster cameos",
        "Remixed soundtrack",
        "Amiibo compatible"
      ],
      "cons": [
        "Just like the Game Boy version of \"Link's Awakening,\" this is exclusively a single-player adventure"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good game. Not worth $60.",
      "text": "The art style is okay. The depth of field blur is annoying and will probably give people headaches. The core game is still there and still good. I would give it 4 stars but the $60 price point is such greedy money gouging that I can't rate it any higher.",
      "rating": 3.0,
      "verified": true,
      "author": "Ethan",
      "helpful_votes": 236,
      "publication_date": 20190920
    },
    {
      "title": "Not fun",
      "text": "Unlike most other people here, I never played this game before (in the 90ies). Got it for my 10y old to play sth cute and not too violent. This game is not fun to play for her. Too many monsters that can’t be killed easily, and she is constantly “game over”. The controls don’t seem to do much. Lots of dark areas to play in. It’s all very dungeony, not fun for my girl. Lots of skulls and death symbols, aggression, and redundant monologues from characters explaining things over and over. Daughter lost interest within 15 minutes for good. Too expensive at over $60.",
      "rating": 2.0,
      "verified": true,
      "author": "Simone W.",
      "helpful_votes": 49,
      "publication_date": 20190924
    },
    {
      "title": "AMAZING!",
      "text": "Brings back so many memories playing this on the Gameboy Color when I was a kid! The gameplay is so smooth and the graphics are absolutely gorgeous. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "JEXTREME",
      "helpful_votes": 6,
      "publication_date": 20190920
    },
    {
      "title": "Not an immersive game",
      "text": "A completely different experience than Breath of the Wild. I feel like I’m playing a game for 5 year olds. I dislike that this game is not fully immersive. It reminds me of the old days when you observe a character from afar and you can only move them up or down, left and right. Slow and somewhat tedious to play, even my 8 year old has put it away and has gone back to her old BOTW game. I gave it 2 stars because some people might enjoy the ‘Mario’ format of this game.",
      "rating": 2.0,
      "verified": true,
      "author": "Caro",
      "helpful_votes": 3,
      "publication_date": 20190927
    },
    {
      "title": "Fun remake! I wish the shield was on the left hand however",
      "text": "I love this remake of the original. It brings back such memories and is totes adorbs! One thing that would have been nicer would be to use the ZL or L button to do the shield while you swing your sword with your right hand on the B. Trying to hold the R button and push the B button at the same time is awkward. And there are some glitchy graphics things that I hope will be fixed with updates. Other than that, I'm having such a blast!",
      "rating": 5.0,
      "verified": true,
      "author": "Saliandra",
      "helpful_votes": 3,
      "publication_date": 20190922
    },
    {
      "title": "It's exactly what you're expecting.",
      "text": "This is a remake of the first Legend of Zelda game to be released on handheld. Unfortunately, while being able to attack at a diagonal was added (making certain puzzles much less difficult), nothing was done to make the game harder. My biggest grievance was I wasn't expecting a graphically intense game (and it isn't), but why on earth do you get framerate lag every time you go outside?? Surely this is something that should have been identified during testing and fixed. Overall, it's fun, it scratched the itch, but hardly worth the cost of a AAA title.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew Saathoff",
      "helpful_votes": 2,
      "publication_date": 20191030
    },
    {
      "title": "One of the best remakes for a videogame.",
      "text": "This game sets a high standard for those companies that would try to do remakes from old games. The took the story and enhanced it. The game is fun and filled with small details that make you feel engaged to the story and follow a chain of gift exchanges. This is a great game to introduce someone to Zelda's games to gamers of any age and bring good memories for the seasoned ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel EH",
      "helpful_votes": 3,
      "publication_date": 20190923
    },
    {
      "title": "Not worth 60 dollars",
      "text": "This updated version of the game has a beautiful art style and is fun to play. However, there are some drawbacks. Power-ups which drop frequently, have a pace interrupting dialogue the forces you to read it every time. I got tired of this and wouldn’t even pick them up. The frame rate drop is annoying but not game breaking. My worst complaint however, is the length of the game. This title is so short it should have been 30 or 40 bucks. It’s fun but it’s no Breath of the Wild. Wait for a price drop before purchasing this game.",
      "rating": 3.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 2,
      "publication_date": 20190928
    },
    {
      "title": "Fine, but overpriced",
      "text": "As far as remakes go, this is as true-to-the-source a remake of Link's Awakening as you'll ever get. Almost astoundingly dedicated to emulating the Game Boy original. The additional quality of life features are a godsend to anybody that remembers pausing six times on every screen to shuffle boots, feathers, and weapons. That said, even on the Switch there is no excuse for the frame drops this game suffers from. The game looks good, but it doesn't look good enough to justify these performance problems. And while I do applaud them for making such a true-to-the-source remake, the amount of content in this game simply isn't worth the $60 asking price. Frankly, $40 would have been pushing it.",
      "rating": 3.0,
      "verified": true,
      "author": "T. K. Fischer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Reminds me so much of the original",
      "text": "I used to love the original LOTZALA in the gameboy color. I remember beating that game over 10 times and never getting tired of playing that game. So with this updated version of the game for the Nintendo Switch, It really takes me back but because I haven't played the game is such a long time, I have forgotten so many tricks to the game that I have to learn it all over again but it is still worth the play through. This is definitely going to give me some replay value, once I get a chance to remember how to play the game again.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 2,
      "publication_date": 20190923
    },
    {
      "title": "Chibi-style art, but a good revival of an old school Zelda",
      "text": "Right-o. This remake is excellent! Amazing how not having to switch weapons every other screen like it's source game can make a huge difference in game play. More hearts, more warp points, and the build a dungeon make this worthy of its series. They changed the mini-games with more nods to other retro games (mainly Mario). They fixed a few other issues the old game has with the bonus \"Seashell Mansion\" . If one passed a point with the shells you were out of luck. Now it makes it a point to rid of that. plus an explanation on what the mansion is. A little expensive, could maybe loose $10, but still a good game.",
      "rating": 5.0,
      "verified": true,
      "author": "D. D'Agati",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "15hrs of Gameplay is not Worth $60",
      "text": "Honestly I love this game and it’s a nice remake of the original but I regret spending $60 for only 15hrs of gameplay. While the nostalgia of it all is great, again this game is not worth $60 like other games are such as BOTW. If the price were fair I would probably have rated it 4 stars easily.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190927
    },
    {
      "title": "A MUST play for the Switch",
      "text": "Having not played the original Link's Awakening, I was very excited to play through this remake of a classic. I was not disappointed. The world is colorful and takes you in with much to show you. Having just finished A Link to the Past not long before I was itching for some more classic top down Zelda action. This is EXACTLY what you get here. Countless puzzles and secrets to explore and solve. The characters are charming. The music is endearing. The story is captivating.",
      "rating": 5.0,
      "verified": true,
      "author": "Edgar Z.",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Excellent remake. Very small issue I have. Not Major.",
      "text": "Overall i think the game is a solid 9.5. I haven't played the first one in so long it is like deja vu with better graphics. I think the art style fits the game and so far im getting a lot of play time out of it, but not a crazy amount. I would say for someone like me who doesn't remember their way around there is a solid 40 hours here. There is a dungeon mode but I haven't check that out yet. Only issue i have is sometimes there is frame drops. I am hoping they can do an update in the future. It's not game breaking, but it is noticable at times.",
      "rating": 5.0,
      "verified": true,
      "author": "Seth U",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Wrong version",
      "text": "I got the international version and will be returning. Very annoyed!",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 6,
      "publication_date": 20190925
    },
    {
      "title": "Excellent remake!!!",
      "text": "The updated controls, updated music, and of course the updated graphics are all phenomenal in Nintendo's latest redition of Link's Awakening. Being able to make your own dungeons is nice addition too. Not sure if you can share them with your friends though as I've not tried to connect. I never could really get into Breath of the Wild. That just wasn't a true Zelda game to me, but this game definitely is! Nintendo should have released this before Breath of the Wild in the beginning of the Switch's lifespan.",
      "rating": 5.0,
      "verified": true,
      "author": "aztekno2012",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Amazing game, not worth full $60",
      "text": "This game is absolutely beautiful and a very well done remake! Having played the game before, I cruised through the main story, taking my time to appreciate the cute graphics, and finished within a couple days. It’s great they added things like the color dungeon and dampe’s dungeon, but it only adds a few more hours of decent gameplay, even after collecting all hearts, sea shells, and figurines. Personally, I don’t think there is enough content to justify the full price tag.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal Chavez",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Brings nostalgia, and some issues",
      "text": "I loved this game on Gameboy back in the day, and playing through this was an absolute joy, with some caveats. As of a couple weeks from release, it was suffering from framerate issues here and there. Not a real problem, just an odd one given the hardware and relative simplicity of the game. Also, it's shorter than I remembered. It took hardly any time to finish. The same price gets you Breath of the Wild which will keep you busy a LONG time. Long story short, even though I'm a huge fan (content: 5/5), this game should've been priced at $40 and is worth it at that price point.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Ryan",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "A classic Zelda modernized",
      "text": "I actually came to enjoy Zelda games first through playing the original colorless version of this on classic Gameboy. This graphical re-imagining stays mostly faithful to the original, although the color dungeon's prize options make all subsequent sections of the game far easier than they were in the original. Graphic style is beautiful, I wouldn't mind seeing other old Zelda's re-done in the format.",
      "rating": 5.0,
      "verified": true,
      "author": "Drewburt Hofferman",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Beautiful and fun to play",
      "text": "One of the greatest Legend of Zelda adventures of all time updated in a beautiful 3D remaster. I still own the originals so it will be interesting to play through again and see what has changed... Or what I still remember. Just started it up and the intro is wonderfully animated. Gameplay is solid.",
      "rating": 5.0,
      "verified": true,
      "author": "D. W. Carter",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "Adorable and fun, with or without nostalgia",
      "text": "The original Link's Awakening was my very first Zelda experience. To get this remake was such an unexpected joy. The game is adorable and constantly delightful. It plays beautifully and stays faithful to the original's sense of place and character. Whether or not you loved the original, this version of Link's Awakening will brighten your days with cuteness and adventure. Just look how determined little Link is!",
      "rating": 5.0,
      "verified": true,
      "author": "Ky Burton",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "This is a must have.....",
      "text": "This is a must have for any Zelda fan or for anyone who has not yet played this game. The Original and the DX versions are very good games back in the day, but this is a Masterpiece. Do not let this slip thru your fingers. Five stars is way to low to rate this game. Do yourself a favor and get this game. It will suck you in, grab ahold of you, and not let go. Can't say it enough. A true Masterpiece!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shorty",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Worth the buy...",
      "text": "This is a great game it is challenging though so if you have young children perphaps this isn't this best game for them. The graphics are great it seems to be a pretty lengthy game so I think you get your money's worth out of the game. A lot of reviewers said that even after completing the game there are plenty of quests and side stories to do once the game is completed as well. The game lives up the hype it was receiving. You will be pleased if you purchase this game especially if you are a Legend of Zelda fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Berger",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Loved this game, wish there were more like it!",
      "text": "As someone who has appreciated Zelda games but played very few, this game I distinctly remember my sister having for Gameboy and waiting patiently for her to finish so I could play it.... only to have her friend steal it and move away! Once it became available for pre-order I did so immediately. It’s VERY fun, mildly to moderately challenging for someone who hasn’t really played before and the graphics give me all the nostalgia. I recommend spending some time on those mystery seashells *hint hint*",
      "rating": 5.0,
      "verified": true,
      "author": "cableknit",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Nostalgia!!",
      "text": "It is a true to the source material switch port of Link's Awakening DX. Except they swapped the picture quest for a dungeon builder game. Would've rather kept the picture quest and had a fully fledged Mario maker style dungeon builder instead. All in all still loved the game because it is exactly how I remember it except with modern graphics, updated music, and much better controls (less menu-ing). Definitely recommend it if you are new to the franchise or if you played the original and are curious. I thoroughly enjoyed playing through this and will likely play it again soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Brief Review",
      "text": "Pros: Charming graphics, fun gameplay, serviceable story, delightful music Cons: Bad technical performance, puzzles can be unclear and obtuse Conclusion: If you like Zelda you'll see past the flaws, it's a good game",
      "rating": 4.0,
      "verified": true,
      "author": "Rory",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "Love",
      "text": "LOOOOOVE all the updates they made to this game. I wish there were tutorials or something to tell you ALL the new features like shooting a bomb arrow. I had to figure that out myself and only know about it because of early trailers. I don’t want some YouTuber to show me, I want something official like how booklets use to come with every game case.",
      "rating": 5.0,
      "verified": true,
      "author": "Bao",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Blurry (As designed)",
      "text": "Some dummy decided to occasionally blur the top and bottom of the screen by some insane amount. Maybe it would work in handheld mode but on a TV is it nauseating and barely playable. It also suffers from moire and frame rate stutters. How this passed QA is beyond me. Moreover the seller, \"OTL\" sent me the European version instead of the USA version, which is frustrating but appears to work ok for now.",
      "rating": 1.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Awesome game",
      "text": "I'm a newbie at Zelda game, but my is an avid Zelda freak. My wife loves this game and has got me hooked to it as well. I guess I'm a zelda nerd too now. (Lol) The puzzles on this game ate tricky buy fun and makes it very addictive and hard to put down . We have been playing it on the new switch lite and before we know many hours pass without realizing it. The graphics are better than expected and has hours of game play.",
      "rating": 5.0,
      "verified": true,
      "author": "Average man",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Simpleton and laggy",
      "text": "The initial town is 10% of the map, takes a few seconds to walk across, and the game will lag heavily going into/out of a building/zone. An owl tells you exactly where to go every time you enter a new zone or pick up a new item. I hate the owl. And the lag. You will too.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190922
    },
    {
      "title": "10/10 my faviort game remade",
      "text": "Wow it as if they just patched a graphic update on a 20 year old game. It so true to the original that I'm shocked. A few new button combos and a little more options but a must play game",
      "rating": 5.0,
      "verified": true,
      "author": "AaronSki Mac-e-Mac",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "Phenomenal Remake!",
      "text": "I had so much fun with this game! I’m not going to go into detail, because I’m sure you know Zelda games. I had basically all positive experiences, other than occasional frame rate drops as you ever new areas. It only lasts a couple of seconds as the area loads though, so nothing gamebreaking at all.",
      "rating": 5.0,
      "verified": true,
      "author": "mason3750",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Designed to be played handheld",
      "text": "Super nostalgic and entertaining. They retained the best parts of the gameboy version and changed just enough (beyond graphics) to make it fresh. My one complaint is that Nintendo seems to have designed it solely for handheld mode. The framerate gets choppy and things become pixelated on a TV. That; and no use of the dpad - which seems counterintuitive for the whole handheld experience thing they’re going for...? Design and soundtrack are gorgeous though and it’s definitely worth a buy!",
      "rating": 4.0,
      "verified": true,
      "author": "P. Walsh",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Fantastic game, but seller sold wrong version",
      "text": "Careful with your buyers, I thought I was buying this through Nintendo via Amazon, It did not do that. I bought the standard copy, and when it arrived it was the EU Pegi 7 rated copy They are lucky the switch is region free, so its going to work, but imagine if the console wasn't region free? It would of been awhile to wait to return/exchange. So for that i'm knocking a star off for not selling the advertised rating. (but still, the game is great would recommend, just watch whos selling the game)",
      "rating": 4.0,
      "verified": true,
      "author": "Sebastian Curley",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Great game. Didn’t need any additional features",
      "text": "I played this game when it originally came out for the Gameboy. I enjoyed the updated graphics and the gameplay is simple, solid, and well thought out. The added items/features/mini-games and things feel like they were bolted on and detract from what was originally a very solid little game. I ignored them quickly and was annoyed when I would find objects pertaining to them.",
      "rating": 4.0,
      "verified": true,
      "author": "Itsme",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "THERE WAS NO GAME",
      "text": "There was no game inside if it. Most heart-breaking moment of my life",
      "rating": 1.0,
      "verified": true,
      "author": "Josh Mickelson",
      "helpful_votes": 5,
      "publication_date": 20190921
    },
    {
      "title": "Worth your time and money",
      "text": "Such a wonderful remake. The visual design is clean, bright, and interesting. The puzzles and combat are fun and satisfying. I’d agree that as short as it is, it’s expensive when compared to other games, but it is still worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "otterb0t",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "The 90's are back with this Zelda's version",
      "text": "Welcome back to that Gameboy feeling and those 90's game I have so much fun playing this game... It is a lot like Zelda a Link to the past ohhhh the memories! And the fun! I think I played this before but I just cannot remember but in this version is ok... Not like BOTW but please... Yes buy it if you are a Zelda fan",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Romero R.",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Fantastic Remastered Game",
      "text": "I am a big Zelda & Dark Souls/Borne Fan; both series are in my top 10. As a so-called Millennial, I have played video games for 2 decades & change/since preschool... Finally, U can choose hero-mode/HARD-ish difficulty immediately! Now, playing this on Hero difficulty is far, far easier than Sekiro, Nioh, etc. However, Hero difficulty does still offer a little challenge even for gamers like me! Basically, Kids & adults can play an OG Zelda classic, with beautifully remastered, artistically creative, graphics.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Pro: Switch Games are Region free Con: was sent a European copy",
      "text": "I can't take away any stars from this, because it plays and I was able to claim the gold coins for My Nintendo, but it should be noted that product is shown to be a North American copy with the ESRB ratings, but the copy I received has the Green PEGI badge. just don't want others to freak out if and when they get such a copy. debating on getting the European limited edition as well. that steel case is dope.",
      "rating": 5.0,
      "verified": true,
      "author": "James Saylors",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Blur effect at edges are ugly and annoying.",
      "text": "One of the first games I bought (paper route) and beat on my gameboy was Link's Awakening. This game looks great and it's a instant blast of nostalgia.. Except for one thing. The blurring on the edges of the screen drive me nuts, it's almost like watching a movie in wide screen mode. And I hate those. I don't know why they thought doing that blur effect was a good idea, but it's ugly and annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Kuehnau",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Should be Nintendo Switch's Game of the Year",
      "text": "Received today and loving every moment of this remastered classic. Do not hesitate adding Link's awakening to your Nintendo Switch collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Retro collector",
      "helpful_votes": 2,
      "publication_date": 20190920
    },
    {
      "title": "My Girlfriend's a Nerd",
      "text": "Bought it for my girlfriend. She's a nerd. She said it was okay, but it wasn't the greatest Zelda game made. I wouldn't know. I'm not a nerd.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Phelan",
      "helpful_votes": 2,
      "publication_date": 20191029
    },
    {
      "title": "It's a great remake with only a couple issues.",
      "text": "First, this game is pretty short for a Zelda game and the price isn't justified. This should have launched for about $40. There are also some framerate issues, usually when you exit a house or dungeon. The framerate drops quite a bit for about 5 or so seconds. It's not the end of the world but it's noticeable. Overall, though, a great game and a lot of care went into rebuilding it from scratch.",
      "rating": 4.0,
      "verified": true,
      "author": "SilentCaay",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Get this game!!",
      "text": "I got this game when it came put on the gameboy, the dx version on the gameboy color and now the remake on the switch. It looks amazing although I still think link looks a little weird. Its having some framerates issues at launch but I'm hoping itll be patched. Aside from that it's such a trip down memory lane. Oh forgot to mention the reversible cover art is so pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "edgar herrera",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "It was Old, Now it's New",
      "text": "This is a remake of one of the beat Zelda Games of all time. I've played them all from the first to the latest. This was always one of my favorites. It's essentially the same game as the old version for the Nintendo GameBoy with a completely new look and up to the beautiful standards of the Nintendo Switch. If you liked it twenty years ago, you'll like it even more today.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry K",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Left me wanting more for my 60 bucks...",
      "text": "I love this game. I played the original a handful of times through and it's a great game! But..........if you have previously played the original, this revamp MAY leave you wanting more. It's not bad, but it's definitely not worth 60 for someone that's played through the original a few times. Hey, look man...money is hard to come by here in space. Dude, they got us on some weird credit system up here and I grabbed this from the commissary thinking it'd be cool and, well...it is, but it ain't. Good thing Frank was wanting this. I can re-sell it to him for a premium. I may trade him; he's got access to Bran Flakes. Bran Flakes are dope!!",
      "rating": 3.0,
      "verified": true,
      "author": "Space Cadet",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Sweet sweet nostalgia",
      "text": "This was a no brainer purchase for me. The game has all the charm of the old game boy version that I absolutely adored in my childhood. This isn’t a reimagining but an actual remake of the game. It’s the same experience except far more beautiful. And it is beautiful. The visuals. The audio. Nintendo did an excellent job!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie M.",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Keeps the halfling entertained, he seems to enjoy the gameplay.",
      "text": "The gameplay is good for the 10 year old. There are no cuss words in it, at least that I've seen yet, so that's good. The cartoon feel is not as fun for older players (me), I kinda like the Breath of the Wild version better for myself. I should be investing my time more wisely than playing video games or writing pointless reviews anymore though.",
      "rating": 5.0,
      "verified": true,
      "author": "PalatineJoe",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "If you loved the GameBoy original, this is for you",
      "text": "An almost shot-for-shot remake of the original. It's a bit short, and there is very little \"new\" content, but the story and gameplay has certainly held up over the years. The additional buttons on the Switch were put to use to eliminate the tedious item switching of the original. The sword, shield, power bracelet and pegasus boots are now always available.",
      "rating": 5.0,
      "verified": true,
      "author": "The Wilcoxsons",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Mediocre game.",
      "text": "Great game very challenging. Probably my favorite zelda game! Update: At first I loved this game, but after beating it I must say it was quite the disappointment. Very linear, feels like alot is missing and the ending is just nonsense. I am still leaving it 5 stars because it was a gameboy game so set your standards low. By the way where is zelda in this game?",
      "rating": 5.0,
      "verified": true,
      "author": "Retro gamer",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Phenomenal!",
      "text": "So dang good! This is a fantastic upgrade the the original. Its simple but elegant, and one of the best Zelda games there is. If you played the original, or this is a new title for you, i highly recommend picking this up.",
      "rating": 5.0,
      "verified": true,
      "author": "SF176",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "the good old days",
      "text": "This game is an adaptation of one of my original Zelda games. The graphics are perfect, no glitching at all that I experienced. The story can go from easy to difficult depending on how you set up the game. I personally finished the game in 2 weeks but while doing so I took my time understanding and reading the game. Recommended to all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayuyamom",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Amazing game delivered on time",
      "text": "I never played the original game, so I wanted to give this remake a try. I pre-ordered it and got it the same day as release! Having a blast playing so far. It's an incredible game. Really reminds me of a better Link to the Past. The artwork is impeccable. With the same as release day delivery and the quality of the game, 5/5 all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Daigle",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Worth buying",
      "text": "Never played the original game on the gameboy, so this game is very much along the same style as the the first ganr and a link to the past. Not too hard, not too easy, special abilities are metered out so you will to back track. I am 5 hours in and will probably spend 50+ hours on this. My ranking is if i get moneys worth in comparision to dollar per minutes. So yes. At $50/about 50 hours, the answer is a resounding yes.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell L.",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Not what I expected.",
      "text": "I read the first page and it was a bit like reading a script. I expected it to have pictures with identifying points of reference. It is a book of instructions but not worth the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Exactly like the DS game except the animation was waaaaaaaaaaaay better.",
      "text": "I loved this game from the day I got it on DS and now I'm even more pleased. I can play it on my TV with my Switch. I don't know why this isn't one of the most popular games of Zelda? Maybe now it will be. :) Price, service and delivery were all excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Lee",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Game was missing",
      "text": "Is bogus! Not only did I receive a foreign version but the plastic was sliced and the cartridge is missing. So basically I paid over $60 for an empty jewel case. I asked for a replacement. Hopefully I don’t get stuck paying for just a plastic case.",
      "rating": 1.0,
      "verified": true,
      "author": "kaotic",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "One of My Favorite Games",
      "text": "This game was done so well. I love the graphics and how much there is to explore and do in this game. I am not the best at playing video games but this is easy enough to learn and still have fun without getting discouraged when you don’t finish a challenge on the first few attempts!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great game especially if you played the older ones on the super nintendo",
      "text": "Great modern update that's very similar to the super nintendo game. The only gripe I have with it is that when it's loading a new screen or area, the frame rate drops a ton and it's stuttering a bunch for a couple seconds. Other that that, it's a great game and a ton of fun to play.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Sent European version instead of American.",
      "text": "Not as advertised. Sent strange European version instead of American version.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Bell",
      "helpful_votes": 3,
      "publication_date": 20191021
    },
    {
      "title": "a good remake",
      "text": "This is mostly the same as the gameboy version . they have some slow down . They add alot more shells to get the level 2 sword. It look like they did this to stretch the game . Some enemy's are hard to kill and some are way easier. The fire rod was change to magic and no longer kill basic monsters with one hit.",
      "rating": 4.0,
      "verified": true,
      "author": "paul 29",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Very awesome game! Another favorite for sure!",
      "text": "This game is a lot like a Link to the past, Wind waker, and four swords. If you are a fan of these Zelda games then this game is for you. The story is well written, the music is amazing, and gameplay is very good. This is another favorite. Any person who gives this less than 4 stars is silly and doesn’t have an appreciation for Zelda games.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor D",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "If you’ve never played this, you need to give this a try",
      "text": "Love that they did a full remake of this game. By far one of my favorite games growing up as a kid. 100% would recommend those that have never played this to try this out! The revamp looks amazing and plays smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanquoc",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "Fun!",
      "text": "If you were a fan of the original Legend of Zelda on the NES than you will likely love this game too. I couldn't stop playing it, even when my kids wanted to try it. They liked it too, but kids these days are wired differently so they weren't hooked like I was. Still a very fun game.",
      "rating": 5.0,
      "verified": true,
      "author": "zed",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Best Zelda game in a while!!!",
      "text": "This is the most fun I have had in awhile with a Zfa game!!! This game takes me back to my game boy and the original version. They have adapted it to a modern \"Link to the Past\" feel with the keepingtrue to the original storyline. Love it. Will play this more than one time!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel T.",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Disappointing for a Zelda title",
      "text": "I have absolutely LOVED the Zelda series from the beginning. That said, this title was disappointing for me. I found the storyline to be very transactional, and it didn’t really add anything to the series – lots of repeat elements from the original Legend of Zelda on the NES.",
      "rating": 3.0,
      "verified": true,
      "author": "Bernie",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Childhood Masterpiece!",
      "text": "Ahh my the childhood game/memory now in HD. And the music is just amazing. 😩🤩 (Tho the OG is great too.) Liking the new added content and I'm totally missing the content that was taken out too (like the photography!) Overall great game definitely worth playing!",
      "rating": 4.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Maybe nostalgia is the key here?",
      "text": "I’ve never played the original GameBoy version and didn’t realize this was an update/remake. It feels short and childish compared to newer Zelda games across newer platforms.",
      "rating": 2.0,
      "verified": true,
      "author": "Leo's Library",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "It's a good remake of a classic",
      "text": "I enjoyed this more then the person I gifted to. My son has done alot with breath of wild so I assumed this was a natural fit. But he has struggled with the games lack of direction and relatively small areas. He stopped playing only after a few days.",
      "rating": 4.0,
      "verified": true,
      "author": "The Magnus P",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Absolutely fantastic!",
      "text": "I absolutely loved this game! I never played the original on GameBoy, but I will say the redone graphics were amazing! It was extremely nostalgic and everything I've ever wanted from a Zelda game. Giving me feelings of old, and loving the old style dungeons with a 3D perspective. I would highly recommend this to any Zelda fans, especially those of the old school games.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty Roeben",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "False advertising",
      "text": "Great game I'm sure, but I won't be opening mindle, seeing as how they sent me a European version when it clearly states, that you will receive a version rated E, nowhere at all does it state once that you will receive anything but a North American copy of this game.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "links awakening - remake awesome.",
      "text": "A lot has changed since the old gb release. Giving the game a new feel, quests are more direct, and it's easier to keep track of what your doing. All of the iconic characters still exist in this version, as some of you will recognize from Mario. Great game.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercy",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Fine",
      "text": "I love Zelda games. I’ve been working through the backlog of old ones because I want a fuller picture of the gaming experience—and this game was. Fine. It was fine. But it sure as hell wasn’t worth $60. For that price, go buy another Zelda game, like Breath of the Wild or, if you’re more a linear Zelda fan, Ocarina of Time (the remake fixes a softlock problem, it’s nice).",
      "rating": 3.0,
      "verified": true,
      "author": "Alex W",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Beautiful but choppy",
      "text": "This game is beautiful and fun when it's running smoothly; however, this game has some very frequent and distracting frame rate issues. I'm playing the cartridge version of the game in handheld mode, so that may have something to do with it, but I can't say I can recommend this game at full price with the current issues. Some folks can tolerate frame rate issues more that others, so I'd recommend researching this before committing to paying full price for this game.",
      "rating": 3.0,
      "verified": true,
      "author": "Random Penguin",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "My favorite game on the switch right now",
      "text": "So far the game is quite good. The story line is amazing. I played the original game and it was slightly confusing but they remade it into something that makes more sense. I recommend this game to anyone who just wants to sit back, relax, and enjoy themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "MrJasty",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "Not worth the money",
      "text": "This is a straightforward remake with very little content. A game from 1993 is not worth full price whether they pretty it up or not.",
      "rating": 2.0,
      "verified": true,
      "author": "PigeonBuddy",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Awesome Zelda adventure",
      "text": "Fun game, came quickly and in perfect condition. As I'm a videogame collector the condition the videogames arrive in matter alot to me. Great game, and great seller, would buy from this seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "@relativitycraft",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "A classic updated right!",
      "text": "I've always loved this game on GB color and was so excited when I heard it was coming to Switch. I was not disappointed with the update. The game is great! The only downside is that playing it on a console makes you realize how short the game is. Oh well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob E. Sammer",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Link's Awakening with a Fresh Coat of Paint",
      "text": "A faithful recreation of the Gameboy classic. I absolutely adore the 3D model reimagination of the original game and it demonstrates that the classic game play holds up like a champ! Some minor performance issues for the game, but nothing that tarnished the experience for me in the slightest. Highly recommended if you're a fan of Zelda games, and especially if you love the 2D style Zelda games!",
      "rating": 5.0,
      "verified": true,
      "author": "Alvaro Cardoza",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "A fun adventure for all.",
      "text": "Loved this game growing up. It was fun to relive those memories as an adult on the switch. The new graphics are really nice as well. Small extra things added that make it slightly different than the original but pretty much the same game from the past. A fun classic.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "A nostalgic fantasy adventure reminiscent of gaming days of yonder past.",
      "text": "A beautiful adventure in a familiar land for those who played the original, like me. As many others say, it's a rather faithful recreation of the original Link's Awakening DX, but with modern refinements. I loved it, and it doesn't require too great of a mental energy or time investment to get through it. What am I supposed to do with this can of dog food again...?",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin L.",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Good Game",
      "text": "Fun game. I got into Zelda through BOTW and this is a nice addition to that experience. It was captivating and I ended up getting close to 100 percenting the game but quit with the dungeon building challenges which is the most tedious and boring part of the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "What a fantastic remake, family loves it!",
      "text": "My son beat it twice, my daughters been playing it and love it. Great remake, graphics are wonderful and great to play on the big screen. Truly have enjoyed this title very much. Pleased as the dikens, not much else to say.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea K",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great game",
      "text": "Amazing game, I loved it as a kid and I still remember all the story line, tho there are some slight differences. Really don't think the price was fully worth it, I mean they did have to code from scratch, but everything is about the same story wise. Updates for artwork, obviously, and music, but this AA game pricing isn't quite there, especially when you can't share the dungeons online. Great nostalgia bonus which topped it into 5 stars for me",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Game play short",
      "text": "Weak version of a classic game. Do not waste your money. Beat this one in record time. Were they in a rush to release it?",
      "rating": 1.0,
      "verified": true,
      "author": "Tim 😳🥺💸& His Princess 💵👜🛒💳🛍😘",
      "helpful_votes": 2,
      "publication_date": 20191004
    },
    {
      "title": "MEMBER?!",
      "text": "I wasn't expecting such a true remake of the game. I had come to terms that the map/dungeons might change and have different mechanics. I was surprised and impressed at how accurate 99% of the puzzles and designed remained so distinctive after all these years.",
      "rating": 5.0,
      "verified": true,
      "author": "Brazil89",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Breathing life back into a classic",
      "text": "Link's Awakening was the first LOZ game I ever played back in the mid 90's and this is a wonderful take on a classic. The only qualms I have is the $60 price tag for a 10ish hour game, but I gladly paid the price because nostalgia. Highly recommend for anyone who never played the original or someone looking for a new Zelda game to hold them over until the next BOTW.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Meh!",
      "text": "Just finished and all I can think is I'm glad to be done with this game. Was more of an exercise in frustration than the joy of previous Zelda's. Apologies to those who like the game and style. Just couldn't get into the game play, characters, or much else other than it's on the Switch. While Breath of the Wild is easily one of of the best games I've ever played, Link's Awakening can't hold a candle. Strong execution, weak game.",
      "rating": 2.0,
      "verified": true,
      "author": "Blue",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "No game inside",
      "text": "Well I'd like to say it was a hit on x mas, but when they opened the factory wrapped game case there was no game cartridge inside :( what a bummer.",
      "rating": 1.0,
      "verified": true,
      "author": "jenn",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Just pure fun, buy it if you're a Zelda fan. You'll enjoy it",
      "text": "Phenomenal remake of a classic Zelda. This was honestly an incredible experience playing start to finish. Anyone who loved the Gameboy version will be blown away here. If you never played the original version this is a treat for you as learning the way through the game will be challenging yet fun. As a warning, people say the game is short. It took me about 70 hours to beat. In my opinion it was well worth it as the game was just so fun and beautifully made. If Nintendo remakes all Zelda like Links Awakening, I'd buy them all lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "A definite improvement",
      "text": "I grew up with Oracle of Ages/Seasons. When I tried to go back with Link's Awakening it seemed like a borderline unplayable version of Oracles. With this remake, it is really nice. You can always use the sword/shield and dash without having to equip items. The overworld is all one map without the area panning and getting lost. The map has some functionality and your conversations are archived. Really pleased with the game. Gotta say though, $60 for a 2D game is kinda steep. Really hoping they give Oracles the same treatment, maybe in a twofer cart.",
      "rating": 4.0,
      "verified": true,
      "author": "Connor K",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Fun, Cute, Nostalgic",
      "text": "This game is a pretty nice \"updated\" type version of the older Link games. I'm enjoying playing it but for only like 20 hours of story game play $60 is a super steep price to pay.",
      "rating": 4.0,
      "verified": true,
      "author": "Car710",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Love nostalgia? Love games? Pick this up!",
      "text": "Loooove it! Man, the nostalgia on this game is amazing. It's a beautiful, fun game. I have way too much time on my hands, so I beat it too soon, but there are a few things to get even after beating the main story.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Still fun, just short",
      "text": "Perfect for beginners in the Zelda franchise. Not challenging at all for more experienced players. I finished it to completion in a weekend. Fun but short",
      "rating": 3.0,
      "verified": true,
      "author": "Douglas Vedeloff",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Great game",
      "text": "I played the old one for the gameboy color so seeing this was a trip down memory lane. They did more than give it a facelift by making several changes to the map and items as well as the mini games. It was almost a whole different game. A+ from a long time zelda fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Masterpiece",
      "text": "You liked the original game? You'll like this one. You never played the original game? You'll like this one. You own a switch and have never heard of what even the heck a dang Zelda is? You'll like this one. It's fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Fun and Challenging",
      "text": "Challenging in the best way. Makes most games seem very \"Linear\" compared to this classic remake. Graphics look nice on both TV and Handheld screen. Some frames drop in 1080p docked mode, but not drastic enough to kill the experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike T.",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Absolutely Amazing!",
      "text": "Amazing remake of an already fantastic game. Grezo never fails to create solid remakes of these Zelda titles. Hands down one of my very favorite Zelda games ever and such a fun game to play.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Haynes",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Very enjoyable game.  I couldn’t put it down until it was complete",
      "text": "I love all the link games in the past. This game is awesome. I was hooked on this game for over a week until I completed it. My sons, 8 and 5 years old enjoy this game as well. The five-year-old just likes to explore the world.",
      "rating": 5.0,
      "verified": true,
      "author": "Sal H",
      "helpful_votes": 0,
      "publication_date": 20191209
    }
  ],
  "product_meta": {
    "title": "Legend of Zelda Link's Awakening - Nintendo Switch",
    "description": "Platform:Nintendo Switch| Edition:Standard“Castaway, you should know the truth!”\n\nAs Link, you awaken in a strange land away from Hyrule, where animals talk and monsters roam. To uncover the truth behind your whereabouts and rouse the legendary Wind Fish, explore Koholint Island and all its trap-ridden dungeons, reimagined in stunning detail for this new release of one of the most beloved The Legend of Zelda games. Along the way, you’ll meet a hilarious assortment of charming characters to which you’ll never want to say goodbye.\n\nIn this new version of the game, the classic soundtrack has been reborn with new arrangements, and now you can equip more items at once, review key conversations, and navigate the map in new ways. Try your hand at the renovated mini-games to earn dolls based on the Super Mario series…or Chamber Stones. These unusual stones can be used to arrange your own Chamber Dungeons; each one is a puzzle in and of itself! Place chambers from dungeons found throughout the game on a series of objective-based grids… Where should the bosses go? How do you get from the entrance to the stairwell? They’re your dungeons, so arrange them however you see fit. To earn more Chamber Stones, you must conquer the main adventure’s dungeons and mini-games or tap any amiibo featuring a The Legend of Zelda character to unlock Chambers exclusive to amiibo.​\n\n1993-2019 Nintendo. The Legend of Zelda and Nintendo Switch are trademarks of Nintendo.",
    "rating": 4.8,
    "feature_bullets": [
      "As Link, explore a reimagined Koholint Island and collect instruments to awaken the Wind Fish to find a way home",
      "Explore numerous dungeons, riddled with tricks, traps, and enemies, including some from the Super Mario series",
      "Meet and interact with unique locals to get help on your adventure",
      "Listen to a reawakened soundtrack that helps bring life to Koholint Island",
      "Earn Chambers (Dungeon Rooms) and arrange them to complete objectives in the all new Chamber Dungeon"
    ],
    "specifications": {
      "ASIN": "B07SG15148",
      "Release date": "September 20, 2019",
      "Customer Reviews": "4.8 out of 5 stars8,364 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#237 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "0.4 x 4.1 x 6.6 inches; 2.08 Ounces",
      "Binding": "Video Game",
      "Rated": "Everyone",
      "Item model number": "HACPAR3NA",
      "Item Weight": "2.08 ounces",
      "Manufacturer": "Nintendo",
      "Date First Available": "December 31, 2018"
    },
    "categories": [
      "Nintendo Switch",
      "Games",
      "Video Games"
    ],
    "price": 59.99
  }
}