{
  "website_summaries": [
    {
      "verdict": "A convenient, user-friendly device that helps remove fat without pain.",
      "pros": [
        "Designed to break down fat, so it’s removed through the lymphatic system as an alternative to liposuction",
        "May offer results in as little as a month",
        "Pain-free operation doesn’t result in skin or tissue damage",
        "Features a compact design, so it’s highly portable"
      ],
      "cons": [
        "Operation is fairly loud, and some users experience ringing in the ears"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not a true cavitation machine!!!!",
      "text": "Device brand new and neatly packed. Device is not a true cavitation machine. Device will shock skin even with the use of ultrasound gel. Unable to go past first setting without extreme discomfort! True cavitation creates a ringing or buzzing sound in ears when device is applied to skin. Will be returning!",
      "rating": 1.0,
      "verified": true,
      "author": "ciara bryant",
      "helpful_votes": 40,
      "publication_date": 20200123
    },
    {
      "title": "Cavi",
      "text": "Purchased the machine for home visits on clients. It worked extremely well. Yes it’s noisy but the machine is strong. I saw the results on the target area I was working on. Only problem after using it 4x it stopped working. The machine did not fall, the machine was kept nicely secure. It just stopped working on the 4th use. I have recommended the machine to abt 4 ppl.",
      "rating": 4.0,
      "verified": true,
      "author": "Sach",
      "helpful_votes": 24,
      "publication_date": 20200207
    },
    {
      "title": "Love it!!",
      "text": "What I dislike about this machine is the loud noise. BUT i love he results my clients are getting and because my business is Mobil, it is very easy to travel with!",
      "rating": 5.0,
      "verified": true,
      "author": "Trubeauti",
      "helpful_votes": 23,
      "publication_date": 20191023
    },
    {
      "title": "Easy to use",
      "text": "Bought this for a friend. She loves it. She says it works great",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Perea",
      "helpful_votes": 10,
      "publication_date": 20191104
    },
    {
      "title": "It’s broken",
      "text": "It makes really loud noise and doesn’t do anything. Im gonna return it. I think it’s broken",
      "rating": 1.0,
      "verified": true,
      "author": "Tomoko Corn",
      "helpful_votes": 10,
      "publication_date": 20190903
    },
    {
      "title": "Fat burner machine",
      "text": "Makes a very loud buzzing noise but doesn't do anything for your body/skin.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20200204
    },
    {
      "title": "It’s a good purchase but make sure to follow instructions!",
      "text": "I like that it saves money from spa visits but at first it’s a bit intimidating to use . Always apply gel first and don’t miss a spot .",
      "rating": 3.0,
      "verified": true,
      "author": "Cheree C.",
      "helpful_votes": 2,
      "publication_date": 20200611
    },
    {
      "title": "Works great",
      "text": "1st treatment already noticed a small difference, this product works great! It’s pretty loud though and it gets louder the higher the intensity.",
      "rating": 5.0,
      "verified": true,
      "author": "James G.",
      "helpful_votes": 3,
      "publication_date": 20200117
    },
    {
      "title": "Annoying sizzling sound",
      "text": "I personally didn’t like it because it makes a loud Sizzling sounds compared to other ones. I never felt it heat up",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Vega",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Great Product",
      "text": "I love this machine. It is reasonably priced and it does a great job. My body looks amazing after cavitating. You will love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda Brown",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Less than 6 months stopped working",
      "text": "Don’t order!!!! Worked for 4 months then stopped working. Contacted seller And no help! Pay a Lil extra for the better machine Don’t waste the money",
      "rating": 1.0,
      "verified": true,
      "author": "Vertical Swiss",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "NEVER WORKED! In addition ZERO CUSTOMER SERVICE!!",
      "text": "This item NEVER WORKED!! Wouldn’t even heat up! I got zero responses when I sent information request. It LITERALLY IS THE WORST MONEY I HAVE EVER SPENT!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ginger Hall",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Machine no good",
      "text": "My machine not working I reached out but never heard back never was able to use it",
      "rating": 1.0,
      "verified": true,
      "author": "Melinda",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Poor Quality",
      "text": "This product doesn’t work. Does not heat up. Don’t buy waste of money. I sure will be returning",
      "rating": 1.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Bad product",
      "text": "I used it only a couple of times and now is broken and there is not way to return it 😡",
      "rating": 1.0,
      "verified": true,
      "author": "ZIPATLY YACMINA FLORES TURCIOS",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "After three weeks and my \"fluff\" is under control!",
      "text": "I've been using this for about three weeks and have noticed a big difference in my fluff. I've also been using a sculpting gel after each treatment followed by some home exercises. Def worth the money and you can do as many treatments as you want. Don't forget to drink plenty of water afterwards!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Wilson",
      "helpful_votes": 3,
      "publication_date": 20200209
    },
    {
      "title": "Don’t buy",
      "text": "The plug connectors do not match or fit together. Therefore you cannot use the device. I would like the correct adaptation but returning to amazon and now they say cannot send me a new one. I want my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "linda g",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "My machine does not do anything",
      "text": "The machine I received does not work. I inquired about no noise and no vibration when turned on. The answer was that I needed to adjust the intensity or e-mail the seller if that did not work. There is no difference with intensity level and the e-mail address was not provided with the answer so i cannot further inquire.",
      "rating": 1.0,
      "verified": true,
      "author": "g",
      "helpful_votes": 0,
      "publication_date": 20201102
    },
    {
      "title": "Did worked and actually see results nut over heats easily.",
      "text": "Really worked great the first 2-3 weeks but yes as the other reviews say machine over heats on it's own. Also made no loud noise but once it's not working it will make aloud shirping sound and no heat at all. The creators need to work on its wires because this machine worked wonders and you can actually see the difference but as I read all the reviews the machines stops working on its own/ over heart.",
      "rating": 3.0,
      "verified": true,
      "author": "Esmeralda lopez",
      "helpful_votes": 0,
      "publication_date": 20201210
    },
    {
      "title": "Does this machine have the ringing effect in the ear while using on the body?",
      "text": "This mavhine have the ringing effect in the ears when using on the body?",
      "rating": 5.0,
      "verified": false,
      "author": "Gasha S.",
      "helpful_votes": 3,
      "publication_date": 20190823
    },
    {
      "title": "waste of money",
      "text": "Device does not work. After several uses the ultrasonic vibrations become weak. Don't waste your money!!!!",
      "rating": 1.0,
      "verified": false,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Can you use this to your face and under your arm ?",
      "text": "I saw this equipment at the spa we’re I go for facial",
      "rating": 4.0,
      "verified": false,
      "author": "mara vera",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Helpful Information",
      "text": "I am a licensed esthetician and my review is to hopefully help someone looking to buy 40k Cavitation. 1. Ultrasound makes a buzzing/bubbling effect when water is applied to the plate. 2. Ultrasound only helps with product penetration 3. Ultrasound will not have a ringing sound in the ear when applied to the skin. 4. True Cavitation will not buzz or make water droplet on the plate bubble or spray. 5. True Cavitation will give you a ringing/buzzing sound in the ear once applied to the skin.",
      "rating": 3.0,
      "verified": false,
      "author": "Jamie Lyen",
      "helpful_votes": 23,
      "publication_date": 20191113
    }
  ],
  "product_meta": {
    "title": "Body Fat Burning, Enshey Anti Cellulite Skin Tightening Machine Beauty Tools",
    "rating": 3.6,
    "feature_bullets": [
      "🍉 This device helps in tightening and lifting skin, also promote skin blood circulation. Effective in reducing weight and resolve fat under skin.",
      "🍉 Effective to remove cellulite and helps parturient to solve problems like sagging belly after childbirth.",
      "🍉 This weight reducing device can be a alternative of liposuction. Helps users to relax and massage their skin and muscles.",
      "🍉 85% resolved fat will be channeled out of body through lymph system, 15% fat will be translated into sugar via liver to support man’s daily activities.",
      "🍉 This weight losing method enjoys the feature that zero hurts to skin tissues and lymph. It helps user to shape you a dream figure."
    ],
    "specifications": {
      "Package Dimensions": "13.27 x 10.39 x 4.17 inches; 5.23 Pounds",
      "UPC": "192240624037 192240624020",
      "Manufacturer": "Enshey",
      "ASIN": "B07S467N5F",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tools & Accessories",
      "Skin Care Tools",
      "Beauty & Personal Care"
    ],
    "price": 138.99
  }
}