{
  "website_summaries": [
    {
      "verdict": "Inexpensive, versatile, and responsive, this is an excellent entry-level drawing tablet for novice digital artists.",
      "pros": [
        "Thin, yet durable",
        "Convenient mechanical wheel/trackpad for making fine adjustments",
        "Compatible with a wide collection of creative software",
        "Responsive pen",
        "Great value"
      ],
      "cons": [
        "The sensitivity of the wheel may take time to get used to"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Price/design/performance/feature-wise hard to beat!",
      "text": "I have used Wacom tablets in the past, and this one performs quite similar to them. The drivers work both in Windows 10 and Linux withouth hiccups (so far). I've tested it in ArtRAGE, Krita, Painter Lite, Sketchbook, Inkscape, CorelDRAW, ... and it works fine with any of them. Notice that the controls work a little different in Windows and Linux (Linux interface is rougher, and a little less polished). The two-wheel HMI is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "My grandson likes it",
      "text": "It was a gift for my Grandson for Christmas he is enjoying doing many things with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181229
    },
    {
      "title": "They can do better...",
      "text": "Pros: The design is nice, I like that it has the blue light ring, it is thin, the touch feels good, the pencil hardly weighs and is comfortable to use. Cons: the cable ! Why didn't they make her wireless? It's absurd that it's the brand's pro and keep using wires! Another thing I don't like is that there's no option to scroll, if you don't use a mouse like me and use the tablet for anything I'd missed the scrolling feature I had in wacom years ago. Pencil when you use slanted usually does not work the click. Overall it is a good tablet for the price, it would be perfect if only it were wireless!",
      "rating": 4.0,
      "verified": true,
      "author": "Juanfer ibarra",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Perfect gift",
      "text": "Bought this for my 12 year old who loves to draw. She is very happy with this product and so am I. Nicely packed and easy to set up. My daughter did it on her own. It's a good option for beginners.",
      "rating": 5.0,
      "verified": true,
      "author": "candicelee",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "stopped working after one week use",
      "text": "after one week of use ...issues began when i write on the tablet for a moment it draws suddenly it will stop drawing on the screen ..even i contacted them they say its a pen issue but i bought 2 i tested with other pen it was same issue ,the issue was with the tablet...and because i am out side USA i was not able to return it and get refund -_-",
      "rating": 1.0,
      "verified": true,
      "author": "shko18",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Try a better tablet..",
      "text": "I have been using the tablet for a few weeks and I get an issue in Photoshop that requires me select a tool other than the paintbrush multiple times and then select back and forth between brush until it works again if I take the pen away from the tablet. It is frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacob James",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Love it!",
      "text": "Fun to use. I'm a beginner so it took a couple minutes to get used to it, but it works great. Product is exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrsb",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Fantastic for beginners!!!",
      "text": "I've been drawing with the traditional pen and paper for years but recently wanted to try my hand at this whole digital art thing so I bought this as it's reviews were great and it seemed to have a simple enough design, and I LOVE IT!!! I've onlt had it for a few hours but I've already gotten the hang of it using it with a free art program called Krita. I highly recommend this product to anyone wanting to start trying to make digital art.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer ",
      "helpful_votes": 14,
      "publication_date": 20191212
    },
    {
      "title": "Fun and easy to use",
      "text": "This drawing tablet is so easy to use! My daughter loves it. We tried others that were more expensive but couldn't even set them up. The only issue we ran into was we had to buy a USB adapter since my daughter's computer doesn't have a USB connection. Other than that, great tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Jimenez",
      "helpful_votes": 8,
      "publication_date": 20200116
    },
    {
      "title": "Great tablet, for beginners or for people who have drawn for awhile.",
      "text": "Great tablet, very smooth and works well. Buttons are easy to set up to what best fits you. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Awesome",
      "text": "My wife, a graphic designer, enjoys it very much and found the very accurate easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "dvashdi",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great item",
      "text": "Bought this for my 11 year old son and he is drawing amazing things on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Vasquez",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Very happy with the product",
      "text": "Got extra glove [besides the glove in the box] , dust brush and dust cloth as gifts with he package. The tablet is working really well. 10/10 marks!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Great for school",
      "text": "I've started taking notes on my windows PC instead of in notebooks and this tablet is perfect for it. I don't do much drawing but for what I need it for and the price, I'd say it's worth it. I just wish the cable was a little longer, but I don't doubt I can get a usb extension.",
      "rating": 5.0,
      "verified": true,
      "author": "dominic oppedisano",
      "helpful_votes": 0,
      "publication_date": 20201113
    },
    {
      "title": "Awesome",
      "text": "Easy to use great value for the money comes in perfect for virtual teaching",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth barnak",
      "helpful_votes": 0,
      "publication_date": 20201210
    },
    {
      "title": "A decent tablet but still a bit pricey. Price changes too much and gets too high.",
      "text": "I'd buy another but the price is a bit higher than say, Huion. If any more promotions pop up I'll consider this again.",
      "rating": 3.0,
      "verified": false,
      "author": "Ephreview",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "FIRE HAZARD Do not buy this",
      "text": "I have been using this tablet regularly. I disconnected it from the power source and put it on the shelf. The USB type connector was still on my desk near my plastic monitor stand. Later that evening my wife and I went to bed. A few minutes later we were up smelling smoke. The usb power cord was melting the monitor plastic.",
      "rating": 1.0,
      "verified": false,
      "author": "M. Putt",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Crap",
      "text": "The tablet is awesome but the pen is crap. The pen will just stop working and you can’t do anything. I contacted the company by email and got no reply! So I decided to buy a new pen because I like the tablet and it fixed the problem for about 2 weeks and now back to not working. Nothing but crap don’t buy this. Just bite the bullet an go with Wacom brand you get what you pay for",
      "rating": 1.0,
      "verified": false,
      "author": "Amanda L Senn",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Tablet works great and the seller is amazing.",
      "text": "Mead an issue with the tablet. Where pressure was dropping. Talked with xppen, it was my graphics drivers after updating it ran fine. Not sure why that affected it.",
      "rating": 5.0,
      "verified": false,
      "author": "Monochromemoose",
      "helpful_votes": 8,
      "publication_date": 20200323
    },
    {
      "title": "Solid. Beautiful. Functional.",
      "text": "Beautiful designed tablet but its not just all looks. It works so accurately and has a couple of cool features that make it even better to use. The pen is a bit plasticky, doesn't look too durable and I'm afraid because I keep dropping it but the tablet itself looks and feels solid. Considering the price, this tablet is value for money.",
      "rating": 4.0,
      "verified": false,
      "author": "Alroy N.",
      "helpful_votes": 0,
      "publication_date": 20191003
    }
  ],
  "product_meta": {
    "title": "XP-PEN Deco Pro Medium 11x6 Inch Digital Graphics Drawing Tablet Ultrathin Digital Pen Tablet with Tilt Function，8 Shortcut Keys，Battery-Free Stylus 8192 Pen Pressure",
    "description": "Color:Black-Medium Specifications: \nDimensions: L350.8x W199.5x H16.5mm (thinnest Height 7mm) \nActive Area: 11\"x6\" \nTilt: 60 Degrees \nPen: Battery-Free Passive Stylus \nPressure Sensitivity: 8192 Levels \nResolution: 5080 LPI (Lines Per Inch) \nMechanic Wheel: 1 \nVirtual Wheel:1 \nShortcut Keys:8 \nIndicator Light:1 \nAccuracy: ±0.01 Inch \nReading Height: 10mm \nColor: Black and Silver \nPower Voltage: DC 5V \nInterface Support: USB Type-C \nCompatibility: Windows 10/8/7(32/64bit) and MAC OS X 10.10 and above \n\nPackage Includes: \n1x Deco Pro Medium Tablet \n1x Battery-Free Stylus \n1x Pen Holder \n8x Replacement Pen Nibs \n1x USB-C to USB Cable \n1x USB to USB-C adapter \n1x USB to micro USB adapter \n1x Drawing Glove \n1x Quick Guide",
    "rating": 4.4,
    "feature_bullets": [
      "DECO Pro is our first creative pen tablet to date, it is the winner of the 2019 Red Dot Design Award and the winner of the 2018 Good Design Award, redefining the professional standard in creative pen tablets! DECO PRO graphic drawing tablet, features 11 x 6 inch large active drawing space provides users with larger space to draw, bringing users a more enjoyable working experience of the digital tablet.",
      "XP-PEN Deco Pro features the new groundbreaking double wheel interface, double wheel design paired with trackpad functionality creates an improved experience for professional level creation.The scroll wheel is equipped with an indicator that adjusts the brightness and can be created even in the dark. It also features 8 responsive shortcut keys, to be customized according to your own creative habits. it's easy to set and easy to use.",
      "The XP-Pen Deco Pro supports up to 60 degrees of tilt function,You can find a perfect and comfortable position by dragging the switch to adjust the angle of pen display .New pen technology supports 8192 levels of pressure sensitivity, tilt response and virtually lag free tracking.And the newly designed A41 battery-free stylus, no batteries or charging is ever required, To reduce the cable clutter.",
      "8192 pressure sensitivity allows you to draw accurate lines of any weight and opacity according to the pressure you apply to the pen, sharper line with light pressure and thick line with hard pressure, perfect for artistry design or unique brush effect for photo retouching. Deco Pro comes with a multi-function pen holder to keep your pen and pen nibs safe. Now comes with 8 replacement nibs.",
      "Android Phones and Tablets Supported. XP-Pen Deco Pro is compatible with Windows 7/8/10, Mac OS X 10.10 or above and Android devices 6.0 or above, and works with most major creative software including Photoshop, SAI, Painter, Illustrator, Clip Studio, and more.XP-Pen provides a one-year warranty [warranty only valid under the situation that damage is not caused by man-made] and lifetime technical support for all our pen tablets/displays."
    ],
    "specifications": {
      "Package Dimensions": "16.69 x 9.13 x 1.77 inches",
      "Item Weight": "3.17 pounds",
      "Manufacturer": "XP-PEN",
      "ASIN": "B07S94Y7WD",
      "Customer Reviews": "4.4 out of 5 stars103 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#286 in Computer Graphics Tablets",
      "Date First Available": "August 22, 2019"
    },
    "categories": [
      "Computers & Accessories",
      "Graphics Tablets",
      "Computer Accessories & Peripherals",
      "Input Devices",
      "Electronics"
    ],
    "price": 129.99
  }
}