{
  "website_summaries": [
    {
      "verdict": "The Status Audio BT One wireless headphones deliver strong audio in a handsome design for a surprisingly affordable price.",
      "pros": [
        "Robust bass depth matched by solid high-frequency clarity",
        "Comfortable on-ear design",
        "Excellent mic performance",
        "Cable included for passive listening"
      ],
      "cons": [
        "Volume and track navigation buttons are combined"
      ],
      "aspects": {},
      "publication_date": 20191008,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Decent on ear headphone",
      "text": "Bought these on a recommendation fro a friend and they also seemed to be well reviewed on some tech sites. Decent sound scape for listening to music - improved if you have quality original sound source. Big tick on that, and good charge length. BUT, if looking for something to do calls on too, i'd look elsewhere, unless sounding like your speaking whilst drowning is what you're going for. Also, you cant walk v far away from your source before things start cutting out.",
      "rating": 4.0,
      "verified": true,
      "author": "Informationoverlord",
      "helpful_votes": 2,
      "publication_date": 20200612
    },
    {
      "title": "In every way better than any I have had",
      "text": "Super comfortable, super quality and very long lasting battery, however what is extra special is if you run out of battery while using and can’t charge immediately, just plug the headphones in with the lead provided and Away you go. If you buy it you will love it. The only downside was that I ordered the brown one and got a black one. They are sealed in the packaging from the factory which says brown on the box but when you open it mine was black and others have reported it also. I would definitely buy again even if I get the wrong colour again.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Such a shock !",
      "text": "I bought these to allow me to use the PC while my wife was watching the television so my expectations were not very high but..... The first time I paired them to the PC (Easy) the first thing I tried was spectacular. The sound quality is superb for the price. I would recommend them very highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Labrador lover",
      "helpful_votes": 2,
      "publication_date": 20200103
    },
    {
      "title": "Bit big for my head",
      "text": "While I have no complaints about the sound quality or the overall comfort, they were unfortunately a little bit big for my head. I don't actually have a particularly small head either, so that was a tad strange. The on / off switch and volume buttons were a little small and fiddly also. The connection however was great, and battery life was exceptional. If they had fit better, I'd have kept them, as it was, I got a refund.",
      "rating": 4.0,
      "verified": true,
      "author": "Haribo",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Very good",
      "text": "Comfortable, stylish (I purchased the 'tan' colour). Easy pairing - but the headphones buttons are a little fiddly, although one gets used to their position. Bluetooth range is superb - we live in rambling house with thick, robust' internal walls, but I can achieve some 30 feet range, not a problem as I use the headphones for my TV via Amazon. For my Surface Pro laptop, I use the audio lead.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilles",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Brilliant sound and quality.",
      "text": "If you want Bluetooth headphones for under £100 buy these. They are absolutely brilliant / and I’m fussy. Great bass without being boomy and clear treble and midrange. They have power balance and clarity. They’re lightweight fold away and come with a nice sturdy case. I’d buy a second pair as a gift or backup!!",
      "rating": 5.0,
      "verified": true,
      "author": "peter-c",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Status Audio BT One Wireless Headphones (Jetblack)",
      "text": "I am so happy with these headphones. I find them very comfortable to wear, they come with a nice box for when your travelling. The sound quality is amazing. I purchased these to use with my Audible Kindle. Would highly recommend these headphone s to all my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Butterfly12",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Wrong colour sent",
      "text": "Ordered the Umber, had Umber barcode on a Jetblack box, enclosed Jetblack headphones. Ordered again and got Jetblack headphones in an Umber box, with Umber barcode. Feeling very frustrated in spite of the obvious great quality product for a great price",
      "rating": 3.0,
      "verified": true,
      "author": "Ange Chica",
      "helpful_votes": 2,
      "publication_date": 20200128
    },
    {
      "title": "Lived up to the hype ...",
      "text": "I spent quite a bit of time researching over-ear bluetooth headphones on Amazon first and having made a shortlist of 3 within my budget, these were ranked 2, but it was a very close call. I then did some supplementary research on the web and my number 1's ranked a lot lower for comfort on the ears so I switched and went with the Status Audio ones. A good decision! Great sound, beautiful looking and very comfortable, I'd recommend them highly ...",
      "rating": 5.0,
      "verified": true,
      "author": "M. Byrne, Dublin, Ireland",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Solid purchase perhaps a tad over-priced.",
      "text": "Expensive impulse buy when my previous headphones were fatally damaged. Enjoying ease of use in Bluetooth mode and sound pretty good. Look good and box useful. Felt a little over-priced, but at least good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Stafford Steve",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Not been off my head since I got them (the BTs that is) ... poor wife not best pleased!!",
      "text": "....believe the hype folks!! Packaging fine , design and comfort excellent and sound matches , and in some respects , bests the way pricier Sonys and Boses!! Natural bass , detailed mids and highs and an impressive soundstage! At this price , impossible to beat!",
      "rating": 5.0,
      "verified": true,
      "author": "Phil W",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Amazing sound for the price!",
      "text": "These work very well with Bluetooth and no latency that I have noticed, unlike some other B/T headsets I have tried. Very lightweight on the head and would recommend them to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "david knight",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great value",
      "text": "Had been searching for decent over ear headphones but all the reviews pointed me towards £200+ pairs. Then I saw these and read the reviews and thought I’d give them a go. I honestly felt I’d be a bit underwhelmed given the price, but honestly they’re brilliant. They don’t fit completely over the ear (I’ve not got Prince Charles size lugholes) but they’re very comfy, and the sound quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great sound.",
      "text": "A noticeable crisp and clean sound compared to rivals. For example, the Status Audio BT One Wireless Headphones rivals Bowers and Wilkins' work with the P5. The dynamic range is exciting whilst retaining a pleasant natural sound. I enjoyed the low end and vocals in particular. An excellent purchase for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr William Michael Brown",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Good sound, great look",
      "text": "Good sound, great looking headphones - bought for my son at Christmas - he loves them. Not too big, good sound and noise cancellation - great value too",
      "rating": 4.0,
      "verified": true,
      "author": "Alexmc12",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Brilliant for the money",
      "text": "Love these headphones, light weight, well padded and a sound to die for. You won't get better for your bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Harris",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "top sound",
      "text": "i wasn't sure i could justify these because i have a pair of in ear buds that actually cost more and a corded pair that cost less. but i was convinced by the reviews and took the plunge. didn't regret it - great sound. controls a bit fiddly. but great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Douglas Small",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great phones, shame about the colour",
      "text": "Great sound, very comfortable, very quick charging, rock solid Bluetooth connection with no hiss that I can detect. It's just the colour which is not like the images. More mud than umber.",
      "rating": 4.0,
      "verified": true,
      "author": "jonthemonster",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Great headphones",
      "text": "Arrived next day. Sound quality is just as good as I've seen in other reviews. The thing that really got me was how nicely put together they are. The leather is really nice and soft, no buttons rattling, theyre nice and light and the case is a smart touch. Ive never heard of Status before but I'll check them out in future for sure.”",
      "rating": 5.0,
      "verified": true,
      "author": "George Darcy",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Fantastic headphones",
      "text": "These headphones are fantastic! Sound and feel quality way above the price. The storage box is a nice addition. Connection to my iPhone was quick and easy. I’m delighted with this product and even arrived 2 days early (which was next day after ordering!). Couldn’t Ask for any more really.",
      "rating": 5.0,
      "verified": true,
      "author": "Martyn",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Don’t doubt them.. Buy",
      "text": "Best product I’ve bought in a while.... Literally love them ✨... changed my life as can now be in the same room as the kids and listen to books, music and look great so can wear out and about.. I’ve owned other brands and these are by far the best.. Super comfy too..",
      "rating": 5.0,
      "verified": true,
      "author": "debs",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Easy to use",
      "text": "Ear pads could be improved but at this price point that's understandable.",
      "rating": 5.0,
      "verified": true,
      "author": "Aremel",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Worth It!",
      "text": "Really do punch above the price point, good sound quality, pretty well made with a hard carry case. Only negative is because they are on ear, they are not as comfortable when walking!",
      "rating": 5.0,
      "verified": true,
      "author": "Dani Jan Gicquel Billington",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Incredible headphones",
      "text": "The most comfortable headphones I have ever owned, the sound quality is outstanding and the battery life is as long as advertised. Brilliant headphones at a surprisingly reasonable price, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JB B.",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Look, sound & price = great!",
      "text": "Handsome product, terrific sound and great customer service. I’ve not much else to say to be honest. These do sound like they should be more expensive and look as good as anything out there. Recommended. Delighted.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Beamish",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Sound",
      "text": "Sound quality for the price is ridiculously good Pairing took a couple of seconds Fantastic buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "quality product",
      "text": "The sound quality is good with a wide tonal range. Very little noise escapes that is heard by others. Portable handy carrying case. I have recommended this product to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "andykin",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Good value for the price",
      "text": "Good quality for the price. A bit muddy in the mid-range, but not bad overall. Solidly built. On the small side, so will be tight for large heads.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Very good for the price",
      "text": "Good sound, long life and comfortable. Only downside is that the sound and song tracker use the same buttons which can get confusing.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexandra",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Value for Money and Comfort",
      "text": "For the price paid and against other headphones I have owned and used, these are very good and comfortable to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "RJA Thomas",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Buy these headphones!",
      "text": "Easily live up to all the positive reviews on line. Would definitely recommend to anyone. Great sound, great look and great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Great sound",
      "text": "Great sound , but might not be large enough for some heads!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Welch",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Very pleased.",
      "text": "Great headphones, sound and balance really good, battery life great build is good and packaging. Very pleased, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "patrick",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Sounds exciting and refined",
      "text": "Superb sound quality and very easy to connect. Very comfy and looks very stylish indeed.",
      "rating": 5.0,
      "verified": true,
      "author": "brian hoy",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Folds up to suit any jacet pocket",
      "text": "Great investment. Folds up brilliantly, looks good, easy buttons and great sound.",
      "rating": 5.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Very happy!",
      "text": "Great sound quality, comfortable to wear and good value. Who could ask for more?",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Weeks",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Must have headphones",
      "text": "Excellent sound quality, lightweight and comfortable. What more do you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Outstanding Value",
      "text": "I have been exploring the purchase of a Bluetooth Headphone for months. Most do not have the sound quality of a wired set and are over priced. The price point for the Status Audio was outstanding and the sound quality exceeded ALL expectations. They are well balanced, wide soundstage and significant volume. The buttons will take time to get use to. Will also need more time to determine physical integrity and battery life. Thus far, this product is GREAT. I have now had these headphones for a few months and need to adjust my rating. The microphone for calls is terrible.Originally, I gave 5 stars. It is now lowered to 3.",
      "rating": 3.0,
      "verified": true,
      "author": "Band Of Gypsies",
      "helpful_votes": 3,
      "publication_date": 20191202
    },
    {
      "title": "Very light and comfortable. Really good sound.",
      "text": "I compared them with double 40mm driver V-Moda XS ($180) as well as Status Audio, single driver. V-Moda has best BASE on the market and keeps all frequencies it in perfect control. I used Status Audio with cable, first. With cable, base is overwhelming and out of control mudding the rest of the spectrum. Logically I decided to sent it back. Then I gave another try with Bluetooth. WOW. Sound is free of that ridiculous base and overall sound is really good. It sounds smoother that VModa but that matter of taste. Test Songs: Cult - She sells sanctuary Yello - Of Course I`m Lying Sting - If I Ever Lose My Faith in You Chris Rea - Daytona",
      "rating": 5.0,
      "verified": true,
      "author": "RadSret",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Defective right ear cup",
      "text": "I have only used this a handful of times due to an annoying defect. The right ear cup will randomly stop playing sound. I have not dropped it, abused it, or even taken it out with me when I go for walks. This has been an issue since I took it out of the box. At first I thought it may have been a bluetooth connection issue, but if I lightly tap or turn the earcup, sound will come back. I'm hoping I have a lemon. Sound, comfort, battery life, and looks are all excellent especially given the price point! Will be returning and contacting the company soon as I get the chance",
      "rating": 2.0,
      "verified": true,
      "author": "Curtis B",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Excellent sound quality - Good value",
      "text": "The sound quality is excellent which rivals my Bose over the ear wired head phones. BT connections are quick and consistent. The audio recorded feedback for BT connections is clear and concise. The only drawback is the mic tends to pick up room noise and I have had complaints about the clarity of my voice on the other end. These are light but seem well made. They are comfortable but the faux leather does get hot after wearing for a long period. It would be nice if they ear covers were some type of breathable material. However, they are much more comfortable than the other on the ear headphones I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Very pleased.",
      "text": "I bought these to use with my home stereo, which is used for sound for my TV and XBOX. With these headphones, I can listen to anything through that system as loud as I want without disturbing others in the house. I also have some hearing loss, so when watching TV with others, I can use these to increase my own volume, without affecting theirs. In that case, there is a fraction of a second delay between sound sources, that could be annoying, but is not a bother to me. These are very light and comfortable and have phenomenal battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Hancock",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Poor construction quality",
      "text": "I cannot recommend these headphones. The sound quality and battery life are good but the headband construction quality is very poor and the plastic broke apart within a month, rendering them useless.",
      "rating": 1.0,
      "verified": true,
      "author": "AMZN$Fan",
      "helpful_votes": 3,
      "publication_date": 20200711
    },
    {
      "title": "Sounds Good, Flimsy",
      "text": "Build: Lightweight, but very flimsy and cheaply made. One of the adjustment sliders was extremely loose and would't hold position. Thin plastic used. Design: Comfortable, but they are prone to sliding around. Sound: Actually quite good. Bass is deep and solid. Mids are present and engaging. Highs are clean, clear, yet not sharp. If the build was improved, these would be winners, but the flimsy construction and loose adjustment slider was a deal killer.",
      "rating": 2.0,
      "verified": true,
      "author": "hifi80sman",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "A full Five Stars",
      "text": "These are just great, and the customer service is also terrific. They’re very comfortable to wear, I like the built-in voice that tells you you’re powered on and then tells you you’re connected to whatever you’re using; for shutting down, it’s a simple low pitched double tone. The instructions say to answer a call, tap the button that looks like a power button - circle with a vertical line through it - but on the headphones, that button they’re referring to is actually just the Play button - a triangle. I carry them around more than use them, so I’m really pleased with the hard case. Highly recommend, and don’t think there’s anything better at this price out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigsurpete",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Very good headset",
      "text": "I like the style of this BT headset along with the sound quality. I do have problems where I have to reset the connections to my two main devices (desktop and phone) when they just get lost along the way. I also do wish the battery lasted longer. I get about 4-6 hours TOTAL use from a full charge. The good thing is that they charge to 100% in about an hour. I do wish they lasted longer, but the sound quality makes them work the price I paid.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Flawed design",
      "text": "The initial perceived quality is top shelf. I loved the headphones, comfortable and lightweight. Excellent battery life quick connection and when the battery runs out you can listen while charging. The reason for the two stars.... i own three pair and all three have failed at the same point. The thin piece of plastic that holds the speaker to the headband. It is a week point that will fail. Buyer beware.",
      "rating": 2.0,
      "verified": true,
      "author": "Smithwillington",
      "helpful_votes": 2,
      "publication_date": 20200403
    },
    {
      "title": "nice product overall",
      "text": "i had used bose sound canceling headphone better than so i can compare to this well.... sound wise Bose is 10/10, this one is 9/10... bettery life wise bose is 10/10 , this one is 8/10.... comfort wise bose is10/10, this one is 10/10... and most importantly it is Lighter... so that less burden to neck only one my personal complain is Photo looks better than actual headphone itself.. if i can i want to credit to Product photographer who took these photos :)",
      "rating": 4.0,
      "verified": true,
      "author": "BRIAN",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Wow",
      "text": "First let me say this. If the music source is flat, muddy, tinny, or otherwise bad, no amount of headphone is going to do a whole lot to improve it, but there are many headphones that can take a quality music source and ruin it. I'm using these on my phone and PC, and both have the ability to customize the sound coming out. Personally I like punchy bass and crisp clean highs. I don't like the mids to wash out the highs nor any echo. I want headphones that will respect that and deliver. These do. Perfectly. They're so good they make songs I don't like listenable.",
      "rating": 5.0,
      "verified": true,
      "author": "criddar",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Pleasently surprised!",
      "text": "My first day with my SAHD1-BT umber headphones great sound. Ear cups good enough to place you there in the music since it doesn't have noise cancelling. I'm not thrilled with the design of the controls or the earpiece sliders, but I'm impressed with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Williams",
      "helpful_votes": 2,
      "publication_date": 20200618
    },
    {
      "title": "Great sound and stylish",
      "text": "The sound on the BT Ones is fantastic for this form factor (on-ear), almost comparable with mid to high end over ear cans. They are light, comfortable to wear and handsome (unless you are into flashy, over-the-top gadgets, that is). My only complaint so far is the bluetooth range. Unlike a few other BT headphones I own, it struggles to cross over concrete walls within the 25-30 ft radius. I suspect the aluminium on the cans has something to do with it. But it not terribly bad. Just ok. Anyway, I'd buy another pair before returning these headphones. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Flores L",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Attractive but flimsy and disappointing sound",
      "text": "My reference point: I bought these to replace an ancient pair of Bose QuietComfort headphones. The good: these headphones are gorgeous. The mediocre: there may be some metal in the construction, and the tolerances in the build seemed precise, but overall these headphones felt flimsy to me. There was essentially no passive noise reduction from the earphones, and the range of the sound seemed on par with what I would expect from a $30 pair of headphones. I wound up sending these back--they may be an adequate value for the price point, but I still think these were overrated.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "A Superior Set of Headphones for the Price!",
      "text": "If you're looking for really crisp sound quality and long battery life at a great price, I would highly recommend these headphones. I own a pair of Bose (not one of their more expensive models, admittedly) and I've had a Sony model and several lesser brands, but the first time I listened to the Status BT Ones I was picking up details in the instrumentation of my favorite music that I'd never heard before. I charged them right out of the box several weeks ago, and I haven't had to recharge them since! They're my go-tos--I'm really happy I bought them.",
      "rating": 5.0,
      "verified": true,
      "author": "David Skeele",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Promising",
      "text": "First the Pros: Comfortable Great audio quality (Had to take of two Stars for reasons below) Build quality is great (for sub $100 headphones) Now the Cons: Sent back two because of an echo when on calls. Either phone or Zoom. Person on the end complained of echo and could tell when I was on or off the headphones. Seems like the Mic picks up the incoming audio (voice) and feeds it back. Shame. I really like them for listening to music. But I need them for the office and conf calls.",
      "rating": 3.0,
      "verified": true,
      "author": "KiwiTexan",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Surprising",
      "text": "I really like these headphones. They are easy to pick up and put on and they sound good. They are not mind blowing but for the price pretty nice and I got them on a lightening deal. They have surprising bass as small as they are and they sound crisp. I have a Dragonfly dac and listen to Tidal's MQA files so I don't have to turn the volume up too much. My brother tried them out for a day or so and he gave them a thumbs up. He said likes that the battery last a long time and I agree. I like the usb c charging too.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff phillips",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Unbeatable for the price!",
      "text": "These are the best headphones I've ever purchased for $100.00. I admit I have never spent more than $100.00 however, I have purchased several headphones in the $100.00 range. They sound fantastic, are very comfortable and they look great. I take an hour walk everyday while listening to music. I didn't need a charge for 2 weeks. I'm a very satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Meadows",
      "helpful_votes": 2,
      "publication_date": 20200226
    },
    {
      "title": "Bluetooth connection flaky",
      "text": "After listening BT One for a few days, comment as follows: 1. High is less bright, more comfortable than beginning. 2. Low is more defined. Good. 3. Headband on the small side. Large heads beware. Two more clicks would have been great. 4. Bluetooth connection to my cell is unreliable. My cell (Sony) has BT 5.0 and connection to other devices are great. When it comes to BT One, it is another story. Cell in hand, OK. Cell in hand in noisy environment, OKish. Cell in jacket pocket, OKish. Cell in jeans back pocket, good luck. Could have been a 4 Star product.",
      "rating": 3.0,
      "verified": true,
      "author": "stn",
      "helpful_votes": 2,
      "publication_date": 20200111
    },
    {
      "title": "Just What I Have Been Looking For",
      "text": "After disappointing results with other V4.1 & V4.2 BT headphones that I interfaced with a Miccus 2.0 range extender, I wanted to try BT V5.0 headphones. Theses work better than I expected, along with being very lightweight and comfortable. I will not need to purchase wireless headphones again for a long time to come. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Krowman1964",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Mostly Good",
      "text": "These headphones are mostly good. My husband uses them outside for listening to lectures on his phone. For that purpose, these headphones are really great. We live on a busy street with tons of traffic all day and the sound comes out great for him. He also takes calls while using these outside, but the sound quality for the caller isn't great. He usually has to switch back to using the phone itself for calls. However, if he is indoors, the sound for phone calls is fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Rena",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Excellent set of heaphones",
      "text": "I absolutely love these headphones. Compact size and very comfortable. I have listened to different genres of music including Afro, hip hop, dance electronic and they sound great with all of them. If you like deep thump bass these are for you but the kids and highs are excellent too. Vocals are crisp with great separation. I highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Highly rated because they are really good",
      "text": "I had these on my wish list to replace my Koss corded phones. They were $99 but on Black Friday, they went on sale for $59 and they are worth every penny. They are comfortable, have a great sound for this price point and come with a cord, so they can be paired with a \"1 into 2\" adapter for airline travel - they will be better than anything one gets from a domestic airline and you don't have to pay rental fees.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Incredible sound, terrible mic",
      "text": "It is pretty sad when my laptop mic sounds so much better than the mic on this headset. I purchased this headset for the specific purpose of talking to coworkers and clients. I've tested this on numerous calls with my coworkers using the Status Audio BT One, my laptop mic & speakers, and my cheapo Logitech wired headset. The Status is by far the worst. It sounds like I'm in an echo chamber and there is absolutely no sound cancellation happening despite the claim. That is the bad. The good is that these headphones sound amazing. So good, that I'm debating whether to return them.",
      "rating": 3.0,
      "verified": true,
      "author": "lance",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great sound and price!",
      "text": "Besides being a very sharp umber color, these headphones fit very comfortably and sound great. Wireless has a large range which was surprising. I also like the smaller size but even though smaller, my ears are completely covered. Great alternative to pricey headphones and I love the wireless aspect. They do come with a wire if you desire that feature also. But the best part about these headphones is their unbelievably affordable price. I would recommend these highly.",
      "rating": 5.0,
      "verified": true,
      "author": "gdubya",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Better than the Beats EP On Ear Headphone",
      "text": "I'm about to return the Beats EP headphones for two main reasons. #1 Those earphones are tight and these were designed with so much consideration and care. #2, The other headphones' sound is packed saturated with the bass sound too ephasized. How did I know? I played a song and these headphones are so much better. Even though the beats headphones have a better looking design, the functionality of that design and the sound quality does not match these. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "beaver",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "very good headphones for the price",
      "text": "kind of a no-name brand, but these have good sound quality for on-ears. My only complaint is it feels like the volume is limited to be fairly low. This statement is a little silly since I've never cranked them up all the way (mostly used in an office) but I feel like if I took them on an airplane I might have issues. Plus side is that they come with a 3.5 mm jack and have good volume response through that, so if you need extra oomph you can get it from your phone or laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "nobody",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Before buying it be sure that your head is up to middle size.",
      "text": "I love the headphones for their sound which is clear and warm, but their size is too small for my head, after using for a couple of hours my ears are getting pain. So, sadly, I'm forced to return them.",
      "rating": 4.0,
      "verified": true,
      "author": "Evgeny R.",
      "helpful_votes": 2,
      "publication_date": 20200624
    },
    {
      "title": "what a great sound!",
      "text": "after researching for months and months, saw these on Amazon and could not believe what I was reading. So I did some deeper dives into other reviews and confirmed my decision to go with these. Simply amazing quality of sound and product for a great price!!! I got the black for $85 with a digital coupon Amazon offered. First time using headphones on top of the ear. after 4-5 hours, ears get a little sore, but that's when it's time to take a break and go outside for some fresh air.",
      "rating": 5.0,
      "verified": true,
      "author": "ms",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Outstanding Headphone for the Money!",
      "text": "I did not know what to expect when I ordered the Status Audio BT1. When they arrived I quickly found they exceeded what I could have expected! The sound quality is phenomenal and at this price range, I could not believe it! Comfort is amazing and ease of operation places these at the top of my list for the goto headphone for any device. Thank you Status Audio! Sincerely Jeffrey D. Sac MS, RN, Retired Firefighter",
      "rating": 5.0,
      "verified": true,
      "author": "J. Sac",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Don't believe the pictures",
      "text": "I recieved these today and they sound great. They are easily paired and are comfortable. Why only 2 stars you say. They don't look anything like the picture which is one reason why I bought them. NOT EVEN CLOSE.",
      "rating": 2.0,
      "verified": true,
      "author": "J. John",
      "helpful_votes": 3,
      "publication_date": 20200106
    },
    {
      "title": "You don't need top charge it to simply plug into an audio output",
      "text": "I use it for monitoring and not Bluetooth. My previous set required it to me charged no matter even if it's plugged into simply an audio output. That one's description didn't indicate this. My only complaint is that I use it all night plugged into either snow storms sound track or thunderstorms so I can sleep. My complaint is that that the \"earmuffs\" are too tight around my head and really press my ears too tight no matter how I adjust them.",
      "rating": 4.0,
      "verified": true,
      "author": "Mickey Grant",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Perfect for Traveling!",
      "text": "I do a lot of traveling and was looking for good quality headphones. These headphones are light weight, comfortable and battery last for a very long time. It does not take them very long to charge either. I do wish there was some indication of battery life before they are dead. Overall, very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mb",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Pleasantly surprised!",
      "text": "I have seen these things advertised many times and I finally gave in and ordered them after reading so many positive reviews and what really iced it was the special pricing Amazon had. I had a set of Sennheiser HD 4.40BT's that I really liked but I lost them. I went back and forth on buying another set of Sennheisers and trying the Status Audio item and I am really glad I went with these as they are every bit as good if not better. I love the sound quality, the bass is really strong and they are very comfortable to boot! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Theadore Richard",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Happy.  Look and sound good~ but...",
      "text": "Using them quite a lot and like them, but... I find the clamping pressure to be a bit too high making them difficult to wear for more than about an hour. Too bad, cuz everything else is good. Maybe I'll have to stick with wireless earbuds- sigh. I'll keep these for critical listening.",
      "rating": 3.0,
      "verified": true,
      "author": "GG in MN",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "I've bought a lot of headphones. Finally found the pair I've always wanted!!",
      "text": "\"So good they're hard to take off!! Long lasting play time and tuned across low to high tones to make listening a pleasure! I now hear subtle sounds in my music that I did not hear before. Excellent value, and worth every penny of the purchase price.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 3,
      "publication_date": 20191031
    },
    {
      "title": "Basic functionality problems",
      "text": "Very disappointing basic functions. The bluetooth microphone is useless for a phone call as it produces an echo The headphones will suddenly disconnect and not be able to reconnect. The headphones will “freeze” suddenly in the on position but not be able to connect so i have to plug them in to reset them. Too much hassle for not a lot of convenience",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200418
    },
    {
      "title": "Great sound",
      "text": "I wasn’t fixing to spend 200 to 300 on some name brand headphones that break in a yr or sooner . I tried 2-3 other pairs that were 30-60 bucks but wow how have things changed . You couldn’t hear them at full volume . I had bought some for like 26 bucks on amazon like 1 1/2 years ago an they were very loud but they broke . They no longer carried that brand so I bought these . They sound great ,really clear and loud enough .",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny M.",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Excellent headphones!",
      "text": "The Status Audio BT One Wireless are nice blue tooth headphones for a great price; very comfortable and most importantly, they have remarkable sound quality! Exceptional battery life too! They paired with my I phone in a snap! They are smaller than standard over the ear headphones, but they have a definitely have a \"cool factor\" because of their slick design. They come with a solid little case and charging USB cable. I'm very happy with my purchase and the seller.” Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom ",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Surprisingly Great Headphones!",
      "text": "When I opened my BT One headphones, I was surprised how small they were. However, the adage, “Don’t judge a book by its cover”, certainly applies to these headphones. The sound is awesome, the bass is nice; not overwhelming, but enough to balance out an overall quality sound. These headphones are the best I’ve had under a hundred bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Everett",
      "helpful_votes": 2,
      "publication_date": 20200716
    },
    {
      "title": "Why did I wait this long?",
      "text": "This review is for the Status Audio BT One. I had a cheap over the ear wireless headphone knock off for a long time and somehow manage to live with the constant disconnects and loose parts noises. So the Status Audio is heaven sent for me because of the instant bluetooth connection, long distance range, and sound fidelity. If you are unwilling to pay more than $100 then this is for you. I was also impressed by the material and color (Grey/Brown).",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Good headphones for the price",
      "text": "I don't think you can beat these headphones for the price. I especially appreciate their Bluetooth range. They stay connected much further than my old ones did. I mostly use them to listen to podcasts and for that the sound quality is excellent. I have had headphones with more padding, but these are comfortable enough. I would definitely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Geeky Mom",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "A STEAL at $99",
      "text": "I bought my first pair of Status headphones a few years ago and was 100% satisfied. Wanting a wireless option, I purchased the BT One this week and was amazed at their quality, comfort and design. Other high-quality headphones sound great if the mix is stellar, but sound crappy if the mix is poor, but these headphones not only accentuate high-quality recordings well but also make mediocrely mixed music sound better, somehow. I'm not surprised that my 2nd Status purchase is another success, but wow, these headphones exceed my already high expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Budzelek",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Almost Perfect",
      "text": "I love these! They are a great on ear fit, block out a decent amount of background noise, and have a nice sound quality to them. The call quality is not great compared to my other headphones which are Bose Soundsports but that is fine. These are to wear around the house and block out the noise of the city and roommates.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick C.",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Attractive and Amazing",
      "text": "Omg. These are amazing! Ive watched the reviews for a few weeks and waited for the price to drop again to try them out. Im so glad I purchased them. The sound quality is just amazing!! Ive purcahsed a few headphones to try out for work. I travel and I wanted to upgrade. The rest were returned after a few hours of pairing. Im keeping these!",
      "rating": 5.0,
      "verified": true,
      "author": "Lesha",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Best!",
      "text": "After trying several brands and models I found these to be my favorite. I was a recoding engineer for many years and what I like for my personal use is balanced sound. Hard to find in these days of super exaggerated bass. The new “normal” doesn’t go with classical music and jazz ensambles. I’m glad I took the chance to try them.",
      "rating": 4.0,
      "verified": true,
      "author": "movie lover",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "One of the better Bluetooth headphones in this price range",
      "text": "GOOD: audio quality, light weight, carrying case, can get pretty loud, physical buttons, battery life, look NOT SO GOOD: plastic quality and construction, long term comfort, doesn't really work with 2 phones despite BT 5.0, BT cut off sometimes, why is the headphone cable on the right side? OVERALL: it is difficult to find a high quality Bluetooth 5 Aptx HD headphones for under $100, and this one does most of the things well. No, this is not the best Bluetooth headphones you can buy, but for the price, it is a good looking and good sounding product.",
      "rating": 4.0,
      "verified": true,
      "author": "CC5858",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Very Good",
      "text": "Very good headphones for a low price. No, there's no noise cancellation, and the midrange could be a bit more pronounced, but for the price, you can't beat them.",
      "rating": 4.0,
      "verified": true,
      "author": "geofos",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Not so fast",
      "text": "After reading the reviews for the head phones, I thought they were a \"must have\". Not so fast! After using them for the first time, I would rate the sound quality: 4 out of 10. I used them while on the phone. My friend said I could barley be heard through the mic. I plan to return this product ASAP.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph McGee",
      "helpful_votes": 2,
      "publication_date": 20200423
    },
    {
      "title": "Quality, balanced sound at the right price",
      "text": "Great balanced sound for all types of music. Solid bass, but not overpowered. They were smaller than I thought, but that's not a bad thing. Very comfortable on the ears and lightweight. Quality product for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Frugal Nerd",
      "helpful_votes": 2,
      "publication_date": 20200409
    },
    {
      "title": "Long battery life",
      "text": "Use this to watch TV after the wife falls asleep. I charge it weekly and use it for 2-3 hours per night. If I cover my ears with them, I cannot hear anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "RMSands",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Decent shirt use wireless on-ear headphones.",
      "text": "Pros: long battery life, quick charge, decent sound quality, light weight, very portable. Cons: sound quality is decent - not great. Looking for audiophile look elsewhere. Comfort: initially the cushioned pads seem super comfortable but I find them difficult to wear for extended periods. I have an older pair with the over ear Instead of on-ear and they don’t become a problem. Maybe it’s just a preference. Also: the Built-in mic is not nearly as clear as other options. A problem if like me you plan to use for Zoom meetings extensively.",
      "rating": 4.0,
      "verified": true,
      "author": "michael pierry",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Pretty good sound, a little hot.",
      "text": "I've been using only earbuds for a while and it was a surprise to find out how poor the audio on many podcasts are! They are a little small (medium sized head and have to extend most of the way to make them comfortable) but sound good. Not super loud, but comfy and definitely more sound than earbuds.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin C.",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Not the best but could be worse",
      "text": "I wanted to love these, but I was disappointed in the sound quality. There is a static popping sound that is heard even at low volumes. But they were still inexpensive considering. I do like the fit, which is great for my tiny head. The ear muff color is darker than what is advertised, but that isn’t a deal breaker. Stylish otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "VP",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great Choice for Small Over Ear Headphones",
      "text": "I bought these to listen to my computer without disturbing my wife. The form factor is what I was looking for as I was looking for a big headset and wanted something a bit slimmer. Battery life is awesome and the sound quality is great. Everything I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Esteban",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Wow!!!!!",
      "text": "I'm a profesional sound engineer and I own a pair of professional monitoring headphones and to be honest the quality of the Status headphones is extremely good. I was very impressed when I first tried them on. Very nice and clear deep bass and nice and sharp high end. The noice cancelling in my opinion it's ok for over the ear headphones. I've not tried a pair of Bose or any other major brand as far as noise cancelling is concerned so I couldn't tell the difference. The phone calls a very clear. Overall a great investment. I'm glad I found them. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis A. Solivan",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Impressive indeed.",
      "text": "Good sound quality and stability is unmatched by any headphones I’ve used previously. It’s nice to have the option of wired or wireless too. Helps when reading because when the things beep to tell me I’m low on battery all I have to do is plug in and I’m good to go! The only SLIGHT downside to these great headphones is that the Aux cord isn’t very long. If this came with a longer (10’ would be perfect) cord that’d make these 100% perfect. Great product overall for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Taylor",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "These headphones rock!!",
      "text": "I was looking for a pair of lightweight, high-quality, wireless, on-ear headphones for my PC that didn't break the bank. Saw these, saw all the 5/5 reviews, so I picked them up. I'm not a huge audiophile, but these sound waaay better than my old SkullCandy's. They're great!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay L.",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great buy!",
      "text": "Great headphones. Paired with TV and the sound quality is great. Can listen at desired volume w/o disturbing anyone. Wore 4 hrs. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "mosaicwoman",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Sound quality for the $$ is unbeatable",
      "text": "Best sound from a $100 set of cans that you can find. Bottom line. Quality is good; they do tend to hurt my ears after a couple of hours, but that could just be my head; YMMV of course. Much better value than a $300 pair of Beats or Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "R. E. Gassert",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Most Versatile, Best Sounding, Feature Packed Headphones I've ever owned!",
      "text": "Battery life is stunningly huge, has the awesome ability to play either over Bluetooth 5.0 with atpX for excellent wireless sound streaming quality, or wired for whatever device that can't utilize it! All comes with a sleek carrying case while having a surprisingly small overall size! Extremely satisfied with these headphones, always love what Status Audio delivers!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah G.",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Really happy with these.",
      "text": "LOVE these headphones. The range and stability of connection is fantastic (and due to being the latest bluetooth version). Very light and comfortable, great sound and quick and solid connections to multiple devices I use them with. The tan (faux) leather look is great too. (I get tired of trying to find all the tech items that seem to come in black, or black, or black)",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20201016
    }
  ],
  "product_meta": {
    "title": "Status Audio BT One Wireless On-Ear Headphones - Bluetooth 5.0. + aptX, 30 Hours of Battery, USB-C + Quick Charge, Award Winning Sound + Minimalist Metal Design, Matte Finish (JetBlack)",
    "rating": 4.3,
    "feature_bullets": [
      "AWARD WINNING SOUND: A 40mm driver and our unique tuning allow you to hear your favorite music with stunning clarity. Impactful bass doesn’t muddy the midrange or treble, and you’ll never have to crank the volume up to hear your music come alive.",
      "CUTTING EDGE WIRELESS: Bluetooth 5.0. gives the BT One 25 meter range and multi-point pairing support (connect two phones, computers, or tablets at the same time). There’s no lag, even when switching between devices. Bluetooth is the most commonly used wireless audio format, so the BT One is compatible with virtually any smartphone, tablet, or computer.  Support for the aptX codec makes listening on compatible devices (PC, MacBook, Android Devices, Personal Media Players Pixel) even clearer.",
      "30 HOUR BATTERY: The BT One’s battery delivers 30 hours of playtime, making it the perfect companion for international travel, a week’s worth of commutes, or all-day listening sessions. It can be fully recharged in just over an hour via USB-C thanks to Qualcomm’s QuickCharge technology, so you won’t miss a beat.",
      "MODERN DESIGN: The BT One’s sleek metal frame and unbranded look are the pinnacle of modern tech design. Playback buttons, volume controls, and a microphone on the left earcup let you adjust your music or take calls without touching your phone. The BT One can fold up to fit in the included carrying case for easy storage.",
      "COMPATIBLE WITH ALL YOUR DEVICES: The BT One works with the iPhone 5/5s/6/6s/7/8/X/XS/XR,11,11 Pro, iPad 2/3/4/Air/Air 2, Pro, Pixel 1/2/3/4, Galaxy S6/S7/8/9/10, Fire Tablet 7/8/Kids Edition/10, Kindle Paperwhite/Oasis, MacBook, MacBook Air, MacBook Pro, iMac, Mac Pro, Dell, HP, Huawei, Surface, and more. No additional hardware or app is necessary to use the BT One. A 3.5mm backup allows you to use the BT One on an airplane, or with non-Bluetooth devices."
    ],
    "specifications": {
      "Product Dimensions": "7.5 x 5 x 2.5 inches",
      "Item Weight": "1.1 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "Status Audio",
      "ASIN": "B07T27FQ5H",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.3 out of 5 stars389 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#289 in On-Ear Headphones",
      "Date First Available": "June 12, 2019"
    },
    "categories": [
      "Electronics",
      "Headphones",
      "On-Ear Headphones"
    ],
    "price": 59.0
  }
}