{
  "website_summaries": [
    {
      "verdict": "Inexpensive, packed with convenient features, and simple to pilot, this GPS-powered drone is an excellent option for beginner drone enthusiasts and photographers alike.",
      "pros": [
        "Affordable",
        "1080p camera",
        "Handy auto-return feature",
        "16 minutes of flight time",
        "Extremely lightweight",
        "Follow Me and Face Tracking modes makes selfies easy"
      ],
      "cons": [
        "There are photography drones that can snap a much sharper 4K picture"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "never returned  home!!!!",
      "text": "I got this drone about a month ago and I took it for a fly around my neighborhood and everything was fine, that was my first time, the second time I tried again and I said wow it goes pretty high once I lost sight of the drone I pressed the return home bottom and I never saw again I waited for a while till my control finally gave up and turn off by it self. never saw my drone again!!! and there was no trees around or buildings it was an open space.",
      "rating": 1.0,
      "verified": true,
      "author": "Indigo",
      "helpful_votes": 134,
      "publication_date": 20191206
    },
    {
      "title": "Works Good",
      "text": "So customer service is great will respond and try and help. This drone has issues. One is its recording to SD card jumps and is not smooth customer service can't find a fix for this.. The App is OK but not great you can setup way points but it just flys to them no adjustment on how high or to wait.. The FPV distance is maybe 100ft before it starts dropping signal. I originally wrote a 5 star to get a free battery but never got it. Personally this one is better than the other brand thats 5g but not much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 40,
      "publication_date": 20191113
    },
    {
      "title": "Very disappointed!!",
      "text": "So I bought this for my Husband as a Christmas gift. He read all the instructions and even watched YouTube videos to make sure he knew how to operate the drone. First time out it went up the unit stopped responding To the controller and took off. The device is supposed to return home with low battery or out of range .. it’s obviously defective My husband searched for a couple of hours he couldn’t find it. I would like the company to either reimburse me for this unit or replace it with a unit that lives up to the drones capabilities. If you read the reviews there are others who have the same issue. Please help!",
      "rating": 1.0,
      "verified": true,
      "author": "Florence Fuentes",
      "helpful_votes": 25,
      "publication_date": 20191228
    },
    {
      "title": "Agree About Mind Of Its Own",
      "text": "Took it out the first time today in an open field. Got everything calibrated, connected and got the display, unlocked the motor and pressed the one-button take off. It went up 100ft in the air and took off on its own. Ignored the return to home or the emergency stop and took off to god knows where. Looked for 6 hours and couldn't find it. Tried following the wifi trail, but to no avail. Can't recommend this. Wasted $200. However it was neat for the 45 seconds I could watch it.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick H.",
      "helpful_votes": 13,
      "publication_date": 20200202
    },
    {
      "title": "Took off and would not return home.",
      "text": "After learning to fly on beginner mode a few times, I turned off beginner more the drone took off! I literally set up the drone, flew for a couple minutes, felt comfortable to switch off beginner mode and it took off in a North direction and nothing worked to retrieve it. Return to home, lost signal from remote, it was GONE! I spent over an hour driving around trying to see if any signal could be reconnected but sadly it is gone. Please help Holy Stone",
      "rating": 1.0,
      "verified": true,
      "author": "Team H.",
      "helpful_votes": 8,
      "publication_date": 20200329
    },
    {
      "title": "Couldn't have asked for a better present!",
      "text": "Got this as a birthday present and was immediately in love! The design was sleek and assembling was easy and painless. It's surprising how light the drone feels and yet how good the picture quality is. We gave it a spin at Central Park and the video was absolutely stunning. Would highly recommend to anyone who's thinking about getting a drone.",
      "rating": 5.0,
      "verified": true,
      "author": "irisliuyi",
      "helpful_votes": 7,
      "publication_date": 20191005
    },
    {
      "title": "Good value for money but below par!",
      "text": "Drone was oky to learn, but maneuvering wasnt always spot on. Despite calibrating properly (indicated by solid lights after moving the drone body in a certain direction), the drone wouldn’t go in a straight line, so i had to return it. Also, the video wasnt true 1080P. It was probaby not even 720P, so if you’re using this for a video project, chances are you wont use the footages from this drone.",
      "rating": 2.0,
      "verified": true,
      "author": "rd_redevil",
      "helpful_votes": 3,
      "publication_date": 20200514
    },
    {
      "title": "Great drone..even better customer service!!",
      "text": "I can not speak more highly of customer service from Holy Stone. I had a problem with my Hs120D drone, which was due to an unintended landing in a tree..my bad. The camera was not functioning properly on its motion. After contacting customer service they are sending me a new camera...free of charge! Hans at HS was awesome! Walk me thru some points to check and was very helpful. I will be purchasing another drone ( after I get flying them down better..:-) ) and it WILL be a Holy Stone drone!! Plus, this one is excellent for a beginner! Highly recommended their products and customer service!!! Photo will be posted later.",
      "rating": 5.0,
      "verified": true,
      "author": "Pandad",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "“Fish on!”..",
      "text": "..is what I thought as I was hauling in the fishing line I had connected to it after seeing the other flyaway reviews. Managed to get it back, only to have it fly around a tree the next day, snagging the line, then refuse to respond to any commands as it went bananas on me. If it had a self destruct switch I would’ve used it, but that probably wouldn’t have worked anyway. Last picture received was a scene 100 feet in the air of a bunch of pine needles with a squirrel giving me the finger.",
      "rating": 1.0,
      "verified": true,
      "author": "Michaela",
      "helpful_votes": 2,
      "publication_date": 20200716
    },
    {
      "title": "Not recording on SD card",
      "text": "video only is recorded on phone app through wireless with 720p. Drone does not record video on SD card meaning I am not getting 1080p. Ordered new SD card to see if that solves the problem. Wondering if anyone had same issue and solution.",
      "rating": 1.0,
      "verified": true,
      "author": "Louie",
      "helpful_votes": 4,
      "publication_date": 20200102
    },
    {
      "title": "Awesome little drone",
      "text": "HS120 D GPS Drone is easy to use if you follow the directions. I bought it for my husband so that we could take aerial views of the properties that we own. The picture & video quality is pretty incredible. He hasn't had a chance to use it yet but I've been able to check out the gutters & roofs of a couple of our properties. The one thing that I would improve on is the grips on the controller. Once you attach your smart phone it is top heavy which can lead you to place your fingers where the video or photo buttons are located. This is our first drone.",
      "rating": 4.0,
      "verified": true,
      "author": "MZK",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Get your money's worth here!",
      "text": "For the price point this is the great drone. Does everything but obstacle avoidance comes with 2 batteries perfect case to carry it extra prop prop guards. Charger is not fast but takes about 90 minutes total. I've flown 10 batteries and I get roughly 20 minutes maybe a little less depending on what frame rate I'm using for video. GPS is surprisingly good all the options work as they should I'm very impressed with this model. Holy Stone typically cost a little more this is with the coupon code a perfect price point for this toy / hobby grade drone",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse M",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great value",
      "text": "Received the hs120d and this thing is a steal for the price. Even without the $20 coupon at checkout. Batteries alone are $40 to $70 dollars depending on where you get these from. It's going to be a Christmas present for my son. I've not flown it yet I will be doing that shortly, just to verify everything works as it should. If anything is off I'll update the review,but I highly doubt they'll be any issues. Highly reccomend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon S.",
      "helpful_votes": 2,
      "publication_date": 20191003
    },
    {
      "title": "Awesome drone with a modest camera",
      "text": "I wish I had bought this sooner! First, the only miss. The camera is ok. Not grainy, but you know it's not 4k either. Now all the perks: everything else! GPS and compass work great, even in my windy field the drone could keep it's location well. The controller allows safe limits for initial learning. The return to home feature lands within a meter or 2 of takeoff. First person view is super handy, and the camera can be pointed up or down by remote. This thing is great! Great drone for someone who wants a real drone without spending several hundred.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward A. Webb",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "I returned this item so I can not rate it.",
      "text": "I returned this item because I did not realize it required a smartphone to operate it. I do not own a smartphone. Therefore I can not rate this product.",
      "rating": 3.0,
      "verified": true,
      "author": "L M Brown",
      "helpful_votes": 5,
      "publication_date": 20191119
    },
    {
      "title": "A terrific starter drone!",
      "text": "The Holy Stone HS120D GPS Drone is a terrific starter drone. My purchase came with two batteries and a handy travel case. If things get out of hand when flying, the home command will bring the drone back to where it took off from. When you are first learning to fly, be sure to do so on a calm day with little wind. This drone does not require an FAA license for recreational, non-commercial use. Like all drones, there are some restrictions when flying close to an airport. I would recommend the Holy Stone HS120D GPS Drone, to new pilots. It is well made and a lot of fun to fly!",
      "rating": 5.0,
      "verified": true,
      "author": "John Magnin",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Meh.. not a great drone",
      "text": "It's cheaply built first off. Especially the remote control. Then I've had some pretty bad issues: 1) the remote control does NOT turn off, even if you press and hold the power button!! 2) the camera angle does not work, it just points straight ahead no matter what 3) the video quality is pretty terrible, nothing close to 1080..",
      "rating": 2.0,
      "verified": true,
      "author": "Adam S. Hayes",
      "helpful_votes": 2,
      "publication_date": 20200401
    },
    {
      "title": "It didn't respond, kept going and crashed into a wooded area",
      "text": "The camera is amazing, the drone is light and when it is working-it is amazing. We were using it and it stopped responding to the remote. It kept going further and further away until it crashed somewhere in the woods. We have been searching daily trying to find it with no luck. It's not an inexpensive purchase so this is very disappointing and discouraging.",
      "rating": 1.0,
      "verified": true,
      "author": "Renee Dowhaniuk",
      "helpful_votes": 2,
      "publication_date": 20200328
    },
    {
      "title": "Good for Beginners",
      "text": "This is a GPS guided drone that has amazing bells and whistles. This Drone flies and hovers pretty well. You will enjoy flying it. Taking off and landing were smooth. The Drone is flies really fast and maneuver really good. Make sure GPS feature is always on. Drone was assembled out of the box. Calibration was pretty straight forward Nice Picture and video quality. Pictures and videos are best taken when the drone is steady. Flight time was about 20 minute from each battery. Drone comes with two batteries and a dual charger. This is a great beginner drone.",
      "rating": 5.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Flying drone over homes in neighborhood",
      "text": "Takes a little bit to git it off the ground but with time it becomes habit of what steps to take with remote. Did have issues with remote control at first an after less than a week holy stone sent out new remote. Drone has a articualatin camera up an down which has amazing video an pic quality. Posted 10 sec video with review of HS 120D to show video quality an stability while flyin it. Hint to buyers, take your time an use all resources avail to git it off the ground an you will love this drone.",
      "rating": 5.0,
      "verified": true,
      "author": "mavman70",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Surprisingly good in wind",
      "text": "This product is very fun and for the price is outstanding. Was in significant wind yesterday and the drone did very well. I was not good enough with the controls to get it back to me in the wind so I hit the return to home button. The drone obviously fought the wind quite a bit but it did land softly right where it took off. The carrying case in excellent. The wifi signal is very weak, though, which is why I did not give it 5 stars. For a beginner like myself I definitely recommend this drone for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Grubb",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Good value for money",
      "text": "Overall, this is a very solid choice for someone who wants to learn to fly drone and does not want to invest a lot of money. Sort of like you don’t want to learn driving in Lamborghini. So this is definitely not Lamborghini. Pros: reasonable price, decent camera, easy controls. Cons: battery life (I got more like 12-15 mints), calibration process is a headache, camera rotates only 70 degrees which does make a big difference when you are trying to view objects directly underneath. All and all, this is a good choice for a beginner",
      "rating": 4.0,
      "verified": true,
      "author": "SydneyBristow",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great overall drone package!",
      "text": "This is a great drone if you want an all-in-one system. I was impressed with the carrying case, extra battery, and detailed printed instruction manual that included sticky tabs and a notes sheet! I had purchased many cheap drones and knew I needed a better drone to work with. This was the answer, the batteries are easy to swap out, the dual charger is excellent and accessories are plentiful. I have read the other reviews that complain that the features are hard to get to work. I would highly recommend testing each feature by the book in a big open area to get familiar with each feature.",
      "rating": 5.0,
      "verified": true,
      "author": "T. TRETTER",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "terrible product",
      "text": "feautures if worked would be good...customer support terrible...definately not a beginners object...every time you go to land ...in order to fly again have to recalibrate its useless....camera you got to go through a variety nof steps to get setup with app in order to view...such a nightmare....customer support said to take video of problems to get replacement...if you are by yourself and live alone you cant take videos and try and work the thing....glad i found out before 30 days.....sending back for refund....very disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "ED",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Perfect for the beginners and advanced fliers alike!",
      "text": "The Holy Stone HS120D is an amazing entry-level to advanced skills drone. With its GPS feature, the novice flyer can easily get out of situations that would cause bad crashes with less user-friendly drones. For the advanced flyer, the training wheels can be taken off via the iPhone or Android app and unleash the speed and altitude the HS120D is capable of. I can also speak to the durability of the HS120D. Despite its lightweight design, I have put the drone through a few \"rough landings\" that would have put other drones out of commission. It is very forgiving for those just learning to fly.",
      "rating": 5.0,
      "verified": true,
      "author": "andy bruner",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Good, but buy blade guards with it.",
      "text": "This is my first drone and did a bit of research for price vs features. The 120d was what I settled on. So far after 9-10 flights I can say I do not regret purchasing. It handles like I imagined has a reasonable range for control and many modes to tinker with, all of which I have not fully tested. I knocked one star off for not coming with blade guards, which in my opinion should come in this premium package. It comes in the cheaper bundles through other sellers. Whatever, I ordered a set with some extra blades.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Pleasantly impressed with this drone! 😁",
      "text": "I actually really love this drone it came in a very nice box but I was surprised when I opened the box it was actually already packed in the case that you would carry it in it was packaged excellently and I am no drone experts by far but setting up and preparing for first flight was fairly easy the instructions were to the point and intuitive all in all I had a really good experience with just drone so far camera quality could be a little better at far distances but for this price base it is an excellent drone!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua howlett",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "easy to learn, great value, and great fun",
      "text": "If you're like me and not sure you want to invest a lot in a drone before you have a chance to dip your toe in the water to find out if it's enough fun, then this is the drone for you. With plenty of cool options, especially the Follow Me mode, you'll get the drone bug fast. And I'm not suddenly seized with the urge to buy a bigger and more expensive device, this one will keep me amazed and happy for a long time, before I even consider a different drone. Well made, well packaged, and with great video and camera optics, this is the best drone bang for your buck.",
      "rating": 5.0,
      "verified": true,
      "author": "reader",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Don't be afraid that this is poor quality due to the value pricing.",
      "text": "The Holy Stone HS 1200 GPS drone exceeded expectations. This is the first drone I have flown, and I am a woman in my late 60's. The quality, features and packaging were excellent. Instructions in the manual, clear and the software for my phone was also user friendly. I was relieved that the drone was fully assembled. I had the drone in the air in no time and took over head pictures and a video of my farm easily.",
      "rating": 5.0,
      "verified": true,
      "author": "R. J. Warfel",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Came with broken battery",
      "text": "I would love to give this 5 stars but one of the batteries has broken contacts right out of the box. The first battery easily dropped into the charger, but this one wouldn't. I took a closer look and saw these two contacts bent and broken. I have sent email to company customer service today, I will update with response. The drone flies very well and comes in a nice case. Calibration is easy too. Kinda clunky app but I probably just need to figure it out. Overall very happy other than the battery",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Very sad birthday boy",
      "text": "Looks like a great product but ours was defective. This was the main gift for our son, so he was pretty sad. Luckily Amazon can get a replacement out fast. Wish I would have pulled it out and tested it before the party.",
      "rating": 1.0,
      "verified": true,
      "author": "JPK",
      "helpful_votes": 3,
      "publication_date": 20200208
    },
    {
      "title": "Great flying drone",
      "text": "Nice and stable for a toy grade drone ,takes a great video and pictures .Was a little hard to get going at first but after i figured it out it wasnt bad. I like the bag that is included, keeps everything snug.The controller feels like a pretty good quality controller. several slots for extra batteries and props.Comes with the manual, bag, extra props, sd card, adapter ,2 batteries , props already on the drone 2 charging cords.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Perrine",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "great to learn on, without giving up features",
      "text": "I bought this based on the fact it was for beginners, yet had a ton of features. Ive never flown a drone in my life until I bought this. I spent a day learning to fly. Learning the controls, and using the app to interact. Then I spent the next day really fine tuning my \"skills\" and using the video feature. As a total newbie, I was a bit overwhelmed at first. But it didn't take long until I began to understand how to use all the different features. This drone has everything I was looking for, and more. I highly recommend this to someone that wants to learn how to use these. It really is awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Jon P.",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Mind of its own.",
      "text": "Sadly, my son was only able to fly the drone for about 10 minutes. After that, it stopped responding to commands, and flew off to an unknown location. We are unable to locate it. He’s emailed the seller, and now we wait.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward Synek",
      "helpful_votes": 4,
      "publication_date": 20191226
    },
    {
      "title": "Great drone packed with features.",
      "text": "I purchased this Holy Stone drone because my grandson was having so much fun with his. As long as everything is synced it has operated without a flaw. At long distances the WiFi signal sometimes gets lost, but reconnects when it’s in range. Setting the RTH high enough is important to avoid crashing into something. No problem if you’re lucky enough to be out in the wide open. For the price, this has been unbeatable",
      "rating": 5.0,
      "verified": true,
      "author": "On the H2O Front",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "One issue for me",
      "text": "Packaging and product exceeded expectations. Good value and super fast shipping. Unpacking and using today so I will update review after some actual usage. So far would recommend! :-) UPDATE: Initial opinion was good. No problem flying or operating initially. However after downloading app to my Samsung 10e, I was unable to control the unit from my phone. No video feed, no pictures were enabled through phone. For me that was deal breaker. I returned the unit. Amazon accepted return and refunded promptly. Looking online I discovered that there was an issue with some android phones. Too bad, as the unit otherwise was very good.",
      "rating": 3.0,
      "verified": true,
      "author": "James W. Lutz",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "This is the drone you want , so go for it !",
      "text": "I crashed my drone about 15x and if there was a passenger inside , that person would not have made it on the first crash . But amazingly enough , the drone is still in one piece after the 15th torture. This is a great buy - what with a carrier/bag , 2 batteries and an extra pair of replacement parts . It has the features and functionality of a high-end drone , with a reasonable price tag . I enjoy flying my HS drone although practice is much needed still . I’m glad it’s forgiving .",
      "rating": 4.0,
      "verified": true,
      "author": "cecilia",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "The best video making experience with a Drone!",
      "text": "It's been so much fun making videos with this drone! Getting videos with audio and using wonderful tools like the follow me option and the TapFly! For the video I'm uploading I gave the drone 6 differents orders to fly around and with the music of The Yardbirds - For your love. It's beautiful! The case is really helpful to bring the drone everywhere you want without damaging it! Batteries are better than expected, lasting around 20 minutes each, when fully charged. It's a shame you can only upload one video, but I really liked the quality of the image when using the card instead of the phone for filming or taking pictures!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Mayorga",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Amazing drone for the price!",
      "text": "Ok so this is my first drone and I have to say this thing has made me fall in love with flying! It took me about 20 min to get the hang of the calibration and controls but for someone with zero experience I think that's pretty good. I was extremely surprised with how easy it was to fly and the pics and video it takes are pretty darn good. I absolutely recommend buying this if you're interested in getting started on the drone scene. The price and quality are too notch",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great drone, easy to fly!",
      "text": "I love this drone! I received it as a gift. It was easy to learn and get flying right away. Make sure to read all of the instructions before first use. That will make your experience better. Easy to fly. Very good battery life. Very light, and it performs well in light wind. I definitely recommend this drone for beginners and above, as well as for bloggers because the camera records at 1080p. I’ve downloaded the app for the drone, and it seems intuitive and easy to use on your phone. Great gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Nohuri",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Fix the Documentation and 5 Stars Easy!",
      "text": "The documentation could stand a proofread by someone for whom English is a first language. Not a serious problem though. The drone is surprisingly easy to learn. The learning curve is an easy slope. Some practice is needed to impart the need for gentle, smooth manipulation of the controls. The on-board camera is good, especially for the overall cost of the unit. Carrying case, a second battery, a bag of blades and such make the HS 1200 a great buy!",
      "rating": 4.0,
      "verified": true,
      "author": "W. B. Suddock",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "This Drone is Awesome!",
      "text": "I'm 48 and have never played a video game, so this took me a little while to learn. But, I love it now. I pretty much fly it almost every evening, just to relax. I like the GPS on it. I like how it lands right back where it took off from. The return to home is pretty cool too. I like the angle of the camera. I wish it faced down a little bit more, but going higher is just as good. I really like this drone. I will be buying more for gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Dayna L. Yetter",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great stuff!",
      "text": "The HS120D is a great little drone. It comes with everything you need to take it out and fly. I did have a few questions about start up. I called customer service and they were great. Answered all my questions. The quality of the drone seems to be good. It has a lot of options that other drone manufacturers do not include. This is my third drone and Holy Stone has the best customer service period!! Other manufacturers do it with email, which is a pain. Anyway, if and when I crash this drone I would purchase another Holy Stone drone in a minute.",
      "rating": 5.0,
      "verified": true,
      "author": "Joby Paschal-Kamp",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Camera cuts out, has mind of its own  would give zero stars if possible.",
      "text": "The drone itself is alright but the camera is terrible. I read these reviews and thought alright this could be good. First day I did not now the controls but got used to it kind of. Second day alright. Now on the third day camera shuts down. No longer works. I crash the drone because of that in the neighbors yard I have to ask them to grab the drone and they say yes. The camera is no good the propellers are easily broken and the drone sometimes just decides to take off and go where it feels like. Not durable. Not easy to control. TRASH. Save your money and get a mavic mini.",
      "rating": 1.0,
      "verified": true,
      "author": "SamzClubzoninsta ",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Not recommended",
      "text": "Camera angle adjuster didn't work from the beginning. Drone abruptly fell to the ground for no reason during the first flight. Fell two more time in the next ten minutes. Good thing I was flying it very close to me, or I might have just lost it when it fell. I am returning it while I have it.",
      "rating": 2.0,
      "verified": true,
      "author": "Minny",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Does not respond",
      "text": "After a long time trying to get it calibrated, I did. So, I took it outside, had strong GPS, was locked in beginner mode, lifted off my drone and it just took off. I hit return to home and it just kept going. Every time I tried it, it wouldn’t respond to anything but up. Response was sluggish at best. The biggest disappointment is that, all I did was hit the left joy stick to lift off and it went automatically up and down range.",
      "rating": 1.0,
      "verified": true,
      "author": "Edison Bryant",
      "helpful_votes": 2,
      "publication_date": 20200607
    },
    {
      "title": "Excellent drone for a beginner.",
      "text": "This is my second drone, the first being a little more than a toy. So by all accounts I am a beginner pilot. The remote control is very intuitive and the aircraft is easy to maneuver. I did have some trouble with the GPS on the first flight, probably because I launched it from a non-level surface. Consequently the props did some weed whacking in nearby brush before I could get the drone back under control. To its credit, the propeller blades held up very well showing no signs of damage. Although I still have much to learn, I can say that the HS120D is fun and exciting to fly, and is an inexpensive introduction to flying.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Awesome Beginner Drone",
      "text": "I've only had it a couple of days now but already getting comfortable with it and getting awesome videos and photos directly to my phone... ready to share with others. I can't use the phone to controll the Drone outside due to the sunlight washing out its screen. I instead connect the phone but the use the Drone's controller. I think the perfect solution would be a VR headset so it would be like you are in the Drone. That's what your phone is suppose to be used for but again you just cant see the screen enough outside",
      "rating": 5.0,
      "verified": true,
      "author": "John Albright",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great value!",
      "text": "This drone is a good value for its price range. It is easy enough for my 8 year old to control on his own without any help. The app works good and the video/pictures are nice quality. It doesn't take too long to charge and the battery lasts pretty long! The range is comparable to the price range. This is a good drone for beginners and is easy to setup. The return home feature makes it a good fit for those with little to no drone experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191006
    },
    {
      "title": "Loses control",
      "text": "It has some nice features and is fun to fly. Nice carrying case makes it convenient to take to a location for flying. What I haven’t liked is that sometimes it seems to lose control with the transmitter and just goes crazy and there is little you can do to stop it. The phone holder is not able to accommodate a smart phone in a case. I have an iPhone XR and it barely fits if I remove it from the case and doesn’t fit at all with the case on.",
      "rating": 4.0,
      "verified": true,
      "author": "Tinkled Toes",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Fun User Friendly Adult Drone!",
      "text": "I am a novice-hobbyist-father-of-2-quarantiner. I owned an inexpensive drone and started flying it more since being at home. I accidentally flew it into a distant tree on a foggy day and that was that. Read reviews and found the HolyStone HS120D was very well regarded and came in a very nice storage bag. Then i received it. I am extremely impressed with the technology for the money. It immediately presents as a well built instrument. You definitely need to read the directions to get started but after 15 minutes I was flying around after the kids on their bikes! great fun, learning the photography side next. Very cool and a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Quarantine Dad",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Not worth it",
      "text": "It worked for 5 min. Signal was lost and had to recalibrate and resynch and didn't work right. Wouldn't fly down.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie from Ct",
      "helpful_votes": 3,
      "publication_date": 20191207
    },
    {
      "title": "Even a youngster can use this.",
      "text": "Bought this for my 9 year old even though it recommends 14 and up. I have wasted a lot of money on drones made for kids and they have always been a disappointment. They never respond properly and end up in the yeah after only a few attempts. I thought I would try an adult beginner for him this time. At $160, it wasn't too big of a risk. My 17 year old figured it out quickly and shower the 9 year old house too use it and he was good to go. It has good control and the camera quality it pretty nice. Looking forward to better weather to capture more videos and fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Kari M. Oakes",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Great capabilities at a great price!",
      "text": "This drone can do about anything and do it well so it is great for a medium experienced flyer. However you can use just a few capabilities at a time and it is simple to run for a beginner because the instructions are great! Also, their customer service is fantastic, When I first received the drone, one of the motors was not functioning correctly. Their customer service rep was able to quickly discover over the phone that the problem was the motor and offered to send me a replacement motor for me to install with a great video or I could ship it back for him to install. I picked the first and was up and running in 3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas W",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Love it!",
      "text": "I got this as a present for my husband for his birthday. Having never bought a drone before I did a lot of research on the pros and cons to different models and this had the best reviews with a great price compared to others which did not have as many features. While I have never flown it myself, my husband loves it. The pictures he's taken of our house have been amazing quality. We are looking forward to being able to use it more this summer on camping trips.",
      "rating": 5.0,
      "verified": true,
      "author": "Wrs46",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Great for me and my 5 year old grandson !!",
      "text": "Bought the HS120D for my grandson and I. He is 5 and I am 53. This is the first drone for either one of us. I found the drone easy to set up and the instructions very clear and straightforward. We were flying within minutes. The HS120D is easy enough to fly in beginner mode that my grandson can control it and have a lot of fun. We love the features such smart return home and follow me mode. The android app works great on my Samsung Galaxy Note 9. So far I have no complaints with my first experience with a drone. The HS120D is lots of fun and a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Strong",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Best trainer for later advanced work",
      "text": "The HS 120D is my choice for a trainer for later professional work. It is below the half pound weight limit for drones you have to register to fly, but has all the features needed to train in procedures, such as GPS for station keeping. I need to learn how to load a flight-plan and way points into the drone and save it so I can exactly replicate a flight (for a time-lapse video montage). I don't see how to save the flight at this point. It's a well constructed unit. I recommend the bundle that includes the case, a spare battery (essential) and spares. I'd like to see more documentation on the fire hazard presented by charging the battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry D. Lowe",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Not recommended for beginners",
      "text": "Nice packaging. As far as the drone it self, I was dissatisfied with how difficult it was to connect and maneuver. I am a beginner and thought this should have been a much easier drone to fly. I would instead recommend the DJI mini, although more expensive, the difference is night and day. Have a safe flight!",
      "rating": 2.0,
      "verified": true,
      "author": "Sid",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Read reviews they are helpful!",
      "text": "Bought for my husband. I did read reviews before I purchased it. He lives it but since it a beginners drone don’t expect to be able to replace items. It does come with a crash kit but the it one. And it seems hard to get any extra parts ( which I did recall in one of the reviews). It took off on him the other day and would not respond ( another review I read). So it’s definitely a beginners and parts are hard to come by and it will take off on you and not respond. But for a beginners he has enjoyed it.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Amazing flying  mashine",
      "text": "I really like the drone. It is a very stable It has everything what you need, backpack to carry, 2 batteries, rechargeable remote control, extra spare parts, GPS mode, long flying mode, and much more. You or your child will definitely enjoy it. Buy the amazing drone and be happy It had everything what you need to enjoy and relax",
      "rating": 5.0,
      "verified": true,
      "author": "Boris Vilenskiy",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "HS120D works great and is a lot of fun!",
      "text": "This drone is a lot of fun. I like the RTH / GPS functionality and makes it better than my HS100D. It doesn’t do flips, but my HS100D does. It’s a good experience and I could fly it for hours (get multiple batteries and a powerful external power bank). The transmitter batter dies but you could charge it whole using it with an external power bank. For the money, and considering I’ve purchased and returned several beginner and advanced drones, this brand and the responsive, positive customer service experience makes it difficult to buy a drone from another manufacturer.",
      "rating": 5.0,
      "verified": true,
      "author": "DorkyPorky",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "It’s a piece of crap.",
      "text": "Calibrated everything set everything up per instructions. Took off and landed 10 times or so. The 11th time it took off and was COMPLETELY uncontrollable. It went straight up flew over the house flew about 100 yards and into a 70+ foot tree. Still in that tree. Dunno when or if it’ll ever come down. If I could get it down I would be sending this piece of crap back for a refund but since I don’t know when itlll fall out or said tree I’m out 150 bucks. Would NEVER buy one of these again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "good very durable",
      "text": "very durable, camera is okay but photo quality is only 2.5 megapixels. Charger needs more power than a standard USB charger, standard USB charger is 5W to 12W charger uses 17.5W. follow me feature is a little off, it Glides on a corner instead of straight. for those reasons I gave it 4 stars instead of 5, if you improve the photo quality I would give it 5. it can fly really high and it is fast.",
      "rating": 4.0,
      "verified": true,
      "author": "MamaK",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Super fun, stress relieving drone",
      "text": "Great little starter package. Came with remote, 2 batteries, chargers for remote and batteries, extra propellers and tools, nice carrying case and not to mention the drone itself. Drone flies smoothly but also takes time to master. It has many settings ( which i recommend starting at the beginner setting ) so you can master the flight controls and not lose your drone on its first flight. Make sure you are familiar with the drone and read directions first so you can have it calibrated perfectly. Totally fun and an awesome hobby to relieve stress during these trying times. Well done!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Hartman",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Drone is fine. Camera is crap.",
      "text": "Drone is pretty easy to learn, fly around, and all that, but the camera is horrible and picture quality is basically unusable for anything other than maybe posting on social media. The camera captures so slowly that the frames jagged and useless. Plus, the feedback to the device over wifi is so slowly and laggy that you can't use the viewer to actually 'fly' around. I've almost never looked down at the controller while flying because ... well ... it's just a useless picture and almost a full second delay. DO NOT LET THE \"SAMPLE VIDEO\" FOOL YOU POSTED ABOVE. That is in no way the quality of the camera on the drone.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Perfect for beginners",
      "text": "First drone ever purchased and first time ever flying one. It’s perfect for beginners. As I got better with it I realized that I wanted more distance from a drone, I want one that goes higher and further. The video quality is pretty good for the price . For some reason as I start flying the calibration is kind of off . For instance when I want to go right it’ll go left . But for the price it’s very good .",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley and Eric",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "My first drone, great support from Holy Stone",
      "text": "My first drone, seems like a nice unit. I think it will take me some time to learn to fly it. Great support from Holy Stone, they have been very responsive and supportive. I had a pretty bad crash right at at the start and they are fixing me up. Great company to buy from!",
      "rating": 5.0,
      "verified": true,
      "author": "Scout7",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great 1st drone",
      "text": "This was such a fun and easy drone to fly. This is our 1st ever drone and it really has been a delight, the camera records so clearly as well and a long distance as well. The battery last a good amount of time and while using one I have the other charging. I like the fact that it displays when its out of range or low battery. The follow me feature works great as well. There is nothing I don't like about this drone.",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel R.",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Good drone for the money",
      "text": "Good drone for the money. Had a problem with the control charging and did a defective return with no problems and super fast. Other than easy to use great video performs all its functions well",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20191003
    },
    {
      "title": "Drone",
      "text": "Our son loves his drone. He is 18 years old and enjoying this product. Easy to fly and hook up to his phone. You do need a device to help run this piece. It has the ability to follow you and doesn’t just get lost. The GPS system allows it to only go a certain amount away from you. It even lands itself if it is running out of battery. For a cheaper drone this was a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "M.",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great drone, excellent customer service.",
      "text": "This drone is pretty easy to set up and control, and you can see what the drone sees on your phone as you fly. Super fun! The photos and videos that are automatically saved to your phone are not amazing quality. There is an on-board SD card that stores better quality, however the camera with my device wasn't working. I emailed the company about this and they were very polite and sent me a replacement camera within a few days! Thanks, guys!",
      "rating": 5.0,
      "verified": true,
      "author": "kristopher j wolff",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Fun birthday present!",
      "text": "What a neat drone! This makes a great birthday gift for someone. We got it for my step dad who has been wanting a drone with video footage on it. He's a beginner when it comes to drones but has learned very quickly with this drone so I would say it is great for beginners. I love all the extra things that it came with- like I said before, perfect bundle for a birthday gift!",
      "rating": 5.0,
      "verified": true,
      "author": "ACMC",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great drone",
      "text": "I watched video reviews online before purchasing but I am still pleasantly surprised by this drone. I really like this package with the extra battery and the carry case. Overall, this is very fun and high quality drone for the price point. The company also has great customer service as I did contact them several times with questions. I do highly recommend this drone.",
      "rating": 5.0,
      "verified": true,
      "author": "Dudeth",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Good cheap drone for fun, not for making cool videos.",
      "text": "Good product to get a birds eye view. Lots of little issues (like the drone is very unstable both sitting on its legs and flying) but the thing works and it’s cheap. The drones camera isn’t that great and it doesn’t have a gimbal so you do get shaky video. Great drone for real time viewing but I certainly wouldn’t want to use it for video making. If you are looking for a good drone to shoot footage with this isn’t the drone. I have a DJI mavic air 2 which I use to shoot footage with.",
      "rating": 3.0,
      "verified": true,
      "author": "Grant Schaedig",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Very Happy with Holy Stone",
      "text": "Came fully assembled. Well packaged in padded case. Looks and feels well manufactured. Easy to fly even for a senior citizen. Emailed Holy Stone customer assistance a couple times with questions and got answers back within 24 hours. Considering time zone differences that is super!! Drone does not come with propeller guards so if you require they must be purchased in an accessory kit for about $12. Kit includes other things besides propeller guards. I am happy with my purchase of Holy Stone Drone HS120d",
      "rating": 5.0,
      "verified": true,
      "author": "dottiedaddy",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "This thing is amazing",
      "text": "I was flying yesterday and it went too far off and my transmitter lost control, I was recording. We went looking for it in direction it went. 20 minutes later I had about given up and I opened the map in my controls on phone and there was a dot blinking and beeping. Turns out my drone had flown back to very spot it took off from. LOL This thing is hard to loose. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Woodard",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Great except for a few downfalls",
      "text": "The drone is good flys well but having other drones I see a few faults First the batteries are really hard to get out really hard Second the charge cradle has only about a foot of cord which is very bad 3rd the way the batteries are made there is no way to hook them to a balance charger or put them in storage mode Very bad for lipo batteries",
      "rating": 4.0,
      "verified": true,
      "author": "Dennisg",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "QUICK as well as STABLE for those who are into selfies or just want to experience a BIRDS EYE view.",
      "text": "I use this product for family time/pass time and to help with some arial property views, it has proven itself 10 times over given its SIZE! It holds very well and is quick to repond to the controls, yet given its size it is also very QUICK as well as STABLE for those who are into selfies or just want to experience a birds eye view. They say you get what you pay for and yet I was given an AMAZING machine, must have been a mistake. 🤫 Thank You for an AWESOME product! 🥳",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Partridge",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great product and support!",
      "text": "As my first drone, I love this product and also the ease of use and options. I wasn't sure how easy it would be or if it would not last long enough (I know, 18 minutes seems like very short) but it is fun and I haven't even had a chance to be outside during the warmer weather. Given the social distance requirement in the past few months, I would highly recommend this drone to keep you from having to talk to your neighbors :) Except if the battery dies and you have to go fish it out of the trees! This has only happened to me once otherwise it returns home rather quickly. Overall highly recommended product!",
      "rating": 5.0,
      "verified": true,
      "author": "azreader",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Easy to use and Fun",
      "text": "This Drone is easy to use and tons of fun , I love the picture quality and the batteries last a long time too . Took it out to the local park to play and it responds very nicely . Also this was a little windy day as you can see on the video but the drone handled it like a champ .",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Harris",
      "helpful_votes": 2,
      "publication_date": 20190926
    },
    {
      "title": "Great beginner drone!",
      "text": "This is a great drone that provides a good introduction into drone flying and lets you do many of the things you want to do --- fly, move, take video, and take photos. It is easy to learn and comes ready to fly practically right out of the case. Holy Stone provides good support and many instructional videos on YouTube. I like it, and I am learning more as I use it more often.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Newman",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "awesome for beginners",
      "text": "This is a great unit to get started with drones. This was my first experience with drones and I was able to get everything up and going within minutes. No issues whatsoever, video is great and super easy to control the device. The case, extra battery, good video and over all simple controls along with the setup of the unit is just overall great for beginners. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hamed",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Well.... Let's see.",
      "text": "This drone is ok and I went with Holy Stone because I purchased the Predator drone From them for 25 dollars and IT is a durable drone that performs amazingly. I figured, this company makes quality equipment. So I ordered this drone and from the moment I tried to get WIFI up and running it was a failure. The quality of the materials is less than. I paid 186 for this drone but so far has been worth less than the 25 dollar predator drone. I have a replacement coming... We'll see how I feel after this one arrives. Hopefully the WIFI will work. Same model.",
      "rating": 2.0,
      "verified": true,
      "author": "nathan",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Great Drone for Anyone!!",
      "text": "This drone is awesome, learned to set up and use in no time! Great to see how your roof is doing, especially in Florida, great for pics of the surrounding area, and just plain great fun! I highly recommend this drone and we have owned others before that were more expensive. This one is perfect at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne D.",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Well worth the money",
      "text": "Is strong is very strong built. Is great for a beginner. We have crashed it at least five times and it’s not had anything break on it the battery life does seem to last about 20 minutes the only thing that I do not like is every time you try to steer it one direction it goes to complete opposite direction.The return feature does very good I Camera on it does wonderful it has very clear pictures they takeoff and land button it does do really well on thatI would definitely recommend anybody for a beginner graven intermediate to buy this product it is well worth the money",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Easy to use and excellent features.",
      "text": "Easy to use out of the box. Nice controls easy connections and clear video. Exceeded expectations. Had a motor issue, made a call and they replaced immediately with no issues. This is why I love Amazon. Replaced in a few days but was within the thirty day window. Other than the issue which seemed to be isolated based on other feedback we really like this drone. Height and distance are great especially having the ability to use different modes. I will probably stay on beginner mode for a while. I would buy again. Good price for a good product. Will upload some video. But again out of the box and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "matthew carmichael",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Great Product for the Money",
      "text": "This is a excellent quadcopter for the price, and comes with 2 batteries plus a VERY nice carry bag. If you price the individual items separately, you will see that this package is a bargain. I am very happy with the HS120D and find it performs great. You need to actually read the instruction manual to get best performance. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "OverTheHill",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great for teens and adults",
      "text": "With a 1080p camera it stands up to age and is fun for all to use I wouldn't recommend flying this indoors in tight spaces but if you can get an open space outdoors you can just let it go and have all the fun you want. Perfection for beginners. Comes with a travel case, extra props and TWO batteries",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Great beginner drone. Well worth the money.",
      "text": "Bought this as my first drone before I stepped into a higher end model. Came with two batteries which are a necessary if you want a good flight day. GPS seems to work and drone hovers well. Return home is a great feature, as the battery is nearing low voltage the drone will auto return and land which is great for beginners. Holy Stone is a great company to deal with. Very responsive and professional.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Nice drone, excellent mid-range with great features",
      "text": "Love the features - follow me and auto return along with mapping. Still learning - having to use my old phone bc new galaxy is too big for the remote holder - other than that, love the drone, GREAT battery life - looking forward to becoming proficient and using for mapping hunting land/search game trails.",
      "rating": 5.0,
      "verified": true,
      "author": "choc",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Decent but",
      "text": "Rated 4 stars for FPV distance. Worked well, connected well and was easy to fly. Not a bad choice and probably the best one in this price range. You will lose video transmission after about 300 ft but can definitely fly for about 900 ft away so long as you maintain eye contact. Can always press the return home button if confused.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay B",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "HS120D - My favorite Drone",
      "text": "This Drone was exactly as described. In fact, it was even better than I expected. Its \"one key takeoff\" and the 3 \"automatic return to home\" functions are great. If it's running low on power, it will come back home. If it loses the signal, it will come home. If you hit a specific button, it will come home. The camera/picture quality is very good and overall, it was a GREAT decision to purchase the HS120D!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Kesler",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "very pleased with my drone.",
      "text": "received my drone two days earlier than was told. Which was amazing. It was very easy to load app and setup drone to be ready to fly. Only took about 3 minutes to do it all. Camera was pretty good. Good photos and video quality. Drone is pretty little and durable. Still learning the tricks but am very happy with my holy stone drone and will be upgrading to another one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN ALLEN",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Great drone for the price and features",
      "text": "This is a great drone. It was very easy to set up as well as to fly. I read the good reviews before I purchased the drone but was still slightly skeptical as it was a decent price. Very cool. Bought for my 12 year old son and he learned to fly it very quickly. Photo's and video look very good. To get great picture you just have to stop and hover the drone we have found. Battery life was long lasting and since it came with two batteries it worked out very well. Easy setup for the phone app. Overall my son and I are very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Steele",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Great for learning to fly. Not so much for video / pic quality.",
      "text": "This has been a great drone for myself, as a beginner. Flying controls such as Headless Mode have a big impact. Although new, I have been disappointed in the quality of the pics & videos. And the “jerkiness” of adjusting the camera angle. Great for learning the basics. Leaves room for improvement on other areas. Overall, I’d rather learn with this drone 1st, before stepping up to one of the bigger boys.",
      "rating": 3.0,
      "verified": true,
      "author": "Psheehan19",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Fun drone at a great price point!",
      "text": "The HS120 comes in an amazing carrying case that protects the drone and keeps all your gear together. When it's time to fly the set up is quick and easy. This drone is very nimble in the air and is very fast! We flew it around dusk and the lights make it very easy to see and orient. Holy Stone customer service has been great and I would buy this again.",
      "rating": 4.0,
      "verified": true,
      "author": "Georgia Golfer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Fun drone with good pics and video",
      "text": "First off ~ fabulous customer service! Fun drone to fly, once you learn how LOL I am not a \"gamer\" so it took me a little bit of time to learn how to use the controller but with practice, I got it. We bought this drone to survey our property. It works well to check the fence lines and get a view of the animals.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Duncan",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Fun fun fun. Buy it.",
      "text": "Bought this as my very first drone. This little drone is perfect! Image quality especially outdoors is amazing. Fun to fly around the house, out the front door, over the house, then back in the back door. First, the build in-flight modes, work. Auto take-off, auto land, etc. work extremely well. It takes off and hovers in place and is so stable it gives you the ability to get a feel for the drone. really amazing out of the box. Overall, a super drone that acts like a professional drone, not a toy. Buy it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryon Tilton",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Good quality for beginners.",
      "text": "I unboxed the drone and set up for calibrations. The images in the book on how to turn the drone was not really clear. So my first attempt was not successful. I watched a youtube video and it was so clear and easy. I crashed a few times in the house. Glad we have extra blades. But our early morning take off went perfect. Got good pics of the neighborhood. The quality of the pics and video was really good. I would buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Harvey",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Lots of nice advanced futures for a beginners drone.",
      "text": "Our first drone to learn before we buy a more advanced drone for fun only. Like making videos and take pictures. Already bumped it twice but it seems very durable with no damaged so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Marta Prinsloo",
      "helpful_votes": 0,
      "publication_date": 20191026
    }
  ],
  "product_meta": {
    "title": "Holy Stone HS120D GPS Drone with Camera for Adults 2K UHD FPV, Quadcotper with Auto Return Home, Follow Me, Altitude Hold, Tap Fly Functions, Includes 2 Batteries and Carrying Backpack",
    "description": "Holy Stone HS120D GPS Drone with Camera for Adults 2K UHD FPV, Quadcotper with Auto Return Home, Follow Me, Altitude Hold, Tap Fly Functions, Includes 2 Batteries and Carrying Backpack",
    "rating": 4.4,
    "feature_bullets": [
      "Built for Adventure: The specially designed backpack can carry everything for HS120D, allows you to take this drone anywhere, incredibly convenient for travel and outdoor",
      "2K UHD 120° FOV Adjustable FPV Camera: Capture high definition footage ( 2048*1152p) and directly save to your smartphone; Gesture Control: pose to the camera, you can take automatically generated photos and videos, share it instantly with friends on social media.",
      "Smarter Return Home: GPS assisted flight, it can perform automatically return home when the drone lost signal, out of range or low power, never have to worry about flying it away",
      "Follow Me, Object Trace, Custom Path: The drone can trace and automatically follow you, let you focus on the moment, take a good selfie. Besides, it will fly as you want once you set a unique path",
      "Better Flight Experience: 2 batteries give you up to 36 minutes immersive flying experience, 250g lightweight yet powerful, save you from FAA registry. Headless Mode, Altitude Mode and One Key to Take-off / Land functions make it so easy to operate"
    ],
    "specifications": {
      "Product Dimensions": "10.63 x 10.63 x 4.72 inches",
      "Item Weight": "7.8 ounces",
      "ASIN": "B07TV1J4KW",
      "Batteries": "2 Lithium Polymer batteries required.",
      "Customer Reviews": "4.4 out of 5 stars1,801 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#1,932 in Toys & Games",
      "Date First Available": "September 19, 2019",
      "Manufacturer": "Holy Stone"
    },
    "categories": [
      "Hobbies",
      "Toys & Games",
      "Remote & App Controlled Vehicles",
      "Remote & App Controlled Vehicles & Parts",
      "Electronics",
      "Quadcopters & Multirotors"
    ],
    "price": 169.99
  }
}