{
  "website_summaries": [
    {
      "verdict": "The affordability, comfort, and support of the Timberland Euro Sprint Hiker boots have earned praises from the reviewing community. Not to mention, they come in a lightweight and stylish package. Conversely, there were drawbacks. Taking everything into account, the Euro Sprint Hiker from Timberland is a day hiking boot that can let outdoor lovers cover more miles. Users, however, must be cautious when using it on wet grounds.",
      "pros": [
        "The stylish look of this hiking boot has received flattering remarks from an abundance of hikers",
        "The majority mentions that the Euro Sprint Hiker from Timberland runs true to size",
        "A large number of online buyers are delighted with its budget-friendly price",
        "Its lightness has impressed a huge percentage of outdoor enthusiasts",
        "Hordes of wearers laud the comfortable feel of the boot",
        "The Timberland Euro Sprint Hiker boots give plenty of verified purchasers a satisfying fit",
        "A considerable number of avid hikers mention that it gives them adequate ankle support",
        "A lot of owners praise the Timberland Euro Sprint Hiker as breaking it in was not necessary at all"
      ],
      "cons": [
        "A couple of online buyers are frustrated with the boot’s quality",
        "They have noted that it fell apart after a few months of use",
        "Some consumers do not approve of its unreliable traction",
        "A portion of them has mentioned that it has zero grip on wet surfaces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.6,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor Fit - Too Large",
      "text": "These boots are too large, despite all my other walking/hiking boots being a perfect fit in the same size. After a few weeks of wearing the inside of the heel area has completely worn away. Do not waste your money, these are not for hiking, just for fashion. The soft outer construction means your foot will move around inside the boot after a few weeks usage and this will cause heel rub. Now an expensive pair of gardening boots.",
      "rating": 1.0,
      "verified": true,
      "author": "Malcolm Oakley",
      "helpful_votes": 5,
      "publication_date": 20190510
    },
    {
      "title": "Timberland Men’s Euro Sprint Hiker",
      "text": "I haven’t actually worn these boots too much, yet - tried them on on receiving them - and the fit is just as I expected (I’m a UK size8) - they feel snug (not tight) and warm. Quality product as you’d expect from Timberland - and I bought them Because I’ve another pair of Timberlands that I’ve worn for years, that have been absolutely brilliant (waterproof, warm) throughout a number of winters. Not cheap, but if they’re as good as my first pair - definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Brierley",
      "helpful_votes": 2,
      "publication_date": 20200128
    },
    {
      "title": "3.5/4",
      "text": "When I ordered them, the pictures were of a different color scheme. After I got them I googled the color name and figured I got the right ones, but not the ones I thought I was buying. Didn't want to dispute it for said reason as I'm satisfied with them, but then again I wouldn't buy them if I thought they're all black.",
      "rating": 4.0,
      "verified": true,
      "author": "Tomo",
      "helpful_votes": 2,
      "publication_date": 20191027
    },
    {
      "title": "A Good Fitting Boot, Careful Where You Wear Them.",
      "text": "I got these to replace some Timberlands I've had for a few years, a similar style but it seems that in a few years they have updated a few key elements, for one the sizing is a little closer to standard and this is helped by the fact that the padding is a bit more firm, I love the colour, but I would say if you want them to last be careful in what conditions you take them out as leather is textured so dirt and wet will tend to stick and stain, dust shouldn't be a problem. They are comfortable once they seat in, a really nice boot, great style, I hope they last.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Good for £42 (sale).",
      "text": "Good fit ,comfortable boots didn't have to break in.nice and lightweight.nubuck leather is a bit on the thin side,would be stronger in normal leather. Sole is very slippy underfoot on certain surfaces in wet conditions.beware tiled floors and metal drain covers. I only paid £42 for them which seems to be a bargain,would not pay £80-£100+,which seems to be the asking price now. Use beeswax to waterproof if you buy nubuck leather,DONT use normal boot polish. Just seen identical boots on other buying sites for between £20 and £25,these boots must all come from the same factory with different manufacturers badges on.RIP OFF.",
      "rating": 3.0,
      "verified": true,
      "author": "andrew hargreaves",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Looks good. Feels weak.",
      "text": "The shoes look really good. I've had them for a good number of months now. I tend to be rought with my shoes - so I hope that helps you understand my review. The problem I have with them is that they will constantly let me down in wetter colder weather as the Base doesn't have as much grip as I'd want. Terrible shoes to wear if it gets icy and slippery. Not really hard-wearing shoes - which is what I should expect with these kind of timberlands. Otherwise they look good.",
      "rating": 3.0,
      "verified": true,
      "author": "Asif",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "5 stars",
      "text": "From the first look of this product in the photo I liked the style/look but the reality was even more impressive with the quality of materials, built and finishing being every thing you would expect from a top brand like Timberland. However the true truth is in the wearing and after the first time out which was about a 6 mile walk my feet felt fine and ready for another 6 miles! And all of this with a 40% discount. Well I think this pair of boots deserve 5 stars! Peter",
      "rating": 5.0,
      "verified": true,
      "author": "P S HIGGINS",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Perfect",
      "text": "Love the boots!! Just too tight. I am a size 8 so purchased a size 8. And bought the same size 8 timberland 3 years ago and fitted perfectly. However these are a new version- not the same kind of boots. But have returned it and bought a size 8.5 Can't wait for it to arrive hopefully it will be fine! **update** Recieved the 8.5 and fits perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Butterfly Wings",
      "helpful_votes": 4,
      "publication_date": 20170803
    },
    {
      "title": "An excellent purchase!",
      "text": "I usually buy Timberlands from a store and was slightly dubious as to whether they’d be originals yet had nothing to fear. They’re absolutely gorgeous, authentic and come in half sizes too! I only wish the brown ones were the same price as they’re gorgeous as well. Don’t hesitate buying these as they’re comfortable, smart, light but not too light and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Comfortable and stylish.",
      "text": "Lovely comfortable boot, only thing is it doesn't seem that tight across the heel. It doesn't rub and walking is fine. Driving for any length of time though can leave an ache across the back of the heel. I'm talking 4 hours plus. I use them as my general daily office footwear, smart enough comfortable plenty. I did treat them with suede protector, so maybe that helped but I wore them to see the Foo Fighters at Milton Keynes (Hence the ludicrous driving time) and they got stamped on and covered in mud. Under the tap with a stiff brush and they look new again. Edit: These need replacing now. August 2015 - May 2019. Not bad.",
      "rating": 4.0,
      "verified": true,
      "author": "OFark",
      "helpful_votes": 4,
      "publication_date": 20150923
    },
    {
      "title": "Looks and feels like a good quality shoe",
      "text": "The reviews suggest it is not as good as it looks, but at least it looks good. For me this was a half a size too small. Other than that they will be useful if the weather changes.",
      "rating": 5.0,
      "verified": true,
      "author": "Only me",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Great boot really happy.",
      "text": "Had a few pairs of Timberland boots and they are comfortable and last ages. I normally buy the tan/suede colour but although the boot lasts ages the suede gets grubby really quickly. That is why I went for this colour this time, I have not had them long but they look like they will last and clean easily. Fit as expected as other Timberland, look great, feel good.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Craig J",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Comfortable and long lasting",
      "text": "Perfect fit again , this is the third pair of black timberlands bought great quality last quite a while reason for purchase , very comfortable as well",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great fit , superb and comfortable. Happy to add to my collection.",
      "text": "Like everything about them, looks good feels great not worried about the price. 10 / 10. I use them out and about or even around the house. Just a case of which pair to wear, as I have a few different pairs to wear a pair for everyday of the week, well almost.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart Whittington",
      "helpful_votes": 0,
      "publication_date": 20201103
    },
    {
      "title": "Ok ish",
      "text": "Genuine? I don’t know... I had several pairs of timberlands in the late 90s / early millennium, the quality of these seem sub-par, they’re fine, they ain’t great. Certainly don’t feel like they’ll last long looking where upper adjoins the sole of the shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Tony Mc",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Great boots",
      "text": "I've had several pairs of Timberland boots but I can honestly say that these are the best ones yet. They are extremely comfortable and go with pretty much any outfit. I realise that they are are on the pricey side but I can assure anyone interested in buying these boots ... You definitely get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "jeremy evans",
      "helpful_votes": 14,
      "publication_date": 20140923
    },
    {
      "title": "Comfortable one size up",
      "text": "I know Timberland are tight fitting and they don't have a wide fitting option, so I ordered one size up which fitted perfectly. Very comfortable to wear for long periods and seemed to grip slippery bits quite well. Great price and fast delivery so good all round.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Knight",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Just right",
      "text": "I’m still breaking them in but they are nice and comfortable. A bit narrow when wearing thick socks but just right when wearing ‘normal’ ones. If I were going to do much ‘serious’ walking I would think a size nine rather than the eight and a half would be better but for the casual walking I do they are right for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Winward",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Are they authentic",
      "text": "I’m not sure that these timberland boots are authentic. The reason I say this is in the past I have had many timberland boots but on the tree logo on the side of the boots there is normally a R next to it and these do not have it. They do have R on the sole, but I do agree with many of the reviews they are a good boot and fit well and will never (probably) go out of fashion",
      "rating": 4.0,
      "verified": true,
      "author": "darby",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Timberland Euro Sprint Hikers boots",
      "text": "My first pair of shoes I've bought from Timberland and it was between this or the 6inch classic premium wheat boot. I went for this due to comfort and value for money, simply don't think the 6inch classic boots are worth 160, no way. Tried the classic wheat boots but they are too narrow but these are perfect. Can't say how they are for hiking but for general casual wear they are comfortable & getting noticed all the time. The only slight annoyance is the color, it's slightly lighter than expected but it's not a major throw off.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryeed",
      "helpful_votes": 3,
      "publication_date": 20151026
    },
    {
      "title": "Awful boots!",
      "text": "Very disappointed with these boots, quality way below what I’ve come to expect from Timberland, in fact not convinced they are genuine products. Far too narrow with nasty, shiny, plastic looking leather that looked to be imitation. Terrible and sent straight back for a refund!",
      "rating": 1.0,
      "verified": true,
      "author": "Macco",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Pre-worn!",
      "text": "Arrived with quite alot of marks on the boots, I'm assuming these had already been sent out and returned by someone else. Shame as for the price I would have expected a pristine pair of boots..",
      "rating": 3.0,
      "verified": true,
      "author": "Jag",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Very happy with them.",
      "text": "Didn't think i was going to get these in time to give to my boyfriend for a late Christmas/NYE present but they came on the day of NYE which was perfect earlier than expected! Checked them before giving them to him and i was happy with them and so was he luckily the fitted as well so can't complain at all, verry happy they look even better in person than they do in the picture loved the carbon fibe effect!",
      "rating": 5.0,
      "verified": true,
      "author": "MissV94",
      "helpful_votes": 4,
      "publication_date": 20160112
    },
    {
      "title": "Good quality boots",
      "text": "Really nice and good quality as you would expect from Timberland and the boot is a little lighter than i thought it would be which i like",
      "rating": 5.0,
      "verified": true,
      "author": "Zulifkar",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Very comfortable Boots!",
      "text": "Excellent, comfortable fit! wasn't sure if boots will be as they looked as shown, was and still very satisfied wearing them.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen wayne",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Bloomin comfy boots",
      "text": "Like having your feet kissed by angels every time you take a step. Bought these as an everyday boot as didn't want to wear out my more expensive boots walking to the shops. I have wide feet and struggle to find boots that perfectly but these do. Love em.",
      "rating": 5.0,
      "verified": true,
      "author": "Conor",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Comfortable",
      "text": "Bought UK 12.5, in Apr16 for £82.50. Really comfortable. Easily marked so don't get if you're too vain and like your shoes spotless. I presumed these were not waterproof but so far so good, although I haven't been in any big, deep, puddles, because I love them. Now on sale for £160 on Amazon, so I did really well on the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tb",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Great Boots",
      "text": "These boots look great IMO and are really comfy to wear. I wouldn’t pay full price but on the Black Friday deal they were good value. Although you probably could wear them to go for a walk in the hills I wouldn’t like to try and clean them afterwards, but as a good looking pair of boots to go out in when the weather doesn’t suit shoes then they are perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Havelectric",
      "helpful_votes": 0,
      "publication_date": 20201206
    },
    {
      "title": "Not really hiking boots",
      "text": "For the price they cost, and for the fact they are advertised as hiking boots this boots should have a better grip, not great on wet rocks and they should have an anti abrasion band all around to protect the leather from cuts caused from rocks.",
      "rating": 3.0,
      "verified": true,
      "author": "stefano",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Not really hiking boots",
      "text": "For the price they cost, and for the fact they are advertised as hiking boots this boots should have a better grip, not great on wet rocks and they should have an anti abrasion band all around to protect the leather from cuts caused from rocks.",
      "rating": 3.0,
      "verified": true,
      "author": "stefano",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Most comfortable boots...EVER.",
      "text": "Had my previous pair of Splitrocks for over 10 years...switched from wearing casually to gardening boots / odd job boots...basically abused them in their later years. Unfortunately, the sole came away in my left one whilst out in the garden last week...I went straight on to Amazon and was undecided between 3 pairs...so bought all 3...they are that good!! 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Worth it",
      "text": "Nice comfortable boot , good materials had not had any problems yet",
      "rating": 5.0,
      "verified": true,
      "author": "vincent",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Excellent price for these Sturdy Boots",
      "text": "I've been looking at these for a while as my partner used to have a pair that lasted forever so i thought I'd try and get some for my son. They also make your feet look nice and neat - not huge and geeky like a lot of other boots do! Got them at a bargain price so well chuffed!",
      "rating": 5.0,
      "verified": true,
      "author": "lcollins",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Eyelets",
      "text": "Had the boots for just over 6 months and 2 of the eyelets have come off. For £100 I would have expected the boots to last much longer. Too loose now to wear.",
      "rating": 2.0,
      "verified": true,
      "author": "kevin black",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Make sure you buy 1/2 size bigger!!",
      "text": "Ok so quality product but advise for anyone purchasing is make sure you buy a 1/2 size up so if you are a size 8 buy 8 1/2 otherwise they will be a very tight fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave & Tracy",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Comfortable When Worn All Day Every Day.",
      "text": "All the attributes of these boots are as expected. I purchase these types to wear for work. They are comfortable enough to wear all day, every day.",
      "rating": 5.0,
      "verified": true,
      "author": "SupaNeck",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Fab! Shoes",
      "text": "This shoes are completely as fine as you would expect any Timberland product to be as it looks really well put together especially being my second pair. I would have given it five stars but for the small issue I have wearing them with some pains just above my big toe which is quite unusual to me as I wear one already so my wife feels I would have to \"break them in\" as they're exactly my size and fit my feet properly. Apart from that, I would say they're splendid pair of shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Femi",
      "helpful_votes": 0,
      "publication_date": 20140702
    },
    {
      "title": "Compfy",
      "text": "I brought these for my partner and he says they are great a bit like slippers compfy wise!! great for an outdoor shoe!",
      "rating": 4.0,
      "verified": true,
      "author": "Avid reader",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Brilliant",
      "text": "Bought for my partner at Christmas he never has them off so great value for money very pleased with product",
      "rating": 5.0,
      "verified": true,
      "author": "amy",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Bad product",
      "text": "the timberland silver sign on the heel comes off so easy they have changed all Timberlands like this the sign is embossed into the leather now.",
      "rating": 1.0,
      "verified": true,
      "author": "Iain kerr",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Didn't try as they didn't turn up",
      "text": "I am afraid I cannot review these boots as they didn't actually arrive. I sure they would have been fine as I have been very happy with Timberland boots in the past but I will never know now.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr Drewdrop",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Good fit and support.",
      "text": "Excellent boots. Never disappointed with Timberland. Good support and fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzie",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Excellent pair of timberland boots👍",
      "text": "Stunning pair of boots they fit perfectly and are very comfortable would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "What you see is what you get happy days",
      "text": "Looks and is as described very happy unfortunately sometimes things look nothing like the picture when you come out but these Boots I cannot complain very happy I will be purchasing another pair",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Fraser",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Couldn't be happier!",
      "text": "Absolutely gorgeous boots!! Haven't given them much a test run as I've been waiting for my kiwi shoe protector short which came today. Applied that and tested some water on then, still feels like seude but the water beads on contact and sides straight off.",
      "rating": 5.0,
      "verified": true,
      "author": "Bohannon",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "My first pair of Timberlands.",
      "text": "They look even better ‘in the flesh’ than the photo. They fit well and look really smart. I’ll use them as everyday footware rather than serious walking boots. Happy, especially at the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Noggin",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Excellent boots that aren't too heavy.",
      "text": "Very prompt dispatch and delivery. Great boots at an excellent price. Really looking forward to heading out in them.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Richardson",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great for school",
      "text": "Brought for my son to wear to school, have choose this brand and type of shoe for him at school since his third year in primary, no other footwear takes a beating on the school playground like these and still look decent! Clean up easily and look smart for longer than normal school shoes",
      "rating": 5.0,
      "verified": true,
      "author": "Jaye",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Look o.k",
      "text": "Brought some foam innersoles for a bit more comfort ...",
      "rating": 5.0,
      "verified": true,
      "author": "Frizzy51",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Be careful of what you purchase from Amazon...",
      "text": "I purchased a pair of so-called Timberland boots that are just horrible. Firstly they are not Timberland and after just being worn once that have started to widen. The boots were a gift from my wife but was ordered through my Amazon account while my wife does not have an account with Amazon. I have had the boots since late August but wore them for the first time on Monday 2 October because my birthday is on the first of October. I an now getting a message from Amazon that the return date has passed so I am stuck with a pair of very bad boots... that I will never wear again.",
      "rating": 1.0,
      "verified": true,
      "author": "ivory",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Quality Boots.",
      "text": "Absolutely love them, recommend! Considering that on the Timberland website this would be £60 more, I wasn't expecting to receive something this great. They are 100% original, the colour is amazing,It is not the first time I have purchased Timberland boots, but it's the first time I am buying from Amazon, at this price I wasn't dissapointed. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Wow.. amazing looks",
      "text": "just what i needed for christmas :) looks fabulous and love the design along with blend of colours .. high quality and highly recommended as a gift or even to treat yourself .. love it all the way",
      "rating": 5.0,
      "verified": true,
      "author": "Dev",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "I live in these boots!",
      "text": "Very well made, strong but extremely comfortable. I am diabetic and have lost the feelings in the soles of my feet. These support my ankles without being too high and intrusive. I feel vey confident in these boots and know that even if I stand on a nail my feet are safe!",
      "rating": 5.0,
      "verified": true,
      "author": "EFH",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "sweet fit n price",
      "text": "great fit and they proper sweet with dark blue Hilfigures proper buzzing they arrived in time early lolz like 1st thing in morning :) so happy aboot that, great fit nicely priced Recommends for timber fans especially.",
      "rating": 5.0,
      "verified": true,
      "author": "rastacookie",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Husband loves them",
      "text": "Tim's have been my husbands favourite. Cannot say anything bad",
      "rating": 5.0,
      "verified": true,
      "author": "Mai",
      "helpful_votes": 0,
      "publication_date": 20201128
    },
    {
      "title": "Smart and comfortable.",
      "text": "Arrived on time. The boots not only look great but are really comfortable. Really well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil Kincaid",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "VERY EXPENSIVE BUT WORTH THE MONEY 5*️⃣*️⃣*️⃣*️⃣*️⃣",
      "text": "THESES BOOTS ARE VERY EXPENSIVE BUT THEY ARE WORTH THE MONEY I ALWAYS BUY A HALF SIZE BIGGER SO I CAN WEAR THICK SOCKS",
      "rating": 5.0,
      "verified": true,
      "author": "TANYA",
      "helpful_votes": 0,
      "publication_date": 20201121
    },
    {
      "title": "Comfortable Timberland Boots.",
      "text": "Purchased these Timberland boots purley as a replacement for his previous Timberland boots. Found them to be extreemley hardwearing and have outlasted any of my son's previous school shoes. Never looked tatty even when it was time to replace after over a year of wear.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Mcdonagh",
      "helpful_votes": 6,
      "publication_date": 20140926
    },
    {
      "title": "Great boots for the price",
      "text": "Love these boots, bought the white logo'd one as they were much cheaper than the others (£50 cheaper) comfortable, waterproof good for walking long distances.",
      "rating": 5.0,
      "verified": true,
      "author": "Simon K.",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Good for the price",
      "text": "There’s boots are very well Made and good value for money we picked the black black ones and the writing was white as we wanted",
      "rating": 5.0,
      "verified": true,
      "author": "lydia",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "As expected",
      "text": "Fit was spot on. Its my first pair of timberlands so I have nothing to compare but they are very comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Another pair of amazing timberland boots fro amazon.",
      "text": "Very good quality product as you would expect from timberland. I paid half the price it was at my local shop. Have purchased a number of timberland boots from amazon and all are of good quality at a reasonable price. Can't express enough how happy I am with this product. Sides are leather with a Canon fibre pattern and the to is a soft swade material.",
      "rating": 5.0,
      "verified": true,
      "author": "Iftikhar A.",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "... buying Timberlands for many years and these are as good as always",
      "text": "I’ve been buying Timberlands for many years and these are as good as always. I normally wear an 8 shoe but always find the 8 1/2 comfortable in these.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevhman",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Excellent",
      "text": "Lovely shoes came in excellent condition and not like the UK version which I love.",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Thank You",
      "text": "really comfortable..fit like a glove and light..quality leather...I'm a happy man",
      "rating": 5.0,
      "verified": true,
      "author": "Davey",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Great choice!",
      "text": "Fits perfectly, really comfortable shoes. The only negative side is that they don’t have a good grip when it snows, they become quiet slippery.",
      "rating": 5.0,
      "verified": true,
      "author": "Washington",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "comfort",
      "text": "Very nice and comfortable shoe, but the heels on my old timberland boots wore down to quickly.....",
      "rating": 5.0,
      "verified": true,
      "author": "Paddy ryan",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Top boots",
      "text": "Fast delivery and amazing quality product. These boots are perfectly at home being used for walking threw the countryside or as smart boots when you are going out for the day. Very comfortable. Very well made. Good value as if looked after will last for years",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Just a great boot",
      "text": "Decided to buy these after slipping over one day. Best decision ever ! So comfy, so much grip, they look great, feet were kept nice and warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee R.W",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Best boot ever",
      "text": "An absolutely brilliant boot very comfortable straight out of the box",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan W. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "The ones you shoild purchase",
      "text": "Honestly the most comfortable boots I have ever bought. Normally wouldn't bother with a review but these are it. You have arrived. Sturdy, stylish and have had for a few months now with no sign of wear. Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170503
    },
    {
      "title": "Amazing, worth a buy!",
      "text": "I usually would not buy branded shoes on Amazon as I'm always afraid that they'll be knock offs, but that wasn't the case for these timberland boots. They fit perfectly with breathabilty, and they seem durable. The overall look is exactly as pictured, if not better. The weight of them is a tad heavy but that really is to be expected with such boots. Overall I'd say they're worth a buy especially at such a low price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sobia",
      "helpful_votes": 3,
      "publication_date": 20160823
    },
    {
      "title": "these seem lighter very comfortable and warm",
      "text": "My last pair of Timberland boots lasted 10 years, i didn't hesitate to replace them with another pair, these seem lighter very comfortable and warm. very pleased with them. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Excellent Value",
      "text": "Slightly loose. Not as fitted as I usually like boots to be. But excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "No regrets",
      "text": "These are great, fit perfectly and after months of use are still in perfect condition. It took some weeks to properly wear in but now they feel like a sturdy second skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Arne",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Moderately small for size also inside top of boot rubs on toes",
      "text": "Other Timberlands are deeper & I can fit orthotic innersoles & not rub on toes but great comfort if your feet are moderately smaller than size you order. Maybe they will stretch, hope so as got 2 pairs also pattern started peeling off the back of heal that's why they get only 1 out of 5",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer ",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Genuine Timberland Boots, a lot cheaper than on the High Street",
      "text": "Genuine Timberlands that are some much cheaper here than in the High Street shops. Extremely comfortable and look brilliant. Recommended and impressed with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "J.B.",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "So far so good",
      "text": "Bought these for work but still a bit too early to tell how good these are. But early signs are good, nice quality and feel well made just need the bad weather to come to test them. Delivery was unbelievably quick over Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Irwin",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Comfort",
      "text": "Great fit. Comfy. Durable. Everything you would expect for price and reputable brand. Always my go to boot. Love them",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Dudgeon",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Great boots",
      "text": "Nice and comfy boots look good as well well worth the money I paid and also arrived really fast",
      "rating": 5.0,
      "verified": true,
      "author": "Ian C.",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "A- as a street shoe, comfy and fit well",
      "text": "Definitely a street shoe, not a proper boot - but comfy and reasonable build quality. DO NOT consider it a hiking boot or even approach boot - more SUV than 4x4 - look good, comfy, lightweight",
      "rating": 4.0,
      "verified": true,
      "author": "Bert",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Timberland boots.",
      "text": "A Nice comfortable boot good quality item. Definitely buy again. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Connor",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Fab boots",
      "text": "Super fast delivery. I considered looking 1st and maybe returning. But when they arrived. They look better than in pics. Really smart and value for money after discount. Really happy.",
      "rating": 5.0,
      "verified": true,
      "author": "william carl phillips",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Absolutely 100% excellent. I do not need to say any thing ...",
      "text": "Absolutely 100% excellent. I do not need to say any thing else. The boots speak for them self. I would highly and I mean highly recommend these boots. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "steven martin",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Poor quality vs timberland products I have bought previously",
      "text": "Poor quality materials, really unhappy so will buy a different brand in future",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Fantastic",
      "text": "Fantastic quality. Will buy again in the future and highly recommend it to anyone who wants to make a purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Raul",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "I wear them for an average of 10 hours a day 5 days a week and they last me around 18 months before they start to look past thei",
      "text": "Bought these for work. They are SOOOOO comfy! I wear them for an average of 10 hours a day 5 days a week and they last me around 18 months before they start to look past their best and need replacing",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Richardson",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Great boots",
      "text": "These boots are great quality but check they send correct size",
      "rating": 5.0,
      "verified": true,
      "author": "C A DAVIES",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "perfect",
      "text": "what can you say about TIMBERLAND great quality and comfort this is my 3rd pair over the years and will buy again great for the winter weather .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Not waterproof ! Nubuck fading after a couple of hours!",
      "text": "This supposed to be a hiking boot meaning waterproof, got my feet wet on the first couple of hours wearing not to mention thee nubuck is already fading , if you're gonna use for any wet activity I do not recommend , disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Love these boots (5th pair I've bought)",
      "text": "Yeah yeah yeah! So if you're a middle-management type who wants to be down with the hood like me then these are the boots for you. Stepping into to work with these bad boys on everyone said I was ghetto-tastic. While I didn't know what that meant the smiling faces that met me and my new purchases confirmed that my staff do indeed love me despite their regular feedback to HR and senior management saying otherwise. WILL BUY AGAIN! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander King",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Poor quality. Not value for money.",
      "text": "Very quickly this product showed to be of poor quality. The leather creased within the first few wears. The tree logo on the back began to scratch away and after about 3 weeks the heel fell off. This is all through general wear a few days a week. Definitely not what you’d expect from Timberland.",
      "rating": 1.0,
      "verified": true,
      "author": "Ross",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Brilliantly comfortable",
      "text": "Arrived on stated date, as described, wonderfully comfortable. Only slight crit is that the laces are somewhat long, but that’s a niggle to a stylish, comfortable shoe I didn’t even have to wear in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "not very comfortable",
      "text": "Although I bough the correct size, but it puts lots of pressure on top of my feet and for that walking was very painful! Returned it. But I really liked the style",
      "rating": 2.0,
      "verified": true,
      "author": "Amir",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Comfortable and good for casual dress",
      "text": "Would of rather had upper heel part in leather apart from that love them",
      "rating": 5.0,
      "verified": true,
      "author": "johne",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Timberland knows",
      "text": "Very comfy, good suede leather with nice carbon details, warm and light",
      "rating": 5.0,
      "verified": true,
      "author": "Theodort",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Great boots",
      "text": "Great boots, very comfortable and look good. On some surfaces they are surprisingly slipper so be careful getting used to them.",
      "rating": 5.0,
      "verified": true,
      "author": "Cornelius ",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Great Buy.",
      "text": "Good product. Very nice looking. Being nubuck though I don't think anyone would wear them for hiking/walking.",
      "rating": 4.0,
      "verified": true,
      "author": "Lurvepump",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Strong and comfortable boots",
      "text": "They arrived on time and fitted perfectly, also an amazing deal on the shoes at time of purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Gurps S.",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Sizing",
      "text": "Ordered 1/2 size smaller, am a 9.5 but ordered 9 and fit great",
      "rating": 5.0,
      "verified": true,
      "author": "pennamespenname",
      "helpful_votes": 0,
      "publication_date": 20190103
    }
  ],
  "product_meta": {
    "title": "Timberland Men's Euro Sprint-Hiker Boots",
    "description": "Timberland Lace-Up Chukka in Green.",
    "rating": 3.5,
    "feature_bullets": [
      "Closure: laces.",
      "Material composition: see description.",
      "Outer Material: Leather",
      "Inner Material: Textile",
      "Sole: Gum Rubber",
      "Closure: Speed Laces",
      "Heel Type: Without Heel",
      "Shoe Width: Normal",
      "Heel shape: flat."
    ],
    "specifications": {
      "Date First Available": "28 Aug. 2020",
      "Manufacturer": "Timberland",
      "ASIN": "B08GXMNDC5",
      "Item model number": "TB0A22WJH081",
      "Department": "Men's"
    },
    "categories": [
      "Shoes",
      "Boots",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 86.45
  }
}