{
  "website_summaries": [
    {
      "verdict": "MSI's 34-inch ultrawide Optix MPG341CQR combines solid gaming performance with a raft of exclusive features, adding up to an ultra-quick curved panel that excels across nearly every metric that matters to gamers.",
      "pros": [
        "Innovative design and wide gamer feature set",
        "Decent color results",
        "Very low input lag",
        "Aggressively priced for its class"
      ],
      "cons": [
        "Overall HDR and movie quality is so-so",
        "Contrast ratio tested lower than advertised",
        "Built-in webcam is nifty but works only for facial recognition feature"
      ],
      "aspects": {},
      "publication_date": 20190920,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent for 1080p 144hz gaming",
      "text": "I highly recommend this MSI product to those who are seeking a 144hz 1080p monitor. I am just amazed at how a 27 inch monitor makes such a difference from a 24 inch, also the 144hz refresh rate makes things extremely smooth and the curve allows me to see everything easier. The headphone slot at the side of the monitor is also handy to keep the desk clean. Only thing I would be a bit critical of though is that the stand does stick out a bit too much for my liking. Other than that it is an excellent product by MSI.",
      "rating": 4.0,
      "verified": true,
      "author": "Kieren Williams",
      "helpful_votes": 5,
      "publication_date": 20190709
    },
    {
      "title": "Not worth the heavily discounted price I got it for...",
      "text": "Returned after using for less than 1 hour. Every feature and marketing information relating to this monitor is a gimmick. Picture quality was awful, colour, brightness and sharpness were on par with cheapest monitor's I've used. Pixels were flickering, as though they were unable to be fired all at once. Note, I have a gtx1080 and tried this on another machine and at different resolutions. There was definitely a reason why I got it for the price it was sold. It's all a gimmick. Not worth a purchase. Not worth the price paid.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Alexander J. Oram",
      "helpful_votes": 2,
      "publication_date": 20191114
    },
    {
      "title": "Excessive BLB",
      "text": "This was my first curved monitor. One's brain easily adapts to the new shape. I liked the design, features and refresh rate, Freesync worked flawlessly with G-Sync. Unfortunately I had to return it for excessive backlight bleed. I'm not buying another one like this. It looks like manufacturing process of curved monitors is not yet perfected as the backlight uniformity seems to be affected by mechanical stress put on LCD panel.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20200221
    },
    {
      "title": "Nice screen but makes my eyes hurt",
      "text": "Not sure why but my eyes hurt when using this screen. Not sure if it is the size of it or something else but i have changed a bunch of different settings but still there is something about it which isnt too great. I would not recommend. Update: This has only gotten worse as time went on so I attempted to get a refund and send this back as a monitor should not do this and I have never experienced this before. AO will not refund you all of your money only 70% of it so I would stay away from this product and from this company in the event that you are provided with a faulty/unsatisfactory product.",
      "rating": 1.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Dead pixels",
      "text": "I requested a replacement of this monitor and this time it came with few dead pixels! Huge disappointment from MSI and Amazon! BUY AT YOUR OWN RISK! Value your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Martin Ivanov",
      "helpful_votes": 5,
      "publication_date": 20190803
    },
    {
      "title": "Good quality",
      "text": "Exeptional colors...the only downside is that u need good graphics card",
      "rating": 5.0,
      "verified": true,
      "author": "Konstantinos Kasiotis",
      "helpful_votes": 5,
      "publication_date": 20190830
    },
    {
      "title": "Read it might help u out",
      "text": "Just got this monitor and a bit upset tbh the rgb light can't be one colour or can't even be changed for that matter playing fortnight on a xbox one s one 120 hrz the game is very hard on the eyes and it ever hard to notice far away objects change all the setting in the monitor and in the xbox and still no change but still worth the money as video editing look good I would say it worth the money but if It went down another 50 pound I would buy other 2 but not for 200 pound there other gaining monitor that are better the this tbh",
      "rating": 3.0,
      "verified": true,
      "author": "NIPPLE95",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Good quality and nice aspect.",
      "text": "My son is using it for his playstation, the first couple of days he wasn't sure if he liked it because he said it was to big and curvy and he wasn't used with that kind of monitor, but now he's got used with it and he really likes everything about it .He said it is a good quality and a smart monitor, he's also watching YouTube videos and movies and he can adjust the brightness how he likes. I believe is well worth the money and definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "danna",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Blurry in games",
      "text": "We bought this monitor for gaming but strait away we saw a problem compaird to our 2015 lg monitor 34\" the picture quality was bad blurry we tryd every thing to fix it even toms hardware setting but no good we tryd 1070ti 1080ti x570 radion just incase but still blurry very disappointed as we was hoping for real upgrade considering the spec so sent back for refund and looking on amazon for differant 34\"",
      "rating": 3.0,
      "verified": true,
      "author": "gary",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Could've been amazing, ruined by flaws",
      "text": "Going from 60hz to 144hz was incredible! I just wish I picked a better monitor to experience it. The RGB mystic light was the only thing that worked flawlessly. After around a week, I experienced heavy backlight bleeding from the corners where it curves. Around two weeks later I started experiencing weird flickering lines (see photos) and eventually just returned it. Awaiting on 144hz Samsung display as a replacement. Real shame, everything else I have MSI is top quality :-(",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Ritchie",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Best monitor I have used, I recommend it.",
      "text": "This monitor has a very nice, sleek design with thin bezels. Very immersive gaming experience due to the curved screen, crisp quality too when watching videos. Incredibly easy to install the stand and navigating the menus is just as easy with its stick control as opposed to buttons. I have no complaints of this monitor from my experience with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Thomas",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Didn't last long.",
      "text": "Firstly, the default settings are far too \"sharp\" and make text hard to read, but this can be tweaked and fixed. The bigger issue (in the photos) is the \"crosshair\" lines of pixels the monitor developed after just a few months (also present with no input connected so not the source at fault). It is now going back and I'm looking at alternatives.",
      "rating": 1.0,
      "verified": true,
      "author": "Stoofer",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Works perfectly",
      "text": "I have been using this monitor daily for a few months now. Fantastic purchase. Mess around with the settings a little to have it display as you wish. No trouble with blur or dead pixels. Crisp quality even playing FPS games with high sensitivity. Easy to adjust the screen itself, tilts at an angle and adjusts at a height to suit any user. Worth the £200 price tag I paid for it",
      "rating": 5.0,
      "verified": true,
      "author": "Jakeh100",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great screen",
      "text": "Would be nice if it was 1440p. I noticed pixels when staring at it but honestly when you're in a game you don't notice. 1080p means you can use the higher FPS if you have a mid range CPU/GPU. Nvidias Ansel really makes the quality stand out. Looks superb.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Highly Recommended",
      "text": "Impressive small curved monitor. Nice colour and not too bright for long term gaming or using office. The package was such big and strong enough to protect the monitor. My friend wanted one as well after testing the monitor. No dead pixel or obvious light leakage. MSI did a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "HolyDragonCasios",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "This Item arrived damaged and was returned before Christmas....I am still waiting for my refund",
      "text": "I’m sure it would be a great product if it wasn’t faulty",
      "rating": 1.0,
      "verified": true,
      "author": "Lil",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Bang on for the money",
      "text": "For the price this moniter is spot on ,not perfect but for the money im well pleased ,plays modern warfare smothly with only very minor ghosting",
      "rating": 5.0,
      "verified": true,
      "author": "Chib1977",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great overall 1440p monitor",
      "text": "I'm very happy with this product. I do a lot of research before I buy this MSI monitor. 1440p and 27\" is the best resolution for overall use. Curve on this monitor it's very nice and very fast to get use to it. After a 4 moths of everyday use, I don't have any problems, no death pixels, but for gaming on full settings you need a better GPU. Recommend for everybody who looking for great 1440p monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Clear, crisp, and stylish display",
      "text": "Immediate difference between this and an old 60Hz monitor. No longer having to deal with screen tears or unclear displays. Product has clear and crisp image as expected along side a sleek design. Would recommend this product to those who are after a 144Hz display for gaming. However would not yet buy this if seeking a secondary display as the price is still significantly higher than regular 60Hz monitor (which is ok for me as a secondary display).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Very happy and can game alot better now 👍",
      "text": "Very happy with purchase, delivery was ABIT mishap but got it rescheduled, if you want a good gaming screen I recommend this product comes with everything you need even a International plug power cable is well as UK standard one! Was very impressed easy to setup👍",
      "rating": 5.0,
      "verified": true,
      "author": "anime fan",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "I'm a happy camper:) can't complain to much",
      "text": "Pleased with this purchase only one thing some time on the screen you start to see blue,grin hase but still not regretting the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "goodman",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great display",
      "text": "Great option for a person on a budget but wants all of the features. Smooth due to the 144hz and 1ms responce time, curved display eliminates some of the colour fad from the va panel, and the 1440p is great only downsides are the va panel is not 100% colour accurate and the rgb back-light isn't the brightest and some may take it or leave it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Williams",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Perfect for the price",
      "text": "After a metric tonne of research I finally decided to bite the bullet on this bad boy and I haven't regretted it in the slightest. Superb picture quality, easy setup and it just looks incredible. Extremely happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kieran",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "This monitor is a beast.",
      "text": "Well thought out, well built, adjustable in so many ways and the preset modes to flick between if you're editing, gaming or watching films is so quick and easy. High quality. Very very very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Would Recommend",
      "text": "Works great with my 2060 from Asus, runs at 144hz and 1080p as advertised and has everything I need. Height adjust and tilt are included but the stand is quite large and will protrude into your desk space if you have a smaller desk like myself. Other than that would highly recommend as a midrange monitor",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Worth the price",
      "text": "The adjustable height is brilliant, picture and everything is very good. Worth the price",
      "rating": 5.0,
      "verified": true,
      "author": "damien overton",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "AMAZING GAMING MONITOR",
      "text": "Hassle free purchase that arrived on time and well packaged. Awesome gaming monitor.. definitely recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great for price",
      "text": "Monitor is very good considering how cheap it is compared to similar spec monitors. I have had little issues with the monitor, serves me well both in game and for media.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Impressed",
      "text": "Use it mainly for dev work. It is the right size if you are replacing multiple 1080p screens and want to keep the same (albeit smaller) UI scaling. USB C supports quick charge which was a pleasant surprise. USB hub is also handy. Read mode is nice if you don't mind inaccurate colours.",
      "rating": 5.0,
      "verified": true,
      "author": "SerjTS",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Meh",
      "text": "Yeah its ok but its a bit washed out looking, not overly impressed but for the kids its fine",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "GREAT MONITOR FOR 4K GAMING",
      "text": "The monitor turned up in great condition and has worked perfectly out of the box. Image quality is amazing. Games look good at 4k and i wont be going back to a standard monitor. The stand is well built and has full adjustment. It actually goes quite high which is nice! The build quality is spot on with the metal enclosure and metal stand base. Cant be Happier!",
      "rating": 5.0,
      "verified": true,
      "author": "James Bland",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Great monitor",
      "text": "Great monitor had no problems love the curve the quality and everything. If given the chance to buy another monitor I would buy the same monitor again as my second monitor! The one thing which I didn't like was the lights at the back they seem really pointless but other than that everything is perfect! 9/10",
      "rating": 5.0,
      "verified": true,
      "author": "Zaib",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Fantastic screen",
      "text": "Amazing! For this price you so okay won’t get better. This competes with some much more expensive screens, of which I’ve had a few) I feel like I owe MSI some money after this steal. So I bought the MSI 2080ti duke to go with it. Enjoy my money MSI, you deserve it.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "ghosting when on fastest respons time",
      "text": "Horrible ghosting when on fastest response time and the OSD is horible, not many settings to chose from.. also I cand find settings for freesync so you don t enev know if is working or not",
      "rating": 1.0,
      "verified": true,
      "author": "DownYo",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "So far so good!",
      "text": "Got this a couple of months ago, seems legit only issue is that weird popping noise almost sounds like it might blow up :O but apart from that it's well worth the price and runs at 115hz if you overclock it.",
      "rating": 5.0,
      "verified": true,
      "author": "pileage",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great value 1440p gaming monitor",
      "text": "Fantastic price for a 1440p 144hz monitor as they are often £500 or more. The picture quality is excellent and a big step up from a 1080p monitor. Low input lag and freesync makes it great for gaming. The build quality is very good with thin bezels and the stand doesn't take up too much desk space.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr J Evans",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "one of the best 24' 1080 144hz monitors",
      "text": "do you like a 24 inch monitor and want a display rate of 144hz that feels premium but isn't overpriced? Get this model.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Cl",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great 1440p 144hz experience.",
      "text": "A great monitor for gaming. would recommend for people who have a GPU powerful enough to run games at this resolution and frame rate. Otherwise your paying too much for something you wont truly enjoy or experience. The curve is great and it is good for many different viewing angles.",
      "rating": 5.0,
      "verified": true,
      "author": "Cameron Miller",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Perfect for gaming",
      "text": "I loved it since it came , I’ve been using it for few days now and it’s amazing , the contrast in the colours and the settings for the gaming are amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Awesome monitor",
      "text": "Wanted a good curved monitor for a while but didn’t really want to break the bank, so when I saw this I ordered it straight away and it is pretty damn great, picture is great, frame rate is awesome, and the curvature makes it really immersive",
      "rating": 5.0,
      "verified": true,
      "author": "twm lewis",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Dead pixel",
      "text": "Product is amazing, unfortunatly i seem to have a dead pixel on mine",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "This gaming monitor is amazing",
      "text": "I bought this gaming 144hzts monitor a couple months ago and it is really easy to setup and it is amazing, i recommend. This is brilliant for gaming",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Manson",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "decent monitor",
      "text": "The colors are good after a bit a tweaking. The preselescted modes are not as you expect but overall is a good monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Refresh + display",
      "text": "Love it, to get 144hz go to settings in windows, then display, then choose advanced options and choose the monitor and select 144hz. Recommend this!",
      "rating": 4.0,
      "verified": true,
      "author": "HypeR",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Faulty Item, refund was slow",
      "text": "Item was faulty , took a long time to receive refund from this supplier",
      "rating": 2.0,
      "verified": true,
      "author": "marie hunt",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Good product.",
      "text": "Product seems very good in the last week or so. No issues with any games, and the picture seems very good overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Rowe",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Value",
      "text": "This monitor is excellent for gaming, and at the price I cannot complain.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarjar",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Disappointed",
      "text": "terrible colour banding, have returned for refund. Expected better for the price tag!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennie",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "So far so good",
      "text": "Been using the monitor for a week now and have zero complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Cotton",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great monitor",
      "text": "Very nice looking monitor great for 1080p 144hz gaming hasn’t let me down yet, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle J.",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Fantastic!",
      "text": "Fantastic!!! Very very good! If you are not sure which one you want, go for it!",
      "rating": 5.0,
      "verified": true,
      "author": "mithrandir2010",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Performance of the Monitor",
      "text": "Good quality and there’s different types of features that you can change it too",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Angel Tan",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "AMAZING",
      "text": "My first ever monitor, and it is amazing. VA panel too and looks great. Would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Dead pixel but all in all a good monitor",
      "text": "Good monitor for the price, but sadly came with 2 dead pixels not that annoying, so didn't return it",
      "rating": 4.0,
      "verified": true,
      "author": "Jonas law",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Good value !",
      "text": "Nice screen. Good value and apreciated the early arrive and the free headset!! Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Razvan mare",
      "helpful_votes": 0,
      "publication_date": 20191201
    }
  ],
  "product_meta": {
    "title": "MSI Optix MPG341CQR Curved Gaming Monitor 34 Inch, UWQHD, VA, 144 Hz, 1 ms, 3440 x 1440, 1440p, 1800R, RGB Mystic Light, DisplayPort, 2x HDMI, Type-C, AMD FreeSync",
    "description": "Size Name:34 Inch, 3440 x 1440, 144Hz, Curved UWQHDSee Clear in the Dark Get the jump on enemies before they even notice you. The Night Vision is built to be easy on the eyes. You're not afraid of the dark, are you? Smart RGB Wondering how the weather will be? The MSI Optic MPG341CQR with its Smart RGB LEDs can be set up to show information such as weather through visual colours and animations. Unlock the Full Potential The MSI Optic MPG341CQR has a built in smart webcam that provides facial recognition which can change colour profiles based on the user it detects.",
    "rating": 4.5,
    "feature_bullets": [
      "Curved gaming display (1800R) – The best gameplay immersion",
      "Uwqhd high resolution - game titles will even look better, displaying more details due to the UWQHD resolution",
      "Game sense - Conductively enables external game alerts via RGB LED lighting with the hottest competitive online games",
      "144Hz refresh rate – The real smooth gaming",
      "1ms Response time - eliminate screen tearing and choppy frame rates"
    ],
    "specifications": {
      "Brand": "MSI",
      "Product Dimensions": "81 x 32 x 56 cm; 9.6 Kilograms",
      "Item model number": "MPG341CQR",
      "Manufacturer": "MSI COMPUTER",
      "Series": "MPG341CQR",
      "Standing screen display size": "31.5 Inches",
      "Screen Resolution": "3440 x 1440 pixels",
      "Resolution": "2560 x 1440",
      "Number of HDMI Ports": "2",
      "Are Batteries Included": "No",
      "Item Weight": "9.6 kg",
      "ASIN": "B07THFC6KG",
      "Customer Reviews": "4.5 out of 5 stars628 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "33,245 in Computers & Accessories",
      "Date First Available": "24 Jun. 2019"
    },
    "categories": [
      "Computers & Accessories"
    ],
    "price": 1117.16
  }
}