{
  "website_summaries": [
    {
      "verdict": "Whether you need to keep your kiddo's drinks warm or cold, this child-friendly YETI has features designed especially for little ones.",
      "pros": [
        "Offers a scaled-down 12oz size and large handle that make it perfect for smaller hands",
        "Cap with built-in straw is easy for kids to use and minimizes spills",
        "Just as useful at maintaining beverage temperatures as adult-size Ramblers"
      ],
      "cons": [
        "Seal may wear out prematurely, resulting in leaks",
        "Rare reports of dents upon arrival"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worth the price!",
      "text": "Love! Bought for my 15 month old because her plastic ones kept getting scratched from being dropped. She can’t open it on her own, and it leaks if the spout is open and laid down. If closed it doesn’t leak at all. Keeps everything cold!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 19,
      "publication_date": 20191114
    },
    {
      "title": "One hydrated kid and a happy mom!",
      "text": "I got the seafoam color and it is beautiful. My daughter loves it and it helps her stay hydrated. We use it for going outside in the Texas heat. So far, so good. It is not totally spill proof with the straw for my two year old but it's not enough to bother me considering it keeps her water cold and I've read reviews on similar top selling cups and it seems that is to be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueMist",
      "helpful_votes": 11,
      "publication_date": 20190906
    },
    {
      "title": "Get a Yeti!",
      "text": "The Yeti is so worth the cost. I bought my 6 year old granddaughter a Yeti for her 1st camping trip with the grandmas. She always wants her water cold! Her mom has one and loves it. It was a success on the trip. A week after getting home she accidentally left the Yeti on the ground behind a car. Yup it was run over. As you can see by the picture there are a few scratches but it works great. I Don’t know of any other thermo cup that can withstand being run over by a car. Guess what all the grandkids are getting for Christmas?",
      "rating": 5.0,
      "verified": true,
      "author": "LYNN M. JOHNSON",
      "helpful_votes": 3,
      "publication_date": 20200819
    },
    {
      "title": "Great quality",
      "text": "I wanted an insulated tumbler with a metal (not painted) bottom, on the smaller size. I'm an adult but I don't like lugging around 20oz water bottles. This fits the bill. I hesitated due to the price, but this should theoretically last me forever. I'll replace the straws or lid if that is ever needed, but the body should really last me as long as I need it. It's solid, durable, and you can tell the quality through the feel. I'm not necessarily into name brands, but I do think there's a difference between this product and similar cheaper options.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariah T",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great kids cup",
      "text": "My 2 year old loves her Yeti Rambler Jr. I bought it for her when she was 22 months and she was able to open it and close it on her own. I love that it will keep ice for hours - we boat often and needed a durable cup that would stay cold. Her 18 month old buddy can’t open it so you may have to wait until your kiddo is closer to 2. This will definitely be a cup we’ll be able to keep and utilize for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Jilian",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "great bottle! but heavy and not leakproof",
      "text": "This is a very well made bottle, which of course it's expected. my 2 yr old loves it and can handle it, open/close the spout by herself easily. It is heavier than I thought it would be. I have a similar water bottle (from hydroflask) that is bigger but lighter than this one. It is not leakproof at all. I have a handbag full of water if anyone wants to know :/",
      "rating": 4.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Great except doesn’t fit in cup holders.",
      "text": "Kid friendly handle and use. Warning to parents that it is only leak proof when closed, quite heavy, and most importantly DOES NOT FIT IN CAR SEAT OR STROLLER CUP HOLDERS. That being said, we use it every day and our daughter loves it. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles R Waychoff IV",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Keep on my nightstand, totally leak proof!",
      "text": "Wantes something for by my bed that wouldent spill all over... this thing is spillproof and came in a lovely seafoam green that matches my room. Its dishwasher safe which makes it even better ! Must have!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Yeti for the Win",
      "text": "We love yeti products in our household. It was the perfect size for my six year old. She is allowed to have a water bottle all day at school and this works great to keep her drink cold all day. She likes the chance to be like her entire family with her own yeti. I would love to see similar products in kid sizes from yeti.",
      "rating": 5.0,
      "verified": true,
      "author": "A.Hodge",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Leaks",
      "text": "I’m only giving it two starts because this cup leaks beyond belief. I got it so it can keep drinks cool longer & as soon as I give it to my daughter and it tilts , there goes all her drink all over her and her car seat. It’s ridiculous. Other than that it is awesome. Maybe for an adult that knows that the lid should be closed right after drinking",
      "rating": 2.0,
      "verified": true,
      "author": "Suzy",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Nice but leaks",
      "text": "Normally i love all of yeti’s products and we have so many other cups and more things but this cup isn’t really practical for kids. It leaks no matter how tight it is and the lid completely closed. Two days in a row it has soaked my child’s bookbag. It’s not overfilled either you turn it and it leaks from the screw top.",
      "rating": 1.0,
      "verified": true,
      "author": "Kiley",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Keeps water cold all day",
      "text": "I purchased several of these bottles for my kids to take to school. I fill them up with water and ice in the morning and they still have ice in them after dinner time. I find that my kids drink more water when it's cold. I highly recommend. We have 4 cups in our house now.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah A.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Leaks",
      "text": "Unless the straw is pressed down this thing leaks like crazy. Bad messy design for kids",
      "rating": 3.0,
      "verified": true,
      "author": "lowlowheyhey",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Nice but quite heavy.",
      "text": "My 9 yr old is a Big water drinker and prefers to take two water bottles to school every day. We have many different kinds. We like the Yeti but it is too heavy to take to school or most places. So it is her home water bottle 🤷🏻‍♀️",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Hard to seal.",
      "text": "I have it a 4 because I have trouble with the top. Difficult to get rings to match and close. Otherwise, I like a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Rugged!",
      "text": "Toddler loves it! Does leak if left on its side as it’s not a “sippy cup” Get a straw brush so you can clean the mouth piece. Love the Yeti!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt3322",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "It’s a yeti!",
      "text": "Love this for my kid. A true yeti fan in our house",
      "rating": 5.0,
      "verified": true,
      "author": "Janis L Gallagher",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great product!",
      "text": "Great thermos. Daughter loves it. Weight is good and keeps items cold. It does spill periodically when you turn it upside down to drink (my little one is crazy) but not too bad as I know the model wasn’t made to be used in such a way.",
      "rating": 5.0,
      "verified": true,
      "author": "jacob norton",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Great for kids",
      "text": "My daughter loves her yeti. She's 9 yrs old and it's a perfect size for her, not too small and not too big and heavy. Great quality. Would definitely purchase again in other colors. Very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mari ",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Worth it",
      "text": "Crazy to spend so much on a toddlers cup but it is WORTH IT",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina D.",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "No straw included",
      "text": "Love the color and Yeti water bottles in general. However, this will only get 2 stars because ours did not come with a straw or any original packaging, sticker logo, etc. Not sure why.",
      "rating": 2.0,
      "verified": true,
      "author": "Sandy Geiser",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Quality cup",
      "text": "With spout clouded it doesn’t leak, a little drink comes out the straw when tipped upside down when the spout is open. Cup is easy to clean and doesn’t seem to have any books that are hard to clean. Seems pretty durable and worth the extra few bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Best water bottle",
      "text": "Yeti water bottles are amazing. They keep drinks very cold and best of all are dishwasher safe! Bought this one for my 14 month old niece- she had no problem figuring out how to drink from it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Lovera ",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Perfect for a toddler!",
      "text": "Keeps my daughters water cold all day! Easy to clean. No leaks. Perfect for the beach and outdoor fun, too! Comes with two replacement straws. So appreciative!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Heavy duty",
      "text": "Very sturdy bottle. It did leak a small amount of water out when laying in its side.",
      "rating": 5.0,
      "verified": true,
      "author": "NEAL WARTH",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great cups!",
      "text": "Very pleased with this Yeti. All 3 of my kids under age 10 have one and we love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Perfect",
      "text": "Product is perfect bought for my granddaughter 22 months she loves is",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Everything I wanted!",
      "text": "Purchased for daughters to have at school. Fits perfectly in their bookbags. Keeps their water cold all day. So far, no leaks!! Great size for them to carry. They love the handle!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Best purchase for school",
      "text": "Best purchase of the school year. It’s so durable, keeps water cold all day and never leaks. I had been buying at 3 water bottles during the school year for my 7-year old. I’d much rather buy one high-quality bottle that will last all year long.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsB918",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Durable",
      "text": "They are incredibly rugged for the little ones water bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela calcagno",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Yeti quality in a kids water bottle",
      "text": "Ours have been beaten up already. By far the strongest and sturdiest kids water bottle we’ve had.",
      "rating": 5.0,
      "verified": true,
      "author": "andrew gonzalez",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "the perfect water bottle",
      "text": "My little girls love these water bottles. They bring them to school each day. They are incredibly durable and a pretty color. I feel like we have these for years and years!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela C.",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Finally a Yetti owned",
      "text": "I love it!!! The only thing that threw me off is the handle it doesn’t move which is okay though.",
      "rating": 5.0,
      "verified": true,
      "author": "Enna Dawkins",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Eh",
      "text": "Supposed to be leak proof. But very obviously spills. I even tried to adjust the straw.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea B",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Yeti",
      "text": "My teenage daughter loved this Yeti! It says it’s for smaller children, but she said this was the perfect size and is spill proof...which we know most teenagers need!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Part of a toddlers life.. :)",
      "text": "My daughter loves this water bottle...and it’s also pretty easy to clean...she loves carrying it around and drinking out of it...I kind of wish it wasn’t so heavy but I understand why it would be...also she has dropped it many times and it’s still staying strong 🤗",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Very nice",
      "text": "Unbelievable cups for young kids who have a tendency to leave their cup around for a while. Stays cold for so long. Great looking as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew C.",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "It’s a yeti so you know it’s good",
      "text": "My little one loves this thing, now she is just like her mama!! Quality yeti product once again.",
      "rating": 5.0,
      "verified": true,
      "author": "krb25",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great product!",
      "text": "Keeps liquid cold all day! Great product!! Especially for kids :)",
      "rating": 5.0,
      "verified": true,
      "author": "Marina",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Leaks",
      "text": "I don’t like that fact that water pours from the spout when it’s open and not facing upright. I seem to only have this problem with one of two of these that we purchased. For the money it shouldn’t leak.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Kid Tested and Approved!",
      "text": "Great for school and weekends, doesn’t leak when closed. Water will pour out if mouth piece is open and it tilts. Very durable. We own two of these bottles for our 5yr old. Will keep ice for an 8-hr day.",
      "rating": 5.0,
      "verified": true,
      "author": "Imad S.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Best cup for my 3 year old!",
      "text": "We use this cup everyday! All the other ones will be hitting the trash can and cleaning out my cabinets... best part is it’s dishwasher safe!",
      "rating": 5.0,
      "verified": true,
      "author": "Natalia",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Perfect for kids on the go",
      "text": "Great for kids lunch boxes and for travel. Keeps drinks cold all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Adizz",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Yeti review",
      "text": "Heavy bottle but very sturdy. We’ve been using this at a water bottle for my toddler at daycare. She really likes it. Only thing is it will leak if it’s pointed downward.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Perfect school accessory!",
      "text": "Great for school! Holds up to the abuse of 3rd and 1st graders!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Clayton",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Perfect gift",
      "text": "Great Christmas present for little girls who play sports! Small enough to be put in a backpack and take to school for lunch as well! I also monogrammed them and they came out great!",
      "rating": 5.0,
      "verified": true,
      "author": "Michaela ",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "My 5 year old loves it",
      "text": "This keeps water ice cold all day. My daughter drinks more water than she did before she got this.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Palomo",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Love it",
      "text": "I love this yeti! I went fishing and it had no leaking at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great product!",
      "text": "Great product and washes well. My 5 year old loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Great purchase.",
      "text": "Durable bottle. Does dribble some if you leave it open on its side.",
      "rating": 5.0,
      "verified": true,
      "author": "WP",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great for toddlers. Meets expectations",
      "text": "Very durable, easy to clean. Keeps liquids hot or cold as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "NShiv",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Leaks",
      "text": "When you spend so much money on a water bottle you would expect not to get a spill all over the place.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve ",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great water bottle",
      "text": "This bottle is durable and leak proof. Perfect as it doesn't leak in your bag either. I bought several.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendal Berry-Tripp",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great Value",
      "text": "Perfect for my toddler. She loves this water bottle! It is very high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Lott",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "We love it!",
      "text": "We absolutely love this Yeti Rambler, our favorite so far for our 4yo",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey D.",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Good Product",
      "text": "They are great for the kids in sports Vacation And Anything else you want to do it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Disney keeper",
      "text": "We used this cup in Disney World for our 2 year old !! She loved it, kept water cold all day as needed !",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin Chaussey",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Could be used as a club.",
      "text": "She loved it until she hit herself in the face with it. We still like it though...",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Durable",
      "text": "Very durable. Child-resistant. Got another one for my second kid",
      "rating": 5.0,
      "verified": true,
      "author": "lauren james mccollum",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Love it",
      "text": "color is very pretty, my niece loves it, it was a birthday gift.",
      "rating": 5.0,
      "verified": true,
      "author": "MA ",
      "helpful_votes": 0,
      "publication_date": 20200112
    }
  ],
  "product_meta": {
    "title": "YETI Rambler Jr. 12 oz Kids Bottle, with Straw Cap",
    "rating": 4.9,
    "feature_bullets": [
      "YETI kids need a bottle that can keep up. Introducing Rambler Jr. - a small-and-mighty kids bottle over-engineered for your little wild ones",
      "Dishwasher Safe - As a well-deserved convenience to you, we made sure both the bottle and cap are dishwasher safe (because one less chore sounds nice)",
      "18/8 Stainless Steel - Withstands all dents and drops and BPA-Free so they can safely sip without a worry in the world",
      "No Sweat Design - Keeps their hands dry - critical when summiting the jungle gym, and the Duracoat color won’t crack or peel",
      "Straw Cap - Ultra leak & shatter-resistant ideal for impromptu rowdiness. Recess is no match for the Straw Cap"
    ],
    "specifications": {
      "Item model number": "Y19-RAMBLERJR-SEAFOAM",
      "Department": "Womens",
      "Date First Available": "August 22, 2019",
      "Manufacturer": "YETI",
      "ASIN": "B07VKBSB4P",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Camp Kitchen",
      "Baby",
      "Camping & Hiking",
      "Cooler Accessories"
    ],
    "price": 29.98
  }
}