{
  "website_summaries": [
    {
      "verdict": "An excellent assortment (12 pieces) in sizes and shapes that accommodate a variety of baking and serving needs.",
      "pros": [
        "Set comes with four plastic covers and two glass knob lids for larger dishes",
        "Non-porous finish means dishes won’t absorb odors or stains",
        "Classic white finish makes it ideal for serving, especially since it’s easy to match to other pieces"
      ],
      "cons": [
        "Some consumers would have liked plastic or glass lids for the smaller dishes, too"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I had a set for 30 years and it was good, solid cook ware",
      "text": "What happened to the old Corning Ware? I had a set for 30 years and it was good, solid cook ware. I replaced with this set and what a difference! The bowls are much thinner and the glass covers do not fit at all, they slide off the bowls way too easily. That's a real hazard when you are taking them in and out of the oven. Very disappointed. Perhaps the quality issue is that they are being made in China. What happened to \"Made in America\"!",
      "rating": 1.0,
      "verified": true,
      "author": "William Byer",
      "helpful_votes": 111,
      "publication_date": 20171101
    },
    {
      "title": "Came shattered",
      "text": "I had read the reviews, and there were warnings about the product coming shattered. I thought I could be an exception, and ordered it anyway. Nope. Came shattered. Just the box in a bigger box with nothing to absorb shock but paper. I'm requesting a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "sandra leonard",
      "helpful_votes": 73,
      "publication_date": 20180809
    },
    {
      "title": "No grip/ handles",
      "text": "Only 1 star. Why, there are no \"handles\" to assist in removing the dish from a hot oven. I would suggest that Corning removed the \"handles\" due to packing. As an elderly lady, the handles made it easier to remove a hot dish from the oven (to which is the only place this cook ware is used)... CRAP. going to look for al alternative. Buyer beware.. without the \"handles\" it is slippery to remove a dish from the oven.",
      "rating": 1.0,
      "verified": true,
      "author": "Eaglesoaring Colorado",
      "helpful_votes": 34,
      "publication_date": 20181204
    },
    {
      "title": "Not the old corningware but decent enough",
      "text": "I didn't read the reviews before I ordered this set. It is no longer the glass material but some kind of stoneware. The glass lid is clearly of soda lime glass and not borosilicate glass. It is sad that all these companies now only reproduce lower quality products in the name of cost cutting and short term profits. It is still a decent enough product but I would not have bought it if I had read the reviews first. This is not something you will collect and pass down to your kids. This is a mass produced disposable product.",
      "rating": 2.0,
      "verified": true,
      "author": "DSH",
      "helpful_votes": 32,
      "publication_date": 20150515
    },
    {
      "title": "Chipped glass into my bowl of cooked carrots",
      "text": "Overall I was happy with the set, then a week later I was using the bowl and lid to hold some hot carrots. When I went to serve the carrots my wife noticed that the lid had cracked little strips of glass into the glazed carrots. At first we thought it was just one small piece, but then we noticed all kinds of small shards of glass. I've lost complete faith in this set going forward. I don't trust these bowls and covers to hold food for my family. I would not recommend this set to anyone who's not looking to throw away $40.",
      "rating": 1.0,
      "verified": true,
      "author": "Rusty Shackleford",
      "helpful_votes": 2,
      "publication_date": 20200201
    },
    {
      "title": "Great for starting out!",
      "text": "I purchased this set to replace the set that I gave to my ex when he left. I love this set. This is the perfect starter set especially if you are starting out in your first place and aren't sure what to buy. The beauty of this is that you can add matching pieces as you discover your needs. These are durable and I had my last set for 17 years, and I anticipate having these forever. On a side note, I have pieces of CorningWare that my parents gave me when I moved that they had since I was a child, and they are still going strong. CorningWare holds up!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn P.",
      "helpful_votes": 5,
      "publication_date": 20180821
    },
    {
      "title": "Not Good",
      "text": "We have had 3 sets of these Corning ware dish sets delivered to us and what a wreck. The first one we ordered the large dish/casserole lid and plastic cover did not fit. We called Amazon and got great service as always. They sent us out a new set but it came in broken. Again I called Amazon and with their great service they sent out again a new dish set and once again the lids did not fit. I am giving up and going to Kohl’s to get my next set. These “Corning Ware” sets are a little sketchy.",
      "rating": 1.0,
      "verified": true,
      "author": "MFH",
      "helpful_votes": 2,
      "publication_date": 20200510
    },
    {
      "title": "Good value.",
      "text": "I use this for casseroles and scalloped potatoes. This set is a good value for the money. The only thing I do not like is that it is round. It’s pretty after cooking and on the table but you have to be careful taking it out of the oven as there are no handles. That was something I did not think of when purchased.",
      "rating": 4.0,
      "verified": true,
      "author": "meta l bohon",
      "helpful_votes": 5,
      "publication_date": 20181018
    },
    {
      "title": "Would be perfect if they would bounce if dropped on floor!",
      "text": "These dishes distribute heat well to make cooking easier. The only problem I had, well actually 2, was the cover on the oval dish does not fit the oval dish. It doesn't fit like the ones I've had previously. You would put it on, but it could slide right back off. I mean it just didn't seat properly. The cover and the dish didn't seem to be the same size. Oh yeah, the 2nd problem I had was these things don't bounce very well when you accidentally drop them. I guess I will have to live with that, cuz I think it's impossible to make ceramics bounce. Other than that I like these dishes.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Good quality and very versatile!",
      "text": "Good quality and very versatile! Use in the micorwave and dishwasher. I think you can use up to 350 in the oven to... but best to check...I havn't done so. Goes right in the refrigerator with the cover. No worries about residue from the ceramic. Healty!",
      "rating": 5.0,
      "verified": true,
      "author": "Smile With Sandra",
      "helpful_votes": 6,
      "publication_date": 20170813
    },
    {
      "title": "Buy Corning-The Best Bakeware",
      "text": "Beautiful! Are those of you who are complaining slamming these all over the place? Did you read the product info? It's NOT Cornell ware! I too, had the old Corningware, back to the Cornflower pattern. While these are not quite the same and slightly smaller, that is the lifestyle of kitchens today. I think they are perfect for the new convection air fryer toaster ovens! I, of course, will put the bakeware in during preheat, to avoid problems. I would agree Corningware would be well served to do testing with newer cook methods and add their results to the sales site and perhaps add additional information in the directions. However, these are made 10X better than similar bakeware. Buy Corning!",
      "rating": 5.0,
      "verified": true,
      "author": "JAG",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "20 piece set",
      "text": "I ordered my 20 piece set a few days ago. I just so happened to read the reviews after I ordered my set. I was EXTREMELY excited to know my set was not damaged, and had plenty of cardboard to keep it in place!!!!!! I counted everything that I ordered, and nothing was missing at all. I had been wanting this set for several years. So happy that I got mine and that it was safely brought to me undamaged 🤩",
      "rating": 5.0,
      "verified": true,
      "author": "Cherrone D.",
      "helpful_votes": 2,
      "publication_date": 20200725
    },
    {
      "title": "Not impressed",
      "text": "The lid on the square/oval container does not fit. It slides all over and does not fit securely.",
      "rating": 1.0,
      "verified": true,
      "author": "CJBSR",
      "helpful_votes": 6,
      "publication_date": 20181114
    },
    {
      "title": "As expected",
      "text": "After reading reviews about receiving it broken I was hesitant to order but I took my chances because of the price. I am glad I did. They look just like the ones my mom use to have years ago! I have not used them yet. I will give an update after I did! I was surprised though not to see fragile or glass written on the delivery box!",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvie Tailleur",
      "helpful_votes": 3,
      "publication_date": 20181026
    },
    {
      "title": "Four Stars",
      "text": "It is called oven safe, but I used the largest one to prepare my salmon, the bowl broke into 2 parts! I have to clean the oven too. Too bad for this price.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20170123
    },
    {
      "title": "Arrived broken, cheap feeling",
      "text": "Arrived broken and sadly i didnt realize until the day after my return window. Huge waste. Just paid almost 40 for 2 ramekins. Also they seem way lower quality than the old ones i grew up with.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer Slove",
      "helpful_votes": 4,
      "publication_date": 20180520
    },
    {
      "title": "Nice set, but short two lids",
      "text": "Great quality; very attractive! I am disappointed there are no lids, plastic or glass, included in this set for the two smallest dishes.",
      "rating": 4.0,
      "verified": true,
      "author": "WW",
      "helpful_votes": 3,
      "publication_date": 20180927
    },
    {
      "title": "Ordered twice - broken each time",
      "text": "I really wanted these Corning white casserole dishes with lids. When my order arrived, the largest casserole was broken. So I returned the shipment and asked for a replacement. When the replacement arrived, the largest of the casseroles was also broken. I have returned this second shipment for credit. I am so dissappointed. It was obvious something was broken in the box because it really rattled.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Horton",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Great cookware",
      "text": "So I had to buy this set because a week before the holidays a dish from our glass cookware set shattered in the oven. So I found this set. We now have an extremely versatile set. 4 larger size dishes to serve casseroles, sides, or other main dishes. We have smaller ones that are large enough to allow me to take leftovers to work. And small dishes to serve dips or storage for our baby & toddlers food. Matching lids accompany this set. Only 2 are glass most are a plastic lid which is convenient for me. Best of all they don’t explode under normal cooking temperatures",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Expected more",
      "text": "The 16oz bowl was broken when I opened the box, that could have happened during shipping though. The glass lids for the 1.5 qt and 2.5 qt dishes wobble when you set them on the dishes, like they don’t sit flush. It appears the tops of the casserole dishes weren’t made super evenly. For what I need these for it will be fine, but I guess I expected more for a Corningware set.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Seconds",
      "text": "After finally using this set and buying lids for the 1.5 quart not happy. Lids came defective on smaller bowls which corningware is replacing and on the oval i bought a plastic lid doesn't fit . The lid is about 1/4 in too short. Corning is going to send out a replacement bowl. I will not be buying any corningware in future too much hassles must be there reject or seconds,",
      "rating": 1.0,
      "verified": true,
      "author": "C. Cronin",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Very strong, very versitile, very pretty.",
      "text": "Excellent to cook in, serve in, and store. Very nice finish and will stand up to regular use with no problem. The covers seal well. My mother had these when I was a kid - the ones with little blue flowers. They lasted for decades. These seem even sturdier and have a fresh, updated look.",
      "rating": 5.0,
      "verified": true,
      "author": "DonS",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "glass lids not secure",
      "text": "I have used Corningware for many many years and searched for this set because of brand loyalty. My only complaint is that the glass lids do not sit securely so during travel to events present a challenge. Not sure what happened as I have other Corningware glass containers and this has never been a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "pretty precise",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "A Kitchen Staple -  Must have these!!!",
      "text": "If you actually cook in your kitchen then these are a must! The color is great the sizes are very workable. I love the additional plastic lids. I wish the 4 smallest bowls came with 4 though so they could be used when serving dinner (like for a topping or gravy or melted butter or whatever... even sundae dishes.)",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Love CorningWare.  It lasts forever and is nice enough for serving at the table, buffet, or also in the oven.",
      "text": "I bought this set to use in our air fryer and they are the perfect size. I have been using CorningWare for years and have some pieces that are over 50 years old. They are well made and any scratch marks are easily removed with a little bakeware cleanser.",
      "rating": 5.0,
      "verified": true,
      "author": "Godog",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Good corningware for the price",
      "text": "Like the set, good price but one of the plastic tops was bent and another top wouldn't fit on the container, however the largest top did fit. The company is replacing the other tops and hopefully, they will work but I have found these plastic tops go phooey after time or dishwashing.",
      "rating": 4.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "Best cookware!",
      "text": "My mother has had a set of French White Corning Ware since she was married. I've been out of the house for over ten years and I finally bought one! Dishwasher safe, microwaveable, oven safe. So versatile, amazing quality, cleans perfectly. Highly recommend for making pasta dishes, baking, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "OTTB05",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Not a good set of casserole dishes",
      "text": "I've wanted this set for awhile now, I finally order it & was very UNHAPPY!!! No handles to hold onto when putting in & out of oven!!! The lids don't fit right either!!! Not a good set of casserole dishes!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Deb Weber",
      "helpful_votes": 6,
      "publication_date": 20180821
    },
    {
      "title": "Great price, great quality!",
      "text": "Love, love, love these dishes! I love that I can keep hot food hot and covered with the glass lid and then put the plastic lid on for refrigerator storage. Good quality. Walmart has 2 and a half quart and 1 and a half quart dishes to purchase separately so I’ve added on to my collection. Perfect for family style serving at holiday dinners.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephany Y Booth",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great value, great dishes!",
      "text": "I had an older version of these (probably 20 years old!) that were still absolutely fine but I lost them in a divorce. I ordered these and they are slightly different from the older version - a little more detail to the shape and more pleasing to the eye. And now they include food plastic lids! I haven't had them long, but they are holding up through the oven, microwave, and dishwasher just fine so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great product but you can find it drastically cheaper at other department stores.",
      "text": "I gave three stars because you can find the same exact set for up to $59 other places the quality was good I have not tried them in the oven yet. It is definitely the package you want around for the holidays because it has everything but like I said it’s drastically cheaper other places.",
      "rating": 5.0,
      "verified": true,
      "author": "Marina Horstman",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "They are lovely and very good sizes!",
      "text": "They go with almost any dinner ware and are very classic white, sort of French Country. Heavy (but not too heavy) and very good sizes for daily use. They are great and would make a wonderful wedding gift.",
      "rating": 5.0,
      "verified": true,
      "author": "J. H. Smith",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Great kitchen staple to give as a gift.",
      "text": "I’m usually not a review writer. I am a collector of Williams Sonoma and chef grade products. I’ve gotten more use out of this set than most of the items in my kitchen. If you are looking to give someone a wedding or shower gift and think this may be too humble or unimpressive, it will in fact be a kitchen staple for your recipients. If I had two sets, I’d use them both.",
      "rating": 5.0,
      "verified": true,
      "author": "lori",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Good for home or a gift for others.",
      "text": "Like most reviewer the plastic tops are not easy to get on. I place my thumb in the center to hold down, then use my other hand to press down the edges. It seems to make it easier to get the kids on. Overall, a quailty set of baking ware. This is my second set, and I plan to buy more.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Very Impressed",
      "text": "I was worried my package would be delivered broken based on some of the previous comments I read. I am so so happy and very impressed at the way my Corningware was packed. Nothing was broken and I am super excited to try it out for the first time!",
      "rating": 5.0,
      "verified": true,
      "author": "Mayra",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Love Them!",
      "text": "Baked myself some Vegan Ziti in it and came out great. They are easy to clean, you get a great array of sizes and lids, and I know some had chipped or broken ones but mine all came in tip top shape and still are. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "djdandylion",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Different",
      "text": "I have owned CorningWare forever but this set was completely different- something was different. On the large oval dish the lid doesnt seat well at all. It seems much smaller size too.....",
      "rating": 3.0,
      "verified": true,
      "author": "Susanne S.",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "My favorite pieces are the rectangular 21/2 qt casserole and the ...",
      "text": "I am a long time user of Corning Ware. Only 1 con that I sometimes have a problem with. Lids are a struggle to get on when saving for leftovers. My favorite pieces are the rectangular 21/2 qt casserole and the oblong 8x11 casserole. Most of my pieces were the cornflower design, but over the years I have preferred the French white. It’s a surefire match for everything. I recommend highly",
      "rating": 5.0,
      "verified": true,
      "author": "nancy sewell",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Set came damaged.",
      "text": "The set is nice, but the large oval crock and the small crock were shattered inside the box. The glass covers and the other 4 crocks were fine. This was for a Christmas gift but heard rattles in the box so opened before giving it. Good thing I did! Packing the shattered pieces back in the box is not worth the effort to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "lacyrn",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Classic, must have bakeware.",
      "text": "Purchased for my daughter moving into her new apartment. What’s not to like? Everyone should own some of these, they last a lifetime, always look brand new, don’t stain, and are useful on a daily basis in the oven or the microwave. The plastic lids are a bonus, allowing leftovers to be refrigerated.",
      "rating": 5.0,
      "verified": true,
      "author": "MalcS",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Perfect for a dinner",
      "text": "Arrived perfect and on time. I can't wait to put them to use. I was so afraid due to the other reviews it would arrive broken or chipped but it arrived in great condition. Definitely worth it",
      "rating": 5.0,
      "verified": true,
      "author": "SimpleeMe",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Must have!",
      "text": "I received this as a wedding gift and I am in LOVE with it. I had CorningWare in the past and wanted more, so this just completed my collection. Buy this, it’s amazing and so versatile. Need to store leftovers? Here’s your answer! Need to bake a casserole? This has you covered. It’s got your back.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsO",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Product Defect",
      "text": "This Corningware order just arrived from Amazon yesterday. I unpacked items and found that the casserole plastic lids did not fit! Very unhappy with this purchase. Maybe if this product had been made in USA instead of China, we wouldn't be having this type of problem ! NOT HAPPY WITH AMAZON !!",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Paveglio",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Love these",
      "text": "Use mine everyday Great product. No issues, no dishwasher so I don't know how that would wear them down. After years, mine look like new. These are the 3rd or so time I purchase these.",
      "rating": 5.0,
      "verified": true,
      "author": "miguelfeitosa",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Nice set of CornigWare",
      "text": "These are perfect set (variety of sizes is great!). You can add sizes as you need, for an “early starter” cook they’re ideal & when recipient moves, I get them!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Gibson",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "One bowl arrived broken.",
      "text": "One of the bowls arrived broken. It seems crazy to have to send back the whole set since everything else is fine. What a waste! Everything else looks like what we were expecting.",
      "rating": 1.0,
      "verified": true,
      "author": "Robin, PT",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Knock off or seconds?",
      "text": "Glass lid doesn’t quite fit. Contents overflow in microwave and do not bake evenly in oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "A Great Durable Product from Corning.",
      "text": "Quick Shipping to New Zealand, A great Wedding present & value for money. Arrived here well packaged & nothing broken inside the packaging. The 20 piece set was well received by the couple.",
      "rating": 5.0,
      "verified": true,
      "author": "P. J. Morovic",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Almost seem fake",
      "text": "They are all warped. In other words they are all slightly oddly shaped. None of the covers that came with fit. The plastic covers looks like they are missing part of the edge on one side. The glass covers \"rocks\" and do not sit flat even just sitting on the counter. I have bought these locally in the past and never had any issues with their product. That is why it almost seems like the one bought on Amazon is a fake knock-off.",
      "rating": 1.0,
      "verified": true,
      "author": "GD7",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Wished all the pieces were safe",
      "text": "You’d think that a box filled with cookware like this would be labeled fragile so it was handled a bit more carefully.. One of the serving bowls was broken and there were pieces sliding around the box. Nothing else was damaged but disappointed with how this was handled, especially since I bought this for thanksgiving and had to run out and buy a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Brittany Reyes",
      "helpful_votes": 2,
      "publication_date": 20181122
    },
    {
      "title": "Durable",
      "text": "I really liked this as a bakeware specially for bread and it has many uses. You can store left overs in them because it has its own covers. It can also be used as a a serving plate. I believe this will last for a long time as long as it is taken cared of. It is also easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Hwdg",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Classic and Classy set!",
      "text": "Beautiful set and I like the sizes. They nest together nicely. You just have to turn the middle size lid upside down before putting the large lid on top.The only complaint is the lids are a little loose. Hold the lids when moving the containers around.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine McMahon",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "Not happy",
      "text": "I was looking forward to my Corning ware to come. I have had a set in the past and it has stood up.. I just moved 3000 miles away from my previous home and am starting over. This set was to be one of the first item in my new home. I was so excited when the package arrived. But was so disappointed when I opened it. One of the bowls was broken. I was so excited to fix a dish for my new neighbors who welcomed me. But that did not happen.",
      "rating": 2.0,
      "verified": true,
      "author": "shari bailey",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "The glass parts are great!",
      "text": "This is my third set of CorningWare casserole dishes. My first set lasts for over 10 years. The second set I ordered arrived broken and had to get a third set. The glass casserole dishes and lids are great, but the plastic lids don’t fit the dishes and are useless!",
      "rating": 3.0,
      "verified": true,
      "author": "Kristy Sandos",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Classic, quality set",
      "text": "I purchased these for my mom and she loves them. Classic and nothing fancy. Her last CorningWare set lasted decades and she refused to have any other brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "This is not the Corning Ware that I know!",
      "text": "What a disapointment!! These must be fakes! the corningware Ive had in the past was excellent in every way. this stuff is junk! The lids do not fit, the design of the pieces is faulty, the material cheap and more. I will throw this set in the trash and buy some of the original vintage sets that are still available on line! I would advise amazon to not carry this stuff in their inventory any longer, it stinks!",
      "rating": 1.0,
      "verified": true,
      "author": "Reggie O.",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Broken - bad shipping",
      "text": "One of these came broken. The rest are great! Was disappointed in shipping. My mom used to have these dishes when I was growing up which is why I bought these.",
      "rating": 3.0,
      "verified": true,
      "author": "Angelica",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Great quality kitchen staple.",
      "text": "Great quality, easy to clean, dishwasher and microwave safe. This is a kitchen staple for us, veggies, soups, left overs. Very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin’s Mom",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Great gift",
      "text": "Gave them as a wedding gift, and then got a set for myself lol. They are super durable and come in handy for parties or for any occasion",
      "rating": 5.0,
      "verified": true,
      "author": "Liliana Barrientos",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Cracked after first use",
      "text": "The first time I used the oval baking dish it cracked when I took it out of the oven. I kept the oven temp to 425 and set the dish on the metal grille on top of the gas range but the dish cracked almost immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Record",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Broken Pieces",
      "text": "Although the shipping box showed no damage, the product box was rattling with broken pieces. Returned it without opening it.",
      "rating": 3.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Chipped",
      "text": "Bought for my daughter for Christmas, unfortunately smallest item was chipped and I am unable to send it back because I’m snowed in at Yellowstone National Park. 😐",
      "rating": 4.0,
      "verified": true,
      "author": "Jeri",
      "helpful_votes": 3,
      "publication_date": 20171222
    },
    {
      "title": "Dont buy",
      "text": "Low quality.. im not usually picky. Don’t buy it.. poorly made youll regret if you buy im telling you, you will be disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Catalina Serrano",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Love my French White set",
      "text": "I am so happy to have replaced my set of French Whites that I lost when I became homeless. It feels so good to have them in my kitchen again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amiable Cook",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Easily cleaned and function well.",
      "text": "These were purchased for my son. I have had a set for about 20 years. They are extremely easy to clean and still look new.",
      "rating": 5.0,
      "verified": true,
      "author": "Cgitt",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "glass cover defective",
      "text": "I took the crocks and lids out of the box, carefully hand washed them and left them to air dry on a silicone mat. They were still sitting on the mat an hour later when I heard several loud cracking noises. I hadn't touched them since washing but a portion of the inside lip on the large glass cover had shattered. The smaller lid is intact and so are the crocks. But I haven't tried to actually use them in the oven yet.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "LIDS DONT FIT",
      "text": "Sadly I purchased this set as a gift and was informed that the glass lids don't fit the dishes. Exchange window closed now so can't even replace a damaged product. Wish there was a longer replacement window when you have a damaged product. Guess the only suggestion would be wait to the last minute to buy a gift so you can have it opened and checked for damage prior to return window closing. I'm a faithful Amazon user but this is truly disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "mnorthcutt",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Wonderfully versatile & classic",
      "text": "Absolutely perfect set! The sizes are exactly what I was looking for to serve dips and other appetizers. Sturdy and convenient with tops for each.",
      "rating": 5.0,
      "verified": true,
      "author": "The DIY Designer ",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Poorly designed covers glass and plastic",
      "text": "Though the white porcelain dishes are fine the covers are not! The glass ones do not fit correctly and leave gaps and worse the plastic ones for storage are horrible impossible yes impossible to get on they are all too small very disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "scott s.",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "These look great and last forever...",
      "text": "I bought these as a wedding shower gift and they were very well received. I got a set of CorningWare baking dishes when I married in 1969 and I'm still using them! They're great for casseroles , vegetables, desserts and they go from freezer to oven to table. Everyone should have a set to complete their kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Beekler",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "CorningWare Bakeware",
      "text": "The Bakeware is easy to clean, versatile and giftable. You can't go wrong with Corning Ware as it is dependable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Im picky",
      "text": "Nice product...been around for years but...I'm picky and I like my lids to fit not to slide around. Product works as described.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Good deal",
      "text": "So far they are fine. I prefer the old type with smooth bottoms, but these are still nice. Lids fit well.",
      "rating": 4.0,
      "verified": true,
      "author": "wasscat",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Corningware is always a great choise",
      "text": "We have been using Corningware products for years and have always like them. We ordered these to add to our collection.",
      "rating": 5.0,
      "verified": true,
      "author": "William Thorpe",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Great set",
      "text": "Our first shipment arrived damaged, but they were so quick to replace it and make it right. Very beautiful set and easy to clean, as long as you follow the care instructions carefully.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael O.",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "CorningWare Bakeware",
      "text": "This has always been common item in the house growing up. It's still the best and a must have in the home. The well fitting plastic lids are perfect for leftovers. What's crazy is I received mine in less than 24hours. They are so well packed and arrived without any damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Drews",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Great for your kitchen Best Buy ever",
      "text": "I have always wanted a set of these and finally got them. Quality is great very durable bought them for Thanksgiving and have been using them at least four times a week since",
      "rating": 5.0,
      "verified": true,
      "author": "Lenora",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "4 Stars But Disappointed",
      "text": "CorningWare has been our family go to for the last 40+ years. So without a doubt when I need to add more bakeware, I chose what I knew was the best. I am however very disappointed with the lids. The glass lids don't sit properly. It slides off to the side. Defies the purpose of a lid. I have tossed the packaging so can't return the set.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Thank you..i will be contacting you",
      "text": "Everything came on time ..and for the most part as advertised except a chip in one of the small soufflé cups. I intend to call them and see how they do replacing it. Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Heidelberg",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Corningware forever",
      "text": "Love these. I was looking for serve ware that I could put in the oven. Look no further, theses come with the glass tops for serving and the snap tops for storage. Great deal too.",
      "rating": 5.0,
      "verified": true,
      "author": "Reale",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Love it - price to be factored in though",
      "text": "Love this set - had this for the longest time and now trying to replace my old set that broke (after 20 years of use!!) The only reason for taking away a star is these are quite expensive! Good packaging, as always and prompt shipping",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "THE LIDS DO NOT FIT ANY OF THE CORNING WARE - DO NOT BUY",
      "text": "The lids do not fit any of the Corning Ware and now I can't return it. I could not even get it back in the box to take over and so I am stuck with useless Corning Ware. I specifically bought it to travel with. Useless",
      "rating": 1.0,
      "verified": true,
      "author": "Deena Cohen",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Useful and beautiful.",
      "text": "I’ve had these corningwares for decades and love then. It goes from the microwave to the table wonderfully.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Kelly",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "CorningWare",
      "text": "This CorningWare set is amazing. I love that it comes with glass/rubber lids. It's stamped on the bottom too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Size set is good.",
      "text": "Size set is good, but open the box and found that a small bowl has been broken, but fortunately it is only a small, no effect. I really like this Corning bowl because it has a lid and it can keep warm.",
      "rating": 5.0,
      "verified": true,
      "author": "SHAW DI",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Disappointed",
      "text": "The (1) 2.5-quart oval with glass lid does not fit. When I remove it from the HOT oven the lid slips off and I have to catch it with my hand. This product should have been sold and a 2nd. I am highly dissatisfied with this product. It is a hazard because the glass lid can hit the floor and break into tiny pieces and cut my feet or my dog's feet. I do not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Phil Barkovitz",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Disappointed",
      "text": "1 bowl cracked had to reorder from Corning Ware. The plastic lids do not fit well.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Nice but rubber lids are super hard to put on",
      "text": "Nice but rubber lids are super hard to put on",
      "rating": 4.0,
      "verified": true,
      "author": "fmunder",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Not 12 piece as advertised!",
      "text": "RIP OFF! I received 2 oval lids for 2.5 qt container without the container. The 2 4oz containers are broken and not usable. I bought this because I wanted the oval container and never got it! Returning it!",
      "rating": 1.0,
      "verified": true,
      "author": "Mellow",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Product arrived with one of the smaller containers chipped. ...",
      "text": "Product arrived with one of the smaller containers chipped. The largest casserole, at 2.5qts, is noticeably smaller than the 2.5L corningware product I bought it to replace. Made in China, whereas my old casserole was made in America",
      "rating": 2.0,
      "verified": true,
      "author": "S. Grundleplith, MD",
      "helpful_votes": 2,
      "publication_date": 20171220
    },
    {
      "title": "Good buy and an important addition for oven and storage",
      "text": "Very useful and versitile But both glass and plastic lids are somewhat ill fitting",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "New Style w/ Readable Sizes on Bottom :)",
      "text": "Replaced a couple of broken/lost pieces from 20 + years ago. The newer style is the same color white, they have black printed instructions/sizes on the bottom, the bottom also has raised trim vs none for gripping purposes, rim shape on bowels/ramekins are a bit different. Appear to be good quality as before ...I really like them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Love This CorningWare",
      "text": "CorningWare, always a great product. Looks good and works good. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Wood Harris",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "GIFT FOR DAUGHTER -IN -LAW",
      "text": "SHE GOT EXACTLY WHAT SHE WANTED AND LOVED THE GIFT AND HAS NO COMPLAINTS.",
      "rating": 5.0,
      "verified": true,
      "author": "Mad Man",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "A classic casserole set at a fair price.",
      "text": "I have had my set of French White Corningware for decades. These are sturdy, easy to clean, and very giftable.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford Edge",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "And I thought the tiny ones were silly but we used them for individual servings of fresh fruit at breakfast and they were fine.",
      "text": "The 2 big ones are just the sizes I wanted. I don't particularly want the plastic lids. And I thought the tiny ones were silly but we used them for individual servings of fresh fruit at breakfast and they were fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Wingflap",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Great tools",
      "text": "Despite the warnings, it works perfectly fine in the desktop electric oven. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Lids don’t fit",
      "text": "Absolutely the worst. It arrived quickly, but it is pure junk. The rubber tops don’t fit, the glass lid doesn’t fit. It’s gaps in the glas lid and the rubber lid won’t grip all the way around. You have no way of knowing until you use it. If you have the misfortune of buying it, check when it arrives. Wish I knew before I used it, I would have sent this junk back.",
      "rating": 1.0,
      "verified": true,
      "author": "Pattyat",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Amazon sucks",
      "text": "Do not buy from amazon. They do not back the products they sell. But direct from manufacturers for warranty and customer service. Amazon provides neither.",
      "rating": 1.0,
      "verified": true,
      "author": "No longer an Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Beautiful",
      "text": "LOVE these bowls.. Perfect size and the variety allows me to store and cook various size foods/dishes.. Cleans up easily",
      "rating": 5.0,
      "verified": true,
      "author": "Deana ann tuzzolino",
      "helpful_votes": 0,
      "publication_date": 20190325
    }
  ],
  "product_meta": {
    "title": "CorningWare French White Round and Oval Ceramic Bakeware, 12-Piece",
    "description": "Style Name:12-Piece (New)The recipe for a great Dish starts, surprisingly, with a great Dish! Corning ware French White bakeware proves that when it comes to food preparation, few things are more convenient than Baking and serving in one dish. With its classic, fluted design, French White oven-to-table bakeware imparts a traditional elegance that is a perfect complement to any decor. Versatile yet stylish, Corning ware French White is simple, from start to finish! Set includes 2. 5 oval and 1. 5Qt round with glass and plastic cover, 16oz round with plastic cover, two 4oz ramekins and 24oz round with plastic cover.",
    "rating": 4.5,
    "feature_bullets": [
      "Set includes 2.5 oval and 1.5 Qt round with glass and plastic cover, 16 ounce round with plastic cover, two 4 ounce ramekins and 24 ounce round with plastic cover",
      "Crisp, bright and classic, this white dinnerware set is as versatile as it is timeless",
      "Resists chipping and cracking. Care and cleaning: Oven-safe, freezer safe, microwave safe, dishwasher-safe. BPA-free",
      "Non-porous surface does not absorb food odors, flavors or stains",
      "1 year limited on corning ware stoneware bakeware",
      "Ceramic bakeware set"
    ],
    "specifications": {
      "Package Dimensions": "12.6 x 12.3 x 8.3 inches",
      "Item Weight": "11.48 pounds",
      "Manufacturer": "Corningware",
      "ASIN": "B07V4P62Z6",
      "Item model number": "French White Round and Oval",
      "Customer Reviews": "4.5 out of 5 stars2,187 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,249 in Kitchen & Dining",
      "Date First Available": "July 11, 2019"
    },
    "categories": [
      "Bakers & Casseroles",
      "Bakeware",
      "Home & Kitchen",
      "Bake & Serve Sets",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}