{
  "website_summaries": [
    {
      "verdict": "Unique BMX bike that provides a basic platform to expand with the accessories you want for your tricked-out ride.",
      "pros": [
        "High volume, 2.3-inch tires smooth out the ride",
        "Steel frame is both tough and light so tricks are easier to perform and control"
      ],
      "cons": [
        "Seat bolt has been known to loosen every now and then"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice bike, terrible seat.",
      "text": "Bought L60 in green. Nice bike, for my 8yo so it's still a tad big, but he'll grow into it. Green is more of a matte green, pictures make it look more of an emerald green. Terrible seat though. It's a fixed post seat at an angle so you can't level it out. For now I put on a seat from an old bike and had to order a new seat and post to have an adjustable seat. Disappointing for the price you pay, especially when models below this one come with adjustable seats.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "$$",
      "text": "I’m 16 and just switched from skateboarding to BMX and this was basically the perfect purchase! I’m 6’5 so obviously it’s a little small but nothing taller bars can’t fix. Pros The frame, forks, and cranks are really strong and I don’t see myself breaking them anytime soon. Cons I bent the bars on the second day but that was user error ;) Pedals suck The stem is eh Overall it’s probably the best bike you can get for the money. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "william",
      "helpful_votes": 36,
      "publication_date": 20190923
    },
    {
      "title": "Faulty handlebars!!!",
      "text": "Overall the bike is pretty decent. My son and I had a VERY hard time putting the handlebars on because the instruction pamphlet shows a completely different style of brakes/handlebar configuration so we had to guess. Also, possibly a piece or insert missing in the handlebars. We assembled as instructed. My son was riding and the handlebars turned down, stopped the wheel, and he was thrown off his bike. Not sure what to do now...will probably have to take to a bike shop to get it repaired if possible. I would not recommend this bike. I feel like I wasted the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20190806
    },
    {
      "title": "best quality at this price range",
      "text": "Pros: best config you can get at this price range. Chromoly frame, fork and handlebar, sealed bearing for front and rear hub, freecoaster rear hub. (other brand like WTP, fly kink may cost you double for this config). Easy to assembly (just install the handlebar, padel, front wheel and seat). It come with a U brake and is suitable to install Gyro, but I took off the brake cos I run brakeless at park. Cons: Made in China by pacific bicycle, and 21 inch frame (suitable for 5'11 or above I guess).",
      "rating": 4.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 10,
      "publication_date": 20191217
    },
    {
      "title": "VERY NICE COVER",
      "text": "Very Nice Bike. Had got for son for Christmas very easy to Assemble only problem was on hand brake screwing in the round part that goes into the handle of the brake. You really have to push while screwing it into the handle.. Have the brake cable on outside of handle bar NOT on the inside... Other then that Very, Very Nice and real easy as long as you have the Right Tools.. Hope this will Help you.",
      "rating": 5.0,
      "verified": true,
      "author": "Greensnapper",
      "helpful_votes": 9,
      "publication_date": 20191222
    },
    {
      "title": "Nice bike overall",
      "text": "This is a pretty good bike for the price. The color is really nice and the components are really good for a bike this price. The only downfall is the brakes. They don't really do a good job of stopping the bike. I know this has been an issues with a lot of other reviewers saying the same thing so you think mongoose would fix this issues. The rest of the bike is pretty nice and so far it's been holding up pretty well. I added in some red accents and the bike looks really cool. If they fix the brake issue they would really have a winner on their hands.",
      "rating": 4.0,
      "verified": true,
      "author": "Robotica Industries",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Brake cable.",
      "text": "Second bike in a row that the brake cable is too short and I’m not investing more money into this bike. It should come ready to be ASSEMBLED not ready for more money to be thrown at it. SECOND BIKE IN A ROW that the brake cable is too short. Sending back and I’m not going to get another one. First impression was bad enough second time around I’m done wasting my time. Even with the washer taken off the brake cable was still too short. Absolutely ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Tomlinson Jr",
      "helpful_votes": 4,
      "publication_date": 20190727
    },
    {
      "title": "Unlucky with horrible customer service",
      "text": "It's a light weight cool looking bike. Only problem I got the seat and seat post for a CHEAPER model - Mongsoose L40. Upon calling Mongoose customer service, they said the part was back ordered until May or possibly even later. Seems crazy I need to return the whole bike, just to get a correct seat. Waiting for the new one to arrive.",
      "rating": 1.0,
      "verified": true,
      "author": "Reader",
      "helpful_votes": 2,
      "publication_date": 20200201
    },
    {
      "title": "CHAIN BROKE 3 MONTHS AFTER BOUGHT",
      "text": "I at first I had this at 5 stars then it went to 4 and now 3. My son got his bike like around the end of July for his birthday and the chain broke the end of October and he didn't ride it all day every day. Maybe a few times a week and I have the bike out of the weather. So I expect this to last a long time.This is really quite ridiculous.",
      "rating": 3.0,
      "verified": true,
      "author": "mike b.",
      "helpful_votes": 0,
      "publication_date": 20201112
    },
    {
      "title": "Just okay, not super impressed",
      "text": "It’s a nice bike, however the handlebars do not stay tight. In a months time they had to be adjusted almost daily. My husband has tightened them and so have I, it’s definitely not user error. It’s kind of a safety hazard really, they slip down while my son is riding and doing jumps. If it wasn’t such a pain to return a bike, I would. For $250 I expected better. His last BMX bike from a local bike shop never had this problem. Lesson learned on buying a bike online",
      "rating": 3.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20201203
    },
    {
      "title": "Worth it for the price!",
      "text": "My first bmx bike and it’s definitely the right one. Bought it for the sole purpose of going to work (I’m 17) and I’m addicted to riding it. Also the price is to good definitely a quality bike!",
      "rating": 5.0,
      "verified": true,
      "author": "Race",
      "helpful_votes": 5,
      "publication_date": 20191025
    },
    {
      "title": "buy local",
      "text": "pieces were missing & husband had to buy locally, the assembly was ok, but these bikes are made with cheap parts from china that dont stay tight. my 12 yo son had quite a few accidents & injuries because things keep getting loose. It was professionally assembled & tightened many times. wth?!",
      "rating": 1.0,
      "verified": true,
      "author": "quest",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "Great quality!",
      "text": "My 8 year old loves this bike! He is definitely tall for his age and he definitely will be able to use this up through his teen years. The bike is well built. The thick tires seem to help with balance. As a new rider he has only fallen once in the past 2 months. The quality is great. We had to adjust the hand breaks for him and are trying to find a kick stand to add on. Wish it had a kickstand that would be my only complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Break line too short, twice!",
      "text": "The first bike they delivered the break line was too short. They delivered the replacement two days later....break line too short....I'm beyond disappointed...but my daughter wants to try for a THIRD time bc that's how much she wants THIS bike 😩",
      "rating": 1.0,
      "verified": true,
      "author": "LipstickStilettosHustle",
      "helpful_votes": 0,
      "publication_date": 20201107
    },
    {
      "title": "nice bike",
      "text": "Very nice bike. Well made. Easy assembly. Grandson loves it",
      "rating": 5.0,
      "verified": true,
      "author": "rjenn",
      "helpful_votes": 6,
      "publication_date": 20180826
    },
    {
      "title": "Quality of product and customer service.",
      "text": "Update: they are sending replacements parts. Hope this fixes the issue otherwise it will be returned. The first ride the handle bars came loose. They cannot be tightened enough. We have to tighten them every time. My son is so upset. It was his 11th bday gift. Unable to get through to the company by phone. Left a message and still waiting. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise Gresio",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Manual is not clear.",
      "text": "let me start by saying that item serve it purpose however , there a few part that are misleading or confusing in the manual. Bicycle looks great, my kid love it. the color and shape is good. good for a 8-12 years old. if your kid is small this bicycle is gonna be too big . the poles on the side of each wheel I could not be installed there is not way I can do it. not sure if they actually fit. this bicycle only have one brake. Manual show different part for the wheel pole and the brakes. 3 start for the price I was expecting something better for the price I paid.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos A. Toruno",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "you need tools to assemble! No tools included",
      "text": "this bike is affordable and of great quality. My 10 year old loves it! It comes pre-assembled but you need real tools to finish putting it together. it looks like it will last a long time, material seemed to be of good quality. we took it for a ride after 3 days since I needed tools to have it ready. it is worth every penny. definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Day",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Unable to assemble due to 2 missing 7mm bolts",
      "text": "Bought the Legion for my daughters birthday and I was unable to assemble the bike completely due to 2 missing, (odd sized)7mm handle bar binder bolts. Totally bummed about her not being able to ride the bike until I get a chance to replace the bolts.",
      "rating": 1.0,
      "verified": true,
      "author": "CrunchNMunch",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Waste of money.  Dangerous bike",
      "text": "We have had to fix this bike twice in a month. Just missed the return window. Handle bars don’t function when turning. My son has been thrown off this bike. He hates it and now we are stuck with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl D.",
      "helpful_votes": 2,
      "publication_date": 20200703
    },
    {
      "title": "AMAZING BMX!!! I love it.",
      "text": "Ok first I am the son of the buyer. My opinion counts as much as anyones. But this is a great BMX bike nice and easy to assemble. (I asked my father and he said it wasn't too hard.) I ride about half a mile to a mile every day for school and its a nice and smooth ride! Only issue is that if you're riding in snow or rain it throws water straight against your legs making your pants legs all wet. And get dirty easy. Other than that I love it.13 y/o (Also good for BMX stuff)",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Kramer",
      "helpful_votes": 2,
      "publication_date": 20191111
    },
    {
      "title": "NO SEAT! Pictures are not accurate.",
      "text": "I order the L10 for my son for Easter. It showed up 4 days late due to Coivd19, no problem I understand. But it doesn't come with a seat. There is a seat on it in all the photos., but I guess I have to buy one. The only problems is I can not find a seat for it on Mongooses website. This is not is a good experience. It's almost as bad as Jack's frozen Pizza, no offense.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristopher",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "My son loves it.",
      "text": "I would have given 5-star if it didn't come with missing the front axel screw. I had to make couple trips to the local hardware stores but they didn't carry it. So, the last resort was to visit the local bike shop to get it. Disappointing because quality check was not there. Overall, my son loves the bike so that is what matters.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron Ho",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Starter BMX at the right price",
      "text": "Getting back in to bmx and didn't want to spend a lot. This was perfect for me with cromoly frame forks and cranks. Double walled rims and sealed bearings. Wish it came with pegs and gyro but cheap enough to buy seperate. The paint was not the best .",
      "rating": 4.0,
      "verified": true,
      "author": "Heath Smith",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Great Bike for the Money!",
      "text": "So far very happy with this purchase. Assembly was pretty easy, brake assembly took the longest. Good quality bike, perfect size for my 15 year old. Only issue was the time it took to ship. Almost a month compared to the 1 week original ship date. I am guessing shipping was delayed to COVID. Still frustrating.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Easy to assemble",
      "text": "Overall, the Bike is very great looking and rides smoothly. Assemby was tricky when it came to installing the brake line, bit that's about as tricky as it would get for you. Wheels already come with air in them ready to go, and you'll only need the basic home owner tools to get it assembled. The bike itself is lightweight and easy to carry up and down the stairs if needed. It does not store easily, but taking the wheels to do so is a quick solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Cruz",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Nice Bike!",
      "text": "Really cool bike. 9 year old son picked it out and he loves it. It is a little on the heavy side for him but he will grow into it 🤷‍♀️ Only issue we have had is the chain constantly falls off on him, so we need to have that adjusted. Other then that he has gotten tons of compliments and mom even takes it for a ride from time to time!! 😂",
      "rating": 4.0,
      "verified": true,
      "author": "Theadamsfam",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Quality bike for the money",
      "text": "This bike came quickly, and was easy to assemble. I am a mechanic by trade, and from box to test ride only took me about 25 minutes. I only needed two Allen wrenches (5mm and 6mm) and four wrenches (10mm, 15mm, 17mm, 18mm) and some cutters to get through the zip ties. Did a quick adjustment of the brake cable to get the feel I was looking for. All in all a really sweet bike with good components, and doesn't feel cheap or heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Droste",
      "helpful_votes": 0,
      "publication_date": 20201202
    },
    {
      "title": "thoroughly happy with my purchase of the L100!",
      "text": "My son and I have been looking at alot of different BMX bikes and came across the L100. I was expecting it to be a nice bike but not as nice as it actually was! I am thoroughly happy with this purchase hands down! He has been jumping it and doing all kinds of tricks and not one issue yet! Everything on this bike is very high quality stuff! Definitely a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Falling apart in the first few months",
      "text": "The screws that connect the handlebars to the stem, and therefore keep the handlebars upright and adjustable, cannot be loosened or tightened. It is too dangerous for a young boy to ride with no handlebar control.",
      "rating": 1.0,
      "verified": true,
      "author": "kirbysgirl2002",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great Bike!",
      "text": "Much better than the department store bike and I'm sure it will last a lot longer. I bought this for my sons 8th birthday and he LOVES it. He has plenty of room to grow into it without it being too big. Assembly was easy. Came well packaged and quickly. Very pleased, I don't think I'll have to buy another bike for him for a while! Also like the fatter 20\" tires!",
      "rating": 4.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Tire won’t inflate",
      "text": "I’m very disappointed! Got this bike for my son, it’s really nice but, can’t keep the back tire inflated. I’m probably going to have to take it to a bike shop to get it repaired which is pretty crappy for a brand new bike.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Dont buy",
      "text": "This came with NO pedals, NO pegs, and maybe more missing pieces. I’m still trying to find out how to get replacement parts for this Christmas present. I’m furious and wonder how a sealed box has missing parts. Do not buy this product from Amazon. Also, Amazon did not do anything to help me except give me the customer service number to a retailer/manufacturer. Good luck!",
      "rating": 1.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20201210
    },
    {
      "title": "Low quality - Already broke multiple times",
      "text": "First the bike had a sticky residue on the forks as reported by other reviewers. Then the chain kept coming loose. Not the pedal crank wont sit properly and my local bike shop says the crank has to be replaced. I am contacting Amazon for a return.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Ward",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Poor core parts",
      "text": "This bike did not last 6 months. The chain broke and the chainring wore out. Now, I’m spending $50 to repair the bike. These bikes have very cheap core parts!",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Bohannon",
      "helpful_votes": 2,
      "publication_date": 20200512
    },
    {
      "title": "G A R B A G E",
      "text": "This bike is flatout garbage. Followed the instruction manual and when i thought it was finished i went on a ride and 15 minutes later the chain snapped off and caused me to take a pretty gnarly fall. Don’t buy this bike unless you want to spend an additional $200 on other parts before having a complete decent bike. Very big waste of time and money not worth it at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "Not Holding Up Well",
      "text": "I purchased this bike in red for my son for Christmas and it already needs a new axle and bearing. I am not sure how to go about getting it replaced and the bike is now a waste as he cannot ride it. For the price this bike should have lasted longer then 4 months. I won't be purchasing anymore bikes through Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "Marisa",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Cheap and poorly made. Very hard to put on pedals",
      "text": "What a cheap piece of $&@“ pedals are challenging my park tool pedal wrench. Threads filled with paint. Working on pedals for 45 minutes so far and still not done. Crank arms pitted and cheap looking. Looks like they just added a lot of paint to cover. Freewheel has a lot of resistance. Bottom of the line bike. Could of just got a huffy at Walmart. I’m sure more to come as I finish assembling. Very disappointed.Embarrassed to give to my Grandson",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Nice bike for the money",
      "text": "Bought for my son's 9th birthday. He absolutely loves it. Nice bike for the money and it has all the features of much more expensive bikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Cleveland",
      "helpful_votes": 0,
      "publication_date": 20201109
    },
    {
      "title": "It is nicer in person",
      "text": "Very light weight! Bought for my son for his birthday. Was easy to assemble. Was assembled in less than 45 minutes. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Whittaker",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Son is happy",
      "text": "My son is very happy with the bike. The only complaint he has was the seat isn’t comfortable, but trick bike seats aren’t really meant to be sat on a whole lot.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Nice bike.  Smaller than expected",
      "text": "Bikes a bit heavy and smaller than I thought it would be. Looks to small for my growing son but he likes it. The paint is chipping in one are already.",
      "rating": 4.0,
      "verified": true,
      "author": "niknakjack",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Cheap brake system",
      "text": "We selected mongoose bikes because they used to be quality. Unfortunately after my eight-year-old wrote this for two weeks the brakes started to malfunction. The rear brakes are very cheap and will not last.The calipers continue to stick to the wheel. I do not recommend this bike",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly A Kunsch",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Very miss leading and no costumer support",
      "text": "Info from seller said damaged and it was a $10 Discount so I thought can't be to bad right..When we received the Bike it was heavily scrached and parts that you had to have to assemble the Bike were broken and even missing.So Bike can't be assembled..If description had said parts broken and missing, I wouldn't have purchased",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Another Short Brake Line",
      "text": "Overall, it's a good bike but disappointed that we also had a brake issue. Unfortunately, the rear brake upper gyro line is too short. It came with an 18\" (460 mm) cable when it really needs one that is 18.5\" (470 mm). I am still looking for the exact size, but may need to go with a kit and adjust accordingly. Will update when I get a response from the manufacturer.",
      "rating": 3.0,
      "verified": true,
      "author": "Jose Marquez",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Flat tire",
      "text": "Bike came with a broke, unable to inflate tire. And I was already upset that I had to spend so much extra on this bike. Normally I would have saved about $50 if we were not experiencing a pandemic, but I wanted to get it here quicker for my sons birthday. It’s here, just defected.",
      "rating": 1.0,
      "verified": true,
      "author": "Lindsey Tinsley",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Bike Chain snapped",
      "text": "I have a 14 year old son that I bought this bike for, he was excited, we put it together and on his first pedal around the driveway, tried to do a wheelie and the chain snapped. Now this could've been ok but there was no master link on the chain, so no where to replace it. I had to order a new chain and put it on. Would not recommend this for experience bike riders. Not worth it...",
      "rating": 2.0,
      "verified": true,
      "author": "Chris Stephens",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Mediocre @ best...",
      "text": "First time buying a boys bike on-line. Assembly was easy; however, the brakes and GYRO are in terrible condition. It likely that I will have to replace all of the brake lines as a result of them being terribly out of calibration. Next time, I will purchase from my local bike shop... sticking w/ Trek. No more Mongoose.",
      "rating": 3.0,
      "verified": true,
      "author": "CNGeiser",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Needs repairs shortly after use",
      "text": "Upon assembly, the brake wire was the wrong length and needed to be replaced at my local bike shop for $25. After 50 miles of biking at an extreme park the crank bearings wore out and needed to be replaced,$120 fix. Now that those are fixed it's a solid bike, but you would be better off going to your local bike shop to buy one since they will warranty it for a year or more.",
      "rating": 2.0,
      "verified": true,
      "author": "Leigh LaViolette",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great Bike, with Great parts.",
      "text": "Being a BMX rider since forever, I am glad to have a mongoose again. my first mongoose was a Team Mongoose when it was call BMX products of Chatworth, Ca.. Great set up , awesome parts, rides and feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Skello",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Piece of Garbage! Don’t buy!",
      "text": "This bike is a rip off! Don’t waste your money on it. Since the time it arrived it has given me so much problems. Literally a piece of garbage!!! I advise you to find a better bike because this bike is a absolute nightmare. I was just cruising around and when I tried to pedal normally the chain literally broke and fell off!",
      "rating": 1.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "An awesome bike",
      "text": "Bought for my grandson and it’s so good looking. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Marie",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Awesome BMX bike for the money",
      "text": "My son loves the bike it's really a nice BMX bike and I got a for a really good price the only thing it's not super hard to put together if you're handy but if you're not it's a challenge they actually brought it to a bike shop and had them put it together and paid extra. Overall a great purchase",
      "rating": 5.0,
      "verified": true,
      "author": "John mohr",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Good value, brakes hard to assemble.",
      "text": "Putting it together wasn't simple. The brakes took me close to an hour to put together, and they're still too tight. Other than that it's good for the value.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael C. Evans",
      "helpful_votes": 0,
      "publication_date": 20201205
    },
    {
      "title": "Complete negligence from the company.",
      "text": "A pair of pegs were useless. I mean, total production defect. I can’t return the entire bike for that right but it obviously affects my perception towards the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamang",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Broke",
      "text": "I need to get a hole of someone in regards to this bike. The chain keeps getting stuck and when you are peddling the wheel locks up. I spent a lot of money on this bike. I am not asking for my money back I would to send this one back and get a replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Anna A",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Disappointed",
      "text": "Worst pegs I've ever seen. Just cheap welded tube, no threads, smooth glossy tube with no texture or foot grip. The whole bike feels cheap, for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "rick",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Awesome bike!",
      "text": "Got this for my son. He loves the bike and is able to go faster than his old bike.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Looks great low grade tires",
      "text": "7 year old loves the bike! Easy to assemble, easy to ride and looks great! However, the tires are low grade. Have had to replace the inner tubes twice due to the thin rubber on the tires.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy J. Mougala",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Defective",
      "text": "Can't say much about the bike's ride or its durability because it had a damaged brake line and brake connector right out of the box. No way to get this remedied in time for Christmas, so I'll shop elsewhere (support my local merchants). Will be returning it. Maybe your luck will be better.",
      "rating": 1.0,
      "verified": true,
      "author": "Robin Harris",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "overall nice kids bike",
      "text": "Great bike except for assembly instructions. NO clear instructions on assembling the break system, even online YouTube videos didn't cover it for this model. Finally had to take it to a bike shop and pay them to hook up the breaks.",
      "rating": 4.0,
      "verified": true,
      "author": "New England Mom",
      "helpful_votes": 0,
      "publication_date": 20201110
    },
    {
      "title": "Not good quality",
      "text": "My son has had nothing but issues with this bike",
      "rating": 1.0,
      "verified": true,
      "author": "Gustavo Ansaldi",
      "helpful_votes": 2,
      "publication_date": 20200416
    },
    {
      "title": "Brake cable too short upon installation",
      "text": "Pretty easy to put together except the fact that the brake cable for the handlebars was 1 inch too short and I had to get a whole new one in order to fix it.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric C.",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Flat",
      "text": "Overall happy with our purchase, however, it came with a hole in the tire so we are having to go purchase a new one.",
      "rating": 4.0,
      "verified": true,
      "author": "JessicaG",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "L100 - silver beauty, but loosey goosey",
      "text": "looks and rides great. specs are decent. only issue I had was the bars were way too easily knocked loose. couldn't get it adjusted correctly. I love amazon. easy to box up and return. wish I could've kept it but was dangerous for me to ride.",
      "rating": 2.0,
      "verified": true,
      "author": "Caleb Austin",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great value",
      "text": "11 year old son is very happy with it. Haven’t tested the brakes yet as he wanted to assemble it without them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "My son loves this bike.",
      "text": "This bike is perfect for my son. He is nine years old and loves it. It is durable and holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Nice beginner bmx bike",
      "text": "My 10 year old says it is ‘Dope’. Was straight forward to put together. Looks nice. Good welds. Etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Cole Taylor",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "No front brake assembly included",
      "text": "No front brake assembly! Bought for granddaughters birthday. Now I have to call and argue my point which I absolutely hate!!! Also never got anywhere with amazon. Site says brakes not brake. Bike is set for front brakes. Book shows how to assemble front brake. Unsafe bike",
      "rating": 1.0,
      "verified": true,
      "author": "pamela",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "cheap",
      "text": "Instructions don't match parts and assembly sucks. Little bolt thing for brake broke during installation. Pegs also suck just threw away.",
      "rating": 1.0,
      "verified": true,
      "author": "James Curcuru",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Great bike",
      "text": "I love this bike got it for my 11 year old son and he loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Jones",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "poor quality",
      "text": "The price for the bike is a bad deal. The assemble was easy, but the brake handles would not work unless you had a strong man's grip, even after the adjustments. Don't waste your money on this product. My kid use it once, it now sits on the rear yard collecting dust. cr",
      "rating": 2.0,
      "verified": true,
      "author": "Clemente rocha",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Missing part",
      "text": "Hi. We received the item but we’re missing the 5mm bolt/screw that’s tightened by an Allen wrench for the seat. Any way that can be sent?",
      "rating": 4.0,
      "verified": true,
      "author": "Cheri L. Dolliver",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Buyer beware",
      "text": "My bike had obviously been returned and then repackaged. Missing parts. Massive pain in the ass. Paid full price for a new bike. Just left wondering why.",
      "rating": 2.0,
      "verified": true,
      "author": "LTM",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Pass.......",
      "text": "First bike delivered, brakes did not work. Replacement bike axle nuts for front tire missing.... moving on!",
      "rating": 1.0,
      "verified": true,
      "author": "john e jadick",
      "helpful_votes": 2,
      "publication_date": 20191010
    },
    {
      "title": "Not satisfied",
      "text": "I bought this bike for my brother. He complained to me that the bike could not be parked at the side of the road and had to fall to the ground.",
      "rating": 2.0,
      "verified": true,
      "author": "mengzhenlin",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Nice",
      "text": "The bike is very nice and easy to assemble. My son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nenah",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Assemble",
      "text": "I can’t assemble brake system, because the cable doesn’t work. Cable head can’t place into the brake lever. hope the seller send me new brake cable .",
      "rating": 1.0,
      "verified": true,
      "author": "bing xu",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Very good first bike.",
      "text": "Good bike for the money. Kind of heavy for a kid. Looks very good Quality. Easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Roberto",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Damaged on arrival",
      "text": "Bike arrived damaged. This bike was labeled as new, but clearly is not.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20201207
    },
    {
      "title": "Very durable and priced right!",
      "text": "Bike is still a bit big for my son, but I knew that buying it. Seems to be well built & was pretty easy to put together. It’s a great starter BMX bike for the money! I recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Bain",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Durable and good looking BMX for 10 year old grandson. He loves it.",
      "text": "Great quality bike and while the assembly was fairly easy (most of the bike comes assembled) the instructions did not match up to the components.",
      "rating": 5.0,
      "verified": true,
      "author": "Walt K",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Great bike",
      "text": "My sons favorite Christmas present! Quality made bike holds up to 13-year-old shenanigans!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle W.",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Quality Mongoose!! My son loves it!",
      "text": "It’s a great Bike! Quality material. My son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "heather richmond",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Cool bike but pain in the butt",
      "text": "Pain in the butt to put this brake on here.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Herrera",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Watch for incorrect brakes",
      "text": "The brakes were not right and when assembled rubbed on the tire so had to remove them.",
      "rating": 3.0,
      "verified": true,
      "author": "BJJ GIRL",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Amazing Amazon deal on a kids bike",
      "text": "Perfect. Son loves it and priced right with free ship~~~ cannot beat it",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Able",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Part missing and defective piece",
      "text": "Hi! I’m missing a bolt and another piece appears is defective. I would rather not to break down the bike and return. Is there someone I can talk to about the 2 pieces?",
      "rating": 4.0,
      "verified": true,
      "author": "Shayna E. Daniel",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Top class price and bike A ONE.",
      "text": "The bike is very easy to install. Very beautiful color RED. There is no stand with the bike. This bike is way better then Walmart bikes. The brake is very easy, you just need to lose the upper brake only the whole cable.",
      "rating": 5.0,
      "verified": true,
      "author": "NYCJAC1",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Blue bike",
      "text": "My son is 11 and loves this bike. He fits it perfectly. He’s a tall kid. Love the vibrant blue. I’m guessing he will need a bigger bike in a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillian Roberts",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Such a great bike.",
      "text": "I love this bike but only issue I had putting it together was that I found out I didn’t come with the seat.",
      "rating": 4.0,
      "verified": true,
      "author": "tony morris",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Awesome bike",
      "text": "This bike is amazing for not a horrible price but a little pricey. It rides smoothly, not that heavy, not hard to assemble, and it can be for a beginner or an expert. The L500 is an awesome bike!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Chamberlain",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Highly disappointed",
      "text": "The chain broke as soon as my rode rode the bike",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Hole in tube",
      "text": "When we pulled the bike out of the box, the back tire tube had a huge hole in it, which I had to replace before grandson could ride it, for that price, there shouldn't have been any problems with it!!",
      "rating": 3.0,
      "verified": true,
      "author": "Connie Simon",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "No front brake",
      "text": "Decent bike just wish had front brakes. I didn’t realize before I bought it.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael knight",
      "helpful_votes": 0,
      "publication_date": 20201112
    },
    {
      "title": "Need tools or instructions are included",
      "text": "There were no tool or instructions to put this together. I didn’t have any issues until the breaks. Breaks are important and some instructions would be helpful.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great Bike for the price",
      "text": "My 14 year old loves this bike! He put it together himself and it honestly seems like a very sturdy bike!",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "this bike parts arent up to standards",
      "text": "All we have had is issues fix and prefix we will have to take the defective bike to a shop cause handlebars wont stay in position",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry ",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Missing part/ poor brake assembly",
      "text": "Like the look of the bike however the bolt to attach the seat was not included. Had to spend an additional $15 to replace it. I believe I should be refunded that money.",
      "rating": 2.0,
      "verified": true,
      "author": "patrick",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Brake line won’t attach",
      "text": "Break line wouldn’t attach to the brakes due to being too short and therefore was unable to finish assembling the product.",
      "rating": 1.0,
      "verified": true,
      "author": "The Codds",
      "helpful_votes": 0,
      "publication_date": 20200828
    }
  ],
  "product_meta": {
    "title": "Mongoose Legion Freestyle BMX Bike Line for Kids, Youth and Beginner-Level to Advanced Adult Riders,16-20-Inch Wheels, Steel Frame, Multiple Colors, Models",
    "rating": 4.2,
    "feature_bullets": [
      "The Legion L60 is a fully park, street or dirt worthy freestyle BMX bike with killer Colorways that’s just waiting for a rider to take it to the local ramp park; Suggested rider height is 5’0” – 5’6”",
      "The durable L60 features a Hi-Ten steel frame, removable brake mounts, and mid BB shell; 20. 5” top tube length",
      "The l60's drivetrain features 175mm 3-piece tubular chromo hollow spindle cranks with a 25T steel Chain ring and mid sealed bearing bottom bracket",
      "The wheelset features 20” x 2. 3” tires mounted on aluminum single wall 36H rims with 3/8” female axle Front hub and 9T cog-sealed bearing cassette rear hub",
      "Aluminum U-brake and brake levers provide precision speed control, while the Hi-Ten steel handlebar and fork are joined by a 50 mm stem and threadless, sealed, integrated headset for maximum steering performance",
      "Suspension type: Rigid"
    ],
    "specifications": {
      "Date First Available": "January 28, 2020",
      "Manufacturer": "Mongoose",
      "ASIN": "B0849GWKZJ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Bikes",
      "BMX Bikes",
      "Cycling"
    ],
    "price": 309.99
  }
}