{
  "website_summaries": [
    {
      "verdict": "This hypoallergenic milk cleanser is the ultimate option for anyone dealing with sensitive skin.",
      "pros": [
        "Features cucumber, aloe, and oatmeal for soothing sensitive skin",
        "Its probiotic formula reduces skin irritation while moisturizing",
        "Will not clog pores",
        "Made without common irritants, like mineral oil and alcohol"
      ],
      "cons": [
        "Tula’s clean and nourishing ingredients seem to have driven up the price"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It helped with my rosacea",
      "text": "When I got the email about this new product I decided to give it a try and I ordered the first bottle and I loved it! It’s super gentle on my skin and it helped a lot with my rosacea! It doesn’t dry the skin that other cleansers do. This is my second bottle. The only reason that I give 4 starts it’s because the first bottle didn’t last 1 month! I’m trying to use the second one “better” to make it last longer. But it’s priceless to me that my face isn’t that red anymore :)",
      "rating": 4.0,
      "verified": true,
      "author": "JF",
      "helpful_votes": 3,
      "publication_date": 20191010
    },
    {
      "title": "10/10",
      "text": "This is by far the best face wash I’ve ever used.. I have sensitive skin and acne prone skin, this doesn’t cause any flare ups or irritation! I will definitely be repurchasing!",
      "rating": 5.0,
      "verified": true,
      "author": "Cenee Ken Vitela",
      "helpful_votes": 3,
      "publication_date": 20200101
    },
    {
      "title": "Great for my sensitive skin",
      "text": "I got a sample of this when I purchased another Tula product, so glad I did. I have a hard time finding anything for my skin that doesn't annoy it. This is mild and leaves my skin soft, not dry. I bought the full size and am loving it. There isn't a smell to it but it feels soothing and it doesn't bother my rosacea either.",
      "rating": 5.0,
      "verified": true,
      "author": "mbsm",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Light but Effective",
      "text": "I have extremely sensitive skin which is easily irritated. With this said, I am glad I purchased this face cleanser. It works well to cleanse while calming simultaneously. After a few weeks of use, my face no longer has dry skin or red blotches. It is a bit watery but certainly does what it is intended to do.",
      "rating": 5.0,
      "verified": true,
      "author": "FL",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "clogged pores",
      "text": "i was super excited about this product, loved the tingly feeling and adding it before my under-eye concealer, but it clogged my pores and i started to break out.",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren Chaney",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Love It",
      "text": "I have really enjoyed this wash. will need to buy another one soon. i use this one in the morning and my acne one at night since I have sensitive skin",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Kraft",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Love this Cleanser!",
      "text": "I've been using TULA Probiotic Skin Care Super Calm Gentle Milk Cleanser for a couple of weeks. I have extremely sensitive skin and often times using new products will cause my skin to become red, inflamed, and break out. Not with TULA. I love how my skin looks healthier!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Pretty shine!",
      "text": "I love putting this on in the morning before I get my makeup on or during the day when I need a pick-me-up! It’s soft and leaves a pretty shine on my cheekbones. It feels like it wakes me up a little bit more!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Stretz",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Great for sensitive skin",
      "text": "I have dry and sensitive skin. This is the first cleanser that did not make my skin feel tight or make it red or sting after washing! It’s very gentle and my skin feels soft after using it too .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Love!",
      "text": "Love this product! It’s gentle yet totally cleanses! Smells great and feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Cadwallader",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Perfect for dry/sensitive skin types!",
      "text": "Perfect for those with sensitive skin. Does not strip the skin of natural oils and is good for daily use. After finishing my first bottle, I will definitely be repurchasing!",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra Chanel",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Tula",
      "text": "Love this product! It has really helped clear up my skin! Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi Arrant",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Milk cleanser does skin good",
      "text": "I love the milk cleanser. Aw rice enough for my skin yet strong enough to cut through the dirt on my face. And fast shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Erica Mack",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Very watery",
      "text": "It’s really watery so it takes a lot to wash with",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Love It",
      "text": "My daughter was using this so I decided to try it and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great cleanser",
      "text": "Very happy with this cleanser. It helps reduce redness in my face and is moisturizing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin S",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "A product I can trust that works",
      "text": "This product is very light no greasy residue. You have a clean fresh feeling. Noticed a difference in my skin especially after giving birth to my daughter. This product is also safe for breast feeding which I liked",
      "rating": 5.0,
      "verified": true,
      "author": "april",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great!",
      "text": "This cleanser seems to work very well so far! I like how smooth it is. It’s seeming to really clean out my pores as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristi Oliver",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Very gentle and calming cleanser",
      "text": "Smells great. Very gentle very calming and moisturizing. The best facial cleanser I have found",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191001
    }
  ],
  "product_meta": {
    "title": "TULA Probiotic Skin Care Super Calm Gentle Milk Cleanser | Nourishing and Calming for Sensitive Skin with Colloidal Oatmeal, Cucumber & Ginger | 5 fl. oz.",
    "rating": 4.5,
    "feature_bullets": [
      "DESIGNED FOR SENSITIVE SKIN - Sensitive skin calls for the most gentle skincare, and that starts at the foundation: cleanser. This lightweight, milky cleanser is specially formulated to leave skin feeling more nourished and calm, not at all parched.",
      "INSTANTLY SOOTHE STRESSED, IRRITATED SKIN - Full of good-for-you ingredients like probiotics, colloidal oatmeal, cucumber & ginger, and 100% free of fragrance, alcohol, phthalates, sulfates & other irritants.",
      "GOOD FOR ALL - Suitable for all skin types and all ages – perfect for those with dry, dehydratyed, sensitive or problematic skin.",
      "TULA & PROBIOTICS - TULA is the leader in probiotic skincare. We combine powerful probiotics and skin superfoods for healthy, balanced and glowing skin. All our products are clean, clinically proven, and effective.",
      "WORRY-FREE RETURN POLICY - Try TULA worry-free with our 30-day return policy. We stand behind our products and want you to love them as much as we do."
    ],
    "specifications": {
      "Package Dimensions": "7 x 2 x 1.97 inches; 8.01 Ounces",
      "UPC": "850003310114",
      "Manufacturer": "TULA",
      "ASIN": "B07W6XK6HY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Washes",
      "Skin Care",
      "Face",
      "Cleansers",
      "Beauty & Personal Care"
    ],
    "price": 34.0
  }
}