{
  "website_summaries": [
    {
      "verdict": "Apple may have skipped flashy extras on this year's phones, but the iPhone 11 is the best midtier model the company's ever made.",
      "pros": [
        "Even faster speed, improved battery life",
        "The iPhone 11's cameras get an excellent new Night Mode and an ultrawide-angle camera that can add extra detail in photos",
        "Fantastic video camera"
      ],
      "cons": [
        "Only Pro models get the 2x telephoto",
        "The ultrawide-angle camera doesn’t add Night Mode",
        "No USB-C port",
        "The Pro phones have a faster 18-watt charger but the iPhone 11 doesn't",
        "Still has a good (but not OLED) display"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 9.0,
        "Performance": 10.0,
        "Camera": 9.0,
        "Battery": 8.0
      },
      "publication_date": 20200329,
      "rating": 9.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Only for simple mobile",
      "text": "Great phone, but locked to simple mobile! Will NOT work for Verizon or ATT. Returned the phone:( We returned the phone and after two weeks we still do not have a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Lura LeMert",
      "helpful_votes": 219,
      "publication_date": 20191006
    },
    {
      "title": "Watch the network",
      "text": "It is not clearly stated that this is a T-mobile phone!",
      "rating": 1.0,
      "verified": true,
      "author": "Lutisha",
      "helpful_votes": 149,
      "publication_date": 20191003
    },
    {
      "title": "Not worth it",
      "text": "It’s a good phone just it’s sim locked to a T-Mobile account so unless you already have one you need to set up a T-Mobile account but when mine got here it turned out that the SIM card was expired.",
      "rating": 1.0,
      "verified": true,
      "author": "Draik",
      "helpful_votes": 131,
      "publication_date": 20191009
    },
    {
      "title": "Problems",
      "text": "Good morning, I bought this article through Amazon and brought it to Panama, I have problems with the phone to unlock it. What should I do to solve this problem, please",
      "rating": 3.0,
      "verified": true,
      "author": "Arnulfo Castillero",
      "helpful_votes": 76,
      "publication_date": 20191012
    },
    {
      "title": "Locked iPhone at full price",
      "text": "I bought this iphone when I was passing through the USA. As it was at full price and it is not clear in the announcement I did not pay attention to the fact that it is blocked by the carrier (What is the sense of selling blocked at full price???). Anyway, upon arriving in Brazil I had the unfortunate surprise that he was not working with my local operator's chip. I would like help on how to unlock iPhone so I can use it here?",
      "rating": 1.0,
      "verified": true,
      "author": "Augusto Schultz",
      "helpful_votes": 57,
      "publication_date": 20191021
    },
    {
      "title": "Not good",
      "text": "Have to wait (90 days) for it to unlock its self. Or switch to Verizon.",
      "rating": 1.0,
      "verified": true,
      "author": "Jose Luis maxines",
      "helpful_votes": 58,
      "publication_date": 20191012
    },
    {
      "title": "Nothing",
      "text": "No. I returned it. We don’t have T-Mobile service in North Dakota. This phone was falsely advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeanette Mausehund",
      "helpful_votes": 37,
      "publication_date": 20191121
    },
    {
      "title": "Don't buy!!!",
      "text": "I cannot get this phone to work with Simple mobile, Tmobile, Att, Verizon, Tracfone. Such a waste of time and money. I am returning it immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Traylor",
      "helpful_votes": 14,
      "publication_date": 20191212
    },
    {
      "title": "DO NOT BUY",
      "text": "Never buy this product they won’t send you a SIM card for the phone and it won’t activate with an simple mobile sim. The biggest waste of time ever save your time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Christion ",
      "helpful_votes": 12,
      "publication_date": 20191104
    },
    {
      "title": "Totally disappointed",
      "text": "Bought the phone, it's not clear at all that this is a locked phone. Couldn't activate it yet, and nobody in Amazon support could clarify anything yet. Terrible choice to have purchased Apple using Amazon. Terrible!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Leonardo Gomes",
      "helpful_votes": 7,
      "publication_date": 20191222
    },
    {
      "title": "Great phone, great service, great battery, perfect size",
      "text": "The iPhone 11 is great. The screen is bright outdoors, the battery life is amazing and the pictures always come out nice and never blurry. Face unlock is great. No problem with hearing people or people hearing me like I had on my iPhone XR. It says in the description that it is carrier locked to simple mobile. Simple mobile is super cheap and works great here in Sacramento California. I pay $45 a month and get unlimited data talk and text. It’s great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 4,
      "publication_date": 20200318
    },
    {
      "title": "iPhone locked by simple mobile",
      "text": "phone locked by simple mobile and cannot be unlocked within a year",
      "rating": 1.0,
      "verified": true,
      "author": "Yazmin Casallas",
      "helpful_votes": 5,
      "publication_date": 20191021
    },
    {
      "title": "Not able to use phone!",
      "text": "This phone was locked and not compatible with T Mobile although it stayed it was and had a T Mobile SIM card",
      "rating": 1.0,
      "verified": true,
      "author": "Sparty H Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200104
    },
    {
      "title": "You have to use Simple Mobile as your carrier",
      "text": "Make sure you understand you have to use Simple Mobile as your carrier. I sent the phone back because I use Consumer Cellular, and this phone is locked. I'm sure it's a good phone, but I didn't want to switch carriers.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer Joy",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Waste of time and money",
      "text": "Falsely advertised as Simplemobile phone, ended up being a cricket wireless locked IPhone.",
      "rating": 2.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 2,
      "publication_date": 20200801
    },
    {
      "title": "Not Able to Connect to Service",
      "text": "The biggest issue with this phone is it isn’t locked to simple mobile or any other carriers. Contacted Apple and they say it is locked to Amazon Flex Pay. When I talked to customer service they didn’t understand how that could be and offered a replacement. Replacement had same issue. Super sad about it but I’m sure the phone would of worked great. Brand new. In original Apple packaging.",
      "rating": 1.0,
      "verified": true,
      "author": "Mikayla Kissel",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Good phone",
      "text": "I’m using simple mobile service. So this is a good match for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Fang",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "DO NOT BUY",
      "text": "I brought this phone because it said simple mobile. It's not!! Do not buy this phone !!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ny",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "doesnt work at all",
      "text": "do not buy it. I repeat do not buy it. It doesnt work even with simple mobile or t mobile",
      "rating": 1.0,
      "verified": true,
      "author": "kiara",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Locked cellphone",
      "text": "It’s only for new customer at SIMPLE MOBILE. 1 year to unlock to other companies. I returned the unopened box.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191106
    },
    {
      "title": "Does not work even with simple mobile (purchased TWICE)",
      "text": "Do not buy, it will not work even you are a Simple mobile customer.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "NOT T MOBILE. LOCKED AND CANNOT BE UNLOCKED.",
      "text": "Beware!! This is NOT A T-MOBILE EITHER. I own T-Mobile and tried to use my Sim and it failed. It is locked to \"Straight Talk\" under Simple Mobile. I called simple mobile twice and they said you MUST be a customer of theirs for a year before you can unlock. DONT WASTE YOUR TIME.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 8,
      "publication_date": 20191011
    },
    {
      "title": "Do not buy",
      "text": "This phone is locked. It was supposed to come with a SIM card so it could be activated, but it did not. So I went and bought a SIM card to try and activate the phone. It would not work. Do not buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 6,
      "publication_date": 20191113
    },
    {
      "title": "DO NOT BUY THIS PHONE",
      "text": "DO NOT BUY THIS PHONE, I purchased it and spent hours trying to connect it and it never worked. Ended up returning it, it is not a simple phone and it is locked. I repeat this phone is a waste of time.",
      "rating": 1.0,
      "verified": true,
      "author": "Ydalmis Figarola",
      "helpful_votes": 0,
      "publication_date": 20201210
    },
    {
      "title": "For Uber drivers the GPS did not work.",
      "text": "I bought the IPhone 11 with an iPhone Pro Max in the AT&T \"bogo\" promotion. The IPhone 11 arrived on 09/20/19 and the next day I used it to work as a UBER driver. The GPS did not work. Took too long to give the location, and it was not accurate. I could not keep working. The next day I returned it and bought an iPhone 11 Pro Max. I do not recommend it.",
      "rating": 1.0,
      "verified": false,
      "author": "Good F.",
      "helpful_votes": 17,
      "publication_date": 20191001
    },
    {
      "title": "DO NOT BUY!!!!!!!!!!!!",
      "text": "The phone was not Simple Mobile it was a Sprint phone and on top of that the phone was not fully paid for whoever Finance the phone this was a complete scam do not buy from this seller I repeat this was a complete scam do not buy from this seller the phone was not unlock it was locked to Sprint because it was not fully paid for",
      "rating": 5.0,
      "verified": false,
      "author": "MEIR",
      "helpful_votes": 4,
      "publication_date": 20191124
    },
    {
      "title": "Why would you buy locked when you pay full money??",
      "text": "If you buy this locked phone for the full price. You are really not very smart. Just buy it from the apple website. Don't think about buying this phone paying 699 and still locked to simple mobile. This is a complete scam.",
      "rating": 1.0,
      "verified": false,
      "author": "JR",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "I could crap out a better phone",
      "text": "iPhone is singularly the WORST brand of smartphone ever made. You can’t customize the ringtones or backgrounds without spending a fortune paying for extra apps or monthly subscriptions. Utterly ridiculous and a piece of absolutely garbage. Apple should be ashamed.",
      "rating": 1.0,
      "verified": false,
      "author": "Oxide",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "You can read, right?",
      "text": "To everyone buying this device if you don’t have simple mobile for you service provider you can not use this! It is not unlocked please open your eyes the listing tells you that. Thank you 🙂",
      "rating": 5.0,
      "verified": false,
      "author": "Robert Cruz gutierrez",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "It doesn't work on the simple mobile network like the description claims",
      "text": "Don't buy!! it doesn't work on the simple mobile network like the description claims!!! I did everything right with a brand new simple mobile sim kit and it didn't work, avoid yourself some trouble.",
      "rating": 1.0,
      "verified": false,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Never owned an iphone and never will at the price.",
      "text": "Way to expensive for a phone. I would never consider buying on at that price. So far I never paid more then $75 for a phone. There is not enough difference to justify $625.",
      "rating": 1.0,
      "verified": false,
      "author": "PCIII",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Everything",
      "text": "Best thing ever can I please have a free one.",
      "rating": 5.0,
      "verified": false,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Not unlocked",
      "text": "Currently Amazon is selling all these new iPhones LOCKED to Simple Mobile for the same price Apple is selling them unlocked. Why????",
      "rating": 1.0,
      "verified": false,
      "author": "Dennis H. Laska",
      "helpful_votes": 35,
      "publication_date": 20191005
    }
  ],
  "product_meta": {
    "title": "Simple Mobile Prepaid - Apple Iphone 11 (64GB) - Black [Locked to Carrier – Simple Mobile]",
    "rating": 3.1,
    "feature_bullets": [
      "Carrier - This phone is locked to simple Mobile from Tracfone, which means this Device can only be used on the Simple Mobile wireless network.",
      "Plans - simple Mobile offers a variety of coverage plans, including 30-day unlimited Talk, text & data. No Activation Fees, No Credit Checks, and no Hassles On a Nationwide Lightning-fast Network. For more information or plan options, please visit the Simple Mobile website.",
      "Activation - You’ll receive a simple Mobile SIM kit with this iPhone. Follow the instructions to get service activated with the simple Mobile plan of your choice.",
      "6.1-Inch Liquid Retina HD LCD display",
      "Water and dust resistant (2 meters for up to 30 minutes, IP68)",
      "Dual-camera system with 12MP Ultra wide and wide cameras; night mode, Portrait mode, and 4K video up to 60fps",
      "12MP TrueDepth front Camera with Portrait mode, 4K video, and slo-mo",
      "Face ID for secure authentication and Apple Pay",
      "A13 Bionic chip with third-generation Neural Engine",
      "Fast Charge with 18W adapter included"
    ],
    "specifications": {
      "Product Dimensions": "6.61 x 3.66 x 2.05 inches; 6.84 Ounces",
      "Item Weight": "6.8 ounces",
      "Manufacturer": "Apple",
      "ASIN": "B07XSS3Z9J",
      "Item model number": "SMAPI11G64BKP5",
      "Batteries": "1 Lithium ion batteries required.",
      "Date First Available": "September 11, 2019"
    },
    "categories": [
      "Electronics"
    ],
    "price": 672.36
  }
}