{
  "website_summaries": [
    {
      "verdict": "A fast and lightweight tablet that is expandable up to 126GB.",
      "pros": [
        "Features an 8\" display and runs Android 5.0 Lollipop",
        "1.5GB RAM, expandable up to 128GB",
        "Dual-band WiFi",
        "Thin and lightweight",
        "8-hour battery life",
        "Fast and reliable",
        "5MP rear and 2MP front cameras, with a 4x digital zoom"
      ],
      "cons": [
        "Some complaints that the camera quality is not that great"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fast processor and lightweight",
      "text": "Love how light it is compared to the older model I have. Very fast processor and awesome screen, colors are nicely done. I do everything on this tablet instead of my cell phone. They Wifi card reaches a long way from my house which is a plus. You wont go wrong buying this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Vonda Golding",
      "helpful_votes": 23,
      "publication_date": 20190925
    },
    {
      "title": "Works perfect for what it was purchased for!",
      "text": "Purchased this to replace an older 8in model primarily for on the go research, reading apps, and video play back for when the littles are around... this works wonderfully for all these. Started it up(after charging) and the set up was quick and easy to clone my samsung account to this new tablet! No issues",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda",
      "helpful_votes": 23,
      "publication_date": 20191011
    },
    {
      "title": "I love this tablet 😍❤️😍❤️😍",
      "text": "I KNOW YOU MAY NOT THINK I'M REAL, BUT I LOVE THIS TABLET!!! My last tablet was stolen and I searched for a new one for months that was perfect with the perfect price. I needed a tablet to hold ALL of my apps (10 apps for bills, 3 social media apps, 15 shopping apps, Microsoft app for my book(s) I'm publishing, and at least 10 game apps for my kids) and I still have space. Haven't even installed the SD card that comes with it. Almost forgot, it was delivered earlier than expected by like a week.",
      "rating": 5.0,
      "verified": true,
      "author": "AUDRIA IVY",
      "helpful_votes": 18,
      "publication_date": 20200527
    },
    {
      "title": "Nice, good value for the money",
      "text": "They finally moved the buttons onto the screen. No hardware navigation buttons. Love that. Very nice screen, clear, bright. What I don't like: 1: The screen seems to collect scratches easily. Can't see it with the screen on but they are there. 2: Occasionally a little slow...could use a faster processor. 3: At 5% the screen goes dim. There may be a way to turn that off. Have not found it yet. Overall I would buy again because there is very little at the same price point that can match it. I use it to surf news and to read Kindle books. Works fine for those activities. I have not played any games on it.",
      "rating": 4.0,
      "verified": true,
      "author": "MJS",
      "helpful_votes": 15,
      "publication_date": 20200226
    },
    {
      "title": "Good option for casual use",
      "text": "No complaints so far. I use this mostly for e-books and a few games, so I'm not really taxing it too much memory or storage wise. It is reliable and fast for what I need. Like I said, no complaints so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Mae M.",
      "helpful_votes": 17,
      "publication_date": 20191217
    },
    {
      "title": "obviously open box",
      "text": "I've owned well over a dozen samsung tablets and phones. This was the first to come with an unsealed box, interior boxes opened, no film on the charger, and no film on the glass. It is obviously at least an open box, which was not advertised, if not a return or a refurbish. I will not buy from this seller again. I'll revisit this review if any defects become apparent.",
      "rating": 2.0,
      "verified": true,
      "author": "JWK",
      "helpful_votes": 9,
      "publication_date": 20200507
    },
    {
      "title": "Not a good purchase",
      "text": "It's heavy and HAS A lot of error issues where I have to restart it. The screen light goes dim for no reason. Very disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Tammy Wolfe",
      "helpful_votes": 10,
      "publication_date": 20200118
    },
    {
      "title": "SD Card use",
      "text": "Please be aware, tablet is outstanding, however. Samsung in all their brilliance has decided to REMOVE the ability to transfer apps to the sd card making the tablet virtually worthless as its memory gets full very fast. Many messages have gone back to Samsung with no results. Again the tablet is outstanding minus that one flaw, which hopefully Samsung will fix at some point with a software update.",
      "rating": 1.0,
      "verified": true,
      "author": "M Cearlock",
      "helpful_votes": 7,
      "publication_date": 20200507
    },
    {
      "title": "Great for toddler and Mom!",
      "text": "We got this Galaxy Tablet for my toddler to play some of our Google Play games. We didn't want something high-end just in case she broke it, so we first went with the Amazon Kindle. After being beyond frustrated with the way the Kindle operating system works, I decided to get the Galaxy tablet. We haven't had any issues with it, and it's been fun for me to use during quarantine for zoom and Skype meetings as the screen is bigger than my phone's. I would definitely recommend this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amberlie",
      "helpful_votes": 3,
      "publication_date": 20200619
    },
    {
      "title": "better than fire - just being real",
      "text": "so, before you judge - i hacked my fire tablet so it could use google play and google app store, but the fire tablet is not made for gaming so even tho i could get some good games and run them, they were laggy and didnt perform well... this one is higher priced but is pretty decent for gaming, which is all i really do...",
      "rating": 4.0,
      "verified": true,
      "author": "jared",
      "helpful_votes": 3,
      "publication_date": 20200528
    },
    {
      "title": "Too pricey for NOTHING",
      "text": "After 3 months, I was unable to charge the tablet because the cord was not working. So, I bought a new one, but the on/ off (turning on the device) button was not allowing me turn device and my son needed it for his remote learning. I reached out to the seller through Amazon and they WOULD NOT replace it. Disappointed and overpaid for a defected device.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeannie T.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Lost the color, very disappointed.",
      "text": "I purchased this tablet on Feb. 26, 2020. I liked it for the most part but now suddenly I have lost some of the color. It started out going totally black and white and now some of the color has come back but not all of it. I've looked to see if I can contact the seller but I guess not. I will probably ask about it in the Q and A section to see what happens. I'm very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "My kid doesnt bother me now.",
      "text": "This was the best gift i could get my son for Christmas. He has not bothered me for my phn since he's had his tablet!! Great screen, vibrant colors... able to download all his apps and game... only thing is the charger cord went out in about 2 weeks of having had to get a more durable cord. Other than that. Money very well spent!!",
      "rating": 5.0,
      "verified": true,
      "author": "S P",
      "helpful_votes": 2,
      "publication_date": 20200206
    },
    {
      "title": "Got a lemon.",
      "text": "I love Samsung tablets, but the one I bought is a lemon. This device has a faulty touchscreen. I have the sensitivity set to Max, and it still barely responds to touch. You have to tap it 6 or 7 times to get a response.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri L. Manning",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Works poorly online",
      "text": "Internet connectivity is awful. If you research online you will find this is a widespread issue, but when I called Samsung about it they claimed that it must be my internet connection. No help at all. Works great offline.",
      "rating": 2.0,
      "verified": true,
      "author": "John Hill",
      "helpful_votes": 2,
      "publication_date": 20200313
    },
    {
      "title": "Buy it already",
      "text": "Love it. It's just a bigger version of my phone. Lite weight, slim design and clear picture. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ElainaMarie713",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "No directions missing parts",
      "text": "Who knows hubby can't read spanish instructions. I had to buy cord to charge it, no tool to open slot for memory card. This company refuses to make good on anything. So it's goingbin garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Tammie Richardson ",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Had to purchase a charging piece",
      "text": "Tablet is great but did not come with correct charging plug that fits our wall plug size...im told it UK.....which is just stupid I ordered it from Oregon in USA should have come with correct charging unit!",
      "rating": 4.0,
      "verified": true,
      "author": "Gerri ",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Good quality Samsung Tablet",
      "text": "This is a great Galaxy tab. I bought it for my 13-year-olds birthday. It is the first real quality tablet he has owned. He loves it, and so far there have been no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Amazon Fanatic",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great tablet",
      "text": "It's a great value for the money tablet. But it does has a lot of compromises especially display and processor wise. But you do get what you pay for. I would probably recommend this for a kids or somebody just to watch video. It's definitely not going to replace your laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "That guy",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Worth it",
      "text": "I got this for my step son and its such an upgrade from his iPad! Only bug let down is that for some reason it. Are with a European charger instead of a normal American one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms.Luciifur",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "You get what you pay for",
      "text": "This is a cheap tablet that was purchased as a tester for course creation and customer app support. The screen resolution is pretty bad and the touch screen is terrible. Only about every third tap works the first time. If this were a device that I use everyday I would return it. As it is, I can tolerate it.",
      "rating": 2.0,
      "verified": true,
      "author": "bluenancyhawaii",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Good",
      "text": "Tablet is as described. Battery does not last all day when constantly watching videos. However it is good and I would recommend",
      "rating": 4.0,
      "verified": true,
      "author": "clelon dixon",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Look elsewhere!",
      "text": "Got this as a replacement for my fire tablet. Normally I love Samsung products but this thing is slower than the fire was, actually it's slower than my 4 year old S7 edge. At least at streaming video. Otherwise it's ok but I watch a lot of youtube and this thing is frustrating.",
      "rating": 2.0,
      "verified": true,
      "author": "christopher s wiles",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Could not use power plug provided",
      "text": "It came with a Type C European plug so I could not use it. Fortunately I had other American USB plugs that I could use to charge this up. I contacted the seller about it. Other than that, it works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave in Rapid City",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "poor colors. unresponsive touch screen. very slow.",
      "text": "do not buy this device. the touch screen is crap. sometimes it responds. sometimes it doesn't. the colors are very unsaturated and there is no way to adjust them. it is also painfully slow.",
      "rating": 2.0,
      "verified": true,
      "author": "Drew Shriver",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Good tablet.",
      "text": "I bought one for myself a while back and have had no problems. I just bought this one for my son and it works great to. Came fast. Camera does not have a flash which is weird.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Gough",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Want my money back am really upset",
      "text": "My tablet screen not working properly .Its a touchscreen so when touching the screen it not responding as fast as it suppose.Am so upset need this to resolve. Won't recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "jacqueline douglas",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "One complaint",
      "text": "My only complaint is that I was unable to download Netflix and Disney+ apps. This is somewhat disappointing because we have a 16hr car ride in our future, and I wanted to load these apps for my 4yo. Otherwise, the tablet suits his needs for games and whatnot.",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon Noch",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Good to have one...",
      "text": "It arrived earlier than scheduled. 🙂 The packaging was awesome. The battery lasted for 3.5 hours with continuous YouTube play. I am satisfied with the product.",
      "rating": 4.0,
      "verified": true,
      "author": "sukajee",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "A really good tablet !",
      "text": "Switched after 2 iPad Mini tablets. Battery life is outstanding, ease of use and adding apps is great!",
      "rating": 5.0,
      "verified": true,
      "author": "DHENRY",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Great buy for the price.",
      "text": "Love these samsung tablets. My second buy after having my last one for many years and that one still works as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Don't happy",
      "text": "I like this tab ..screen quality good..speakers sound good..battery life so good and long ..but I give it 2 stars cause its comes with European charging plug and they doesn't send US adapter with it ..",
      "rating": 2.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Packaging was terrible!",
      "text": "Packaging was awful! Charging cable and ejection pin were just laying loose in the packaging box. Not the box the tablet was.in. One little air pouch for safety, in a box too big. Tablet, so far, so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Pomfan",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Nice tablet and very functionable",
      "text": "Just opened it and setting it up. Pretty great quality tablet. Overall it's pretty cool and functionable",
      "rating": 5.0,
      "verified": true,
      "author": "Natural Ethics",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Breaks easily!",
      "text": "Screen cracked and shattered by one drop one day after opening it up upon receiving it. I have other older samsung tablets, this is by far the WORST we've experienced and at my fault, I did not purchase the extended warranty. So I am out $149 with no options for replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Lena",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Very satisfied! This tablet is great!",
      "text": "This tablet works great! Downloaded a bunch of apps and they all work perfect! It was easy to set up. Very happy with it! I bought it for my daughter and she absolutely loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "kattie higuera",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Good",
      "text": "It's good I accidentally had it under one star reviewed the wrong item. I bought two or these they work great",
      "rating": 5.0,
      "verified": true,
      "author": "∵¤§ãΐŋ†♣∀₦₲ξℜ◈∴",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Good as teenagers tablet",
      "text": "So far it good. Bought it for my daughter. She is able to play game with it and take picture.",
      "rating": 4.0,
      "verified": true,
      "author": "Mouna",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great size",
      "text": "Tried other tablets. keep coming back to Samsung. Like their phones and tablets.",
      "rating": 5.0,
      "verified": true,
      "author": "Isabella",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "great",
      "text": "this is really good for a young kid to do school on and his games",
      "rating": 5.0,
      "verified": true,
      "author": "Johanna Cutting",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Go ahead and get it, but you might want a bigger screeen.",
      "text": "I love it, the display is very vibrant, and for a tablet it seems to be pretty fast. Samsung usually doesn't disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "CoconutTiki",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Not worth buying",
      "text": "My tablet freezes and I have to wait for it to completely lose battery life. I will never buy another.",
      "rating": 1.0,
      "verified": true,
      "author": "Curtis",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Serves it’s purpose well",
      "text": "This is a great tablet for kids. Reasonable and keeps them occupied",
      "rating": 5.0,
      "verified": true,
      "author": "Maudeen Scott",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Amazon now takes 10 days unless you have pri me.",
      "text": "Screen quality not great. Does what it is supposed to.",
      "rating": 3.0,
      "verified": true,
      "author": "matt scott",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Awesome for the money !",
      "text": "Just beware the pattern to lock it ! The pattern will not re- trace and you will be locked out. Simply skip any locking and it is a great product ! I will definitely buy Samsung Galaxies again ! 😁😁",
      "rating": 5.0,
      "verified": true,
      "author": "Pearl Booth",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Not what I wanted.",
      "text": "Seems like a very quality tablet. But I will be returning it. I was wanting something that I could download my kindle and nook books on. And yes it can be used that way. But all the other stuff pops up also. My emails and other crap I don't want that on my reader.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Touchscreen issues",
      "text": "My unit has touchscreen issues. When tapping in one place the screen thinks I've tapped a bunch of other places all at once. This happens on the lock screen, and multiple apps. Will be returning this asap and go for a better product.",
      "rating": 1.0,
      "verified": true,
      "author": "William R.",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Make sure it is in english and not spanish",
      "text": "I had to return it because everything was in spanish. I only can read and understand english.",
      "rating": 1.0,
      "verified": true,
      "author": "David K.",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Missing SD card",
      "text": "Came rather quickly but did not come with the extra 32GB memory card that shouldve came with it. (I got the bundle, even checked inside to see if they might've put it in before shipping it out, nope)",
      "rating": 4.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Sunsung Tab Galaxy A 8”not good!!",
      "text": "I can’t figure how to get it off Spanish and get English. Also can’t turn it on. Someone told me I need a PIN stick. Please reply!! Thank you very much.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Stinchcomb",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Good buy",
      "text": "Great tablet for our needs, used for studying at home and for video chatting.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty Hinrichs ",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Good purchase",
      "text": "I got this tablet for my 7 year old daughter so she could play her Roblox and minecraft and also do youtube. She loves it its run smoothly and takes great pictures and videos both front and back cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "Simone Dormer",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Very pleased thank you",
      "text": "Use it to schedule appointments for my business works great",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Wifi",
      "text": "This tablet was defective. Tablet couldn’t log on WiFi so I had to return it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Perla",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Excellent buy for money",
      "text": "Excellent for playing a few games & a few shopping apps. and that's what I needed .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Disappointed",
      "text": "Language is set to Spanish. I do not speak Spanish.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Excellent  value with good volume.",
      "text": "I think this tab is a great value. I should have waited before ordering the second tab, cuz I believe Samsung will be releasing a newer upgrade tablet this year (2020).",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Love it",
      "text": "I love this tablet ❤️. It is so crisp and clear and the colors are beautiful. It runs fast too. Nothing to complain about.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Powell",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Not worth it.",
      "text": "Had it less than 2 months and it won't charge nor turn on . It's done. All that money down the drain. It'll cost what I paid for it just to fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "Luisa",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Good price but slow internet connection functions.",
      "text": "This tablet is good and was worth the cost however I had internet connection problems. Sometimes, it would take forever to load simple stuff like websites or apps that require internet connection.",
      "rating": 4.0,
      "verified": true,
      "author": "christina",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Great tablet,  great picture, and easy to use.",
      "text": "These are very good tablets for kids. We got them for monkeys for Christmas and setup Google Family account on them so no worrying about what they go on offer do.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Not good for Zoom",
      "text": "Didn't work well at all for Zoom. Kept buffering & going out all together. Wasn't WiFi as my cell phone works fine on Zoom.. Disappointed. Keypad isn't always responsive.",
      "rating": 2.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Fast delivery of Samsung Galaxy Tab A 8.0",
      "text": "The quick delivery of the product thrilled me. However, I haven't started using it and would update my reviews immediately I begin to use the device",
      "rating": 5.0,
      "verified": true,
      "author": "aramide adesina",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "need English instructions",
      "text": "the devise was pre setup in Spanish, instruction pamplets included was in Spanish. I don't read Spanish. I have requested seller rush me instructions in ENGLISH.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry l.",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Wonderful",
      "text": "It's just what I was looking for not too big and not top small, just perfect enough for travel and easy enough to use. 5 stars for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Pechacek",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Exceeded Expectations",
      "text": "Delivered 2 weeks early and in perfect condition. It works great and was delivered with its Case and screen protectors. Worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Vachenique Walters",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Can't connect to smart tv",
      "text": "Nice for the price but lacking in lots of areas",
      "rating": 4.0,
      "verified": true,
      "author": "AndI Boyd",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Not what I purchased",
      "text": "Bought this for my husband, it's a children's version! Didn't say that on Amazon. Luckily he is still able to use it to stream.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie Matys",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Instructions in English",
      "text": "Completely disturbed that the instructions came in every language but English!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Strange",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Should have  listened to other reviews.",
      "text": "Would not stay connected to internet. This seems to be a common problem with this tablet. Also came in Spanish.",
      "rating": 2.0,
      "verified": true,
      "author": " Jay bird",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "It feel great",
      "text": "it's easy to use. I use it to go on prayer conference call",
      "rating": 5.0,
      "verified": true,
      "author": "CARLOT DALCE",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "not a good ipad",
      "text": "new ipad and freeze up it to slow i never buy another",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Jones",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Gift",
      "text": "Bought it for my four year old daughter and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Nakisha Jones",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Best Buy",
      "text": "very easy set up. I love Samsung products , Will prob order another one :)",
      "rating": 5.0,
      "verified": true,
      "author": "olivia taylor",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Much. Iced than my old tablet",
      "text": "It is a replacement for my 4+ year old tablet, much nicer",
      "rating": 5.0,
      "verified": true,
      "author": "Grumpygirl ",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Watch buying a stand for it. The measurements can be tricky. Measure diagonally",
      "text": "Solid tablet, easy to transfer apps and account from Samsung phone",
      "rating": 5.0,
      "verified": true,
      "author": "Jerrold Bankert",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Overall, It was really good",
      "text": "I like the color and it it has a very good battery life and the size is very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Samsung tablet",
      "text": "I like the product a lot and how it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Almaraz",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great performance Easy set up Buy it",
      "text": "Awesome tablet, perfect tote size, clear vivid scream, operates smooth, love the size... just right. New with little quick guide and charger included. Well packaged, quick delivery, and great tablet. If you have a Samsung, you can use smart switch to transfer all your info, and of course if you use Google drive, it'll transfer your info as well. Once you open it and power it on, it takes you through set up in minutes. Was actually using mine normally within 5 minutes and I'm completely enjoying it. Great performance",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Good Product for the money",
      "text": "I bought this just for a second device so my grandkids don't always want my phone. I use it also for different things. So far it has kept up just fine for me. The only thing I would have to say a negative would be is the touch screen is not very sensitive. It's not terrible but it's definately not like my phone. That's my main complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Aiken",
      "helpful_votes": 0,
      "publication_date": 20200816
    }
  ],
  "product_meta": {
    "title": "Samsung Galaxy Tab A 8.0\" (2019, WiFi Only) 32GB, 5100mAh Battery, Dual Speaker, SM-T290, International Model (Black)",
    "description": "Size:32GB| Color:BlackThe tablet that goes where you goDiscover a practical companion in Galaxy Tab A, a tablet that excels at the basics and adds a lot more. With a design that’s easy to carry with one hand, it's slim, compact, and portable with the ideal blend of performance, design and attainability. A design that won't get in the wayWe removed the front home key and moved the logo to the back on Galaxy Tab A to give you a larger screen to view and explore. Dual speakers fitted on the bottom of the tablet stay out of sight and complement the slim feel. The rear side with a metal backing provides a sleek touch. Just slip it in and goThere's always room for your Galaxy Tab A wherever you're going. Slim and just 345 grams, children carry it with ease while adults can grip it in just one hand. Find it in either black or silver to fit your own style. A screen you'll love to watchGalaxy Tab A packs an 8-inch, bright 1280x800 pixel display with 16:10 screen ratio for optimum viewing in both landscape and portrait. And to get started viewing and streaming, the tablet comes with 2 months free of YouTube Premium so your favourite videos keep playing ad-free and uninterrupted. Battery life that stands out from the packGalaxy Tab A carries more power than you'd expect in a device this sleek. The 5,100mAh* battery gives you the freedom to forget about your charger for long periods of time when you have somewhere to go or lots to watch. Power your life, keep your momentsWhen it comes to performance and space, Galaxy Tab A checks off all the boxes. It comes with 2GB of RAM and 32GB of storage, and the latest Android OS P. A dedicated SD Card slot allows up to 512GB more so you can keep all your memories in one place.",
    "rating": 4.5,
    "feature_bullets": [
      "8.0\" (203.1mm), Resolution: 1280 x 800 (WXGA), TFT, 16M Color Depth, 5100 mAh battery",
      "RAM - 2GB, ROM - 32GB, MicroSD (Up to 512GB), Android 9.0 (Pie), Qualcomm SDM429 Snapdragon 429, Quad-core 2.0 GHz Cortex-A53",
      "Rear Camera - 8.0 MP, Front Camera - 2.0 MP, Dual Speaker, Bluetooth v4.2, USB 2.0, GPS, Glonass, Beidou, Galileo",
      "Wi-Fi - 802.11 a/b/g/n 2.4+5GHz, Wi-Fi Direct, Samsung Kids Home, No SIM Card Supported",
      "International Model, Does not have US warranty."
    ],
    "specifications": {
      "Standing screen display size": "8 Inches",
      "Screen Resolution": "1280x800",
      "Max Screen Resolution": "1280 x 800",
      "Graphics Coprocessor": "Adreno 504",
      "Average Battery Life (in hours)": "14 Hours",
      "Brand": "SAMSUNG",
      "Item model number": "SM-T290",
      "Hardware Platform": "Android",
      "Operating System": "Android",
      "Item Weight": "1.2 pounds",
      "Product Dimensions": "8.3 x 0.3 x 4.9 inches",
      "Item Dimensions  LxWxH": "8.3 x 0.3 x 4.9 inches",
      "Color": "Black",
      "Rear Webcam Resolution": "8 MP",
      "Processor Count": "4",
      "Flash Memory Size": "32 GB",
      "Power Source": "Battery",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B07XJZ7VQD",
      "Customer Reviews": "4.5 out of 5 stars702 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#736 in Electronics",
      "Date First Available": "September 1, 2018"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Computers & Tablets",
      "Tablets"
    ],
    "price": 139.0
  }
}