{
  "website_summaries": [
    {
      "verdict": "Those with investment or rental income to report – and who need extra help with the new tax laws – can benefit from this version.",
      "pros": [
        "This is best for filers who have rental income or who sold stocks or bonds in 2019, as the Deluxe version no longer has those forms",
        "Loads quickly with few to no glitches reported, and users can scroll rapidly through questions",
        "Works smoothly with Windows 10"
      ],
      "cons": [
        "Some issues with nonworking CDs and installation errors reported"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Program will not launch",
      "text": "Computer met requirements, program loaded okay, initial verification worked , program would not launch but kept cycling back to verification in a loop. Spent about 4 hours with turbotax help with no resolution. Also downloaded a fresh version which exhibited the same problem. Could not recommend buying until bugs resolved.",
      "rating": 1.0,
      "verified": true,
      "author": "jr",
      "helpful_votes": 60,
      "publication_date": 20191221
    },
    {
      "title": "Can't install software updates",
      "text": "I have used TurboTax each year for over 20 years. This year I purchased it again from Amazon, However it will not allow me to down updated software on either one of my computers (some of the schedules are not approved) and need updating. Don't know if I should return the TurboTax package (and use some other tax software) or if TurboTax is still updating it's install/update process",
      "rating": 2.0,
      "verified": true,
      "author": "John C Vander Wal",
      "helpful_votes": 51,
      "publication_date": 20191127
    },
    {
      "title": "Turbotax 2019 Premier disk version",
      "text": "Disk arrived within estimate in new condition. Installed on Win10 PC without issue. Started 2019 tax return but many forms will not be available until January 2020. Win10 64-bit kicks out whenever Turbotax \"Continue\" button pressed. Next year, I plan on using Internet version. Later found that Turbotax still works on Win7. I will miss Win7 64-bit after January 2020. Information on rental \"safe harbor\" incomplete, did not mention self-employment tax.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired Petroleum Engineer",
      "helpful_votes": 27,
      "publication_date": 20191211
    },
    {
      "title": "Great Product for Anyone Who Doesn’t Know What They’re Doing with Taxes",
      "text": "Been using TurboTax for years and love it. This version is more expensive, but I do have some stocks, so it’s what I need. For a long time I paid to have my taxes done and, then, decided to try TurboTax and I’ve liked it ever since. Very easy to use—from the first moment when you load the software on the computer, the prompts take you step by step. At the end, it analyzes everything and asks you to redo anything that is wrong or looks wonky. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Honeybear’s Mom",
      "helpful_votes": 12,
      "publication_date": 20191217
    },
    {
      "title": "Really second rate user experience this year......",
      "text": "Have to enter the license key every time I run the program. It seems to be a common problem for this edition. The help center isn't much help. They recommend several steps to your internet/computer environment to work around it, but since the registration has worked in years past -- I think the issue is on their end.",
      "rating": 1.0,
      "verified": true,
      "author": "kupagu",
      "helpful_votes": 11,
      "publication_date": 20200127
    },
    {
      "title": "Free version of Quicken is trying to charge me",
      "text": "I purchased the Turbo Tax Premier 2019 and It comes with a free 1 year Quicken subscription. I try to claim the free Quicken offer but Quicken keeps trying to charge me $37.49.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Hershberger",
      "helpful_votes": 10,
      "publication_date": 20191230
    },
    {
      "title": "Major Problem with Download and Tech Support",
      "text": "I purchased the PC disc and it was rapidly delivered. However, I could not read the disc. Turbotax claims you can download the software directly, but when I tried that Turbotax wanted to sell me the downloaded copy. Supposedly a screen should have appeared where I could enter the password. Instead, Turbotax sharted asking me my data to decide what package I needed. I phoned tech support and they phoned back but the automatic voice said this is the last time they would call, this was the first callback, and hung up. I can understand a disc problem, but the download should have worked. That failure and the failure of teck support is poor service.",
      "rating": 3.0,
      "verified": true,
      "author": "Randall C.",
      "helpful_votes": 6,
      "publication_date": 20200126
    },
    {
      "title": "Read this before purchasing",
      "text": "The software works very well. I just want to note that if you do not want the software installed on a physical machine then do the download, not the CD. I ran into this issue last year where the only place I could install the CD was on a physical machine. I have all of my tax stuff on a virtual machine and the CD would not install on it. The Amazon download you can install anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Baja Bound",
      "helpful_votes": 7,
      "publication_date": 20200110
    },
    {
      "title": "Requires activation",
      "text": "The good: Easy to use. Great UI. Can import previous year’s tax return and therefore makes this year’s input easier. The bad: 5 activations only. Each family member does his own text on our pc/Macs. We used to uninstall after refunds are received. The activation requirement makes re-installation more complicated.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20200101
    },
    {
      "title": "Amazon works with people",
      "text": "I have used turbo tax for years. I have a dialup system and worked fine also. I purchased this turbo tax and downloaded it. Everything did fine until it was ready to update. It would have a blue circle for a long time and do nothing. Amazon let me refund the product with no problems. Thank you Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "F.S.",
      "helpful_votes": 6,
      "publication_date": 20200121
    },
    {
      "title": "Insta",
      "text": "Smooth install with CD. PRICE OK. SUPER FAST DELIVERY. USED TURBO TAX FOR YEARS",
      "rating": 5.0,
      "verified": true,
      "author": "no fiction",
      "helpful_votes": 7,
      "publication_date": 20191121
    },
    {
      "title": "USED PRODUCT, NOT NEW",
      "text": "The software packaging was open and the security tape for the plastic disk container was broken. The disk itself loaded up and seems to operate ok. Primary complaint is that I was delivered a used product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20191217
    },
    {
      "title": "Manual update required",
      "text": "Normally I’d give a stellar review. This year the program won’t auto update 2019 tax rules. That’s always been the first thing you do. Doesn’t work for anyone this year. For federal updates, search google for “TurboTax Premier 2019 manual update” for the patch. Download and run the file. Works fine. They don’t have a patch for state taxes but they do give some advice for that. My state doesn’t have taxes so I didn’t have that problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheryl C.",
      "helpful_votes": 4,
      "publication_date": 20200126
    },
    {
      "title": "I order a disk for a reason",
      "text": "While turbo tax has very pleasant and patient American base tech support staff I would much prefer a product that worked out of the box. I very nice man was on the phone with me for nearly 3 hours to get the product to work. Did I get compensated for three hours taken out of life? Duh No! I ended up with a download version of TT. I ordered the disk but it was damaged. Sadly TT has a monopoly on tax software as the HR Block brand is crap. Bottom Line: Taxation is Theft. Vote for Bernie and it will be 72% worst.",
      "rating": 3.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 3,
      "publication_date": 20200212
    },
    {
      "title": "Does not work with Windows 7",
      "text": "Despite what the specifications say, the CD-ROM for Turbo Tax 2019 does not work on Windows 7. I tried several times to install and re-install. The installation appears to work and then the application starts (after checking for updates) and then as soon as you try to \"start a new return\" the application crashes. It prompts you to submit information about the error (which I have done 3 times) and then it exits the application. I tried emailing Turbo Tax twice and I have received no response. First time I can say \"I do not recommend\". Better to do online.",
      "rating": 1.0,
      "verified": true,
      "author": "Simon Muther",
      "helpful_votes": 3,
      "publication_date": 20200223
    },
    {
      "title": "Awful but necessary software",
      "text": "They say the US system of government is awful - EXCEPT FOR EVERY OTHER SYSTEM IN THE WORLD. Same goes for this software. It's atrociously bad for anything but the simplest of tax situations. While attempts are made to steer you correctly with interview questions, Intuit finds every novel way of wording the questions vaguely to steer you down a rabbit hole of dis-information and confusion. Only problem is there is no other viable competing solution.",
      "rating": 3.0,
      "verified": true,
      "author": "EGAMZN",
      "helpful_votes": 3,
      "publication_date": 20200207
    },
    {
      "title": "after 10 years of using, i am disappointed",
      "text": "Easy to use, however, when it cam time to transmit to the State...TT said it needed an update and to go to the online and check for an update, went to online, checked update...TT said all updates were on, still couldn't send to the state. Called TT x2, was on phone for hours, tech was trying different things but did not resolve. it did transmit the Federal. I will think twice before ordering this again.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Welker",
      "helpful_votes": 3,
      "publication_date": 20200210
    },
    {
      "title": "Be careful of install limit",
      "text": "New this year is a limit of 5 computer installs with no way to uninstall if you load the program on the wrong computer. I pay for this product instead of using the free one because I can share it with family. In the past, there was no limit on the number of installs. I'm not griping so much about the limit as I am about the fact that you can't uninstall if you put it on the wrong computer. Be very careful where you install it as you can't move that installation to another computer. Looks like we may be going back to the free version in the future.",
      "rating": 3.0,
      "verified": true,
      "author": "esimmers",
      "helpful_votes": 3,
      "publication_date": 20200204
    },
    {
      "title": "After many years, finally got hit with Turbo Tax extra charges",
      "text": "I don't think this is Amazon's fault, but \"include state return\" only includes the filling out of forms and printing. E-file costs $19.95 extra, only shown in fine print on back of box. Turbo Tax also added another $39.95 service charge for something; I needed their software, but next year will investigate other services.",
      "rating": 2.0,
      "verified": true,
      "author": "1oddmanout",
      "helpful_votes": 3,
      "publication_date": 20200128
    },
    {
      "title": "Turbo Tax makes doing the taxes easy",
      "text": "I have rental property and stocks. The Premier edition works great. Last year totals line up side by side with this year and it is easy to see where you had an entry last year so you don't miss it this year.",
      "rating": 5.0,
      "verified": true,
      "author": "Jer",
      "helpful_votes": 4,
      "publication_date": 20191215
    },
    {
      "title": "Used it for years",
      "text": "I've used Turbo Tax for years. It tracks all the depreciation schedules and makes filing taxes easy. I've was enrolled in the Turbo Tax Advantage Program, but when they announced they weren't going to support use with Windows 7 any longer, I decided to transition to Tax ACT or some other software that wouldn't force me to buy a new computer just to file taxes this year. After they changed to allow one more year, so did I. For the record, I don't buy Turbo Tax for tax advice, I buy it to do the math!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 2,
      "publication_date": 20200129
    },
    {
      "title": "Great in most instances.",
      "text": "Used TT for many years. It just works. Only problems I ever had was it wouldn't allow e-filing when I had an equity that issued a K-1. Not worth two hour hold for TT expert assistance. Printed and filed by mail instead and paid extra $11 for postage. Otherwise, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "amanda",
      "helpful_votes": 3,
      "publication_date": 20200107
    },
    {
      "title": "Steady-eddie",
      "text": "Been using TT for years and this year's version is the same. Works, is easy to use, and accurate in calculations. One caveat, not with TT PC but about it and online version in general. TT comes with one state included. If you want to file a second state and try to use the TT online free version, it won't let you because the online version doesn't know you filed Federal using TT using your PC. Had to print out and file the second state on paper. It'd be nice if your PC version and online version accounts talked to each other. -1 star for the difficulty.",
      "rating": 4.0,
      "verified": true,
      "author": "Psi 5",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "State e-file failed",
      "text": "My state e-file failed due to an incorrect calculation of some sort. There message said I need to wait another week and update my computer with the latest files, run a check, and then retry the e-file. OBVIOUSLY, this is not an issue with me and is a TurboTax failure. My return was fairly simple and I fail to understand Intuit's lack of quality control.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Martin",
      "helpful_votes": 2,
      "publication_date": 20200120
    },
    {
      "title": "Won't work",
      "text": "I've used turbotax for the longest time and have never had this much trouble. It won't allow me to activate the software. I've tried to download and the disc with no success. I've followed the instructions : disable the antivirus and reset the modems, still nothing. This year I might just go to someone to do my taxes.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Rios",
      "helpful_votes": 2,
      "publication_date": 20200215
    },
    {
      "title": "do not use on mac!",
      "text": "Soem fields impossible to enter data in, they look bizarre and obviously have bugs. Support agreed and had me start taxes with no imports from last year. Still had same issue. Hours lost, and final solution was to revive an old windows pc and then TurboTax worked as expected. Also, I asked for CPA help, and he was bizarre. I had to tell him 3 times over 45 minute call that my question is where to manually type passive loss. The best he could come up with was to read verbatim help file wher to input capital loss...After 3rd time of me saying PASSIVE LOSS, why do you keep telling me Capital loss instructions, I just hung up.",
      "rating": 1.0,
      "verified": true,
      "author": "Amoezon",
      "helpful_votes": 2,
      "publication_date": 20200204
    },
    {
      "title": "Amazon had best deal this year",
      "text": "Have used TurboTax three years in a row... the first two times online version and this time, disc version. Usually I could find good deals online but somehow not a big safer this year... Amazon had the best price. It's good that even they deliver a physical disc you don't have to really install the software from there (given that not too many people have a CD/DVD reader/player nowadays), it's still possible to download the software from their website, what you only need is the serial number that comes with the package. Done my tax return just now... better experience I'd say, comparing with online version. I'd consider using it next year too.",
      "rating": 4.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "It works.",
      "text": "I've used TurboTax every year since 1992. Lots of changes over the years. I am not here to debate costs and small changes over the years. If you want to do your taxes easily, then pick this or one of the other services and just stick with the SAME program. We have to file, right? We want to do it quickly and without hassle, right? It needs to be inexpensive, right? I have no complaints. It still works like it did 25+ years ago. OK?",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Crenwelge",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Love turbo tax",
      "text": "We have to use the premier version because we have lots of stock transactions. We've been using turbo tax for about 10 years and really like it. The full price is way too high so we were happy to find the CD version we prefer on Amazon at a reduced price. It's breeze to import all those stock transactions with one click and save me hours of figuring that all out (cost basis, capital gain/loss, etc) and typing. Turbo tax seems to be really good at finding all those deductions (what's left of them after Trump's tax act). We highly recommend turbo tax and Amazon had the lowest price i could find anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Cannot install on my older tax computer",
      "text": "Use Turbo Tax for ease of investment/dividend reporting. Being able to download directly into the application is the major reason I use it. Now that microsoft no longer supports windows 7, Turbo Tax requires an operating system upgrade???? Why???. Purchased a simple windows computer as a simple machine to just do taxes on. It comes out once a year, imports old tax information and completes the tax forms easily once you get used to how Turbo Tax works. In the 2019 Turbo Tax version you are required to upgrade the microsoft operating system. Not for me do not want to upgrade so goodbye Turbo Tax it has been fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan E. Blee",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Fast and accurate taxes",
      "text": "I've used TurboTax for years, and always find it to be pretty easy to use and quite comprehensive. You can pick your own path and fill in only the things that are relevant to your return, or if you're nervous about missing something, the program will take you through all the possibilities. It automatically downloads my W-2 and 1099 forms, which saves a lot of typing and assures accuracy.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Turbotax is the Best! Best price is: Amazon!",
      "text": "I use Turbotax every year and love it. This came here pristine perfect! You need to give it a try. It's so easy to get your taxes finished. The UPS driver is sold on it after speaking with me. I told him to go on Amazon to get his. Make sure to purchase the protection from Turbotax at the end. A life saver. It's found at the end of doing your Taxes. I'm a 20 year plus veteran of Turbotax.",
      "rating": 5.0,
      "verified": true,
      "author": "DebbieG",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Very helpful if you want to do your own taxes",
      "text": "It is great if you want to do comparisons like whether it is better to itemize deductions or take the standard deduction. I wish it was better about importing data from previous years regarding carry over expenses related to rental property and it could be better about offering the right forms to track IRA contributions, but at least it has the forms in there if you go looking for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparx",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Check your work.",
      "text": "I have been using Turbo Tax for several years and have not had any problems until this year. I normally pick what forms I need manually because I’m very experienced in tax preparation and have prepared simple and complexed returns for others years ago. This year’s Turbo Tax had more bugs than usual and if I were not an experienced tax preparer I could have made unnecessary mistakes. But my major complaint was that I had to wait two weeks for the 4562 forms relative to depreciation to be ready. I hope the bugs and delays are eliminated next year or I will be looking for another tax program.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Another Year of Taxes Filed",
      "text": "Have used Turbo Tax from its beginnings -- some 10 + years. I use the Premier version because of a few complicated issues. Have never had a problem and have always found the programs easy to work with. I like being able to bring forward to each new year needed info from the previous year. I file both federal and state taxes, and although I don't appreciate having to pay an additional fee to file the state, I've always done so. It's nice to have everything in one place. I download everything to a CD disc. Recommend Turbo Tax over most of the other programs available.",
      "rating": 5.0,
      "verified": true,
      "author": "wanderso3",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "I used use another brand and it was bad ACT",
      "text": "I used another brand for a very long time (over 20 years). The last three years I have used turbo tax and it was MUCH better. The other band that is a bad ACT actually miscalculated my taxes. I called them up and showed them their error, and they said it was right. I put the info into Turbo Tax and it was correct. I use turbo tax for home and Business, unfortunately as corporation I need to buy two versions and neither are cheap and they do not talk to each other - but it still better than filing an incorrect return.",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Sears",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Excellent tax software!",
      "text": "We have used TurboTax fort many years. The 2019 version is just as good as ever! Easy to use overall. You have to be careful when you get off the beaten path, however. The program is not suited to odd and unique tax situations.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 2,
      "publication_date": 20200104
    },
    {
      "title": "Had to have before year end, at a price",
      "text": "Wish I could have waited until tax season when there is more competition.....",
      "rating": 3.0,
      "verified": true,
      "author": "John B",
      "helpful_votes": 3,
      "publication_date": 20191228
    },
    {
      "title": "Kept Crashing",
      "text": "I was so disappointed with this version of turbo tax, it had problems from the time I loaded it. It kept freezing and crashing so I called the support number three times. The first time, the tech rep gave me some instructions but that didnt fix it, the second call the rep left the phone and didnt come back! The third call the rep was great, she told me that there were problems with Premier and she had me download a version from thier website and after some tweaks I was finally able to do my taxes. If TurboTax cant get a trouble free product out next year, I probably wont use it.",
      "rating": 1.0,
      "verified": true,
      "author": "ArizMike",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Love doing my taxes with this!",
      "text": "After two years of screw-ups by the tax preparer we used and paid several hundred dollars to boot I figured we couldn't do any worse if we did our own taxes. TURBO-TAX is so easy to use and walks you through everything. I had a question and was able to access a live person since I couldn't find the answer on line. He was very helpful. Last year I had to file an amended return (my fault, not theirs) and it was really easy to do. Have no complaints at all and will continue to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Not the quality product from prior years",
      "text": "2019 Turbo Tax Premier: spent 1hr and 20 mins on the phone with customer service (a misnomer) and while she was very nice she couldn't help. I hung up without resolution and spent another 45 mins rebooting, resaving the file, and questioning my purchase decision. Was able finally able to complete my return only to get in a nasty circle trying to transmit, responding to the request to update software. Updating software only to go back to the same message when trying to Transmit again. Rebooted twice and finally got it to transmit. (this is a common problem if you look at blogs). I will likely look at alternatives such as HR Block (tax cut) software next year.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Quick and Easy",
      "text": "Does its job. Makes everything fast and simple. If you've been using TurboTax throughout the years, you know that it saves your information so you don't have to type it again. If you're a first time user, it'll take a bit longer. There are software out there that does it for free but that only applies to people that do not have any investments. Of course, TurboTax charges a good amount of this each year, however, it's still cheaper than going to an accountant.",
      "rating": 4.0,
      "verified": true,
      "author": "defaultTop Contributor: Travel Guides & Tips",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Returned item sold as new?",
      "text": "Received item. Bought as new. However, I noticed that there is no shrink wrap around it to indicate this is new. Instead there were two paper tags- one at the top center and one at the bottom. They weren't even tight. Did I get a used copy or return? I'm afraid to load it on to my computer. Is this the way Intuit is selling this product? Should I return it to Amazon?",
      "rating": 4.0,
      "verified": true,
      "author": "W. Lee",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Saving $100s per year paying CPAs to do our taxes",
      "text": "We have used Turbo Tax for the last five years after our Tax Preparer of 25 years unfortunately died. We could not find another Tax Preparer so late in the season, so we purchased Turbo Tax and found it easy-to-use. It was also great in that we knew right away whether we were going to receive a refund or have to pay taxes as soon as we started entering data into the program. With the Tax Preparer, we waited with \"baited breath\" every year to see what our tax obligation was going to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Misa400",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Doesn't work if you have K-1's",
      "text": "There's a problem when you have K-1's. Intuit mentioned it would be fixed in the February 20th release but they didn't. Can't wait much longer... may need to get H&R's!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ed Villamizar",
      "helpful_votes": 2,
      "publication_date": 20200225
    },
    {
      "title": "Easy to Use and Accurate",
      "text": "Ive been using Turbo Tax for over 15 years now ; it’s incredibly easy to navigate though all the steps and it is very accurate. My dad uses an accountant who charges $225 and just for fun this year, I asked him to give me his W-2, 1099’s etc without seeing his finished copy from the accountant. To his astonishment, the turbo tax version had the EXACT same bottom line figures. Looks like his accountant won’t be seeing him next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Scotty9",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Decades of Use",
      "text": "I've used Turbo Tax for decades upon decades and it has never let me down. I often catch things I've missed and the deduction finder and donation worksheet are very handy. Plus, I've never had an audit, which speaks volumes about the integrity of the product, calculations, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale in Tennessee",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Worst than previous editions",
      "text": "Problem with activating the software and downloading one free state which shouldn’t happened to begin with. Although tech support was able to resolve it over the phone, I will never get back that hour of my life. It’s getting worst than previous edition due to new activation issues. Other than that, it’s a decent program. However, with all these unnecessary headaches, I won’t be using it again next year. Will try H&R Block software",
      "rating": 2.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "The best",
      "text": "Of all the things in life that I have the joy and privilege of doing, taxes is certainly NOT one of them. I have used both major tax softwares, and TurboTax seems to be the least problematic. The systematic way information is entered is relatively easy. Supplementary information is helpful. Data import is straight forward. All in all, TurboTax is best. Buying it from Amazon also makes good sense. Thanks to both of you.",
      "rating": 5.0,
      "verified": true,
      "author": "Barclay's Review",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "TurboTax confirmed bug, blank medical deduction edit screen",
      "text": "Purchased, 1/20/20: TurboTax Premier CD. Could not edit medical deductions, page is blank. Contacted TurboTax support 4/9, authorized new downloaded program – same problem – blank medical deduction screen. Support again, 4/14, confirmed this problem is known by TurboTax, cannot resolve, only offer me discount on online version. TurboTax can offer no help refunding as it was purchased from Amazon, my next step.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Pak",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "TurboTax is my go-to program to do my taxes",
      "text": "TurboTax has been my go-to program to do my taxes for years now. It keeps my information from year-to-year and asks me questions that are relevant to our former declarations. You are allowed one state income tax download but still have to pay to efile the forms (you can print for free). It does get pricey if you need to purchase an additional state form plus efile; you could almost pay for another program set.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Elliott",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Does the job, but wants your private information",
      "text": "As the years have gone by using this program it is more and more difficult to just use it off line so they won't get the information I don't want them to have, \"read the privacy policy\" yes really read it. After downloading the updates and state, I turn off the internet, but if I don't finish all the taxes at that time, the program will not start without the internet connected. Why. What happened to Privacy?",
      "rating": 4.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Used Turbo Tax for YEARS, Never any problems.",
      "text": "I have used Turbo Tax for years and never ever had one single problem. Just put the disc in the computer and enter your information and you are off to the races. I never had any audits or malfunctions with Turbo Tax, even when I owned three businesses at one time. Best Tax Program on the market. It even allowed me to send my taxes in via email and eliminate the hassle of running to the post office. I LOVE TURBO TAX.",
      "rating": 5.0,
      "verified": true,
      "author": "Amos Moses",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Activation Pain but the Software Works well",
      "text": "Installed and activated fine. But a couple of days later it updated the software and when it started to the program it asked to be activated a second time. Calling support the tech suggested I simply activate again, which annoyed me but worked. Now that the program requires activation one may only install it on 5 computers and then it will not activate on any further installs.. Now that's a little despressing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jan Alter",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Turbo Tax Premier Is t",
      "text": "This by far is the worst edition of Turbo Tax EVER. It asked me for a license code every time I started the program. After 5 of those, I couldn't access the program as it said I used up the number of computers to have it even though I only used it on one computer. Found out many users were having same problem. Never got it corrected with support and had to upgrade to Office edition. TERRIBLE.",
      "rating": 1.0,
      "verified": true,
      "author": "John M. Briggs",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "The ONLY Tax Software",
      "text": "Been using TurboTax for more than 30 years. Tried one of the others once but gave up and bought TurboTax after trashing the other software that year. Very easy as it leads step by step and makes keeping up with my stock gains and losses a snap! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Richardson",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Don't Expect Help from Intuit Tech Support if you Buy Trbotax from Amazon",
      "text": "Turbotax is the software of choice at Tax Time. This year, I had to ask for help on a detail associated with filing. I was surprised to hear that Intuit would not help me because I didn't buy the product from them. Once my return was filed, they said they would help, but not before. Strange attitude since it is their product and they shouldn't care where or how I legally purchased it. Shame on Intuit!",
      "rating": 5.0,
      "verified": true,
      "author": "Army Vet",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great Tax Program",
      "text": "I've been using Turbo Tax for many years and it is, and always has been a consistently good choice for tax software. Now this doesn't mean that you don't need to know anything about taxes, particularly your own. It does however mean that once you have a handle on your personal tax situation, it's easy to use and navigate, and has features that check your work and let you know if/when you're ready to file. I recommend this program for those comfortable with doing their own taxes.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lustig",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Have been using Turbo Tax for over a decade because of its intuitive interface",
      "text": "Turbo Tax Premium enables one to quickly change between \"interview mode\" (where it asks the users questions and then based upon those answers it completes the necessary worksheets. However, in one or two unusual circumstances I find it much easier to fill in the data directly on the appropriate form. Turbo Tax makes switching contexts (between the form entry method) and the \"interview\" mode)quite simple,",
      "rating": 5.0,
      "verified": true,
      "author": "M. Nichols",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "They overcharge the price and program makes mistakes.",
      "text": "Intuit has changed from past years. In my opinion deduction information is not made clear or advised. Advertisememt says file 1st state e-file for $19.99 but I was charged $24.99 and charged to e-file my federal tax. When I contacted customer service I received no response. I won't use Turbo Tax again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Mike",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "A good buy",
      "text": "Since I have very slow internet, it took a long time to download the program. However once it was downloaded, it worked as it has in the past. I really like this program. It makes taxes easy if you have kept good records all year. I highly recommend it for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Shadwell",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "MAC users beware!",
      "text": "Been a Turbotax user for 20 years & on my MAC since 2014. However this product Does not work on a MAC. My OS is up to date. Tried deleting and reinstalling as suggested by Turbotax. Just doesn’t load and Turbotax doesn’t know why. Turbotax was absolutely no help; they don’t know why nor do they want copies of the logs and stack files emailed to them to review. Will be returning the product.",
      "rating": 1.0,
      "verified": true,
      "author": "ALR",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "Will not open return-requires repeated access code",
      "text": "I used the access code and started my return. When I return to open the return it asks for the access code again. I don't have the package and cannot get the code so I am not able to use. Contacted support and there was no solution. I am forced to buy a second software. Check online and you will see all the people complaining about the same issue with no resolution.",
      "rating": 1.0,
      "verified": true,
      "author": "RJK",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "good product and once you start with one tax software, you want to stay with it.",
      "text": "Turbo tax is a good product but a bit expensive. Keep in mind the added cost to electronically file state returns. I have used Turbo Tax for years due to the ease of transferring basic info from one year to the next. I found Amazon had the best price this year, however, I later got a coupon direct from Turbo Tax for $ 20 off but could not use since I had already purchased.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert DeSmidt",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Constantly wants to upgrade you to next version",
      "text": "No matter what edition they always try to get you to upgrade to the next edition up. And then they demand more money to efile for state returns. If I wasnt already set in the TurboTax system I would avoid this smarmy company and product.",
      "rating": 2.0,
      "verified": true,
      "author": "LAM",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "I saved move with online version",
      "text": "I've been use the online version for years, and got desktop version this year. I did both online and desktop the same way and owed more with desktop version. I question the accuracy of getting the maximum refund. Customer service couldn't help, but did say they were different.",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory L Noren",
      "helpful_votes": 2,
      "publication_date": 20200215
    },
    {
      "title": "Gets the job done right",
      "text": "I have been using various versions of TurboTax for about 25 years. When I started, it was just my joint return (home ownership, investments, etc.) When my two children started filing, I added their returns and the complexity of their lives. These included military careers, home office deductions, ownership of rental properties and independent contractor earnings. Never been audited and always felt we got the best possible financial outcome.",
      "rating": 5.0,
      "verified": true,
      "author": "drchenoweth",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "The ease of populating the tax return of investments",
      "text": "Once I enter my investment firm, sign-on name and password into Turbo Tax Premier, within about 30 seconds all the data is loaded into my tax return including buys and sells, gains and losses, dividends and interests, and everything else need to complete the return. Without Turbo Tax, it would take hours and hours to enter all that information by hand and then not sure if it was correct and complete. My Financial Advisor recommended Turbo Tax Premier. This is the fifth year using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J. Mashour",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "My 17th year using TurboTax",
      "text": "Easy to use. Just follow the screen-by-screen instructions and type in the numbers from the forms you receive from your brokers, banks, mutual funds, etc.. TurboTax puts the numbers everywhere they need to be, and does all the math for you. I have never had an issue. When finished entering your data, select the electronic file option and bingo, you're done. This is my 17th year to use TurboTax. Greatly reduces the pain of paying taxes!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorsey",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "The best of the other options",
      "text": "Why is our tax code so complex that I have to pay an accountant or this software company in order to pay my fair share? The user interface remains as solid as possible with options it must deal with. The insistent daily upload of \"updates\" remains an irritant as do the up-sells for audit support. No glaring bugs this year and the cost is inline with others.",
      "rating": 3.0,
      "verified": true,
      "author": "ALF Engineer",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Good Program",
      "text": "I've been using Turbo Tax for a number of years and really like the program. Last year I had an issue and had to call the help line. Talked with several people before the issue was resolved but everyone was very helpful. It was a complicated problem. I was surprised how helpful they were. I didn't have to stay on hold and even got a final call back to make sure my issue was resolved. I told them at the time I would always use Turbo Tax, and I will.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Glover",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "average usefullness. Nice typing but you better know your stuff",
      "text": "Limited knowledge base. Unable to get all answers will probably go to an accountant as a program only deals with simple questions with one answer. I believe the IRS controlled programming. That should explain priorities.",
      "rating": 3.0,
      "verified": true,
      "author": "Billygoat",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Long time user",
      "text": "I have not had the logon problems and long waits others have reported in the customer reviews. Product loaded and updated quickly. Saved and reopened multiple times with no problem. The only complaint I have is figuring out how to update some of the internal items (such as taxes, business expenses, etc.) after leaving the section. I finally figured out how to do it but it took a little trial and error. One other problem was somehow it did not correctly compute my tax owed last year and I got a small IRS refund after paying when I filed. I will continue to use Turbo Tax in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Make do with Turbo Tax",
      "text": "I have been using Turbotax for almost 20 years. However, I use it more for entry of data and keeping consistency from year to year. Otherwise, the software is cumbersome, does not flow easily, and would force you to repeat steps as entry points are only at certain locations. It is disappointing that TT hasn't really developed a good user-friendly software after so many years. Their price of the product increases every year.",
      "rating": 3.0,
      "verified": true,
      "author": "SRSM",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Now they're limiting us",
      "text": "I always use this product and like it fine. This year though I heard they are now limiting the copy to (5) e-files per a Serial No. For most it doesn't matter but if you have to use it for separate filings this may be limiting.",
      "rating": 4.0,
      "verified": true,
      "author": "nickelback",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Super uber Turbo Tax to the rescue!!",
      "text": "Still Energizer bunny of tax programs, may not be the cheapest but I'm sold on this product for ease and accuracy. I'm alive today since Turbo Tax takes care of all the complex Forms, Schedules and worksheets!!! Does what a CPA charges 10x more to do when you being then all the info bundle YOU had to gather anyway! - might as well enter data yourself for the final step and save.",
      "rating": 5.0,
      "verified": true,
      "author": "rhg",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "False Advertising",
      "text": "It states on Amazon the price to e-file with a state is $19.99 (Print free or e-file for $19.99 each)5. But when you try to do it through the software you purchased, it's $24.99. This is pretty cringe worthy practices for a company that used to be reputable. There is a little 5 so they might have some small print somewhere, but it's not on the image again provided by Intuit and displayed by Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "K.S.",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Excellent Tax Help, Not Perfect.",
      "text": "I like the way TurboTax leads users through completing their returns. However, I did have one important problem. The forms to fill in have many links to help clarify and/or explain the tax codes, and requested entries. This valuable feature stopped functioning for me, part way through my taxes. Clicking on them resulted in nothing.",
      "rating": 4.0,
      "verified": true,
      "author": "PriorReader",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "this year version is not acceptable.",
      "text": "this year you have to connect to web every time you boot. that create chance hacker get your info. support answer is designed that way! The key question is why? TURBOTAX want steal your info? Why insist connect to internet? How people know their document is safe. How TURBOTAX prove they not E_Tax to TURBOTAX site a copy of your info?",
      "rating": 3.0,
      "verified": true,
      "author": "well known",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Love Turbo Tax",
      "text": "I've used it for yrs & very easy to get my taxes done! Turbo tax is the best tax software as far as I'm concerned! Used it for yrs in past & will continue unless the Government stops taxes! That's a Joke!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey D. Vahala",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Already Finished My 2019 Taxes",
      "text": "Easy to install via the disk. Update the software via the web (TURBO TAX) and let the software guide you the through the rest of the filing process. I been using Turbo Tax since the 90's and never lost a cent.",
      "rating": 5.0,
      "verified": true,
      "author": "Charisma",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Used this for many years",
      "text": "I have used this (and its predecessors) for many years, and have been satisfied with the results. The yearly improvements have continued its attractions, making it easier to find the categories and forms needed. It's especially pleasing to have all the forms available, without having to make futile trips to whatever source I used previously...",
      "rating": 4.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Imposible to get into account if you forgot passwor and changed phone",
      "text": "Imposible to get into account if you forgot passwor and changed phone, waited on ignore for 45 minutes just to be told too many calls and it will take 5 days to unlock account!!! I used this for 20= years! NEVER AGAIN!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Waldemar Metel",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Frequent installation errors and too expensive",
      "text": "Gives frequent installation errors. Can install on one PC but cannot install on another for no reason. Wasted a lot of time. Also charges exorbitant $$ to buy state files (much increased from prior years) and too much for e-filing. I wish there was a competing product (but no, I guess, which is why they charge as much as they can).",
      "rating": 2.0,
      "verified": true,
      "author": "DCK",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Easy to use",
      "text": "This software is easy to use. Put in your data, and it automatically calculates your tax. You are guided thru the software so you know where to enter your information. You can save and come back to your return if you realize you have some data that is not on hand. You can also do a what if return to practice on if you want to know if your income or deductions would vary and see how your tax would be affected.",
      "rating": 5.0,
      "verified": true,
      "author": "coffeeman",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Limited system compatibility.",
      "text": "Good product but should be more backward mac os compatible. Had to upgrade my computer system. Now some of my expensive applications no longer work. Could be last year using Turbotax after approx. 15 years. 3 years system compatibility is not enough.",
      "rating": 2.0,
      "verified": true,
      "author": "Cheryl A",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Fyi ..You'll have to pay an extra 64 if you live in Ca.",
      "text": "Don't understand why they make you buy their protection plan to send electronically. Also didn't realize you have to pay extra 20 to send your state filing electronically also. Anyhow, it was easy to do. Hopefully everything came out okay. Got an email from both Fed and State saying they accepted our filings withing 2 hours of sending them",
      "rating": 4.0,
      "verified": true,
      "author": "Chinawood",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Not so great!",
      "text": "Paid for the deluxe version to handle my investment sales. The software could not handle the sale of my publicaly traded partnerships. Also could not print anything directly from the turbo tax software. I had to download and install adobe pdf software to print turbo tax documents. I will not be buying this software ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave_K",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Reliable and user friendly!",
      "text": "I've used TurboTax for years to do my federal and state tax returns. It is easy to use and very user friendly. I highly recommend TurboTax products.",
      "rating": 5.0,
      "verified": true,
      "author": "Highlandlaker",
      "helpful_votes": 2,
      "publication_date": 20191217
    },
    {
      "title": "Good product. Horrible Amazon customer service.",
      "text": "The product itself is great. Beware of the Amazon gift card promotion that comes with it. Still fighting with Amazon to get the gift card. Horrible customer outsourced service.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey M. Gramp",
      "helpful_votes": 3,
      "publication_date": 20191231
    },
    {
      "title": "I have been using Turbotax for a number of years and it works well",
      "text": "I have used Turbotax for a number of years and have been satisfied with the results. I have used different versions depending if I was an employee, had investment income or was a 1099. With the right version I got the results I needed and was able to address all the different types of tax situations. I strongly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "H. A. Kaskoff",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great product  .. Used it for last several",
      "text": "I am a great believer in this product. I have used it for last few years. Very easy to use. Start to finish. Based on your answers to basic questions, software guides you to the next step.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam H. Kal",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "I've used Turbo Tax ever since Intuit introduced it-",
      "text": "The ease of use and the ease of filing both fed & state taxes electronically is worth its weight in gold!! The prompt to check for software updates (as tax laws and nuances seem to be in constant change) is key. I've looked at competitive packages - Turbo Tax is the top of the line!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ice_Bowl",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Turbo Tax software requires Windows 10 and hence BE AWARE.",
      "text": "Turbo Tax software requires Windows 10 and hence BE AWARE. I am a big fan of Turbo Tax software, and urge everyone to try doing their own taxes. Its an real education and skill. Yet, you should be aware that software is very \"temperamental.\" Really. Each step, you must complete the questions. No excuses.",
      "rating": 2.0,
      "verified": true,
      "author": "Peter R.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Upgrade to. the latest version",
      "text": "I did 4 separate filings of Federal and state, 2 of the returns were simple and 2 very complicated and I was able to get through all of them in one day. Really my biggest issue was getting the latest version of Turbo Tax uploaded kept crashing and I have a very fast Internet connection once this was done I able to get through everything fairly quickly used the support line was able to get the answers that I needed . Filing taxes on the TurboTax website is 100% easier & faster , just wanted to try this version will probably go back to the online version next year",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "usual and familiar, out of date interface, a bit clunky",
      "text": "same as for past many years, works ok, but a bit clunky to use/navigate like the info transfer from prior years needs a modern update for user interface, help is marginal does the job, I guess good a familiar interface, too many forms loaded into return that are not used/needed",
      "rating": 4.0,
      "verified": true,
      "author": "jake",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Notification of IRS Receipt",
      "text": "I submitted my return electronically over a week ago and have not received any indication they received it. I thought I had submitted it at the start of February, but for some reason it did not process, so I submitted it again last week and still have no indication the IRS has and is working on the return.",
      "rating": 5.0,
      "verified": true,
      "author": "G. E. Dunlap",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "A couple of small bug issues...",
      "text": "Worked around a couple of obvious minor bugs without too much trouble. They were a bit sloppy this year; probably rushed with last minute updates for tax changes. It did the job & filed the return, with PDF file for me to keep. I buy it every year... and will again next year!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Jack Run",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "So easy, it's like having a CPA doing it for you.",
      "text": "I have used TurboTax for years. Since I started, I have never been audited which was an occasional request. I love watching my brokerage fill out their portion in seconds and I no longer have to struggle for hours. I can do my taxes in 45 minutes, e-file, be accepted and find my refund in my checking account in 10 days. Doesn't get better than that.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee R.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Best tax solftware",
      "text": "this one is the best bit also the most expensive and it did not include State E-Filling even though you bought the state software. At least the fed software includes the E-file. It costs 19.99 more to efile in Mass. This should be included in the software. If it was I would give it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20200305
    }
  ],
  "product_meta": {
    "title": "TurboTax Premier + State 2019 Tax Software [Amazon Exclusive] [PC/Mac Disc]",
    "description": "TurboTax Premier is recommended if you sold stocks, bonds, mutual funds or options for an employee stock purchase plan, own rental property or you are the beneficiary of an estate or trust (received a K-1 form). TurboTax is tailored to your unique situation-it will search for the deductions and credits you deserve, so you're confident you'll get your maximum refund • TurboTax coaches you every step of the way and double checks your return as you go to handle even the toughest tax situations, so you can be confident you're getting every dollar you deserve. • Every year it gets even easier. As a returning customer, TurboTax will automatically transfer last year's data to help ensure accuracy and save you time • Up-to-date with the latest tax laws-so you can be confident your taxes will be done right. • Help along the way-get answers to your product questions, so you won't get stuck. • Your information is safeguarded - TurboTax uses encryption technology, so your tax data is protected while it's e-filed to IRS and state agencies",
    "rating": 4.6,
    "feature_bullets": [
      "TurboTax Premier + State is recommended if you sold stocks, bonds, mutual funds or options for an employee stock purchase plan, own rental property or you are the beneficiary of an estate or trust (received a K 1 form)",
      "MAXIMUM TAX REFUND - Searches for more than 350+ tax deductions and credits, including mortgage interest, property taxes and energy-efficient improvements, to get you everything you deserve",
      "TAXES DONE RIGHT - TurboTax guides you through your tax preparation, keeping you up to date with the latest tax laws and double checking your entries along the way.",
      "Includes 5 free federal e-files and one download of a TurboTax state product ($44.99 value) state e-file sold separately",
      "Exclusively at Amazon, receive a free 1 year subscription to Quicken Starter Edition ($34.95 value) with your purchase of TurboTax",
      "Free U.S. based TurboTax product support via phone",
      "TRACK YOUR DONATIONS with Its Deductable from TurboTax- Turn charitable donations into big tax deductions",
      "With Premier, retirement tax help and the IRA tool show you how to get more money back this year and when you retire. Keep more of your investment and rental income. Get your taxes done right and tailored to you, based on your unique situation.",
      "SAVE TIME- Automatically imports financial information including W-2s, mortgage and investment information as well as imports prior year tax return information from TurboTax and other tax software."
    ],
    "specifications": {
      "Product Dimensions": "5.4 x 0.7 x 7.5 inches; 3.68 Ounces",
      "Item model number": "607346",
      "Date First Available": "November 5, 2019",
      "Manufacturer": "Intuit, Inc.",
      "ASIN": "B07Y62MM2J",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tax Preparation",
      "Software"
    ],
    "price": ""
  }
}