{
  "website_summaries": [
    {
      "verdict": "Fairly straightforward and available on various platforms. Helps make the most of charitable, mortgage, and up to 350 deductions.",
      "pros": [
        "Imports easily from Quicken and QuickBooks, provided the programs are update annually",
        "Can generate W-2 and 1099 forms, and handle full Schedule Cs",
        "Available in downloadable and software versions",
        "fairly easy to use for most filers"
      ],
      "cons": [
        "Some state tax filers found the cost higher than expected or the process complicated",
        "Mixed reviews on the knowledge and availability of customer service – some found the reps very helpful, others didn't or had difficulty reaching them"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Misleading Title",
      "text": "I bought this product on the deal of the day plus a $10 amazon gift card. I use turbo tax online every year. This was my first time using the software. It is just like using the website but this product said it had state in the software. I assumed the purchase of the software included e-filing state returns. IT DOES NOT. You can just fill out, which it pretty much imports all the info from your federal, and still have to pay $20 to efile it. Very misleading until you hit the view more button in the item description. Save your money and use the website and file.",
      "rating": 1.0,
      "verified": true,
      "author": "Witt",
      "helpful_votes": 101,
      "publication_date": 20200117
    },
    {
      "title": "License code doesn't work",
      "text": "Installed program but got the following message after I put in the code shown in my download center The license code you entered is not valid. Error code: 606",
      "rating": 1.0,
      "verified": true,
      "author": "Photographer",
      "helpful_votes": 88,
      "publication_date": 20191207
    },
    {
      "title": "Not Fully Functional",
      "text": "11/12/2019 - I am very disappointed that the software is not complete. The portion on pensions, IRA's and 401Ks is not functional. The reason I bought this now was to run some what if scenarios to determine if I would take money out of a 401K in 2019 or wait until 2020. This is very irritating.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs. C.",
      "helpful_votes": 22,
      "publication_date": 20191111
    },
    {
      "title": "Beware of Upgrading TurboTax",
      "text": "Purchased TurboTax Deluxe from Amazon. Downloaded from Amazon and installed with no problem. Upgraded from Deluxe to Premier version paying $30 directly to Intuit for the upgrade. Expected to be able to install on use on my 2nd computer since the Intuit user agreement says you can install on 5 separate computers. However I was not able to install on a 2nd computer and Intuit customer support confirmed that I was NOT able to do this in spite of what the user agreement say. So for everyone reading this review beware of buying products from Intuit because I have found they will not honor their user agreement!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Bill Smith",
      "helpful_votes": 12,
      "publication_date": 20200206
    },
    {
      "title": "You won't be able to pay e-file fee by credit card.  Don't buy it.",
      "text": "Turbo Tax Deluxe E-File is unworkable. Tax prep was easy and accurate as usual. Been using it for years. But what good is it if you can't e-file? Started the e-Files process, set up my bank account for refund and payment. Then selected pay the state e-Files fee by credit card and was taken to a site to enter my information. I entered the information and tried to scroll down to \"ok\" or \"next\" but I could not scroll down. It's not my system as I reported the problem last year and no resolution. So I contacted Intuit and all I get are FAQ's with no person available to help. I'm done with Turbo Tax after 30 years of use.",
      "rating": 1.0,
      "verified": true,
      "author": "James E Jannausch",
      "helpful_votes": 9,
      "publication_date": 20200205
    },
    {
      "title": "Do not purchase",
      "text": "I have used Turbo Tax the past 7 years for myself and my family with no issues. Last year (2018 filing) there was some glich in there system that would not allow you to file state. So for the five tax returns I filed I had to call Turbo Tax customer service each time to e-file the returns. I filed 5 returns and was on hold a total of 8 hours waiting on Turbo Tax. They claimed this year (2019 tax filing) to have the glich fixed...it is not fixed! I will never purchase it again!",
      "rating": 1.0,
      "verified": true,
      "author": "Susie",
      "helpful_votes": 9,
      "publication_date": 20200123
    },
    {
      "title": "Great price through Amazon Digital",
      "text": "The very same product I generally purchase from the manufacturer. I received it on time. It installed as expected. I especially like that the program is maintained for me in Amazon's digital library",
      "rating": 5.0,
      "verified": true,
      "author": "JJPM",
      "helpful_votes": 11,
      "publication_date": 20191111
    },
    {
      "title": "Fails to translate IRS gibberish into English your Mom would understand.",
      "text": "As far as I'm concerned, I give this product an F. The way you can fix it, is get the moms of the writers and put them in one of those one way mirror rooms and have the writers on the other side of the glass. Have the moms run the programs and test to see if they understand the gibberish questions presented. Or have Iowa high school English teachers grade the questions like English papers. Please, please, please don't become an unofficial branch of the IRS that talks the way they do. TRANSLATE, and then test that translation, to sure those of us who don't work for the IRS can understand.",
      "rating": 1.0,
      "verified": true,
      "author": "Bradley",
      "helpful_votes": 5,
      "publication_date": 20200205
    },
    {
      "title": "Intuit knows they have you by the danglers",
      "text": "Pay one price, get deluxe and state for forty bucks. Find out you still have to buy a state, for an additional forty bucks. I thought it had one state filing? Nope, it's the forms for the state, filing is a separate download. Now go to file, pay a twenty dollar filing fee. It cost me a hundred to file my taxes. But hey, it saved me a bunch of time, because I've been using TurboTax for a while, so it has all my records, previous filings etc, which makes it way simple to get everything done very quickly. And they know this, and are just squeezing me.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas V",
      "helpful_votes": 5,
      "publication_date": 20200205
    },
    {
      "title": "REFUND PLEASE!!!",
      "text": "Product constantly requests license code and the nothing. Anyone want to explain how to refund the cost because I think it's time to look at another Tax solution. We have used Turbo tax for many years and not a single issue, they need to test before releasing software ! Download goes well, latest changes update goes well. but when you enter license and press to go..no go! Shut off virus and firewall protection and still no go. Followed all the help guides from Intuit, no go. All updates on PC are current. Using on a Windows platform with Kaspensky Total Security (download from Amazon and with no issues). Heard this will run on Win 7.",
      "rating": 1.0,
      "verified": true,
      "author": "Psulo",
      "helpful_votes": 6,
      "publication_date": 20191231
    },
    {
      "title": "Couldn't get it to work.",
      "text": "I've been using Turbo Tax for years with no problems. This year's version has an added feature. You have to enter an activation code to use it. I could not get the program to accept the activation code, even after long discussions on the phone with TT tech support. I tried all of their suggestions with no success. Today, I gave up and downloaded H&R Block tax software. It uses an activation code, too, but theirs worked and allowed me to install the program and open it.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Roush",
      "helpful_votes": 4,
      "publication_date": 20200113
    },
    {
      "title": "Bought for years but never again",
      "text": "I've used turbotax for many years and always printed them out and mailed them. With the virus this year I decided to submit via online. After what appeared to be a free service and entering allot of personal information I got a notification from turbotax asking me how I wished to pay. After spending nearly $50 on the program they wanted another $30 to submit online. And there was another charge for submitting the State taxes online! I quickly stopped and decided I'm done with these people. My business will go elsewhere next year. Never again!",
      "rating": 1.0,
      "verified": true,
      "author": "lovetotravel",
      "helpful_votes": 3,
      "publication_date": 20200705
    },
    {
      "title": "Avoid until they fix the install problems",
      "text": "I've worked about ten hours trying to get it installed on a standard Windows 10 system. The TurboTax installer goes all of the way through fine and then always throws a Windows Unexpected Error 65535 and then uninstalls itself. No manner of help followed on Intuit's help site fixes the problem. Their suggestion was to use the online version of TurboTax instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Dustin Aldridge",
      "helpful_votes": 4,
      "publication_date": 20191229
    },
    {
      "title": "Last year im buying this software",
      "text": "Ive used T.T. for many years. I run Windows 7 in a Virtual Machine on my linux box. Since this software is blatantly trying to force you to use Windows 10 (another garbage M$ product) and scaring anyone using Win 7 im done with them. Yes it will still run under Windows 7. Dont let the scary message about updates, vulnerabilities, etc., make you think it wont work. I havent updated my Win 7 install in years. No viruses or worms. Stay off shady sites and you wont have any issues. Next year ill use online version.",
      "rating": 3.0,
      "verified": true,
      "author": "Evelyn Salt",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "Intuit software activation bug",
      "text": "Long time TT user... since the days of floppy disks... Updated earlier today and now the software incessantly request \"activation\" with every PC restart. Soon I'm out of \"activation\" (you are limited to 5)... and this is the only machine I've installed to. Support gives a key reset, but of course that's only good for 5 restarts since activation is so buggy. Save yourself aggravation. Check out the competing software. Intuit has created a mess once again. And for those wondering... Intuit no longer provides a change log for updates... Just a generic ramble such as \"program update\", \"federal return update\", and so on... Quite disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Shop King",
      "helpful_votes": 2,
      "publication_date": 20200125
    },
    {
      "title": "Scam to pay an additional $30  to Efile State return",
      "text": "Turbo TaX conveniently, makes it a one click to pay an \"additional\" $30 to E-file State returns,(national is free) while making it very inconvenient to print and mail in the state to save $30. Turbo Tax won't tell you what I will. No INSTRUCTIONS from T-Tax on MAIL filing State returns To Mail in State Returns, under the print forms setting, choose only State Forms and print out 2 copies, one for records and one to mail in. Its that simple but forget about T-Tax helping us on this!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "FJester",
      "helpful_votes": 2,
      "publication_date": 20200415
    },
    {
      "title": "unable to use",
      "text": "I have been using Turbo Tax for 8 years. But I have never purchased it through Amazon. Now I cannot coordinate my prior use through the Turbo Tax website and this Amazon purchased software. Call me old and low-tech and frustrated. I am. Now I have wasted my money and am going back and re-purchasing through Turbo Tax. There is no cancellation or refund available here at Amazon, so be careful if you are not tech savvy. Funny thing is I have done my own taxes all my life, been audited twice without having to pay a dime extra.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Rearick",
      "helpful_votes": 2,
      "publication_date": 20200101
    },
    {
      "title": "IT DOES NOT OPEN OR DOWNLOAD ON PC WIN7",
      "text": "I have a $39.99 purchase of worthless piece of plastic that I CANNOT return - it will not open or download on my computer. I ended up having to purchase a download version online from TurboTax for another $39.99. Basically I am screwed out of 40 bucks. H and R Block could have completed my simple tax forms and sent them for the price of these and it would already be done.. Miffed and very dissatisfied customer! Out $39.99!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Pat Elliott",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "TurboTax customer support is terrible!!",
      "text": "I had an issue and the state would not load. I ended up having to mail in my state return after paying for an efile state return. I had a technical issue with the software, but because I purchased the software not directly from TurboTax and through Amazon they would not help me. They told me flat out because I purchased it through a 'third party' I was on my own. I will NEVER use TurboTax again. They sell through Walmart, Amazon to increase their own platform and then claim if you don't buy it directly that they will not support their own software. Don't waste your money. I won't ever again!",
      "rating": 1.0,
      "verified": true,
      "author": "TorqueThrills",
      "helpful_votes": 2,
      "publication_date": 20200214
    },
    {
      "title": "Dont  deal with this mess. Avoid the stress and move on to another product!",
      "text": "Wont let me file \"requires update\" although program says up to date. App hasnt worked this year either wont take apple pay after you are required to use it or pay $40 more, but not only that my credit card was charged 3 times and taxes weren't filed. Even without all this B.S. Turbotax continues to raise their prices and makes itself that much further away free filing. $160 even after this purchase. NEVER USING TURBOTAX AGAIN!!! Spent 5 hrs on the phone and 4 on the computer taxes still wont file.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben R",
      "helpful_votes": 2,
      "publication_date": 20200210
    },
    {
      "title": "Bad \"Updater\"",
      "text": "I am usually a fan of Turbotax Deluxe. However this edition was not good. The updater function would not work and actually froze the screen. I found a patch after some looking on the internet and was able to download the updates manually. The company provided no notice of the problem. After I finished the federal return, the same thing happened with the state return. Apparently the company had determined something was wrong, because after a considerable wait, a patch downloaded and the state return updated. It was just a hassle this year getting the program to work properly.",
      "rating": 2.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Don't bother with download versino",
      "text": "Downloaded and went for install. Turned off every possible anti-virus program, even those hidden by Microsoft, reset router as instructed and tried to install X 4. Same message every time. Turn off Anti-virus and reset your router. Turbo tax support no help. Spoke with Amazon for refund. Waiting for refund before I decide to go forward with CD version or go with HR block. Have used in past. very disappointed with it. May never go back.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Spreeman",
      "helpful_votes": 2,
      "publication_date": 20200205
    },
    {
      "title": "License Key does not work for Deluxe download on Windows",
      "text": "I have the same issue as another user. I purchased the Deluxe version. However, the application splash screen shows \"Basic\" while loading, and and title bar shows \"Basic\" on the Activation window. The file name for the downloaded installation executable shows Deluxe, and the config.xml file shows Deluxe... it looks like Intuit gave Amazon an incorrectly named installation package. I talked with Intuit customer support, and they told me to talk to Amazon... seriously? Now I need to talk with Amazon so they can tell me to contact Intuit. To be fair, the Intuit customer support person tried to help me. She escalated to her supervisor, but was told to send me back to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "bz1492",
      "helpful_votes": 2,
      "publication_date": 20200110
    },
    {
      "title": "Federal + State Does NOT INCLUDE STATE",
      "text": "Paid for federal Deluxe + State, yet the code does NOT include state. At conclusion of tax preparation TurboTax demands a credit card to pay for the state again. Purchase just the federal, then pay for the state directly through the TurboTax application.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan Murphey",
      "helpful_votes": 5,
      "publication_date": 20200124
    },
    {
      "title": "Excellent!",
      "text": "I had to buy this version instead of the online version to do multiple returns this year. Found it cheaper on Amazon than online. I have used Turbo Tax for many years. I did do a comparison with this version to the online version and they were the same as far as my return was concerned. That was something that I was worried about and figured that others might be as well. I do like the fact that I was able to import my previous years online return into this one, it made things way easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Streakster",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Never received the license code when I downloaded the program",
      "text": "Never received the license code when I downloaded the program and I can't use it until I do. Trying to resolve this issue through Amazon has been useless as all they do is run me around in circles going from one suggestion to another and, eventually, back to the original suggestion. Turbotax tells me that it's not their problem as Amazon should have included the code with the original order confirmation.That might help except that I now can't find any way to get a copy of the original confirmation.",
      "rating": 2.0,
      "verified": true,
      "author": "Donald W. King",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Terrible, deceptive, bait and switch tactics - do not by this product!",
      "text": "Turbo Tax is a sham. A complete disappointment. The digital download did not work. Tech support was inept. Extra hidden fees to e-file state (described as free, which his an illegal bait and switch marketing tactic). The software looks and performs like it is from the 1980s. It is painfully slow with a poor user interface. Even though I saved the return, it forced me to start the entire return over twice. Tech support was completely useless. Shame on you Turbo Tax. You are cheating and misleading your customers. Buyer beware - to purchase this product is theft! Please refund my purchase price.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy C.",
      "helpful_votes": 2,
      "publication_date": 20200706
    },
    {
      "title": "Software is good. Be careful about the Amazon exclusive 1 year of free Quicken Starter software.",
      "text": "I purchased Turbotax last year in March and got a free year of Quicken Starter software. This year I purchased Turbotax in Mid-February and got the code for another free year of Quicken. But it would not accept the code because it was too early. Now I get notices that my Quicken is about to expire, and the code is no longer there. I called Intuit, and they said the code expired at the end of February. No notice that the code would expire, it just did, and they won't honor it. Be careful of the Amazon exclusive Quicken benefit. It may not work, and Intuit is not helpful.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Doesn't work correctly for my situation and Intuit refuses to help",
      "text": "The software does not correctly reflect the income exemption for dependent care expenses up to $2,500 paid through an FSA/DCA when you are married filing separately and are not separated from your spouse. I have contacted support with no luck. H&R Block's software does work correctly for this situation, so I'll stick with H&R block and save almost a thousand dollars instead of dealing with turbotax's nonsense. I feel really bad for people who are overpaying on their taxes due to Intuit's willful negligence.",
      "rating": 1.0,
      "verified": true,
      "author": "Colin S.",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Money better spent on alternatives, Intuit is greedy!",
      "text": "Overpriced even with the early bird discount, I fear will only get worse now that Intuit bought credit karma... There really isn't anything Intuit offers that you can't get elsewhere cheaper. Try taxhawk or taxslayer. Previous years I used TT and had the phone/video chat included for the price I paid this year (which was discounted) now the same services are an additional $45 fee instead of included. Intuit has turned into pure greed.. they're looking to gobble up competition and corner the market. Spend your money on the cheaper alternatives I mentioned they do just as good of a job, they do not require installation of software (just a web browser), and are more affordable.",
      "rating": 2.0,
      "verified": true,
      "author": "Stratego Player",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Leading Tax Package",
      "text": "As usual, I really dislike Intuit's marketing. Almost everyone doing their own taxes and getting a refund wants to file on-line and be done with everything as quickly as possible. Intuit is very opaque on there being an additional $20 fee to file State taxes on-line. Also, Intuit markets several different capability levels of tax software; every year I have to read the fine print to be sure they haven't deleted something that was in last year's package level; gee, do I need Premier or will Deluxe handle my situations? Turbo-Tax is still better than doing the taxes on paper. Also, buy your copy off of Amazon because buying direct from Intuit always costs more.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Price",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Got the Job done",
      "text": "I have used this product for several years, it seems that this year there were several more security questions, but all in all it was about the same. I believed it maximized my return allowed to to complete the task in one setting. I continue to be a little miffed at Quicken because the tell you when you buy this product that you can electronically file your :\"Federal\" taxes and that it includes one State tax return. Which it does but when you go to file your State tax return Electronically the want another $20.00. So what they told you was true but a little misleading. Not something new but something that just rubes me the wrong way.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Maynard",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "2020 New Jersey State Return Rejected because of TurboTax Error",
      "text": "I just filed Federal and NJ State return (March22). Federal was accepted, NJ rejected: 'Your state return was rejected due to an issue with the IRA Distributions for your e-filed return. This issue has been resolved in a product release scheduled for March 26, 2020. .......' I paid $53.99 for TurboTax deluxe, paid another $26.65 for state e-file, had 0 errors when running checks, they guarantee 100% accuracy and then the return gets rejected with no fault on my side. And all they message is 'sorry for your inconvenience'. If you want to talk to a live person you have to pay another $30. I am furious.",
      "rating": 1.0,
      "verified": true,
      "author": "Gwen",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Quicker the Reading the IRS code book",
      "text": "I have a simple tax return that I could have use the IRS code book but TurboTax is so much simpler. I found that it ask multiple questions that I would not though off. Gathered all my paperwork and completed my taxes in 40 min. The federal filing electronically is free but in California the state charges a fee to electronic file. Considering you get your refund quicker, electronic filing is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Nice",
      "text": "Relatively easy to use. I found it much better than the H&R block software so am sticking with Turbo tax from now on. I like that it has a decent list of brokerage firms that you can download your forms from. My main beefs with this app: Free fed e-file but state e-file is not cheap ($25). Moreover, it didn't transfer data over to the state completely so I had to re-enter the data in the state forms by hand. They should make the state e-file included. Also, I got a text at 1 am in the morning stating \"congrats! your state tax submission was accepted!\" ARGGGH!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "TobycW",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "ripped off",
      "text": "After installing and using this software at the very end it asked for $19.00 to file state taxes. I opted to pay by credit card. The program then sent me to intuit where I had no success at finishing the transaction without purchasing more software. I have used turbotax for many years and I have purchased the program before on Amazon. But this is the last time. Thanks for nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "oldtimer",
      "helpful_votes": 2,
      "publication_date": 20200202
    },
    {
      "title": "Took TurboTax Support an hour to fix it so I could do the State Tax Return but they solved it.",
      "text": "I've used TurboTax for the past 10 years and never had a problem. I've always used CD/Download version. This year, I wasn't able to work on my State Tax Return. It kept giving me the up to date after updating the state look. I called customer service and after an hour on the phone, we got it fixed. There's a TTStateCleanup.zip file that will delete the state file on your computer and force TurboTax to re-download it. I might just do TurboTax online next year. The new only 5 federal tax return efile and computer installation limitation just more hassle than it's worth.",
      "rating": 4.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Works OK",
      "text": "Happy to get an early start on 2019 and it worked well enough so I could see about what my federal taxes would be for 2019. I was disappointed that the walk through had several bugs that should have been corrected by now (Dec 8, 2019) - such as entering \"No\" to some of the steps, but it took you to answering questions as if you answered \"Yes\". Not a big deal, as you just enter \"No\" and \"0\" to the follow up questions. But I've been using TurboTax for many years and I know these things will be fixed.",
      "rating": 3.0,
      "verified": true,
      "author": "Lloyd761",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "It fails to transfer data to state",
      "text": "I talked to TurboTax support for 1 1/2 hours today, Data would not transfer from Federal to DC State. Problem still unresolved!!!! Talked with tech support at least 3 times, followed their instruction, but no success in opening. Exasperate, I switched to the online version for TurboTax 2019 -- and paid for it after earlier paying Amazon for the desktop version. Also, the Federal portion which worked in both the Amazon desktop version and in TurboTax online gave me refund amounts significantly different from each other using the same data. Crazy!",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Will not install on my computer",
      "text": "I downloaded the file saved it to may hard drive, then when I tried to open the file to install it I was asked \" Choose the program you want to use to open this file.\" I have used TurboTax for 10 years and never was asked that to install . I also tried a different computer and it said the same thing. No help at TurboTax nor Amazon. Worked four hours in this. I was able to find out why it would not install on my computer. When it downloaded the file did not have an extension. A friend added .exe to the end of the file name and then it was abke to install.",
      "rating": 1.0,
      "verified": true,
      "author": "Spirit of Three",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Super fast from purchase to use - Instant Download",
      "text": "It will take me longer to review this than it did to buy and install. You pay for it, get a link to download and the license, and you have it on your computer and away you go. Takes a minute or so to download (depends on your internet speed), you install it, open the program, and copy and paste the license Amazon gives you and your have your fully running and legal copy up & running. You may, and probably will have, to install an update as things change often in the tax world. You will be prompted to do so if necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Loral R. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Better than the other major tax software",
      "text": "I used to use a competitor's product but they took away K1 support which I need for my LLC. Turbo Tax had a minor error with the K1 that they fixed at the end of February. The only annoying part of the software is that they keep trying to sell you and upgrade to the next version when it isn't always necessary. I like that you have the choice to choose just the sections you need rather than having to go through numerous questions that you can't bypass. If it can do my 93 page tax return (yes, that's with worksheets), it can certainly do yours.",
      "rating": 5.0,
      "verified": true,
      "author": "Deer HunterTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Best Tax Software",
      "text": "I have used TurboTax to do my own taxes for many years. There was one year when TurboTax made some changes that didn't set well with me, so I tried a different company's product and really didn't care for it. It wasn't just that it was new, it wasn't as user friendly and easy as TurboTax. When Intuit realized they had made a mistake and went back to the regular software, I went back to them and have been with them ever since. The product has more than paid for itself as each member of my family has used it to do their taxes as well.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Boring",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "They still haven't fixed the update problem",
      "text": "I've been using Turbotax for >15yrs but I cannot believe that they still haven't fixed the bug where the software is unable to find updates. I use it with my office VPN and am able to go to any website from the browser, so it is not that I'm disconnected from Internet. For some reason, it doesn't work. I have to go manually to the turbotax website, download their latest patch, then manually install it. This is totally unacceptable and brings into question the quality of their other software (efile etc). I had this problem last year also and I thought it was a one time thing. Sadly, it seems to be now a feature :-(",
      "rating": 3.0,
      "verified": true,
      "author": "kravicha",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Tech support needs more help",
      "text": "The activation code that came with the downloaded version did not work. After multiple tries on my own, I tried contacting tech support. I received a message that said the on=hold wait time was approximately three hours, so I took the option of leaving my cel phone number for a callback. That was at 7:00 PM. The call from tech support came at 1:00 AM, six hours later. It took all of four minutes to resolve the issue. The tech was extremely pleasant and helpful. The tech support team needs more agents to provide both great and timely service, especially as the tax deadline nears.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas M. Holland",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "DISHONEST AND A TOTAL RIP-OFF",
      "text": "It's easy to follow but after you file comes the dishonesty and the ripping-off. When you pay for this and one receives the digital download, you are charged extra for filing your State return, when it is stated in the product \"+ State.\" So I filed my Federal and State and one is given the amount of refund you will receive from your Federal filing, You will be asked to pay extra for the service of paying for your State filing. You wait and after a few days, I received a far lesser amount in my Federal refund. It was a total blatant rip-off.",
      "rating": 1.0,
      "verified": true,
      "author": "Adlerhorst",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Turbo tax has problems 2019",
      "text": "Every time I'm about to file, it gives a message to must update firs. I go for the update it says your ap to date, and it keeps repeating, I called turbo tax they told me they are working on the issue but so far no solution as of February 2020, I can't even download new jersey state. The software download from amazon is not refundable.",
      "rating": 1.0,
      "verified": true,
      "author": "Nice puppy",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "TurboTax",
      "text": "I'm a long term user of turbo-tax and I continue to use this product. I've been using this for something like 10 years now or more (different versions) but same brand. In summary its an easy to use product, it helps you do your own taxes in a precise and efficient manner and it prompts or asks questions and also has suggestions and reference material. I've had good experiences with this product, I've not tried other products and have stuck with this over time based on reviews in the past. So far I've not found a reason to switch.",
      "rating": 4.0,
      "verified": true,
      "author": "JoeAverage-User",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "It is a total rip off! You have to activate it each time you return to check your filing process. I",
      "text": "It would not allow me to maintain my activation after I installed it, therefore, I was only able to do one tax return. It was advertised as 5 free returns, but after having to activate it each time I check on the status of my return, my 5 free returns were used up within a few hours. I am requesting a refund of my $39.99 on my Amazon Credit Card!",
      "rating": 1.0,
      "verified": true,
      "author": "PASTOR J. T. GRAHAM",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Can't import data any more",
      "text": "Very displeased that Intuit now wants us to create an account just to import from your bank\\brokerage accounts. Intuit please tell me why us consumers need yet another place for our data to be hacked from. Importing has worked just fine for many years without creating an Intuit account. Oh and tech support...there is none, they just send you to the community for support. I refuse to create an account just to import data, I will enter by hand this year and next year will find another product to do my taxes with.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael W. Schellenberger",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Fee to file Federal return for Federal refund",
      "text": "Worked fine for me but I was surprised at the end that I had to pay a $40 fee to file the Federal return with a refund. This was in addition to the $18 state fee to file electronically. I will be looking at other software packages next year.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill L",
      "helpful_votes": 2,
      "publication_date": 20200222
    },
    {
      "title": "POOR performing Turbo Tax !  Wait or don’t",
      "text": "As a 25+ year TurboTax user and several from Amazon I certainly did not expect the poor performance and installation from the product! Three times told to uninstall, also 3 times to go back and clean up traces, once to remove the installer and download and to do EVERYTHING again. Finally, all was in and THEN it took 12 minutes to open up to data entry contact and every action is three times slower than last years version. Guess I am a Gamma tester This is the first year in fifteen to have ALL my tax forms in hand in January but my cost is use of a trash-TurboTax",
      "rating": 2.0,
      "verified": true,
      "author": "Jarl de Boer",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "As usual, an easy-to-use tax package",
      "text": "I've been using Turbo Tax for years with no problems. The key is keeping good financial records. If you have the data, you just fill in the blanks and answer the questions. If you have investments or mutual funds, most company's records can be downloaded automatically and entered into TT's forms. For complex tax returns, you may be wiser to use a tax preparer early in the tax season. I got my state and federal refunds automatically downloaded to my credit union accounts in just a few days. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "BillH",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "DON'T BUY",
      "text": "This year, I bought this software as I do every year for 5 or more years. THIS YEAR I had a basic question, not a tax question but a software question and I COULDN'T talk to anyone without paying them additional money to talk to someone. BULL!! OH - and when you want them to process your TAX return, pay them even though it's free, but you pay them for security, processing, I can't remember. NOPE, there is no support person to talk to without paying that person, you are on your own. NEXT YEAR, looking for a free product.",
      "rating": 1.0,
      "verified": true,
      "author": "Retiree",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Unacceptable glitches, will not use again.",
      "text": "I've used Turbo Tax for years with little to no problem, but this year was horrible. Tried it on my laptop with Windows 10, it would never load the state form, it just went into a continual loop of needing to choose and update the state. When through all the tech steps I could find only, nothing would fix it. Tried it on my desk top with Windows 7. Everything worked except the ability to enter tue cost of my car registration, it would ask for the amount, but would never produce the boxes for the dollar amount. What a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Rye19",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Does not work no amazon help available",
      "text": "I Purchased this product for downloading onto my computer the product serial number Amazone gave me is too long and is not accepted by the turbo tax software to activate the program . no one to contact for help no facility I have spent hours trying combinations of the Amazon number to work with no luck no way to return so I have to dispute the charge on my cc really frustrating no AMAZON HELP TO SOLVE THE PROBLEM",
      "rating": 1.0,
      "verified": true,
      "author": "Wayne Crabtree",
      "helpful_votes": 2,
      "publication_date": 20200131
    },
    {
      "title": "Problems with downloaded product",
      "text": "I have never had a problem with a downloaded product until this year, 2020. Not happy with not being able to access the program after using it only once. I uninstalled the program and reinstalled it, but I still cannot get the program to run. I would like to cancel the order. I will buy a cd and install it instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "the download did not work",
      "text": "i downloaded turbo tax. the next day when i tried to open the file. it gave me a message, the message said. \" Let's install the latest updates \". second sentence said \" These updates include the latest changes and other important info. it will take approximately 1 minute \" . it has been more than 4 hours and it has yet to finish updating. it has not worked. i would like for someone to resend me the file to download and let me try it again without me clicking on the \" Let's install the latest updates \" message.",
      "rating": 1.0,
      "verified": true,
      "author": "Geo",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Horrible software this year",
      "text": "OK so let me begin by saying this - I've been using this product since 2006 and I will never use it again. Something happened while using it, not sure if it was a glitch or the update screwed things up but it was telling me I owed 10 grand in taxes. I never owe money. It took about 2 panic stricken hours to figure out it had changed me from head of household and that was the issue. It didn't review that section so I had to find it on my own by starting from scratch. Never ever again. Next year I'll try Block's.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Covert",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Terrible Software",
      "text": "This software is the worst. I use it year after year (because there really aren't any other choices), and it just keeps getting worse! From constantly telling me things like \"go look on last year's return and put in your total blah blah from state something\", but not giving me any idea of what box that is, to telling me it can retrieve my investment house's information, but not providing a way to log-in, ugh it's just crap software. I hate using it and I wish there was an alternative. I'm a software engineer, and I do this kind of thing for a living, and this is just terrible. 100% fail.",
      "rating": 1.0,
      "verified": true,
      "author": "Tinkerer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Handy if you need or want something to do the math for you",
      "text": "If you are already pretty savvy when it comes to taxes then this little program is handy. I use it every year because I've used it every year before. It always seems to be good and do all the things I want it to. It does try and upsell you a time or two, avoid that when you can. It does have 1 state included with it, but it wants $25 more to file those for you. If you have done it in enough time, a small postage stamp will save you over twenty bucks. I will use it again next year.",
      "rating": 4.0,
      "verified": true,
      "author": "ChrisTop Contributor: Star Wars",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Used it for Years",
      "text": "My only small complaint is not in the product but in my not being more informed. With the tax code change last year I did not remember that the standard deduction had increase significantly and I spent a lot of time itemizing my deductions. When I finished the daylong exercise I found the my deductions were not as much as the Standard Deduction for my income range. As I said, Not a Turbo Tax problem, but a me problem.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "I've used TurboTax Deluxe for 20 years",
      "text": "I like the ability to import information from last year's TurboTax return, Quicken, and online from employers and my financial institutions. Really cuts down the need to do data entry and the possibility of entry errors. I also like to see the tax owed change as I make changes, as this highlights the impact of different income and deductions. It audits my return, identifies errors, and helps me correct them. Finally, I can submit my return electronically and get confirmation of its acceptance.",
      "rating": 5.0,
      "verified": true,
      "author": "TennisBum",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Turbotax 2019 fails to update",
      "text": "I have used TurboTax in previous years without a problem. TurboTax 2019 fails to update. I searched internet and found a workaround for downloading updates. After using the workaround, I checked the installed updates and found zero updates installed. In addition the workaround does not update the state tax section which I paid for and need. I have no confidence now in TurboTax and will never use again.",
      "rating": 1.0,
      "verified": true,
      "author": "Terrence W. Richardson",
      "helpful_votes": 2,
      "publication_date": 20200105
    },
    {
      "title": "STATE FORMS NOT READY YET",
      "text": "I've used Turbo tax for many years and this is the first year that I am unable to view the NJ state forms because they are currently unavailble. It also says that some forms have not been finalized yet. When I click on a tab that says notify me when they're ready I get an error message that says: Unable to load messageid No forms or products have been specified. Please close the window and try again. for en_US... I've reached out to customer support and waiting to hear back but as of right now I am not satifisfied with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Turbo Tax--Superb product.",
      "text": "Almost 30 years of using Turbo Tax (TT). Filed, refund spent--done and dusted. And I itemize. It's Deductible was an absolute winner app for me this year (again), because I had many donations to various orgs. TT integrated my itemized lists of donated items, attached fair market value and made all the calculations. I love TT. Thank you Intuit! BTW: I've been using Quicken Personal Finance for decades too. Good product--at least the older versions. I'm still using 2009 version.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Haynes",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Years of Service",
      "text": "I have been using Turbo Tax for years now and I haven't been let down yet. My only issue this year, and it is minor, is that the first time I opened it I needed to put in the access code. The next time I opened it I needed to put in the access code again. I have not had to put it in since so either it was a double check to make sure we were legit, or it was just a fluke. I would have been more upset if I had to put in this long code every time I went in. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Labrat",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "No State E-file - Read carefully",
      "text": "Like many of you here, I was under the impression that the Deluxe has 5 free federal E-file and 1 free state E-file. The 5 free federal e-file is correct but you have to pay $25 to E-file for the state. You could say I misread it but I'm not the only one here. It's the way the description is written that is kind of misleading. Regardless, I like the direct import from stock accounts and tie to the bank for deposit/withdrawal. Why can Intuit include 1 free state E-file to make life easier for everyone?.",
      "rating": 2.0,
      "verified": true,
      "author": "LA88",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "No download to Windows 7; no \"Return\" on Amazon, but refunded by using Chat",
      "text": "After we tried to get Turbotax from Amazon, we saw on the internet that Turbotax 2019 doesn't list Windows 7 as compatible. However, someone commented that it would work. We then tried to download again from Turbotax and got the window, saying not compatible - no longer a secure operating system. I think we have to use it online.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Maskasky",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "$100 to file state & federal *beware fine print*",
      "text": "You will end up paying over $100 to file your state and federal (including software). The prices continue to climb with TurboTax, kinda over it! I re-read the description: \"Includes 5 free federal e-files and one download of a TurboTax state product ($44.99 value) state e-file sold separately\" That basically says, if you want to efile state, you'll pay $44.99. So there's that. Disappointed with the climbing fees after already paying $50+ for software.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy Johnson",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "TurboTax is the BEST",
      "text": "I have been using TurboTax for many years. When I was younger my taxes were more complicated than they are now (consulting income, rental property, investments, etc.). Now that I am retired my taxes are much easier. Nevertheless, doing my taxes was equally easy. It is the best the second time you use it. That is because it fills in most of the information that you need from the previous year. All you need to do is modify the numbers. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "pachella",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great software at a great price",
      "text": "Easy download and install. Installs leaving previous versions. Imports previous years tax information as expected. Note that It does not have all the forms / functionality available yet since many forms are not finalized until January 2020. Expect that some things may not work until they are downloaded when released in 2020. Surprised so many people giving low reviews do not realize this. Worked perfectly for the pre-estimation I like to do each year.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lash",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Doesn't handle college tuition, scholarship, and room & board well",
      "text": "I've used Turbo Tax for a decade now, and been fairy content with it. (one year had an accountant also do my return, and came up with the same value.) This year while trying to handle one of my kids tuition, scholarship, and room and board costs (accidently applied it to the scholarship - don't do that if you don't have to) it got incredibly frustrating. First, I had to go to the underlying form to input the total tuition cost (no idea where I missed entering it, I never did find it), and had to go back to the form again to undo the room and board cost. I got there eventually, but not a solid experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Quasi Bear",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "I PURCHASED FED & STATE - WHY DO I HAVE TO PAY WHEN I FILE",
      "text": "I PAID FOR FEDERAL AND STATE AT A VERY GOOD PRICE. I WENT THRU THE WHOLE PROCESS AND FINISHED, READY TO FILE. THE FILING SAID I HAD TO PAY ANOTHER 19.99 TO FILE THE STATE. WHAT IS GOING ON? NOW I CAN'T FILE UNTIL I FIGURE THIS OUT OR I LOSE $19.99",
      "rating": 3.0,
      "verified": true,
      "author": "Christine Caldwell",
      "helpful_votes": 2,
      "publication_date": 20200126
    },
    {
      "title": "MAJOR ISSUES WITH SOFTWARE-EVEN THEIR TECH SUPPORT REPORTED GLITCH IN AMAZON EDITION  - LOOP TO LOOP",
      "text": "The State Tax portion of this Turbo Tax software was an absolute nightmare to do. Still, after 6 hrs, including 3 hrs. spent with Turbo Tax Tech support, the glitch that they reported to me in the Amazon edition has held me up from filing my 2019 State taxes. Turbo Tax Tech support told me they would call me back the next day to resolve the issues with the software and promised to give me refunds for the software and the State filing. That was 3 days ago and, of course, they didn't. Unless you don't mind being in a continuous loop with no resolution when you try to do your taxes, I wouldn't recommend this program.",
      "rating": 2.0,
      "verified": true,
      "author": "penelopepen",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Extra fees to e-file",
      "text": "I've been using Turbo Tax off and on (mostly on) for over a decade, but this latest iteration is a real let-down. The software works fine (although my taxes are pretty straightforward, so just about anything would do), but when you get to the end and want to e-file, it costs an additional $40 for Federal and $20 for state to have Turbo Tax do the thing that it's always done, and that some others do for free. This is *after* purchasing the program. So buying the software is like purchasing a ticket for the right to pay more money. I'll probably look elsewhere for my tax software, next year.",
      "rating": 2.0,
      "verified": true,
      "author": "Adeptus",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Incorrect information",
      "text": "I purchased the item and was suppose to get a free state download and I didn't, was supposed to get quicken for a year, and I didn't. I had to purchase the state for 44.99 and I cant get my money back. I have purchased Turbotax for 12 years now and this is the first time I have been unhappy with the product. And on top of that I had to get technical support to troubleshoot because the state that I purchased didnt work properly. So disappointed !",
      "rating": 2.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "No need to procrastinate about doing your taxes!",
      "text": "I always tend to put the things I don't like to do last, and the same thing goes for doing my taxes every year. Well. I did it again this year, but this time I downloaded TurboTax from Amazon right after purchase, installed it on my laptop, and was done with doing my federal and state taxes and e-filing the federal one in about an hour! (Our state charges about $25 to e-file so I just mailed that one.) All the calculations are done for you accurately and everything is clean, neat, and organized for record keeping. It saved me a lot of stress and worry and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "annie",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Deceptive in their advertising, may not return!",
      "text": "While the software is easy to use and filing your federal returns is free, the notion that you do get one Free State filing is completely false. Not only will you have to pay a $24.99 State E-filing fee, you also will be charged a \"Refund Processing Service Fee\" for a total of $64.98 in fees on top of the $49.80 paid for the software itself bringing it to a grand total of $114.78 in order complete ONE FILING (Both State and Federal). It's absurd the the word free is even mentioned ANYWHERE on this post. Will be moving to another option next year for sure.",
      "rating": 3.0,
      "verified": true,
      "author": "Shai",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Costs exta money to file a state return",
      "text": "This Deluxe version is a bit of a bait and switch. With the deluxe you are only paying to get the state filing software but need to pay an extra $25 to actually file the state return. Overall I like the program and software but feel as though they should specify the extra charge to e-file a state return.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Go eat shirt",
      "text": "May the fleas of 10,000 camels infect your crotch and may thine arms be too short to reach and scratch. Supposedly comes with 1 state filing...which it does... but there is an extra $21 charge to e-file. Bastages. I have always filed with Turbotax my entire life but you all just keep getting more and more shiesty and I will never again use your piece of garbage money grabbing soul sucking flea infested product. Go. Eat. Shirt.",
      "rating": 1.0,
      "verified": true,
      "author": "Josiah Wood",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Errors and crashes on some versions of Windows 10 64 bit systems",
      "text": "I have been using this software for years without any problems. This year I have had several crashes and update failures. It was obviously a know issue because they had a help button for this specific issue and blame it on your system and after following their instructions it still was failing to update. I was forced to set the application to run as administrator and compatibility mode to make sure it ran in 32 bit mode. They need to update to a 64 bit version that is fully compatible with the latest Windows 10 OS.",
      "rating": 2.0,
      "verified": true,
      "author": "Bad Bob",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Turbo Tax is predatory.",
      "text": "Rigged for the rich. Free version is a joke. Overall, the software sucks balls and holds you hostage, as in takes advantage of people who genuinely want tax services but cannot afford them. Software makes you pay extra to find basic deductions and savings. Intuit wants to get past taxes and onto selling you investment services. They get a free marketing platform for their financial products by way of the federal government promoting turbo tax. Disgusting and deplorable.",
      "rating": 1.0,
      "verified": true,
      "author": "Jefre Palmer",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Easy to use",
      "text": "I have used Turbo Tax for years and always liked how easy it was to use. I especially like the interface that allows you to check and understand a deduction if you are not sure if you qualify. The program will walk you through each step filling out the form or if you are comfortable enough with the forms you can fill them out yourself without going through the walk through.",
      "rating": 5.0,
      "verified": true,
      "author": "Stewpot",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Good product gone bad",
      "text": "I have used TurboTax for the last few years with good results, but changes made to the software have made it a lot less desirable. Upon the first update, I followed the link to view the changes and found I had followed a dead link. How will a person know if the changes will affect them or not? Goodbye, transparency! Then, I was looking at an activation screen on software that I had already activated. Another search showed that there are a lot of people having the same problem with activation. Will you be covered if there are 6 updates and only 5 activations allowed? Who knows what's next. I strongly recommend finding another tax software to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Incognito",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Same Old Turbo Charges - All Costs Included Until You File State Taxes",
      "text": "Same Old TurboTax - All Costs Included Until You File State Taxes. The software is great, but why don't they clearly provide upfront summarized costs with and without State Filing. They always seem to imply the purchase cost includes all. You buy from Amazon, BUT one then needs to pay a second time and provide a credit card for additional cost adder to file one's State tax filing. Does H&R Block do the same?",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Does not transfer to your online return / State E-File is extra",
      "text": "Yes it's in the fine print if you look it over, follow links, and look up exactly what the different words mean. But the bottom line is that Turbotax has always been bait and switch, and this isn't any different. *IT COST EXTRA TO E-FILE STATE TAXES* *IF YOU STARTED A RETURN ONLINE YOU WILL NEED TO DOWNLOAD THE SOFTWARE AND TRANSFER IT*",
      "rating": 1.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Doesn't import ANY information!!!!",
      "text": "I tried importing the PDF of my W-2 but it doesn't recognize it...so I have to manually enter everything. Using TurboTax Online, everything was imported already - all I really needed to do was submit. But decided to buy the software because it was saving money on the overall filing cost. However, nothing transferred from what I had previously started - and nothing would import. I would rather spend the extra money than re-enter all of the information that should be able to be uploaded. Very disappointed. Will be requesting a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Jayme Lee",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Simple to use",
      "text": "First I did not rate tech support because I have never needed it. I use this software every year for my taxes which makes it even easier as it finds last years file and fills in most of the info for you. Then it simply walks you through every step of the way if that is the option you choose or you can manually step to what you know you need. Definitely recommend to anyone doing their own tax returns.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Smith",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Good software at a fair price.",
      "text": "I'm a simple home owner with few investments. The downloaded deluxe version + state is sufficient for my needs. I like ease it is to download from Amazon and just get to it. I used it last year and it's even better this year. I'm no wiz at tax preparation. This software keeps me out of trouble, checks my numbers, and tells me if I'm mistaken. I can get the job done and quickly be off to more interesting activities.",
      "rating": 4.0,
      "verified": true,
      "author": "LV Miner",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "OK software but has issues",
      "text": "For the most part it's accurate but it never gets my Railroad Retirement correct. I have to manually edit the documents every year. And even though I indicated that I don't get a W-2 I get errors about not doing a W-2 during the review process. Because of these issues, I pay for the audit \"protection\" service because I don't trust the software. Next year I might switch to H&R Block software.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee R.",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Buy the deluxe, it will handle your stock trades as well.",
      "text": "I don't own a rental property, but because of company stock purchases (ESPP, RSU, etc.) I have been buying the 'Premium' one at a higher price. This year reading through people's reviews I realized that the deluxe version also does all this. Really my situation is a couple of W2s and some stock purchase/sell, (along with mortgage/interest/kids/etc.) and all of that is done with the deluxe no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Faz",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Easy to Use",
      "text": "I have used this program for a few years. It is easy to use and will have a chance to update as sometimes there is minor changes by the IRS. It does not effect your returns. I used the download version two years in a row. I have used disk version in past. The downloading is very easy to use if you have a basic knowledge of using a computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous AB  ",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Won't work with turbotax online no way to return",
      "text": "I purchased TurboTax 2019 as a digital download. I logged into my TurboTax account but there is no way to enter the product key. The downloaded version is requiring me to reenter all my information. i cannot transfer all my saved data into the program. I have used TurboTax for the last 8 years. Am I going to be stuck paying for the software twice.?Horrible. Maybe it's time to switch to another type of tax preparation software.",
      "rating": 1.0,
      "verified": true,
      "author": "amy jo",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Download worked well",
      "text": "Won't use the product until next February, but the download worked very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy A. Nadeau",
      "helpful_votes": 2,
      "publication_date": 20191110
    },
    {
      "title": "Install is not working",
      "text": "I finally got TurboTax to install on one of my computers, But now it's not accepting the activation code that came with the purchase! I have never had so much trouble with something from Amazon! And they make it virtually impossible to contact someone to rectify the problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "SO Far So Good",
      "text": "Still waiting for additional 1099's to complete my return. Did my step-son's already since he's a W-2 only filer. It worked. Was able to electronically file his federal return. Downloaded cleanly and booted up fine. Was able to transfer prior year's return data making the entry easy. Step-son's W-2 info downloaded automatically with the control number from his W-2, saving entry time. Overall took only 20 minutes to get his returns done.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Review Update!  Feb 2020",
      "text": "Though this was priced right back in Nov. 2019, when I tried to complete my returns this month... Turbotax would not accept my confirmation number or license # that they gave to me with this download. Had to call them for help and then paid for the State Return that was included in this package. Now waiting 6 to 8 weeks for my over-payment. What a mess.... Will probably use their web site next time. Lesson learned.",
      "rating": 3.0,
      "verified": true,
      "author": "Dee Allen",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Poor Tech Support and Customer Service from Turbo Tax",
      "text": "I don't recommend this product. It is not compatible with online turbo tax deluxe despite what I was assured by the Turbo Tax representatives. The representatives were perfectly nice, however, they are clearly not trained to assist customers outside of offering a 20% discount on future products. The software ended up doing its job but they made the process more painful than it needed to be. I'd avoid turbo tax and go with a company with better customer support. Also just note this doesn't include your state filing fee that they will charge you after the fact.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Downloaded OK",
      "text": "Amazon prompted me for a review of TurboTax in January, days after it was bought and downloaded. Tax prep can hardly even be started yet, before any of the required statements are sent out. OK, so I put up three stars for how the previous years’ versions have run (kind of clunky but it gets it done) and one since it downloaded without hanging up my computer. If there are any breakthroughs within the next few months when I expect to use it, I’ll come back excitedly with an update.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce McDonald",
      "helpful_votes": 0,
      "publication_date": 20200110
    }
  ],
  "product_meta": {
    "title": "TurboTax Tax Software Deluxe + State 2019 [Amazon Exclusive] [PC Download]",
    "description": "Platform:PC Download| Edition:Deluxe + StateTurboTax Deluxe is recommended if you own your own home, donated to charity, have significant education or medical expenses, have child-related expenses or have a lot of deductions TurboTax is tailored to your unique situation-it will search for the deductions and credits you deserve, so you're confident you'll get your maximum refund\n• TurboTax coaches you every step of the way and double checks your return as you go to handle even the toughest tax situations, so you can be confident you're getting every dollar you deserve.\n• Every year it gets even easier. As a returning customer, TurboTax will automatically transfer last year's data to help ensure accuracy and save you time\n• Up-to-date with the latest tax laws-so you can be confident your taxes will be done right. \n• Help along the way-get answers to your product questions, so you won't get stuck.\n• Your information is safeguarded - TurboTax uses encryption technology, so your tax data is protected while it's e-filed to IRS and state agencies",
    "rating": 4.4,
    "feature_bullets": [
      "TurboTax Deluxe + State is recommended if you own your own home, donated to charity, have significant education or medical expenses, have child related expenses or have a lot of deductions and need to file a federal and/or state income tax return",
      "Deluxe + State will accurately deduct mortage interest and propery taxes. Get your taxes done right and tailored to you, based on your unique situation.",
      "MAXIMUM TAX REFUND - Searches for more than 350+ tax deductions and credits, including mortgage interest, property taxes and energy-efficient improvements, to get you everything you deserve",
      "TAXES DONE RIGHT - TurboTax guides you through your tax preparation, keeping you up to date with the latest tax laws and double checking your entries along the way.",
      "Includes 5 free federal e-files and one download of a TurboTax state product ($44.99 value) state e-file sold separately",
      "Exclusively at Amazon, receive a free 1 year subscription to Quicken Starter Edition ($34.95 value) with your purchase of TurboTax",
      "Free U.S. based TurboTax product support via phone",
      "TRACK YOUR DONATIONS with Its Deductable from TurboTax- Turn charitable donations into big tax deductions",
      "SAVE TIME- Automatically imports financial information including W-2s and mortgage information as well as imports prior year tax return information from TurboTax and other tax software."
    ],
    "specifications": {
      "Date First Available": "October 27, 2019",
      "Manufacturer": "Intuit, Inc.",
      "ASIN": "B07YH2PTCJ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tax Preparation",
      "Software"
    ],
    "price": 59.99
  }
}