{
  "website_summaries": [
    {
      "verdict": "Microsoft’s Surface 3 is as powerful and versatile as it is gorgeous and lightweight. Easily the best ultrabook on the market.",
      "pros": [
        "Excellent processing speed and graphics",
        "Available in 13.5- and 15-inch screen sizes",
        "Large trackpad",
        "Comfortable keyboard",
        "Available in 4 stylish colors",
        "Battery life max is 11.5 hours, and weight is under 3 pounds"
      ],
      "cons": [
        "An expensive but worthwhile investment"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quality product.",
      "text": "Works good no problems. Matte black will show fingerprints easily but I don't care if you do get a different color. People complaining about the laptop being \"laggy\" need to change the power saver mode to performance the laptop auto sets it to save battery life which will make the computer slower. (This is on all Microsoft laptops now and has been for awhile) I would not recommend this for gaming thats not what it's intended for its a work laptop. If you want to play games get a desktop.",
      "rating": 5.0,
      "verified": true,
      "author": "Niko",
      "helpful_votes": 65,
      "publication_date": 20191028
    },
    {
      "title": "Best build quality on the market",
      "text": "Great build quality. Higher end configurations are a bit overpriced. My first one was stolen in transit by the UPS driver, but amazon refunded me.",
      "rating": 5.0,
      "verified": true,
      "author": "Chase Kanipe",
      "helpful_votes": 35,
      "publication_date": 20191030
    },
    {
      "title": "Restarting all the time",
      "text": "The laptop per se is sleeked, light-weighted. Love how it looks! However, it has got a severe problem - running into blue screen and requiring restart all the time. I have contacted Microsoft for tech support for twice yet neither of their staff actually had the problem solved. It is simply a headache for me now!",
      "rating": 4.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 19,
      "publication_date": 20191213
    },
    {
      "title": "Mice plugged into USB C hubs are buggy",
      "text": "When a mouse is plugged into a USB C hub the laptop just can’t handle it. The mouse lags and jumps around. Other laptops handle the hub fine, so I tried another hub and the same issue persists. Seems like I’ll have to plug it in separately, defeating the purpose of USB C.",
      "rating": 2.0,
      "verified": true,
      "author": "Xen Tsiu",
      "helpful_votes": 16,
      "publication_date": 20191206
    },
    {
      "title": "Great laptop",
      "text": "I use this laptop for work, it enough for me. I really like the design. it will be perfect if the screen is bigger",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20191205
    },
    {
      "title": "Too clever by half",
      "text": "I thought I could live with only 2 USB ports. But I can't. Guys, sometimes less is not more. This is a PITA to get all of my peripherals connected to. My bad. I saw there were only 2 ports. Even with a docking station, this is incredibly annoying. Even the Surface Pro has more. Sigh. I thought with the extra memory and larger hard drive, it wouldn't run hot, but it often does. Maybe these 2 points are clouding my views. Anyway, having had a total of 3 surface products, all I can say is that this is my least favorite. By far. Not worth the crazy amount of money.",
      "rating": 3.0,
      "verified": true,
      "author": "Eliza G",
      "helpful_votes": 3,
      "publication_date": 20200504
    },
    {
      "title": "Surface Pro to Surface Laptop Convert",
      "text": "I've owned the Surface Pro 1 and Surface Pro 3. I saw Microsoft was coming out with more \"laptop-esque\" machines but always thought I'd stick with the Pro line forever. However one gripe I had about the Pro series was screen tilt, especially when trying to video chat. Unlike traditional laptops, you can't tilt the screen forward, which makes for awkward angles when video chatting or watching movies, etc. I decided to go with Surface Laptop and I won't be going back! I love this computer. Screen size is awesome and display is clear. Touch is sensitive and responsive. Keyboard is comfortable. And the machine it self is gorgeous. Just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Chloe Lauffenburger",
      "helpful_votes": 2,
      "publication_date": 20200724
    },
    {
      "title": "I've ordered the black mat finish and I get the silver one and many other issues with device",
      "text": "I was not able to return it as I took it with me over seas to my nephew as a Christmas gift, and to my surprise when he opened it was silver, then when he tried to set it up the hello camera is not working keeps on saying feature not available ... MS can not help and the seller is not responding",
      "rating": 1.0,
      "verified": true,
      "author": "Alaa",
      "helpful_votes": 4,
      "publication_date": 20200109
    },
    {
      "title": "Love this",
      "text": "This is my second.....The first one I dropped and the screen broke, and after 4 years it seemed to have seen better days, so I ordered the same (after days of anguished researching). The keyboard is user friendly and I just love the touch screen. It's light enough to travel with (if I ever travel again) I definitely recommend this but I use it only for writing and email. Have no idea about other uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Planaria J. Price",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "SCAM",
      "text": "Not a surface 3. They sent the original 2017 model.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 5,
      "publication_date": 20200515
    },
    {
      "title": "Defective internal wifi",
      "text": "I love everything about this laptop but greatly disappointed with the wifi connection. I started to return it but I need it for work and had to find a patch for the problem. Bought a usb wifi connector. It is very inconvenient and has caused me a lot of wasted time when i don't have the external wifi. Not happy at all that I had to deal with this after paying so much for this laptop.",
      "rating": 1.0,
      "verified": true,
      "author": "Exchange24",
      "helpful_votes": 4,
      "publication_date": 20200202
    },
    {
      "title": "Amazing Laptop",
      "text": "My wife was in the market for a new laptop for school. This seemed like the best option and indeed it has been amazing. It is super fast to boot, the windows face recognition works great and it is not filled with bloatware. It is not built for games, but it is an amazing laptop for productivity and the specs with an i7, 16gb of memory and the option to change the NvMe storage it will last us for years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Something is not right",
      "text": "Its been a month since I bought this laptop. Liked: -Lightweight -Excellent Keyboard -Good speakers -i7 and 16 gb make it super fast for loading apps and multitasking Dislikes: - Saw reports of people having issues with a cracked screen (hopefully microsoft will fix for free) - Screen size is just 13.5, a little small - No thunderbot 3 port. -Not so good battery life I would recommend a macbook instead, or the surface book 3.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashesh",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Had to return the laptop...",
      "text": "Loved the laptop and wish I could have kept it but there we many technical issues without solutions that made it impossible to keep. The screen and audio did not match up when watching videos and after looking for a solution, many other people in the forum said the only fix was to return the computer. For such an expensive computer, it should have all of the issues ironed out before it is sold to customers, and this laptop did not and still has issues to this day.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 2,
      "publication_date": 20200702
    },
    {
      "title": "Won't power on",
      "text": "Received this January 15, but didn't open it until the 24th. Today -- February 6, it was dead. Nothing I did would turn it on -- additional charging for 2 hours+, hitting and holding the power button repeatedly. Even googled what I could try. Nothing worked. It is going back.",
      "rating": 1.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 4,
      "publication_date": 20200206
    },
    {
      "title": "Don't buy surface laptops...",
      "text": "I have had the worst experience using Microsoft Surface Laptop 3. The touchscreen stopped working within a month of buying the new laptop. The customer support staff was of no use in fixing it. After spending 5 days on this they decided to replace my laptop. For replacement, they asked for 10 business days and extra amount for early shipment. Even after paying the extra amount I haven't received the laptop with no response from their end. They still plan to take 10 business days to resolve this. So essentially I haven't used the laptop since I bought it. The worst purchase possible.",
      "rating": 1.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Bad",
      "text": "Computer broke after one week Would not wake up lost all my files Sent back bought an apple",
      "rating": 1.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 6,
      "publication_date": 20200116
    },
    {
      "title": "Great laptop!!",
      "text": "I love this laptop it light weight and sleek. The battery life is great to me. I use it for programming and homework for engineering classes and it last pretty much all day on one charge and recharges in what feels like less than an hour. The applications load seamlessly, USB files open instantly, and facial recognition is instant. It's a great laptop with a beautiful design.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200201
    },
    {
      "title": "laptop scam",
      "text": "Beware, the laptop is not the surface laptop 3 and is not new, mine arrive with cosmetic damage.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200709
    },
    {
      "title": "Great laptop!",
      "text": "I have had this almost three weeks, it's an impressive laptop. Appearance is flawless, screen opens with just a finger, the keyboard and touchpad are very nice, I just wish the keys were backlit. The speakers provide impressive sound and the screen ratio makes th 13\" appear like like much larger laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris G.",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Fantastic!",
      "text": "I really love this so much! The laptop is awesome! Battery is great and long lasting to me. The design is pretty and modern. Slim laptop, perfect weight. The screen is very HD. When UPS delivered they made sure to get my signature. This laptop costed me A LOT of money, but worth every of it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mae. G",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Never buying a Microsoft laptop again",
      "text": "I've had a nightmare experience with my Surface Laptop 3. From day 1, I've been facing issues with any wifi network I connect with. It shows very little network and also suddenly disconnects every few hours. Complained to Microsoft and did all kinds of troubleshooting but that didn't work out. So initiated a replacement process. It took them nearly 3 months to send me the replacement device and it has the exact same issue with any wifi network I connect! Also, my initial device was Cobalt Blue in colour and they randomly sent me a Platinum one, which I don't like at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Pari Sheth",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Don’t buy this",
      "text": "Don’t buy this !! It’s so bad I returned and bought a Mac instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200206
    },
    {
      "title": "Amazing laptop",
      "text": "Had mine for a couple months now, it's absolutely amazing. No criticisms at all. Beautiful, light-weight, fast, runs cool, very powerful.",
      "rating": 5.0,
      "verified": true,
      "author": "theinternetguru",
      "helpful_votes": 2,
      "publication_date": 20200122
    },
    {
      "title": "DEVICE CRASHES EVERY 10 MINUTES",
      "text": "Horrible device. I recommend you never buy any surface products as I've had the worst experience purchasing an item this expensive. It's crashing and freezing every 10 minutes after launch and it's not useable. Do Not Buy Surface Products.",
      "rating": 1.0,
      "verified": true,
      "author": "عبدالله عبدالرحمن",
      "helpful_votes": 3,
      "publication_date": 20200309
    },
    {
      "title": "Terrible computer, even worse customer support",
      "text": "This computer is awful. I've had constant problems since purchasing (OS crashes/reboots, blue screens, audio/video sync issues) that Microsoft refuses to deal with. Battery life is poor and overall performance is sluggish. I recently had a hairline screen crack (a known problem with this model) which Microsoft refused to service, even though the machine is still under warranty. Avoid this computer at all costs. It's a terrible machine and Microsoft will not support you when things go wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Dallas Fletcher",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Excellent Quality and Experience",
      "text": "Great product and value for money. Having a product made from chip to hardware with MS is much better then buying a third-party option like HP or Dell. Direct support from MS, integrated design, and no third-party bios or SW to screw up your boot or OS.",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Don't get it",
      "text": "I bought the laptop for my wife's job. She uses for regular excel and word documents. The laptop frezzes constantly and need restart. Terrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicolas Hidalgo Juica",
      "helpful_votes": 3,
      "publication_date": 20200417
    },
    {
      "title": "Quick and easy to use laptop for professionals",
      "text": "This is a great option for a light weight professional laptop. I do basic work functions, and organizing my pictures and a few other things at home. All the features are as advertised, and it's very easy to use, plus very light which is good for travel. I did buy a cover for the outside because it would be easy to scratch the outer layers.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Great Value!",
      "text": "I bought this for my wife on my son's recommendation (IT). She really likes this computer and is utilizing it for work from home and Doctoral homework. To date no complaints.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Laptop does not have 2 USB ports as stated; it only has 1.",
      "text": "I really enjoy the laptop overall but I had purchased a new one so I could have 2 USB ports. The specs on the Amazon page says that it has 2 USB ports. It only has one. I contacted the seller and have given them ample time to correct the page. It still says 2 ports. Hmm! I'll change my rating if they correct their mistake.",
      "rating": 3.0,
      "verified": true,
      "author": "Mel Crow",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "So bad quality!!!",
      "text": "It is awful! I bought it last year on black Friday. It hangs alot! It does not have enough space! And today it is out of work! I do not know why! I put it's charger in and get it out and suddenly it did not work any more! I called to Microsoft service and no one answer my questions only an operator! I am soooooo sorry for Microsoft for having this product!",
      "rating": 1.0,
      "verified": true,
      "author": "Shahla",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Screen came cracked on top right",
      "text": "The screen came cracked but it was the last one, so I kept it. Really wish I didn’t",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200508
    },
    {
      "title": "Even better than expected",
      "text": "I used Apple for a long time but recently started trying Windows and I liked it. So I got this. And it’s amazing. It’s so much better than expected. I’m very happy with this purchase and impressed with the quality of this laptop.",
      "rating": 5.0,
      "verified": true,
      "author": "Plains",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Screen cracking for no reason",
      "text": "Was working great but after a few months of usage then screen cracked after closing the laptop. Microsoft is charging 500 dollars for a screen replacement. Other users have reported the screen cracking after a closing their laptops as well.",
      "rating": 1.0,
      "verified": true,
      "author": "andrew dang",
      "helpful_votes": 2,
      "publication_date": 20200301
    },
    {
      "title": "Awesome device",
      "text": "I love this device. As a software developer, my productivity boosted a lot using it. it is very light and powerful with screen size and aspect ratio very practical. I highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Mohammad Gabr",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "I just love this computer",
      "text": "I have bought top-end Sony VAIO 13\" computers for maybe 15 years for mobile use in engineering mainly bc they are so small and light and have NVIDIA graphics cards. My latest is about 5 years old and the screen is failing so I sought a replacement and found this Microsoft surface and am very happy. I really like: island keyboard, facial recognition, fabulous screen resolution, touch screen, small size (about half the volume as VAIO with same screen size). It is just such a clean and friendly design. My computer is 1 Tb HD I7 10th gen processor, 16 gb ram.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Hannaford",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Like constant fan noise?  This is the laptop for you...",
      "text": "Nicely powered and sleek laptop, with a good keyboard. Unfortunately, I just can't love this machine because of the non-stop fan noise. The unit runs HOT, which is why the fan is kicking in. But I'm at a loss for why this is happening when all that's happening is a single Chrome browser with a single tab open for email. Nothing else is happening on the machine that should make it very hot or require the fan to be continually on.",
      "rating": 2.0,
      "verified": true,
      "author": "Maple Leafers",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Didn’t work when arrived",
      "text": "Didn’t work when arrived. Bought at Best Buy after this.",
      "rating": 1.0,
      "verified": true,
      "author": "B Rich",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great laptop, light weight, feels solid",
      "text": "Perfect size and weight for someone who often travels. Powerful enough for light coding and office applications.",
      "rating": 5.0,
      "verified": true,
      "author": "No",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Perfect for light work on the go.",
      "text": "Not too thrilled about the cloth surface around the keyboard. Not sure what they were thinking there - germ trap. I would have selected something different had I realized that it was cloth versus a hard cleanable surface.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Compact and fast",
      "text": "Have only used for about a month. Very fast and responsive. No complaints only positive.",
      "rating": 5.0,
      "verified": true,
      "author": "Nona M. Lipsey",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Great lightweight laptop",
      "text": "Only reason I did not give it 5 stars is the issue with the screen fading in and out as others mentioned. Otherwise, it's been great. Was not keen on the felt initially, but it seems to be wearing okay and has grown on me.",
      "rating": 4.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Don’t lock yourself out.",
      "text": "After the initial setup, make sure you update it all the way before you turn it off or close it. If you don’t it might lock you out saying your pin is invalid due to a security update. I had to wipe the computer entirely to get back in. After that it’s been working great.",
      "rating": 4.0,
      "verified": true,
      "author": "sarah renee hill",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "It's beautiful!",
      "text": "I bought it as a Christmas gift for my wife and, it was a slam dunk. She loves every aspect of it, and it solves all of her needs. She uses her computer for work, and this one is a fantastic all-around tool for her office.",
      "rating": 5.0,
      "verified": true,
      "author": "David Pérez",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Jumping into the new age",
      "text": "I have not fully figured out how to use it yet. Being somewhat computer challenged, I think i need a highschool person to help me use all the possible features of this computer. It sure is fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Enviro Energy Bob",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Do not buy this computer!",
      "text": "Absolute worst laptop I have ever owned. I have had to send it back to Microsoft and get a replacement TWICE because it just did not work properly at all. I would not recommend this laptop unless you want to be on the phone with the Microsoft \"support\" team for the rest of your life!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Best laptop, don’t regret it at all",
      "text": "I wasn’t sure if this would be worth the price but now I know this is the laptop for me. I just love everything about it, super fast, thin and lightweight, office comes ready to use. The only thing it’s missing is a HDMI or VGA entering, but you can easily by an adapter for that and it doesn’t bother me at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Beatriz de Albuquerque Aragão Cordeiro",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "My screen cracked from corner to corner within the first month",
      "text": "I don't handle my laptop roughly and have never had a laptop screen crack before. After about 5 weeks, the screen cracked from the bottom left corner to the top right. I really loved this laptop until this happened and it cracking within a month where I didn't drop it, or slam it seemed like it couldn't possibly have been my fault.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Best Laptop for home and online learning",
      "text": "The screen is extremely clear and bright and handles all of our grade schooler needs. Go with the 15in screen, we found this the best screen size when doing online learning and worked perfectly for video conferencing of teacher and classmates.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Good looking, great quality.",
      "text": "Can't say it's the best windows laptop. Thinking about the price, it's technical spec doesn't meet the reasonable expectation. Nevertheless, the incredible quality you can feel from your fingertips and beautifully carved metal body gives good reason why you should have it. Definitely, you buy it with your heart, not with your head.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunwoo Kim",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Fastest computer I have ever purchased. Solid construction",
      "text": "This is by far the best computer I have ever purchased and the fastest. It is almost like it knows what I am going to search for before I type it in..that fast. Great for playing stocks. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Austin",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "I am super happy with my purchase. It's light, fast, and has a great battery life.",
      "text": "Very happy with my Surface Laptop 3. Great screen, great battery. Wish it had a little more storage, but not the end of the world. Happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Hoffman",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "One of the best laptops",
      "text": "I’ve had my Surface for about 6 months now and I love it! It is super fast and it looks great! I use it for email, Microsoft 365 applications and some Minecraft gaming. It works great with all of these. I am very happy to be a Surface owner!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristof Pongratz",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Lousy keyboard.",
      "text": "Hate the keyboard. It must have been designed for girls. Battery does not last 1 day if you are surfing the Internet. Would not buy this again.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill Sutherland",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "amazing laptop",
      "text": "I love everything about this laptop, the quality, screen, touch screen everything",
      "rating": 5.0,
      "verified": true,
      "author": "Lopez",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Love it",
      "text": "I work on both Mac and PC platforms. I needed a PC to take on the road. This is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A. Friedlander",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great Buy!",
      "text": "This laptop is all you can ask for definitely would recommend it to anyone!!",
      "rating": 5.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Buyer Beware",
      "text": "1 month old and blue screen of death. 2 days after return window closed. I won’t be buying Microsoft again",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great for work and travel",
      "text": "I work from home and I travel a lot so I needed a laptop that could travel with me easily but still have the capacity to handle everything I do all day. At home it’s connected docking station and when I travel I just unplug and go.",
      "rating": 4.0,
      "verified": true,
      "author": "WebGirl",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Better than others in the similar range",
      "text": "I had this product for a while and I found it great. No complaints. Loved the laptop. It is light weighted and handy.",
      "rating": 4.0,
      "verified": true,
      "author": "CV",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Excellent quality and performance",
      "text": "Overall excellent performance, great screen quality, touch screen works perfectly. This is and excellent option to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael D. Del Rosario",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "This laptop is an absolute blast to use",
      "text": "I love Surface laptop 3 . 1. It boots up ridiculously fast. 2. Battery life is good. 3. Love 4:3 aspect ratio 4. Keyboard and pad are good One thing I dislike is how prone this black color model is with fingerprints and scratches. I would have been great to have magnesium silver color without alcantara material.",
      "rating": 5.0,
      "verified": true,
      "author": "Yash",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Pretty good",
      "text": "Just needs USB c on both sides of the laptop",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "This one of the best laptops for a college student",
      "text": "This laptop is sleek, lightweight and is extremely quick thanks to the SSD. It has all the things macs at a similar price point don't. It has face id and touchscreen and the 4k display just makes what ever you're watching look that much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler D",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "very polished device",
      "text": "its a joy to use and doesn't feel like a plsticky generic PC laptop. only issue is the WIFI 6 wake-from-sleep issue. from sleep i will only get 20-30 mbps wifi, unless i go into airplane mode and then back out. then it jumps to 300-400 mbps.",
      "rating": 4.0,
      "verified": true,
      "author": "Mitchell Tai",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Beautiful and great",
      "text": "I love the sleek design and everything, but there are some bugs when I turn it on the background of my display is jacked up and I have to restart it, but after that it’s all fixed.",
      "rating": 4.0,
      "verified": true,
      "author": "Eddie Hernandez",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Sucks.",
      "text": "Horrible. Can't handle a little spill like every other laptop",
      "rating": 1.0,
      "verified": true,
      "author": "Kohl Kramp",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great computer",
      "text": "This is a great computer, I bought it for school. Live the thought screen.",
      "rating": 4.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "The best laptop i have ever used",
      "text": "I love this Microsoft laptop very much. It is very good for Photographer and Programmers.",
      "rating": 5.0,
      "verified": true,
      "author": "rupesh g.",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Looking for a Deal!",
      "text": "This technology is state of the art and easy to use. Great features and looking forward ti producing some great artwork!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Hill",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "LOVE IT",
      "text": "LOVE this device! The touchscreen is huge, and the way the device is designed and the way it *feels* is exquisite. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethan M",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Amazing",
      "text": "Everything about this laptop is great except for someone reason I can’t turn the brightness up. It’s an issue I have to get fixed or maybe I just don’t know the settings yet but all in all I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Pou..",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Little pricey but solid",
      "text": "Very well built and designed but is a little pricey",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Jittery Screen",
      "text": "Screen became Jittery the second day I started it up. Called tech support and ended up having to return it. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Grant",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Awesome Deal",
      "text": "This computer is obviously very sweet. The touch screen, the lightweight it has great battery life too. It also charges up super quick, well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tzuriel Amster",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Box was re-taped",
      "text": "When my computer was received the box had been re-taped.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "every bit as good as promised",
      "text": "This computer is for my home and it is every bit as good as promised. Others are cheaper but this one is very highly rated by most sources.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Excellent Computer",
      "text": "Totally worth the money, the design is beautiful and the processor is super fast. Would recommned.",
      "rating": 5.0,
      "verified": true,
      "author": "BoredAF!!##.com",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Dead on Arrival Be Wary",
      "text": "Laptop was dead in the box. Charged for hours never turned on. Ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Surface 3",
      "text": "Love it just wish we could have found a protective case before it was dropped. Limited supply",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "EXCELENT LAPTOP! First Class",
      "text": "excellent reliable and fast laptop, I used to work with it, secure sites and fast searches. I m very very according with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ASR",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Excellent laptop, very impressed so far.",
      "text": "I got the base model of the laptop and I am blown away by it. Excellent quality and very fast. It even has an easily replaceable ssd if you want more storage!",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great latop for work and travel",
      "text": "This laptop is light, powerful, with a great screen and long-lasting battery life. I also like it's keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Welshans",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Love this laptop!",
      "text": "This is the third such laptop we are buying for our office at a university! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha Alizadeh",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Shipped to me NOT meeting specifications!",
      "text": "I ordered 8gb of ram - shipped with 4gb of ram. Completely under-performing laptop.",
      "rating": 1.0,
      "verified": true,
      "author": "Aiden",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Very satisfied.",
      "text": "Overall satisfied. It was very good that it was able to ship outside of US.",
      "rating": 5.0,
      "verified": true,
      "author": "shimon takahashi",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Amazing laptop",
      "text": "LOVE LOVE LOVE this laptop from the visual aspects to the software and different features it has",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan P.",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Love the Keyboard Finish!",
      "text": "Love the keyboard finish and the blue is very beautiful. Just got it, so cant comment on the performance yet but so far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Ramya",
      "helpful_votes": 2,
      "publication_date": 20191130
    },
    {
      "title": "Awesome little laptop",
      "text": "Its fast, light and extremely stylish for a 13.5\" laptop. Great looking screen at 2256 x 1504 native resolution. Added bonus of WiFi 6 (802.11ax) capability if you have or plan to upgrade to a WiFi 6 router.",
      "rating": 5.0,
      "verified": true,
      "author": "Franco",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great laptop",
      "text": "Good deal on Black Friday. Brand new laptop, better purchase experience than Bestbuy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ziwei89",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great for Grad Students",
      "text": "I bought this computer to work on my masters and I LOVE it. It does everything I need it to do, while also being small enough for me to put in my purse and take it with me while I'm doing class on the go! The battery life is a lifesaver because I forgot my charger one weekend I went home and I was able to use it for multiple days without having to plug it in!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20201023
    }
  ],
  "product_meta": {
    "title": "Microsoft Surface Laptop 3 – 13.5\" Touch-Screen – Intel Core i7 - 16GB Memory - 512GB Solid State Drive (Latest Model) – Cobalt Blue with Alcantara (VGS-00043)",
    "description": "Size:13.5\"| Color:Cobalt Blue| Configuration:16GB Ram, 512GBMake a powerful statement and fuel your ideas with new Surface Laptop 3. Sleek and light, with improved speed, performance and typing comfort, it travels with ease and makes every day more productive. Now in a choice of two sizes, two elegant keyboard finishes, and new colors to match your style.",
    "rating": 4.5,
    "feature_bullets": [
      "Clean, elegant design — thin and light, starting at just 2.79 pounds, Surface Laptop 3 is easy to carry",
      "Choose from rich tone-on-tone color combinations: new Sandstone, plus Matte Black, Cobalt Blue, and Platinum",
      "Improved speed and performance to do what you want, with the latest processors – Surface Laptop 3 is up to two times faster than Surface Laptop 2",
      "More ways to connect, with USB-C and USB-A ports for connecting to displays, docking stations and more, as well as accessory charging",
      "All-day power on the go, with up to 11.5 hours of battery life, Plus standby time when you’re away. Go from empty to a full battery with fast charging- up to 80% in about 1 hour",
      "Memory Storage Capacity: 16.0"
    ],
    "specifications": {
      "Standing screen display size": "13.5 Inches",
      "Screen Resolution": "2256 x 1504",
      "Max Screen Resolution": "2256 x 1504",
      "Graphics Coprocessor": "Intel Iris Plus Graphics",
      "Chipset Brand": "Intel",
      "Card Description": "Integrated",
      "Number of USB 3.0 Ports": "2",
      "Brand": "Microsoft",
      "Series": "Surface Laptop",
      "Item model number": "VGS-00043",
      "Hardware Platform": "PC",
      "Operating System": "Windows 10 Home",
      "Item Weight": "2.79 pounds",
      "Product Dimensions": "12.1 x 8.8 x 0.57 inches",
      "Item Dimensions  LxWxH": "12.1 x 8.8 x 0.57 inches",
      "Color": "Cobalt Blue",
      "Processor Brand": "Intel",
      "Processor Count": "4",
      "Computer Memory Type": "Unknown",
      "Flash Memory Size": "512",
      "Hard Drive Interface": "Solid State",
      "Hard Drive Rotational Speed": "7200",
      "Optical Drive Type": "No Optical Drive",
      "Power Source": "Battery Powered",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B07YNLK9LY",
      "Customer Reviews": "4.5 out of 5 stars564 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#7,140 in Computers & Accessories",
      "Date First Available": "October 2, 2019"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": 1699.99
  }
}