{
  "website_summaries": [
    {
      "verdict": "The best all-around tool for filing personal taxes, especially for individuals with a lot of deductions, who own a home, and/or who have expenses like childcare.",
      "pros": [
        "This is the ideal tool for filing personal taxes, helping users sift through the major changes to tax law in 2019",
        "The CD is compatible with Windows 7 or better and MacOS Sierra 10.12 or better"
      ],
      "cons": [
        "A few forms aren’t yet available due to the new tax laws"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not buy this until activation problem is fixed",
      "text": "This product is unusable until Intuit fixes a major installation problem. It appears to install properly, but whenever you try to use the software it asks for the activation code to be re-entered and then it doesn't start. After (if) you do this five times you will get error code 603, meaning that it has been activated too many times. So the software is worthless until this problem is corrected. After 14 years of using TurboTax, it may be time for a change.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas C Fenton",
      "helpful_votes": 172,
      "publication_date": 20191207
    },
    {
      "title": "Software activation / validation bug - Do not purchase",
      "text": "Software is unusable due to a bug that requires you to revalidate it every couple of days. Online tech support is useless, making you sift through multiple pages to actually find a topic that might be relevant. Tech support staff I spoke to didn't have a clue what was going on and were largely worthless. Blamed it on third-party software and \"they couldn't vouch for it.\" Expect that I will use the URL I found to request a refund. Except that the URL listed by the Intuit moderator no longer exists.",
      "rating": 1.0,
      "verified": true,
      "author": "MJFullwood",
      "helpful_votes": 22,
      "publication_date": 20191217
    },
    {
      "title": "Invalid license code !!!!!!",
      "text": "The Turbo Tax program did install but would not activate. The license code is invalid. I bought this directly from Amazon. I recommend to buy someplace else.",
      "rating": 1.0,
      "verified": true,
      "author": "TJH",
      "helpful_votes": 13,
      "publication_date": 20191230
    },
    {
      "title": "CD version 2019 is defective",
      "text": "I have been using Turbo tax for years. I recently received this year's CD and tried to install it. The install has failed several times - there is a problem with the software.",
      "rating": 1.0,
      "verified": true,
      "author": "Pseudonym",
      "helpful_votes": 14,
      "publication_date": 20191228
    },
    {
      "title": "A huge disappointment",
      "text": "Been using Turbo Tax for some 15 years and never had this malfunction before-same computer used for the past 5 years. This year's product (Deluxe) installed but the Update feature refused to work. The message is \"Intuit Updater has stopped working\" Tried the 5 or so suggested fixes available in Community-not a one worked. Uninstalled the program-reinstalled- same issue. Tried the manual update which also froze. I am done with Intuit and Turbo Tax.-there are too many other choices in the market to put up with the frustration involved with this year's failure.",
      "rating": 1.0,
      "verified": true,
      "author": "xenos48",
      "helpful_votes": 9,
      "publication_date": 20200107
    },
    {
      "title": "Best Tax Software",
      "text": "Got my CD and installed it no problems, I also used the download version with activation code included with software and had perfect results and absolutely no problems. Highly recommended software for your do it your self tax purposes!!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 10,
      "publication_date": 20191207
    },
    {
      "title": "Ugh!",
      "text": "I got the disk. I have not yet done my taxes. But I have been doing my taxes with TurboTax for many, many years. Like over 10 yrs. I've never had a single problem. Even when I needed help and ended up going to a real tax man because of issues with selling my rental home...that was because I had no idea what I was doing. Thank goodness that home is sold. I am back to the basic 1040. Poof to IRS",
      "rating": 5.0,
      "verified": true,
      "author": "Rudolph the Red Nose",
      "helpful_votes": 6,
      "publication_date": 20191205
    },
    {
      "title": "Turbo Tax",
      "text": "I have used this product since it first came out and again this year it made tax preparation so easy as long as you have done your home work and have your information together. It was even faster for me this year than last year. ONE BIG THING is that when I finished and wanted to print my tax return for a hard copy it would not print. After two days of trying to get it to work I discovered that you have to have Adobe on your computer. This was a new computer and once I downloaded Adobe it worked perfectly to print.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Musil",
      "helpful_votes": 3,
      "publication_date": 20200203
    },
    {
      "title": "TurboTax is Great.",
      "text": "I have been using TurboTax Deluxe for about 15 years now to prepare my itemized taxes. You get one Free State Download and can prepare up to 5 different tax returns. I am 61 and have always had to itemize with medical and owning a home, so this one does it all for me. Walks you through everything you could think of and then some. Never had an audit and always in the Green when it does and audit review at the end. Just filed my taxes today 01/27/2020 electronically. For me at 61 years old I would not even consider trying something else, this has always done a great job for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald",
      "helpful_votes": 2,
      "publication_date": 20200127
    },
    {
      "title": "Worked great....THEN FAILED MISERABLY",
      "text": "I have a simple return to fill out. Have always used TT - some years better than others, But I am familiar with it and put up with its limitations. Everything went well with entering my 2019 info. Came time to electronically submit and it FAILED MISERABLY. The message I received was it failed to validate. The message said an update is needed, I went to the update link and received the message \"no update needed\". The last line said \"Try again or mail your returns\". I tried and it failed again. What a failure - what a waste.",
      "rating": 2.0,
      "verified": true,
      "author": "Vito_jr",
      "helpful_votes": 2,
      "publication_date": 20200211
    },
    {
      "title": "WRONG VERSION OF TURBOTAX",
      "text": "I ordered and paid for TurboTax Deluxe plus State. I didn't check the box and didn't realize until after I had installed it on my computer and started doing my taxes that it did not include a State. Even though it allowed me to return it, since I had already entered a lot of my info, it was just too inconvenient so I had to buy a state at $39.99. I have always been happy with TurboTax and with my Amazon orders but this is quite a let down.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Haase",
      "helpful_votes": 3,
      "publication_date": 20200116
    },
    {
      "title": "The Choice of At Least Some Professionals - My Personal Choice for Over Two Decades",
      "text": "I hate doing taxes, even using the Standard Deduction. Were it not for Turbo Tax, I would gladly pay someone else hundreds of dollars to do them for me. The program's built in help screens are excellent and always have been. I have long used the Deluxe or Home and Business versions. More recently, I also used the Business/Estate 2018 version for my mother's estate. If you hate doing your income taxes as well, this is the program for you. They make paying income taxes far more tolerable. A couple of my friends do taxes professionally. Both have also used Turbo Tax for years.",
      "rating": 5.0,
      "verified": true,
      "author": "CompuForensics",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Has worked great in the past but 2019 Turbo Tax Jan 6th 2020 update created a HUGE mess",
      "text": "I have used Turbo Tax for many years and have always had a great success with downloading and set up. This year all was going good until the Jan 6, 2020 update and then the program did not work for about 10 days when it finally got the update error fixed now the Oregon state software will not run properly. Very disappointed in the software for 2019 taxes!",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry D Crafton",
      "helpful_votes": 3,
      "publication_date": 20200120
    },
    {
      "title": "A semi-reluctant purchase, but though not great, it's still the best out there!",
      "text": "Each year, since 1998 I have bought TurboTax to do my taxes. It has not been the easiest program to use. I feel there have been little real improvements over the years, although it does know the tax laws. I guess I am pretty used to how it works by now. I get done what I gotta do. Each year I hope for a new product that will excel and be able to replace TurboTax, but once again, it is still the best game in town. So, since again, I purchased this for another year's taxes.",
      "rating": 3.0,
      "verified": true,
      "author": "Book Glutton",
      "helpful_votes": 2,
      "publication_date": 20191215
    },
    {
      "title": "ONE UPDATE FAILED TO LOAD",
      "text": "I've used TurboTax for many years (probably more than 15 years) and it's always very slow to start up. Last year it would not load on my Lenova laptop. Intuit Tech Support told me to download the program. But now a different wrinkle -- one of the updates failed to load. Is it a critical update? Why did it not load? Will TT work ok without it? Intuit, try to get it right before putting it on the market!",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Phillips",
      "helpful_votes": 2,
      "publication_date": 20200124
    },
    {
      "title": "It's trying to get me to pay 20 dollars to e-file",
      "text": "had no problem with the federal income tax side of this software (e-filed included and no cost) but it wants me to pay an additional 20 dollars to file my state taxes or I have the option to mail in a printed tax return for the cost a stamps...It won't let me print out my state return, and it says on the case 'state taxes include' I get on the horn and give turbo tax a piece of my mind",
      "rating": 3.0,
      "verified": true,
      "author": "Biggoof",
      "helpful_votes": 2,
      "publication_date": 20200124
    },
    {
      "title": "More complicated and trouble than ever before.",
      "text": "After years of using TurboTax I have come to the end of it as far as I'm concerned. This is the last time I'll use TurboTax. You can't import data from outside unless you sign in with an intuit account. And I could find no way to return to TT after signing in (which was complicated by the fact that it had been years since I had signed in). I could have filled in the irs forms faster than I could the TT forms. NOT worth the price, or the brain damage. So bye-bye TT.",
      "rating": 1.0,
      "verified": true,
      "author": "CDamon",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "How to get your taxes done, if they aren't too complicated...",
      "text": "Had to upgrade to the Windows 10 version of TurboTax this year, but encountered no particular problems setting up and operating the program. The format will walk you through your tax questions and forms in reasonably good order. Electronic filing at the end is easy. The TurboTax program does require that you have your paperwork in order before you start. There continues to be a learning curve from year to year associated with the questions in the program. You do have to pay attention, as the information tabs aren't always terribly helpful. Recommended if your taxes aren't too complicated and you have the patience to do the necessary preparation beforehand.",
      "rating": 4.0,
      "verified": true,
      "author": "HMS Warspite",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Liscense code in use",
      "text": "I have used turbo tax every year for over 10 years. I love how easy it is to use and the value. This year was the first time I tried using a liscese code to download rather than the disk. When I entered the code from inside my sealed case, it said the code was already in use. Luckily I have a computer with a disk drive and I was able to complete the install with the CD. I am disappointed because I now have to use a computer that I wasn't planning to use.",
      "rating": 3.0,
      "verified": true,
      "author": "MamaShani",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "only one state tax use allowed",
      "text": "In previous years 5 federal downloads and 5 downloads of a single state were included - this year the fed is still 5 but only 1 state download. $40 for each additional download of the single state forms. Not very clearly stated in my opinion. Turbo Tax has us by the cahones and will do whatever they can to increase their revenues. Next year I'll go to the trouble of re-entering my basic info to use another tax preparing software.",
      "rating": 2.0,
      "verified": true,
      "author": "jan l gonder",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "1040 standard deduction? Do it online free",
      "text": "You know every year TurboTax changes. Some years TurboTax is a breeze it works flawlessly and some years it seems very buggy jumping all over the place. This is one of those years it's buggy. I was with tech support over 4 hours just trying to download my Free State. I've been using TurboTax since I believe 1995. This year I have been unable to generate a schedule D form. Some years you can generate forms, this year Ben wants to do the walk-through before it will generate a form. Also it's funny how on the paid version it will charge you $20 to E-file , but do it online and it's free 👍😂",
      "rating": 3.0,
      "verified": true,
      "author": "Jj",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Buggy software. Failed to transfer deduction from Fed Tax to State Tax. Incorrect State refund.",
      "text": "I've used this software since it was MacinTax. The TY2019 version failed to transfer a roughly $2500 charitable deduction to the State Tax form which resulted in a $195 reduction in the refund. Have still not been able to contact folks at Intuit to find out how to file an amended return via e-file which I'd used to pay the original tax. Window to print tax forms was too small to read. Generally sloppy software to manage Turbotax screw-up. I'll probably have to file an amended return by mail... waste of paper, my time, and postage. As you might guess, I'm not a happy camper.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Junkie",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Problems with state!!!",
      "text": "I've been using TurboTax for over 15 years and never had any problems...until now. I seen a lot of people had trouble getting state, so to avoid it, I ordered the disc from Amazon. Well, I tried to anyway, but for some reason it says downloading state, then says checking for updates & nothing. I still cannot do my state taxes!!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Michael King",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "Proven accurate by Block!",
      "text": "I’ve been using TurboTax for 17+ years. My husband worried that it was saving us all the money we deserve. 2 years ago I took 3 years of returns to H & R Block for them to give them a free review. The lady known in the Block community as being one of the best. She found no errors, so I didn’t have to pay. That’s their deal, so they are motivated to find something! I love that the software uses previous years’ returns to make sure that I claim and fill out everything. It also makes it fast. I think it's worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kansas City Mike",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Don't buy the CD if you are on a MAC!!!",
      "text": "I've been using TurboTax every year for decades. I purchased the CD and it wouldn't work or load on my Mac with the newest operating system (Mojave,I haven't upgraded to Catalina yet. will avoid THAT disaster as long as possible). I tried both my Mac Desktop and My MacBook Pro. Same problem ... tried to open it to install...... than NADA (nothing happens it won't open). went online and found that many people are having the same problem. I refunded and sent back the CD and bought the online version for download and it works perfectly. My Tax Return is done already.",
      "rating": 1.0,
      "verified": true,
      "author": "El Dudereeno",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Good product for 2019",
      "text": "Good, accurate product. It has a few minor issues. They no longer inform you what changes were made when you date like they have in past years. I guess they think we aren't smart enough to understand them. The link to the update details takes you to a page that says they have moved. They haven't bothered to update it. And unfortunately this appears to be the last year for TurboTax and Windows 7. They support Win 7 this year but are not supporting next year. I will not be throwing a perfectly good computer away (to update to Win 10 or whatever) to run a $50 program.",
      "rating": 2.0,
      "verified": true,
      "author": "RRtracker",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Last year on my current computer",
      "text": "I have used TurboTax for many years and find it pretty easy to use for my situation. My current computer is a mac ibook with ios high sierra. It is several years old and will not update to catalina. Sure enough, when I loaded TurboTax, it warned me that next year, it won’t work on my current computer. It is annoying when software forces you to buy a new computer even though the current one is fine and not very old. As far as using TurboTax, I find just about everything fairly easy to use. My main complaint is the generation of estimated payments for next year. The options are limited and could be better designed.",
      "rating": 4.0,
      "verified": true,
      "author": "mert",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "TurboTax rules...",
      "text": "I have used TurboTax to do my taxes for over thirty years. The deluxe edition serves me well. I literally can do my taxes in a few hours with the confidence they are correct. I like the way TT walks you through the tax process and the on-line filing of Federal and State taxes is so simple. I have never had an issue with the tax authority. A great added benefit is that all data can be saved in digital format (make a backup) eliminating paper printouts making it easy to find documents should you need them. I have no problem recommending TurboTax software.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Eastman",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Intuit wants more of your money",
      "text": "UPDATE: TurboTax customer service asked me to download the installer from their site. Installing via this method fixed the issue. ================================ TurboTax once again is screwing America. Buyer beware: you may think you’re buying the full version of TurboTax. You may think that as you’re entering the serial number during installation. You may think that as you’re going through the data input calculating your taxes. But when you get to the review page you will be told that you only have the Trial version installed and that you can buy it for the low price of $80! Please Intuit, stop screwing your customers. Fix this bug and give the customers what they bought.",
      "rating": 1.0,
      "verified": true,
      "author": "KD",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Where is Customer Service?",
      "text": "Cannot load onto computer. Can’t open. Keep getting message...”An item named Turbo Tax Deluxe 2019 already exists in this location. Do you want to replace it with the one your moving”? Options: “ Keep both, stop, Replace”. See picture above. No option resolves this. Just keeps asking. 😡",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 2,
      "publication_date": 20200114
    },
    {
      "title": "Slow, clunky, same questions over and over and over.",
      "text": "Slow to install, slow to load, slow to run. Makes you go through long sets of boxes and questions over and over and over. On startup it asks the same questions over and over. For multiple copies of the same form, same questions over and over. Might be good for simple returns but not for something 100+ pages. Gets worse every year. They could clone forms, but choose not to. Stopped working after about a week and will not run without updating.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Stimler",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Won't be able to use 2020 on older Imac",
      "text": "Been using Turbo Tax for years and very happy until now. Just finished my 2019 return and was informed that next years version will not run on any OS older than Mojave 10.14. My 2011 Imac will not upgrade to Mojave. Apple wants me to buy a new computer. I am NOT going to buy a new computer just to use Turbo Tax. There are other software programs available.",
      "rating": 1.0,
      "verified": true,
      "author": "Keith E. Hopkins",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "A poor product",
      "text": "When I used it today to print out estimate tax vouchers it insisted on updating an older version. After that it wanted the activation code re-entered. Fortunately I had the old disk; without it I suppose my old info would be lost forever. Maybe not -- after a long delay I learned that product support was closed so I did this fix on my own. But last time I called support they returned the call at 2am and still didn't provide any useful support after waking me. Free products are probably safer and better.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Rottman",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Check software compatibility",
      "text": "Would not work on my older Mac . So I went online and used my disk number for credit in the download area . Got a message saying I received credit for disk purchase but download did NOT show a credit . So I really don’t want to pay double . So I used a free product from a competitor and lost the money I paid for the disk ... SO PLEASE don’t be like me and check for compatibility...",
      "rating": 1.0,
      "verified": true,
      "author": "curtis",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "No e-file",
      "text": "After completion of my taxes my e-file was refused by the feds. According to Intuit it was because previous years AGI was incorrect. Looked at previous year and the number was correct. Contacted Intuit again they said re-file. Still rejected. They said set up an account with IRS and see what they show. Showed same figure I had, Another call to Intuit and they said you will have to mail in your taxes I buy TurboTax so I can e-fle. The last person I talked to at Intuit gave the impression she could care less about my issue.",
      "rating": 2.0,
      "verified": true,
      "author": "jandamm",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Turbotax",
      "text": "I've been using TurboTax software on Windows since 2005 or so. It's the best tax software by far. It transfers everything needed from the year prior. Walks you through everything you need to do. Free Electronic Federal filing for up to 4 returns and free Electronic filing for 1 state. My only complaint is that if you need to file with 2 different states you have to buy the 2nd states software from Intuit which costs more than the federal combined with one state deluxe. It should not cost more.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Excellent User Interface, Need State e-File for free",
      "text": "I like TurboTax, it is easy to use and accuracy is very good. My only gripe is the State tax should be electronically filed for free so the package would be filed all at once. Make it free and if you raise the price do it do filing is straightforward and seamless. I also liked the ability of way earlier versions that showed the complete form so you could make on the fly corrections. It is a pain when you have to go back and forth to make corrections and see it in the actual form format.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Wong",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Terrible Software",
      "text": "I will not buy Turbo Tax again. This year's version is terrible. Tried to use it to complete my city tax form. Because both my husband and I have the same employer, the software would not allocate the number of days worked in the city for each of us separately. When I changed my figures, my husband's figures would change and vice versa. A waste of $40.00. Don't trust that the numbers are correct on my state and federal forms either. Will have to buy Tax Cut to redo my 2019 taxes. Will not recommend Turbo Tax to anyone. Will buy Tax Cut from now on.",
      "rating": 1.0,
      "verified": true,
      "author": "T. S. F.",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Easy to use",
      "text": "I recommend this if you don't have anything to complicated in your reporting. (multi properties, rentals, etc) it is a breeze and offers a state filing as well, if you happen to live in a state that makes you pay taxes. It will walk you thru every little detail possible, and if you don't understand something there are plenty of links along the way that explains stuff. It is way cheaper than the accountant we used to use, been using it a couple years in a row now, and so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparky Reed",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "typical intuit - no customer service",
      "text": "trying to install the software tonight and right out of the gate the updater says it should take 2 minutes... well i have spent more than an hour trying several times to restart it and get the updater to complete. then going to intuit.com results in no direct way to chat with a person. i guess i can look forward to another year of bottom of the barrel intuit support",
      "rating": 1.0,
      "verified": true,
      "author": "no-name",
      "helpful_votes": 2,
      "publication_date": 20200109
    },
    {
      "title": "Reliable as Ever",
      "text": "I have been using TurboTax Deluxe for over 10 years. I find it fairly intuitive, given the complex subject matter. I have only had to enter the License Code one time, not every time I get an update as some report. My previous year's parameters loaded as they should. I have not noticed any significant difference from previous year's versions. I haven't filed yet as I am waiting for one last set of 1099s that won't arrive until mid-March. I don't anticipate any problems but if there are any I will update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Q.",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Simply The Best!",
      "text": "I have been a TurboTax user since 2011, and have never had a worry about my taxes being correct. In 2015, I was audited and, because I had signed up for the “Tax Audit Defense”, Intuit handled my audit and got me “off the hook” with the IRS! Prior to using TurboTax, I was paying a tax specialist over $600 per year to do my business taxes. Since turning to TurboTax, I spend less than $100/year and my taxes are “right on”! I will NEVER use another product or Tax Specialist! EVER!",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Benoit",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Disappointed",
      "text": "I have used Turbo Tax for years. However, the $40 fee (39.99) to submit the free federal is a bit much. You also don't know the fee until you go to file. In my case, time was an issue so I paid it. Otherwise, I would have definitely chosen a different method to submit my taxes. It has always been 24.99 to submit the state so that didn't surprise me. I could have paid $75 to an accountanct. The features are the same and I would continue to use if that massive fee goes away.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Almost perfect",
      "text": "I been using the deluxe version for over 15 years to do mine and my families taxes, it’s always been easy to install and update. My only minor complaint and considering all the changes each year and I do state with this too is it seems every year there is 1 question that I have to check with the included help as to what is meant by it, that could be phrased clearer. I have bought both the cd and download versions primarily for Mac OS.",
      "rating": 4.0,
      "verified": true,
      "author": "Taochow",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Decent program.  With Deluxe, you’ll pay extra to E-file a State tax return.",
      "text": "Pluses: Good program. Basically intuitive. Minuses: Program tried to up sell me to filling out the forms and filing in an additional state (at a fee) when I didn’t make enough money in that state, according to the state’s tax website to have to file. I made $5k in that state. I don’t have to file in that state unless I make about $24K there. Also, the add for the software seemed to indicate that with the deluxe version, you could do the forms and E- file both Feds and a State. Not so. Feds, yes. For the State, it figures out the taxes, and fills out the state forms. To E-file the state return, they want an additional $25.",
      "rating": 3.0,
      "verified": true,
      "author": "Enjoy Reading",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "It's TurboTax... What else can you say?",
      "text": "TurboTax is probably the most used software for handling taxes. Two years ago I tested TurboTax against a few other contenders. TurboTax came up with a much better return. So, financially it was worth paying the discounted price for this product. The down side is that there are comparable alternatives that have the advantage on price. But the alternatives don't make up for it in the return like TurboTax. Of course, everyone's tax situation is different so you may not have the same results as I did.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Retirees,  WATCH OUT!",
      "text": "Software quickly determined all I needed to do was take standard deductions to get a 100% refund but failed to point out I could have used the free filing option rather than paying a total of $68 to them, a greedy ripoff likely in violation of an agreement they reached with the IRS Conclusion: product works fine but corporate top management are immoral sob’s out to screw poor people and retirees out of every dollar they can",
      "rating": 1.0,
      "verified": true,
      "author": "Poppy",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Trash Software",
      "text": "Forces you to accept their garbage privacy policy or you cannot install. You must have an internet connection to activate the software, eliminating the point of a physical disc. Basically you're paying them to sell your information. If you don't care about sharing your information with the corporate sleazes of the world, use a free service. I'd expect a better information handling policy through a PAID service.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Howerton",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great tax program but.....",
      "text": "Worked great like normal. Been using turbo tax for over 30 years (I think?). Long long time anyway. My only complaint is the message when it starts up concerning the windows version on the old desktop that I use for my taxes. Basically I use tablets (Apple or ms surface) for all my computing stuff except to do my taxes. Now turbo tax won’t let me use this old desk top next year. Come on. Stop being a sales front for micro soft.",
      "rating": 5.0,
      "verified": true,
      "author": "family movie night",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Carefully check your packaging",
      "text": "Loaded up as advertised. When it opened up and I put in the code it said it was already used. Huh!?!? Package didn't have the shrink wrap on it just the tape on top and bottom. So very likely it was used and returned and was sold to me. I will not buy this product again through Amazon. Tech support did finally gave me a new code after a lot of complaining. They gave me the name of the person asking if it was me and it obviously wasn't.",
      "rating": 1.0,
      "verified": true,
      "author": "Lee S",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Turbo Tax is consistently reliable",
      "text": "Year after year I seem to return to TurboTax. Installation is easy and it pulls old information from previous tax return well. I tried to switch to other electronic tax solution looking to save money but found it was not worth the trouble. Perhaps the free solutions are good for very simple tax returns but found with mine I'm best to pay for Turbo Tax. Return for Fed and State processed easily and the checking system on TurboTax has never failed me.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela  SC",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "The program is top shelf in my book!!!",
      "text": "I like everything about the Turbo Tax software program. It gives me confidence that I have entered everything required, the step by step process is easy to use and it saves me money. The best thing is that it keeps all the pertinent information from the previous year and enters it in the new year's tax forms. No need to repeat information again and again. I have used it for at least 10 years and am completely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "PMP- Mpls.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Dumbest TURBOTAX in 20 Years.",
      "text": "I've used TURBOTAX for the past 20 years. Past versions were flawless. Once the taxes were completed e-file took 5 minutes for both Federal and State. This year my TURBOTAX coulnot e-file, and after 2 hours on the phone with INTUIT tech support I gave up and chose to use Uncles Sam's pony express to file. After 20 years of use of my favorite tax program I will be suing a different product next year.",
      "rating": 1.0,
      "verified": true,
      "author": "CharlieR",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Easy to use, perfect for the average user",
      "text": "The software is very complete for the average user, even advanced users can navigate rental and small business reporting requirements. Automated features like importing the prior year information and downloading W2s make it even easier. Like all software, you will experience glitches but it's not a deal breaker. I've been a user since 2001. I often use the current year software to project for the coming year for budget & tax forecasting.",
      "rating": 5.0,
      "verified": true,
      "author": "John Albert",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Incomplete",
      "text": "Sent back one disc because the software kept crashing. I received a replacement which worked fine. It is now the middle of January and Tubotax will not load my retirement income. The error message keeps telling me the form will be loaded soon. I will wait a couple more days before I send this one back and try another software .",
      "rating": 1.0,
      "verified": true,
      "author": "Gordon",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Watch out for Turbo Tax's New Scam",
      "text": "I have to file a NJ non-resident return, and NJ charges a fee of $24.99 to efile. Do NOT have the fee deducted from your refund...Turbo Tax charges $39.99 to do this. Instead pay the efile fee with a credit card so you don't have to pay this additional $39.99. What a JOKE !!!! ( And as an additional insult, the first two times I tried to pay with a credit card Turbo Tax said my internet connection must be bad as they couldn't access that page !! )",
      "rating": 3.0,
      "verified": true,
      "author": "CO",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Don't Expect Technical Support from Intuit if you Purchase from Amazon",
      "text": "Turbotax is the software of choice at Tax Time. This year, I had to ask for help on a detail associated with filing. I was surprised to hear that Intuit would not help me because I didn't buy the product from them. Once my return was filed, they said they would help, but not before. Strange attitude since it is their product and they shouldn't care where or how I legally purchased it. Shame on Intuit!",
      "rating": 5.0,
      "verified": true,
      "author": "Army Vet",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Used for years",
      "text": "I've read many complaints and both this year and last I wondered if it was time to move to something else but then stayed with Turbo Tax. Still pleased. This year I had a couple of problems. I called tech support both times. They were courteous, efficient, and both friendly and professional. There was no charge. I hate tax time, who doesn't. But unless things change, I'm staying with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Cat",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Great program, but, could not download this copy. I",
      "text": "The program downloads all of my bank and brokerage forms and automatically fills in schedules A, B & D and the 1040, and even looks at my credit card info for deductions. I had real problems with the downloading the program. I tried for about 2 hours to download the disk Amazon shipped and had continuing problems. Tried using the key to download on line and still had problems. Contacted Quicken about problem and the tech tried a number of times with the same problem even though the Key was valid. The tech finally gave up and downloaded the program with another key.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim S.",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Same great program at an even greater price online",
      "text": "This is the same TurboTax product I've been using for about 10 years straight without any issues. The customer service is always reasonable whenever I needed to call them. Using the CD or download on my own computer instead of online is a much cheaper solution, and can be used for multiple returns at the same price. This year the discounted price from amazon is better than I've ever seen before. Great buy, definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "p z",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Bad experience",
      "text": "I purchased turbotax disc and it came in a bulky case so I took it out of the case and tossed it not realizing they put a secret security code on the case. I called tech support and they were no help at all after over an hour on the phone! I wanted to get my taxes done so I went on line Turbotax finished and filed my taxes after spending another $80. Total cost this tax season $120.00. Next time H&R Block.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcus",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "NO LICENSE NUMBER PROVIDED IN PACKAGE",
      "text": "I ordered the TurboTax Deluxe version which I did receive, however on the online account it shows TurboTax Deluxe and State, which I don't need state as we have no state tax. It also stated when I installed on my PC, that I should have a license number which none is provided. There was nothing in the box other than the disc. Have been unable to reach customer service with Amazon also. Not very happy at the moment.",
      "rating": 3.0,
      "verified": true,
      "author": "Acey",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "TuboTax Deluxe Software",
      "text": "I have been using Turbotax deluxe for now many years. It has one state tax software included. I am impressed with the accuracy. It updates when I use it after a break. It remembers your basic info from one year to next year. But asks you to confirm if your info is still correct. Very easy to use. I am not going to switch. Moreover, I have been buying Turbotax at Amazon every year in January around 15th.",
      "rating": 5.0,
      "verified": true,
      "author": "Suresh R.",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Worse program ever",
      "text": "Turbo Tax doesn’t transmit client from last year. You have to enter client information from the scratch which is not good to use this program at all",
      "rating": 1.0,
      "verified": true,
      "author": "liliya altusskaya",
      "helpful_votes": 2,
      "publication_date": 20200114
    },
    {
      "title": "Problem with content updating of disc version",
      "text": "I have the disc version and am using it on an iMAC. I completed the entry of all data but could not print or e-file because I was told that some forms were not up to date and would be updated later! It is already Feb. 14th. There was no message at the opening of the session asking me if I wanted the updates downloaded. That is supposed to appear every time one opens the program. Where is that message? I am sure, for example, that the 1040 Form and Schedule B should already be available and updated but Turbotax said they were not! Help!",
      "rating": 1.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Easy to use except for sale of rental property",
      "text": "I've used Turbo Tax for decades. It has always handled all of our tax situations very well except for one. I found Turbo Tax's guidance regarding the reporting of the sale of a rental property insufficient , especially since I had used TT to report its purchase, income and expenses, and depreciation throughout the years. Other than that one situation, I have been very happy with Turbo Tax.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "First year I was not pleased with Turbo Tax",
      "text": "I usually do taxes for some family members free. Turbo tax has always been easy to use, until this year. Almost every time I hit enter, the app would disappear. I would have to click all apps, then click the Turbo Tax icon at the top where your frequent apps sit. Then I could go on for a while until I hit enter again. No other software was misbehaving, so I assume it was Turbo Tax itself.",
      "rating": 4.0,
      "verified": true,
      "author": "ronda hays",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Super easy to use!",
      "text": "This software is super easy to use. The only reason that I gave it four stars instead of five was that I had to pay additional fees for each state that I’m filing under as well as extra e-file fees as well. Bummer. It adds up.",
      "rating": 4.0,
      "verified": true,
      "author": "She who shall remain nameless",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Failed to download critical federal tax form",
      "text": "Failed updates: Federal Tax Forms (Critical) Failed to download from download.esd.intuit.com After the error Turbotax updater just got frozen and didn't react, I could not even close it. I cannot use it, what a disaster.",
      "rating": 1.0,
      "verified": true,
      "author": "Scratch Monkey",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "No Good on Windows 10",
      "text": "I ordered Turbo Tax for use with my Windows 10 PC. I tried 5 times to install and finally went into Properties in the install program and learned that it is only compatible with Windows 8 and lower. The advertising on Amazon said 8 and 10. It, of course, was not useable to me. I called Amazon and they were kind enough to extend the return period and send me a label for return.",
      "rating": 1.0,
      "verified": true,
      "author": "Lookylue",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Unable to download State",
      "text": "I am using Turbo Tax windows version from last 6 years. It is very easy to install and enter the information. However, I has lots of trouble using this version and customer service was worse. Each call was taking approximately 1 hours to discuss the issue and remote my laptop to debug the issue. However, they were not able to find the issue. The customer service was not supportive.",
      "rating": 3.0,
      "verified": true,
      "author": "Kinzz",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Back to the pencil and eraser",
      "text": "Using the disk version. After using this product, from CD, from Intuit since 2013 on the same laptop, failure found me. Did all the recommended changes, fixes, repairs, reloads, etc. No success. Before you suggest: I tried that too. Four spinning dots every time. Would not Activate. Support offered support. To no avail returned. May get download from site instead of disk.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle customer",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Absolute POS!",
      "text": "It's bad enough I need to deal with Trump's tax code screwing me and everyone else but now I have to deal with a completely worthless POS software tool that won't update, won't calculate my taxes and won't file my taxes like they are supposed to. Customer support? LOL- GOOD LUCK WITH THAT!!!! Send your money to H&R Block and use their software instead!",
      "rating": 1.0,
      "verified": true,
      "author": "Billy Rubin",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Easy to use and follow...",
      "text": "I use this Tax Program every year. I like the way it imports all your info from the previous year so you don't have to manually enter it all in again. You don't have to be a Rocket Scientist to use it. Everything is straightforward and easy to follow. So easy a Caveman could do it with confidence. I took advantage of the Free E-file for my Federal Return and paid the $19.99 fee to file my State Return. I received both of my refunds in about 4 weeks. I highly recommend this program.",
      "rating": 5.0,
      "verified": true,
      "author": "vettekid95",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Need LIC Key Activation and no issues with installation",
      "text": "Something new this year, you will need to key in the activation license key. After reading some reviews in install and activations issues, I just made sure that I followed everything during install and also made sure that I am connected to the internet, just in case internet connection it is required during activation. All went smooth during install and so far no issues in running the app. Since TurboTax now requires LIC key, I am assuming that you cannot share the software. Five star for now",
      "rating": 5.0,
      "verified": true,
      "author": "A. Bumanlag",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Use of Turbo Tax",
      "text": "Been using Turbo Tax for 10+ years, and is full of all current critical issues. With the downloading of current changes, provides confidence all will be correct. A good feature is bringing in last year's tax report, posting all previous years data makes it easier to do the current year. Is very simple to E-file. has a great ability to bring up forms and IRS regulations.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene L. McCormack",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Outdated application from the 90s",
      "text": "Same old moneymaker for Intuit. Instead of upgrading, they invest in lobbying everybody in the.govmint to use them rather than the govmint developing their own and providing it to taxpayers for (already paid for with taxes) \"free.\" Just think, you have to pay to pay income taxes. Perhaps the IRE would have to recover their own rules of interpretation of Congressional laws.",
      "rating": 2.0,
      "verified": true,
      "author": "Nobody",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "2019 SOFTWARE IS VERY DISAPPOINING",
      "text": "I have used Turbo Tax for at least the last 5 years. Incredibly disappointed with 2019. Software failed to pull 2018 W-2 data forward to 2019. Software and web take forever to load and respond. Site not available for updates on Sunday afternoon. Asked a support question and saw the wheel spin for 10 minutes. I gave up. Figured out W-2 issue",
      "rating": 4.0,
      "verified": true,
      "author": "foxy lady",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Never been audited using Turbo Tax",
      "text": "I use Turbo Tax every year and have never had a problem. I used to get audited every year when I went to H&R Block due to high medical bills and travel expenses back and forth with my kids to UCLA Children’s Hospital every 2 weeks. Since I started doing my own taxes with Turbo Tax I have not been audited! The program is so easy to use and puts my mind at ease. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Perkins",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Never More Disappointed",
      "text": "I have used TurboTax for years and have never been more disappointed than this year. Finished doing my taxes but it keeps telling me I need to update it before I can transmit. It is updated! It won't let me transmit no matter what I have done. Of course this doesn't happen until you've already paid to have the state transmitted! Did not see that others had this issue until it came up.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "As usual, TurboTax delivers",
      "text": "Other than one year a while back when Intuit tried to pull a fast one on its customers, TurboTax has consistently delivered good value. I was able to complete my 2019 federal and state returns in under 45 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Harley Mike",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "State e-file not included",
      "text": "I have been using Intuit TurboTax for many years. It does what it's job well. However, for the Deluxe price Intuit should include e-filing of one state tax return. Instead they charge $25. Printing the state tax return and sending it by mail costs less than a dollar and takes less than five minutes. Help pop-ups are hard to read due to their small type size.",
      "rating": 3.0,
      "verified": true,
      "author": "omarf",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Disc would not load but used serial number for digital download",
      "text": "When trying to install this (tried various PC's) it would error out saying it couldn't find the Windows Installer file. Luckily I was able to get it from Intuit via digital download and use the serial number in the box for activation. People should be aware there is an issue with the CD. Instructions for downloading the program are included in the box.",
      "rating": 3.0,
      "verified": true,
      "author": "BrokeDad",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Won't do my state return",
      "text": "Everything went pretty much as always doing my federal return. Starting my state return was a different story. It went into a loop. It would never let the return start. Called support and after about 30 minutes I was told it was a problem at their end and would be fixed in several days. That was weeks ago. Not next year. Time to try a different preparer.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "CD requires an internet connection to work, new feature for 2019 . Zero Star Review.",
      "text": "I have been using turbotax for over a decade. I always buy the CD then download the manual update and install that. This year however, for the first time, intuit has decided to make their software even more unusable and difficult by requiring an internet connection to \"activate\" the software I just purchased and am holding in my hand. WTF?",
      "rating": 1.0,
      "verified": true,
      "author": "CraigO",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Intuit Turbotax Warning: You must agree to let them use your personal information and share/sell it.",
      "text": "I chose to (after reading the fine print in the agreement to use the software) NOT agree, or use Turbotax! Buying a product to use and then you must allow the company to use personal info is outrageous! I doubt they will allow this review, but in case it gets by them, I wanted to warn anyone to carefully read the agreement before you do it.",
      "rating": 1.0,
      "verified": true,
      "author": "lawbax",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Generally helpful but not perfect",
      "text": "I have used this software for years, it sure beats doing it all by hand. But the software is set up to make it very difficult to submit the State through the mail, they want that 20. for doing it through the software. Since I send a couple pages of print and one wage statement, that is ridiculous. This year I couldn't even find the option, I think it's either very buried or taken away. I think I may try a different product next year.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth A",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Surprised it worked so well",
      "text": "My computer is over 10 years old and no recent upgrades either. I was expecting problems but everything went smoothly and I already received my return, about 3 weeks after filing. Lots of warnings from Microsoft about unsupported software while loading this new version, but I bypassed all that and went for it anyway. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "catjp",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "As expected from TurboTax",
      "text": "Easy to use with both tech and tax support from Intuit. I've used TurboTax for about 20 years and it has always made my taxes easy and correct. The only issue I've ever had was when it downloaded my W2 after it was manually entered - without me knowing, resulting in having to file an amended return. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "TimG45Top Contributor: Woodworking",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Beware Windows 7",
      "text": "Could not get this to work properly on my Windows 7 pc,despite being told that 2019 Turbotax would still work on it and seeing other successful reviews. It kept crashing multiple times throughout the tax return process, and I finally had to use a family member's Windows 10 where it worked flawlessly.... Disappointed and it was a huge inconvenience.",
      "rating": 2.0,
      "verified": true,
      "author": "Tia B",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Still Like Using TurboTax",
      "text": "Call me old fashioned but I still like having my own software to install and use. Updating was a bit of a challenge as it regularly would not update due to a reported conflict with the windows installer. I guess timing is everything as eventually it would update. Had updating not been such a pain I'd have given a 5 star rating.",
      "rating": 4.0,
      "verified": true,
      "author": "AMJ",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Added TWO MILLION DOLLARS to my income due to software calculation glitch",
      "text": "After years of using TurboTax on this and other computers, this software kept recalculating my income to add over 2 million dollars to what I was supposed to have gotten. Wow, we don't make it to even a fraction of one million dollars. Called TurboTax who said it doesn't play well on Macs, but now I have missed the return window. GRRRRRR",
      "rating": 1.0,
      "verified": true,
      "author": "LibraryRose",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "It's turbo tax.",
      "text": "We have used Turbo Tax for over a decade. I am pleased with the product. Amazon is as good a place to get it as any. I bought the actual disc. I don't know why I didn't buy the digital download copy, I should have, better for the environment, and I would not have had to spend and hour looking for it when I misplaced it after I received it.",
      "rating": 5.0,
      "verified": true,
      "author": "TLMKC",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Very Helpful",
      "text": "Turbo Tax is a great Tool to do taxes. Note that fix in being able to save tax file to external media was taken away in this version (backwards). Also, explanation of and options in RMD for those Pensions which are non-contributed to by the employee, are deemed qualified, but really have no way to calculate a RMD and are paid monthly...",
      "rating": 4.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "RETURN",
      "text": "I WOULD LIKE TO RETURN THIS TURBO TAX. IT SAYS THAT THE RETURN WINDOW IS CLOSED BUT THE SEAL HAS NOT BEEN BROKEN AND NEVER OPENED OR USED. I HAD A VERY GOOD FRIEND OF OURS DO OUR TAXES AND HE DID NOT NEED TO USE THIS. I COULD REALLY USE THE $40. THESE ARE VERY HARD TIMES AND EVERY BIT HELPS. CAN ANYONE HELP ME WITH THIS.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "This TurboTax edition includes one state, but itrquires a code, which was not supplied.",
      "text": "This version of TT is advertised as including a state return, but TurboTax requires a code to enable the STATE Return which they say must be supplied by Amazon. No code was supplied to me, and TT will not allow me to file the state return. TurboTax Tech Support references their help location, which does not address this problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Philip Schipsi",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "DO NOT BUY FROM THIS SOFTWARE!!!  (or from this VENDOR !!!!!!!!!!!!!!!!!!!!!!)",
      "text": "This software can be downloaded from Turbo Tax/Intuit's website and it will let you create an account as part of the process. Once you purchase the disc from this vendor and load the software it will automatically run with out having you create an account. So if you have issues with the software you have no standing with Turbo Tax and you'll have to repurchase the software. AND.. the only free filing you can do is the federal form. The state form which needs a Turbo tax download now costs $24.99.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Norton",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Disappointing this year",
      "text": "I've used TurboTax for 15+years without a problem. This year was not so much. My federal return was rejected because of a line item that was automatically inserted and I couldn't change the number so couldn't e-file. Not a disaster, but part of the reason I buy TurboTax is for the e-filing. Then a friend's state return was flagged that a Senior discount had been claimed that shouldn't have been. There is no penalty, but it was upsetting to get a letter when we assumed things were done correctly. just a discouraging year. probably will try again, but disappointed in a product i have come to trust.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Nice product but very expensive compared to free alternatives",
      "text": "This has always been a great product, but was a great product at 1/2 the price just a few years ago. There are free alternatives, but the main advantage is loading most of the data from previous years, plus the walk-thru guidance. I do really like the product but feel they have gotten greedy and are simply gouging us for more money.",
      "rating": 3.0,
      "verified": true,
      "author": "Wayne in Indy",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Great product",
      "text": "I have been using Turbo Tax for a long time and always found it easy to use. I have used it for personal taxes and for my small business when I had it. The Guide Me feature walks you through all the income and deductions and keeps it simple to understand and follow. The review section checks for errors and lets you go back and correct them simply and easily. I highly recommend Turbo Tax at what ever level you may need it.",
      "rating": 5.0,
      "verified": true,
      "author": "gmnblues",
      "helpful_votes": 0,
      "publication_date": 20200303
    }
  ],
  "product_meta": {
    "title": "TurboTax Tax Software Deluxe + State 2019 [Amazon Exclusive] [PC/Mac Disc]",
    "description": "TurboTax Deluxe is recommended if you own your own home, donated to charity, have significant education or medical expenses, have child-related expenses or have a lot of deductions. TurboTax is tailored to your unique situation-it will search for the deductions and credits you deserve, so you're confident you'll get your maximum refund • TurboTax coaches you every step of the way and double checks your return as you go to handle even the toughest tax situations, so you can be confident you're getting every dollar you deserve. • Every year it gets even easier. As a returning customer, TurboTax will automatically transfer last year's data to help ensure accuracy and save you time • Up-to-date with the latest tax laws-so you can be confident your taxes will be done right. • Help along the way-get answers to your product questions, so you won't get stuck. • Your information is safeguarded - TurboTax uses encryption technology, so your tax data is protected while it's e-filed to IRS and state agencies",
    "rating": 4.6,
    "feature_bullets": [
      "TurboTax Deluxe + State is recommended if you own your own home, donated to charity, have significant education or medical expenses, have child related expenses or have a lot of deductions and need to file a federal and/or state income tax return",
      "Deluxe + State will accurately deduct mortage interest and propery taxes. Get your taxes done right and tailored to you, based on your unique situation.",
      "MAXIMUM TAX REFUND - Searches for more than 350+ tax deductions and credits, including mortgage interest, property taxes and energy-efficient improvements, to get you everything you deserve",
      "TAXES DONE RIGHT - TurboTax guides you through your tax preparation, keeping you up to date with the latest tax laws and double checking your entries along the way.",
      "Includes 5 free federal e-files and one download of a TurboTax state product ($44.99 value) state e-file sold separately",
      "Exclusively at Amazon, receive a free 1 year subscription to Quicken Starter Edition ($34.95 value) with your purchase of TurboTax",
      "Free U.S. based TurboTax product support via phone",
      "TRACK YOUR DONATIONS with Its Deductable from TurboTax- Turn charitable donations into big tax deductions",
      "SAVE TIME- Automatically imports financial information including W-2s and mortgage information as well as imports prior year tax return information from TurboTax and other tax software."
    ],
    "specifications": {
      "Product Dimensions": "5.4 x 0.7 x 7.5 inches; 3.68 Ounces",
      "Item model number": "607313",
      "Date First Available": "November 5, 2019",
      "Manufacturer": "Intuit, Inc.",
      "ASIN": "B07Y6166JJ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Tax Preparation",
      "Software"
    ],
    "price": ""
  }
}