{
  "website_summaries": [
    {
      "verdict": "The Etnies Cartel displays simplicity packed with comfortable and durable elements fitting for onboard abuse. Many reviewers praised its puffy design that provides ample cushioning and the premium craftsmanship for lasting sneaker life. Few skaters also lauded its reliable grip that allows them to have better control of the board. Overall, the Cartel exhibits elements that will elevate one's skate performance and street fashion style while staying affordable.",
      "pros": [
        "The Etnies Cartel is found at a wallet-friendly price range",
        "The majority of the reviewers shared that the Etnies Cartel is exceptionally comfortable",
        "A couple of buyers mentioned that this pair has reliable durability",
        "The board grip is superb, shared few skaters",
        "Several wearers praised the high-quality materials applied to this footwear",
        "The excellent cushioning of the Etnies Cartel has been cited numerous times in the reviews",
        "This pair is offered in various colorways",
        "Several respondents highly recommended this footwear",
        "This sneaker runs true to size"
      ],
      "cons": [
        "The Etnies Cartel is a tad narrow for few reviewers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.0,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Narrow toe box, and fits \"short\"",
      "text": "Bought these for enduro riding w/ flats. Look ok, and constructions seems fine, but they fit small (toes touched the front of the shoe) and the toe box is really narrow. Sadly, back they go.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael M.",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Tight squeeze",
      "text": "The shoe most have changed, these use to fit my fat toes. Not anymore. I would recommend getting a size up or a different brand. They fit alright when nearly untied.",
      "rating": 4.0,
      "verified": true,
      "author": "D. lingerfelt",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great comfortable design.cool look.",
      "text": "I love this pair of sneakers they are my everyday sneakers ever since I first put them on I haven't wear another pair of shoes,stylish comfortable great look. Perfect overall.",
      "rating": 5.0,
      "verified": true,
      "author": "David R Leazard",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Good quality, but run about 1/2 size small.",
      "text": "The Product Details said \"True to size. Order usual size\", but they would go on easier if I had ordered a half size larger. Otherwise, they are comfortable and otherwise as I expected. Decent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom C.",
      "helpful_votes": 0,
      "publication_date": 20201025
    },
    {
      "title": "amazing fit",
      "text": "they fit amazing and feel great on my foot well worth it",
      "rating": 5.0,
      "verified": true,
      "author": "amber",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Nothing beats the feel of a good skate shoe",
      "text": "Ordered these because I hadn't bought myself a pair of skate shoes in nearly a decade. Just as comfortable and stylish as I remember.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikoul",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Made in Vietnam",
      "text": "Tongues are too thick and hurt too of foot. Don't know if that will ever go away.",
      "rating": 5.0,
      "verified": true,
      "author": "Murphy day",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Not bad but know your foot size",
      "text": "Not bad but need to break them in...a little small",
      "rating": 3.0,
      "verified": true,
      "author": "Abdahl Price",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Too narrow",
      "text": "They look good, but they're too narrow. I have other Etnies shoes that steal extremely comfortable. Not these. Hopefully they break in.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen Applegate",
      "helpful_votes": 0,
      "publication_date": 20201117
    },
    {
      "title": "Great shoe but a full size too small",
      "text": "The Ethies Marana Michelin Is one of the best skateboard shoes on the market, but be aware they run a full size smaller than most other shoes. Order a full size larger and you will be happy.",
      "rating": 5.0,
      "verified": true,
      "author": "adam brody",
      "helpful_votes": 0,
      "publication_date": 20201116
    },
    {
      "title": "Good traction",
      "text": "Bf said they fit a lil tight but they grip his board great and seem pretty durable. As long as he's happy I'm happy",
      "rating": 4.0,
      "verified": true,
      "author": "Diamond Cordero",
      "helpful_votes": 0,
      "publication_date": 20201103
    }
  ],
  "product_meta": {
    "title": "Etnies Men's Cartel Skate Shoe",
    "description": "The cartel is one of the latest additions to the Etnies footwear family. With a sharp, fast and clean design on a new 300 NBS rubber cupsole, the cartel features the trademark Etnies arrow logo, beveled edge for extra style, and STI foam lite level 1 foot bed and padded tongue and collar for comfort and protection.",
    "rating": 4.5,
    "feature_bullets": [
      "Leather and synthetic",
      "Padded tongue and collar for comfort",
      "Sole: Gum Rubber",
      "Closure: Lace-Up",
      "Shoe Width: Medium",
      "Heel pull for easy entry"
    ],
    "specifications": {
      "Date First Available": "11 Mar. 2020",
      "Manufacturer": "Etnies",
      "ASIN": "B085SK9RJ8",
      "Item model number": "4101000402",
      "Department": "Men's"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Shoes",
      "Fashion Trainers",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 100.73
  }
}