{
  "website_summaries": [
    {
      "verdict": "Moongo gets points for the most stylish universal socket wrench, and since you are guaranteed to remove anything it can fit in its socket, it is as useful as it is pretty.",
      "pros": [
        "Fits standard 1/4\" to 3/4\" nuts and bolts",
        "Affordable",
        "Durable",
        "Adapts to power drills for lightning-fast jobs",
        "Available in blue, red, and silver"
      ],
      "cons": [
        "This socket features a relatively shallow head"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Total LETDOWN. (Period)",
      "text": "I saw a similar product on YouTube so I thought I hit the jackpot when I came across this one. WRONG. It looks nice. It feels nice. It doesn't work. Why? When you place the socket over the bolt you're going to tighten/loosen--especially if it's not perfectly centered--it wobbles which drives the bolt crooked and leaves it with damaged threads. This is a total gimmick!",
      "rating": 1.0,
      "verified": true,
      "author": "Rene2.0",
      "helpful_votes": 21,
      "publication_date": 20190831
    },
    {
      "title": "Not for heavy duty applications",
      "text": "For light tightening and loosening of variously-sized bolts in household or automotive uses this might be ideal. In my case I was attempting to free a bolt with rounded flanges from farm machinery and this wasn’t the right tool for it - it snapped on first use. The 5 star rating is for the company’s excellent customer service: I received a full refund, no questions asked.",
      "rating": 5.0,
      "verified": true,
      "author": "RCW",
      "helpful_votes": 82,
      "publication_date": 20180919
    },
    {
      "title": "Worked as well as expected",
      "text": "Held up under heavy use on an electric impact for 6 months. I am a garage door technician and often come across odd hardware used by home owners and or maintenance men to patch doors back together. This socket grips just about anything that it fits over.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20180726
    },
    {
      "title": "Useful",
      "text": "I was surprised that this has been so convenient. It's not good for everything and once I had a bolt get stuck inside which was a pain to get out but for the most part it's more convenient than finding the right size in my socket set and on one old rusted bold that I couldn't get removed with my craftsman regular socket set, this thing actually got the job done. I've given a couple away as gifts as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 11,
      "publication_date": 20180807
    },
    {
      "title": "Just a joke...Update!!!!",
      "text": "This is like one of those tv gimmick tools that they say will work but if you put any weight on it it will break. Just don’t plan on using major torque. Update***** The company contacted me and sent me a new tool even after I received my refund. Now this is great customer service. Bravo to this company! This is how you treat issues. We are going to try it on other things!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Young",
      "helpful_votes": 66,
      "publication_date": 20191112
    },
    {
      "title": "perfect socket for I or J hooks wingnuts",
      "text": "Great socket to use to drive in I or J hooks into ceiling studs. This socket uses rods to fit around different shaped objects. I used it to install I hooks into ceiling studs to hang a hammock on the porch. It worked great and got the I hooks into the beams just as fast as using a socket to tighten a regular bolt. This socket should work on all types of odd shape bolts and even small wingnuts. Great socket to have in your took box.",
      "rating": 5.0,
      "verified": true,
      "author": "Robotica Industries",
      "helpful_votes": 65,
      "publication_date": 20190531
    },
    {
      "title": "A must have! For the homeowners toolbox!",
      "text": "I bought one of these years ago and it was such a handy tool to have, unfortunately somebody swiped it , and I’ve never been able to find another one! So happy I looked on Amazon and found a replacement, this one is actually much more high-quality than the last one I owned! I am so impressed with the value for the money! And most importantly it works! No more fumbling around for different sizes! You’ve got them all right here!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara CT",
      "helpful_votes": 60,
      "publication_date": 20191030
    },
    {
      "title": "Love it",
      "text": "Got this for my spouse. And it has come in handy a couple of times. especially when we have to switch between two head bits. I can use just this one and not have to switch. my husband has been very appreciative of this that I got it for him. I gave it to him as a gift for Christmas last year",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 61,
      "publication_date": 20191025
    },
    {
      "title": "Great multi tool and an excellent gift for the handy ...",
      "text": "Bought as a gift for my husband he loves it and uses it all the time. Great multi tool and an excellent gift for the handy person in your life",
      "rating": 5.0,
      "verified": true,
      "author": "marykay",
      "helpful_votes": 67,
      "publication_date": 20170813
    },
    {
      "title": "Came scuffed up",
      "text": "I bought this as a gift. I opened it to look it over before I wrap it, and to my surprise its scuffed up! How can I give this as a gift when it looks like its rolled around under someone shoe? I can't say anything about usage as its not been used, at least not from my end.",
      "rating": 3.0,
      "verified": true,
      "author": "LadyG",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Nice product, overtly sexist description",
      "text": "I bought two: one for a gift and one for me. I'm 100% female/woman. I strongly object to their overtly sexist description, and almost didn't buy the product because of it: \"2 of Christmas Gifts for Men - Gifts for Dad from Daughter or Son, Unique Personalized Dad Gifts, Universal Socket 7mm-19mm Gifts for Men, DIY Handyman, Father/Dad, Husband, Guys, Him\" The company needs to know that this is 2020, not 1920.",
      "rating": 5.0,
      "verified": true,
      "author": "Merry K.",
      "helpful_votes": 59,
      "publication_date": 20200212
    },
    {
      "title": "I object to the product description",
      "text": "This looks to be high quality- haven't used it yet; bought it to get to free shipping and because I know I will soon when assembling my patio gazebo; no more fishing around in the socket wrench box to find the right size- metric or standard? My biggest beef is in calling this a \"gift for men\"! Really? What century are we in? Geez.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon woman",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Not for hurricane shutter wing nuts",
      "text": "Got this LONG before the 2019 hurricane season so I could easily install my shutters. Wish I'd have taken the time to check the fit. The typical wing nut for my shutters is far too large for this tool.",
      "rating": 3.0,
      "verified": true,
      "author": "GentlemanJames",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Cool idea, Not really feasible",
      "text": "Edit**** uhm, so they off the wall sent me two more of these to make up for the ones I originally bought... which was a super nice gesture and great customer service. We shall see if these are any different I’ll update my review when I use them. I really liked the idea of this but once it go put to work the pins seemed to not be able to hold up to a simple bolt. it was worth a shot! I wouldnt get this for anyone who does major or even light mechanical work or you might get laughed at lol",
      "rating": 3.0,
      "verified": true,
      "author": "Mckenzie Dayhoff",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Worked on jammed nut on lawn edger",
      "text": "Bought this months ago and just started using it after buying an impact driver. Wow! zipped a reverse thread nut off a lawn edger first try AFTER I had used cheater bars and heat without sucess. Drives lag bolts effortlessly. Love it! Yes I was righty loosey on the nut since their reverse thread.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 59,
      "publication_date": 20200507
    },
    {
      "title": "Disappointed",
      "text": "First time I used this product and I couldn’t even unscrew a finger tightened nut. Had to use a wrench to loosen it before I could get the nut out with this product which made no sense to me. Whole assembly wobbles and loosens it’s grip most of the time. This product had so much potential but really failed when put to the test. Sorry",
      "rating": 2.0,
      "verified": true,
      "author": "mymp:)",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Save the frustration, this makes life so much easier",
      "text": "My boyfriend was always asking me to grab this size or that size and 90% of the time I grabbed the wrong thing! Well I purchased this and just hand it over and IM done! No more digging around the old tool box to find the right piece! He has a huge tool box with several of each size, some newer and some worn so I never knew...this way it ALWAYS FITS!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 59,
      "publication_date": 20191015
    },
    {
      "title": "Works great as long as you center it",
      "text": "This works good as long as you center it on whatever your driving in. If, for instance, your using it on a 7/16” bolt head make sure it is perfectly centered on the bolt head or it will wobble all over the place",
      "rating": 3.0,
      "verified": true,
      "author": "Josh Mooney",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great in a pinch.",
      "text": "Obviously it's not going to take the place of your socket set, but a great choice in a pinch. Can be used for a ton of different sizes, mine came with an attachment for my drill. Well build, the pins are nice and tight and springy. Been wanting one for years, it's a great addition to my toolbox.",
      "rating": 5.0,
      "verified": true,
      "author": "MeMe69",
      "helpful_votes": 59,
      "publication_date": 20191017
    },
    {
      "title": "Great tool but be careful",
      "text": "This was great for car maintenance and removing direct tv satellites on the side and roof of my house. where it finally failed was trying to remove an old bolt in a porch, the bolt was too strong but would definitely buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "OneTeamIT",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Works great for a Short while",
      "text": "I bought two of these and broke two of these after time the pins do not retract fully back to the resting position and kinda get stuck inside the socket. Thus making it loose when grabbing bolts because it doesn't have the full grip on it. So good for a short term solution however i wish it had more then a 1 year warranty",
      "rating": 2.0,
      "verified": true,
      "author": "Mark K",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Great tool for anyone that has drill bits",
      "text": "I bought one for my husband and future son in law and they were shocked that it worked so well. The only thing they both agreed was that they wish there wasn't a gap they had to use a regular screwdriver or drill to get the screw all the way in. But it's a handy tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Dozard",
      "helpful_votes": 30,
      "publication_date": 20191213
    },
    {
      "title": "Works great for a multitude of things",
      "text": "I bought this for my husband because the previous owner of our house didn't appear to know how to drill a screw into a wall without stripping it. We're currently renovating our garage/shop and have never needed something like this more. It's good quality and has already helped keep us from pulling our hair out! Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Letsread",
      "helpful_votes": 59,
      "publication_date": 20191023
    },
    {
      "title": "Very Convenient",
      "text": "This Universal Socket has made all of my self installations a whole lot easier! The seller is very understanding and didn't give me a difficult time with the help I needed. They were pretty quick with their responses as well. I would say that buying this product and the support from the seller have been my best experience on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 59,
      "publication_date": 20200405
    },
    {
      "title": "Great for Most Anything",
      "text": "I lost my 12mm wrench bit while doing a hybrid battery swap on my 2008 Prius and this one-size-fits-all general wrench tool saved my ass. It does have a weakness, though. It can only work when it is touching a screw or bolt directly. Not on knuts that are halfway down a long screw.",
      "rating": 5.0,
      "verified": true,
      "author": "mathew",
      "helpful_votes": 59,
      "publication_date": 20200130
    },
    {
      "title": "Durable Gift",
      "text": "This is an awesome product! Bought this for my dad for Christmas as he has every tool imaginable. This seemed like something my dad could definitely benefit from, he hadn’t seen anything like this before.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Sotelo",
      "helpful_votes": 59,
      "publication_date": 20200502
    },
    {
      "title": "Doesnt work well",
      "text": "Didn't really work as we expected unfortunately. UPDATE: The seller has sent us a new item without us contacting them. Their customer service is absolutely excellent, however, the product still does not work as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittanie S",
      "helpful_votes": 2,
      "publication_date": 20180815
    },
    {
      "title": "Works as advertised. Worth the price",
      "text": "My husband keeps this in as part of his tool set at work and it gets used fairly often. He says it works well, as long as you get the tool centered so it doesnt wobble. Not a deal breaker, though, definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle L",
      "helpful_votes": 59,
      "publication_date": 20191209
    },
    {
      "title": "My go to, when its not 3/16 or 5/16",
      "text": "I got this for stripped bolts, and metric bolts, that my vastly inferior and impractical imperial set can't torque without holding at an angle I find myself reaching for this for anything it fits other than 3/16 and 5/16. Maybe this socket, will be the bridge to breaking the US from this aweful imperial system we learned from you silly brits.",
      "rating": 5.0,
      "verified": true,
      "author": "Irvine",
      "helpful_votes": 29,
      "publication_date": 20180618
    },
    {
      "title": "Very nice product. Got this as a stocking stuffer for ...",
      "text": "Very nice product. Got this as a stocking stuffer for my husband. He loves it. Says it works well and functions smoothly.",
      "rating": 5.0,
      "verified": true,
      "author": "mari franks",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Very small investment for a great tool.",
      "text": "This is a great tool to have in your house. I keep it inside my junk drawer. You never know when you may need it. It works really well and you will be very pleased with the delivery of it. Excellent price was ship fast highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "The guys loved it",
      "text": "I bought 3 for Christmas gifts for my handy guys. They were pleased and said it would be a great addition to their tool box for those frustrating fixes that require something out of the ordinary!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn S Setter",
      "helpful_votes": 30,
      "publication_date": 20200105
    },
    {
      "title": "Really cool!",
      "text": "The forst time i went to use this i thought it didnt work and i wasted my money. But it does work it just spins as it works it doesnt stay in one place like a regular dits on a drill.",
      "rating": 5.0,
      "verified": true,
      "author": "jen",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great small tool! Excellent gift fdr Dad!!",
      "text": "This little tool is a great addition to any toolbox. Got it for my father for Christmas and he loved it!! Come in very handy when doing work on any car or any other DIY projects. Eliminates the use for multiple bits.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Nifty universal gadget.",
      "text": "Not needed for actual project yet, but tried on a few things as seen in review videos. Works well, hasn’t slipped off.",
      "rating": 5.0,
      "verified": true,
      "author": "She who thoroughly reads all reviews before purchasing even if there are 3,557",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great idea",
      "text": "Comes in a really nice box and is painted or powder coated, I wish I had the paint on my vehicles. A beautiful item and an excellent idea. I gave one to my son as a gift, everyone loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 30,
      "publication_date": 20191226
    },
    {
      "title": "Convenience",
      "text": "I received a replacement to my surprise, what great customer service! The pins set appears to be different and should take bigger nuts. I won't have to keep changing sockets as this works as it says",
      "rating": 4.0,
      "verified": true,
      "author": "paula west",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Works with cordless drill or cordless screw drivers as well as a ratchet.",
      "text": "This a great product, I bought for gifts but I like them so much I kept it for myself and got them something else 😂",
      "rating": 5.0,
      "verified": true,
      "author": "john wlaskolich",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Hassle free bolt removal and fast !",
      "text": "For the price this is a sweet addition to any tool set a must grab ,helps on those jobs you want to speed up bolt removal",
      "rating": 4.0,
      "verified": true,
      "author": "M puente",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good product for a good price",
      "text": "This product helped my problem with a bolt the have just half of the head,after so much ware and tear.",
      "rating": 5.0,
      "verified": true,
      "author": "armano aceves",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Giftable for men or women",
      "text": "Just like the ad says! This thing is very versatile! Very giftable to the man that has everything or to the woman that needs some help with those extra projects.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsMick",
      "helpful_votes": 30,
      "publication_date": 20200113
    },
    {
      "title": "Great help for female.",
      "text": "I bought this for myself. I am not familiar with tools so one of my male friend suggested me this universal socket. I do most of the fixing in the house. It helped me a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "HANNIE",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Convenient",
      "text": "Smaller than expected, but makes it alot more shareable. Great little gizmo to have in a pinch.",
      "rating": 5.0,
      "verified": true,
      "author": "Polarfrog",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Don’t waste your money",
      "text": "This broke About 3 minutes in to the first use. Was using to drill in some small hooks to hang Christmas lights. Worked great on the first 2 hooks and then the insides of it started to fall out on the 3rd hook",
      "rating": 1.0,
      "verified": true,
      "author": "Douglas Barnes",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Very versatile",
      "text": "I did not have to go looking for the write size socket just put it on and started working. Draw back it is only one size/length in tight spot not so useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Donneta Wolfe",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "It works as advertized but...",
      "text": "It works exactly as advertised. Unfortunately it has a very shallow depth so I have had very few opportunities to use it practically. A deeper tool would be on my daily work list.",
      "rating": 3.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "My dad loves it",
      "text": "So far we have no dislikes my dad is a handy man so a gift like this was ideal deff would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "mikaeel nasser",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great for light duty",
      "text": "Quick delivery, Units the coolest thing. Grab it and it fits like a glove over all kind of nuts. But, feels a bit weak. Like if I would brake it if a bolt was stuck. I'm afraid to give it a hard stuck bolt to bust off.",
      "rating": 4.0,
      "verified": true,
      "author": "Tedd G, Las Vegas, NV",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "cool stuff",
      "text": "I gave it as a gift, my father seems to like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tracie Hoffmann",
      "helpful_votes": 2,
      "publication_date": 20171113
    },
    {
      "title": "Unusable",
      "text": "Virtually useless unless the bolt doesn’t come through the nut more than a quarter inch.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph C.",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "WOW replaced and works perfectly",
      "text": "Very please after my 1st review I was sent a replacement and it has worked flawlessly. Thank you very much.",
      "rating": 4.0,
      "verified": true,
      "author": "Leon A.",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Appears to be well made.",
      "text": "I bought this socket with the expectation that I will have need for it in the future. It appears to be well made, but I have not yet had the opportunity to use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil H",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Best Christmas Gift",
      "text": "I bought this for my boyfriend for Christmas this year and it was his favorite gift. He can't wait to use it and showed it off to everyone",
      "rating": 5.0,
      "verified": true,
      "author": "SHAYBAY81",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great shop gadget",
      "text": "These were gifts for my men at Christmas they all loved them, had to order more for extended family members",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Ok for the price",
      "text": "Works well as expected for the price. Good for small jobs, but would not use for anything that requires lots of torque.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "its okay",
      "text": "Works okay, but would not recommend this if you need high torque, or for use in a drill. I used it to install a TV and had to revert back to regular sockets to finish. Also it is not deep.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Shimeld",
      "helpful_votes": 2,
      "publication_date": 20170726
    },
    {
      "title": "Useless",
      "text": "It does not work like it says. Bought as a gift for my dad and it doesn't grab anything.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley ",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Good",
      "text": "Bought as gift for friend. He loved it but I noticed it was a bit stiff.",
      "rating": 3.0,
      "verified": true,
      "author": "Haydee",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Looks nice!",
      "text": "Have an actually tried to use it as of now it’s OK. If it ends up being horrible I’ll come back and let you know",
      "rating": 5.0,
      "verified": true,
      "author": "Geniee Bliss",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "loved it",
      "text": "got this for my dad for his birthday and he loves it. great little gift",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie S. Lively",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Pretty neat idea",
      "text": "I bought four of these for Christmas last year. I don't know how much the guys use them, but they're really cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Cox",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "A homeowner need one",
      "text": "I love the universal socket, it is a girl’s best friend. We, me speaking for women don’t have time to figure out what size socket is needed. We just need it to fit and this takes all the guess work out of tightening or loosening something.... I LOVE IT!!!! And yes I have open end and closed end sockets but I reach for my universal socket first",
      "rating": 5.0,
      "verified": true,
      "author": "Shanaii",
      "helpful_votes": 29,
      "publication_date": 20190208
    },
    {
      "title": "Great DJ tool",
      "text": "I go this to replace a missing socket, but it was not deep enough. BUT however it works great for my husbands DJ tool box! It is only about a half inch deep. Very valuable for any tool box",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette Lee",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Strips the edges of the nut or bolt making it useless for other tools to work, p o s.",
      "text": "Has not worked on most of my fastener nuts or bolts, it strips the edges making them useless, i really wanted this tool to work on my jobs but it made it worse. Return window is closed now, do not buy this!",
      "rating": 1.0,
      "verified": true,
      "author": "Araudio",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Perfect tool",
      "text": "This too l comes in a great box so that it is easy to gift. It is the perfect one size fits all tool for adjusting bolts.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle L.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "NOT as shown",
      "text": "I was expecting the item to be Blue, as I am the only female mechanic and the \"other 3\" like to go \"shopping\" in others toolboxes. Therefore, all of my tools are colored so I KNOW if it's mine. This is chrome. Which is fine, but now I'll have to spend more and purchase one that is \"as described.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Candy",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "A tool box must have",
      "text": "I got one for both of my sons and I know they will be a great asset to their toolbox. They think it is the cats meow.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Monroe",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Not for REAL hard jobs",
      "text": "Not strong, only good for easy jobs. Tried to pull a bolt out that's real stuck and it tore the bit apart",
      "rating": 2.0,
      "verified": true,
      "author": "Friendly Stoner",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "works?!?!?!?!? so far so good",
      "text": "Seems to work so far! WE are all excited to test it further!",
      "rating": 5.0,
      "verified": true,
      "author": "ptl4now",
      "helpful_votes": 32,
      "publication_date": 20180101
    },
    {
      "title": "Comes in a nice box",
      "text": "Bought this as a gift. It comes in a box and looks really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon R. Carpenter",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Universal socket",
      "text": "Doesn't fit bolts fitted to nots more than 1cm high",
      "rating": 3.0,
      "verified": true,
      "author": "kolo",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "The wrench is not worth the added expense",
      "text": "The socket seems to be okay but the wrench locks up and nearly falls apart with light use. You get what you pay for I guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great gift",
      "text": "It seems like a wonderful product. Made well and durable and heavy. I liked this in the red color. The only reason I gave it four stars is that it was a gift so I did not use it and not able to rate on how well it works. Everything else I know about it was wonderful.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Gift for dad",
      "text": "He says it is handy but not of the best quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Satisfied",
      "text": "The quality of the socket is good, it's not a deep socket though. I have only used this for a short while and so far no problems even after falling off the roof. Comes in a nice box. Fast shipping and the warranty is above par. I'm satisfied with the price and would recommend this universal socket.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy Crandall",
      "helpful_votes": 7,
      "publication_date": 20180218
    },
    {
      "title": "My son loves it.",
      "text": "Not sure how well it works but he likes it!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggylea Thompson",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "You love tools , must get this!",
      "text": "Came in a nice little box and it work just like it say. It’s a great gift for Father’s Day or a man the is handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Digna Torres",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Two Stars",
      "text": "It feels fragile, and you cannot do things with it that require a lot of torque.",
      "rating": 2.0,
      "verified": true,
      "author": "Andy H.",
      "helpful_votes": 3,
      "publication_date": 20170609
    },
    {
      "title": "Junk",
      "text": "Works like crap broke the first time useing it on 1/4 inch wing nut",
      "rating": 1.0,
      "verified": true,
      "author": "adam",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Great",
      "text": "Great Gift! Got it for the boyfriend! He likes it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bex Russ",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "He liked it!",
      "text": "Hubby loved it, was intrigued when he opened it... score 1 for the wife....",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Not that great",
      "text": "Not that great, I have tried to use it a couple of times and it slips around the bolt head. Not empresses so for",
      "rating": 3.0,
      "verified": true,
      "author": "PapaJoe",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Amazing tool!",
      "text": "My dad loved this. I have to admit I have to use it before I gifted it to him. I mean I would have wanted to give him something that did work right?! Hahaha anyway it’s a great product. Now I have to get myself one!",
      "rating": 5.0,
      "verified": true,
      "author": "ADAM HERENDEEN",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "IT WILL NOT TIGHTEN NUTS ONTO BOLTS. THE PINS ...",
      "text": "IT WILL NOT TIGHTEN NUTS ONTO BOLTS. THE PINS DON'T RECEDE DEEP ENOUGH. IF YOU NEED TO ONLY GRAB THE HEAD OF YOUR BOLT IT KINDA WORKS. NOT IMPRESSED",
      "rating": 1.0,
      "verified": true,
      "author": "Jacqueline Minger",
      "helpful_votes": 4,
      "publication_date": 20171017
    },
    {
      "title": "Gadget Guy Boyfriend liked",
      "text": "Gave to my boyfriend for Christmas. He said he had something similar, but this was much better. He liked it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Alright, but only for light usage",
      "text": "That's pretty much it. It's not really strong and slips easily. What do you expect from China?",
      "rating": 3.0,
      "verified": true,
      "author": "WiseMan",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Useful, universal tool.",
      "text": "Birthday gift for my eldest son. He has many tools...but not this one!! He said it would be, \"very useful!\" Quite the compliment from a practical guy 😊",
      "rating": 5.0,
      "verified": true,
      "author": "quietnow",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great man gift",
      "text": "Got these for the men on Christmas. And they absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Perfect for a contractor.",
      "text": "I've been able to use this on all sorts of applications from changing all 4 F-150 tires on a truck to removing satellite dishes when roofing. Deffinatly a solid tool to get a quick job done. Now as for usage every single day (mechanics and such) you milage may very.",
      "rating": 5.0,
      "verified": true,
      "author": "EZE1994",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "It works!",
      "text": "Bought this for my dad for Father's Day. He is a man that has every tool, yet he was impressed and said it really worked well! Awesome different gift that works!",
      "rating": 5.0,
      "verified": true,
      "author": "Doyle",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Awesome!",
      "text": "Great tool to have in hand! I used them to screw in eye hooks.. super fast and way easier and cheaper than other specialty tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "As pictured",
      "text": "The product arrived early and was exactly like the picture. I brought it as a gift so I can't say if it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer M. Hughes",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Trash",
      "text": "Not a quality product. Items get stuck in it and are next to impossible to remove. I literally threw mine in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Rke",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Loved it",
      "text": "Gifted this to my stepdad. He is a mechanic and owns his own shop. He was very impressed with this tool and liked the blue color.",
      "rating": 5.0,
      "verified": true,
      "author": "Trista Thomas",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Terrible",
      "text": "Broke the first time I used it. The stainless steel rods get stuck. And the black plastics piece in the middle gets destroyed.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Ibarra",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "You can find better elsewhere.",
      "text": "This is a very shallow socket. It doesnt dip in very far at all, making the things you can grab on to a little morr limited. Width wise, it meets expectancy, but it just doesnt get a great grip on much.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexandra Wright",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Super handy",
      "text": "This thing works great. I keep it in my bags for quick access so I don't have to carry sockets",
      "rating": 5.0,
      "verified": true,
      "author": "J.p.customs",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Great and handy tool",
      "text": "Makes finding the right socket a breeze. I recently used it to replace the headlights on a car which required removal of the entire front bumper. There were multiple types of nuts and bolts and this tool handled all of them. Very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer Mark King",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Good product",
      "text": "Shipped fast & was as described - thank you very much - words words words words words words words words words words words words words fjnord words words words",
      "rating": 5.0,
      "verified": true,
      "author": "mr.Wolf",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Moongo universal socket story",
      "text": "No good for stripped heads. Only works on newer hardware. Will spin out in worn hardware.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191215
    }
  ],
  "product_meta": {
    "title": "Dad Gifts- Fathers Day Gifts, Gifts for Dad from Daughter or Son, Unique Personalized Dad Gifts, Universal Socket 7mm-19mm Gifts for Men, DIY Handyman, Father/Dad, Husband, Guys, Him By Moongo Tool",
    "rating": 4.5,
    "feature_bullets": [
      "★ UNIVERSAL SOCKET WRENCH can be adjusted to unscrew most metric, wing nuts, broken nuts, stripped nuts, eye bolts, square nuts, hexes, etc.unique design of the Hexagon and Spring Pins can be closely engaged with the parts, not easy to slip. Perfect for home improvement, construction, carpentry, automotive repair, and other household maintenance.",
      "★ TOOLS FOR MEN: Self-adjustable from standard 1/4in to 3/4in and metric 7mm to 19mm with over 130lbs of torque. Adapter turns your drill into a socket driver.",
      "★ SPECIALLY MATERIAL: Durable chrome vanadium steel material, the hardness can reach 56HRC. We use 54 super strong steel rods that are individually spring actuated allowing the socket to automatically conform to any shape instantly, Move to different types of fasteners without every changing sockets!",
      "★ GIFTS FOR MEN who have everything, a perfect gift for Birthdays, Christmas, and other Holidays for any do-it-yourselfers, handyman, dad, boyfriend, men, or women. You won't know you need universal socket until you have one! Make it yours now and make your life more easier.",
      "★ UNCOMPROMISING CUSTOMER CARE » Too big? Too small? If for any reason you are not satisfied, you have three year to return the universal socket for refund or replacement, Only be valid when purchased from Moongo Tool brand, We take pride in our family run brand and always happy to help."
    ],
    "specifications": {
      "Manufacturer": "Moongo tool",
      "Item Weight": "7.2 ounces",
      "Package Dimensions": "4.6 x 2.3 x 1.6 inches",
      "Is Discontinued By Manufacturer": "No",
      "Color": "7-19mm",
      "Head Style": "Hex",
      "Measurement System": "Inch, Metric",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B07L6FZTQM",
      "Customer Reviews": "4.5 out of 5 stars1,670 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#15,458 in Tools & Home Improvement",
      "Date First Available": "November 20, 2016"
    },
    "categories": [
      "Office Products",
      "Hand Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Wrenches",
      "Socket Wrenches"
    ],
    "price": 12.99
  }
}