{
  "website_summaries": [
    {
      "verdict": "With a larger display, a beefier graphics chip, and (vitally and finally!) an improved keyboard, Apple's 16-inch MacBook Pro is a beyond-capable big-screen powerhouse built for creatives.",
      "pros": [
        "Excellent Retina Display, now larger and with slimmer bezels",
        "Revamped keyboard",
        "Comfortable, XL-size touchpad",
        "Superb audio quality",
        "Powerful Intel Core i9 and AMD Radeon Pro 5500M",
        "Long battery life",
        "SSD storage options up to 8TB"
      ],
      "cons": [
        "Lacks microSD slot, USB Type-A ports",
        "As ever, no touch-screen option",
        "Expensive as configured"
      ],
      "aspects": {},
      "publication_date": 20191119,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "WOW IS ALL",
      "text": "WOW they say you get what you pay for and by golly they are right, superb speakers great screen and wait for it (a decent keyboard )",
      "rating": 5.0,
      "verified": true,
      "author": "Scousekenny",
      "helpful_votes": 35,
      "publication_date": 20191126
    },
    {
      "title": "From a windows techie to the apple fanboy",
      "text": "Prior to buying an Apple Macbook pro I was very hesitant what to buy. I was in between purchasing this or maybe msi laptop or a gaming one. I do a lot of programming, game and web development, graphic design and video editing. Since getting one of this MacBook my productivity has skyrocketed. MacOS is so easy to work with and all apps are running so reliably. I regret not going for a 32GB model since I'm constantly running at 10GB RAM but even with that, I have never had an issue with slowness of running my apps. If you want a Mac at a good price a bit cheaper than the retail price, this reseller can deliver!",
      "rating": 5.0,
      "verified": true,
      "author": "aliparpar",
      "helpful_votes": 20,
      "publication_date": 20200104
    },
    {
      "title": "Excellent Laptop",
      "text": "Great laptop, I use this for work, not surfing! Like most Apple products, great but way too expensive! Only issue, Apple would not give me the free Apple TV for 1 year as Amazon are not an authorised reseller... however the saving from Amazon still made it worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Maj33",
      "helpful_votes": 16,
      "publication_date": 20200112
    },
    {
      "title": "Great pricing",
      "text": "I was suspicious at the pricing; however, it's the UK Macbook and it's great. Once you get over Apple's stupid pricing even at the discounted price, the laptop itself is sublime. Very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 16,
      "publication_date": 20200121
    },
    {
      "title": "Seriously impressive value",
      "text": "Coming from a 2019 Macbook Pro 13 inch, the Macbook pro 16 inch is on another league. Twice the cores that run at around the same clock speed in normal use, 4x the storage, twice the RAM, significantly better keyboard, noticeably better battery performance and all for less than £1000 more. I use the machine as my main computer and dock it to two monitors most of the time and it works perfectly. Much better than having a full-size desktop and smaller MacBook. For a few hundred extra too, the i9 model seems to be a much better deal, and the improved graphics card can comfortably run most games.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey Coxon",
      "helpful_votes": 13,
      "publication_date": 20200212
    },
    {
      "title": "Best Mac Book Pro ever!",
      "text": "Superb new 16 inch Mac Book is excellent. New keyboard is first class. Far better than 15 inch model. Supplier is also superb service.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 9,
      "publication_date": 20200109
    },
    {
      "title": "Pound per pound 2020 champion",
      "text": "So look, I'm an it engineer for more than 10years, and I had all types of PC during this time. All I can say is that the basic config of 2019 16\" MacBook Pro is one of my best investments yet. It's true, you need to invest 80-90€ more for a good 7 in one or 8 in one adapter to get USB 3, HDMI and an RJ45 Ethernet port. All in all this laptop is an excellent choice. Screen is amazing, trust me on that ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Mircea Sandu",
      "helpful_votes": 5,
      "publication_date": 20200111
    },
    {
      "title": "WELL what can I say...a bit pricey but WORTH IT!!",
      "text": "I have done a lot of research and looked at a lot of vendors including Apple and I decided on Amazon as the price was right. I use this primarily for editing vlogs with FCPX and I have been a Windows child for 25 years. WELL I AM NEVER GOING BACK TO WINDOWS!! This product arrived on time and as expected perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Paolo",
      "helpful_votes": 2,
      "publication_date": 20200405
    },
    {
      "title": "New Apple MacBook Pro (16-inch, 16GB RAM, 1TB Storage, 2.3GHz Intel Core i9) - Space Grey",
      "text": "Just got my apple mac computer well package and no damage to it. I got it for my wife loves apple mac.Because I had i5 Mac apple and it was not as fasted as the i9 are as big. I know that there was talk about the fan on the apple mac that is loud well i have Microsoft computer is not that old and the fan is loud that keeps the computer cool. I am very happy i spent the money on the apple mac when i did because the price went up after that. Very happy Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Edward",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Powerful beast!",
      "text": "I have been using Mac last 10 years and first time ever I decided to purchase brand new MacBook Pro. I was always buying second hand because of higher price. But this time everything change! As a developer , I think this machine is great beast. I will only update/purchase new MacBook Pro if Apple start using ARM processor on MacBook Pro which is ideal timeline around 5-8 years from now.",
      "rating": 5.0,
      "verified": true,
      "author": "EE",
      "helpful_votes": 2,
      "publication_date": 20200116
    },
    {
      "title": "worth the money if your a photographer.",
      "text": "its fab runs my software great. very fast and just the right amount of vram for my AI software to work at speed. dont use the camera so the bad reviews on that topic dont effect me. disappointed that there is no USB A socket because i use magic mouse 2 which has a USB A attachment! had to buy an additional usb a to usb c adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200620
    },
    {
      "title": "Display died in less than a week",
      "text": "I spent the weekend moving all my data from my old laptop to this new one, only for it to die on me, with no way to clear the disk or reset to factory settings. Per the Post Office tracking system, the returned unit was received by Amazon two days later. An additional six days later, the is still no sign from Amazon that they received it. Blood beginning to simmer.",
      "rating": 1.0,
      "verified": true,
      "author": "TWB",
      "helpful_votes": 3,
      "publication_date": 20200612
    },
    {
      "title": "Great laptop",
      "text": "I think that this is a great laptop. I upgraded from the 2015 MacBook Pro, and I think that this Mac is significantly faster and can handle intensive workloads. Love the size of the screen and the sounds quality from the speakers is amazing - great for watching movies or listening to music. Battery life is also very good, I've gone an entire day with a single charge the night before. It also has a beautiful design, and is surprisingly powerful for being so thin and sleek. Overall, I love this MacBook as it is great for doing anything and everything. Cannot fault it at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Allan",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Great Laptop",
      "text": "Prior to this MacBook Pro, I had a 13\" MacBook Air that was great and so light. Perfect for travelling. However, the screen size was limited for everyday use and it began to tell its age. I had the laptop for about seven years and it was still working great. This new Pro is a great replacement and I am very pleased with it. Perfect for everyday use but perhaps the larger size screen will limit its use away from home.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. I. Roberts",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Serious reliability concerns",
      "text": "Completely died within 1 month, not even able to charge. It really does not play well with external monitors, especially over USB-C cable. Lots of issues with no solutions insight. Serious reliability concerns. I hope it was just my unit. Amazon kindly refunded the purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Linkin_",
      "helpful_votes": 2,
      "publication_date": 20200625
    },
    {
      "title": "Very good",
      "text": "Only been using for one day, but so far so good. Most common complaints I see is regarding the touch bar. No idea why, because I love it. The sound quality from the speakers is phenomenal for a laptop, and the picture on the screen is great. Is able to play games on ultra with good FPS, so thats a bonus. Will update again once settled into it.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Expensive but worth it!",
      "text": "The product came in original packaging in perfect condition. For now I've had no issues with it. No thermal problems or quality control issues. Honestly personally i love this product. And yes it has the best computer speakers I've ever heard. They're not as good as the reviewers say but for a laptop they're the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitja Batišta",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Excellent computer, but not worth the money?",
      "text": "I've been using this laptop for the last six month or so. Took me a while to get used to the UI coming from a windows background. I had to buy a macbook to get into App Development and took an incredible course on Udemy and now I'm almost ready to get first app released to the App Store. Overall I'd say its a pretty great computer but the price really isn't justified, you can really get something better much cheaper but if like me you're forced to get one then you'll probably enjoy using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Zakariya",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Sleek & stylish, a pleasure to use",
      "text": "Feels fabulous, looks fabulous, sounds fabulous, so pleased I bit the bullet, best laptop ever! I really like the feel of the keyboard and I think the touchbar is a great addition. Fulfills and exceeds all expectations :0>",
      "rating": 5.0,
      "verified": true,
      "author": "Tiggy",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Nice, but loses useful features of older MacBooks",
      "text": "The fingerprint recognition is a useful new feature, but losing the MagSafe and the charging LED is a pity. Power connector through USB-c seems vulnerable. The Touch Bar is useless, more bother than it's worth. You need to be careful not to accidentally hit the 'sleep' button on the bar. Boot up with Catalina is much slower than my old 2012 Sierra, and the lack of older USB connections is a pain. Otherwise a nice laptop to use (and I use mine a LOT).",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "If I wanted a heater I would have bought a hot water bottle",
      "text": "This is a fine machine well built and fast, but why does it get so hot? 🥵 This also applies to the charger that gets to 50 deg C in no time at all; may be an asset in winter. 🥶",
      "rating": 4.0,
      "verified": true,
      "author": "D. Miller",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "However, the MacBook Pro is a power machine for other things,",
      "text": "I purchase this MacBook because I needed to use it for an app I wanted for my Obsbot tail AI camera which required powerful system but to my surprise the Mac book pro I am unable to download this app on it. So I bought a computer that is not fit for purpose for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Adeniece Dublin",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Fast next day delivery even during lock-down",
      "text": "Brand new Apple Macbook Pro, everything as expected. Fan a bit noisy to start but now it seems to have stopped, the mac seems to be adjusting itself, now the fan noise has settled down. All seems good.",
      "rating": 5.0,
      "verified": true,
      "author": "Willy",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "The best laptop available.",
      "text": "Forget the price if you can, and just get one. Superb.",
      "rating": 5.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Almost perfect",
      "text": "Love my new laptop. I only wish I didn’t have to depend on my sons and husband to explain how to use iOS because I’ve been so used to a PC. Also wish it had a touch screen.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacy Shapiro",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Best purchase of my life",
      "text": "Seems at first like its too expensive, but trust me its worth every £. Its an amazing machine, perfect battery life, runs quiet and cool, handles anything you throw at it.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Tamasi",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Fantastic",
      "text": "Fantastic. Obviously a fairly substantial investment, but for the processing power, portability and aesthetics that come along with it I dont regret it. Does get a little bit toasty (may have knocked a little bit off the heating bill this month), but it doesn't appear to affect performance in the slightest so I dont mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Mooney",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great Mac",
      "text": "Got this to replace my MacBook Pro 2015 - 13\" - Much faster, great display, love the new function key, really happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 2,
      "publication_date": 20200327
    },
    {
      "title": "Very good machine for primary computer",
      "text": "I use it as main computer and that is the primary reason why I have chosen it over its 13” brother. It runs everything smoothly including photo/video editing applications and Windows with videogames in Bootcamp.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrik",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "a stunning piece of kit",
      "text": "I spend a lot of time deciding what MacBook to go for and whether to wait until next year for the ARM MacBooks but I am glad I didn't wait - its a powerhouse and everything I would want in a laptop - runs quiet and I haven't experienced any heating issues - a saving as well buying from Amazon - buy it",
      "rating": 5.0,
      "verified": true,
      "author": "Fraser Watkins",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Not as good as old Mac",
      "text": "Replaced my 8 year old MacBook Pro as battery was failing new one does not last as long as the old one very disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "APSPhoto",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Fast delivery. Product as expected.",
      "text": "I ordered one late night Saturday and I got it today, Tuesday morning, thought I should have receive it on Friday (UK to Romania). It is the same size and weight as my old Retina 15 inch (2015), but everything else is from another league. Very happy with this purchase :)",
      "rating": 5.0,
      "verified": true,
      "author": "Edu Apps SRL",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "A very good Apple laptop",
      "text": "What can I say this mac book is amazing my first Apple Mac and I’m very impressed the graphics are amazing a lovely size beautiful colour sound is nice",
      "rating": 5.0,
      "verified": true,
      "author": "wendyb scott",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Fast, powerful and keyboard improvement",
      "text": "Excellent upgrade. Keyboard so much better on the 16 inch.",
      "rating": 5.0,
      "verified": true,
      "author": "JCB",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Everyone of my max has lasted for more than 10 years this one will last longer",
      "text": "Need I say more you can’t go wrong with Mac",
      "rating": 5.0,
      "verified": true,
      "author": "Marc London",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "i9 overheats like crazy",
      "text": "Not worth the money, huge disappointment. The laptop overheats like crazy within minutes of use. Had it sitting on my lap and near burnt my legs The price on amazon of £2499 is not justified. Same models and specs can be found for £2000. Even so, it is still not worth the money!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Don’t buy from Amazon this device.",
      "text": "Something is wrong with these laptops. It looks like there’s some sort of software issues. My advice to everyone would be buying it directly at Apple as they do replacements straight away; Amazon won’t help you a lot...",
      "rating": 1.0,
      "verified": true,
      "author": "The Juice Shop",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Dated Model (not 2020)",
      "text": "Product works fine, but nowhere here does it say this is the 2019 model - don't purchase if you were expecting the latest version. Wouldn't have purchased if I had known. Please specify which edition you are selling in the listing!",
      "rating": 1.0,
      "verified": true,
      "author": "George Gretton",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "The best on the street... apple 🍏",
      "text": "There is nothing better then apple 🍏 for computer and electronic items... the problem is the price, but if you want something very good you need to spend a lot money...",
      "rating": 5.0,
      "verified": true,
      "author": "Edoardo",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Perfect machine",
      "text": "It takes a lot of money to buy it buts its worth it. Battery life 12hours, 16 inch monitor is gorgeous and the new keyboard is very precise. Its an upgrade only if you have 2017 model and older.",
      "rating": 5.0,
      "verified": true,
      "author": "Evangelos Kalpakis",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Simply awesome!",
      "text": "The product arrived and the laptop its amazing. Great performance. 100 % recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Elias L.",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Video editing - perfect.",
      "text": "Phenomenal speed. Needed it for recording audio and video editing. It’s been unbelievable so far.",
      "rating": 5.0,
      "verified": true,
      "author": "G3V",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "A wonderful piece of equipment",
      "text": "Bought for my wife for mostly cataloging photographs. Smooth and very fast with a wonderful screen. I can't really fault it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Philip Assheton",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Well, it's a macbook pro",
      "text": "Bought to replace my 8GB RM 13' and I'm happy with it, especially for the price I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "It’s great!",
      "text": "Not yet used this to its extreme but a great MacBook Pro unit. Powerful fast looks great. Still Apple though so costs enough!",
      "rating": 5.0,
      "verified": true,
      "author": "David Anderson",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Brilliant",
      "text": "Brilliant purchase, fast secure delivery & couple hundred quid cheaper than Apple",
      "rating": 5.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great machine",
      "text": "Fast, reliable, good keyboard. Light, doesn't thermal throttle under most circumstances. A bit expensive but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Natan Facchin",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Very hot",
      "text": "It’s a very good product, but it heats up a lot without demanding it.",
      "rating": 4.0,
      "verified": true,
      "author": "Juanita",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "MacBook pro",
      "text": "As described, delivered iin under 24 hours and sold with a discount.",
      "rating": 5.0,
      "verified": true,
      "author": "B M BLACKFORD",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Hot and expansive 6",
      "text": "Too expansive, quite hot. Not happy overall about the product, returned",
      "rating": 3.0,
      "verified": true,
      "author": "Antonello M.",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Fast with plenty of memory.",
      "text": "Found this ideal for editing and storing my digital photos.",
      "rating": 5.0,
      "verified": true,
      "author": "John Parry",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Best Apple laptop ever made",
      "text": "Quite honestly the best laptop I’ve ever owned. It’s pricey but if you can afford it, you will not regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fergus W",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "lagging with second monitor",
      "text": "supposed to be very powerful and is lagging on the second monitor like a cheap computer",
      "rating": 1.0,
      "verified": true,
      "author": "Paris M.",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "MacBook Pro 16 inch",
      "text": "It is beautiful and incredibly fast , you can multi task no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Celtech",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "A writer’s dream",
      "text": "Fabulous upgrade on previous dated models: intuitive and sleek keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Lapham",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "good editing",
      "text": "love the macbook, the only \"problem\" is that it heats up really fast",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Really good computer!",
      "text": "I was a laptop user, but Apple MacPro is a style and elegance!",
      "rating": 5.0,
      "verified": true,
      "author": "Nilgun",
      "helpful_votes": 0,
      "publication_date": 20200516
    }
  ],
  "product_meta": {
    "title": "Apple MacBook Pro (16-Inch, 16GB RAM, 1TB Storage) - Space Grey",
    "rating": 4.5,
    "feature_bullets": [
      "Ninth-generation 8-Core Intel Core i9 processor",
      "Stunning 16-inch Retina display with true Tone technology",
      "Touch Bar and touch ID",
      "Amd Radeon Pro 5500M graphics with GDDR6 memory",
      "Ultrafast SSD"
    ],
    "categories": [
      "Electronics & Photo"
    ],
    "price": 3297.07,
    "specifications": {}
  }
}