{
  "website_summaries": [
    {
      "verdict": "A sturdy set of four secure greenhouse trays; heat and moisture stay inside each 25-pellet tray.",
      "pros": [
        "Dome has adjustable vents and is transparent so light shines through",
        "Tall trays can accommodate taller seedlings",
        "Two jiffy pellet sizes may be used",
        "Pellet trays and greenhouse trays are separate items for convenience"
      ],
      "cons": [
        "The trays take peat pellets rather than soil"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Overall good product",
      "text": "These seem to be thicker plastic than others out on the market. The only complaint I have is that the lid fits over the outside of the box. This causes water to leak all er the table. They need to design these where the lid fits inside the box to allow the condensed water to recycle itself back into the greenhouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Critique Guy",
      "helpful_votes": 11,
      "publication_date": 20200403
    },
    {
      "title": "Effective, stackable, reusable, awesome",
      "text": "Great product—strong and holds up to multiple uses. I love the height, which enables the use of plant identifiers and also allows me to stack while still letting in significant light. I also appreciate the ability to vent and the way the tray holds the peat pellets in place as they expand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn T. Bass",
      "helpful_votes": 4,
      "publication_date": 20200223
    },
    {
      "title": "Love them. High quality and precisely manufactured.",
      "text": "I grow plants as a business and these trays have been really useful. As someone who appreciates fine attention to detail, I can tell you these are top notch. The fit of the dome is perfect. These also fit two in a 1020 tray and accommodate the usual size cells. The vent mechanism is really smart! I can’t recommend these enough! Just make sure to buy the 4-pack. It is the same price as the three pack but had one more!",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Rosner",
      "helpful_votes": 2,
      "publication_date": 20200926
    },
    {
      "title": "Sturdy trays",
      "text": "I wanted trays that would not fall apart after a couple of years in the Georgia sun and, while I'm just on my first spring with these, they appear to be better than what I've had in the past. They're thicker and more rigid so I expect to get several years use out of them. The tops are also taller than my prior ones as well so the plants have more room to grow before I transplant them.",
      "rating": 5.0,
      "verified": true,
      "author": "Lea",
      "helpful_votes": 2,
      "publication_date": 20200409
    },
    {
      "title": "HEAVY DUTY!",
      "text": "These trays are extremely heavy duty for the price. The added feature of accommodating 2 sizes of pellets is wonderful! Service was prompt.",
      "rating": 5.0,
      "verified": true,
      "author": "N Idaho Gramma",
      "helpful_votes": 3,
      "publication_date": 20200316
    },
    {
      "title": "Great product.",
      "text": "Great for germinating your plans. Was not very successful with the P pellets. Out of 200 pallets I only got 5 to germinate. Went to Home Depot and I got paper cups and seed starter soil. Worked better than pellets.",
      "rating": 5.0,
      "verified": true,
      "author": "101010101010",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Unquestionably better than the big box one's.",
      "text": "Don't buy one from HD for about half the cost of 4 of these. These are sturdy, actually 4 pieces, the bottom tray, the peat plug cups, the clear cover and an ingenious vent to control humidity. All designed with some thought.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat Mandu",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Much better than other brands!",
      "text": "These are sturdy and excellent. The spaces are deep enough to be supportive, I love the channels under the grid for water, and the lid is strong with the option of vents. It really is an excellent system. I have had a Jiffy one in the past and the lid was probably half as thick with built in and more shallow grooves, and that’s not even thinking about how the kids were half as tall with less room for the plants to grow before transplanting. I am MUCH happier with these. Do yourself a favor and grab these for your seedlings!",
      "rating": 5.0,
      "verified": true,
      "author": "tara",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great trays!",
      "text": "Quite happy with the thickness of the trays. The domes and adjustable vents are great. The plastic inset tray for the seed pots could be a little heftier and less flexible for my taste, but they're more than adequate when they're inside the tray.",
      "rating": 5.0,
      "verified": true,
      "author": "J. SmithTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Pleased",
      "text": "Excellent product. Was missing a piece and the seller was helpful and quick to send replacement! Plants have grown well.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelle p.",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Perfect",
      "text": "Excellent for starting seeds. Sturdy and useful at a good price. Thanks Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Neutron",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Very thick. Sturdy, works good.",
      "text": "Were thick and will last a long time. Gave 4 stars only because packaging thin, and one tray was cracked and could not be used. I would still order again as the trays are about 5x thicker than others.",
      "rating": 4.0,
      "verified": true,
      "author": "NettieR",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Perfect tray.",
      "text": "The greatest feature on this tray is the tall lid. It allows more growth and it also allows the plant to breathe by regulating the humidity inside the lid. the removable trays are also a bonus feature. I will be buying more of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Phillips",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Absolutely perfect for my indoor garden",
      "text": "Currently growing Bamboo and Jalapeños peppers, and I couldn’t ask for a better tray, has adjustable airflow on top, and can hold a ton of seedlings, 10/10 would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Nice Isaiah",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "sturdy and effective propagation trays",
      "text": "The plastic is slightly sturdier than other trays I've used. It works well for seed and clone propagation. The humidome seals well to regulate moisture. They're not very tall so you have to transplant when things start to grow.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Wallace",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Strong, you won't be dissatisfied.",
      "text": "Super strong, very well made. This is my second purchase. Super fast shipping. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Loy Streitenberger",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Strong plastic smell",
      "text": "When I open the box, there is very strong plastic smell. I don’t want to use it to grow my organic vegetables seeds. The tray is not made by BPA FREE material.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Shopper",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Good Quality",
      "text": "sturdier than I was expecting. Clear tops fit nice and have adjustable vents.",
      "rating": 5.0,
      "verified": true,
      "author": "Phatfill",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Sturdy",
      "text": "They are sturdy and easy to transport exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great product!",
      "text": "Well made trays that will make starting seedlings so much easier this year. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian J. Kern",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Nice tall, sturdy domes!",
      "text": "Super impressed so far. Easy setup, nice tall domes. Wondering how easy the peat pots will be to get out of the holes, but that will be a few weeks to come. So far so good. Cant use these with straight dirt with the holders but would work as small planters without them.",
      "rating": 5.0,
      "verified": true,
      "author": "Loreee",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Very durable",
      "text": "This is the best and most affordable product I have ever used. The peat pots fit perfectly and the bottom plastic is very strong and can easily be handled with one hand. The top clear plastic stands very tall, perfect for growing plants. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great seed trays",
      "text": "These are by far the best seed trays I have gotten. Very sturdy, a perfect size, and should last for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Great!",
      "text": "I really like them. They do seem like they’re likely to last quite a few seasons as opposed to the standard flimsy trays that crack easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn Rynerson",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Missing item replaced",
      "text": "Item was missing a lid cover, but the email address provide for customer service didn’t work. I was able to reach the company via the written review and they provided a replacement. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "Carlyle H. Brinkman",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Thick plastic very well made.",
      "text": "Four of these are an excellent deal. they are well made and form a good seal. The cover fits well and is much tallen than most allowing you to grow your seedlings longer!",
      "rating": 5.0,
      "verified": true,
      "author": "norlan",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Very happy with purchase.",
      "text": "Love these. Like having mini greenhouse for starting seeds. Seeds sprouting in two days.",
      "rating": 5.0,
      "verified": true,
      "author": "Lu",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Good quality and reasonable price. Recommend !",
      "text": "Really good product , durable , sturdy and nicely, too. I think you can reuse it year after year.",
      "rating": 5.0,
      "verified": true,
      "author": "Huong H.",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "It’s was overall good product",
      "text": "One of the containers had a whole in it and was leaking water",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Denham",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Perfect small greenhouse",
      "text": "Best small greenhouse ever, especially with the added peat pots.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Leatherman",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Works great for starting seedlings.",
      "text": "Sturdy and holds many seed pods for planting. Lids can vent for airflow and are a bit taller which allows room to grow. Good quality product.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "I am impressed",
      "text": "I bought these along with pellets to start some giant orange pansies that I cannot find anywhere as plants. If I knew how easy this was, I would have done this years ago. The container holds 25 pellets and the pellets I ordered fit perfectly in the holes. it is easy to get water down underneath in tray and let it absorb up into the soil. I love the simple yet very effective adjustable vent holes on the top. I am putting them outside during day and bring them in at night as temperatures here swing 30 degees easily from night to day. I will update with photos when things start to sprout.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Sanders",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "QUALITY! Love, Love, LOVE!!",
      "text": "These are excellent!!! Well thought out. They are far more sturdy than the jiffy brand or average seed starters in the stores. They have humidity controls on top and the lids are nice and tall for longer growth time. These will now and forever be my very favorite seed starters. American made to boot!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Schumacher",
      "helpful_votes": 2,
      "publication_date": 20200416
    },
    {
      "title": "GREAT DEAL for a COOL PRODUCT",
      "text": "So basically this product provides a framework for peat moss/coconut fiber pellets that you soak to hydrate. It's a mini greenhouse. It's great for what I need it for - I'm going to put it under grow lights and put a heat mat under it to stimulate germination. That quality is very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Frances",
      "helpful_votes": 2,
      "publication_date": 20200226
    },
    {
      "title": "Great Quality and Perfect for Gardeners",
      "text": "These greenhouse trays are excellent. The quality of both the tray and humidity dome are superb. Worked very well with the pellets/plant pods. I would definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "christine e thompson",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Moss pellets not included.",
      "text": "Thought it came with the peat moss pellets because this was the first product to pop up when I searched for them. I returned them because 25 bucks for just the containers is too steep. Go to the dollar tree and get some Betty Crocker Tupperware for a dollar. THERE ARE NO PEAT MOSS PELLETS",
      "rating": 1.0,
      "verified": true,
      "author": "Marky.Mark_93",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Really nice seed starting trays",
      "text": "The trays hold 25 of the 30mm-42mm Peat Pellets and are sturdy enough to use many times. Much better than the brand that begins with \"J\". My original order was missing one of the pellet holders but the company shipped me a replacement in just a few days. I give SOLIGT five stars too.",
      "rating": 5.0,
      "verified": true,
      "author": "WoodButcher",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "quality",
      "text": "Love the green house effect, my seeds have not started to grow yet, but hopefully very soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Will buy again and again",
      "text": "The quality of these are really good, well worth the small price differential. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon A. Coogan",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "would buy again",
      "text": "Plastic thickness is good. Packaging is perfect. fits large Jiffy's very well.",
      "rating": 5.0,
      "verified": true,
      "author": "danielnapa",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Nice",
      "text": "Very nice the tops come with vented tops very sturdy also",
      "rating": 5.0,
      "verified": true,
      "author": "ASTI",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great product",
      "text": "Absolutely great.... very strong and durable... love the vent system on the top!!!! Actually ordering more!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Delmas",
      "helpful_votes": 0,
      "publication_date": 20200303
    }
  ],
  "product_meta": {
    "title": "4 Set Strong Greenhouse Trays with Humidity Dome and Pellet Holder for 30mm, 36mm & 42mm Peat Pellets, Holds 100 Pellets in Total, Seed Starting, Germinating Seedling Propagating, Pellets Not Included",
    "rating": 4.7,
    "feature_bullets": [
      "VALUE PACKAGE: Includes 4 greenhouse trays with 4 matching humidity domes and pellet holders, each capable of holding 25 jiffy peat pellets. Note: Jiffy pellets are NOT INCLUDED. Overall dimension - 10.67\" x 10.67\" x 2.36\".",
      "STURDY AND HEAVY DUTY: High quality plastic is durable, reusable and recyclable - perfect for starting seeds, clones, growing micro greens, herb and salad leaves. Trays features no hole - save you time to water the soils and prevent leaking.",
      "COMPATIBLE WITH 3 SIZES JIFFY PELLET: Our pellet holder trays are specially designed to hold 30, 36 and 42mm pellets- allows you to grow different types of plants in one tray and fix the pellet in place without failing.",
      "EXCELLENT HUMIDITY CONTROL: Our high-rise, transparent domes have 2 adjustable and clear vents designed for smooth airflow control, maximum light penetration and the best viewing of your plant starts.",
      "PERFECT FIT: The dome and growing tray close well and forms a tight seal seal to maintain warmth and humidity- ensures the healthy and robust growth of your plants."
    ],
    "specifications": {
      "Package Dimensions": "11.22 x 11.18 x 7.17 inches",
      "Item Weight": "2.99 pounds",
      "Manufacturer": "SOLIGT",
      "ASIN": "B081YN4K5C",
      "Customer Reviews": "4.7 out of 5 stars121 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#11,014 in Patio, Lawn & Garden",
      "Batteries Required": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Home & Kitchen",
      "Germination Trays",
      "Gardening & Lawn Care",
      "Indoor Gardening & Hydroponics"
    ],
    "price": 27.99
  }
}