{
  "website_summaries": [
    {
      "verdict": "This hidden camera features excellent video and audio quality for such a small item.",
      "pros": [
        "Impressive 1080p Full HD video",
        "128GB of storage",
        "Rechargeable battery",
        "Films for 70 minutes per charge",
        "Includes 5 ink cartridges",
        "Easy to conceal",
        "Inconspicuous design"
      ],
      "cons": [
        "Its one-button operation may take some getting used to"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for pranks!",
      "text": "Great pen to use when you make videos pranking people! Also it has 5 refill inks so you can keep using it as a pen if the ink runs out! It has a micro sd slot for your recordings and a micro usb input. I have used one about 10 years ago and the quality was crap. It also did not have a micro sd slot so this new pen will be much easier to see your recordings!",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 240,
      "publication_date": 20200310
    },
    {
      "title": "Works as advertised",
      "text": "I had ordered a similar spy pen camera in the past that didn't work at all despite charging and doing everything as instructed. This one was completely different. Has worked immediately and the overall picture quality is good. Indoors it's a little dark and grainy but not surprising given the small lens. Haven't tried outside yet but expect a much better picture quality in outdoor lighting.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Wong",
      "helpful_votes": 249,
      "publication_date": 20200407
    },
    {
      "title": "So bad I sent it back the same day",
      "text": "I received it, sound was terrible, if I needed to demonstrate something with sound or voice it is impossible, video VERY DEFICIENT AND SATURATED ease of use, none, you think is on and it is not, fails commands I DO NOT RECOMMEND IT AT ALL",
      "rating": 1.0,
      "verified": true,
      "author": "Elian",
      "helpful_votes": 82,
      "publication_date": 20200718
    },
    {
      "title": "Great spy pen",
      "text": "I was actually really surprised with this pen. It’s very hidden my son freaked out when I showed him where the camera was and he’s not been hiding it all around the house. Decent picture quality but really just a great pen too. Great gift for your kid who is hard to shop for. Not “dinky” feeling great product.",
      "rating": 5.0,
      "verified": true,
      "author": "liz",
      "helpful_votes": 231,
      "publication_date": 20200708
    },
    {
      "title": "A Fun Gadget",
      "text": "A nice pen camera that can be used for quick photos and videos on the go while doubling as an actual pen. It is very easy to operate after quickly browsing the brief steps provided. I had a slight problem playing back the videos, but customer service was awesome. They responded immediately with a solution. The videos look great! Pictures are also excellent (see examples). Try to hold pen steady when taking photos.",
      "rating": 5.0,
      "verified": true,
      "author": "CAW",
      "helpful_votes": 185,
      "publication_date": 20200716
    },
    {
      "title": "Works well and it comes with extra ink",
      "text": "The Pen came with an SD card adapter and extra ink. It works well and it writes really well. The camera is able to work with no problems at all and helps me to remember events that I need to recall in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel M",
      "helpful_votes": 214,
      "publication_date": 20200331
    },
    {
      "title": "Junk",
      "text": "This item is cheap and absolute junk even using it as a pen! There is also no sound in your videos when there are plenty of other products that you have sound I do not recommend this item whatsoever",
      "rating": 1.0,
      "verified": true,
      "author": "Doreese Dufaux",
      "helpful_votes": 6,
      "publication_date": 20200623
    },
    {
      "title": "I give a strong 4 **** 👍",
      "text": "Quality and feel of the Pen, overall is great, writes excellent, smooth ink flow and came with 5 ink cartridges! The Camera... with any new tech gadget there is a learning curve. This one wasn't bad. Straight forward and with repetition easy to use. Clarity is bad in very low light indoors, medium lit room to daylight outdoors pic & video quality is excellent, just dont move the camera too fast. Lens seems to have a built in 1x or 2x zoom, so practice have have fun. Also I'm using a Samsung 128gb card, works fine, just can't set the correct running time and date.....",
      "rating": 4.0,
      "verified": true,
      "author": "C.M.",
      "helpful_votes": 3,
      "publication_date": 20200625
    },
    {
      "title": "Easy to use. Good picture quality",
      "text": "I bought this pen as a gag gift. Worked out perfect for my needs. The picture quality is better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Manish",
      "helpful_votes": 209,
      "publication_date": 20200310
    },
    {
      "title": "Great gift for gadget savvy individuals",
      "text": "If you are looking for a cool, unique gift for a gadget savvy teen or adult, I recommend this one. You get a decent little handy camera with a working pen.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen D",
      "helpful_votes": 11,
      "publication_date": 20200306
    },
    {
      "title": "Don't bother, dead on arrival",
      "text": "Piece of garbage - I've read the instructions several times, the pen never worked once. Too bad I waited so long until after the deadline to return the thing. Oh well.",
      "rating": 1.0,
      "verified": true,
      "author": "Andy Monson",
      "helpful_votes": 78,
      "publication_date": 20200710
    },
    {
      "title": "not as advertised",
      "text": "2 seconds click goes to standby then 2 seconds click supposed to flash for 3 times (never happen) don't know if it's recording till you plug to PC. then it turn off. waste of time",
      "rating": 1.0,
      "verified": true,
      "author": "Mohammed",
      "helpful_votes": 6,
      "publication_date": 20200226
    },
    {
      "title": "Works when it wants to....",
      "text": "This item is a great idea, however upon using you never know what you're gonna get. If I recorded for 30 minutes, I may get one 9 minute file and two that are unreadable, for example. Very unreliable...I need something that works all the time, not part of the time. Also, battery life was also unclear. I'd charge overnight, assumed it was fully charged, and the battery would die even if not in use. Maybe I received a defective item, I don't know.......unsure if I will purchase and try again. I did, however, like how hidden the camera itself was....product just didn't work as I had hoped.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 2,
      "publication_date": 20200823
    },
    {
      "title": "Pen/great/fairly easy to use/nice",
      "text": "I really enjoyed the pen, very nice sleek, only thing is to get to learn the button on the top,for the on off/green light/red light, record ,stop .functions great and has pretty good time rang. Loved it. Great price. I use it in case an altercation erupts,so I have evidence.",
      "rating": 5.0,
      "verified": true,
      "author": "John navarro ",
      "helpful_votes": 178,
      "publication_date": 20200718
    },
    {
      "title": "SIRGAWAIN Discrete Rechargeable 1080P Hidden Spy Camera Pen Full HD Loop Recording or Picture Taking",
      "text": "SIRGAWAIN Discrete Rechargeable 1080P Hidden Spy Camera Pen Full HD Loop Recording or Picture Taking. Great Quality Video, Pictures & Audio Recording!!! Camera is Extremely Discrete. 6 Ink ReFills!!! Great Looking and Writes nice too!!! Besides a Spy Pen would be Great for any College Student to record lectures during taking notes. Gave as a Gift to my daughter to use in school. Highly Recommend!!! #Ricks2Cents",
      "rating": 5.0,
      "verified": true,
      "author": "Rick & Lindsay Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Complete waste of money.  Junk.",
      "text": "I tried taking numerous photos of various documents from various ranges, from a few inches to three feet, in various lighting conditions. Only a small fraction of the photos were not blurry, since there is no way to control the focus. Precision aiming of the camera is harder than you would think as well. It also destroyed a brand new MicroSD card, rendering it unusable, so that it could not be reinitialized. Complete waste of money. Junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Benson",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Works great for what I need",
      "text": "I really liked this. It can hold a large memory card and records for a really long time. It was really easy to figure out and Is simple to use. I love that it also came with extra ink refills so you can actually use the pen! I got this for using during class to record discussions while taking notes and so far it has worked great. I highly recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bre Adoorablee",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Very discreet! Looks like a legit pen!",
      "text": "This is a very clever device. It really is a nice looking pen. The camera module is very hard to detect. It does record audio. The operating instructions are clear. I put a 32 gig card in it and it records at about the same quality as a laptop webcam. It records vertically, so if you are writing, the picture will be oriented properly. If it is laying on the side the video is sideways. When operating, there are no lights, however, there is a discreet light to indicate mode/operation. The packaging is very nice, definitely gift-quality. Overall happy with this I expect lots of fun times with this gadget.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy customer # 394868",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "HD quality and you can write with it",
      "text": "Not only is it a pen but it also has a camera. You can put a 256 GB memory card in it as well. It actually records in HD and it has a wide field of view.",
      "rating": 5.0,
      "verified": true,
      "author": "Haywudjablomi",
      "helpful_votes": 178,
      "publication_date": 20200606
    },
    {
      "title": "If I could give it 10 stars, I would!",
      "text": "I could not believe the sound and picture quality of this tiny little camera!!! I use it as a body cam, and nobody would ever know!!! Additionally, I would like to mention the excellent customer service of the seller! I could not view my recordings, on my computer, so I contacted the seller, and he got back with me promptly, and guided me through this tough time! Now everything is working good! BTW, even if this spy pen would only work for 6 months, I will buy another one from this seller!",
      "rating": 5.0,
      "verified": true,
      "author": "Martin H.",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Did I Receive a Defective Product?",
      "text": "I followed the instructions. The Photo portion works fine. The Audio Recording portion works fine. However, the Video portion does not. I tried different SD cards that work in my other cameras but to no avail. The message I get is: \"This file isn't playable. That might be because the file type is unsupported, the file extension is incorrect, or the file is corrupt.\" As I stated previously, I don't have this problem with other similar cameras. This one may be defective.",
      "rating": 1.0,
      "verified": true,
      "author": "John Phillips",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "will have to return it",
      "text": "I've read on multiple comments that it DOES record audio but it does not on mine. Which I understand since it's illegal in the US to record audio. But the main reason I want to return it is that the PHOTO FEATURE does NOT work. I tried several times. Charged it, restart multiple times, but only the video function is working. I'm very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "sy",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "First time use",
      "text": "Well first off I do like that it will take a 128gb msd card... but the only thing I don't like about this so far, is the camera placement.. you put the pen in your shirt pocket and it videos the ceiling .. the camera angle is off in MHO.. If someone is standing in front of you..a foot or 2..... you get a nice video of their nose hairs.. :( other than that.. the cam takes nice pics (OUTSIDE) inside low light is horrible.. but look more like a 640x480 shot .. grainy.. but outside in daylight... it's nice..",
      "rating": 3.0,
      "verified": true,
      "author": "HAWK",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Great for evidence for police",
      "text": "Had a problem with neighbor. Was able to record him (yes its legal here) threatening to shoot my husband. Police viewed the recording and attached video file to report. Because of video city prosecutor is filing charges. Video quality is excellent. The officer stated he wished his body cam had as good a quality. The audio could be better. Kind of sounds a bit muffled but still good enough to hear everything said standing 20 feet away.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela M.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "A Camera Pen with the Look of a Luxury Pen",
      "text": "I didn't know they really made it a real pen with a camera and extra ink tips. At a glance, it looks like a normal luxury pen. In normal lighting condition, the picture quality is fine. In a little bit darker lighting condition, the picture quality is acceptable. But if the lighting is darker than that, not to mention the lighting condition that our eyes can barely see, don't expect much. The battery life is not so long, but is enough to record 1 or 2 classes lession. Since the pen is so small, this is completely understandable. Be aware that the pen does heat up a little bit when charging.",
      "rating": 5.0,
      "verified": true,
      "author": "JNg",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "takes good video pix and also audio",
      "text": "Video is clear and true, if you move around a lot while shooting won't get a good picture of what you are looking at. the audio is good too but you need to be close to the subject to hear what is said well. Reasonably priced and the best bod cam I have had after going through several. It's very small just like a pen and in fact is a pen, you can write with it too so nobody will really suspect what it is unless they have already seen one. Turning on and off is a little tricky but once you get it down no prob. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Cool item",
      "text": "I purchased this for when I travel to record some of my experiences. It was a very cool item and all the features functioned well. I did a couple of test runs and the video quality and audio were great. I was very happy with the results and I'm confident it will serve me. Honestly, I was surprised at the quality based on how affordable it was. I've even been thinking about buying a second one as a back-up to keep on recording when I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "GRB Reviews",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Does more than you think",
      "text": "This pen would have made Q (James Bond) proud. The quality and abilities are really pretty darn good for such a little, innocuous thing. No issues at all getting Windows 10 to recognize it either, simple, easy operation; does video, audio, and stills. Just be aware of angles, for example, I clipped this on my T shirt collar but got mostly video of the ceiling (my fault); but in a shirt pocket is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Phigg",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Fun product",
      "text": "I bought this for fun and capture videos of my kid. Yeah, he gets upset when capturing him with phone camera ☺️ So far it has been working well. It was easy to setup and use. Video quality is reasonable for the product. Don’t compare with phone camera or action camera. I wish they added SD card to the bundle. It took a while to try it since we had to order and wait for the card.",
      "rating": 4.0,
      "verified": true,
      "author": "NoOne",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Audio and Video works well",
      "text": "Works great but it dies really fast and it's a bit difficult to work. I ordered 2 for my bf he works in the hospitality industry and has been getting a lot of very rich Karen's and Kevin's lately that are verbally abusive and rude. Some of whom have threatened physical violence and I wanted to be sure he was safe and covered at work. It was an insurance policy kind of like a cop wearing a body cam.",
      "rating": 4.0,
      "verified": true,
      "author": "Ivy",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Worked for recording video",
      "text": "First time using this type of pen. Just need to place the pen against the wall and record the online yoga classes which I couldn't do with my computer. Easy to use with clear manual. Worth trying!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anh P.",
      "helpful_votes": 162,
      "publication_date": 20200720
    },
    {
      "title": "Amazing little secret agent pen",
      "text": "I love this little gadget , while I admit I may not have to much use for it because I don't plan on going on a spy mission anytime soon, the video quality is great for the little pen and it's so cool because you never would know this was a camera I could see how maybe some people could find usefull in other forms if they wanted to record in a public setting of an altercation and not be noticed , either way I love my little pen",
      "rating": 5.0,
      "verified": true,
      "author": "Smilingtimes",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "The chip to record was missing",
      "text": "Made a mistake buying this item. I bought it the 1st time and it stopped working within 2 months and the vendor would not replace it. The video quality is actually good and easy to use but horrible customer service. Decided to give them a 2nd try and the pen showed up with no chip and the vendor will not even reply. Horrible company to deal with. Do not recommend them.",
      "rating": 2.0,
      "verified": true,
      "author": "edgar preciado",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Cool Pen Gadget",
      "text": "This spy canera pen let me record video, or taking pictures. The little tiny camera that is on the top of the pen is so discreet when I put it on my shirt pocket nobody noticed that I have it. The SIRGAWAIN pen hidden camera works pretty well when I plug it in my computer with the USB reader. I like the internal lithium ion battery of the pen that provides me up to 70 minutes. I can use it like a regular pen and it came with extra ink too that is pretty handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 40,
      "publication_date": 20201001
    },
    {
      "title": "Only 10 min record time.",
      "text": "Returned for the updated that is said to get 70 min continues recording. Having only 10 min at a take is kind of useless. Go for the updated version. Same price! Ill see what is when it arrives.",
      "rating": 2.0,
      "verified": true,
      "author": "Prof. Steam",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Good quality camera",
      "text": "I’ve received this couple of weeks ago and so far it’s doing really good. I have tried recording multiple videos and the quality was good too. No one will notice there is a cam in this pen. Also I must say ink is great too.",
      "rating": 5.0,
      "verified": true,
      "author": "W3n0d",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great value",
      "text": "What I like is this has1080p video and it also has audio and the last two ones that I had looked just like this one but from different companies but they had no audio this one had audio and I can use this to protect myself from any false allegations made against me because I where badge and a gun for a living.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwapo John",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Returning the pen",
      "text": "Received the pen, charged it, put my memory card in and tried it out. Would play on Windows 10. Tried to register the pen for support but the site would freeze. Going to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Tuttle",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Good quality, concealed camera",
      "text": "This camera works very well. It is easy to charge and transfer the recorded videos via the USB connection. Always good to have when on the go, plus it also works as an actual pen!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Surprised at the quality of the device and the picture/video.",
      "text": "It is not a $70k Red digital camera, but I was surprised at the image and the quality of the pen. For the price I should have bought more than I did...wait,I can order more. You really have to look hard to see the lens, and if you did not know it was a camera, the lens is not noticeable and invisible. I would have probably just used this as a work pen without the camera, it has a nice feel and better than the bics I use. Overall, with the quality of the pen and the camera, I would/will buy a couple more.",
      "rating": 5.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "pleaed",
      "text": "I purchased this product form previous reviews. It functioned flawlessly for the first few weeks when the audio ceased to function. The customer service personal responsed promptly to my emails and replaced the product with a new one. I foun DC the video to be good indoors however I have not had a chance to utilize it outdoors as of yet. Time will tell as to the durability of the product, but so far i am pleased with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul S.",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "No reliable",
      "text": "Super hard to figure out and I have no faith that it actually works when it’s on.",
      "rating": 1.0,
      "verified": true,
      "author": "Terasina",
      "helpful_votes": 2,
      "publication_date": 20200528
    },
    {
      "title": "Sneaky little high quality camera.",
      "text": "I've only used this once, and was impressed with the video quality and sound. The camera is tiny and hidden well. You'd never know it was a camera.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Knight",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Not Different from the Competition",
      "text": "From comparison videos with this, another pen I got from Amazon, and my phone, the angle is the same. I couldn't see anything that looked like wide angle, compared to say, my GoPro mr my DashCam. Low-light performance isn't as great as another pen I bought from here with a lower price. Even in very Sunny conditions we have now in Seattle, the picture doesn't look bright at all. I really wish they had a lens cap, like many other competition on Amazon does. Anyone holding the pen will see the lens for sure.",
      "rating": 4.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "MORE than I anticipated!",
      "text": "Was so excited to get this in the mail and I was NOT disappointed!! Didn't even know that it came with an SD card, so that was an unexpected bonus! It's soo easy to charge, record, take pics and hook up to the computer. It took all of less than 5 minutes to figure out for me. And trust me, if I can figure it out that fast anyone can lol. Simple directions. Easy access in your computer. I'm going to buy some as stocking stuffers!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Cook",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Surprisingly good sound a picture",
      "text": "I was surprised by how sensitive the microphone is on this, It picked up sounds from other rooms when I was testing the video/voice recording options. READ THE INSTRUCTIONS. You can take pictures, record video, record audio. Video quality was awesome and it took pretty good pictures too!",
      "rating": 5.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Lightweight and is a real pen too!",
      "text": "I was genuinely surprised when I realized you can actually write with this pen too, which makes it so realistic. The package also comes with ink refills. It is also very lightweight and compact, no one would ever know that it was not a real pen. It was easy to assemble and start using. I recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 39,
      "publication_date": 20200925
    },
    {
      "title": "Easy to use- good Quality.",
      "text": "Used this pen and found it to be easy to use. It looks like a normal pen and you can use it anywhere. The first piece delivered to me was not working and seller was very prompt to send replacemement that worked like a charm. Picture and video quality both are good !",
      "rating": 5.0,
      "verified": true,
      "author": "Torpedo11",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Nice pictures and video, ignore my unsteady hands.",
      "text": "This is a great, easy to use camera, and well concealed. When in the office, it’s great for referring back to with your notes. I got the Spy Pen, a 128 Gb card, and also a connector to read the SD card from my iPad. Follow the instructions, and you will be very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 10,
      "publication_date": 20200810
    },
    {
      "title": "You get what you pay for",
      "text": "Picture quality is fuzzy even with a pro grade card. Spend a couple of extra dollars for a better picture.",
      "rating": 2.0,
      "verified": true,
      "author": "6goertz9",
      "helpful_votes": 75,
      "publication_date": 20200719
    },
    {
      "title": "Working as expected",
      "text": "I just see this on my search and I would like to try it. This is pretty good gadget and it is working as expected. I found it is very handy and easy to use. I still not sure what I am going to use this yet, but I realize this is fun to have a 'tool' that can record my meeting and speech!",
      "rating": 5.0,
      "verified": true,
      "author": "Silicon",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Nope.",
      "text": "I had high hopes for this thing. But it just doesn't work. I've read the instructions over and over and sometimes it records just fine. And other times it just doesn't work. Usually, it doesn't when I need it to. Unfortunately, I'm past the return period.",
      "rating": 2.0,
      "verified": true,
      "author": "DarthMauldo",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Neat Little Device",
      "text": "I bought this as a gift but couldn't help playing with it to see what it's all about. It's a real pen, with extra refill included, and the camera quality is surprisingly good given how tiny and undetectable the camera is. Hookup to computer is seamless (you need a micro SD card) and functionality is straightforward. I think I might keep it for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Awesome gadget",
      "text": "I love this product. So you can give it to your friends and have it record and do anything you want. Also in class i can record lectures and also leave it anywhere and just pick it back up. Awesome gadget",
      "rating": 5.0,
      "verified": true,
      "author": "Jian hao ou",
      "helpful_votes": 7,
      "publication_date": 20200215
    },
    {
      "title": "i'm confused!",
      "text": "I got the camera pen, in the instruction said to hold it for 2 sec to turn it on, it goes to stand by mode then hold it for 2 sec to record it, but when you hold it for the 2 sec to try to record it, the camera simply turns it self off, i don't get it.",
      "rating": 1.0,
      "verified": true,
      "author": "Piotrek",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Great spy video camera pen !",
      "text": "I really like this camera pen it’s really cool I can use it to take pictures and videos with out any one even knowing. It’s good that it’s rechargeable and comes with extra ink so I won’t run out. It has a nice weight to it and it doesn’t feel cheap either . Really good quality . I would really recommend it to family and friends. Really great pen/video camera. Keep up the great work.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 43,
      "publication_date": 20200919
    },
    {
      "title": "Looks like a pen",
      "text": "Make sure you get a micro SD card, I haven’t had the opportunity to use it yet. Didn’t know the card wasn’t included. Eventually I’ll get one. Got for my wife while she works in the medical industry, shady stuff going on with the covid.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Gets the job done",
      "text": "it's a neat concept, but don't expect iphone, samsung, or gopro quality video. Works as a pen got a little weight to it like you find on expensive pens. The pictures and description are accurate. Works well for the price paid. enjoy",
      "rating": 5.0,
      "verified": true,
      "author": "David Ross",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Small and unassuming to thieves",
      "text": "Use it to record when my door is unlocked because I’m repeatedly coming and going, works perfectly for what I needed it for. Already caught one person trying to open the lock on my desk!",
      "rating": 5.0,
      "verified": true,
      "author": "Topher Austin",
      "helpful_votes": 157,
      "publication_date": 20200719
    },
    {
      "title": "Great Buy",
      "text": "Product arrived on time and very easy to use.. i brought because someone was coming into to my office and taking things. I sent the pen up in my holder and set it up and got video and audio of how they got into my office.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Thomas",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "2 min vid used 1/3rd of SD card space",
      "text": "nice and cute. Doesn't save video all the time, able to save 2 videos and they are not compressed, so a 2 minute video used 1/3rd of the space of a 128gig SD card. I follow the directions to record video, and it hardly ever records.",
      "rating": 4.0,
      "verified": true,
      "author": "tclbbs",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Be sure you are getting a memory card wIth your order.",
      "text": "This is a very inconspicuous way to get both a video and audio recording of an event or moment for critical use even in court. My only suggestion is to make sure a memory card is included with the pen or you order one simultaneously. No one would guess it’s way more than a pen.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Boshart",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "This is an excellent camera pen!",
      "text": "The picture quality is actually better than expected. It was easy to set up and immediately watch the videos that I took. The sound is also very good. For someone who wants to dictate or take videos in conferences as well as have a very nice writing pen, this is a great investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Luvbuss",
      "helpful_votes": 9,
      "publication_date": 20200622
    },
    {
      "title": "Works good so far",
      "text": "Discreet, reliable and handy. Charges quickly and records up to 15-20 videos 5 minutes long each. The disadvantage is that it doesn’t come with sd card but has a card reader. Directions simple and easily understood.",
      "rating": 4.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Works for me!",
      "text": "This is the 1st camera of this type that I've ever owned. Picture quality for my needs are great. Have not had it long enough to see how the battery will fare. If this turns out like I hope, I'll probably be ordering 3 more. I wish I didn't have to unscrew the lower pen part to access the mini SD card or charging port, but I can live with that. Hey and the pen seems you be an added bonus. Can I get blue ink? Thanks, Jim A.",
      "rating": 4.0,
      "verified": true,
      "author": "Da Old Ref",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Cool lil gadget",
      "text": "Really clear videos and it does have audio! I read that there was no audio so I need to confirm that I can hear everything when reviewing videos. Worth the money. Now, what to use it for???",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great disguised camera",
      "text": "Great disguise for a camera. Easy to carry and travel with. I will keep this in my car in case I get pulled over. The picture quality is good for its size and able to record audio as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kai",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good Fun Gadget",
      "text": "I have ordered this as a fun gadget. I liked the idea but controls aren’t very user friendly. Picture and video quality are decent. It comes with SD card and a refill as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Surya",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Picture Quality is excellent",
      "text": "The picture quality and sound are great. It was a very good price and value. Once I read the instructions the system of clicks was very easy. It may sound simple, but the addition of extra pen refills was a huge bonus for me. I've had another brand of camera pen in the past and when the pen ran out it was difficult to find a refill to fit it. I will certainly buy another of this brand when I need another camera pen.",
      "rating": 5.0,
      "verified": true,
      "author": "Roland Yarbrough",
      "helpful_votes": 10,
      "publication_date": 20200808
    },
    {
      "title": "Works good",
      "text": "I got this to video record certain situations. It fits it's purpose although I didn't think it threw and I don't have any shirts with pockets so had to put it in pants pocket",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Nichols",
      "helpful_votes": 156,
      "publication_date": 20200623
    },
    {
      "title": "Cool, impressive, and easy to use",
      "text": "I'm actually pretty impressed so far. The pen camera is very easy to use, discreet, and a lot of fun. I'll circle back with updates but so far this one is a win.",
      "rating": 5.0,
      "verified": true,
      "author": "ufbilly",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Great product and company",
      "text": "What a great little device. I turn it on, prop it in my shirt pocket and voila I have a video record of all of my important meetings. 5 star company and product!! *****",
      "rating": 5.0,
      "verified": true,
      "author": "DBerr",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Excellent Item to record, does exactly as it says.",
      "text": "I needed an I conspicuous item to record. I bought this, let me tell you im so happy i did, the picture quality is awesome, the voice recorder is clear. Super easy to use and set up. Noone knows you are recording them. They have asked to borrow my pen, and not once have they even noticed what it was. The battery last a long time. Im really happy i purchased this, and you will be too!",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne Baker",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "nice camera , nice pen",
      "text": "the picture quality is great. looks like a normal, pen. very easy to carry ans install anywhere and record anything you want . evryone will think is a normal pen, also writes nice.",
      "rating": 5.0,
      "verified": true,
      "author": "RO",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Did not work",
      "text": "Charged it up, put a micro SD in, the device did not react to pressing the power button, and reset did not help. Now I have a fairly expensive pen",
      "rating": 1.0,
      "verified": true,
      "author": "moog",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Not bad",
      "text": "The packing is so premium, I feel like opening an expensive iPhone. The actual camera footage quality is actually decent too, compare to most other spy cam.",
      "rating": 5.0,
      "verified": true,
      "author": "Thien D.",
      "helpful_votes": 42,
      "publication_date": 20200807
    },
    {
      "title": "Great picture quality and simple to use",
      "text": "This is a great camera if you're using for meeting, etc. It has a great field of view and the picture quality is awesome. It includes ink so this pen actually writes as well. Highly recommend if you're looking for an easy way to record meetings and conferences.",
      "rating": 5.0,
      "verified": true,
      "author": "Mohay",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Great for dictation",
      "text": "I have had difficulties finding a recorder for dictation and allowing me the ability to swiftly capture details without the stress of using tape recorders or other more complex cloud based devices. This is the perfect for us in everyday academic and medical pursuits. It allows the ability and to translate conversations by having the conversation in another language without the intimidation of a traditional recorder",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Give the file a name so people know what to look for when they trying to view the videos.",
      "text": "I was excited to received the item. Don't know how view the video on my computer. It doesn't even show you a specific file for you to open, so you know what to open. Im trying to give it a chance but so far I'm not happy with this.",
      "rating": 1.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Great gift!",
      "text": "This is a great little gadget. The camera on the pen is surprisingly good. After reading the instruction manual it was easy to use. This is a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Student",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "VERY SIMPLE TO USE",
      "text": "IT WAS SUCH A SIMPLE SET-UP AND CHARGING. GOOD ENOUGH PICTURE QUALITY. ITS A VERY SLEEK DESIGN. LOOKS LIKE AND IS A REAL PEN.",
      "rating": 5.0,
      "verified": true,
      "author": "sak",
      "helpful_votes": 40,
      "publication_date": 20200925
    },
    {
      "title": "I love this pen camera!!!",
      "text": "It looks exactly like a pen but I can press the button to record whenever I feel like. It is a great camera for whatever you want to use to record the real life event. For instance, my toddler is growing fast, there are lots memories are worth to keep. Having this pen camera, I don't need to hold a smart phone any more, and he won't even notice that I'm recording.",
      "rating": 5.0,
      "verified": true,
      "author": "Helena",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Light and easy to use use",
      "text": "I like the size it's real pen my concern was about the pictures quality and the product didn’t have a memory card I have to buy one",
      "rating": 4.0,
      "verified": true,
      "author": "Mohanad Hamad",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "My little secret",
      "text": "I love the discreetness of having it laying around without anyone being non the wiser you have to add your own memory card so you can put as much or as little video you want",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Beautiful",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "work",
      "text": "did everything i was told to do and still Camera part not working will try again and see if i over looked something here",
      "rating": 3.0,
      "verified": true,
      "author": "jeff burton",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Interesting design. Works well. Doesn't come with SD card or detailed manual",
      "text": "The camera works well and the picture quality is decent. It requires an SD card but doesn't come with one so that is something to keep in mind. It also did not provide any detailed user manual so I had to figure out things on my own. It wasn't that bad though.",
      "rating": 4.0,
      "verified": true,
      "author": "Nitish Kumar Srivastava",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Short record time in my experience.",
      "text": "Only getting about 57min of recording time no matter what I do, full charge and all, new 64GB high end SD card, get 5 files at 10min, then last one always cuts out at like 7min .",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Cramer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Great Hidden Camera",
      "text": "I was looking for some small and easy to carry around when I do my walks during the evenings. This works great for me. I just slide it in my pocket and turn it on. I put a 32 gig card in and is able to capture my entire walk easily with lots of room to spare! Good price for a great device!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyuen",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Thumbs down",
      "text": "Don’t bother buying. Can’t get it to work right. Doesn’t come with memories card which you need to operate.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie C.",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Very inconspicuous; Terrible sound; bad UI",
      "text": "The sound is absolutely terrible. I recommend using a secondary device for sound. The UI is bad: starting recording a video is very similar to turning it off. But it's extremely inconspicuous, Unless you suspect it's a recording device you will think it's a regular pen.",
      "rating": 3.0,
      "verified": true,
      "author": "سبينر",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Excellent customer service",
      "text": "I had some issues in the beginning but it was resolved by them quickly. Excellent customer service and would try them out again on other products.",
      "rating": 5.0,
      "verified": true,
      "author": "quasimonk",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Very nice discreet camera",
      "text": "This camera is very small and discreet. Fits nicely in my pocket is very unnoticeable and light weight. It takes great picture and is very durable. Most pen camera I owned break easily by pressing the button this one holds up nicely and shows no sign of breaking",
      "rating": 5.0,
      "verified": true,
      "author": "Donovan",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "My little body camera",
      "text": "As someone who works in security. I use this pin to cover myself. A easy form to use a an body camera. Definitely recommend for state security officers.",
      "rating": 5.0,
      "verified": true,
      "author": "Latasha",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Awesome Spy Cam!!!",
      "text": "Spy Camera pen is super quality. The pen is sharp and no on one has any clue it's a camera. Super sweet to have!!",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "works will",
      "text": "Good for recording things that you don't want others to know you are recording. Good picture and sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Lugene Nelom",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great value",
      "text": "The pen writes well, better than expected. The box was packaged well and had all the components except for the mini memory disk. The charging is pretty self explanatory. You don't get a hard copy of instructions you have to scan a code that's given to pull up a copy online. My computer didn't agree with the software so I had to return it. if you have an up to date system you'll be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Denise Carroll",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good little device",
      "text": "Very discreet. Looks like a pen. Takes good pictures, video and audio. Doesn't come with micro SD card.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Lynn",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "That is was great",
      "text": "I liked the camera and it's video quality, the only thing is it's a little hard to figure out how to do the video but I did figure it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura J.",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Covert and convenient",
      "text": "This pen is excellent for semi-covert recording. If someone examines or handles it, it is pretty easy to tell what it is in good lighting. Otherwise, however, who cares? It's just a pen, right? Inexpensive and, if necessary, disposable solution to give a bit of backup in an uncertain situation.",
      "rating": 5.0,
      "verified": true,
      "author": "NotGivingYouMyAccoutName001",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Writes so beautifully.....",
      "text": "This pen is great. I have dexterity issues and it is thick enough I have no problem holding onto it. It is great for note taking. Easy to use and very discreet. No bright lights. Black ink. Normal size pen. Great buy! Comes with refills.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt Werden",
      "helpful_votes": 0,
      "publication_date": 20200621
    }
  ],
  "product_meta": {
    "title": "Hidden Spy Camera Pen 1080p | Nanny Camera Spy Pen Full HD Loop Recording or Picture Taking | Wireless Hidden Security Cam with Wide Angle Lens, Discrete Rechargeable",
    "description": "Capture Important Video or Pictures in Real Time with a Hidden Spy Camera Pen from SIRGAWAIN\n\nWhen it comes to protecting ourselves or remember important information, we need a smarter way to capture the world around us in real time. That’s why we created the SIRGAWAIN Spy Pen Camera that lets you record HD-quality video and pictures, so you can stay a step ahead of business, school, or your personal life.\n\nProduct Details: \n✔️ 2-in-1 Spy Camera and Pen \n✔️ Captures HD 1080P Videos and Pictures \n✔️ Compatible with PC and Mac \n✔️ 90° Angle Recording \n✔️ Up to 70 Minutes of Record Time \n✔️ Support micro SD cards up to 128 GB Class 10(not included) \n✔️ 1-Year Manufacturer’s Warranty \n✔️ 24/7 Customer Support \n\n★ Bonus Included: charging cable, SD сard reader, ink cartridges (5 pcs), cleaning cloth, pin.\n\nOne-Click Operation \nLike using a real pen our video recording uses a simple click and go design so you can turn it on or off with a thumb press.\n\nLoop Recording Feature \nOffering 70 full minutes of continuous recording our pen spy cam will automatically overwrite old footage.\n\nPersonal, Educational, and Professional Use \nUse this premier spy camera pen to remember important classroom lectures in college, protect you during business meetings, help you stay safer during travels, and so much more.\n\nClick ‘Add to Cart’ to get yours now.",
    "rating": 4.2,
    "feature_bullets": [
      "★ Ultimate Spy Recording Pen – Created to capture HD 1080P video in real time this spy pen uses a simple one-click system to let you record video, or pictures.",
      "★ Discrete, Portable Design – Our wide-angle pen spy camera wireless hidden system is small enough to fit into a shirt pocket, clip onto a notebook, or use on your desk.",
      "★ Plug and Play Compatibility – The SIRGAWAIN pen hidden camera works with Mac and PC devices and features a simple USB plug in and USB reader to transfer data.",
      "★ Fast Rechargeable Battery – This spy pen with camera features a long-lasting internal lithium ion battery than provides up to 70 continuous minutes of recording.",
      "★ Writable Pen Use – Along with its use as a hidden spy camera this pen can be used for taking notes, jotting down schedules, or remember important information."
    ],
    "specifications": {
      "Package Dimensions": "5 x 3 x 1.8 inches",
      "Item Weight": "4.8 ounces",
      "ASIN": "B0842TKJ99",
      "Item model number": "P7i",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.2 out of 5 stars527 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#1,772 in Electronics",
      "Date First Available": "January 22, 2020",
      "Manufacturer": "SIRGAWAIN"
    },
    "categories": [
      "Surveillance Cameras",
      "Video Surveillance",
      "Electronics",
      "Hidden Cameras",
      "Camera & Photo"
    ],
    "price": 37.3
  }
}