{
  "website_summaries": [
    {
      "verdict": "Compared to its older brother - the Realme 6 - the 6i loses out on a few things, but a big battery and surprisingly-premium features like NFC and a quad-camera setup still make this a compelling affordable buy.",
      "pros": [
        "Great value",
        "Huge battery",
        "Versatile cameras"
      ],
      "cons": [
        "Lacklustre screen",
        "Plastic build",
        "Middling performance"
      ],
      "aspects": {},
      "publication_date": 20200619,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Well worth the money, you won't be disappointed",
      "text": "I've only had my realme 6 a few days and I'm very impressed with the device. I have always upgraded to a newer Samsung device since 2012 and I don't think I will needing a Samsung device anytime soon. The battery lasts all day and is still at 40% by the late evening. That's with listening to music, steaming and browsing on the internet. The camera is good quality. Well worth the money, you won't be disappointed! P.S. I dont usually write reviews but this time there was no doubt 😉",
      "rating": 4.0,
      "verified": true,
      "author": "Richy",
      "helpful_votes": 32,
      "publication_date": 20200426
    },
    {
      "title": "Great phone - excellent value",
      "text": "I’ve switched from iPhone 6 to this phone and I have no regrets. I was considering iPhone SE (2020) at £419 or this at £219 and definitely made the right decision. V good functionality, long battery life and very quick. It’s like real me have taken all the good ideas from premium brands and put them into this for half the price. Moving from iOS to android takes a little getting used to but otherwise an excellent phone.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Kidd",
      "helpful_votes": 4,
      "publication_date": 20200523
    },
    {
      "title": "Overheated",
      "text": "Had big hopes but disappointed and sent back: 1) Bluetooth quality wasn't great - music cutting out compared to 2 year old phone which was faultless in that respect. This was to a device a foot away! 2) Phone overheated while running nothing except Google Maps. Device dimmed the display to stop overheating (not great when using as a satnav). Not a particularly hot day/car and again nothing I'd seen before.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve W",
      "helpful_votes": 4,
      "publication_date": 20200607
    },
    {
      "title": "Are people paid actors?",
      "text": "So came today. Straight out of the box first impressions SUPER CHEAP PLASTIC THING Screen was covered in smudges Turn the thing on Does not boot from the first time cycle one two and we are finally on Screen does not feel snappy and responsive.. 90hz????????? what where??????? huh Sloppy touch feeling registers when not even touched hickups allower the place Download my apps time to start them up Slowdowns after slowdowns wth?? WiFi just straight up does not function 5mpb when I have 100mpb Anyway right back from where it came from it goes Getting my self another umidigi thing jeez what a ride",
      "rating": 1.0,
      "verified": true,
      "author": "Martinez",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Do not buy this phone",
      "text": "Do not buy this Realme phone. There are great reviews out there for the functioning of the phone and my daughter was delighted with it, but the customer service is non-existent if you have a problem. Unfortunately she dropped the phone and almost two months later Realme have been unable to send a replacement screen to their UK repair agents. The only way to contact Realme is via an email to a Paris office and they have not responded to my messages. The UK repair agents, I believe, are trying to do what they can but continue to wait for parts and official repair instructions. Avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 3,
      "publication_date": 20200727
    },
    {
      "title": "A bargain phone - mid range at budget price.",
      "text": "A good, all round phone running Android 10. The screen is clear and bright enough. There is little bloatware. The camera (three of them) is very good. As a telephone, the loudspeaker and microphone are good and clear. The battery lasts me about 2 or 3 days and charging takes about 30 minutes max. Contrary to reports, I have not experienced it heating up The Realme overlay is not bad at all - very easy to get used to and allows as much customisation as I want. The only difficulty I had was in obtaining a cover for it - gel cases are easy come by but a full cover is hard to come by.",
      "rating": 5.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Perfect budget friendly phone with amazing specs for the price",
      "text": "Bought this for the Mrs as her old phone broke. Did some research on value for money budget phones and this came out on top. She loves it. Such good specs for such a low price. You may be losing out slightly on camera tech compared to most top end flagship phones, but still a great camera. The screen is great and having a 90hz refresh rate for this price is amazing. Easy to use and the realme UI is great. Headphone port is there which is a bonus. Couldn't recommend more for anyone who wants great specs but at a budget price. Won't be beaten in 2020",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 2,
      "publication_date": 20200607
    },
    {
      "title": "Display Issues for Realme 6",
      "text": "I returned this phone as it was very difficult to see the screen in normal daylight. I used screen brightness on manual and automatic, but sometimes even at maximum the screen was difficult to see. Aside from battery issue of always having to select very high brightness, if you can not guarantee you can see your phones' screen when You are mobile then you have weighty pocket costume jewellery. It's a shame to say because for all other aspects I really liked this phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Russell White",
      "helpful_votes": 2,
      "publication_date": 20200716
    },
    {
      "title": "Fantastic phone.",
      "text": "Spent years with apple products. Moved to Android about 18 months ago but wasn't happy with my Motorola. Thought I would give this a punt. Best phone I have owned bar none. Quick. Easy to use. Great memory. What is not to like. Especially at this price. Would be good if more accessories were available but I am sure that they will come.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 3,
      "publication_date": 20200518
    },
    {
      "title": "Didn't work .....",
      "text": "The phone I received kept locking to the \"realme\" screen - repeated, (I.E. >15 ) resets did not cure it - it just kept going back to the same screen. During this time, there was no service on the phone - no calls could get through, no texts could get through - so it rendered the phone totally useless. I see from other reviews that other people have had more luck with theirs. As a disabled person completely reliant on a phone, I couldn't keep this, so am returning it for a refund. Bit depressing really.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200712
    },
    {
      "title": "Great value phone...... with one issue",
      "text": "Very good value, great build, good camera, great battery The only issue I have had is with the Google Chrome browser, on this phone it sometimes locks up. You have to quit and reload A the app to unfreeze. Obviously there is some conflict in code or hardware design, but spoils an otherwise very responsive user experience.",
      "rating": 4.0,
      "verified": true,
      "author": "JOHNT",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great phone, great price!",
      "text": "Great phone for the price. The charging is very quick using the 30 watt charger (around 50 mins from below 10% to 95%). I get easily 2 days on a single charge, with moderate use. Camera is very good in certain conditions, but can sometimes be underwhelming. The 90hz display is great. You think it doesn't make a difference until you go back to a normal phone. Performance of the phone is pretty good too! Overall, I'm very happy with this phone. If you're looking for a mid-range phone for a budget phone price, this is the one for you 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Pattison",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Unbelievable for the price!",
      "text": "My last phone was a google pixel 2XL and the plan was to upgrade to the upcoming pixel 4a but as it seems google aren’t going to release it anytime soon I decided to go for the Realme 6 - I wasn’t disappointed! At this price point it makes you feel like all other high end flagship phones are Ripping us off. The Realme 6 feels really close to an out of the box pixel experience, I think I may even prefer it. It’s only day 3 with the phone but I love it. If you need a budget phone, get this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great phone slight prob with updating",
      "text": "Hi all this phone is really good battery is amazing when set to power saving mode how ever the system software would not up date it kept saying error i googled the issue and its a common problem with this model to update to the latest os go to realme updater website select ur model and it downloads the latest update to your downloads folder u then select the downloaded file and it automatically installs and updates ,fingers crossed theyve fixed the problemnand will auto update in the future .",
      "rating": 5.0,
      "verified": true,
      "author": "Justin M.",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Really good budget phone",
      "text": "Bought this for my wife when her Pixel 3a suffered from the major bottom speaker problem. The Realme 6 for the price is brilliant, smooth, better screen than her old pixel and my current iPhone 11 I’m typing on now. I can highly recommend the Realme 6.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great value, excellent phone.",
      "text": "Brilliant phone, great value, great camera, loads of capacity, amazing battery life, does everything well. If I picked on any minor points I'd be nit picking. It's as good as phones 4 times the price. The only reason I haven't rated the fingerprint reader is because I haven't used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Don L.",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Amazing phone full stop!",
      "text": "Wow this phone is amazing for the money and so much better than expected. I bought this phone for my wife after doing a lot of research on GSMarena and YouTube etc. My wife needed a phone that had amazing battery life and punchy speed. This phone has given her this. I was initially worried about the 720p screen but honestly I can't tell the difference from my current 1080p screen or even my old 1440p Nokia 8. Videos and games all looks sharp and crisp. She is over the moon with this phone 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Robert G.",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Haven't found a fault",
      "text": "Last time I had a phone like this it was an iphone. for less than £300 can't fault it. Very responsive, excellent screen, watching Netflix, very good contrasts. 8gb and 128 memory. If I could find any negative, I will update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnW",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Realme 6...Realme pain",
      "text": "I find this phone annoying to use...screen brightness is awful and completely useless for outdoor photos...camera quality is also really poor. Very grainy even when on the best setting. If you zoom in on a photo you have taken it is v. Poor quality. I bought this phone mainly due to thinking the camera would be good....avoid. I’ll go back to Samsung again next time. You buy cheap you get cheap. My old Samsung galaxy edge 6 is way better for photos and the screen is bright enough to see it in daylight. Don’t waste your money on this phone",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Pocock",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Rediculously Good",
      "text": "Bought this as a stop gap after a friend had talked about the One Plus and its 90Hz refresh rate. THIS IS THE BEST PHONE FOR THE MONEY IN 2020 ....................DONE Seriously buy this gorgeous phone and you will forever be questioning that £60-£80 monthly contract. I bought this as a stop gap and yes I have the Sammy Ultra now, but honestly this was a HUGE improvement over my last Sammy S9, its rediculously good Buy it Buy it Buyit, you will love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "By far the best phone sub £500.",
      "text": "upgraded from an aging iPhone 8 Plus. Fantastic cameras, great battery life and great with emulators. Flawless fingerprint scanner, legit just touch the button and the phone is instantly unlocked. Absolutely blown away. 90hz too!",
      "rating": 5.0,
      "verified": true,
      "author": "omg_its_jmilf",
      "helpful_votes": 2,
      "publication_date": 20200530
    },
    {
      "title": "Great phone",
      "text": "I did extensive research on this phone before I commited to purchase. It was delivered promptly and is a great looking and performing piece of kit. Reviews on Tech mags where spot on . Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitethorn",
      "helpful_votes": 2,
      "publication_date": 20200620
    },
    {
      "title": "Lovely phone",
      "text": "Battery life is great and charges so fast with the fast charger! Lovely camera and functions fast. Nice screen. Phone arrived well packaged and functioning. Case included so don't need to buy an additional one!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura B.",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Amazing value for money",
      "text": "After one day I absolutely love my new phone. Impressed with the camera which wasn't that important however I'm blown away with the battery which is still on 50% after 36 hours! Well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa - Northampton",
      "helpful_votes": 2,
      "publication_date": 20200525
    },
    {
      "title": "Nice design , great camera",
      "text": "Nice phone with great camera. Battery life good. Most phones offer similar performance for the price. I consider it worth the price special with this camera. Besides, a smartphone like most on the market",
      "rating": 5.0,
      "verified": true,
      "author": "Amadeusz",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "All in, a superb phone for a very sensible price.",
      "text": "I've lived on Android phone over the years and this is justifiably superb. Budget phone of the year for a whole range of reasons. Decent battery. Super spec, Limited bloatware. Looks great. Case provided. Rapid charge. Lasts for ages. Very content!",
      "rating": 5.0,
      "verified": true,
      "author": "MattC",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Good value good spec",
      "text": "Excellent phone for the price...good cameras great performance... battery is same as any other phone daily lifespan..but recharge is very quick...only thing I don't like is brightness contrast on auto up and down too much...maybe will fix on future update",
      "rating": 4.0,
      "verified": true,
      "author": "R. S. Braich",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Brilliant phone",
      "text": "love this phone to bits its brilliant. the camera gets poor reviews but take no notice its a great little camera and takes 1st class photos. love my realme 6.",
      "rating": 5.0,
      "verified": true,
      "author": "peter.kneeshaw",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "The best Android phone I ever had.",
      "text": "The best Android phone I ever had . Fast working ,long lasting battery life , beautiful camera , comes with case and screen protector . Best Best Best so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200429
    },
    {
      "title": "Good value for a quad camera phone",
      "text": "This phone is one of the best things I have put my money into. I did loads of research and I am a student so the pric did amazing. The phone fulfills everything that's required. I was at fifteen percent charge and I left to go to the bathroom, in my return I checked the charge and it was at 68% within fifteen to twenty minutes. The camera is good too but the video recording is a bit lower quality. Other than that, nothing else is something that could be better.",
      "rating": 5.0,
      "verified": true,
      "author": "N",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great value for money",
      "text": "I've only had the phone for a week, so my opinion may change one time. But, so far this phone is great. Looks good, good performance and good battery. It is a little bigger than my previous device, but that'll be down to the bigger battery. Got it on prime day too, so great value for money!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "No FM radio",
      "text": "Good phone but no FM radio that lots of sites said it had. Maybe only UK market? Anyway it's going back!",
      "rating": 3.0,
      "verified": true,
      "author": "William McDonald",
      "helpful_votes": 2,
      "publication_date": 20200430
    },
    {
      "title": "Average Phone nothing out of the line.",
      "text": "I was expecting something unrealistic with Helio G80 processor. As company claims it to be the first device with this processor. Performance is average. Camera is also average. We can look for better options at this price range. Nothing extraordinary to talk about.",
      "rating": 3.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Brilliant features and performance for the price!",
      "text": "For £220 this is a steal. Fast, gets great signal on BT mobile, and wifi calling, apps load and run fast. Camera us better than my S9 galaxy, and it runs smoother. No issues on 5ghz wifi, looks great. Charges from empty to full in less than an hour. Brilliant!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Loved It",
      "text": "This is an amazing mobile, yet when it had an OS7 update the screen whenr very dark, no matter what I did to try and change it.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Mordew",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Terrific value for money. Very impressed.",
      "text": "Amazing phone for the price. Battery is a terrific. Screen is very good. Camera could definitely be improved upon though.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Good budget phone",
      "text": "I really love the camera on this phone, the wide angle lens is very good and the selfie camera is quite clear. There are a good range of phone cases available from eBay and alliexpress. It can lag a little loading up the home screen apps when I have a few strenuous apps open. It charges quite fast more me and I haven't had any worrying issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Destiny",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Blown away",
      "text": "Brilliant phone, met every expectation. Really good valhe, very fast, long battery life, really nice big screen, great interface. Easy to use and a great upgrade from my iPhone 6s.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Fairall",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "very impressed",
      "text": "it does all the things a phone should do, quickly, battery lasts well. I can't think of a reason not to buy",
      "rating": 5.0,
      "verified": true,
      "author": "Distrubbed",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "It's a great phone for the price",
      "text": "I decided to buy this rather than go into contract. It has a great screen and the fingerprint reader is very fast. There is plenty of memory and the loudspeaker is actually quite decent. This is the best phone you can get at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "neil1982",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great cameras",
      "text": "Great phone. Not blotted with oem software. Really happy with the phone. Cameras are brilliant",
      "rating": 5.0,
      "verified": true,
      "author": "Nigel",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Very good phone.",
      "text": "Very satisfied with the phone so far. I have it for approximately two months now. Fulfilling all my needs very well. Very clear and good quality screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Rudi3",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Buy it now",
      "text": "Wow what an amazing phone, really happy already and I've had it less than 6 hours, if you're reading this to decide then buy it NOW",
      "rating": 5.0,
      "verified": true,
      "author": "Fayzerman",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Good value for money",
      "text": "Amazing phone for the price, the display can a bit dim on the sunlight. However, good performence, good battery life, amazing charging speed and a good main camera and portrait camera. However, ther other camera are a bit of a joke with no sharpness what's so ever. Good value for money",
      "rating": 5.0,
      "verified": true,
      "author": "Anub biju",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "a  great upgrade from my old phone",
      "text": "I enjoy the speed and ease of use not being a technophile",
      "rating": 5.0,
      "verified": true,
      "author": "patrick",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great",
      "text": "Perfect for my brother just starting high school. Great budget smartphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaida",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great value phone",
      "text": "Very impressed with the phone. Camera could be better but still very good. Comes with a decent case to keep it scratch free. The weight of the phone feels good and distracts from the slightly plastic feel. Great screen in every way. Overall very impressed and especially at the price point who can argue?",
      "rating": 5.0,
      "verified": true,
      "author": "stephen taylor",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Love this phone!",
      "text": "Was recommended by a friend and so glad I bought it... It out rates a lot of the high end phones.",
      "rating": 5.0,
      "verified": true,
      "author": "sharon ",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Call recording is disabled!  Extremely disappointed.",
      "text": "Apart from the great reviews, the 2 main reason I bought this phone were: 1. Dual Sim 2. Call recording I checked before buying that the phone had these features, but on the one I was sent Call Recording is disabled. I can't really carry on using a phone without this feature.",
      "rating": 2.0,
      "verified": true,
      "author": "David W.",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Good phone with big screen",
      "text": "Nice and big phone, really love the big screen. Battery lasts for a day. Does the job well. The only thing is that it gets stuck from time to time when I am browsing the internet but it might be due to slow internet connection as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great value for money very happy with it",
      "text": "very good phone easy to use great things on it i like a lot well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Mark South",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great phone",
      "text": "Read the reviews and chose the realme 6. What a great phone really pleased so far. Was a little concerned it may be a bit large for pocket etc but is fine. Great battery and screen amazing. My iPhone using wife is considering a change to realme.",
      "rating": 5.0,
      "verified": true,
      "author": "K Revis",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Price, Very much VALUE FOR YOUR MONEY.",
      "text": "Very well made, good battery life, so very easy to set up, great price, great clear screen.MARVELLOUS. SO GLAD THAT BROTHER AND I BOUGHT ONE EACH.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Good value",
      "text": "Very good phone for the price. Nice camera, and smooth operation",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick O'Riordan",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "It gets hot on charge if you are also using at the same time as charging",
      "text": "This phone will get extremely hot in prolonged use ,i.e. gaming to the point of shutting down, however in normal use it is absolutely fine and lasts for 2 days, specs are good for the price",
      "rating": 4.0,
      "verified": true,
      "author": "turtle",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Excellent phone according to the price",
      "text": "Very good phone with crystal clear screen and some great futures working fine and smoothly photos and video quality are excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Sanjay Pala",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Best bang for buck phone out there",
      "text": "Probably the best value phone I've ever owned. Everything is done well. Price is amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Simon Taylor",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Good cheap android phone",
      "text": "The battery life is amazing. Two days I can get out of one charge. Nice big screen. Fast and responsive. Cheap.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack Powers",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "VG camera phone, excellent value for money",
      "text": "The only thing I find disappointing is the fingerprint reader. I use the Realme 6 for phone calls, emails, texts, photos, videos, browsing the web, making online purchases, banking - all of these no problem. Great buy overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheila J. McAulay",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Battery lasts 2 days.",
      "text": "Great phone, bargain price, amazing battery life. Perfect after not wanting to get another Huawei because of the Google issues.",
      "rating": 5.0,
      "verified": true,
      "author": "katcod",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "1000 pounds for iPhone why ?",
      "text": "Had this phone almost a week now. Early days I know but wow for the money am I impressed or what ?",
      "rating": 5.0,
      "verified": true,
      "author": "stephen henson",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great phone",
      "text": "This is a fab phone, great quality and features for the price. Battery life excellent. Easy to use when you’ve had androids before. Everything loads up from Google.",
      "rating": 5.0,
      "verified": true,
      "author": "DL P.",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "REALME 6 SMARTPHONE",
      "text": "THE SMARTPHONE IS VERY COOL TO USE. TEXTING--VIDEO CALLING, JUST BASIC STUFF",
      "rating": 5.0,
      "verified": true,
      "author": "Norman O.",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Best phone under £250",
      "text": "My first realme phone and I have to say it's a contender for one of the best budget phones out there. I I have had it for about 3-weeks and everything is working fine",
      "rating": 5.0,
      "verified": true,
      "author": "colin taylor",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Not bad...",
      "text": "Some times processers may slowdown the applications. Otherwise everything okay..",
      "rating": 4.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Realme screen is glitching",
      "text": "It is a good phone but today I couldn't control the screen as it went crazy and I had to restart it so it went back to normal. Disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "nejoud",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "great for the price",
      "text": "cant fault phone for price does everything it should and more. tiniest niggle instructions are not that great battery life seems brilliant",
      "rating": 5.0,
      "verified": true,
      "author": "thomas shaw",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "No airphone",
      "text": "No GPS accuracy even it doesn't show your location I m replacing it just in 2 hours There was no airphone with this phone",
      "rating": 4.0,
      "verified": true,
      "author": "Siddhartha sapkota",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great value",
      "text": "Awesome phone with all the spec you would expect and much more for the price",
      "rating": 5.0,
      "verified": true,
      "author": "paul nunn",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "So much for your money",
      "text": "Love this phone, you get so much firvtheoney, cannot fault it.",
      "rating": 5.0,
      "verified": true,
      "author": "alison priestley",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "great price for a lot of phone",
      "text": "easy to set up. Arrived quickly great screen and camera and upto date operating system.",
      "rating": 5.0,
      "verified": true,
      "author": "williams roger",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Amazing for the price",
      "text": "Love this phone. So good for a mid range Smart phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs M J Wildey",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great mid range phone",
      "text": "I bought this for my wife to replace her Moto G7 Plus. I was in 2 minds whether to buy the newer Motorola but decided on this instead based on the internet reviews and specs. It's not a Samsung S20, but then it's only 1/4 of the price of the Samsung. For the money I challenge anyone to find a phone with equivalent specs. Pro's - Price, screen quality, battery life, camera, power (in this price range) Con's - Plastic back/body The only negative is that the body and rear is plastic rather than the usual aluminium/glass of the more costly alternatives. It still looks good, just not too sure how it would stand up outside of a case.",
      "rating": 5.0,
      "verified": true,
      "author": "davemann75",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Quite a few small niggles with realme UI",
      "text": "Three months down the line. The phone itself is good. The camera is good. Battery is good. The screen is good. What let's it down for me is the realme UI. It's not one major thing, it's quite a few little niggles. I thought I'd get used to them over time but I haven't. In my opinion this phone is spoilt by realme UI.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew ",
      "helpful_votes": 2,
      "publication_date": 20200620
    },
    {
      "title": "BEST SUB £250 PHONE ON THE MARKET",
      "text": "Had this one wk. Forget iPhone,Samsung this is high spec at a quarter of the price. The refresh rate and speed is next level. I have a Vodafone sim in and it works fine. Even the bumper case included is good while I wait for my new preferred case to arrive. 1hr charge from 0% is a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "shrek",
      "helpful_votes": 2,
      "publication_date": 20200530
    },
    {
      "title": "Better than expected",
      "text": "Needed a dual sim phone and on checking reviews the Realme 6 came out highly regarded. Ordered 8GB + 128GB model. Delivered next day, well packaged in box. Supplied with Fast charger, cable, plastic cover. Couldn't find a pin tool for the SIM card tray but luckily had one from a previous phone. Phone was not as chunky as I was expectingand was quick to boot and immediately updated following set up. Phone is responsive and the finger print and facial recognition work well. The camera is excellent but need to manually select 64MP. Only in first 24 hours but battery usage is good, no drop outs on WiFi so looking promising",
      "rating": 5.0,
      "verified": true,
      "author": "John Williams",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Good mid price range phone. Let down by touch screen.",
      "text": "I dislike the calibration of the touch screen. At times it easily misses letters when typing. Swipe keyboard is a must to make any king of progress when typing. Often have to tap more than once to get an app or link to respond. As with most phone screens, absolutely useless in full sun. I'm not a lover of the teardrop camera but oh well. I love the battery life. Would I but it again - no.",
      "rating": 3.0,
      "verified": true,
      "author": "Deke",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "What a brilliant smart phone.",
      "text": "Superb phone, easy to set up following the tutorials in YouTube. Took less than an hour to get all my favourite apps loaded on it and grouped in folders that make sense to me. Very easy to transfer all the contacts from my old phone. I've been trying the camera(s) out this morning, very good results. There's no need to pay anymore for a phone when you can buy this one.",
      "rating": 5.0,
      "verified": true,
      "author": "john hannon",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "So far so good",
      "text": "Really impressed with this phone, superb features and an outstanding camera setup",
      "rating": 5.0,
      "verified": true,
      "author": "lee",
      "helpful_votes": 2,
      "publication_date": 20200501
    },
    {
      "title": "Outstanding phone!",
      "text": "I was so surprised at the quality of this phone, lots of phone for a budget price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Chamnan-Roberts",
      "helpful_votes": 2,
      "publication_date": 20200504
    },
    {
      "title": "Excellent budget phone",
      "text": "Had this budget phone for over a month or so now. Very impressed with functionality so far. Not used camera hardly so can't comment on that at the moment.. photos taken ok. Very easy on the eye and easy to use and reliable for general phone usage. No issues with response and although it only has LED display the 90Hz response rate makes up for this shortfall to some extent. Would recommend for someone not looking to spend over the odds for a new phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "No call recording even though it's legal here",
      "text": "Can't record calls, even though it's legal here for personal use. Screens pretty nice. Runs well, but does show down, but a clearing of the background apps speeds the phone up",
      "rating": 4.0,
      "verified": true,
      "author": "ian a",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Ok but had to return it due to faulty screen",
      "text": "Good value for money overall but had to send mine back due to screen not recognising my touch input at times. Was refunded quickly though. Probably wouldn't go for a Realme again though.",
      "rating": 3.0,
      "verified": true,
      "author": "Simple Riks",
      "helpful_votes": 2,
      "publication_date": 20200821
    },
    {
      "title": "Why spend more?",
      "text": "After reading a few reviews I bought this as a replacement for my aging Moto G7 instead of the latest Moto G range, I was not disappointed. The battery life is great, it comes with a flash charger, and the fingerprint unlock is on the power button and is amazingly quick. It even comes with a case.",
      "rating": 5.0,
      "verified": true,
      "author": "SVB",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Quick to get up and running!",
      "text": "I'm really enjoying using this phone. The only time the face recognition doesn't work is when wearing a mask which I keep forgetting I have on! The cloning of my previous phone went very smoothly and therefore the transition to using the RealMe was effortless.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms J. A. MacDonald",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Good features for not too expensive phone",
      "text": "After years of Iphones & with the costs rising year by year, I decided to get something else. Read reviews & all sounded good for my requirements & at a reasonable price, so took chance on a fairly inexpensive phone, Up till now, no bad experiences & battery life is really good",
      "rating": 5.0,
      "verified": true,
      "author": "C. Badasha",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Brilliant phone - totally recommend",
      "text": "Purchased by my 12 yr old son. He wishes he could give it more stars as he loves it. He wanted and iPhone but as he was paying for it himself we thought this was a better price point. He is very happy with the decision. Battery life and camera are fantastic. It looks amazing. Can’t recommend enough. Really good phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "If operating the phone without case and you press the on button and vol it goes into recovery mode",
      "text": "Great value for money and great features. A warning about accidentally getting into recovery mode. I was about to send the phone back as it appeared frozen but tech help solved the problem. (Press off while holding vol up/down.)",
      "rating": 4.0,
      "verified": true,
      "author": "J. H. Wells",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "A good price for the spec",
      "text": "Got to say this phone is really good the realme 6i camera has hdr excellent quality I'm impressed with the phone generally.android 10 to",
      "rating": 5.0,
      "verified": true,
      "author": "MARK",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "At least a good phone off Amazon",
      "text": "This is a real good phone had it a day but sofare really good very happy with it this one is a keeper",
      "rating": 5.0,
      "verified": true,
      "author": "roy",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Amazing smartphone",
      "text": "Really impressed with this phone. Easy to use by a technophobe like me! Has everything you need for a great price and charges super quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah V",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "long battery charge",
      "text": "very pleased with this purchase easy to operate, battery last four days once fully charged",
      "rating": 5.0,
      "verified": true,
      "author": "DMcDonough",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Good overall. Bad camera.",
      "text": "Good overall experience. The camera is not great but for a 150£ phone you can not ask for much. But just bear that in mind.",
      "rating": 4.0,
      "verified": true,
      "author": "Mikel M",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "The battery life is fantastic",
      "text": "Absolutely love this fone. The battery life is amazing, it's laster 2 and a half days on 1 charge and the quick charge is fantastic, iv never had a fone charge so quick in my life",
      "rating": 5.0,
      "verified": true,
      "author": "Emma Robertson ",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Arrived with a trojan already in phone",
      "text": "Arrived with a trojan already in phone - date of infection prior to purchase. Returned to Amazon. Appeared to be a good phone until security checker (McAfee) installed. Good battery life.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony L",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "don't buy",
      "text": "it brake after a week. I could not turn it on anymore after a normal use. This is a clearly cheap and defective smartphone. Buy Samsung",
      "rating": 1.0,
      "verified": true,
      "author": "daniela",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Amazing value",
      "text": "The is a great phone, great battery life, everything you need and truly amazing value for money",
      "rating": 5.0,
      "verified": true,
      "author": "K. S. Alexander",
      "helpful_votes": 0,
      "publication_date": 20200905
    }
  ],
  "product_meta": {
    "title": "realme 6i – 4GB + 128GB, 6.5” full screen display, Sim Free, 48MP AI Quad Camera, 5000 mAh quick charge battery, UK version – Green Tea",
    "description": "Colour Name:Green Tea| Size Name:realme 6i 128GBUnleash the Power. realme is a technology brand officially established on May 4, 2018 by Sky Li. The aspiration of realme is to provide products with a comprehensive superior experience for the young, and realme is committed to be a trendsetting technology brand.",
    "rating": 4.5,
    "feature_bullets": [
      "Included components: SIM card needle",
      "Operating system: Android"
    ],
    "specifications": {
      "Batteries": "1 Lithium Polymer batteries required. (included)",
      "Package Dimensions": "17.7 x 8.9 x 7.8 cm; 270 Grams",
      "Date First Available": "3 April 2020",
      "Manufacturer": "realme",
      "ASIN": "B086PG93DH",
      "Delivery information:": "We cannot deliver certain products outside mainland UK ( ). We will only be able to confirm if this product can be delivered to your chosen address when you enter your delivery address at checkout.",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "SIM-Free & Unlocked Mobile Phones",
      "Electronics & Photo",
      "Mobile Phones & Smartphones",
      "Mobile Phones & Communication"
    ],
    "price": 211.47
  }
}