{
  "website_summaries": [
    {
      "verdict": "Coming from the Z/Volv Collection, the Z/Volv 2 is yet another masterpiece by Chaco designers for encapsulating comfort and performance quite admirably. Its cushy footbed, spot-on fit and sizing, and versatility received admiration and commendation. However, to get the most out of it, it seems that one must put up with a reasonable breaking in period. To conclude, the Chaco Z/Volv 2 is a tried and trusted multi-sport sandal which should not be despised with its breaking in requirement.",
      "pros": [
        "Numerous satisfied wearers hailed the footbed as superbly comfortable",
        "They stated that its comfort level was perfect for them",
        "The Chaco Z/Volv 2 was easy to adjust, as testified by plenty of users",
        "A multiplicity of consumers mentioned that this was their favorite shoe of all time",
        "They valued its versatility",
        "This multi-sport sandal fit scores of outdoor lovers impeccably",
        "Umpteen Chaco loyalists gave thumbs up to the pair for being lightweight",
        "It runs true to size, according to an abundance of pleased users",
        "A decent number of owners—from both gender camps—loved the successful marriage of design and colors in the Z/Volv 2",
        "Several Chaco supporters deeply admired the sandal’s amazing arch support",
        "Its fantastic grip performance over a variety of terrain types got a handful of wearers extremely satisfied"
      ],
      "cons": [
        "Some buyers were a tad frustrated with the sandal",
        "They did not like their first few days with the pair as it caused them blisters",
        "A low percentage of wearers observed that the toe loop was cutting off the blood circulation in the big toe"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.5,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very comfortable!",
      "text": "I'm not gonna lie, these might not be the most \"swag\" things ever, but dang... comfy AF. Great for summer and really to wear anywhere and any time of the day. People will either love you or hate you for wearing these, but you know what? I love wearing them and confort is great. Do yourself a favor and get a pair of these bad boys. Note: I typically wear size 10-10.5 in regular shoes, but the 10s of these chacos were a little big on me. Had to order 9s and they fit great. Just a heads up if one is wondering.",
      "rating": 5.0,
      "verified": true,
      "author": "Paolito",
      "helpful_votes": 5,
      "publication_date": 20170713
    },
    {
      "title": "Best sandals ever, and not as heavy as normal Chacos",
      "text": "Best sandals ever, and not as heavy as the normal chacos. These are super adjustable. Can wear them in wet conditions, great for hiking, and most every other conditions. I don't think I would run in them, but if you really wanted to, I'm sure you could. There are better barefoot style shoes for that. NOTE: the \"2\" version Chaco sandals have the toe ring, but this can also be tightened down flat if you want to wear without the toe ring... Like if you play sports and wear these with socks after a game.",
      "rating": 5.0,
      "verified": true,
      "author": "c",
      "helpful_votes": 3,
      "publication_date": 20170614
    },
    {
      "title": "I have worn Chacos for 20 years",
      "text": "I have been wearing Chaco sandals for 20 years now always happy with them, I order men's sizes because I have wide feet and finding good sale prices in women's wide sizes in colors and the style that I like are limited. The styles with the big toe trap Z2 are the most stable for walking on uneven ground, climbing, or walking or climbing on rocky terrain. The ability to have them re-webbed and re-soled is an added feature with this company, as well as custom orders.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri B.",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Very Comfortable",
      "text": "I was actually more pleased than I thought I would be. I was not sure about liking the toe strap, but I had tried on a pair of the ones without and thought ‘ehh’. So I ordered the Zvolve 2 and I was really impressed how thy fit. I do not like straps against my pinky toes because of chaffing and these do not. The adjustments work very well and I can recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "Awesome!",
      "text": "I bought these for my fiance for our honeymoon to Europe. While we haven't gone to Europe yet, he has been wearing these nonstop and loves them. He has flat feet so the arch support is awesome. The distress pattern is one of the least ugly Chaco's we've seen. Without a doubt, these are his new favorite shoes. These were true to size for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 2,
      "publication_date": 20170331
    },
    {
      "title": "Pretty good deal.",
      "text": "They’re a little different than I’m used to (old school Teva wearer) but they’re more comfortable and supportive than my old Tevas. All in all, They’re a pretty good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "rss",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Amazing support",
      "text": "This is my second purchase of Chacos for my hubby. He and I both love them so much. They provide the summer sandal with the needed support for our feet. Although some find them difficult to adjust, we have found the diagram very helpful and it easy to adjust these. If you are looking for sandals that support your feet look no further! Chacos are amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Tirzah Bourque",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Best sandals",
      "text": "Bought as a birthday gift. Last pair had worn out after tremendous wear. Look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Srb",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great so far!",
      "text": "My wife recommended Chacos, since she wears them for foot, knee, & hip problems. I just got them because I wanted something ergonomic, comfortable, & not Tevas. These have been great so far, a little stiff, but I understand that they need a break in period. The fit is perfect for me (size 8 regular width with toe loop), & they're so much easier than Tevas to get into & out of. Definitely would recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "curiousGoJ",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Perfect for the outdoors",
      "text": "Bought them to fish in but wear them all the time now. Wears well in water and aids stability. Do have to readjust the straps once a week or so.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Zachry",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Comfortable and durable.",
      "text": "These held up really nicely on a few hikes so far and were comfortable throughout the journey. I hope they last as long as other reviews say they will.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister Smith",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Love Chacos",
      "text": "I love wearing chacos and this pair fit perfect. The design is beautiful and it works as a unisex shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley Witvoet",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Great hiking sandal",
      "text": "Great sandal for hiking or strolling on the beach. Excellent traction in the mud. Comfortable for all day walking/hiking, sandal is fully adjustable and supportive. Washed well after getting muddy.",
      "rating": 5.0,
      "verified": true,
      "author": "CFitz00",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Size down!",
      "text": "I just had to go a size down from what my boyfriend normally wears and now they fit him great. He loves them!",
      "rating": 4.0,
      "verified": true,
      "author": "LW",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "I absolutely love these!",
      "text": "I absolutely love these!!!! When i strap em on they feel like Power Ranger Boots like I could kick through a brick wall!",
      "rating": 5.0,
      "verified": true,
      "author": "Mavistark",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Worth the money",
      "text": "When I heard my friends talk about how cool Chaco's were, I had my doubts. There was just no way I was going to spend around $100 for a pair of sandals. Some time went by, and I had an opportunity to try them on for myself, and I was sold. I enjoyed the easily adjustable straps, the arch support, the style, and just the overall feel of the shoe. It was then that I went on here to buy them, and I wear them often! (the sale that was offered to me at the time was nice, too.)",
      "rating": 4.0,
      "verified": true,
      "author": "logan garner",
      "helpful_votes": 2,
      "publication_date": 20150812
    },
    {
      "title": "Built great, loves the color & he says they are ...",
      "text": "Bought these for my husband on Amazon because our local store did not have his size. He loves them! Built great, loves the color & he says they are comfortable! So far, he has worn them everywhere except for work!",
      "rating": 5.0,
      "verified": true,
      "author": "nurselauren83",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Love them. Very lightweight and comfortable",
      "text": "Love them. Very lightweight and comfortable. Liked them enough that I bought my girlfriend a pair too. They are much lighter than my Yampa 2 sandals which I've had for 2 years and cannot seem to wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark P Gardner",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Gift for my Boyfriend",
      "text": "I ordered these as a gift for my boyfriend and he absolutely loves them. They fit great.",
      "rating": 5.0,
      "verified": true,
      "author": "Eden G.",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "too bad they don't make shoes",
      "text": "my second set. the first set when ~10 years. i'll never buy another brand of sandal.",
      "rating": 5.0,
      "verified": true,
      "author": "Eliza Billadeau",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Good product",
      "text": "Very comfortable sandals. Extremely durable and good in most types of terrain",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Five Stars",
      "text": "Husband was so delighted to get these for his birthday. Wears them everywhere",
      "rating": 5.0,
      "verified": true,
      "author": "rachael",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "AWESOME HIKING SANDAL",
      "text": "Love these Chaco's. I bought a lighter pair for hiking throughout Yosemite over Labor Day, and they were incredibly durable. I wore them the entire time and didn't have any arch problems, blisters or strap abrasion. I would recommend a pair of Chaco's to anyone looking for a light, sturdy, durable sandal.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D. Stillwagon Jr.",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Five Stars",
      "text": "I bought these for my husband. He has narrow feet and loving his Chacos.",
      "rating": 5.0,
      "verified": true,
      "author": "periwinkle",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Blisters form",
      "text": "Blisters tend to form if you walk in them for too long as soon as you get them. After using them for a while that goes away.",
      "rating": 4.0,
      "verified": true,
      "author": "Donnie",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "The Zvolv are comfortable enough for all day wear",
      "text": "I'm really enjoying these sandals. I had tried previous versions of this shoe but always found them way too heavy. The Zvolv are comfortable enough for all day wear.",
      "rating": 5.0,
      "verified": true,
      "author": "El Iron Sumo",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Best quality water sandal",
      "text": "Great Quality, cool style, cool feet. Everybody loves them so I bought them, now I love them too!",
      "rating": 5.0,
      "verified": true,
      "author": "modmic3000",
      "helpful_votes": 0,
      "publication_date": 20160130
    },
    {
      "title": "Not for high arches",
      "text": "The toe loop makes me feel like the knuckle is going to snap. Two weeks of use and they're going to Goodwill.",
      "rating": 2.0,
      "verified": true,
      "author": "Ian Weinstock",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "Very lightweight",
      "text": "Much lighter than the original pair of Chacos my husband is replacing. Fit as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Petty",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Love Chaco sandals.",
      "text": "Got a great deal on these. Love chacos...have about 6 pairs",
      "rating": 5.0,
      "verified": true,
      "author": "Nickboughtit",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Love them!!",
      "text": "Love them and great price online compared to the local mountain high price!!",
      "rating": 5.0,
      "verified": true,
      "author": "David Lewkowicz",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Five Stars",
      "text": "Although hubby has to get used to the strap between his toes, the shoes are awesome",
      "rating": 5.0,
      "verified": true,
      "author": "gaye",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Nice pair",
      "text": "Bought this for my friend as a gift. He liked them and still wears them today. He was very pleased with the size and i was happy that he was. I was scared they were not gonna fit, but they did and i was relieved",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Robinson",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "New AND improved? Didn't think it could get better",
      "text": "I'm a long time Chaco fanatic, having over 8 pair spanning 10+ years. Can't go wrong with this Amazon listing. The new Zvolv is AMAZING. Keep in mind - In 2008, Chaco enlarged their footbed from the older versions, which made them more true to size. I am a 9.5-10 in most shoes. I used to fit into the M-9 comfortably. The newer version M-10 is now a perfect fit for me. The new M-9 seem like they would fit, but are too narrow and the straps give me blisters after extended use. When in doubt, try a retailer",
      "rating": 5.0,
      "verified": true,
      "author": "Alex H.",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Great arch support",
      "text": "Great arch support, try not to strap ankle strap to snug, better comfort and still doesn't try to slip off foot.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn T Meiring",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "It is good quality but ,...",
      "text": "Heavier than expected and the excess strap length is a bit annoying...",
      "rating": 3.0,
      "verified": true,
      "author": "Steely",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "Love my Chacos, super comfortable and rugged, be sure to order 1/2-1 size down",
      "text": "Love my Chacos. I wear a 9.5 dress shoe and 10 sneaker, but these size 9 Chacos fit perfectly on a walk along the rim of the Grand Canyon.",
      "rating": 5.0,
      "verified": true,
      "author": "xolchei",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Feels great!",
      "text": "Fits well in my feet and I love wearing them all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerardo Santiago",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Absolutely love these sandals",
      "text": "Absolutely love these sandals. I've worn them hiking in the deserts of California to the mountians of Montana. Hands down best sandal for on and off the trail!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "I was disappointed with the sizing in these sandals",
      "text": "This was my first pair of Chaco sandals. I was disappointed with the sizing in these sandals. I typically wear a 13, but these were fairly large. Chaco sandals will always be my favorite sandal though due to their arch support and firm design. I ended up giving them away to someone who they fit. They are expensive, but the money is well worth it when buying Chaco sandals.",
      "rating": 2.0,
      "verified": true,
      "author": "Zach Weber",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "They worked wonderfully in all the water activities he did",
      "text": "Bought these for my son before he left for camp. They worked wonderfully in all the water activities he did. Big fan!",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen Blevins",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "These sandals are great for everyday use",
      "text": "These sandals are great for everyday use. Whether it be a walk in the park or just hanging out with your friends these chacos feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob D",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "... told to get a size smaller but i still love my chaos and will keep them",
      "text": "I wish I would have been told to get a size smaller but i still love my chaos and will keep them.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Driver",
      "helpful_votes": 0,
      "publication_date": 20170218
    },
    {
      "title": "... the canyons of the Colorado river and they done great! So comfortable",
      "text": "Just hiked miles in the canyons of the Colorado river and they done great! So comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "cole smith",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Five Stars",
      "text": "Look & fit exactly as expected. Received in 3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorri Roof",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "... while to get the straps to where they fit comfortably around the whole foot and toe",
      "text": "Takes a while to get the straps to where they fit comfortably around the whole foot and toe, but once that is figured out they are great. Like any shoe the more they are worn the more comfortable they will get. 4 out of 5 only cause I've had them a week, so they are not broke in yet. Only other complaint is that the end strap is too long and I step on it often, so i may have to cut it or something. I definitely recombined overall!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Brooks",
      "helpful_votes": 4,
      "publication_date": 20150426
    },
    {
      "title": "Very comfortable sandal. I use them to walk near rivers ...",
      "text": "Very comfortable sandal. I use them to walk near rivers and lakes, very convenient that they can get wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah L",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "... not too much to say here besides I am super happy and content to have purchased these chacos for ...",
      "text": "There is not too much to say here besides I am super happy and content to have purchased these chacos for my Aruba trip. They fitted my exact foot size and were very comfortable to use in the warm 81 degrees weather. I wore these shoes for the entire time of our trip which was 7 days and I have no complaints at all.",
      "rating": 5.0,
      "verified": true,
      "author": "AllenDrones",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "These are awesome.",
      "text": "So far wore these all day and these have to be the most comfortable shoes I've ever owned. I must say these have me as a believer of my friends who also own these. Will definitely order more if the need ever arises.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Five Stars",
      "text": "Perfect for outdoor activities. A little wide but the straps make it work.",
      "rating": 5.0,
      "verified": true,
      "author": "Addicted to Books",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "Chacos make you catch bigger small mouth",
      "text": "They fit well and keep me sure footed enough to navigate the rivers and creeks of rural NW Arkansas.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Paul Thomas",
      "helpful_votes": 2,
      "publication_date": 20160802
    },
    {
      "title": "Great Hiking Sandals!",
      "text": "Me and my husband both ordered a pair of chacos from Amazon. My husbands ( this pair) ran small and it took a while for him to get the straps exactly right, but once he got the straps right he loved them. It takes a while to break them in. He loves to camp and hike so these have came in handy for his trips! When he got them wet they didnt rub blisters on his feet like other sandals have. Over all these are perfect for outdoors.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica Draine",
      "helpful_votes": 2,
      "publication_date": 20161005
    },
    {
      "title": "Fell for the hype",
      "text": "They're sandals. Not the most comfortable and I'm honestly disappointed considering all the love these get online. They're expensive to boot.",
      "rating": 3.0,
      "verified": true,
      "author": "JZ",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "displeased with product as it says is adjustable. No ...",
      "text": "displeased with product as it says is adjustable. No room for adjusting on these things, but maybe by a fraction! They should be listed as only for very narrow feet.",
      "rating": 1.0,
      "verified": true,
      "author": "Dt - posted FB",
      "helpful_votes": 0,
      "publication_date": 20170325
    }
  ],
  "product_meta": {
    "title": "Chaco Men's Sport Sandal",
    "description": "What happens when you take proven Chaco technology – like pull-through adjustable webbing straps and our LUVSEAT PU footbed – and marry it with modern design? It might look something like the Z/Volv 2. Featuring contemporary aesthetics, classic Chaco design features, and an airy PU compound that’s softer underfoot and 20 percent lighter than our Classic Z sandals, the Z/Volv 2 is the ultra-light sandal you’ve always wanted.",
    "rating": 4.7,
    "feature_bullets": [
      "Polyester jacquard webbing upper wraps around the foot and through the midsole for a customized fit Toe loop for secure fit",
      "Adjustable and durable high-tensile webbing heel risers Injection-molded ladder lock buckle",
      "Sole: Rubber",
      "Closure: Hook and Loop",
      "Heel Type: Flat",
      "Shoe Width: Medium",
      "Lightweight LUVSEAT PU midsole Extra-soft PU compound Irregular, grid-inspired texture on footbed for traction",
      "Vegan-friendly construction Non-marking EcoTread 25%-recycled rubber compound 3mm lug depth"
    ],
    "specifications": {
      "Product Dimensions": "30.48 x 15.24 x 12.7 cm; 294.84 Grams",
      "Date First Available": "4 Feb. 2015",
      "Manufacturer": "Chaco",
      "ASIN": "B00NXM99N6",
      "Item model number": "ZVOLV 2-M",
      "Department": "Men’s"
    },
    "categories": [
      "Shoes",
      "Sandals",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 109.37
  }
}