{
  "website_summaries": [
    {
      "verdict": "No matter which of the trio of 13” models you choose, this MacBook is a solid option for coders, musicians, and photographers who need to improve their productivity.",
      "pros": [
        "Bright and colorful display",
        "Convenient Magic Keyboard and Force Touch trackpad",
        "Up to 4TB of storage",
        "Great for work and gaming alike",
        "Speedy 4-core processor",
        "Rich sound"
      ],
      "cons": [
        "Excellent, but not nearly as impressive as the 16” version"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "New 2020 13 is amazing!",
      "text": "This is my first mac computer and coming from windows based computers this thing is amazing. I don't think ill ever go back to a windows pc. As with all apple products the quality and feel is the best. As for the computer itself it arrived in perfect condition and a day early. The new 2020 13\" works flawless absolutely zero issues with setup and initial operation as is expected with the apple premium paid. If you're debating on switching to macbook pro or upgrading your older macbook I don't think you'll be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "orion186",
      "helpful_votes": 178,
      "publication_date": 20200525
    },
    {
      "title": "Fast and powerful computer",
      "text": "Very good product, I am very happy with this purchase. Powerful and fast. Only downfall is that a pro model at this price and it only has 2 usb-c ports?, I think it will work fine for me but might be a big problem for people that use multiple add on items for recording audio and video at a higher quality that what the computer itself can produce. If u want more than the 2 usb-c ports you have to upgrade to the 1799 price model.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 68,
      "publication_date": 20200606
    },
    {
      "title": "Excellent upgrade",
      "text": "Excellent computer. Worth the upgrade my air. Keyboard is much quieter too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mattenasio",
      "helpful_votes": 71,
      "publication_date": 20200516
    },
    {
      "title": "Perfect",
      "text": "Got exactly what I was hoping for and it came in perfect condition. 100 percent satisfied and I never write reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Hong",
      "helpful_votes": 66,
      "publication_date": 20200520
    },
    {
      "title": "Apple’s biggest disappointment.",
      "text": "Apple really dropped the ball on their logic board engineering. This machine is vastly underpowered, and to make it worse lacks a well-thought-put cooling system. That is, this computer gets hit very quickly when you are trying to copy a lot of data, download, and watch movies, which is disappointing. My old MacBook Pro from 2015 is still better than this piece of junk. Dear Apple, hire me and I can help you. I want to help you because clearly you cannot help yourself.",
      "rating": 1.0,
      "verified": true,
      "author": "Cognitivehero",
      "helpful_votes": 26,
      "publication_date": 20200705
    },
    {
      "title": "Apple never disappointed me!",
      "text": "As a long time Mac User, my old macbook is still holding up pretty well! I was expecting to upgrade to the rumored 14 inch Macbook Pro, but it did come. After window shopping a lot of PC Laptops, especially Dell XPS, I am still convinced making right choice buying this once I open the package. Apple still delivers the best quality product! PC vs. Mac? PC may seems offering better value, they are NOT stable, after 2 years usage, it would comes with millions of glitches. Mac = STABLE, No Hassle, functioning good for years!",
      "rating": 5.0,
      "verified": true,
      "author": "Bohan Liu",
      "helpful_votes": 12,
      "publication_date": 20200611
    },
    {
      "title": "Dead on arrival",
      "text": "Just received today and the screen would not stop flickering. Unfortunately it is unusable.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas M.",
      "helpful_votes": 14,
      "publication_date": 20200601
    },
    {
      "title": "First great macbook pro in a long time.",
      "text": "Really great laptop, the keyboard reminds me of my 2015 macbook pro 13”. While it is different, after a few minutes of typing, I can’t tell the difference anymore. I do not like the touch bar, full stop. I wish they would sell a model without it. I’m also disappointed to spend so much money and get an chipset that is several years old. However, in practice I never saw any performance issues. I did end up returning it and sticking with my old windows laptop. It turns out that I am actually just fine with my work laptop and an ipad.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan B.",
      "helpful_votes": 5,
      "publication_date": 20200726
    },
    {
      "title": "Touch Bar doesn’t show up!! Bad Attitude from Amazon Supporters",
      "text": "First unbox and boot up, touch bar doesn’t work. Contact Apple Support. Do anything they instructed, still doesn’t work. Reinstalled Mac OS, still doesn’t work. It’s very very bad experience with Apple so far Update: Poor service form AMZ, bad attitude. Cannot replace when I am not in US, . Have to send to get warranty even just boot up. Will move to Bestbuy or some other reseller in the future. SO DISAPPOINTED",
      "rating": 1.0,
      "verified": true,
      "author": "Nguyen Tien Dzung",
      "helpful_votes": 7,
      "publication_date": 20200810
    },
    {
      "title": "You can't copy and paste!!! CHEAP crap!",
      "text": "You can't copy and paste!!! CHEAP crap! Still full price! SO upset!",
      "rating": 1.0,
      "verified": true,
      "author": "Zoey",
      "helpful_votes": 9,
      "publication_date": 20200604
    },
    {
      "title": "Very disappointed with the Customer Service!!!",
      "text": "I bought this MacBook with 16 GB of Ram and it came with 8 GB only. After spent 2 hours in the phone with Amazon Customer Support it was not possible resolve the issue. I give 1 star for the Customer Service not for the Computer. Very disappointed with the Customer Service in this specific case.",
      "rating": 1.0,
      "verified": true,
      "author": "JUANKA95",
      "helpful_votes": 6,
      "publication_date": 20200820
    },
    {
      "title": "DO NOT GET MBP 13 2020 FOR ANY KIND OF VIDEO EDITING",
      "text": "I got the macbook 13 for the portability aspect bc ill be attending uni next fall. I mainly wanted it for simple video editing 1080p w some effects and photography. Unfortunately, there is some bug within the hardware and software between the mbp13 2020 and final cut pro x. It stutters after 5 mins of editing and it becomes impossible to edit the simplest of videos bc it keeps freezing. I decided to return it and just pay the extra for 16 in mbp 2019. DO NOT GET THE MBP 13 IF YOU WANT TO VIDEO EDIT. (besides that tho it performed as well as I intended it too for other task, hence the 2 stars)",
      "rating": 2.0,
      "verified": true,
      "author": "Zachary P",
      "helpful_votes": 6,
      "publication_date": 20200702
    },
    {
      "title": "MacBook is a scam",
      "text": "I will never buy a MacBook again. Says it’s upgradable to 32gb. ITS NOT!!!!! Furthermore the back doesn’t come off easily and it’s near impossible to put back on. Shouldn’t take two hours!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Carl Hagen",
      "helpful_votes": 8,
      "publication_date": 20200616
    },
    {
      "title": "BEST PURCHASE EVER!! HIGHLY RECOMMEND!",
      "text": "At first I was terrified to order the new MacBook Pro off of Amazon only because previously I had bought a MacBook Air from a different seller. However, I am so happy I went with this seller because not only did I get my package FAST but it's in perfect condition and everything is amazing!! If you're looking to treat yourself and are interested in buying this laptop, DO IT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 6,
      "publication_date": 20200723
    },
    {
      "title": "Battery life",
      "text": "I love this! Except battery life. I saw a description which says up to 10 hours, but it goes down to 40% after I use 2 hours. Plus body gets very hot. Can anyone give me any tips to avoid it happens?",
      "rating": 3.0,
      "verified": true,
      "author": "Nami ",
      "helpful_votes": 6,
      "publication_date": 20200624
    },
    {
      "title": "This is the best laptop 👨🏾‍💻",
      "text": "This is my first laptop ever and I’m in love with it I highly recommend this laptop 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Lijahh",
      "helpful_votes": 7,
      "publication_date": 20200604
    },
    {
      "title": "Great! But has 1 little annoying bug",
      "text": "I love this laptop! I used to work for Apple and have always gone with MacBook Airs because they're so lightweight and portable. The new MacBook Pros are just as light and thin as older versions of the MacBook Air. The ONLY thing I don't like about this laptop is that 1/10 when I open the laptop in the morning after it was \"sleeping\" overnight, the screen turns on but the mouse & keyboard don't work, therefore I cannot login/type my password. I have to force restart the laptop every time this happens.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernanda Mascarenhas",
      "helpful_votes": 2,
      "publication_date": 20200814
    },
    {
      "title": "Really wish I hadn't bought this",
      "text": "INCREDIBLY disappointed. The trackpad is complete garbage and doesn't click properly to the point it will click in the wrong spot or if you try to drag something, it will just drop it wherever it pleases; which has resulted in things being unintentionally dropped into shared folders. So a mouse is 100% required and that is irritating for a laptop that is so expensive. I bought it cuz my old macbook lasted years and worked great. But this one is trash.",
      "rating": 1.0,
      "verified": true,
      "author": "ChuckleBearPDX",
      "helpful_votes": 2,
      "publication_date": 20200929
    },
    {
      "title": "Love it- needs more ports but all good",
      "text": "Do you somebody. For 1199 it’s a pretty average price. Kind of disappointed that Mac couldn’t at least have thrown in an extra port or two but leave it to them to make you have to buy more adapters. Do you somebody. For 1199 it’s a pretty average price. Kind of disappointed that Mac couldn’t at least have thrown in an extra port or two but leave it to them to make you have to buy more adapters. I know it’s not a 16 inch which has more adapters but when you spend over a grand Mac should give you something. Not bad and I wish you could update the ram but it runs decent",
      "rating": 5.0,
      "verified": true,
      "author": "eve",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Macbook Pro 2020 - \"Like New\" - Highly recommended",
      "text": "I highly recommend you purchase the \"like new\" Macbook. The item came brand new in sealed packaging and was $60 less. I'd imagine at worst, someone ordered it and sent it back, but it was never used or even opened. Highly recommended at this price point for the strength of the machine. All you have to do is click \"more buying options\". I hope this helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Massare",
      "helpful_votes": 3,
      "publication_date": 20200703
    },
    {
      "title": "If you can’t wait til next year, this is a good buy.",
      "text": "Got 200 off with the amazon sale. Worth the price! If you can hold out till next year when the arm based MacBooks are out do that, if not this MacBook is still very powerful can last a good 5-7 years no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "TT Tum",
      "helpful_votes": 3,
      "publication_date": 20200712
    },
    {
      "title": "Love my new Macbook Pro",
      "text": "Love this little computer! It's super fast, intuitive, and lightweight. It's so easy to carry around compared to the PCs I've been using for years and years. Should have switched to Apple a long time ago. Sharp picture, vivid colors, love the touch bar just under the screen. I thought the transition from PC to Mac would be difficult but not at all. Glad I made the switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita L.",
      "helpful_votes": 3,
      "publication_date": 20200830
    },
    {
      "title": "Great Laptop",
      "text": "I got my new MacBook Pro yesterday and I am really happy with it. This is an upgrade from my old 2014 version. It was easy to set it up and to transfer all the information and documents from the old one. I haven’t had any issues so far. I ordered the 13 inch 16GB ram 516GB storage and that’s what I got Just be sure to buy a USB adapter for this model because the ports are not compatible.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen C.",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Perfect size, keyboard and performance",
      "text": "Switching from a 12-inch Macbook, I wasn't sure whether I could get used to the thickness and weight of a Macbook Pro. Now I see that the difference is minimal and it is worth the sacrifice for the sake of performance. As a developer, it is amazing to see how fast this laptop is when working with various IDEs and other tools. The keyboard and touch bar are great as well. The battery life is also not any worse than my previous 12-inch Macbook.",
      "rating": 5.0,
      "verified": true,
      "author": "Tarlan Ismayilsoy",
      "helpful_votes": 2,
      "publication_date": 20200719
    },
    {
      "title": "Crashes once a week and applications crashing regularly",
      "text": "I think I may have just gotten a bad one but my Laptop has been crashing regularly (freezes and reboots randomly). This isn't my experience in general with Apply products which have generally been very reliable. Also it runs waaay hotter than my previous (and now current after I return this) MBP 2015. Besides these things I generally like the laptop, new keyboard is great, speakers and mic are great, I just need something stable that works reliably and this just wasn't it.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian Rees",
      "helpful_votes": 2,
      "publication_date": 20200629
    },
    {
      "title": "PC to a Mac- BEST DECSION EVER",
      "text": "I made the switch from a PC to a Mac and I am so glad I decided to make the switch! I am obsessed with my new 13inch 2020 MacBook Pro. I compared prices with the Apple website and Amazon, and Amazon was $100 cheeper so I went this route. I was also really worried getting something shipped that was so expensive because I was afraid it would get damaged. There was nothing to be worried about because it was packaged great! If you are hesitant to make the purchase on Amazon don't be.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailee Bigley",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Apple Nailed it with this Mac!",
      "text": "I upgraded from Mac Book Pro 2012 to Mac Book Pro 2020, the difference is astonishing! the Sound is amazing, the screen resolution is at another level. I wasnt convinced with touch bar when it was introduced, but i can say the new mac book pro is worth its price!",
      "rating": 5.0,
      "verified": true,
      "author": "Samer Semaan",
      "helpful_votes": 3,
      "publication_date": 20200827
    },
    {
      "title": "Love my new MacBook!",
      "text": "I have had this macbook for a few days and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "~*~Minnie~*~",
      "helpful_votes": 3,
      "publication_date": 20200601
    },
    {
      "title": "Macbook pro rocks!!!",
      "text": "This is my first macbook or should I say my first apple product. I have never tested or tried out any apple product before not even in stores. So at the begining I was bit skeptical to transition from windows laptop to mac but I'm so gald I did. Everything about this macbook spreaks quality. The size, screen quality, keyboard, operating system, the softwares and overall performace are just what I was looking for as a software developer.",
      "rating": 5.0,
      "verified": true,
      "author": "Taposh Das",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Do not buy",
      "text": "Shut off after 1 day of use and never came back on. Had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Fairen",
      "helpful_votes": 3,
      "publication_date": 20200911
    },
    {
      "title": "10/10",
      "text": "I thought it was weird buying an Apple product from Amazon, but the macbook arrived in a brand new box, works perfectly, and has somehow become a part of my everyday life.",
      "rating": 5.0,
      "verified": true,
      "author": "Ether W.",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Literally no complaints.",
      "text": "My MacBook Pro arrived way sooner than expected and in excellent condition. I’m not an iPhone fan, but Macs are, without a doubt, exceptional computers.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "One of the best Mac I ever had!",
      "text": "Well, the change has been drastic compared to my previous Mac because of the Ram increased and the new quad-core processor, I'm very satisfied with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Goyeneche",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "The Battery Life and Fan Noise Are Iffy",
      "text": "Other than the short battery life and fan noise, the laptop is running fine. I really feel like I'm only getting a little over three hours on the battery, which is odd to me because I don't play games on the laptop, nor upload and download much. And sometimes, the fan noise is annoying. Doesn't last long, but long enough to annoy me. This laptop is supposedly brand new, so I guess I expected not to experience these issues until I've had the darn thing for a couple years. Not a MONTH!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Cam Montgomery Jr",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "I like it!",
      "text": "I had a 13.3“ macbook pro late 2012 but it recently stopped working. This one is a good replacement even though it’s definitely evolving technologically. It doesn’t have all the old ports like before but you can get an adapter for that. It also doesn’t have a built-in disc drive but you can also order a disc drive to plug in. So far I’m pretty pleased with it. I hope it can run all my games as well as be used for everyday use. The touch bar is a pretty cool upgrade. Very sleek & lightweight",
      "rating": 5.0,
      "verified": true,
      "author": "Cyn",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Worth every penny.",
      "text": "This is my favorite computer I’ve ever had I think that they did a great job everything is worth it the price everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenavieve",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Can’t complain it’s pretty awesome",
      "text": "While I don’t like that I have to get an adapter to use a usb with it, I am very happy with the product in general it is currently the nicest thing I own.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay Ersek",
      "helpful_votes": 2,
      "publication_date": 20200728
    },
    {
      "title": "Excellent laptop with great power.",
      "text": "Excellent laptop with very good speed. 1 TB SSD at this price is a deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiran",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Love it!",
      "text": "Love it, perfect for school work. Good battery life and brightness. Very light weight perfect for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Awful Shipping",
      "text": "This a major upgrade if your coming from Windows or Hp. I can’t wait to use this for college! I wish I had given it 5 stars but the Amazon driver was awful! He was delivering my package on Avenue B when my address clearly said North 66th St!!! My neighbors would not have given me my package but good thing I was looking out for it all day. Computer is great just not the driver that delivered my package.",
      "rating": 3.0,
      "verified": true,
      "author": "Mirssa",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great laptop.",
      "text": "I got this for my son who used it for music and video production. He is very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "John F. Weber",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Awesome MacBook Pro",
      "text": "Perfect 👌🏻 love my new computer. Have never had a MacBook. But it’s superb. 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Mariposa",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Much better than the last model",
      "text": "This product will take your child from High School into college.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Myers",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Good laptop!!!",
      "text": "So far so good! Works Well, shipment came quickly. I didn’t realize this one doesn’t have as many ports as my older Mac book pro so I ordered a little port adapter. So far I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "This was a gift.",
      "text": "I can’t really give a good review as this was a gift for my grandson and he is thrilled. I was very impressed with the speed and ease of use on the things he showed me.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Kendall",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Apple is the Best!",
      "text": "From the second you remove it from the \"classic\" Apple packaging, you will be impressed. Nothing more to say than it's as good, no actually much better than the other lap tops from Apple we have purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Global Transportation & Logistics",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Awesome!",
      "text": "Only took 3 days to arrive. Working great! Apple would not let me add Apple Care though.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Clark",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great Product from Apple",
      "text": "This is my 2nd MacBook Pro; my other is over 10 years old, hope this one lasts as long! Order came on date promised, easy-peezy set up, works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne DW",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Solid Reliable MacBook Pro",
      "text": "Be sure to get the model with 16GB of RAM. It is worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Williams",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "New, works well.",
      "text": "I found that this item was delivered on time, in great condition, and works well. I have no complaints about it so far, and it works well for my work and leisure time.",
      "rating": 4.0,
      "verified": true,
      "author": "Pixie",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "13 - inch Macbook Pro",
      "text": "Overall I am happy with this computer. Surprisingly the sound level is exceptionally good. The touch bar is a good feature. I wish it had a usb drive. That was disappointing. Other than that the look is good and compact.",
      "rating": 5.0,
      "verified": true,
      "author": "Dm",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Company delivered as promised",
      "text": "Delivered on time. Great MacBook Pro loaded(1 TB hard drive/16 gig RAM. Good price. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Heffron",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "compact and woks well with USB-C to USB adapters",
      "text": "only dislike is that it lacks a CD/DVD read/write drive",
      "rating": 5.0,
      "verified": true,
      "author": "AHG",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "It’s fantastic anyone will definitely fall in love with",
      "text": "I’m in love with my new Mac book very easy to use and set up. I Definitely recommend it great purchase that I did 👌😁",
      "rating": 5.0,
      "verified": true,
      "author": "Stella",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Know model number as buying a case will be hit or miss without it.",
      "text": "Love the size and speed of it. Does multitasking and Handel's running virtual machines very easily. Using it for OSCP and HACK THE BOX STUDIES",
      "rating": 5.0,
      "verified": true,
      "author": "Vernado Deal",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Performance Machine",
      "text": "Of course it’s great, cuz it’s a Mac! Hopefully it’ll hold up to its performance for a long while.",
      "rating": 5.0,
      "verified": true,
      "author": "Honor ",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great purchase!",
      "text": "So happy with this purchase. Came on time and has been everything I have needed in a laptop. Very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy ",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Worth the money",
      "text": "This is my first MacBook and I love it, I highly recommend this one, super-fast, the fans are noiseless and I love the new keyboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Henrique Novelo Vieira",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Love it!",
      "text": "Amazing laptop! Super fast and hopefully its good for college!",
      "rating": 5.0,
      "verified": true,
      "author": "Narsy",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Great product, love the performance and feel.",
      "text": "Product arrived as advertised. This is aN excellent computer. I ordered from Amazon as Apples shipping time was excessive.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "So small! I love it",
      "text": "Liked how tiny it is and can easily fit in my bag. I bought it to be able to edit videos myself and stop paying other people",
      "rating": 5.0,
      "verified": true,
      "author": "Noah",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Everything's great!",
      "text": "Love this MacBook! Everything was as expected, wonderful computer for developing and design, I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gonzalo N.",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Recommended!",
      "text": "I like this point so much, I can't put it down after using it, it is my favorite product! Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Pauli",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "useful for the work",
      "text": "good for me and very useful for my work, if needed, will buy it again",
      "rating": 4.0,
      "verified": true,
      "author": "dingziyun",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "It’s good for software programming",
      "text": "Multitasking is limited cannot really handle 5-6 applications open time.",
      "rating": 5.0,
      "verified": true,
      "author": "Necati Murat Yesil",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "It's a great computer",
      "text": "Other than the poor insufficient cooling system it's a great computer",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great laptop",
      "text": "This was a graduation gift for my son. He loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Donnell",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Same Macbook you have always loved",
      "text": "Wishing for a redesign still, but product is absolutely wonderful and has no issues other than design starting to appear outdated when compared to other laptops and also the lack of a touchscreen.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew B",
      "helpful_votes": 0,
      "publication_date": 20200714
    }
  ],
  "product_meta": {
    "title": "New Apple MacBook Pro (13-inch, 16GB RAM, 1TB SSD Storage, Magic Keyboard) - Silver",
    "rating": 4.7,
    "feature_bullets": [
      "Tenth-generation quad-core Intel Core i5 processor",
      "Brilliant Retina display with True Tone technology",
      "Backlit Magic Keyboard",
      "Touch Bar and Touch ID",
      "Intel Iris Plus Graphics",
      "Ultrafast SSD",
      "Four Thunderbolt 3 (USB-C) ports",
      "Up to 10 hours of battery life",
      "802.11ac Wi-Fi",
      "Force Touch trackpad"
    ],
    "specifications": {
      "Product Dimensions": "13.41 x 9.76 x 2.41 inches; 6.05 Pounds",
      "Item Weight": "6.04 pounds",
      "Manufacturer": "Apple Computer",
      "ASIN": "B08821611Y",
      "Item model number": "MWP82LL/A",
      "Batteries": "Lithium ion batteries required.",
      "Date First Available": "May 4, 2020"
    },
    "categories": [
      "Electronics"
    ],
    "price": 1799.99
  }
}